Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files__/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: _syscall - invoking a system call without library support (OBSOLETE)
ru: _syscall - выполняет системный вызов, который не поддерживается библиотекой (УСТАРЕЛ)

source: SYNOPSIS
ru: ОБЗОР

source: A _syscall macro
ru: Макрос _syscall

source: desired system call
ru: желаемый системный вызов

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The important thing to know about a system call is its prototype. You need to know how many arguments, their types, and the function return type. There are seven macros that make the actual call into the system easier. They have the form:
ru: При использовании системного вызова необходима информация о его прототипе. Вам нужно знать количество аргументов, их типы и тип возвращаемого значения. Есть несколько макросов, которые облегчают выполнение системных вызовов. Они имеют вид:

source: where
ru: где

source: I<X> is 0\(en6, which are the number of arguments taken by the system call
ru: I<X> 0\(en6, количество аргументов, принимаемых системным вызовом

source: I<type> is the return type of the system call
ru: I<type> \(em тип возвращаемого значения системного вызова

source: I<name> is the name of the system call
ru: I<name> \(em имя системного вызова

source: I<typeN> is the Nth argument's type
ru: I<typeN> \(em тип N-го аргумента

source: I<argN> is the name of the Nth argument
ru: I<argN> \(em имя N-го аргумента

source: These macros create a function called I<name> with the arguments you specify. Once you include the _syscall() in your source file, you call the system call by I<name>.
ru: Эти макросы создают функцию с именем I<name> и указанными аргументами. После добавления _syscall() в код, вы можете вызывать системный вызов по имени I<name>.

source: FILES
ru: ФАЙЛЫ

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: The use of these macros is Linux-specific, and deprecated.
ru: Эти макросы есть только в Linux и они устарели.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: Starting around kernel 2.6.18, the _syscall macros were removed from header files supplied to user space. Use B<syscall>(2) instead. (Some architectures, notably ia64, never provided the _syscall macros; on those architectures, B<syscall>(2) was always required.)
ru: Начиная, приблизительно, с ядра 2.6.18, макросы _syscall удалены из заголовочных файлов, используемых в пользовательском пространстве. Вместо них используйте B<syscall>(2). (Для некоторых архитектур, например ia64, макросы _syscall никогда не предоставлялись; на таких архитектурах всегда требуется макрос B<syscall>(2).)

source: The _syscall() macros I<do not> produce a prototype. You may have to create one, especially for C++ users.
ru: Макрос _syscall() I<не> создаёт прототип. Вам, вероятно, придётся создавать его самостоятельно, особенно пользователям C++.

source: System calls are not required to return only positive or negative error codes. You need to read the source to be sure how it will return errors. Usually, it is the negative of a standard error code, for example, -I<EPERM>. The _syscall() macros will return the result I<r> of the system call when I<r> is nonnegative, but will return -1 and set the variable I<errno> to -I<r> when I<r> is negative. For the error codes, see B<errno>(3).
ru: Для системных вызовов не требуется возвращать только положительный или отрицательный код ошибки. Вам нужно прочитать исходный код, чтобы выяснить как возвращаются ошибки. Обычно, это отрицательный стандартный код ошибки, например, -I<EPERM>. Макрос _syscall() возвращает результат I<r> из системного вызова, если I<r> неотрицательно, но вернёт -1 и установит значение I<errno> равное -I<r>, когда I<r> отрицательно. Коды ошибок смотрите в B<errno>(3).

source: When defining a system call, the argument types I<must> be passed by-value or by-pointer (for aggregates like structs).
ru: При определении системного вызова типы аргументов I<должны> передаваться по значению или по ссылке (для составных типов, например структур).

source: EXAMPLE
ru: ПРИМЕР

source: #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>errno.hE<gt> #include E<lt>linux/unistd.hE<gt> /* for _syscallX macros/related stuff */ #include E<lt>linux/kernel.hE<gt> /* for struct sysinfo */
ru: #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>errno.hE<gt> #include E<lt>linux/unistd.hE<gt> /* поддержка _syscallX */ #include E<lt>linux/kernel.hE<gt> /* struct sysinfo */

source: Sample output
ru: Результат работы примера

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: _exit, _Exit - terminate the calling process
ru: _exit, _Exit - завершает вызывающий процесс

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: The function B<_exit>() terminates the calling process "immediately". Any open file descriptors belonging to the process are closed. Any children of the process are inherited by B<init>(1) (or by the nearest "subreaper" process as defined through the use of the B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> operation). The process's parent is sent a B<SIGCHLD> signal.
ru: Функция B<_exit>() «безотлагательно» завершает вызывающий процесс. Все открытые дескрипторы файлов, принадлежащие процессу, закрываются. Все его дочерние процессы наследуются B<init>(1) (или ближайшим «собирающим» процессом, определённым вызовом B<prctl>(2) с операцией B<PR_SET_CHILD_SUBREAPER>).Родительскому процессу посылается сигнал B<SIGCHLD>.

source: The value I<status & 0377> is returned to the parent process as the process's exit status, and can be collected using one of the B<wait>(2) family of calls.
ru: Значение I<status & 0377> возвращается родительскому процессу как код завершаемого процесса; он может быть получен с помощью одной из функций семейства B<wait>(2).

source: The function B<_Exit>() is equivalent to B<_exit>().
ru: Функция B<_Exit>() эквивалентна B<_exit>().

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: These functions do not return.
ru: Эти функции не выполняют возврат.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. The function B<_Exit>() was introduced by C99.
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. Функция B<_Exit>() была представлена в C99.

source: For a discussion on the effects of an exit, the transmission of exit status, zombie processes, signals sent, and so on, see B<exit>(3).
ru: Обсуждение эффектов при завершении работы, передачу кода выхода, зомби-процессы, сигналы и т. п., смотрите в B<exit>(3).

source: The function B<_exit>() is like B<exit>(3), but does not call any functions registered with B<atexit>(3) or B<on_exit>(3). Open B<stdio>(3) streams are not flushed. On the other hand, B<_exit>() does close open file descriptors, and this may cause an unknown delay, waiting for pending output to finish. If the delay is undesired, it may be useful to call functions like B<tcflush>(3) before calling B<_exit>(). Whether any pending I/O is canceled, and which pending I/O may be canceled upon B<_exit>(), is implementation-dependent.
ru: Функция B<_exit>() подобна B<exit>(3), но не вызывает никаких функций, зарегистрированных с помощью B<atexit>(3) или B<on_exit>(3). Открытые потоки посредством B<stdio>(3) не сбрасываются. С другой стороны, B<_exit>() закрывает открытые дескрипторы файлов, а это может привести к неопределенной задержке, так как происходит ожидание завершения вывода данных. Если задержка нежелательна, то может быть полезным перед вызовом B<_exit>() вызывать функцию типа B<tcflush>(3). Будет ли отмена ожидания ввод-вывода, а также какие именно ожидающие операции ввода-вывода будут завершены при вызове B<_exit>, зависит от реализации.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: In glibc up to version 2.3, the B<_exit>() wrapper function invoked the kernel system call of the same name. Since glibc 2.3, the wrapper function invokes B<exit_group>(2), in order to terminate all of the threads in a process.
ru: В glibc до версии 2.3, обёрточная функция B<_exit>() вызывала системный вызов ядра с тем же именем. Начиная с glibc 2.3, обёрточная функция вызывает B<exit_group>(2), чтобы завершить все нити процесса.

source: GNU C Library
ru: Библиотека GNU C

source: Linux Programmer'sManual
ru: Руководство программиста Linux

source: __ppc_yield, __ppc_mdoio, __ppc_mdoom - Hint the processor to release shared resources
ru: __ppc_yield, __ppc_mdoio, __ppc_mdoom - подсказать процессору освободить общие ресурсы

source: These functions provide hints about the usage of resources that are shared with other processors on the Power architecture. They can be used, for example, if a program waiting on a lock intends to divert the shared resources to be used by other processors.
ru: Эти функции для архитектуры Power предоставляют подсказки об использовании ресурсов, которые совместно используются несколькими процессорами. Например, эти функции можно использовать, если программа, ожидающая блокировку, намеревается отказаться от совместно используемых ресурсов, чтобы они использовались другими процессорами.

source: B<__ppc_yield>() provides a hint that performance will probably be improved if shared resources dedicated to the executing processor are released for use by other processors.
ru: Функция B<__ppc_yield>() даёт подсказку, что производительность будет, вероятно, улучшена, если совместно используемые ресурсы, выделенные выполняющему процессору, высвободить для использования другими процессорами.

source: B<__ppc_mdoio>() provides a hint that performance will probably be improved if shared resources dedicated to the executing processor are released until all outstanding storage accesses to caching-inhibited storage have been completed.
ru: Функция B<__ppc_mdoio>() даёт подсказку, что производительность будет, вероятно, улучшена, если совместно используемые ресурсы, выделенные выполняющему процессору, высвободить, пока не завершится отложенный доступ к хранилищу с запрещённым кэшем (caching-inhibited storage).

source: B<__ppc_mdoom>() provides a hint that performance will probably be improved if shared resources dedicated to the executing processor are released until all outstanding storage accesses to cacheable storage for which the data is not in the cache have been completed.
ru: Функция B<__ppc_mdoom>() даёт подсказку, что производительность будет, вероятно, улучшена, если совместно используемые ресурсы, выделенные выполняющему процессору, высвободить, пока не завершится отложенный доступ к данным кэшированного хранилища, которых не в кэше.

source: VERSIONS
ru: ВЕРСИИ

source: These functions first appeared in glibc in version 2.18.
ru: Эти функции впервые появились в glibc 2.18.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: These functions are nonstandard GNU extensions.
ru: Эти функции являются расширениями GNU.

source: LinuxProgrammer's Manual
ru: Руководство пользователя Linux

source: __ppc_set_ppr_med, __ppc_set_ppr_very_low, __ppc_set_ppr_low, __ppc_set_ppr_med_low, __ppc_set_ppr_med_high - Set the Program Priority Register
ru: __ppc_set_ppr_med, __ppc_set_ppr_very_low, __ppc_set_ppr_low, __ppc_set_ppr_med_low, __ppc_set_ppr_med_high - изменяет регистр приоритета программы

source: These functions provide access to the I<Program Priority Register> (PPR) on the Power architecture.
ru: Эти функции предоставляют доступ к I<Program Priority Register> (PPR, регистру приоритета программы) архитектуры Power.

source: The PPR is a 64-bit register that controls the program's priority. By adjusting the PPR value the programmer may improve system throughput by causing system resources to be used more efficiently, especially in contention situations. The available unprivileged states are covered by the following functions:
ru: PPR — это 64-битный регистр, которой управляет приоритетом программы. Изменяя значение PPR, программист может улучшить системную производительность, сделав использование системных ресурсов более эффективным, особенно в ситуациях конкурентного доступа. Доступные непривилегированные состояния достигаются следующими функциями:

source: B<__ppc_set_ppr_med>() sets the Program Priority Register value to I<medium> (default).
ru: Функция B<__ppc_set_ppr_med>() устанавливает регистр приоритета программы равным I<среднему> значению (по умолчанию).

source: B<__ppc_set_ppr_very_low>() sets the Program Priority Register value to I<very low>.
ru: Функция B<__ppc_set_ppr_very_low>() устанавливает регистр приоритета программы равным I<очень низкому> значению.

source: B<__ppc_set_ppr_low>() sets the Program Priority Register value to I<low>.
ru: Функция B<__ppc_set_ppr_low>() устанавливает регистр приоритета программы равным I<низкому> значению.

source: B<__ppc_set_ppr_med_low>() sets the Program Priority Register value to I<medium low>.
ru: Функция B<__ppc_set_ppr_med_low>() устанавливает регистр приоритета программы равным значению I<ниже среднего>.

source: The privileged state I<medium high> may also be set during certain time intervals by problem-state (unprivileged) programs, with the following function:
ru: Привилегированное состояние I<выше среднего> также может быть установлено на определённые временные интервалы (непривилегированными) программами в режиме задачи (problem-state) следующей функцией:

source: B<__ppc_set_ppr_med_high>() sets the Program Priority to I<medium high>.
ru: Функция B<__ppc_set_ppr_med_high>() устанавливает регистр приоритета программы равным значению I<выше среднего>.

source: If the program priority is medium high when the time interval expires or if an attempt is made to set the priority to medium high when it is not allowed, the priority is set to medium.
ru: Если приоритет программы выше среднего и истёк временной интервал или если выполняется попытка назначить приоритет выше среднего в неразрешённый момент, то приоритет устанавливается в среднее значение.

source: The functions B<__ppc_set_ppr_med>(), B<__ppc_set_ppr_low>() and B<__ppc_set_ppr_med_low>() are provided by glibc since version 2.18. The functions B<__ppc_set_ppr_very_low>() and B<__ppc_set_ppr_med_high>() first appeared in glibc in version 2.23.
ru: Функции B<__ppc_set_ppr_med>(), B<__ppc_set_ppr_low>() и B<__ppc_set_ppr_med_low>() имеются в glibc начиная с версии 2.18. Функции B<__ppc_set_ppr_very_low>() и B<__ppc_set_ppr_med_high>() впервые появились в glibc в версии 2.23.

source: The functions B<__ppc_set_ppr_very_low>() and B<__ppc_set_ppr_med_high>() will be defined by I<E<lt>sys/platform/ppc.hE<gt>> if B<_ARCH_PWR8> is defined. Availability of these functions can be tested using B<#ifdef _ARCH_PWR8>.
ru: Функции B<__ppc_set_ppr_very_low>() и B<__ppc_set_ppr_med_high>() будут определены из I<E<lt>sys/platform/ppc.hE<gt>>, если определён B<_ARCH_PWR8>. Доступность этих функций можно проверить с помощью B<#ifdef _ARCH_PWR8>.

source: __ppc_get_timebase, __ppc_get_timebase_freq - get the current value of the Time Base Register on Power architecture and its frequency.
ru: __ppc_get_timebase, __ppc_get_timebase_freq - возвращают текущее значение базового регистра времени на архитектуре Power и его частоту

source: B<__ppc_get_timebase>() reads the current value of the Time Base Register and returns its value, while B<__ppc_get_timebase_freq>() returns the frequency in which the Time Base Register is updated.
ru: Функция B<__ppc_get_timebase>() читает текущее значение базового регистра времени (Time Base Register) и возвращает его значение, а B<__ppc_get_timebase_freq>() возвращает частоту обновления базового регистра времени.

source: The Time Base Register is a 64-bit register provided by Power Architecture processors. It stores a monotonically incremented value that is updated at a system-dependent frequency that may be different from the processor frequency.
ru: Базовый регистр времени — это 64-битный регистр процессоров с архитектурой Power. В нём хранится монотонно увеличивающееся значение, которое обновляется с зависимой от системы частотой, которая может отличаться от частоты процессора.

source: B<__ppc_get_timebase>() returns a 64-bit unsigned integer that represents the current value of the Time Base Register.
ru: Функция B<__ppc_get_timebase>() возвращает 64-битное беззнаковое целое, которое представляет собой текущее значение базового регистра времени.

source: B<__ppc_get_timebase_freq>() returns a 64-bit unsigned integer that represents the frequency at which the Time Base Register is updated.
ru: Функция B<__ppc_get_timebase_freq>() возвращает 64-битное беззнаковое целое, которое представляет собой частоту, с которой изменяется базовый регистр времени.

source: GNU C Library support for B<__ppc_get_timebase>() has been provided since version 2.16 and B<__ppc_get_timebase_freq>() has been available since version 2.17.
ru: Поддержка B<__ppc_get_timebase>() в библиотеку GNU C было добавлена в версию 2.16, а B<__ppc_get_timebase_freq>() доступна начиная с версии 2.17.

source: Both functions are nonstandard GNU extensions.
ru: Эти функции являются расширениями GNU.

source: The following program will calculate the time, in microseconds, spent between two calls to B<__ppc_get_timebase>().
ru: Следующая программа вычисляет время в микросекундах, прошедшее между двумя вызовами B<__ppc_get_timebase>().

source: Program source
ru: Исходный код программы

source: /* Maximum value of the Time Base Register: 2^60 - 1. Source: POWER ISA. */ #define MAX_TB 0xFFFFFFFFFFFFFFF
ru: /* максимальное значение базового регистра времени: 2^60 - 1. Источник: POWER ISA. */ #define MAX_TB 0xFFFFFFFFFFFFFFF

source: uint64_t freq = __ppc_get_timebase_freq(); printf("Time Base frequency = %"PRIu64" Hz\en", freq);
ru: uint64_t freq = __ppc_get_timebase_freq(); printf("Базовая частота времени = %"PRIu64" Hz\en", freq);

source: // Do some stuff...
ru: // что-то делаем…

source: if (tb2 E<gt> tb1) { diff = tb2 - tb1; } else { /* Treat Time Base Register overflow. */ diff = (MAX_TB - tb2) + tb1; }
ru: if (tb2 E<gt> tb1) { diff = tb2 - tb1; } else { /* базовый регистр времени переполнился */ diff = (MAX_TB - tb2) + tb1; }

source: printf("Elapsed time = %1.2f usecs\en", (double) diff * 1000000 / freq );
ru: printf("Прошло = %1.2f мкс\en", (double) diff * 1000000 / freq );

source: __setfpucw - set FPU control word on i386 architecture (obsolete)
ru: __setfpucw - устанавливает слово управления FPU для архитектуры i386 (устарела)

source: B<__setfpucw>() transfers I<control_word> to the registers of the FPU (floating-point unit) on the i386 architecture. This was used to control floating-point precision, rounding and floating-point exceptions.
ru: В архитектуре i386 функция B<__setfpucw>() пересылает I<control_word> в регистр FPU (модуль обработки операций с плавающей точкой). Используется для управления точностью, округлением и исключениями при операциях с плавающей точкой.

source: This function was a nonstandard GNU extension.
ru: Эта функция является нестандартным расширением GNU.

source: As of glibc 2.1 this function does not exist anymore. There are new functions from C99, with prototypes in I<E<lt>fenv.hE<gt>>, to control FPU rounding modes, like B<fegetround>(3), B<fesetround>(3), and the floating-point environment, like B<fegetenv>(3), B<feholdexcept>(3), B<fesetenv>(3), B<feupdateenv>(3), and FPU exception handling, like B<feclearexcept>(3), B<fegetexceptflag>(3), B<feraiseexcept>(3), B<fesetexceptflag>(3), and B<fetestexcept>(3).
ru: Начиная с glibc 2.1 эта функция не существует. Для управления режимами округления FPU в ISO C99 введены новые функции (прототипы объявлены в I<E<lt>fenv.hE<gt>>): B<fegetround>(3), B<fesetround>(3), окружением при работе с плавающей точкой: B<fegetenv>(3), B<feholdexcept>(3), B<fesetenv>(3), B<feupdateenv>(3) и для управления исключениями FPU: B<feclearexcept>(3), B<fegetexceptflag>(3), B<feraiseexcept>(3), B<fesetexceptflag>(3) и B<fetestexcept>(3).

source: If direct access to the FPU control word is still needed, the B<_FPU_GETCW> and B<_FPU_SETCW> macros from I<E<lt>fpu_control.hE<gt>> can be used.
ru: Если по какой-то причине необходим прямой доступ к слову управления FPU, то можно использовать макросы B<_FPU_GETCW> и B<_FPU_SETCW> из I<E<lt>fpu_control.hE<gt>>.

source: Set FPU control word on the i386 architecture to
ru: Устанавливает слово управления FPU на архитектуре i386:

source: - extended precision
ru: - включает расширенную точность

source: - rounding to nearest
ru: - включает округление к ближайшему

source: - exceptions on overflow, zero divide and NaN
ru: - включает исключение при переполнении, делении на ноль и NaN
