Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: As with B<PERF_RECORD_SWITCH> this record indicates a context switch has happened, but it only occurs when sampling in CPU-wide mode and provides additional information on the process being switched to/from. The B<PERF_RECORD_MISC_SWITCH_OUT> bit in the I<misc> field indicates whether it was a context switch into or away from the current process.
ru: Как и у B<PERF_RECORD_SWITCH> данная запись показывает, что произошло переключение контекста, но это случается только при измерении в режиме CPU-wide и предоставляет дополнительную информацию о направлении переключения контекста в/из. Бит B<PERF_RECORD_MISC_SWITCH_OUT> в поле I<misc> показывает направление переключения контекста: в или из текущего процесса.

source: The process ID of the previous (if switching in) or next (if switching out) process on the CPU.
ru: Идентификатор процесса предыдущего (если переключается в) или следующего (если переключается из) процесса ЦП.

source: The thread ID of the previous (if switching in) or next (if switching out) thread on the CPU.
ru: Идентификатор нити предыдущей (если переключается в) или следующей (если переключается из) нити ЦП.

source: Overflow handling
ru: Обработка переполнения

source: Events can be set to notify when a threshold is crossed, indicating an overflow. Overflow conditions can be captured by monitoring the event file descriptor with B<poll>(2), B<select>(2), or B<epoll>(7). Alternatively, the overflow events can be captured via sa signal handler, by enabling I/O signaling on the file descriptor; see the discussion of the B<F_SETOWN> and B<F_SETSIG> operations in B<fcntl>(2).
ru: Можно задать события, которые будут уведомлять о прохождении порога, указывающие на переполнение. Состояние переполнения можно перехватить, проследив за файловым дескриптором событий с помощью B<poll>(2), B<select>(2) или B<epoll>(7). Или же события переполнения можно перехватить через обработчик сигнала, включив ввод-вывод сигналов о файловом дескрипторе; смотрите описание операций B<F_SETOWN> и B<F_SETSIG> в B<fcntl>(2).

source: Overflows are generated only by sampling events (I<sample_period> must have a nonzero value).
ru: Переполнения генерируются только подсчитывающими событиями (значение I<sample_period> должно быть ненулевым).

source: There are two ways to generate overflow notifications.
ru: Существует два способа генерации уведомлений о переполнении.

source: The first is to set a I<wakeup_events> or I<wakeup_watermark> value that will trigger if a certain number of samples or bytes have been written to the mmap ring buffer. In this case, B<POLL_IN> is indicated.
ru: Первый: задать значение I<wakeup_events> или I<wakeup_watermark>, которые будут срабатывать после записи определённого количества образцов или байт кольцевой буфер mmap. В этом случае признаком служит B<POLL_IN>.

source: The other way is by use of the B<PERF_EVENT_IOC_REFRESH> ioctl. This ioctl adds to a counter that decrements each time the event overflows. When nonzero, B<POLL_IN> is indicated, but once the counter reaches 0 B<POLL_HUP> is indicated and the underlying event is disabled.
ru: Второй: использовать ioctl B<PERF_EVENT_IOC_REFRESH>. Данный ioctl добавляется к счётчику, который уменьшается каждый раз при наступлении события переполнения. Если значение не равно 0, то признаком служит B<POLL_IN>, то после того, как счётчик достигнет 0, признаком становится B<POLL_HUP> и определяющее событие отключается.

source: Refreshing an event group leader refreshes all siblings and refreshing with a parameter of 0 currently enables infinite refreshes; these behaviors are unsupported and should not be relied on.
ru: Актуализация лидера группы событий, обновляет всех его потомков, а актуализация с параметром 0 в настоящее время включает бесконечную актуализацию; такое поведение не поддерживается и на него нельзя полагаться.

source: Starting with Linux 3.18, B<POLL_HUP> is indicated if the event being monitored is attached to a different process and that process exits.
ru: Начиная с Linux 3.18, признак B<POLL_HUP> учитывается, если отслеживаемое событие присоединено к другому процессу и этот процесс существует.

source: rdpmc instruction
ru: Инструкция rdpmc

source: Starting with Linux 3.4 on x86, you can use the I<rdpmc> instruction to get low-latency reads without having to enter the kernel. Note that using I<rdpmc> is not necessarily faster than other methods for reading event values.
ru: Начиная с Linux 3.4 на x86, вы можете использовать инструкцию I<rdpmc> для выполнения чтения с низкой задержкой без входа в ядро. Заметим, что использование I<rdpmc> необязательно быстрее других способов чтения значений события.

source: Support for this can be detected with the I<cap_usr_rdpmc> field in the mmap page; documentation on how to calculate event values can be found in that section.
ru: Возможность использования этого можно определить по полю I<cap_usr_rdpmc> страницы mmap; документацию по вычислению событий значения можно найти в этом разделе.

source: Originally, when rdpmc support was enabled, any process (not just ones with an active perf event) could use the rdpmc instruction to access the counters. Starting with Linux 4.0, rdpmc support is only allowed if an event is currently enabled in a process's context. To restore the old behavior, write the value 2 to I</sys/devices/cpu/rdpmc>.
ru: Сначала, когда поддержка rdpmc была только включена, любой процесс (не только с активным событием perf) мог использовать инструкцию rdpmc для доступа к счётчикам. Начиная с Linux 4.0 поддержка rdpmc разрешена только, если событие в данный момент включено в контексте процесса. Для возвращению к старому поведению запишите значение 2 в I</sys/devices/cpu/rdpmc>.

source: perf_event ioctl calls
ru: Вызовы ioctl perf_event

source: Various ioctls act on B<perf_event_open>() file descriptors:
ru: К файловым дескрипторам B<perf_event_open>() допускаются различные вызовы ioctl:

source: This enables the individual event or event group specified by the file descriptor argument.
ru: Включает событие или группу событий, указанное в аргументе файлового дескриптора.

source: If the B<PERF_IOC_FLAG_GROUP> bit is set in the ioctl argument, then all events in a group are enabled, even if the event specified is not the group leader (but see BUGS).
ru: Если в аргументе ioctl установлен бит B<PERF_IOC_FLAG_GROUP>, то включаются все события в группе, даже если указанное событие не лидер группы (но смотрите ДЕФЕКТЫ).

source: This disables the individual counter or event group specified by the file descriptor argument.
ru: Отключает определённый счётчик или группу событий, указанный в аргументе файлового дескриптора.

source: Enabling or disabling the leader of a group enables or disables the entire group; that is, while the group leader is disabled, none of the counters in the group will count. Enabling or disabling a member of a group other than the leader affects only that counter; disabling a non-leader stops that counter from counting but doesn't affect any other counter.
ru: Включение или отключение лидера группы включает или выключает всю группу; то есть пока отключён лидер группы, не считается ни один из счётчиков. Включение или выключение члена группы (не лидера) влияет только на этот счётчик; выключение не лидера останавливает его счётчик и не влияет на другие счётчики.

source: If the B<PERF_IOC_FLAG_GROUP> bit is set in the ioctl argument, then all events in a group are disabled, even if the event specified is not the group leader (but see BUGS).
ru: Если в аргументе ioctl установлен бит B<PERF_IOC_FLAG_GROUP>, то выключаются все события в группе, даже если указанное событие не лидер группы (но смотрите ДЕФЕКТЫ).

source: Non-inherited overflow counters can use this to enable a counter for a number of overflows specified by the argument, after which it is disabled. Subsequent calls of this ioctl add the argument value to the current count. An overflow notification with B<POLL_IN> set will happen on each overflow until the count reaches 0; when that happens a notification with B<POLL_HUP> set is sent and the event is disabled. Using an argument of 0 is considered undefined behavior.
ru: Не унаследованные счётчики переполнения могут использовать это для установки счётчика количества переполнений, после чего он выключается (значение задаётся в аргументе). Последующие вызовы этого ioctl добавляют значение аргумента в текущий счётчик. При каждом переполнении будет возникать уведомление о переполнении с установленным B<POLL_IN> пока счётчик не достигнет 0; когда это произойдёт, посылается уведомление с установленным B<POLL_HUP> и событие выключается. Для значения 0 в аргументе поведение не определено.

source: Reset the event count specified by the file descriptor argument to zero. This resets only the counts; there is no way to reset the multiplexing I<time_enabled> or I<time_running> values.
ru: Сбрасывает (в ноль) счётчик событий, указанный в аргументе файлового дескриптора. Сбрасывается только счётчики; невозможно обнулить мультиплексирующее значение I<time_enabled> или I<time_running>.

source: If the B<PERF_IOC_FLAG_GROUP> bit is set in the ioctl argument, then all events in a group are reset, even if the event specified is not the group leader (but see BUGS).
ru: Если в аргументе ioctl установлен бит B<PERF_IOC_FLAG_GROUP>, то сбрасываются все события в группе, даже если указанное событие не лидер группы (но смотрите ДЕФЕКТЫ).

source: This updates the overflow period for the event.
ru: Обновляет период переполнения события.

source: Since Linux 3.7 (on ARM) and Linux 3.14 (all other architectures), the new period takes effect immediately. On older kernels, the new period did not take effect until after the next overflow.
ru: Начиная с Linux 3.7 (на ARM) и Linux 3.14 (на всех остальных архитектурах), новый период начинает действовать немедленно. В старых ядрах новый период не работает пока не возникнет следующее переполнение.

source: The argument is a pointer to a 64-bit value containing the desired new period.
ru: Аргумент представляет собой указатель на 64-битное значение, содержащее желаемый новый период.

source: Prior to Linux 2.6.36, this ioctl always failed due to a bug in the kernel.
ru: До Linux 2.6.36 данный ioctl всегда завершался с ошибкой из-за дефекта в ядре.

source: This tells the kernel to report event notifications to the specified file descriptor rather than the default one. The file descriptors must all be on the same CPU.
ru: Указывает ядру посылать уведомляющие события в указанный файловый дескриптор, не в умолчательный. Все файловые дескрипторы должны быть на одном ЦП.

source: The argument specifies the desired file descriptor, or -1 if output should be ignored.
ru: В аргументе указывается желаемый файловый дескриптор или -1, если вывод нужно игнорировать.

source: B<PERF_EVENT_IOC_SET_FILTER> (since Linux 2.6.33)
ru: B<PERF_EVENT_IOC_SET_FILTER> (начиная с Linux 2.6.33)

source: This adds an ftrace filter to this event.
ru: Добавить фильтр ftrace в это событие.

source: The argument is a pointer to the desired ftrace filter.
ru: В аргументе указывается указатель на желаемый фильтр ftrace.

source: B<PERF_EVENT_IOC_ID> (since Linux 3.12)
ru: B<PERF_EVENT_IOC_ID> (начиная с Linux 3.12)

source: This returns the event ID value for the given event file descriptor.
ru: Возвращает значение идентификатора события для заданного файлового дескриптора события.

source: The argument is a pointer to a 64-bit unsigned integer to hold the result.
ru: Аргументом является указатель на 64-битное беззнаковое целое число, в которое будет сохранён результат.

source: B<PERF_EVENT_IOC_SET_BPF> (since Linux 4.1)
ru: B<PERF_EVENT_IOC_SET_BPF> (начиная с Linux 4.1)

source: This allows attaching a Berkeley Packet Filter (BPF) program to an existing kprobe tracepoint event. You need B<CAP_SYS_ADMIN> privileges to use this ioctl.
ru: Позволяет присоединить программу Berkeley Packet Filter (BPF) к существующему событию точки трассировки kprobe. Для этого ioctl требуется мандат B<CAP_SYS_ADMIN>.

source: The argument is a BPF program file descriptor that was created by a previous B<bpf>(2) system call.
ru: Аргументом является файловый дескриптор программы BPF, который был создан ранее системным вызовом B<bpf>(2).

source: B<PERF_EVENT_IOC_PAUSE_OUTPUT> (since Linux 4.7)
ru: B<PERF_EVENT_IOC_PAUSE_OUTPUT> (начиная с Linux 4.7)

source: This allows pausing and resuming the event's ring-buffer. A paused ring-buffer does not prevent generation of samples, but simply discards them. The discarded samples are considered lost, and cause a B<PERF_RECORD_LOST> sample to be generated when possible. An overflow signal may still be triggered by the discarded sample even though the ring-buffer remains empty.
ru: Позволяет приостанавливать и возобновлять работу кольцевого буфера событий. Приостановленный кольцевой буфер не останавливает генерацию измерений, а просто отбрасывает их. Отброшенные измерения считаются пропавшими и генерируется, если возможно, измерение B<PERF_RECORD_LOST>. Сигнал переполнения по-прежнему может возникнуть из-за отброшенного измерения, даже при пустом кольцевом буфере.

source: The argument is an unsigned 32-bit integer. A nonzero value pauses the ring-buffer, while a zero value resumes the ring-buffer.
ru: Аргументом является беззнаковое 32-битное целое. Ненулевое значение приостанавливает кольцевой буфер, а нулевое — возобновляет работу кольцевого буфера.

source: B<PERF_EVENT_MODIFY_ATTRIBUTES> (since Linux 4.17)
ru: B<PERF_EVENT_MODIFY_ATTRIBUTES> (начиная с Linux 4.17)

source: This allows modifying an existing event without the overhead of closing and reopening a new event. Currently this is supported only for breakpoint events.
ru: Позволяет изменить существующее событие без накладных расходов на закрытие и повторное открытие нового события. В настоящее время поддерживается только для событий точек останова (breakpoint).

source: The argument is a pointer to a I<perf_event_attr> structure containing the updated event settings.
ru: В аргументе содержится указатель на структуру I<perf_event_attr> с обновлёнными данными события.

source: B<PERF_EVENT_IOC_QUERY_BPF> (since Linux 4.16)
ru: B<PERF_EVENT_IOC_QUERY_BPF> (начиная с Linux 4.16)

source: This allows querying which Berkeley Packet Filter (BPF) programs are attached to an existing kprobe tracepoint. You can only attach one BPF program per event, but you can have multiple events attached to a tracepoint. Querying this value on one tracepoint event returns the id of all BPF programs in all events attached to the tracepoint. You need B<CAP_SYS_ADMIN> privileges to use this ioctl.
ru: Позволяет запросить какие программы Berkeley Packet Filter (BPF) присоединены к существующей точке трассировки kprobe. Вы можете присоединить только одну программу BPF на событие, но можно присоединить несколько событий к точке трассировки. При опросе этого значения для события точки трассировки возвращается идентификатор всех программ BPF во всех событиях, присоединённых к точке трассировки. Для использования этого ioctl нужно иметь права B<CAP_SYS_ADMIN>.

source: The argument is a pointer to a structure
ru: В аргументе содержится указатель на структуру

source: The I<ids_len> field indicates the number of ids that can fit in the provided I<ids> array. The I<prog_cnt> value is filled in by the kernel with the number of attached BPF programs. The I<ids> array is filled with the id of each attached BPF program. If there are more programs than will fit in the array, then the kernel will return B<ENOSPC> and I<ids_len> will indicate the number of program IDs that were successfully copied.
ru: Значение поля I<ids_len> показывает сколько идентификаторов могут поместиться в массив I<ids>. Значение I<prog_cnt> заполняется ядром и показывает количество присоединённых программ BPF. Массив I<ids> заполняется идентификаторами каждой присоединённой программы BPF. Если имеет больше программ, чем влезает в массив, то ядро вернёт B<ENOSPC> и I<ids_len> укажет количество идентификаторов программ, которые были успешно скопированы.

source: Using prctl(2)
ru: Использование prctl(2)

source: A process can enable or disable all currently open event groups using the B<prctl>(2) B<PR_TASK_PERF_EVENTS_ENABLE> and B<PR_TASK_PERF_EVENTS_DISABLE> operations. This applies only to events created locally by the calling process. This does not apply to events created by other processes attached to the calling process or inherited events from a parent process. Only group leaders are enabled and disabled, not any other members of the groups.
ru: Процесс может включить или выключить все группы, в данный момент, открытых событий (с помощью операций B<prctl>(2) B<PR_TASK_PERF_EVENTS_ENABLE> и B<PR_TASK_PERF_EVENTS_DISABLE>). Это применимо только к событиям созданным локально вызывающим процессом. Это не применимо к событиям, созданным другими процессами, присоединёнными к вызывающему процессу, или к унаследованным от родительского процесса событиям. При этом включаются или выключаются только лидеры групп, а не члены групп.

source: perf_event related configuration files
ru: Файлы настройки perf_event

source: Files in I</proc/sys/kernel/>
ru: Файлы в I</proc/sys/kernel/>

source: The I<perf_event_paranoid> file can be set to restrict access to the performance counters.
ru: Файл I<perf_event_paranoid> можно использовать для ограничения доступа к счётчикам производительности.

source: allow only user-space measurements (default since Linux 4.6).
ru: разрешить только измерения пользовательского пространства (по умолчанию начиная с Linux 4.6).

source: allow both kernel and user measurements (default before Linux 4.6).
ru: разрешить измерения ядра и пользовательского пространства (по умолчанию начиная с Linux 4.6).

source: allow access to CPU-specific data but not raw tracepoint samples.
ru: разрешить доступ к данным ЦП, но не к структурированным образцам точек трассировки.

source: no restrictions.
ru: без ограничений.

source: The existence of the I<perf_event_paranoid> file is the official method for determining if a kernel supports B<perf_event_open>().
ru: Наличие файла I<perf_event_paranoid> — официальный метод определения поддержки ядром B<perf_event_open>().

source: This sets the maximum sample rate. Setting this too high can allow users to sample at a rate that impacts overall machine performance and potentially lock up the machine. The default value is 100000 (samples per second).
ru: Максимальная скорость выборки. Установка слишком большого значения может позволить пользователям задать выборку, которая скажется на производительности машины и, возможно, заблокирует машину. Значение по умолчанию 100000 (образов в секунду).

source: This file sets the maximum depth of stack frame entries reported when generating a call trace.
ru: Данный файл задаёт максимальную глубину стека кадров, выдаваемых при генерации трассировки вызова.

source: Maximum number of pages an unprivileged user can B<mlock>(2). The default is 516 (kB).
ru: Максимальное количество страниц, которое может получить непривилегированный пользователь с помощью B<mlock>(2). По умолчанию 516 (кБ).

source: Files in I</sys/bus/event_source/devices/>
ru: Файлы в I</sys/bus/event_source/devices/>

source: Since Linux 2.6.34, the kernel supports having multiple PMUs available for monitoring. Information on how to program these PMUs can be found under I</sys/bus/event_source/devices/>. Each subdirectory corresponds to a different PMU.
ru: Начиная с Linux 2.6.34, ядро поддерживает использование нескольких PMU для слежения. Информацию о программировании этих PMU можно найти вI</sys/bus/event_source/devices/>. Каждый подкаталог соответствует одному PMU.

source: I</sys/bus/event_source/devices/*/type> (since Linux 2.6.38)
ru: I</sys/bus/event_source/devices/*/type> (начиная с Linux 2.6.38)

source: This contains an integer that can be used in the I<type> field of I<perf_event_attr> to indicate that you wish to use this PMU.
ru: Содержит целое, которое можно использовать в поле I<type> из I<perf_event_attr>, отражает, что вы хотите использовать этот PMU.

source: I</sys/bus/event_source/devices/cpu/rdpmc> (since Linux 3.4)
ru: I</sys/bus/event_source/devices/cpu/rdpmc> (начиная с Linux 3.4)

source: If this file is 1, then direct user-space access to the performance counter registers is allowed via the rdpmc instruction. This can be disabled by echoing 0 to the file.
ru: Если в файле значение 1, то с помощью инструкции rdpmc возможен прямой доступ из пользовательского пространства к регистрам счётчика производительности. Выключить доступ можно посредством записи 0 в этот файл.

source: As of Linux 4.0 the behavior has changed, so that 1 now means only allow access to processes with active perf events, with 2 indicating the old allow-anyone-access behavior.
ru: В Linux 4.0 это поведение изменено, теперь 1 означает лишь доступ к процессам с активными событиями perf, а 2 возвращает старое поведение разрешения доступа всем.

source: I</sys/bus/event_source/devices/*/format/> (since Linux 3.4)
ru: I</sys/bus/event_source/devices/*/format/> (начиная с Linux 3.4)

source: This subdirectory contains information on the architecture-specific subfields available for programming the various I<config> fields in the I<perf_event_attr> struct.
ru: В этом подкаталоге содержится информация по зависящим от архитектуры полям, доступным для программирования различных полей I<config> структуры I<perf_event_attr>.

source: The content of each file is the name of the config field, followed by a colon, followed by a series of integer bit ranges separated by commas. For example, the file I<event> may contain the value I<config1:1,6-10,44> which indicates that event is an attribute that occupies bits 1,6\(en10, and 44 of I<perf_event_attr::config1>.
ru: В каждом файле содержится имя поля config, двоеточие, диапазоны бит через запятую. Например, файл I<event> может содержать значение I<config1:1,6-10,44>, что означает, что событие — атрибут, занимающий биты 1,6\(en10 и 44 в I<perf_event_attr::config1>.

source: I</sys/bus/event_source/devices/*/events/> (since Linux 3.4)
ru: I</sys/bus/event_source/devices/*/events/> (начиная с Linux 3.4)

source: This subdirectory contains files with predefined events. The contents are strings describing the event settings expressed in terms of the fields found in the previously mentioned I<./format/> directory. These are not necessarily complete lists of all events supported by a PMU, but usually a subset of events deemed useful or interesting.
ru: В данном подкаталоге содержатся поля с предопределёнными событиями. Содержимое — строки, описывающие настройки события в виде полей упомянутых в каталоге I<./format/> ранее. Это не обязательно полный список всех событий, поддерживаемых PMU, но обычно это поднабор событий, считаемый полезным.

source: The content of each file is a list of attribute names separated by commas. Each entry has an optional value (either hex or decimal). If no value is specified, then it is assumed to be a single-bit field with a value of 1. An example entry may look like this: I<event=0x2,inv,ldlat=3>.
ru: Содержимое каждого файла — список имён атрибутов через запятую. Каждая запись имеет необязательное значение (десятичное или шестнадцатеричное число). Если значение не указано, то предполагается что это однобитовое поле со значением 1. Пример: I<event=0x2,inv,ldlat=3>.

source: This file is the standard kernel device interface for injecting hotplug events.
ru: Данный файл — стандартное ядерное интерфейсное устройство для введения событий на лету.

source: I</sys/bus/event_source/devices/*/cpumask> (since Linux 3.7)
ru: I</sys/bus/event_source/devices/*/cpumask> (начиная с Linux 3.7)
