Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: ptmx, pts - pseudoterminal master and slave
ru: ptmx, pts - основной и подчинённый псевдо-терминал

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The file I</dev/ptmx> is a character file with major number 5 and minor number 2, usually with mode 0666 and ownership root:root. It is used to create a pseudoterminal master and slave pair.
ru: Файл I</dev/ptmx> является символьным файлом со старшим номером 5 и младшим номером 2, обычно имеет права доступа 0666 и принадлежит root:root. Используется для создания пары основного и подчинённого псевдо-терминала.

source: When a process opens I</dev/ptmx>, it gets a file descriptor for a pseudoterminal master (PTM), and a pseudoterminal slave (PTS) device is created in the I</dev/pts> directory. Each file descriptor obtained by opening I</dev/ptmx> is an independent PTM with its own associated PTS, whose path can be found by passing the file descriptor to B<ptsname>(3).
ru: Когда процесс открывает I</dev/ptmx>, то он получает дескриптор файла основного псевдо-терминала (PTM, pseudoterminal master), а в каталоге I</dev/pts> создаётся устройство подчинённого псевдо-терминала (PTS, pseudoterminal slave). Каждый дескриптор файла, полученный открытием I</dev/ptmx>, является независимым PTM со своим отдельным, связанным с ним PTS, чей путь можно определить, передав файловый дескриптор B<ptsname>(3).

source: Before opening the pseudoterminal slave, you must pass the master's file descriptor to B<grantpt>(3) and B<unlockpt>(3).
ru: Перед открытием подчинённого псевдо-терминала вы должны передать дескриптор файла основного терминала в B<grantpt>(3) и B<unlockpt>(3).

source: Once both the pseudoterminal master and slave are open, the slave provides processes with an interface that is identical to that of a real terminal.
ru: Когда основной и подчинённый псевдо-терминалы будут открыты, подчинённый предоставляет процессам интерфейс, идентичный обычному терминалу.

source: Data written to the slave is presented on the master file descriptor as input. Data written to the master is presented to the slave as input.
ru: Данные, записываемые на подчинённый терминал, появляются у файлового дескриптора основного терминала как входные данные. Данные, записываемые на основной терминал, появляются на подчинённом терминале в виде входных данных.

source: In practice, pseudoterminals are used for implementing terminal emulators such as B<xterm>(1), in which data read from the pseudoterminal master is interpreted by the application in the same way a real terminal would interpret the data, and for implementing remote-login programs such as B<sshd>(8), in which data read from the pseudoterminal master is sent across the network to a client program that is connected to a terminal or terminal emulator.
ru: На практике, псевдо-терминалы используются для реализации эмуляторов терминала, таких как B<xterm>(1), где данные, считываемые с основного псевдо-терминала, интерпретируются приложениями в том же виде, как и данные с обычного терминала, а также в программах, реализующих удалённый доступ, таких как B<sshd>(8), где данные, считываемые с основного псевдо-терминала, отправляются по сети в программу-клиент, подключённую к терминалу или эмулятору терминала.

source: Pseudoterminals can also be used to send input to programs that normally refuse to read input from pipes (such as B<su>(1), and B<passwd>(1)).
ru: Псевдо-терминалы также могут использоваться для отправки вводимых данных в программы, не желающих принимать обычный ввод из канала (например B<su>(1) и B<passwd>(1)).

source: FILES
ru: ФАЙЛЫ

source: NOTES
ru: ЗАМЕЧАНИЯ

source: The Linux support for the above (known as UNIX 98 pseudoterminal naming) is done using the I<devpts> filesystem, that should be mounted on I</dev/pts>.
ru: Поддержка в Linux для всего вышеперечисленного (т.н. именование псевдо-терминалов UNIX 98) осуществляется через файловую систему I<devpts>, которая монтируется к I</dev/pts>.

source: Before this UNIX 98 scheme, master pseudoterminals were called I</dev/ptyp0>, ... and slave pseudoterminals I</dev/ttyp0>, ... and one needed lots of preallocated device nodes.
ru: До схемы UNIX 98, основные псевдо-терминалы назывались I</dev/ptyp0>, ..., а подчинённые псевдо-терминалы \(em I</dev/ttyp0>, …, и для них требовалось очень много предварительно размещённых нод устройств.

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: Linux User Manual
ru: Руководство пользователя Linux

source: pldd - display dynamic shared objects linked into a process
ru: pldd - отобразить список динамических объектов общего пользования, связанных в процесс

source: SYNOPSIS
ru: ОБЗОР

source: The B<pldd> command displays a list of the dynamic shared objects (DSOs) that are linked into the process with the specified process ID (PID). The list includes the libraries that have been dynamically loaded using B<dlopen>(3).
ru: Команда B<pldd> отображает список динамических объектов общего пользования (DSO), связанных в процесс для указанного идентификатора процесса (PID). Этот список также включает в себя библиотеки, динамически загруженные с помощью B<dlopen>(3).

source: OPTIONS
ru: ПАРАМЕТРЫ

source: Display a help message and exit.
ru: Показать справку и выйти.

source: Display a short usage message and exit.
ru: Показать короткое сообщение об использовании и завершить работу.

source: Display program version information and exit.
ru: Показать сведения о версии программы и выйти.

source: EXIT STATUS
ru: КОД РЕЗУЛЬТАТА

source: On success, B<pldd> exits with the status 0. If the specified process does not exist, the user does not have permission to access its dynamic shared object list, or no command-line arguments are supplied, B<pldd> exists with a status of 1. If given an invalid option, it exits with the status 64.
ru: При успешном выполнении B<pldd> завершается с кодом 0. Если указанный процесс не существует, пользователь не имеет прав для доступа к списку общих динамических объектов или не указаны аргументы командной строки, B<pldd> завершается с кодом 1. Если указан неправильный параметр, команда завершается с кодом ошибки 64.

source: VERSIONS
ru: ВЕРСИИ

source: B<pldd> is available since glibc 2.15.
ru: B<pldd> доступна в glibc с версии 2.15.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: The B<pldd> command is not specified by POSIX.1. Some other systems have a similar command.
ru: Команда B<pldd> не описана в POSIX.1. В других системах есть похожая команда.

source: The command
ru: Команда

source: also shows output that includes the dynamic shared objects that are linked into a process.
ru: также показывает в выводе общие динамические объекты, связанные с процессом.

source: The B<gdb>(1) I<info shared> command also shows the shared libraries being used by a process, so that one can obtain similar output to B<pldd> using a command such as the following (to monitor the process with the specified I<pid>):
ru: Команда I<info shared> в B<gdb>(1) также показывает используется процессом общие библиотеки, что позволяет получить подобную B<pldd> информацию с помощью команды (для процесса с указанным I<pid>):

source: BUGS
ru: ДЕФЕКТЫ

source: From glibc 2.19 to 2.29, B<pldd> was broken: it just hung when executed. This problem was fixed in glibc 2.30, and the fix has been backported to earlier glibc versions in some distributions.
ru: В glibc с версии 2.19 по 2.29, B<pldd> не работала: висла при запуске. Эта проблема была исправлена в glibc 2.30, и в некоторых дистрибутивах это исправление было добавлено и в старые версии glibc.

source: EXAMPLE
ru: ПРИМЕР

source: $ B<echo $$> # Display PID of shell 1143 $ B<pldd $$> # Display DSOs linked into the shell 1143: /usr/bin/bash linux-vdso.so.1 /lib64/libtinfo.so.5 /lib64/libdl.so.2 /lib64/libc.so.6 /lib64/ld-linux-x86-64.so.2 /lib64/libnss_files.so.2
ru: $ B<echo $$> # Показать PID оболочки 1143 $ B<pldd $$> # Показать объекты, скомпонованные с оболочкой 1143: /usr/bin/bash linux-vdso.so.1 /lib64/libtinfo.so.5 /lib64/libdl.so.2 /lib64/libc.so.6 /lib64/ld-linux-x86-64.so.2 /lib64/libnss_files.so.2

source: path_resolution - how a pathname is resolved to a file
ru: path_resolution - как путь преобразуется в файл

source: Some UNIX/Linux system calls have as parameter one or more filenames. A filename (or pathname) is resolved as follows.
ru: У некоторых системных вызовов UNIX/Linux есть параметр для указания одного или нескольких имён файлов. Имя файла (или путь) преобразуется (resolved) следующим образом.

source: Step 1: start of the resolution process
ru: Шаг 1: запуск процесса преобразования

source: If the pathname starts with the \(aq/\(aq character, the starting lookup directory is the root directory of the calling process. (A process inherits its root directory from its parent. Usually this will be the root directory of the file hierarchy. A process may get a different root directory by use of the B<chroot>(2) system call. A process may get an entirely private mount namespace in case it\(emor one of its ancestors\(emwas started by an invocation of the B<clone>(2) system call that had the B<CLONE_NEWNS> flag set.) This handles the \(aq/\(aq part of the pathname.
ru: Если путь начинается с символа «/», то начальным каталогом поиска назначается корневой каталог вызывающего процесса (процесс наследует свой корневой каталог от родителя. Обычно, это корневой каталог файловой иерархии. Процесс может получить другой корневой каталог, используя системный вызов B<chroot>(2). Процесс может получить полностью закрытое пространство имён монтирования когда он сам или один из его предков был запущен системным вызовом B<clone>(2) с флагом B<CLONE_NEWNS>). Так обрабатывается часть пути «/».

source: If the pathname does not start with the \(aq/\(aq character, the starting lookup directory of the resolution process is the current working directory of the process. (This is also inherited from the parent. It can be changed by use of the B<chdir>(2) system call.)
ru: Если путь не начинается с символа «/», то начальным каталогом поиска процесса преобразование выбирается текущий рабочий каталог процесса (также наследуемый от родителя; может быть системным вызовом B<chdir>(2)).

source: Pathnames starting with a \(aq/\(aq character are called absolute pathnames. Pathnames not starting with a \(aq/\(aq are called relative pathnames.
ru: Пути, начинающиеся с символа «/», называются абсолютными путями. Пути, не начинающиеся с символа «/», называются относительными путями.

source: Step 2: walk along the path
ru: Шаг 2: обход пути

source: Set the current lookup directory to the starting lookup directory. Now, for each nonfinal component of the pathname, where a component is a substring delimited by \(aq/\(aq characters, this component is looked up in the current lookup directory.
ru: Назначаем текущим каталогом поиска начальный каталог поиска. Теперь для каждого не конечного компонента пути (подстрока, разделённая символами «/») будет производиться поиск в текущем каталоге поиска.

source: If the process does not have search permission on the current lookup directory, an B<EACCES> error is returned ("Permission denied").
ru: Если у процесса нет права поиска в текущем каталоге просмотра, будет возвращена ошибка B<EACCES> («Доступ запрещён»).

source: If the component is not found, an B<ENOENT> error is returned ("No such file or directory").
ru: Если компонент не найдет, будет возвращена ошибка B<ENOENT> («Нет такого файла или каталога»).

source: If the component is found, but is neither a directory nor a symbolic link, an B<ENOTDIR> error is returned ("Not a directory").
ru: Если компонент найден, но не является ни каталогом, ни символической ссылкой, будет возвращена ошибка B<ENOTDIR> («Не является каталогом»).

source: If the component is found and is a directory, we set the current lookup directory to that directory, and go to the next component.
ru: Если компонент найден и является каталогом, значением текущего каталога поиска устанавливается этот каталог, после чего осуществляется переход к следующему компоненту.

source: If the component is found and is a symbolic link (symlink), we first resolve this symbolic link (with the current lookup directory as starting lookup directory). Upon error, that error is returned. If the result is not a directory, an B<ENOTDIR> error is returned. If the resolution of the symlink is successful and returns a directory, we set the current lookup directory to that directory, and go to the next component. Note that the resolution process here can involve recursion if the prefix ('dirname') component of a pathname contains a filename that is a symbolic link that resolves to a directory (where the prefix component of that directory may contain a symbolic link, and so on). In order to protect the kernel against stack overflow, and also to protect against denial of service, there are limits on the maximum recursion depth, and on the maximum number of symbolic links followed. An B<ELOOP> error is returned when the maximum is exceeded ("Too many levels of symbolic links").
ru: Если компонент найден и это символическая ссылка (symlink), то сначала мы разрешаем эту символическую ссылку (от текущего каталога, как начального пути поиска). При ошибках, возвращаем ошибку. Если результат не каталог, то возвращается ошибка B<ENOTDIR>. Если разрешение символической ссылки удалось и получен каталог, то мы назначаем этот каталог текущим каталогом поиска и переходим к следующему компоненту. Заметим, что процесс разрешения здесь может вызвать рекурсию, если компонент префикса («dirname») пути содержит имя символической ссылки, которая разрешается в каталог (где префикс компонента этого каталога может содержать символическую ссылку и т .д.). Для защиты ядра от переполнения стека, а также от отказа в обслуживании, есть ограничение на максимальную глубину рекурсии и на максимальное количество переходов по символическим ссылкам. При превышении возвращается ошибка B<ELOOP> («Слишком много уровней символических ссылок»).

source: As currently implemented on Linux, the maximum number of symbolic links that will be followed while resolving a pathname is 40. In kernels before 2.6.18, the limit on the recursion depth was 5. Starting with Linux 2.6.18, this limit was raised to 8. In Linux 4.2, the kernel's pathname-resolution code was reworked to eliminate the use of recursion, so that the only limit that remains is the maximum of 40 resolutions for the entire pathname.
ru: В текущей реализации Linux максимальное количество допустимых переходов по символическим ссылкам при преобразовании пути равно 40. В ядрах до версии 2.6.18 ограничение глубины рекурсии было равно 5. Начиная с Linux 2.6.18, это ограничение увеличилось до 8. В Linux 4.2 код ядра разрешения пути был переработан и возникновение рекурсии больше не происходит, поэтому осталось только ограничение на 40 разрешений для всего пути.

source: Step 3: find the final entry
ru: Шаг 3: поиск последнего элемента

source: The lookup of the final component of the pathname goes just like that of all other components, as described in the previous step, with two differences: (i) the final component need not be a directory (at least as far as the path resolution process is concerned\(emit may have to be a directory, or a nondirectory, because of the requirements of the specific system call), and (ii) it is not necessarily an error if the component is not found\(emmaybe we are just creating it. The details on the treatment of the final entry are described in the manual pages of the specific system calls.
ru: Поиск конечного компонента пути происходит таким же образом, как и всех других компонентов, как было описано в предыдущем шаге, но с двумя различиями: конечному компоненту не нужно быть каталогом (по крайней мере, это не важно для процесса преобразования — он может быть каталогом или не каталогом, в зависимости от требований определённого системного вызова), и если компонент не найден это необязательна ошибка — возможно, его только требуется создать. О том, чем считается последний элемент, описано в справочных страницах соответствующих системных вызовов.

source: . and ..
ru: . и ..

source: By convention, every directory has the entries "." and "..", which refer to the directory itself and to its parent directory, respectively.
ru: По соглашению, в каждом каталоге есть записи «.» и «..», которые ссылаются на сам каталог и на его родительских каталог, соответственно.

source: The path resolution process will assume that these entries have their conventional meanings, regardless of whether they are actually present in the physical filesystem.
ru: Процесс определения пути предполагает, что эти записи имеют свои общепринятые значения, независимо от того, присутствуют ли они на самом деле в физической файловой системе.

source: One cannot walk down past the root: "/.." is the same as "/".
ru: Невозможно перейти за пределы корня: путь «/..» равен «/».

source: Mount points
ru: Точки монтирования

source: After a "mount dev path" command, the pathname "path" refers to the root of the filesystem hierarchy on the device "dev", and no longer to whatever it referred to earlier.
ru: После команды «mount устройство путь» путь указывает на корень иерархии файловой системы устройства, и больше не указывает на то, что было раньше.

source: One can walk out of a mounted filesystem: "path/.." refers to the parent directory of "path", outside of the filesystem hierarchy on "dev".
ru: Можно выйти за пределы смонтированной файловой системы: «путь/..» указывает на родительский каталог «пути», лежащий вне иерархии файловой системы устройства.

source: Trailing slashes
ru: Конечные символы косой черты

source: If a pathname ends in a \(aq/\(aq, that forces resolution of the preceding component as in Step 2: it has to exist and resolve to a directory. Otherwise, a trailing \(aq/\(aq is ignored. (Or, equivalently, a pathname with a trailing \(aq/\(aq is equivalent to the pathname obtained by appending \(aq.\(aq to it.)
ru: Если путь заканчивается на «/», то это приводит к обработке предыдущего компонента согласно шагу 2: он существует и преобразуется в каталог. В противном случае конечный «/» будет проигнорирован (или, что тоже самое, путь с конечной косой чертой «/» будет равен пути, полученному добавлением к его концу «.»).

source: Final symlink
ru: Символьная ссылка в конце

source: If the last component of a pathname is a symbolic link, then it depends on the system call whether the file referred to will be the symbolic link or the result of path resolution on its contents. For example, the system call B<lstat>(2) will operate on the symlink, while B<stat>(2) operates on the file pointed to by the symlink.
ru: Если последний компонент пути является символической ссылкой, то это зависит от системного вызова, будет ли файл указывать на саму символическую ссылку или на её содержимое. Например, системный вызов B<lstat>(2) будет работать с символической ссылкой, а B<stat>(2) работает с файлом, на который указывает символическая ссылка.

source: Length limit
ru: Ограничение длины

source: There is a maximum length for pathnames. If the pathname (or some intermediate pathname obtained while resolving symbolic links) is too long, an B<ENAMETOOLONG> error is returned ("Filename too long").
ru: Существует максимально допустимая длина пути. Если путь (или какой-нибудь промежуточный путь, полученный при разрешении символических ссылок) очень длинный, то возвращается B<ENAMETOOLONG> («Имя файла очень длинное»).

source: Empty pathname
ru: Пустой путь

source: In the original UNIX, the empty pathname referred to the current directory. Nowadays POSIX decrees that an empty pathname must not be resolved successfully. Linux returns B<ENOENT> in this case.
ru: В оригинальном UNIX, пустой путь считался текущим каталогом. В наши дни в POSIX указано, что пустой путь не должен быть преобразован без ошибки. В Linux в этом случае возвращается B<ENOENT>.

source: Permissions
ru: Права доступа

source: The permission bits of a file consist of three groups of three bits; see B<chmod>(1) and B<stat>(2). The first group of three is used when the effective user ID of the calling process equals the owner ID of the file. The second group of three is used when the group ID of the file either equals the effective group ID of the calling process, or is one of the supplementary group IDs of the calling process (as set by B<setgroups>(2)). When neither holds, the third group is used.
ru: Биты прав файла делятся на три группы по три бита; смотрите B<chmod>(1) и B<stat>(2). Первая группа используется тогда, когда эффективный идентификатор пользователя вызывающего процесса равен идентификатору владельца файла. Вторая группа используется, если идентификатор группы файла равен эффективному идентификатору группы вызывающего процесса или одному из дополнительных групп вызывающего процесса (установленных B<setgroups>(2)). В остальных случаях используется третья группа.

source: Of the three bits used, the first bit determines read permission, the second write permission, and the last execute permission in case of ordinary files, or search permission in case of directories.
ru: Три бита используются следующим образом: первым битом задаётся доступ на чтение, вторым на запись, а последним, в случае обычных файлов — разрешение на выполнение, в в случае каталогов разрешение на поиск.

source: Linux uses the fsuid instead of the effective user ID in permission checks. Ordinarily the fsuid will equal the effective user ID, but the fsuid can be changed by the system call B<setfsuid>(2).
ru: Для проверки доступа в Linux используется fsuid вместо эффективного идентификатора пользователя. Обычно, fsuid равен эффективному идентификатору пользователя, fsuid может быть изменён системным вызовом B<setfsuid>(2).

source: (Here "fsuid" stands for something like "filesystem user ID". The concept was required for the implementation of a user space NFS server at a time when processes could send a signal to a process with the same effective user ID. It is obsolete now. Nobody should use B<setfsuid>(2).)
ru: (Здесь «fsuid» сокращение от «пользовательский идентификатор в файловой системе, filesystem user ID». Это требовалось для реализации сервера NFS в пользовательском пространстве во времена, когда процессы могли посылать сигнал процессу с тем же эффективным идентификатором пользователя. Сейчас это устарело. Никто не должен использовать B<setfsuid>(2).)

source: Similarly, Linux uses the fsgid ("filesystem group ID") instead of the effective group ID. See B<setfsgid>(2).
ru: Схожим образом в Linux используется fsgid ("filesystem group ID") вместо идентификатора эффективной группы. Смотрите B<setfsgid>(2).

source: Bypassing permission checks: superuser and capabilities
ru: Пропуск проверки прав доступа: суперпользователь и мандаты

source: On a traditional UNIX system, the superuser (I<root>, user ID 0) is all-powerful, and bypasses all permissions restrictions when accessing files.
ru: В традиционных системах UNIX суперпользователю (I<root>, идентификатор пользователя 0) доступно всё и при доступе к файлам никаких проверок ограничений не производится.

source: On Linux, superuser privileges are divided into capabilities (see B<capabilities>(7)). Two capabilities are relevant for file permissions checks: B<CAP_DAC_OVERRIDE> and B<CAP_DAC_READ_SEARCH>. (A process has these capabilities if its fsuid is 0.)
ru: В Linux права суперпользователя делятся мандатами (смотрите B<capabilities>(7)). Два мандата относятся к проверка доступа к файлам: B<CAP_DAC_OVERRIDE> и B<CAP_DAC_READ_SEARCH> (процесс имеет эти мандаты, если его fsuid равен 0).
