Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: On success, the previous I<persona> is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При нормальном завершении работы возвращается предыдущее значение I<persona>. При ошибке возвращается -1, а переменная I<errno>, устанавливается в соответствующее значение.

source: The kernel was unable to change the personality.
ru: Ядру не удалось изменить специализацию.

source: This system call first appeared in Linux 1.1.20 (and thus first in a stable kernel release with Linux 1.2.0); library support was added in glibc 2.3.
ru: Данный системный вызов впервые появился в Linux 1.1.20 (и, таким образом, в первом стабильном выпуске ядра Linux 1.2.0); поддержка в glibc добавлена в версии 2.3.

source: B<personality>() is Linux-specific and should not be used in programs intended to be portable.
ru: Вызов B<personality>() есть только в Linux, и он не должен использоваться в переносимых программах.

source: pread, pwrite - read from or write to a file descriptor at a given offset
ru: pread, pwrite - чтение или запись информации из файлового дескриптора согласно заданному смещению

source: || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L
ru: || /* начиная с glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L

source: B<pread>() reads up to I<count> bytes from file descriptor I<fd> at offset I<offset> (from the start of the file) into the buffer starting at I<buf>. The file offset is not changed.
ru: B<pread>() читает максимум I<count> байтов из файлового дескриптора I<fd>, начиная со смещения I<offset> (от начала файла), в буфер, начиная с I<buf>. Текущая позиция файла не изменяется.

source: B<pwrite>() writes up to I<count> bytes from the buffer starting at I<buf> to the file descriptor I<fd> at offset I<offset>. The file offset is not changed.
ru: B<pwrite>() записывает максимум I<count> байтов из буфера I<buf> в файловый дескриптор I<fd> , начиная со смещения I<offset>. Текущая позиция файла не изменяется.

source: The file referenced by I<fd> must be capable of seeking.
ru: Файл, заданный в I<fd>, должен позволять изменение смещения.

source: On success, B<pread>() returns the number of bytes read (a return of zero indicates end of file) and B<pwrite>() returns the number of bytes written.
ru: При успешном выполнении B<pread>() возвращается количество считанных байт (ноль указывает на конец файла), а B<pwrite>() — количество записанных байт.

source: Note that it is not an error for a successful call to transfer fewer bytes than requested (see B<read>(2) and B<write>(2)).
ru: Заметим, что для успешного выполнения не считается ошибкой передача меньшего количества байт чем запрошено (смотрите B<read>(2) и B<write>(2)).

source: On error, -1 is returned and I<errno> is set to indicate the cause of the error.
ru: При ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: B<pread>() can fail and set I<errno> to any error specified for B<read>(2) or B<lseek>(2). B<pwrite>() can fail and set I<errno> to any error specified for B<write>(2) or B<lseek>(2).
ru: Вызов B<pread>() может завершиться неудачно и записать в I<errno> один из кодов ошибки, определённых для B<read>(2) или B<lseek>(2). Вызов B<pwrite>() может завершиться неудачно и записать в I<errno> один из кодов ошибки, определённых для B<write>(2) или B<lseek>(2).

source: The B<pread>() and B<pwrite>() system calls were added to Linux in version 2.1.60; the entries in the i386 system call table were added in 2.1.69. C library support (including emulation using B<lseek>(2) on older kernels without the system calls) was added in glibc 2.1.
ru: Системные вызовы B<pread>() и B<pwrite>() были внесены в ядро Linux, начиная с версии 2.1.60; как элементы таблицы системных вызовов i386 были добавлены в ядро версии 2.1.69. Поддержка в библиотеке С (включая эмуляцию с помощью B<lseek>(2) в старых ядрах, не имеющих соответствующих системных вызовов) была добавлена в glibc 2.1.

source: The B<pread>() and B<pwrite>() system calls are especially useful in multithreaded applications. They allow multiple threads to perform I/O on the same file descriptor without being affected by changes to the file offset by other threads.
ru: Системные вызовы B<pread>() и B<pwrite>() особенно полезны в многонитевых приложениях. Они позволяют нескольким нитям выполнять ввод-вывод в один файловый дескриптор не учитывая изменений файлового смещения, сделанного другими нитями.

source: On Linux, the underlying system calls were renamed in kernel 2.6: B<pread>() became B<pread64>(), and B<pwrite>() became B<pwrite64>(). The system call numbers remained the same. The glibc B<pread>() and B<pwrite>() wrapper functions transparently deal with the change.
ru: В Linux нижележащие системные вызовы переименованы в ядре версии 2.6: B<pread>() стал называться B<pread64>(), а B<pwrite>() \(em B<pwrite64>(). Номера системных вызовов остались прежними. Обёрточные функции B<pread>() и B<pwrite>() в glibc скрывают данные переименование.

source: On some 32-bit architectures, the calling signature for these system calls differ, for the reasons described in B<syscall>(2).
ru: На некоторых 32-битных архитектурах интерфейс этих системных вызовов отличается от описанного выше, по причинам указанным в B<syscall>(2).

source: POSIX requires that opening a file with the B<O_APPEND> flag should have no effect on the location at which B<pwrite>() writes data. However, on Linux, if a file is opened with B<O_APPEND>, B<pwrite>() appends data to the end of the file, regardless of the value of I<offset>.
ru: Согласно POSIX требуется, чтобы открытие файла с флагом B<O_APPEND> не влияло на расположение, по которому B<pwrite>() записывает данные. Однако в Linux, если файл открывается с флагом B<O_APPEND>, B<pwrite>() добавляет данные в конец файла, независимо от значения I<offset>.

source: prctl - operations on a process
ru: prctl - операции над процессом

source: B<prctl>() is called with a first argument describing what to do (with values defined in I<E<lt>linux/prctl.hE<gt>>), and further arguments with a significance depending on the first one. The first argument can be:
ru: Первый аргумент B<prctl>() задаёт тип операции (типы определены в I<E<lt>linux/prctl.hE<gt>>, значения остальных аргументов зависят от указываемого типа. Первый аргумент может принимать следующие значения:

source: B<PR_CAP_AMBIENT> (since Linux 4.3)
ru: B<PR_CAP_AMBIENT> (начиная с Linux 4.3)

source: Reads or changes the ambient capability set of the calling thread, according to the value of I<arg2>, which must be one of the following:
ru: Читает или изменяет наружный набор мандатов вызывающей нити согласно значению I<arg2>, которое должно быть одним из следующих:

source: The capability specified in I<arg3> is added to the ambient set. The specified capability must already be present in both the permitted and the inheritable sets of the process. This operation is not permitted if the B<SECBIT_NO_CAP_AMBIENT_RAISE> securebit is set.
ru: Мандат, указанный в I<arg3>, добавляется в наружный набор. Указанный мандат уже должен присутствовать в разрешающем и наследуемом наборе. Эта операция неприменима, если установлен бит безопасности B<SECBIT_NO_CAP_AMBIENT_RAISE>.

source: The capability specified in I<arg3> is removed from the ambient set.
ru: Мандат, указанный в I<arg3>, удаляется из наружного набора.

source: The B<prctl>() call returns 1 if the capability in I<arg3> is in the ambient set and 0 if it is not.
ru: Вызов B<prctl>() возвращает 1, если мандат в I<arg3> присутствует в наружном наборе и 0, если нет.

source: All capabilities will be removed from the ambient set. This operation requires setting I<arg3> to zero.
ru: Все мандаты будут удалены из наружного набора. Для этой операции требуется указать в I<arg3> значение 0.

source: In all of the above operations, I<arg4> and I<arg5> must be specified as 0.
ru: Во всех перечисленных выше операциях значения I<arg4> и I<arg5> должны быть равны 0.

source: Higher-level interfaces layered on top of the above operations are provided in the B<libcap>(3) library in the form of B<cap_get_ambient>(3), B<cap_set_ambient>(3), and B<cap_reset_ambient>(3).
ru: Интерфейсы высокого уровня, построенные поверх описанных выше операций, предоставляются в библиотеке B<libcap>(3) под именами B<cap_get_ambient>(3), B<cap_set_ambient>(3) и B<cap_reset_ambient>(3).

source: B<PR_CAPBSET_READ> (since Linux 2.6.25)
ru: B<PR_CAPBSET_READ> (начиная с Linux 2.6.25)

source: Return (as the function result) 1 if the capability specified in I<arg2> is in the calling thread's capability bounding set, or 0 if it is not. (The capability constants are defined in I<E<lt>linux/capability.hE<gt>>.) The capability bounding set dictates whether the process can receive the capability through a file's permitted capability set on a subsequent call to B<execve>(2).
ru: Возвращает 1 (как результат функции), если мандат, указанный в I<arg2>, есть в списке мандатов вызывающей нити (capability bounding set), или 0, если нет. Константы мандатов определены в I<E<lt>linux/capability.hE<gt>>. Значениями списка мандатов определяется, может ли процесс получить мандат через установку набора файловых прав при последующем вызове B<execve>(2).

source: If the capability specified in I<arg2> is not valid, then the call fails with the error B<EINVAL>.
ru: Если мандат, указанный в I<arg2>, некорректен, то вызов завершится с ошибкой B<EINVAL>.

source: A higher-level interface layered on top of this operation is provided in the B<libcap>(3) library in the form of B<cap_get_bound>(3).
ru: Интерфейс высокого уровня, построенный поверх описанной выше операции, предоставляется в библиотеке B<libcap>() под именем B<cap_get_bound>(3).

source: B<PR_CAPBSET_DROP> (since Linux 2.6.25)
ru: B<PR_CAPBSET_DROP> (начиная с Linux 2.6.25)

source: If the calling thread has the B<CAP_SETPCAP> capability within its user namespace, then drop the capability specified by I<arg2> from the calling thread's capability bounding set. Any children of the calling thread will inherit the newly reduced bounding set.
ru: Если вызывающая нить имеет мандат B<CAP_SETPCAP> в своём пользовательском пространстве имён, то мандат, указанный в I<arg2>, удаляется из списка мандатов вызывающей нити. Любой потомок вызывающей нити унаследует новый сокращённый список мандатов.

source: The call fails with the error: B<EPERM> if the calling thread does not have the B<CAP_SETPCAP>; B<EINVAL> if I<arg2> does not represent a valid capability; or B<EINVAL> if file capabilities are not enabled in the kernel, in which case bounding sets are not supported.
ru: Вызов завершается с ошибками: B<EPERM>, если вызывающая нить не имеет мандата B<CAP_SETPCAP>; B<EINVAL>, если в I<arg2> указан недопустимый мандат; B<EINVAL>, если файловые мандаты не включены в ядре, в этом случае списки мандатов не поддерживаются.

source: A higher-level interface layered on top of this operation is provided in the B<libcap>(3) library in the form of B<cap_drop_bound>(3).
ru: Интерфейс высокого уровня, построенный поверх описанной выше операции, предоставляется в библиотеке B<libcap>() под именем B<cap_drop_bound>(3).

source: B<PR_SET_CHILD_SUBREAPER> (since Linux 3.4)
ru: B<PR_SET_CHILD_SUBREAPER> (начиная с Linux 3.4)

source: If I<arg2> is nonzero, set the "child subreaper" attribute of the calling process; if I<arg2> is zero, unset the attribute.
ru: Если значение I<arg2> не равно 0, то в вызвавшем процессе устанавливается атрибут «сборщика потомков» (child subreaper); если значение I<arg2> равно 0, то атрибут удаляется.

source: A subreaper fulfills the role of B<init>(1) for its descendant processes. When a process becomes orphaned (i.e., its immediate parent terminates), then that process will be reparented to the nearest still living ancestor subreaper. Subsequently, calls to B<getppid>() in the orphaned process will now return the PID of the subreaper process, and when the orphan terminates, it is the subreaper process that will receive a B<SIGCHLD> signal and will be able to B<wait>(2) on the process to discover its termination status.
ru: Сборщик потомков выполняет функцию B<init>(1) для своих потомков. При завершении осиротевшего процесса (т. е., прямой предок уже завершил выполнение), его родителем станет ближайший действующий сборщик-предок. После этого вызов B<getppid>() в осиротевшем процессе будет возвращать PID процесса-сборщика, и когда осиротевший процесс завершит работу, сборщик получит сигнал B<SIGCHLD> и сможет запустить B<wait>(2) для получения состояния завершения потомка.

source: The setting of the "child subreaper" attribute is not inherited by children created by B<fork>(2) and B<clone>(2). The setting is preserved across B<execve>(2).
ru: Установка атрибута «сборщика потомков» не наследуется потомками, создаваемыми B<fork>(2) и B<clone>(2). Данное значение сохраняется после B<execve>(2).

source: Establishing a subreaper process is useful in session management frameworks where a hierarchical group of processes is managed by a subreaper process that needs to be informed when one of the processes\(emfor example, a double-forked daemon\(emterminates (perhaps so that it can restart that process). Some B<init>(1) frameworks (e.g., B<systemd>(1)) employ a subreaper process for similar reasons.
ru: Назначение процесса-сборщика полезно в инфраструктуре управления сеансами, где иерархическая группа процессов управляется процессом-сборщиком, которому нужно сообщать, когда один из процессов — например, служба, выполнившая двойное создание (fork) — завершается (возможно для того, чтобы её можно было перезапустить). Некоторые инфраструктуры B<init>(1) (например, B<systemd>(1)) используют a процесс-сборщик для этих целей.

source: B<PR_GET_CHILD_SUBREAPER> (since Linux 3.4)
ru: B<PR_GET_CHILD_SUBREAPER> (начиная с Linux 3.4)

source: Return the "child subreaper" setting of the caller, in the location pointed to by I<(int\ *) arg2>.
ru: Возвращает значение атрибута «сборщика потомков» вызывающего в расположение, указанное I<(int\ *) arg2>.

source: B<PR_SET_DUMPABLE> (since Linux 2.3.20)
ru: B<PR_SET_DUMPABLE> (начиная с Linux 2.3.20)

source: Set the state of the "dumpable" flag, which determines whether core dumps are produced for the calling process upon delivery of a signal whose default behavior is to produce a core dump.
ru: Установить состояние флага «дампа», определяющего создание файла core вызывающего процесса после доставки сигнала, чьё поведение по умолчанию вызывает создание файла core.

source: In kernels up to and including 2.6.12, I<arg2> must be either 0 (B<SUID_DUMP_DISABLE>, process is not dumpable) or 1 (B<SUID_DUMP_USER>, process is dumpable). Between kernels 2.6.13 and 2.6.17, the value 2 was also permitted, which caused any binary which normally would not be dumped to be dumped readable by root only; for security reasons, this feature has been removed. (See also the description of I</proc/sys/fs/\:suid_dumpable> in B<proc>(5).)
ru: В ядрах по 2.6.12 включительно, значение I<arg2> должно быть равно 0 (B<SUID_DUMP_DISABLE>, от процесса не остаётся дампа) или 1 (B<SUID_DUMP_USER>, после процесса остаётся дамп). Между ядрами 2.6.13 и 2.6.17, также было разрешено значение 2, означающее что от любого исполняемого файла, обычно дампа не остаётся, но суперпользователь может это сделать; для улучшения безопасности эта возможность была удалена (смотрите также описание I</proc/sys/fs/\:suid_dumpable> в B<proc>(5)).

source: Normally, this flag is set to 1. However, it is reset to the current value contained in the file I</proc/sys/fs/\:suid_dumpable> (which by default has the value 0), in the following circumstances:
ru: Обычно, значение этого флага равно 1. Однако, оно сбрасывается в текущее значение, содержащееся в файле I</proc/sys/fs/\:suid_dumpable> (которое по умолчанию равно 0), в следующих случаях:

source: The process's effective user or group ID is changed.
ru: Изменён эффективный идентификатор пользователя или группы процесса.

source: The process's filesystem user or group ID is changed (see B<credentials>(7)).
ru: Изменён процессный идентификатор пользователя или группы файловой системы (смотрите B<credentials>(7)).

source: The process executes (B<execve>(2)) a set-user-ID or set-group-ID program, resulting in a change of either the effective user ID or the effective group ID.
ru: Процесс выполняет (B<execve>(2)) программу с установленным битом set-user-ID или set-group-ID, что приводит к изменению идентификатора эффективного пользователя или эффективной группы.

source: The process executes (B<execve>(2)) a program that has file capabilities (see B<capabilities>(7)), but only if the permitted capabilities gained exceed those already permitted for the process.
ru: Процесс выполняет (B<execve>(2)) программу, которая имеет файловые мандаты (смотрите B<capabilities>(7)), но только если полученные разрешенные мандаты превосходят уже разрешенные для процесса.

source: Processes that are not dumpable can not be attached via B<ptrace>(2) B<PTRACE_ATTACH>; see B<ptrace>(2) for further details.
ru: Процессы, для которых невозможен дамп, нельзя присоединить через операцию B<ptrace>2() B<PTRACE_ATTACH>; подробности смотрите в B<ptrace>(2).

source: If a process is not dumpable, the ownership of files in the process's I</proc/[pid]> directory is affected as described in B<proc>(5).
ru: Если для процесса невозможен дамп, то на владение файлами в каталоге процесса I</proc/[pid]> действуют правила, описанные в B<proc>(5).

source: B<PR_GET_DUMPABLE> (since Linux 2.3.20)
ru: B<PR_GET_DUMPABLE> (начиная с Linux 2.3.20)

source: Return (as the function result) the current state of the calling process's dumpable flag.
ru: Возвращает (как результат функции) текущее состояние флага дампа вызывающего процесса.

source: B<PR_SET_ENDIAN> (since Linux 2.6.18, PowerPC only)
ru: B<PR_SET_ENDIAN> (начиная с Linux 2.6.18, только для PowerPC)

source: Set the endian-ness of the calling process to the value given in I<arg2>, which should be one of the following: B<PR_ENDIAN_BIG>, B<PR_ENDIAN_LITTLE>, or B<PR_ENDIAN_PPC_LITTLE> (PowerPC pseudo little endian).
ru: Устанавливает порядок байт вызывающего процесса равным значению I<arg2>, которое может быть одним из: B<PR_ENDIAN_BIG>, B<PR_ENDIAN_LITTLE> или B<PR_ENDIAN_PPC_LITTLE> (для PowerPC псевдо обратный порядок (pseudo little endian)).

source: B<PR_GET_ENDIAN> (since Linux 2.6.18, PowerPC only)
ru: B<PR_GET_ENDIAN> (начиная с Linux 2.6.18, только для PowerPC)

source: Return the endian-ness of the calling process, in the location pointed to by I<(int\ *) arg2>.
ru: Записывает значение порядка байт вызывающего процесса по адресу, указанному в I<(int\ *) arg2>.

source: B<PR_SET_FP_MODE> (since Linux 4.0, only on MIPS)
ru: B<PR_SET_FP_MODE> (начиная с Linux 4.0, только на MIPS)

source: On the MIPS architecture, user-space code can be built using an ABI which permits linking with code that has more restrictive floating-point (FP) requirements. For example, user-space code may be built to target the O32 FPXX ABI and linked with code built for either one of the more restrictive FP32 or FP64 ABIs. When more restrictive code is linked in, the overall requirement for the process is to use the more restrictive floating-point mode.
ru: На архитектуре MIPS код пользовательского пространства можно собирать используя ABI, который позволяет компоновку с кодом, имеющем более ограничительные требования для плавающей запятой (FP). Например, код пользовательского пространства может собираться для цели O32 FPXX ABI и компоноваться с кодом, собранным с одним из более ограничительных FP32 или FP64 ABI. При этом требование всего процесса устанавливается в более ограничительный режим плавающей запятой.

source: Because the kernel has no means of knowing in advance which mode the process should be executed in, and because these restrictions can change over the lifetime of the process, the B<PR_SET_FP_MODE> operation is provided to allow control of the floating-point mode from user space.
ru: Так как ядро не знает в каком режиме должен запускаться процесс и ограничения могут измениться во время работы процесса, создана операция B<PR_SET_FP_MODE>, позволяющая контролировать режим плавающей запятой из пользовательского пространства.

source: The I<(unsigned int) arg2> argument is a bit mask describing the floating-point mode used:
ru: В аргументе I<(unsigned int) arg2> указывается битовая маска, описывающая используемый режим плавающей запятой:

source: When this bit is I<unset> (so called B<FR=0> or B<FR0> mode), the 32 floating-point registers are 32 bits wide, and 64-bit registers are represented as a pair of registers (even- and odd- numbered, with the even-numbered register containing the lower 32 bits, and the odd-numbered register containing the higher 32 bits).
ru: Если это бит I<сброшен> (так называемый режим B<FR=0> или B<FR0>), то ширина 32 регистров плавающей запятой равна 32, а 64-битные регистры представляются в виде пары регистров (с чётными и нечётными номерами; регистры с чётными номерами содержат 32 младших бита, а с нечётными номерами 32 старших бита).

source: When this bit is I<set> (on supported hardware), the 32 floating-point registers are 64 bits wide (so called B<FR=1> or B<FR1> mode). Note that modern MIPS implementations (MIPS R6 and newer) support B<FR=1> mode only.
ru: Если этот бит I<установлен> (есть поддержка в оборудовании), то ширина 32 регистров плавающей запятой равна 64 (так называемый режим B<FR=1> или B<FR1>). Заметим, что современные реализации MIPS (MIPS R6 и новее) поддерживают только режим B<FR=1>.

source: Applications that use the O32 FP32 ABI can operate only when this bit is I<unset> (B<FR=0>; or they can be used with FRE enabled, see below). Applications that use the O32 FP64 ABI (and the O32 FP64A ABI, which exists to provide the ability to operate with existing FP32 code; see below) can operate only when this bit is I<set> (B<FR=1>). Applications that use the O32 FPXX ABI can operate with either B<FR=0> or B<FR=1>.
ru: Приложения, использующие O32 FP32 ABI, могут работать только когда этот бит I<сброшен> (B<FR=0>; или они могут использоваться с включённым FRE, смотрите ниже). Приложения, использующие O32 FP64 ABI (и O32 FP64A ABI, существующий для предоставления возможности работы с существующим кодом FP32; смотрите ниже), могут работать только когда этот бит I<установлен> (B<FR=1>). Приложения, использующие O32 FPXX ABI, могут работать и с B<FR=0> и с B<FR=1>.
