Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Set the name of the calling thread, using the value in the location pointed to by I<(char\ *) arg2>. The name can be up to 16 bytes long, including the terminating null byte. (If the length of the string, including the terminating null byte, exceeds 16 bytes, the string is silently truncated.) This is the same attribute that can be set via B<pthread_setname_np>(3) and retrieved using B<pthread_getname_np>(3). The attribute is likewise accessible via I</proc/self/task/[tid]/comm>, where I<tid> is the name of the calling thread.
ru: Назначает имя вызывающей нити, используя значение памяти, переданное в указателе I<(char\ *) arg2>. Имя может быть не более 16, включая завершающий байт null (если длина строки, включая завершающий null, превышает 16 байт, то строка просто обрезается). Это то же атрибут, который можно установить через B<pthread_setname_np>(3) и получить с помощью B<pthread_getname_np>(3). Также этот атрибут доступен через I</proc/self/task/[tid]/comm>, где I<tid> — имя вызывающей нити.

source: B<PR_GET_NAME> (since Linux 2.6.11)
ru: B<PR_GET_NAME> (начиная с Linux 2.6.11)

source: Return the name of the calling thread, in the buffer pointed to by I<(char\ *) arg2>. The buffer should allow space for up to 16 bytes; the returned string will be null-terminated.
ru: Записывает имя вызывающей нити в буфер, указанный в I<(char\ *) arg2>. Буфер должен быть не более 16 байт; полученная строка будет завершаться null.

source: B<PR_SET_NO_NEW_PRIVS> (since Linux 3.5)
ru: B<PR_SET_NO_NEW_PRIVS> (начиная с Linux 3.5)

source: Set the calling thread's I<no_new_privs> attribute to the value in I<arg2>. With I<no_new_privs> set to 1, B<execve>(2) promises not to grant privileges to do anything that could not have been done without the B<execve>(2) call (for example, rendering the set-user-ID and set-group-ID mode bits, and file capabilities non-functional). Once set, this the I<no_new_privs> attribute cannot be unset. The setting of this attribute is inherited by children created by B<fork>(2) and B<clone>(2), and preserved across B<execve>(2).
ru: Устанавливает атрибут I<no_new_privs> вызывающей нити равным I<arg2>. Если значение I<no_new_privs> равно 1, то B<execve>(2) не выдаст прав никому, кто бы не мог это сделать без вызова B<execve>(2) (например, без битов прав режима set-user-ID и set-group-ID и файловых мандатов). После установки атрибута I<no_new_privs> его нельзя сбросить. Значение этого атрибута наследуется потомками, созданными с помощью B<fork>(2) и B<clone>(2), и сохраняется при B<execve>(2).

source: Since Linux 4.10, the value of a thread's I<no_new_privs> attribute can be viewed via the I<NoNewPrivs> field in the I</proc/[pid]/status> file.
ru: Начиная с Linux 4.10, значения атрибута I<no_new_privs> нити отражено в поле I<NoNewPrivs> файла I</proc/[pid]/status>.

source: For more information, see the kernel source file I<Documentation/userspace-api/no_new_privs.rst> (or I<Documentation/prctl/no_new_privs.txt> before Linux 4.13). See also B<seccomp>(2).
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/userspace-api/no_new_privs.rst> (или в I<Documentation/prctl/no_new_privstxt> до Linux 4.13). Также смотрите B<seccomp>(2).

source: B<PR_GET_NO_NEW_PRIVS> (since Linux 3.5)
ru: B<PR_GET_NO_NEW_PRIVS> (начиная с Linux 3.5)

source: Return (as the function result) the value of the I<no_new_privs> attribute for the calling thread. A value of 0 indicates the regular B<execve>(2) behavior. A value of 1 indicates B<execve>(2) will operate in the privilege-restricting mode described above.
ru: Возвращает значение (как результат функции) атрибута I<no_new_privs> в вызывающей нити. Значение 0 соответствует обычному поведению B<execve>(2). Значение 1 показывает, что B<execve>(2) будет работать в ограничивающем права режиме, как описано ранее.

source: B<PR_SET_PDEATHSIG> (since Linux 2.1.57)
ru: B<PR_SET_PDEATHSIG> (начиная с Linux 2.1.57)

source: Set the parent-death signal of the calling process to I<arg2> (either a signal value in the range 1..maxsig, or 0 to clear). This is the signal that the calling process will get when its parent dies.
ru: Устанавливает значение сигнала, приходящего процессу при завершении работы родительского процесса, равным I<arg2> (значение может быть из диапазона 1..maxsig или 0 для снятия). Этот сигнал получит вызывающий процесс, когда его родитель завершит работу.

source: I<Warning>: the "parent" in this case is considered to be the I<thread> that created this process. In other words, the signal will be sent when that thread terminates (via, for example, B<pthread_exit>(3)), rather than after all of the threads in the parent process terminate.
ru: I<Предупреждение>: «родителем» здесь считается I<нить>, создавшая этот процесс. Иначе говоря, сигнал будет послан при завершении нити (например, с помощью B<pthread_exit>(3)), а не всех нитей родительского процесса.

source: The parent-death signal is sent upon subsequent termination of the parent thread and also upon termination of each subreaper process (see the description of B<PR_SET_CHILD_SUBREAPER> above) to which the caller is subsequently reparented. If the parent thread and all ancestor subreapers have already terminated by the time of the B<PR_SET_PDEATHSIG> operation, then no parent-death signal is sent to the caller.
ru: Сигнал отправляется после завершения родительской нити, а также после завершения каждого процесса-сборщика потомков (смотрите описание B<PR_SET_CHILD_SUBREAPER> выше), которыми вызывающий был последовательно усыновлён. Если родительская нить и все предки сборщиков завершили работу на момент операции B<PR_SET_PDEATHSIG>, то сигнал о завершении вызывающему не посылается.

source: The parent-death signal is process-directed (see B<signal>(7)) and, if the child installs a handler using the B<sigaction>(2) B<SA_SIGINFO> flag, the I<si_pid> field of the I<siginfo_t> argument of the handler contains the PID of the terminating parent process.
ru: Сигнал о завершении родителя направляется процессу (смотрите B<signal>(7)) и, если потомок установил обработчик использовав B<sigaction>(2) с флагом B<SA_SIGINFO>, то поле I<si_pid> аргумента I<siginfo_t> обработчика содержит PID завершающегося родительского процесса.

source: The parent-death signal setting is cleared for the child of a B<fork>(2). It is also (since Linux 2.4.36 / 2.6.23) cleared when executing a set-user-ID or set-group-ID binary, or a binary that has associated capabilities (see B<capabilities>(7)); otherwise, this value is preserved across B<execve>(2).
ru: Значение сигнала о завершении родителя очищается для потомков, созданных B<fork>(2). Он также очищается (начиная с Linux 2.4.36 / 2.6.23) при выполнении исполняемого файла с установленным битом set-user-ID или set-group-ID, и исполняемого файла с соответствующими мандатами (смотрите B<capabilities>(7)); иначе это значение сохраняется при B<execve>(2).

source: B<PR_GET_PDEATHSIG> (since Linux 2.3.15)
ru: B<PR_GET_PDEATHSIG> (начиная с Linux 2.3.15)

source: Return the current value of the parent process death signal, in the location pointed to by I<(int\ *) arg2>.
ru: Записывает текущее значение сигнала о завершении работы родительского процесса по адресу, указанному в I<(int\ *) arg2>.

source: B<PR_SET_PTRACER> (since Linux 3.4)
ru: B<PR_SET_PTRACER> (начиная с Linux 3.4)

source: This is meaningful only when the Yama LSM is enabled and in mode 1 ("restricted ptrace", visible via I</proc/sys/kernel/yama/ptrace_scope>). When a "ptracer process ID" is passed in I<arg2>, the caller is declaring that the ptracer process can B<ptrace>(2) the calling process as if it were a direct process ancestor. Each B<PR_SET_PTRACER> operation replaces the previous "ptracer process ID". Employing B<PR_SET_PTRACER> with I<arg2> set to 0 clears the caller's "ptracer process ID". If I<arg2> is B<PR_SET_PTRACER_ANY>, the ptrace restrictions introduced by Yama are effectively disabled for the calling process.
ru: Имеет смысл, только если включён Yama LSM и в режиме 1 («ограниченный ptrace», значение доступно в I</proc/sys/kernel/yama/ptrace_scope>). Когда «идентификатор процесса ptracer» передаётся в I<arg2>, вызывающий объявляет, что процесс ptracer может выполнить B<ptrace>(2), как если бы он был прямым предком процесса. Каждая операция B<PR_SET_PTRACER> заменяет предыдущий «идентификатор процесса ptracer». Применение B<PR_SET_PTRACER> с значением I<arg2> равным 0 очищает «идентификатор процесса ptracer» вызывающего. Если I<arg2> равно B<PR_SET_PTRACER_ANY>, то ограничения ptrace, предоставленные Yama отключаются для вызывающего процесса.

source: For further information, see the kernel source file I<Documentation/admin-guide/LSM/Yama.rst> (or I<Documentation/security/Yama.txt> before Linux 4.13).
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/admin-guide/LSM/Yama.rst> (или в I<Documentation/security/Yama.txt> до Linux 4.13).

source: B<PR_SET_SECCOMP> (since Linux 2.6.23)
ru: B<PR_SET_SECCOMP> (начиная с Linux 2.6.23)

source: Set the secure computing (seccomp) mode for the calling thread, to limit the available system calls. The more recent B<seccomp>(2) system call provides a superset of the functionality of B<PR_SET_SECCOMP>.
ru: Устанавливает режим безопасных вычислений (seccomp) в вызывающей нити, в котором ограничен список доступных системных вызовов. Новый системный вызов B<seccomp>(2) предоставляет большие возможности чем B<PR_SET_SECCOMP>.

source: The seccomp mode is selected via I<arg2>. (The seccomp constants are defined in I<E<lt>linux/seccomp.hE<gt>>.)
ru: Режим seccomp выбирается из I<arg2> (константы seccomp определены в I<E<lt>linux/seccomp.hE<gt>>).

source: With I<arg2> set to B<SECCOMP_MODE_STRICT>, the only system calls that the thread is permitted to make are B<read>(2), B<write>(2), B<_exit>(2) (but not B<exit_group>(2)), and B<sigreturn>(2). Other system calls result in the delivery of a B<SIGKILL> signal. Strict secure computing mode is useful for number-crunching applications that may need to execute untrusted byte code, perhaps obtained by reading from a pipe or socket. This operation is available only if the kernel is configured with B<CONFIG_SECCOMP> enabled.
ru: Если значение I<arg2> равно B<SECCOMP_MODE_STRICT>, то в нити доступны только системные вызовы B<read>(2), B<write>(2), B<_exit>(2) (но не B<exit_group>(2)) и B<sigreturn>(2). При запуске других системных вызовов генерируется сигнал B<SIGKILL>. Режим безопасных вычислений полезен для вычислительных приложений, которым может потребоваться выполнить недоверительный байт-код, возможно полученный при чтении из канала или сокета. Эта операция доступна только, если в ядре включён параметр B<CONFIG_SECCOMP>.

source: With I<arg2> set to B<SECCOMP_MODE_FILTER> (since Linux 3.5), the system calls allowed are defined by a pointer to a Berkeley Packet Filter passed in I<arg3>. This argument is a pointer to I<struct sock_fprog>; it can be designed to filter arbitrary system calls and system call arguments. This mode is available only if the kernel is configured with B<CONFIG_SECCOMP_FILTER> enabled.
ru: Если значение I<arg2> равно B<SECCOMP_MODE_FILTER> (начиная с Linux 3.5), то список разрешённых системных вызовов определяется указателем (I<arg3>) на пакетный фильтр Berkeley. Аргумент указывает на I<struct sock_fprog>; в структуре можно описать фильтр и произвольных системных вызовов и их аргументов. Этот режим доступен только, если ядро собрано с параметром B<CONFIG_SECCOMP_FILTER>.

source: If B<SECCOMP_MODE_FILTER> filters permit B<fork>(2), then the seccomp mode is inherited by children created by B<fork>(2); if B<execve>(2) is permitted, then the seccomp mode is preserved across B<execve>(2). If the filters permit B<prctl>() calls, then additional filters can be added; they are run in order until the first non-allow result is seen.
ru: Если в фильтрах B<SECCOMP_MODE_FILTER> разрешён B<fork>(2), то режим seccomp наследуется потомками, создаваемыми B<fork>(2); если разрешён B<execve>(2), то режим seccomp сохраняется при B<execve>(2). Если в фильтрах разрешены B<prctl>(), то могут быть добавлены дополнительные фильтры; они применяются до тех пор пока не будет найдено запрещение.

source: For further information, see the kernel source file I<Documentation/userspace-api/seccomp_filter.rst> (or I<Documentation/prctl/seccomp_filter.txt> before Linux 4.13).
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/userspace-api/seccomp_filter.rst> (или в I<Documentation/prctl/seccomp_filter.txt> до Linux 4.13).

source: B<PR_GET_SECCOMP> (since Linux 2.6.23)
ru: B<PR_GET_SECCOMP> (начиная с Linux 2.6.23)

source: Return (as the function result) the secure computing mode of the calling thread. If the caller is not in secure computing mode, this operation returns 0; if the caller is in strict secure computing mode, then the B<prctl>() call will cause a B<SIGKILL> signal to be sent to the process. If the caller is in filter mode, and this system call is allowed by the seccomp filters, it returns 2; otherwise, the process is killed with a B<SIGKILL> signal. This operation is available only if the kernel is configured with B<CONFIG_SECCOMP> enabled.
ru: Возвращает значение (как результат функции) режима безопасных вычислений вызвавшей нити. Если вызывающий не работает в режиме безопасных вычислений, то возвращается 0; если вызывающий находится в режиме ограниченных безопасных вычислений, то вызов B<prctl>() приведёт к отправке процессу сигнала B<SIGKILL>. Если вызывающий работает в режиме фильтрации и данный системный вызов разрешён в фильтрах seccomp, то возвращается 2; в противном случае процесс завершается по сигналу B<SIGKILL>. Эта операция доступна только, если ядро собрано с параметром B<CONFIG_SECCOMP>.

source: Since Linux 3.8, the I<Seccomp> field of the I</proc/[pid]/status> file provides a method of obtaining the same information, without the risk that the process is killed; see B<proc>(5).
ru: Начиная с Linux 3.8 в поле I<Seccomp> файла I</proc/[pid]/status> предоставляется метод получения той же информации, без риска уничтожения процесса; смотрите B<proc>(5).

source: B<PR_SET_SECUREBITS> (since Linux 2.6.26)
ru: B<PR_SET_SECUREBITS> (начиная с Linux 2.6.26)

source: Set the "securebits" flags of the calling thread to the value supplied in I<arg2>. See B<capabilities>(7).
ru: Устанавливает значение флагов «securebits» вызывающей нити равным значению I<arg2>. Смотрите B<capabilities>(7).

source: B<PR_GET_SECUREBITS> (since Linux 2.6.26)
ru: B<PR_GET_SECUREBITS> (начиная с Linux 2.6.26)

source: Return (as the function result) the "securebits" flags of the calling thread. See B<capabilities>(7).
ru: Возвращает (как результат функции) флаги «securebits» вызывающей нити. Смотрите B<capabilities>(7).

source: B<PR_GET_SPECULATION_CTRL> (since Linux 4.17)
ru: B<PR_GET_SPECULATION_CTRL> (начиная с Linux 4.17)

source: Returns the state of the speculation misfeature specified in I<arg2>. Currently, the only permitted value for this argument is B<PR_SPEC_STORE_BYPASS> (otherwise the call fails with the error B<ENODEV>).
ru: Возвращает состояние нежелательной спекулятовности, указанной в I<arg2>. В настоящее время значением аргумента может быть только B<PR_SPEC_STORE_BYPASS> (в противном случае возвращается ошибка B<ENODEV>).

source: The return value uses bits 0-3 with the following meaning:
ru: В значении результата используются биты 0-3:

source: Mitigation can be controlled per thread by B<PR_SET_SPECULATION_CTRL>
ru: Смягчение (mitigation) можно контролировать на уровне нити через B<PR_SET_SPECULATION_CTRL>

source: The speculation feature is enabled, mitigation is disabled.
ru: Свойство спекулятивности включено, смягчение выключено.

source: The speculation feature is disabled, mitigation is enabled
ru: Свойство спекулятивности выключено, смягчение включено

source: Same as B<PR_SPEC_DISABLE> but cannot be undone.
ru: Тоже, что и B<PR_SPEC_DISABLE>, но нельзя отменить.

source: If all bits are 0, then the CPU is not affected by the speculation misfeature.
ru: Если все биты равны 0, то на ЦП нежелательная спекулятовность не работает.

source: If B<PR_SPEC_PRCTL> is set, then per-thread control of the mitigation is available. If not set, B<prctl>() for the speculation misfeature will fail.
ru: Если установлен B<PR_SPEC_PRCTL>, то доступно управление смягчением на уровне нити. Если не установлен, то вызов B<prctl>() для нежелательной спекулятовности завершится ошибкой.

source: The I<arg3>, I<arg4>, and I<arg5> arguments must be specified as 0; otherwise the call fails with the error B<EINVAL>.
ru: Аргументы I<arg3>, I<arg4> и I<arg5> должны быть равны 0; в противном случае вызов завершается ошибкой B<EINVAL>.

source: B<PR_SET_SPECULATION_CTRL> (since Linux 4.17)
ru: B<PR_SET_SPECULATION_CTRL> (начиная с Linux 4.17)

source: Sets the state of the speculation misfeature specified in I<arg2>. Currently, the only permitted value for this argument is B<PR_SPEC_STORE_BYPASS> (otherwise the call fails with the error B<ENODEV>). This setting is a per-thread attribute. The I<arg3> argument is used to hand in the control value, which is one of the following:
ru: Задаёт состояние нежелательной спекулятовности, согласно значению I<arg2>. В настоящее время значением аргумента может быть только B<PR_SPEC_STORE_BYPASS> (в противном случае возвращается ошибка B<ENODEV>).Данная настройка является атрибутом нити. Аргумент I<arg3> используется как управляющее значение, которое может быть одним из следующих:

source: Same as B<PR_SPEC_DISABLE> but cannot be undone. A subsequent B<prctl(..., PR_SPEC_ENABLE)> will fail with the error B<EPERM>.
ru: Тоже, что и B<PR_SPEC_DISABLE>, но нельзя отменить. Последующий вызов B<prctl(..., PR_SPEC_ENABLE)> завершится ошибкой B<EPERM>.

source: Any other value in I<arg3> will result in the call failing with the error B<ERANGE>.
ru: Любое другое значение в I<arg3> приведёт к ошибке B<ERANGE>.

source: The I<arg4> and I<arg5> arguments must be specified as 0; otherwise the call fails with the error B<EINVAL>.
ru: Аргументы I<arg4> и I<arg5> должны быть равны 0; в противном случае вызов завершается ошибкой B<EINVAL>.

source: The speculation feature can also be controlled by the B<spec_store_bypass_disable> boot parameter. This parameter may enforce a read-only policy which will result in the B<prctl>(2) call failing with the error B<ENXIO>. For further details, see the kernel source file I<Documentation/admin-guide/kernel-parameters.txt>.
ru: Свойство спекулятивного выполнения также может контролироваться параметром загрузки B<spec_store_bypass_disable>. Это параметр может установить режим только для чтения, при котором вызов B<prctl>(2) будет завершаться ошибкой B<ENXIO>. Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/admin-guide/kernel-parameters.txt>.

source: B<PR_SET_THP_DISABLE> (since Linux 3.15)
ru: B<PR_SET_THP_DISABLE> (начиная с Linux 3.15)

source: Set the state of the "THP disable" flag for the calling thread. If I<arg2> has a nonzero value, the flag is set, otherwise it is cleared. Setting this flag provides a method for disabling transparent huge pages for jobs where the code cannot be modified, and using a malloc hook with B<madvise>(2) is not an option (i.e., statically allocated data). The setting of the "THP disable" flag is inherited by a child created via B<fork>(2) and is preserved across B<execve>(2).
ru: Задать состояние флага «THP disable» вызывающей нити. Если I<arg2> не равно нулю, то флаг устанавливается, иначе очищается. Установка этого флага предоставляет метод отключения прозрачных огромных страниц для заданий, код которых нельзя изменить и использование обработчика malloc с B<madvise>(2) невозможно (т. е., место под данные выделено статически). Значение флага «THP disable» наследуется потомком, создаваемым B<fork>(2) и сохраняется после B<execve>(2).

source: B<PR_TASK_PERF_EVENTS_DISABLE> (since Linux 2.6.31)
ru: B<PR_TASK_PERF_EVENTS_DISABLE> (начиная с Linux 2.6.31)

source: Disable all performance counters attached to the calling process, regardless of whether the counters were created by this process or another process. Performance counters created by the calling process for other processes are unaffected. For more information on performance counters, see the Linux kernel source file I<tools/perf/design.txt>.
ru: Отключает все счётчики производительности, прикреплённые к вызывающему процессу, не учитывая, были ли они созданы этим процессом или каким-то другим. Счётчики производительности, созданные вызывающим процессом для других процессов, не отключаются. Подробности о счётчиках производительности приведены в файле ядра Linux I<tools/perf/design.txt>.

source: Originally called B<PR_TASK_PERF_COUNTERS_DISABLE>; renamed (retaining the same numerical value) in Linux 2.6.32.
ru: Сначала назывался B<PR_TASK_PERF_COUNTERS_DISABLE>; переименован (числовое значение не изменилось) в Linux 2.6.32.

source: B<PR_TASK_PERF_EVENTS_ENABLE> (since Linux 2.6.31)
ru: B<PR_TASK_PERF_EVENTS_ENABLE> (начиная с Linux 2.6.31)

source: The converse of B<PR_TASK_PERF_EVENTS_DISABLE>; enable performance counters attached to the calling process.
ru: Противоположное действие B<PR_TASK_PERF_EVENTS_DISABLE>; включает счётчики производительности, прикреплённые к вызывающему процессу.

source: Originally called B<PR_TASK_PERF_COUNTERS_ENABLE>; renamed in Linux 2.6.32.
ru: Сначала назывался B<PR_TASK_PERF_COUNTERS_ENABLE>; переименован в Linux 2.6.32.

source: B<PR_GET_THP_DISABLE> (since Linux 3.15)
ru: B<PR_GET_THP_DISABLE> (начиная с Linux 3.15)

source: Return (via the function result) the current setting of the "THP disable" flag for the calling thread: either 1, if the flag is set, or 0, if it is not.
ru: Возвращает текущее значение (как результат функции) флага «THP disable» вызывающей нити: 1 — флаг установлен; 0 — нет.

source: B<PR_GET_TID_ADDRESS> (since Linux 3.5)
ru: B<PR_GET_TID_ADDRESS> (начиная с Linux 3.5)

source: Retrieve the I<clear_child_tid> address set by B<set_tid_address>(2) and the B<clone>(2) B<CLONE_CHILD_CLEARTID> flag, in the location pointed to by I<(int\ **)\ arg2>. This feature is available only if the kernel is built with the B<CONFIG_CHECKPOINT_RESTORE> option enabled. Note that since the B<prctl>() system call does not have a compat implementation for the AMD64 x32 and MIPS n32 ABIs, and the kernel writes out a pointer using the kernel's pointer size, this operation expects a user-space buffer of 8 (not 4) bytes on these ABIs.
ru: Возвращает адрес I<clear_child_tid>, заданный B<set_tid_address>(2) и B<clone>(2) с флагом B<CLONE_CHILD_CLEARTID>, в расположение, указанное в I<(int\ **)\ arg2>. Эта возможность доступна только, если ядро собрано с параметром B<CONFIG_CHECKPOINT_RESTORE>. Заметим, что так как системный вызов B<prctl>() не содержит совместимой реализации для AMD64 x32 и MIPS n32 ABI и ядро записывает указатель размером с ядерный, то эта операция требует пользовательский буфер в 8 (не 4) байт в этих ABI.

source: B<PR_SET_TIMERSLACK> (since Linux 2.6.28)
ru: B<PR_SET_TIMERSLACK> (начиная с Linux 2.6.28)
