Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: $B< ./a.out 0x3000000> posix_memalign() allocated at 0x40197000 Thread attributes: Detach state = PTHREAD_CREATE_DETACHED Scope = PTHREAD_SCOPE_SYSTEM Inherit scheduler = PTHREAD_EXPLICIT_SCHED Scheduling policy = SCHED_OTHER Scheduling priority = 0 Guard size = 0 bytes Stack address = 0x40197000 Stack size = 0x3000000 bytes
ru: $B< ./a.out 0x3000000> posix_memalign() выделен по адресу 0x40197000 Атрибуты нити: Состояние отсоединения = PTHREAD_CREATE_DETACHED Область = PTHREAD_SCOPE_SYSTEM Унаследованный планировщик = PTHREAD_EXPLICIT_SCHED Алгоритм планирования = SCHED_OTHER Приоритет планирования = 0 Размер защиты = 0 байт Адрес стека = 0x40197000 Размер стека = 0x3000000 байт

source: s = pthread_attr_getdetachstate(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getdetachstate"); printf("%sDetach state = %s\en", prefix, (i == PTHREAD_CREATE_DETACHED) ? "PTHREAD_CREATE_DETACHED" : (i == PTHREAD_CREATE_JOINABLE) ? "PTHREAD_CREATE_JOINABLE" : "???");
ru: s = pthread_attr_getdetachstate(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getdetachstate"); printf("%sСостояние отсоединения = %s\en", prefix, (i == PTHREAD_CREATE_DETACHED) ? "PTHREAD_CREATE_DETACHED" : (i == PTHREAD_CREATE_JOINABLE) ? "PTHREAD_CREATE_JOINABLE" : "???");

source: s = pthread_attr_getscope(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getscope"); printf("%sScope = %s\en", prefix, (i == PTHREAD_SCOPE_SYSTEM) ? "PTHREAD_SCOPE_SYSTEM" : (i == PTHREAD_SCOPE_PROCESS) ? "PTHREAD_SCOPE_PROCESS" : "???");
ru: s = pthread_attr_getscope(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getscope"); printf("%sОбласть = %s\en", prefix, (i == PTHREAD_SCOPE_SYSTEM) ? "PTHREAD_SCOPE_SYSTEM" : (i == PTHREAD_SCOPE_PROCESS) ? "PTHREAD_SCOPE_PROCESS" : "???");

source: s = pthread_attr_getinheritsched(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getinheritsched"); printf("%sInherit scheduler = %s\en", prefix, (i == PTHREAD_INHERIT_SCHED) ? "PTHREAD_INHERIT_SCHED" : (i == PTHREAD_EXPLICIT_SCHED) ? "PTHREAD_EXPLICIT_SCHED" : "???");
ru: s = pthread_attr_getinheritsched(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getinheritsched"); printf("%sУнаследованный планировщик = %s\en", prefix, (i == PTHREAD_INHERIT_SCHED) ? "PTHREAD_INHERIT_SCHED" : (i == PTHREAD_EXPLICIT_SCHED) ? "PTHREAD_EXPLICIT_SCHED" : "???");

source: s = pthread_attr_getschedpolicy(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getschedpolicy"); printf("%sScheduling policy = %s\en", prefix, (i == SCHED_OTHER) ? "SCHED_OTHER" : (i == SCHED_FIFO) ? "SCHED_FIFO" : (i == SCHED_RR) ? "SCHED_RR" : "???");
ru: s = pthread_attr_getschedpolicy(attr, &i); if (s != 0) handle_error_en(s, "pthread_attr_getschedpolicy"); printf("%sАлгоритм планирования = %s\en", prefix, (i == SCHED_OTHER) ? "SCHED_OTHER" : (i == SCHED_FIFO) ? "SCHED_FIFO" : (i == SCHED_RR) ? "SCHED_RR" : "???");

source: s = pthread_attr_getschedparam(attr, &sp); if (s != 0) handle_error_en(s, "pthread_attr_getschedparam"); printf("%sScheduling priority = %d\en", prefix, sp.sched_priority);
ru: s = pthread_attr_getschedparam(attr, &sp); if (s != 0) handle_error_en(s, "pthread_attr_getschedparam"); printf("%sПриоритет планирования = %d\en", prefix, sp.sched_priority);

source: s = pthread_attr_getguardsize(attr, &v); if (s != 0) handle_error_en(s, "pthread_attr_getguardsize"); printf("%sGuard size = %zu bytes\en", prefix, v);
ru: s = pthread_attr_getguardsize(attr, &v); if (s != 0) handle_error_en(s, "pthread_attr_getguardsize"); printf("%sРазмер защиты = %zu bytes\en", prefix, v);

source: s = pthread_attr_getstack(attr, &stkaddr, &v); if (s != 0) handle_error_en(s, "pthread_attr_getstack"); printf("%sStack address = %p\en", prefix, stkaddr); printf("%sStack size = 0x%zx bytes\en", prefix, v); }
ru: s = pthread_attr_getstack(attr, &stkaddr, &v); if (s != 0) handle_error_en(s, "pthread_attr_getstack"); printf("%sАдрес стека = %p\en", prefix, stkaddr); printf("%sРазмер стека = 0x%zx байт\en", prefix, v); }

source: /* pthread_getattr_np() is a non-standard GNU extension that retrieves the attributes of the thread specified in its first argument */
ru: /* pthread_getattr_np() — нестандартное расширение GNU, возвращает атрибуты нити, указанной в её первом аргументе */

source: printf("Thread attributes:\en"); display_pthread_attr(&gattr, "\et");
ru: printf("Атрибуты нити:\en"); display_pthread_attr(&gattr, "\et");

source: int main(int argc, char *argv[]) { pthread_t thr; pthread_attr_t attr; pthread_attr_t *attrp; /* NULL or &attr */ int s;
ru: int main(int argc, char *argv[]) { pthread_t thr; pthread_attr_t attr; pthread_attr_t *attrp; /* NULL или &attr */ int s;

source: /* If a command-line argument was supplied, use it to set the stack-size attribute and set a few other thread attributes, and set attrp pointing to thread attributes object */
ru: /* Если в командной строке есть аргумент, то использовать его для задания атрибута размера стека и ещё некоторых других атрибутов нити, и attrp будет указывать на объект атрибутов нити */

source: printf("posix_memalign() allocated at %p\en", sp);
ru: printf("posix_memalign() выделен по адресу %p\en", sp);

source: perror - print a system error message
ru: perror - печатает системное сообщение об ошибке

source: B<int >I<errno>B<; >/* Not really declared this way; see errno(3) */
ru: B<int >I<errno>B<; >/* в реальности объявлено не так; смотрите errno(3) */

source: I<sys_errlist>, I<sys_nerr>: Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: I<sys_errlist>, I<sys_nerr>: начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE

source: The B<perror>() function produces a message on standard error describing the last error encountered during a call to a system or library function.
ru: Функция B<perror>() выводит сообщение в стандартный поток ошибок, описывающее последнюю ошибку, возникшую при вызове системной или библиотечной функции.

source: First (if I<s> is not NULL and I<*s> is not a null byte (\(aq\e0\(aq)), the argument string I<s> is printed, followed by a colon and a blank. Then an error message corresponding to the current value of I<errno> and a new-line.
ru: Сначала печатается строка из аргумента I<s> (если I<s> не равно NULL и I<*s> не указывает на байт null (\(aq\e0\(aq)), после неё двоеточие и пробел. Затем выводится сообщение о ошибке, соответствующее текущему значению I<errno>, а после этого символ новой строки.

source: To be of most use, the argument string should include the name of the function that incurred the error.
ru: Для большей информативности в строке параметра должно быть имя функции, в которой произошла ошибка.

source: The global error list I<sys_errlist>[], which can be indexed by I<errno>, can be used to obtain the error message without the newline. The largest message number provided in the table is I<sys_nerr>-1. Be careful when directly accessing this list, because new error values may not have been added to I<sys_errlist>[]. The use of I<sys_errlist>[] is nowadays deprecated; use B<strerror>(3) instead.
ru: Глобальный список ошибок I<sys_errlist>[], к которым можно обращаться по номеру I<errno>, можно использовать для получения сообщения об ошибке без символа новой строки. Самый большой номер сообщения в таблице равен I<sys_nerr>-1. Будьте внимательны при прямом доступе к этому списку, так как новые значения ошибок могут быть ещё не добавлены в I<sys_errlist>[]. В настоящее время использование I<sys_errlist>[] не рекомендуется; вместо этого используйте B<strerror>(3).

source: When a system call fails, it usually returns -1 and sets the variable I<errno> to a value describing what went wrong. (These values can be found in I<E<lt>errno.hE<gt>>.) Many library functions do likewise. The function B<perror>() serves to translate this error code into human-readable form. Note that I<errno> is undefined after a successful system call or library function call: this call may well change this variable, even though it succeeds, for example because it internally used some other library function that failed. Thus, if a failing call is not immediately followed by a call to B<perror>(), the value of I<errno> should be saved.
ru: Когда завершается ошибкой системный вызов, обычно возвращается -1 и изменяется переменная I<errno> для указания что пошло не так (её значения можно найти в I<E<lt>errno.hE<gt>>). Многие библиотечные функции работают также. Функция B<perror>() служит для перевода этого кода ошибки в форму, понятную человеку. Заметим, что значение I<errno> не определено после успешного выполнения системного вызова или библиотечной функции: этот вызов может также изменить эту переменную даже при успешном выполнении, например из-за ошибки другой библиотечной функции, которая вызывалась при работе. То есть, если после вызова функции сразу не вызывается B<perror>(), значение I<errno> нужно куда-нибудь сохранить.

source: The externals I<sys_nerr> and I<sys_errlist> derive from BSD, but are not specified in POSIX.1.
ru: Внешние I<sys_nerr> и I<sys_errlist> появились из BSD, и не описаны в POSIX.1.

source: The externals I<sys_nerr> and I<sys_errlist> are defined by glibc, but in I<E<lt>stdio.hE<gt>>.
ru: Внешние I<sys_nerr> и I<sys_errlist> определены в glibc, но в файле I<E<lt>stdio.hE<gt>>.

source: putgrent - write a group database entry to a file
ru: putgrent - записывает базу данных групп в файл

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */

source: The B<putgrent>() function is the counterpart for B<fgetgrent>(3). The function writes the content of the provided I<struct group> into the I<stream>. The list of group members must be NULL-terminated or NULL-initialized.
ru: Функция B<putgrent>() ответная часть B<fgetgrent>(3). Она записывает содержимое переданной I<struct group> в I<stream>. Список членов группы должен завершаться NULL или быть инициализированным NULL.

source: The I<struct group> is defined as follows:
ru: Структура I<struct group> определена следующим образом:

source: struct group { char *gr_name; /* group name */ char *gr_passwd; /* group password */ gid_t gr_gid; /* group ID */ char **gr_mem; /* group members */ };
ru: struct group { char *gr_name; /* имя группы */ char *gr_passwd; /* пароль группы */ gid_t gr_gid; /* идентификатор группы */ char **gr_mem; /* члены группы */ };

source: The function returns zero on success, and a nonzero value on error.
ru: Функция возвращает ноль при успешном выполнении и ненулевое значение при ошибке.

source: This function is a GNU extension.
ru: Эта функция является расширением GNU.

source: pthread_attr_setaffinity_np, pthread_attr_getaffinity_np - set/get CPU affinity attribute in thread attributes object
ru: pthread_attr_setaffinity_np, pthread_attr_getaffinity_np - изменяет/возвращает атрибут увязывания ЦП из объекта атрибутов нити

source: The B<pthread_attr_setaffinity_np>() function sets the CPU affinity mask attribute of the thread attributes object referred to by I<attr> to the value specified in I<cpuset>. This attribute determines the CPU affinity mask of a thread created using the thread attributes object I<attr>.
ru: Функция B<pthread_attr_setaffinity_np>() изменяет атрибут маски увязывания ЦП в объекте атрибутов нити, на который указывает I<attr>, в значение I<cpuset>. Данным атрибутом определяется маска увязывания ЦП у нити, созданной с учётом объекта атрибутов нити I<attr>.

source: The B<pthread_attr_getaffinity_np>() function returns the CPU affinity mask attribute of the thread attributes object referred to by I<attr> in the buffer pointed to by I<cpuset>.
ru: Функция B<pthread_attr_getaffinity_np>() возвращает атрибут маски увязывания ЦП из объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<cpuset>.

source: The argument I<cpusetsize> is the length (in bytes) of the buffer pointed to by I<cpuset>. Typically, this argument would be specified as I<sizeof(cpu_set_t)>.
ru: В аргументе I<cpusetsize> указывается длина буфера (в байтах), на который указывает I<cpuset>. Обычно, этот аргумент должен задаваться как I<sizeof(cpu_set_t)>.

source: (B<pthread_attr_setaffinity_np>()) I<cpuset> specified a CPU that was outside the set supported by the kernel. (The kernel configuration option B<CONFIG_NR_CPUS> defines the range of the set supported by the kernel data type used to represent CPU sets.)
ru: (B<pthread_attr_setaffinity_np>()) В I<cpuset> указан ЦП, который находится вне набора поддерживаемых ядром (в параметре сборки ядра B<CONFIG_NR_CPUS> определён диапазон для набора, поддерживаемого типом данных ядра, который используется для представления наборов ЦП).

source: (B<pthread_attr_getaffinity_np>()) A CPU in the affinity mask of the thread attributes object referred to by I<attr> lies outside the range specified by I<cpusetsize> (i.e., I<cpuset>/I<cpusetsize> is too small).
ru: (B<pthread_attr_getaffinity_np>()) ЦП в маске увязывания из объекта атрибутов нити, на который указывает I<attr>, находится вне диапазона, задаваемого I<cpusetsize> (т. е., I<cpuset>/I<cpusetsize> слишком мал).

source: (B<pthread_attr_setaffinity_np>()) Could not allocate memory.
ru: (B<pthread_attr_setaffinity_np>()) Невозможно выделить память.

source: pthread_attr_setscope, pthread_attr_getscope - set/get contention scope attribute in thread attributes object
ru: pthread_attr_setscope, pthread_attr_getscope - изменяет/возвращает атрибут области конкурирования из объекта атрибутов нити

source: The B<pthread_attr_setscope>() function sets the contention scope attribute of the thread attributes object referred to by I<attr> to the value specified in I<scope>. The contention scope attribute defines the set of threads against which a thread competes for resources such as the CPU. POSIX.1 specifies two possible values for I<scope>:
ru: Функция B<pthread_attr_setscope>() изменяет атрибут области конкурирования (contention scope) в объекте атрибутов нити, на который указывает I<attr>, в значение I<scope>. Данным атрибутом определяется набор нитей, с которыми нить конкурирует за ресурсы (например ЦП). В POSIX.1 указаны два возможных значения I<scope>:

source: The thread competes for resources with all other threads in all processes on the system that are in the same scheduling allocation domain (a group of one or more processors). B<PTHREAD_SCOPE_SYSTEM> threads are scheduled relative to one another according to their scheduling policy and priority.
ru: Нить конкурирует за ресурсы со всеми нитями всех процессов системы, которые находятся в том же домене планирования выделения (группа из одного или нескольких процессоров). Нити с B<PTHREAD_SCOPE_SYSTEM> запланированы друг относительно друга согласно их политике планирования и приоритета.

source: The thread competes for resources with all other threads in the same process that were also created with the B<PTHREAD_SCOPE_PROCESS> contention scope. B<PTHREAD_SCOPE_PROCESS> threads are scheduled relative to other threads in the process according to their scheduling policy and priority. POSIX.1 leaves it unspecified how these threads contend with other threads in other process on the system or with other threads in the same process that were created with the B<PTHREAD_SCOPE_SYSTEM> contention scope.
ru: Нить конкурирует за ресурсы со всеми нитями процесса, в котором она создана, и которые также созданы с областью конкурирования B<PTHREAD_SCOPE_PROCESS>. Нити с B<PTHREAD_SCOPE_PROCESS> запланированы относительно других нитей процесса согласно их политике планирования и приоритета. В POSIX.1 не указано как эти нити конкурируют с нитями из других процессов системы или с другими нитями того же процесса, которые созданы с областью конкурирования B<PTHREAD_SCOPE_SYSTEM>.

source: POSIX.1 requires that an implementation support at least one of these contention scopes. Linux supports B<PTHREAD_SCOPE_SYSTEM>, but not B<PTHREAD_SCOPE_PROCESS>.
ru: В POSIX.1 от реализации требуется поддерживать, как минимум, одну из этих областей конкурирования. В Linux поддерживается B<PTHREAD_SCOPE_SYSTEM> и не поддерживается B<PTHREAD_SCOPE_PROCESS>.

source: On systems that support multiple contention scopes, then, in order for the parameter setting made by B<pthread_attr_setscope>() to have effect when calling B<pthread_create>(3), the caller must use B<pthread_attr_setinheritsched>(3) to set the inherit-scheduler attribute of the attributes object I<attr> to B<PTHREAD_EXPLICIT_SCHED>.
ru: В системах, где есть поддержка нескольких областей конкурирования, для учёта значения параметра, заданного B<pthread_attr_setscope>(), при вызове B<pthread_create>(3), вызывающий должен использовать B<pthread_attr_setinheritsched>(3) для присвоения атрибуту inherit-scheduler объекта атрибутов I<attr> значения B<PTHREAD_EXPLICIT_SCHED>.

source: The B<pthread_attr_getscope>() function returns the contention scope attribute of the thread attributes object referred to by I<attr> in the buffer pointed to by I<scope>.
ru: Функция B<pthread_attr_getscope>() возвращает атрибут области конкурирования из объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<scope>.

source: B<pthread_attr_setscope>() can fail with the following errors:
ru: Вызов B<pthread_attr_setscope>() может завершиться со следующими ошибками:

source: An invalid value was specified in I<scope>.
ru: Указано неверное значение в I<scope>.

source: I<scope> specified the value B<PTHREAD_SCOPE_PROCESS>, which is not supported on Linux.
ru: Значение I<scope> равно B<PTHREAD_SCOPE_PROCESS>, которое не поддерживается в Linux.

source: The B<PTHREAD_SCOPE_SYSTEM> contention scope typically indicates that a user-space thread is bound directly to a single kernel-scheduling entity. This is the case on Linux for the obsolete LinuxThreads implementation and the modern NPTL implementation, which are both 1:1 threading implementations.
ru: Область конкурирования B<PTHREAD_SCOPE_SYSTEM> обычно означает, что нить пространства пользователя явно привязана к одной единице планирования ядра. В Linux это относится как к устаревшей реализации LinuxThreads так и к новой NPTL, в которых используется привязка нитей 1:1.

source: POSIX.1 specifies that the default contention scope is implementation-defined.
ru: В POSIX.1 сказано, что значение по умолчанию для области конкурирования оставляется за реализацией.

source: pthread_mutexattr_init, pthread_mutexattr_destroy - initialize and destroy a mutex attributes object
ru: pthread_mutexattr_init, pthread_mutexattr_destroy - инициализирует и уничтожает объект атрибутов мьютекса

source: The B<pthread_mutexattr_init>() function initializes the mutex attributes object pointed to by I<attr> with default values for all attributes defined by the implementation.
ru: Функция B<pthread_mutexattr_init>() инициализирует объект атрибутов мьютекса, на который указывает I<attr>, значениями по умолчанию для всех атрибутов, определённых реализацией.

source: The results of initializing an already initialized mutex attributes object are undefined.
ru: Если для инициализации указан уже инициализированный объект атрибутов мьютекса, то результат не определён.

source: The B<pthread_mutexattr_destroy>() function destroys a mutex attribute object (making it uninitialized). Once a mutex attributes object has been destroyed, it can be reinitialized with B<pthread_mutexattr_init>().
ru: Функция B<pthread_mutexattr_destroy>() уничтожает объект атрибутов мьютекса (делает его не инициализированным). После уничтожения объекта атрибутов мьютекса, его можно инициализировать с помощью B<pthread_mutexattr_init>().

source: The results of destroying an uninitialized mutex attributes object are undefined.
ru: Если для уничтожения указан не инициализированный объект атрибутов мьютекса, то результат не определён.

source: Subsequent changes to a mutex attributes object do not affect mutex that have already been initialized using that object.
ru: Изменения объекта атрибутов мьютекса не влияют на мьютексы, которые уже были инициализированы с помощью этого объекта.

source: pthread_exit - terminate calling thread
ru: pthread_exit - завершает работу вызвавшей нити

source: The B<pthread_exit>() function terminates the calling thread and returns a value via I<retval> that (if the thread is joinable) is available to another thread in the same process that calls B<pthread_join>(3).
ru: Функция B<pthread_exit>() завершает работу вызвавшей нити и возвращает значение через I<retval>, доступное (если к нити можно присоединиться) другой нити в том же процессе, вызвавшей B<pthread_join>(3).

source: Any clean-up handlers established by B<pthread_cleanup_push>(3) that have not yet been popped, are popped (in the reverse of the order in which they were pushed) and executed. If the thread has any thread-specific data, then, after the clean-up handlers have been executed, the corresponding destructor functions are called, in an unspecified order.
ru: Если есть какие-либо невызванные очищающие обработчики, установленные B<pthread_cleanup_push>(3), то они выполняются (в обратном регистрации порядке). Если у нити есть какие-либо свои данные, то после выполнения очищающих обработчиков вызываются соответствующие функции удаления, в неопределённом порядке.

source: When a thread terminates, process-shared resources (e.g., mutexes, condition variables, semaphores, and file descriptors) are not released, and functions registered using B<atexit>(3) are not called.
ru: Когда нить завершает выполнение связанные с процессом ресурсы (например, мьютексы, условные переменные, семафоры и файловые дескрипторы) не освобождаются и функции, зарегистрированные через B<atexit>(3), не вызываются.

source: After the last thread in a process terminates, the process terminates as by calling B<exit>(3) with an exit status of zero; thus, process-shared resources are released and functions registered using B<atexit>(3) are called.
ru: После завершения последней нити процесса, процесс завершает работу как при вызове B<exit>(3) с нулевых кодом выхода; то есть ресурсы процесса освобождаются и вызываются функции, зарезервированные с помощью B<atexit>(3).

source: This function does not return to the caller.
ru: Данная функция не возвращает выполнение вызвавшему.

source: Performing a return from the start function of any thread other than the main thread results in an implicit call to B<pthread_exit>(), using the function's return value as the thread's exit status.
ru: Выполнение возврата из начальной функции любой не главной нити приводит к неявному вызову B<pthread_exit>(), возвращаемое значение которой является кодом выхода нити.

source: To allow other threads to continue execution, the main thread should terminate by calling B<pthread_exit>() rather than B<exit>(3).
ru: Чтобы продолжить выполнение других нитей, главная нить должна завершаться вызовом B<pthread_exit>(), а не B<exit>(3).

source: The value pointed to by I<retval> should not be located on the calling thread's stack, since the contents of that stack are undefined after the thread terminates.
ru: Значение, на которое указывает I<retval>, не должно располагаться в стеки вызывающей нити, так как содержимое этого стека не определено после завершения работы нити.
