Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: PIDs in a new PID namespace start at 1, somewhat like a standalone system, and calls to B<fork>(2), B<vfork>(2), or B<clone>(2) will produce processes with PIDs that are unique within the namespace.
ru: Идентификаторы в новом пространстве имён PID начинаются с 1 как в автономной системе, и вызовы B<fork>(2), B<vfork>(2) или B<clone>(2) будут создавать процессы с уникальными идентификаторами в пределах пространства имён.

source: Use of PID namespaces requires a kernel that is configured with the B<CONFIG_PID_NS> option.
ru: Для использования пространств имён PID требуется, чтобы ядро было собрано с параметром B<CONFIG_PID_NS>.

source: The namespace init process
ru: Пространство имён начального процесса

source: The first process created in a new namespace (i.e., the process created using B<clone>(2) with the B<CLONE_NEWPID> flag, or the first child created by a process after a call to B<unshare>(2) using the B<CLONE_NEWPID> flag) has the PID 1, and is the "init" process for the namespace (see B<init>(1)). This process becomes the parent of any child processes that are orphaned because a process that resides in this PID namespace terminated (see below for further details).
ru: Первый процесс, созданный в новом пространстве имён (т. е., процесс, созданный вызовом B<clone>(2) с флагом B<CLONE_NEWPID> или первый потомок, созданный процессом после вызова B<unshare>(2) с флагом B<CLONE_NEWPID>) имеет PID 1, и это «начальный» (init) процесс пространства имён (смотрите B<init>(1)). Этот процесс становится родителем всех дочерних процессов, которые осиротели из-за завершения родителей, находящихся внутри этого пространства имён PID (дополнительную информацию смотрите ниже).

source: If the "init" process of a PID namespace terminates, the kernel terminates all of the processes in the namespace via a B<SIGKILL> signal. This behavior reflects the fact that the "init" process is essential for the correct operation of a PID namespace. In this case, a subsequent B<fork>(2) into this PID namespace fail with the error B<ENOMEM>; it is not possible to create a new process in a PID namespace whose "init" process has terminated. Such scenarios can occur when, for example, a process uses an open file descriptor for a I</proc/[pid]/ns/pid> file corresponding to a process that was in a namespace to B<setns>(2) into that namespace after the "init" process has terminated. Another possible scenario can occur after a call to B<unshare>(2): if the first child subsequently created by a B<fork>(2) terminates, then subsequent calls to B<fork>(2) fail with B<ENOMEM>.
ru: Если процесс «init» пространства имён PID завершает работу, то ядро завершает работу всех процессов в пространстве имён с помощью сигнала B<SIGKILL>. Такое поведение показывает, что процесс «init» необходим для корректной работы пространства имён PID. В этом случае последующий вызов B<fork>(2) в этом пространство имён PID завершается ошибкой B<ENOMEM>; невозможно создать новый процесс в пространстве имён PID, в котором не работает процесс «init». Такое может произойти, например, когда процесс использует открытый файловый дескриптор файла I</proc/[pid]/ns/pid>, соответствующий процессу, который был в пространстве имён B<setns>(2), в этом пространстве имён после того, как процесс «init» завершился. Другой возможный сценарий может произойти после вызова B<unshare>(2): если первый потомок после этого созданный B<fork>(2) завершится, то последующие вызовы B<fork>(2) завершаются ошибкой B<ENOMEM>.

source: Only signals for which the "init" process has established a signal handler can be sent to the "init" process by other members of the PID namespace. This restriction applies even to privileged processes, and prevents other members of the PID namespace from accidentally killing the "init" process.
ru: Члены пространства имён PID могут посылать процессу «init» только сигналы, для которых процесс «init» установил обработчики. Это ограничение применяется даже к привилегированным процессам, и не позволяет другим членам пространства имён PID нечаянно убить процесс «init».

source: Likewise, a process in an ancestor namespace can\(emsubject to the usual permission checks described in B<kill>(2)\(emsend signals to the "init" process of a child PID namespace only if the "init" process has established a handler for that signal. (Within the handler, the I<siginfo_t> I<si_pid> field described in B<sigaction>(2) will be zero.) B<SIGKILL> or B<SIGSTOP> are treated exceptionally: these signals are forcibly delivered when sent from an ancestor PID namespace. Neither of these signals can be caught by the "init" process, and so will result in the usual actions associated with those signals (respectively, terminating and stopping the process).
ru: Также, процесс в родительском пространстве имён может (пройдя обычные проверки прав, описанные в B<kill>(2)) послать сигнал процессу «init» дочернего пространства имён PID только, если процесс «init» задал обработчики для этого сигнала (внутри обработчика I<si_pid> в I<siginfo_t>, описанное в B<sigaction>(2) будет равно нулю). Для сигналов B<SIGKILL> и B<SIGSTOP> сделано исключение: эти сигналы принудительно доставляются при отправке из родительского пространства имён PID. Ни один из них не может быть пойман процессом «init», и в результате будут выполнены обычные действия, связанные с этими сигналами (завершение и останов процесса, соответственно).

source: Starting with Linux 3.4, the B<reboot>(2) system call causes a signal to be sent to the namespace "init" process. See B<reboot>(2) for more details.
ru: Начиная с Linux 3.4, системный вызов B<reboot>(2) посылает сигнал в пространство имён процесса «init». Подробности смотрите в B<reboot>(2).

source: Nesting PID namespaces
ru: Вложенные пространства имён PID

source: PID namespaces can be nested: each PID namespace has a parent, except for the initial ("root") PID namespace. The parent of a PID namespace is the PID namespace of the process that created the namespace using B<clone>(2) or B<unshare>(2). PID namespaces thus form a tree, with all namespaces ultimately tracing their ancestry to the root namespace. Since Linux 3.7, the kernel limits the maximum nesting depth for PID namespaces to 32.
ru: Пространства имён PID могут быть вложенными: каждое пространство имён PID имеет родителя, за исключением начального («корневого») пространства имён PID. Родитель пространства имён PID — это пространство имён PID процесса, который был создан в пространстве имён с помощью B<clone>(2) или B<unshare>(2). Таким образом пространства имён PID образуют дерево со всеми пространствами имён по которому, в конечном счёте, можно проследить их родословную до корневого пространства имён. Начиная с Linux 3.7, ядро ограничивает глубину максимальной вложенности пространств имён PID значением 32.

source: A process is visible to other processes in its PID namespace, and to the processes in each direct ancestor PID namespace going back to the root PID namespace. In this context, "visible" means that one process can be the target of operations by another process using system calls that specify a process ID. Conversely, the processes in a child PID namespace can't see processes in the parent and further removed ancestor namespaces. More succinctly: a process can see (e.g., send signals with B<kill>(2), set nice values with B<setpriority>(2), etc.) only processes contained in its own PID namespace and in descendants of that namespace.
ru: Процесс видим другим процессам в своём пространстве имён PID, и процессам в каждом прямом родительском пространстве имён PID вплоть до корневого пространства имён PID. В этом контексте «видимость» означает, что процесс может быть целью операции другого процесса в системных вызовах, который указывает идентификатор процесса. И наоборот, процессы в дочернем пространстве имён PID не видят процессы в родительском и более удалённых родительских пространствах имён. Более кратко: процесс может видеть (например, посылать сигналы с помощью B<kill>(2), назначать значения уступчивости с помощью B<setpriority>(2) и т. п.) только процессы из своего пространства имён PID и в потомках этого пространства имён.

source: A process has one process ID in each of the layers of the PID namespace hierarchy in which is visible, and walking back though each direct ancestor namespace through to the root PID namespace. System calls that operate on process IDs always operate using the process ID that is visible in the PID namespace of the caller. A call to B<getpid>(2) always returns the PID associated with the namespace in which the process was created.
ru: Процесс имеет идентификатор в каждом слое иерархии пространства имён PID, в котором он виден, и двигаясь назад, в каждом прямом предке пространства имён вплоть до корневого пространства имён PID. Системные вызовы, работающие с идентификатором процесса, всегда используют идентификатор процесса, который видим в пространстве имён PID вызывающего. Вызов B<getpid>(2) всегда возвращает PID, связанный с пространством имён, в котором был создан процесс.

source: Some processes in a PID namespace may have parents that are outside of the namespace. For example, the parent of the initial process in the namespace (i.e., the B<init>(1) process with PID 1) is necessarily in another namespace. Likewise, the direct children of a process that uses B<setns>(2) to cause its children to join a PID namespace are in a different PID namespace from the caller of B<setns>(2). Calls to B<getppid>(2) for such processes return 0.
ru: Некоторые процессы в пространстве имён PID могут иметь родителей, которые находятся вне пространства имён. Например, родитель начального процесса в пространстве имён (т. е., процесс B<init>(1) с PID 1) неизбежно находится в другом пространстве имён. Аналогичным образом, прямые потомки процесса, который использует B<setns>(2) для объединения потомков в пространство имён PID, находятся в другом пространстве имён PID относительно вызывающего B<setns>(2). При вызове B<getppid>(2) для таких процессов возвращает 0.

source: While processes may freely descend into child PID namespaces (e.g., using B<setns>(2) with a PID namespace file descriptor), they may not move in the other direction. That is to say, processes may not enter any ancestor namespaces (parent, grandparent, etc.). Changing PID namespaces is a one-way operation.
ru: Хотя процессы могут свободно перемещаться вниз в дочерние пространства имён PID (например, с помощью B<setns>(2) с файловым дескриптором пространства имён PID), они не могут перемещаться в обратном направлении. То есть процессы не могут входить в пространства имён предка (родителя, прародителя и т .п.). Изменение пространств имён PID — это односторонняя операция.

source: The B<NS_GET_PARENT> B<ioctl>(2) operation can be used to discover the parental relationship between PID namespaces; see B<ioctl_ns>(2).
ru: Операцию B<NS_GET_PARENT> B<ioctl>(2) можно использовать для обнаружения родительской связи между пространствами имён PID; смотрите B<ioctl_ns>(2).

source: setns(2) and unshare(2) semantics
ru: Семантика setns(2) и unshare(2)

source: Calls to B<setns>(2) that specify a PID namespace file descriptor and calls to B<unshare>(2) with the B<CLONE_NEWPID> flag cause children subsequently created by the caller to be placed in a different PID namespace from the caller. (Since Linux 4.12, that PID namespace is shown via the I</proc/[pid]/ns/pid_for_children> file, as described in B<namespaces>(7).) These calls do not, however, change the PID namespace of the calling process, because doing so would change the caller's idea of its own PID (as reported by B<getpid>()), which would break many applications and libraries.
ru: Последовательно выполняемые вызовы B<setns>(2) с файловым дескриптором пространства имён PID и вызов B<unshare>(2) с флагом B<CLONE_NEWPID> помещают потомков в другое пространство имён PID, отличное от пространства вызывающего (начиная с Linux 4.12 данное пространство имён PID показывается через файл I</proc/[pid]/ns/pid_for_children> как описано в B<namespaces>(7)). Однако, эти вызовы не изменяют пространство имён PID вызывающего процесса, так как это позволило бы изменять PID вызывающего (сообщаемые B<getpid>()), что сломало бы многие приложения и библиотеки.

source: To put things another way: a process's PID namespace membership is determined when the process is created and cannot be changed thereafter. Among other things, this means that the parental relationship between processes mirrors the parental relationship between PID namespaces: the parent of a process is either in the same namespace or resides in the immediate parent PID namespace.
ru: Посмотрим на вещи под другим углом: членство процесса в пространстве имён PID определяется при создании процесса и не может быть изменено в дальнейшем. Помимо прочего, это означает, что родственные отношения между процессами зеркально отражают родственные отношения между пространствами имён PID: родитель процесса находится в том же пространстве имён или в непосредственном родительском пространстве имён namespace.

source: A process may call B<unshare>(2) with the B<CLONE_NEWPID> flag only once. After it has performed this operation, its I</proc/PID/ns/pid_for_children> symbolic link will be empty until the first child is created in the namespace.
ru: Процесс может вызвать B<unshare>(2) с флагом B<CLONE_NEWPID> только один раз. После выполнения этой операции его символическая ссылка I</proc/PID/ns/pid_for_children> станет пустой, пока пространстве имён не будет создать первый потомок.

source: Adoption of orphaned children
ru: Усыновление осиротевших потомков

source: When a child process becomes orphaned, it is reparented to the "init" process in the PID namespace of its parent (unless one of the nearer ancestors of the parent employed the B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> command to mark itself as the reaper of orphaned descendant processes). Note that because of the B<setns>(2) and B<unshare>(2) semantics described above, this may be the "init" process in the PID namespace that is the I<parent> of the child's PID namespace, rather than the "init" process in the child's own PID namespace.
ru: Когда дочерний процесс становится сиротой, его родителем становится «начальный» процесс в пространстве имён PID его родителя (если один из ближайших родственных процессов родителя не вызывал команду B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> для назначения себя сборщиком собирателем дочерних процессов). Заметим, что благодаря семантике B<setns>(2) и B<unshare>(2), описанной выше, это может быть процесс «init» в пространстве имён PID, являющийся I<родителем> пространства имён PID потомка, а не процесс «init» пространства имён PID самого потомка.

source: Compatibility of CLONE_NEWPID with other CLONE_* flags
ru: Совместимость CLONE_NEWPID с другими флагами CLONE_*

source: In current versions of Linux, B<CLONE_NEWPID> can't be combined with B<CLONE_THREAD>. Threads are required to be in the same PID namespace such that the threads in a process can send signals to each other. Similarly, it must be possible to see all of the threads of a processes in the B<proc>(5) filesystem. Additionally, if two threads were in different PID namespaces, the process ID of the process sending a signal could not be meaningfully encoded when a signal is sent (see the description of the I<siginfo_t> type in B<sigaction>(2)). Since this is computed when a signal is enqueued, a signal queue shared by processes in multiple PID namespaces would defeat that.
ru: В текущих версиях Linux B<CLONE_NEWPID> нельзя объединять вместе с B<CLONE_THREAD>. Для нитей требуется находиться в том же пространстве имён PID, чтобы нити процесса могли посылать сигналы друг другу. Также требуется видеть все нити процессов в файловой системе B<proc>(5). Также, если две нити находятся в разных пространствах имён PID, то ID процесса, посылающего сигнал, невозможно достоверно закодировать при посылке (смотрите описание типа I<siginfo_t> в B<sigaction>(2)). Так как вычисление выполняется когда сигнал попадает в очередь сигналов, общая для процессов из нескольких пространств имён PID, очередь сигналов не позволяет этого.

source: In earlier versions of Linux, B<CLONE_NEWPID> was additionally disallowed (failing with the error B<EINVAL>) in combination with B<CLONE_SIGHAND> (before Linux 4.3) as well as B<CLONE_VM> (before Linux 3.12). The changes that lifted these restrictions have also been ported to earlier stable kernels.
ru: В ранних версиях Linux значение B<CLONE_NEWPID> также запрещалось (возвращалась ошибка B<EINVAL>) объединять с B<CLONE_SIGHAND> (до Linux 4.3), а также с B<CLONE_VM> (до Linux 3.12). Изменения, снявшие эти ограничения, были также перенесены в более ранние стабильные ядра.

source: /proc and PID namespaces
ru: /proc и PID пространств имен

source: A I</proc> filesystem shows (in the I</proc/[pid]> directories) only processes visible in the PID namespace of the process that performed the mount, even if the I</proc> filesystem is viewed from processes in other namespaces.
ru: В файловой системе I</proc> отображаются (в каталогах I</proc/[pid]>) только процессы, видимые в пространстве имён PID процесса, который выполнил монтирование, даже если файловая система I</proc> видима из процессов другого пространства имён.

source: After creating a new PID namespace, it is useful for the child to change its root directory and mount a new procfs instance at I</proc> so that tools such as B<ps>(1) work correctly. If a new mount namespace is simultaneously created by including B<CLONE_NEWNS> in the I<flags> argument of B<clone>(2) or B<unshare>(2), then it isn't necessary to change the root directory: a new procfs instance can be mounted directly over I</proc>.
ru: После создания нового пространства имён PID у потомка полезно изменить его корневой каталог и смонтировать новый экземпляр procfs в I</proc> для того, чтобы корректно работали инструменты типа B<ps>(1). Если одновременно создаётся новое пространство имён монтирования, добавлением флага B<CLONE_NEWNS> в аргумент I<flags> вызова B<clone>(2) или B<unshare>(2), то необязательно изменять корневой каталог: новый экземпляр procfs можно смонтировать непосредственно в I</proc>.

source: From a shell, the command to mount I</proc> is:
ru: Команда оболочки для монтирования I</proc>:

source: Calling B<readlink>(2) on the path I</proc/self> yields the process ID of the caller in the PID namespace of the procfs mount (i.e., the PID namespace of the process that mounted the procfs). This can be useful for introspection purposes, when a process wants to discover its PID in other namespaces.
ru: Вызов B<readlink>(2) с путём I</proc/self> выдаёт идентификатор процесса вызывающего из пространства имён PID, откуда смонтирован procfs (т. е., из пространства имён PID процесса, который смонтировал procfs). Это может быть полезно при самоанализе, когда процесс хочет узнать свой PID в других пространствах имён.

source: /proc files
ru: Файлы в /proc

source: B</proc/sys/kernel/ns_last_pid> (since Linux 3.3)
ru: B</proc/sys/kernel/ns_last_pid> (начиная с Linux 3.3)

source: This file displays the last PID that was allocated in this PID namespace. When the next PID is allocated, the kernel will search for the lowest unallocated PID that is greater than this value, and when this file is subsequently read it will show that PID.
ru: Этот файл отражает последний PID, который был выделен в этом пространстве имён PID. Когда выделяется следующий PID, ядро ищет самый маленький не выделенный PID, который больше этого значения, и при следующем чтении этого файла в нём будет этот PID.

source: This file is writable by a process that has the B<CAP_SYS_ADMIN> capability inside its user namespace. This makes it possible to determine the PID that is allocated to the next process that is created inside this PID namespace.
ru: Этот файл доступен на запись процессу с мандатом B<CAP_SYS_ADMIN> внутри своего пространства имён пользователя. Это делает возможным задать PID, который выделяется следующему процессу, создаваемому внутри этого пространства имён PID.

source: Miscellaneous
ru: Разное

source: When a process ID is passed over a UNIX domain socket to a process in a different PID namespace (see the description of B<SCM_CREDENTIALS> in B<unix>(7)), it is translated into the corresponding PID value in the receiving process's PID namespace.
ru: Когда идентификатор процесса передаётся через доменный сокет UNIX в процесс в другом пространстве имён PID (смотрите описание B<SCM_CREDENTIALS> в B<unix>(7)), то он транслируется в соответствующее значения PID из пространства имён PID принимающего процесса.

source: Namespaces are a Linux-specific feature.
ru: Пространства имён есть только в Linux.

source: See B<user_namespaces>(7).
ru: См. B<user_namespaces>(7).

source: persistent-keyring - per-user persistent keyring
ru: persistent-keyring - пользовательская постоянная связка ключей

source: The persistent keyring is a keyring used to anchor keys on behalf of a user. Each UID the kernel deals with has its own persistent keyring that is shared between all threads owned by that UID. The persistent keyring has a name (description) of the form I<_persistent.E<lt>UIDE<gt>> where I<E<lt>UIDE<gt>> is the user ID of the corresponding user.
ru: Постоянная связка ключей — это связка, используемая для привязки от имени пользователя. Для каждого UID ядро создаёт отдельную постоянную связку ключей, которая используется всеми нитями, принадлежащими этому UID. Постоянная связка ключей имеет имя (описание) в виде I<_persistent.E<lt>UIDE<gt>>, I<E<lt>UIDE<gt>> — ID пользователя соответствующего пользователя.

source: The persistent keyring may not be accessed directly, even by processes with the appropriate UID. Instead, it must first be linked to one of a process's keyrings, before that keyring can access the persistent keyring by virtue of its possessor permits. This linking is done with the B<keyctl_get_persistent>(3) function.
ru: Прямой доступ к постоянной связке ключей невозможен, даже процессам с подходящим UID. Вместо этого сначала она должна быть прицеплена к одной из связок ключей процесса, до этого связка ключей может получить доступ к постоянной связке ключей согласно правам своего владельца. Эта связь создаётся с помощью функции B<keyctl_get_persistent>(3).

source: If a persistent keyring does not exist when it is accessed by the B<keyctl_get_persistent>(3) operation, it will be automatically created.
ru: Если постоянная связка ключей не существует на момент вызова операции B<keyctl_get_persistent>(3), то она автоматически создаётся.

source: Each time the B<keyctl_get_persistent>(3) operation is performed, the persistent key's expiration timer is reset to the value in:
ru: Каждый раз при выполнении операции B<keyctl_get_persistent>(3) срок действия постоянного ключа сбрасывается в значение:

source: Should the timeout be reached, the persistent keyring will be removed and everything it pins can then be garbage collected. The key will then be re-created on a subsequent call to B<keyctl_get_persistent>(3).
ru: По истечению срока действия постоянная связка ключей удаляется и все ссылки на неё затем удаляются сборщиком мусора. После этого ключ будет пересоздан при следующем вызове B<keyctl_get_persistent>(3).

source: The persistent keyring is not directly searched by B<request_key>(2); it is searched only if it is linked into one of the keyrings that is searched by B<request_key>(2).
ru: В постоянной связке ключей напрямую невозможно искать с помощью B<request_key>(2); в ней можно искать только, если она прицеплена к одной из связок ключей, по которой выполняется B<request_key>(2).
