Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Branch not in transactional memory transaction. B<PERF_SAMPLE_BRANCH_CALL_STACK> (since Linux 4.1) Branch is part of a hardware-generated call stack. This requires hardware support, currently only found on Intel x86 Haswell or newer.
ru: Ветвление не транзакции транзакционной памяти. B<PERF_SAMPLE_BRANCH_CALL_STACK> (начиная с Linux 4.1) Ветвление это часть аппаратно создаваемого стека вызовов. Требует аппаратной поддержки, в настоящее время работает только на Intel x86 Haswell и новее.

source: I<sample_regs_user> (since Linux 3.7)
ru: I<sample_regs_user> (начиная с Linux 3.7)

source: This bit mask defines the set of user CPU registers to dump on samples. The layout of the register mask is architecture-specific and is described in the kernel header file I<arch/ARCH/include/uapi/asm/perf_regs.h>.
ru: Данной битовой маской задаётся набор битов пользовательских регистров ЦП, которые сохраняются в измерениях. Значения битов в битовой маске зависят от архитектуры и описаны в заголовочном файле ядра I<arch/ARCH/include/uapi/asm/perf_regs.h>.

source: I<sample_stack_user> (since Linux 3.7)
ru: I<sample_stack_user> (начиная с Linux 3.7)

source: This defines the size of the user stack to dump if B<PERF_SAMPLE_STACK_USER> is specified.
ru: Задаёт размер сохраняемого пользовательского стека, если указан B<PERF_SAMPLE_STACK_USER>.

source: I<clockid> (since Linux 4.1)
ru: I<clockid> (начиная с Linux 4.1)

source: If I<use_clockid> is set, then this field selects which internal Linux timer to use for timestamps. The available timers are defined in I<linux/time.h>, with B<CLOCK_MONOTONIC>, B<CLOCK_MONOTONIC_RAW>, B<CLOCK_REALTIME>, B<CLOCK_BOOTTIME>, and B<CLOCK_TAI> currently supported.
ru: Если установлен I<use_clockid>, то этим полем выбирается внутренний таймер Linux, используемый для меток времени.Доступные таймеры определены в I<linux/time.h>; в настоящее время поддерживаются B<CLOCK_MONOTONIC>, B<CLOCK_MONOTONIC_RAW>, B<CLOCK_REALTIME>, B<CLOCK_BOOTTIME> и B<CLOCK_TAI>.

source: I<aux_watermark> (since Linux 4.1)
ru: I<aux_watermark> (начиная с Linux 4.1)

source: This specifies how much data is required to trigger a B<PERF_RECORD_AUX> sample.
ru: Определяет какое количество данных требуется для запуска измерения B<PERF_RECORD_AUX>.

source: I<sample_max_stack> (since Linux 4.8)
ru: I<sample_max_stack> (начиная с Linux 4.8)

source: When I<sample_type> includes B<PERF_SAMPLE_CALLCHAIN>, this field specifies how many stack frames to report when generating the callchain.
ru: Если I<sample_type> содержит B<PERF_SAMPLE_CALLCHAIN>, то в этом поле задаётся количество выводимых кадров стека при генерации цепочки вызовов.

source: Reading results
ru: Чтение результатов

source: Once a B<perf_event_open>() file descriptor has been opened, the values of the events can be read from the file descriptor. The values that are there are specified by the I<read_format> field in the I<attr> structure at open time.
ru: После открытия файлового дескриптора с помощью B<perf_event_open>(), значения событий доступны на чтение. События задаются вв поле I<read_format> структуры I<attr> в момент открытия.

source: If you attempt to read into a buffer that is not big enough to hold the data, the error B<ENOSPC> results.
ru: Если вы попытаетесь выполнить чтение в буфер недостаточного размера, то результатом будет ошибка B<ENOSPC>.

source: Here is the layout of the data returned by a read:
ru: Вот компоновка данных, возвращаемых чтением:

source: If B<PERF_FORMAT_GROUP> was specified to allow reading all events in a group at once:
ru: Если указан B<PERF_FORMAT_GROUP> для разрешения чтения всех событий в группе за раз:

source: struct read_format { u64 nr; /* The number of events */ u64 time_enabled; /* if PERF_FORMAT_TOTAL_TIME_ENABLED */ u64 time_running; /* if PERF_FORMAT_TOTAL_TIME_RUNNING */ struct { u64 value; /* The value of the event */ u64 id; /* if PERF_FORMAT_ID */ } values[nr]; };
ru: struct read_format { u64 nr; /* количество событий */ u64 time_enabled; /* если PERF_FORMAT_TOTAL_TIME_ENABLED */ u64 time_running; /* если PERF_FORMAT_TOTAL_TIME_RUNNING */ struct { u64 value; /* значение события */ u64 id; /* если PERF_FORMAT_ID */ } values[nr]; };

source: If B<PERF_FORMAT_GROUP> was I<not> specified:
ru: Если B<PERF_FORMAT_GROUP> I<не> указан:

source: struct read_format { u64 value; /* The value of the event */ u64 time_enabled; /* if PERF_FORMAT_TOTAL_TIME_ENABLED */ u64 time_running; /* if PERF_FORMAT_TOTAL_TIME_RUNNING */ u64 id; /* if PERF_FORMAT_ID */ };
ru: struct read_format { u64 value; /* значение события */ u64 time_enabled; /* если PERF_FORMAT_TOTAL_TIME_ENABLED */ u64 time_running; /* если PERF_FORMAT_TOTAL_TIME_RUNNING */ u64 id; /* если PERF_FORMAT_ID */ };

source: The values read are as follows:
ru: Значения полей:

source: The number of events in this file descriptor. Available only if B<PERF_FORMAT_GROUP> was specified.
ru: Количество событий в этом файловом дескрипторе. Доступно только, если указан B<PERF_FORMAT_GROUP>.

source: Total time the event was enabled and running. Normally these values are the same. Multiplexing happens if the number of events is more than the number of available PMU counter slots. In that case the events run only part of the time and the I<time_enabled> and I<time running> values can be used to scale an estimated value for the count.
ru: Полное время события с момента включения и выполнения. Обычно, эти значения одинаковы. Если событий больше, чем доступно счётчиков слотов в PMU, то возникает мультиплексирование. В этом случае события выполняются только часть времени и значения I<time_enabled> и I<time running> можно использовать для градации рассчитанного значения в счётчике.

source: An unsigned 64-bit value containing the counter result.
ru: Целое беззнаковое 64-битное значение, содержащее счётчик-результат.

source: A globally unique value for this particular event; only present if B<PERF_FORMAT_ID> was specified in I<read_format>.
ru: Глобально уникальное значение данного события; присутствует только, если в I<read_format> указан B<PERF_FORMAT_ID>.

source: MMAP layout
ru: Разбивка MMAP

source: When using B<perf_event_open>() in sampled mode, asynchronous events (like counter overflow or B<PROT_EXEC> mmap tracking) are logged into a ring-buffer. This ring-buffer is created and accessed through B<mmap>(2).
ru: При использовании B<perf_event_open>() в режиме измерений, асинхронные события (такие как переполнение счётчика или слежение за B<PROT_EXEC> mmap) протоколируются в кольцевой буфер. Этот кольцевой буфер создаётся и доступен через B<mmap>(2).

source: The mmap size should be 1+2^n pages, where the first page is a metadata page (I<struct perf_event_mmap_page>) that contains various bits of information such as where the ring-buffer head is.
ru: Размер mmap должен быть 1+2^n страниц, где первая страница — страница метаданных (I<struct perf_event_mmap_page>), в которой содержится различная информация (например, начало кольцевого буфера).

source: Before kernel 2.6.39, there is a bug that means you must allocate an mmap ring buffer when sampling even if you do not plan to access it.
ru: До ядра версии 2.6.39, существовал дефект, который требовал от вас выделения кольцевого буфера mmap при измерении, даже если доступ к нему не планировался.

source: The structure of the first metadata mmap page is as follows:
ru: Структура первой страницы метаданных mmap:

source: struct perf_event_mmap_page { __u32 version; /* version number of this structure */ __u32 compat_version; /* lowest version this is compat with */ __u32 lock; /* seqlock for synchronization */ __u32 index; /* hardware counter identifier */ __s64 offset; /* add to hardware counter value */ __u64 time_enabled; /* time event active */ __u64 time_running; /* time event on CPU */ union { __u64 capabilities; struct { __u64 cap_usr_time / cap_usr_rdpmc / cap_bit0 : 1, cap_bit0_is_deprecated : 1, cap_user_rdpmc : 1, cap_user_time : 1, cap_user_time_zero : 1, }; }; __u16 pmc_width; __u16 time_shift; __u32 time_mult; __u64 time_offset; __u64 __reserved[120]; /* Pad to 1 k */ __u64 data_head; /* head in the data section */ __u64 data_tail; /* user-space written tail */ __u64 data_offset; /* where the buffer starts */ __u64 data_size; /* data buffer size */ __u64 aux_head; __u64 aux_tail; __u64 aux_offset; __u64 aux_size;
ru: struct perf_event_mmap_page { __u32 version; /* номер версии структуры */ __u32 compat_version; /* наименьшая совместимая версия */ __u32 lock; /* seqlock для синхронизации */ __u32 index; /* идентификатор аппаратного счётчика */ __s64 offset; /* добавляется к значению аппаратного счётчика */ __u64 time_enabled; /* время активности события */ __u64 time_running; /* время события на ЦП */ union { __u64 capabilities; struct { __u64 cap_usr_time / cap_usr_rdpmc / cap_bit0 : 1, cap_bit0_is_deprecated : 1, cap_user_rdpmc : 1, cap_user_time : 1, cap_user_time_zero : 1, }; }; __u16 pmc_width; __u16 time_shift; __u32 time_mult; __u64 time_offset; __u64 __reserved[120]; /* дополнение до 1 k */ __u64 data_head; /* заголовок в секции данных */ __u64 data_tail; /* хвост, записываемый из пользовательского пространства */ __u64 data_offset; /* начало буфера */ __u64 data_size; /* размер буфера данных */ __u64 aux_head; __u64 aux_tail; __u64 aux_offset; __u64 aux_size;

source: The following list describes the fields in the I<perf_event_mmap_page> structure in more detail:
ru: В следующем списке поля структуры I<perf_event_mmap_page> описаны более подробно:

source: Version number of this structure.
ru: Номер версии этой структуры.

source: The lowest version this is compatible with.
ru: Наименьший номер версии, совместимой с данной структурой.

source: A seqlock for synchronization.
ru: Значение seqlock для синхронизации.

source: A unique hardware counter identifier.
ru: Уникальный идентификатор аппаратного счётчика.

source: When using rdpmc for reads this offset value must be added to the one returned by rdpmc to get the current total event count.
ru: При использовании rdpmc для чтения это значение смещения должно добавляться к возвращаемому rdpmc для получения текущего общего количества событий.

source: Time the event was active.
ru: Время активности события.

source: Time the event was running.
ru: Время выполнения события.

source: I<cap_usr_time> / I<cap_usr_rdpmc> / I<cap_bit0> (since Linux 3.4)
ru: I<cap_usr_time> / I<cap_usr_rdpmc> / I<cap_bit0> (начиная с Linux 3.4)

source: There was a bug in the definition of I<cap_usr_time> and I<cap_usr_rdpmc> from Linux 3.4 until Linux 3.11. Both bits were defined to point to the same location, so it was impossible to know if I<cap_usr_time> or I<cap_usr_rdpmc> were actually set.
ru: С Linux 3.4 по Linux 3.11 был дефект в определении I<cap_usr_time> и I<cap_usr_rdpmc>. В обоих биты указывали на одно место, поэтому было невозможно узнать что на самом деле установлено: I<cap_usr_time> или I<cap_usr_rdpmc>.

source: Starting with Linux 3.12, these are renamed to I<cap_bit0> and you should use the I<cap_user_time> and I<cap_user_rdpmc> fields instead.
ru: Начиная с Linux 3.12, они были переименованы в I<cap_bit0> и вместо них вы должны использовать поля I<cap_user_time> и I<cap_user_rdpmc>.

source: I<cap_bit0_is_deprecated> (since Linux 3.12)
ru: I<cap_bit0_is_deprecated> (начиная с Linux 3.12)

source: If set, this bit indicates that the kernel supports the properly separated I<cap_user_time> and I<cap_user_rdpmc> bits.
ru: Если установлен, то этот бит показывает, что ядро поддерживает правильно разделённые биты I<cap_user_time> и I<cap_user_rdpmc>.

source: If not-set, it indicates an older kernel where I<cap_usr_time> and I<cap_usr_rdpmc> map to the same bit and thus both features should be used with caution.
ru: Если не установлен, то это означает используется старое ядро, в котором I<cap_usr_time> и I<cap_usr_rdpmc> отражают один и тот же бит, и оба свойства нужно использовать с осторожностью.

source: I<cap_user_rdpmc> (since Linux 3.12)
ru: I<cap_user_rdpmc> (начиная с Linux 3.12)

source: If the hardware supports user-space read of performance counters without syscall (this is the "rdpmc" instruction on x86), then the following code can be used to do a read:
ru: Если есть аппаратная поддержка чтения счётчиков производительности из пользовательского пространства без системного вызова (инструкция «rdpmc» в x86), то для чтения можно использовать следующий код:

source: I<cap_user_time> (since Linux 3.12)
ru: I<cap_user_time> (начиная с Linux 3.12)

source: This bit indicates the hardware has a constant, nonstop timestamp counter (TSC on x86).
ru: Этот бит указывает на наличие аппаратного, неизменяемого, неостанавливаемого счётчика временных меток (TSC на x86).

source: I<cap_user_time_zero> (since Linux 3.12)
ru: I<cap_user_time_zero> (начиная с Linux 3.12)

source: Indicates the presence of I<time_zero> which allows mapping timestamp values to the hardware clock.
ru: Указывает на наличие I<time_zero>, который позволяет отображать значения временных меток в аппаратные часы.

source: If I<cap_usr_rdpmc>, this field provides the bit-width of the value read using the rdpmc or equivalent instruction. This can be used to sign extend the result like:
ru: Если установлен I<cap_usr_rdpmc>, то это поле предоставляет ширину (в битах) значения, считываемого с помощью rdpmc или эквивалентной инструкции. Может использоваться для расширения знаком:

source: pmc E<lt>E<lt>= 64 - pmc_width; pmc E<gt>E<gt>= 64 - pmc_width; // signed shift right count += pmc;
ru: pmc E<lt>E<lt>= 64 - pmc_width; pmc E<gt>E<gt>= 64 - pmc_width; // сдвиг знака вправо count += pmc;

source: If I<cap_usr_time>, these fields can be used to compute the time delta since I<time_enabled> (in nanoseconds) using rdtsc or similar.
ru: Если установлен I<cap_usr_time>, то эти поля можно использоваться для вычисления разницы времени, начиная с I<time_enabled> (в наносекундах) с помощью rdtsc или подобной инструкции.

source: Where I<time_offset>, I<time_mult>, I<time_shift>, and I<cyc> are read in the seqcount loop described above. This delta can then be added to enabled and possible running (if idx), improving the scaling:
ru: Где I<time_offset>, I<time_mult>, I<time_shift> и I<cyc> читаются в цикле seqcount, описанном выше. Затем эта разница может быть добавлена для включения и, возможно, запуска (если idx) для улучшения масштабирования:

source: I<time_zero> (since Linux 3.12)
ru: I<time_zero> (начиная с Linux 3.12)

source: If I<cap_usr_time_zero> is set, then the hardware clock (the TSC timestamp counter on x86) can be calculated from the I<time_zero>, I<time_mult>, and I<time_shift> values:
ru: Если установлен I<cap_usr_time_zero>, то аппаратные часы (счётчик временных меток TSC на x86) могут быть вычислены из значений I<time_zero>, I<time_mult> и I<time_shift>:

source: And vice versa:
ru: И наоборот:

source: This points to the head of the data section. The value continuously increases, it does not wrap. The value needs to be manually wrapped by the size of the mmap buffer before accessing the samples.
ru: Указывает на начало секции данных. Значение непрерывно увеличивается, но не возвращается в начало. Перед доступом к образцам его нужно возвращать в начало вручную — на размер буфера mmap.

source: On SMP-capable platforms, after reading the I<data_head> value, user space should issue an rmb().
ru: На платформах с SMP после чтения значения I<data_head> из пользовательского пространства нужно вызвать функцию rmb().

source: When the mapping is B<PROT_WRITE>, the I<data_tail> value should be written by user space to reflect the last read data. In this case, the kernel will not overwrite unread data.
ru: Если отображение B<PROT_WRITE>, то значение I<data_tail> будет записываться из пользовательского пространства для отражения последних прочитанных данных. В этом случае ядро не перезаписывает непрочитанные данные.

source: I<data_offset> (since Linux 4.1)
ru: I<data_offset> (начиная с Linux 4.1)

source: Contains the offset of the location in the mmap buffer where perf sample data begins.
ru: Содержит смещение расположения начала данных образца perf в буфере mmap.

source: I<data_size> (since Linux 4.1)
ru: I<data_size> (начиная с Linux 4.1)

source: Contains the size of the perf sample region within the mmap buffer.
ru: Содержит размер области образца perf в буфере mmap.

source: I<aux_head>, I<aux_tail>, I<aux_offset>, I<aux_size> (since Linux 4.1)
ru: I<aux_head>, I<aux_tail>, I<aux_offset>, I<aux_size> (начиная с Linux 4.1)

source: The AUX region allows mmaping a separate sample buffer for high-bandwidth data streams (separate from the main perf sample buffer). An example of a high-bandwidth stream is instruction tracing support, as is found in newer Intel processors.
ru: Область AUX позволяет отобразить отдельный буфер образцов для высокоскоростных потоков данных (отдельный от основного буфера образцов perf). Примером высокоскоростного потока может быть поддержка трассировки инструкций, имеющаяся в новых процессорах Intel.

source: To set up an AUX area, first I<aux_offset> needs to be set with an offset greater than I<data_offset>+I<data_size> and I<aux_size> needs to be set to the desired buffer size. The desired offset and size must be page aligned, and the size must be a power of two. These values are then passed to mmap in order to map the AUX buffer. Pages in the AUX buffer are included as part of the B<RLIMIT_MEMLOCK> resource limit (see B<setrlimit>(2)), and also as part of the I<perf_event_mlock_kb> allowance.
ru: Для задания области AUX, сначала задайте I<aux_offset> со смещением больше чем I<data_offset>+I<data_size>, а в I<aux_size> нужно указать желаемых размер буфера. Желаемое смещение и размер должны быть выровнены по границе страницы, и размер должен быть степенью двойки. Затем эти значения передаются в mmap для отображения буфера AUX. Страницы буфера AUX учитываются в ограничении ресурса B<RLIMIT_MEMLOCK> (смотрите B<setrlimit>(2)), а также проходят допустимость I<perf_event_mlock_kb>.

source: By default, the AUX buffer will be truncated if it will not fit in the available space in the ring buffer. If the AUX buffer is mapped as a read only buffer, then it will operate in ring buffer mode where old data will be overwritten by new. In overwrite mode, it might not be possible to infer where the new data began, and it is the consumer's job to disable measurement while reading to avoid possible data races.
ru: По умолчанию буфер AUX будет обрезан, если он не вмещается в доступное пространство кольцевого буфера. Если буфер AUX отображается только для чтения, то он будет работать в режиме кольцевого буфера, где старые данные перезаписываются новыми. В режиме перезаписи нельзя угадать место начала новых данных, и задачей потребителя становится отключение измерения для избежания возможной состязательности по данным.

source: The I<aux_head> and I<aux_tail> ring buffer pointers have the same behavior and ordering rules as the previous described I<data_head> and I<data_tail>.
ru: Указатели кольцевого буфера I<aux_head> и I<aux_tail> работают и подчиняются тем же правилам, которые описаны выше для I<data_head> и I<data_tail>.

source: The following 2^n ring-buffer pages have the layout described below.
ru: Далее приводится раскладка страниц кольцевого буфера размером 2^n.

source: If I<perf_event_attr.sample_id_all> is set, then all event types will have the sample_type selected fields related to where/when (identity) an event took place (TID, TIME, ID, CPU, STREAM_ID) described in B<PERF_RECORD_SAMPLE> below, it will be stashed just after the I<perf_event_header> and the fields already present for the existing fields, that is, at the end of the payload. This allows a newer perf.data file to be supported by older perf tools, with the new optional fields being ignored.
ru: Если установлен I<perf_event_attr.sample_id_all>, то все типы событий будут иметь выбранные поля sample_type, относящиеся к где/когда (отличительность) происходило событие (TID, TIME, ID, CPU, STREAM_ID), описанные в B<PERF_RECORD_SAMPLE> ниже; они будут спрятаны за I<perf_event_header> и уже имеющимися полями, то есть в записываться в конец полезных данных. Это позволяет читать новый файл perf.data старыми инструментами perf, игнорируя новые необязательные поля.

source: The mmap values start with a header:
ru: Значения mmap начинаются с заголовка:

source: Below, we describe the I<perf_event_header> fields in more detail. For ease of reading, the fields with shorter descriptions are presented first.
ru: Далее мы опишем поля I<perf_event_header> более подробно. Для простоты поля с короткими описаниями показаны первыми.

source: This indicates the size of the record.
ru: Показывает размер записи.

source: The I<misc> field contains additional information about the sample.
ru: В поле I<misc> содержится дополнительная информация об образце.

source: The CPU mode can be determined from this value by masking with B<PERF_RECORD_MISC_CPUMODE_MASK> and looking for one of the following (note these are not bit masks, only one can be set at a time):
ru: По этому значению можно определить режим ЦП, наложив на него маску B<PERF_RECORD_MISC_CPUMODE_MASK> и одно из следующих значений (заметим, что это не битовые маски, можно указывать только одно значение за раз):

source: Unknown CPU mode.
ru: Неизвестный режим ЦП.

source: Sample happened in the kernel.
ru: Образец возник в ядре.

source: Sample happened in user code.
ru: Образец возник в пользовательском коде.

source: Sample happened in the hypervisor.
ru: Образец возник в гипервизоре.

source: B<PERF_RECORD_MISC_GUEST_KERNEL> (since Linux 2.6.35)
ru: B<PERF_RECORD_MISC_GUEST_KERNEL> (начиная с Linux 2.6.35)

source: Sample happened in the guest kernel.
ru: Образец возник в гостевом ядре.

source: B<PERF_RECORD_MISC_GUEST_USER (since Linux 2.6.35)>
ru: B<PERF_RECORD_MISC_GUEST_USER (начиная с Linux 2.6.35)>

source: Sample happened in guest user code.
ru: Образец возник в гостевом пользовательском коде.

source: Since the following three statuses are generated by different record types, they alias to the same bit:
ru: Так как следующие три состояния сгенерированы различными типами записей, то они указывают на один и тот же бит:

source: B<PERF_RECORD_MISC_MMAP_DATA> (since Linux 3.10)
ru: B<PERF_RECORD_MISC_MMAP_DATA> (начиная с Linux 3.10)

source: This is set when the mapping is not executable; otherwise the mapping is executable.
ru: Устанавливается, когда отображение не выполняемое; в противном случае отображение выполняемое.

source: B<PERF_RECORD_MISC_COMM_EXEC> (since Linux 3.16)
ru: B<PERF_RECORD_MISC_COMM_EXEC> (начиная с Linux 3.16)

source: This is set for a B<PERF_RECORD_COMM> record on kernels more recent than Linux 3.16 if a process name change was caused by an B<exec>(2) system call.
ru: Устанавливается для записи B<PERF_RECORD_COMM> в ядрах новее версии Linux 3.16, если имя процесса изменено системным вызовом B<exec>(2).

source: B<PERF_RECORD_MISC_SWITCH_OUT> (since Linux 4.3)
ru: B<PERF_RECORD_MISC_SWITCH_OUT> (начиная с Linux 4.3)

source: When a B<PERF_RECORD_SWITCH> or B<PERF_RECORD_SWITCH_CPU_WIDE> record is generated, this bit indicates that the context switch is away from the current process (instead of into the current process).
ru: При генерации записи B<PERF_RECORD_SWITCH> или B<PERF_RECORD_SWITCH_CPU_WIDE> этот бит показывает, что переключение контекста происходило из текущего процесса (а не в текущий процесс).

source: In addition, the following bits can be set:
ru: Также могут устанавливаться следующие биты:
