Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The IA-64-specific B<perfmonctl>() system call provides an interface to the PMU (performance monitoring unit). The PMU consists of PMD (performance monitoring data) registers and PMC (performance monitoring control) registers, which gather hardware statistics.
ru: Специальный системный вызов B<perfmonctl>() для IA-64 предоставляет интерфейс к PMU (блок слежения за производительностью, perfomance monitoring unit). PMU содержит регистры PMD (данные производительности, performance monitoring data) и PMC (управление слежением за производительностью, performance monitoring control), в которых собирается статистика по аппаратному обеспечению.

source: B<perfmonctl>() applies the operation I<cmd> to the input arguments specified by I<arg>. The number of arguments is defined by I<narg>. The I<fd> argument specifies the perfmon context to operate on.
ru: Вызов B<perfmonctl>() выполняет операцию I<cmd> над входными аргументами, указанными в I<arg>. Количество аргументов указывается в I<narg>. В аргументе I<fd> задаётся контекст perfmon для операции.

source: Supported values for I<cmd> are:
ru: Поддерживаемые значения I<cmd>:

source: Set up a context.
ru: Создаёт контекст.

source: The I<fd> parameter is ignored. A new perfmon context is created as specified in I<ctxt> and its file descriptor is returned in I<ctxt-E<gt>ctx_fd>.
ru: Параметр I<fd> игнорируется. Создаётся новый контекст perfmon согласно I<ctxt> и его файловый дескриптор возвращается в I<ctxt-E<gt>ctx_fd>.

source: The file descriptor can be used in subsequent calls to B<perfmonctl>() and can be used to read event notifications (type I<pfm_msg_t>) using B<read>(2). The file descriptor is pollable using B<select>(2), B<poll>(2), and B<epoll>(7).
ru: Файловый дескриптор можно использовать в последующих вызовах B<perfmonctl>(), а также для чтения уведомлений о событиях (тип I<pfm_msg_t>) с помощью B<read>(2). Файловый дескриптор можно опрашивать с помощью B<select>(2), B<poll>(2) и B<epoll>(7).

source: The context can be destroyed by calling B<close>(2) on the file descriptor.
ru: Контекст можно уничтожить вызвав B<close>(2), указав файловый дескриптор.

source: Set PMC registers.
ru: Назначает значения регистрам PMC.

source: Set PMD registers.
ru: Назначает значения регистрам PMD.

source: Read PMD registers.
ru: Читает регистры PMD.

source: Start monitoring.
ru: Запускает слежение.

source: Stop monitoring.
ru: Останавливает слежение.

source: Attach the context to a thread.
ru: Присоединяет контекст к нити.

source: Detach the context from a thread.
ru: Отсоединяет контекст от нити.

source: Restart monitoring after receiving an overflow notification.
ru: Перезапускает слежение после приёма уведомления о переполнении.

source: If I<val> is nonzero, enable debugging mode, otherwise disable.
ru: Если I<val> не равно нулю, то включает режим отладки, в противном случае выключает.

source: Reset PMC registers to default values.
ru: Сбрасывает регистры PMC в их значения по умолчанию.

source: B<perfmonctl>() returns zero when the operation is successful. On error, -1 is returned and I<errno> is set to indicate the cause of the error.
ru: При успешном выполнении операции B<perfmonctl>() возвращает ноль. При ошибке возвращается -1, а в I<errno> записывается причина ошибки.

source: B<perfmonctl>() is available since Linux 2.4.
ru: B<perfmonctl>() доступна в Linux начиная с 2.4.

source: B<perfmonctl>() is Linux-specific and is available only on the IA-64 architecture.
ru: Вызов B<perfmonctl>() есть только в Linux и доступен только для архитектуры IA-64.

source: The perfmon2 interface specification
ru: Спецификация интерфейса perfmon2

source: pciconfig_read, pciconfig_write, pciconfig_iobase - pci device information handling
ru: pciconfig_read, pciconfig_write, pciconfig_iobase - работа с информацией устройства PCI

source: Most of the interaction with PCI devices is already handled by the kernel PCI layer, and thus these calls should not normally need to be accessed from user space.
ru: Всё взаимодействие с устройствами PCI, в основном, уже выполнено в ядре на уровне PCI, и поэтому данные вызовы, обычно, ненужны при вызове из пользовательского пространства.

source: Reads to I<buf> from device I<dev> at offset I<off> value.
ru: Выполняет чтение в буфер I<buf> из устройства I<dev> со смещением I<off>.

source: Writes from I<buf> to device I<dev> at offset I<off> value.
ru: Выполняет запись буфера I<buf> в устройство I<dev> со смещением I<off>.

source: You pass it a bus/devfn pair and get a physical address for either the memory offset (for things like prep, this is 0xc0000000), the IO base for PIO cycles, or the ISA holes if any.
ru: Принимает пару шина/функция_устройства и возвращает физический адрес или смещения в памяти (для таких вещей как prep, это 0xc0000000), базы ввода-вывода для циклов PIO, или промежутки (holes) ISA, если они есть.

source: On success, zero is returned. On error, -1 is returned and I<errno> is set appropriately.
ru: При успешном выполнении возвращается ноль. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Returns information on locations of various I/O regions in physical memory according to the I<which> value. Values for I<which> are: B<IOBASE_BRIDGE_NUMBER>, B<IOBASE_MEMORY>, B<IOBASE_IO>, B<IOBASE_ISA_IO>, B<IOBASE_ISA_MEM>.
ru: Возвращает информацию о расположении различных областей ввода-вывода в физической памяти согласно значению I<which>. Значениями I<which> могут быть: B<IOBASE_BRIDGE_NUMBER>, B<IOBASE_MEMORY>, B<IOBASE_IO>, B<IOBASE_ISA_IO>, B<IOBASE_ISA_MEM>.

source: I<len> value is invalid. This does not apply to B<pciconfig_iobase>().
ru: Неправильное значение I<len>. Не применимо к B<pciconfig_iobase>().

source: I/O error.
ru: Ошибка ввода-вывода.

source: For B<pciconfig_iobase>(), "hose" value is NULL. For the other calls, could not find a slot.
ru: Для B<pciconfig_iobase>() значение «рукава (hose)» равно NULL. Для других вызовов не удаётся найти слот.

source: The system has not implemented these calls (B<CONFIG_PCI> not defined).
ru: Данные вызовы в системе не реализованы (не определён макрос B<CONFIG_PCI>).

source: This return value is valid only for B<pciconfig_iobase>(). It is returned if the value for I<which> is invalid.
ru: Данное значение верно только для B<pciconfig_iobase>(). Возвращается, если указано неверное значение I<which>.

source: User does not have the B<CAP_SYS_ADMIN> capability. This does not apply to B<pciconfig_iobase>().
ru: Пользователь не имеет мандата B<CAP_SYS_ADMIN>. Не применимо к B<pciconfig_iobase>().

source: These calls are Linux-specific, available since Linux 2.0.26/2.1.11.
ru: Данные вызовы есть только в Linux, они доступны начиная с версии 2.0.26/2.1.11.

source: perf_event_open - set up performance monitoring
ru: perf_event_open - настройка слежения за производительностью

source: Given a list of parameters, B<perf_event_open>() returns a file descriptor, for use in subsequent system calls (B<read>(2), B<mmap>(2), B<prctl>(2), B<fcntl>(2), etc.).
ru: Получая список параметров, B<perf_event_open>() возвращает файловый дескриптор, который можно использовать в последующих вызовах (B<read>(2), B<mmap>(2), B<prctl>(2), B<fcntl>(2) и т. п.).

source: A call to B<perf_event_open>() creates a file descriptor that allows measuring performance information. Each file descriptor corresponds to one event that is measured; these can be grouped together to measure multiple events simultaneously.
ru: Вызов B<perf_event_open>() создаёт файловый дескриптор, через который можно получать измерения производительности. Каждый файловый дескриптор соответствует одному измеряемому событию; события можно группировать для одновременного измерения.

source: Events can be enabled and disabled in two ways: via B<ioctl>(2) and via B<prctl>(2). When an event is disabled it does not count or generate overflows but does continue to exist and maintain its count value.
ru: События можно включать и выключать двумя способами: через B<ioctl>(2) и через B<prctl>(2). Когда событие отключено, оно не учитывается и не генерирует переполнения, но продолжает существовать и содержать своё значение счётчика.

source: Events come in two flavors: counting and sampled. A I<counting> event is one that is used for counting the aggregate number of events that occur. In general, counting event results are gathered with a B<read>(2) call. A I<sampling> event periodically writes measurements to a buffer that can then be accessed via B<mmap>(2).
ru: События бывают двух видов: подсчитывающие (counting) и измеряющие (sampled). I<Подсчитывающее> событие используется для сложения числа произошедших событий. Обычно, результат подсчёта событий выбирается с помощью вызова B<read>(2). I<Измеряющее> событие периодически пишет значения измерения в буфер, который доступен через вызов B<mmap>(2).

source: Arguments
ru: Аргументы

source: The I<pid> and I<cpu> arguments allow specifying which process and CPU to monitor:
ru: Аргументы I<pid> и I<cpu> позволяют задать отслеживаемый процесс и ЦП:

source: B<pid == 0> and B<cpu == -1>
ru: B<pid == 0> и B<cpu == -1>

source: This measures the calling process/thread on any CPU.
ru: Это позволяет измерять вызывающий процесс/нить на любом ЦП.

source: B<pid == 0> and B<cpu E<gt>= 0>
ru: B<pid == 0> и B<cpu E<gt>= 0>

source: This measures the calling process/thread only when running on the specified CPU.
ru: Это позволяет измерять вызывающий процесс/нить только, когда выполнение происходит на указанном ЦП.

source: B<pid E<gt> 0> and B<cpu == -1>
ru: B<pid E<gt> 0> и B<cpu == -1>

source: This measures the specified process/thread on any CPU.
ru: Это позволяет измерять указанный процесс/нить на любом ЦП.

source: B<pid E<gt> 0> and B<cpu E<gt>= 0>
ru: B<pid E<gt> 0> и B<cpu E<gt>= 0>

source: This measures the specified process/thread only when running on the specified CPU.
ru: Это позволяет измерять указанный процесс/нить только, когда выполнение происходит на указанном ЦП.

source: B<pid == -1> and B<cpu E<gt>= 0>
ru: B<pid == -1> и B<cpu E<gt>= 0>

source: This measures all processes/threads on the specified CPU. This requires B<CAP_SYS_ADMIN> capability or a I</proc/sys/kernel/perf_event_paranoid> value of less than 1.
ru: Это позволяет измерять все процессы/нити на указанном ЦП. Для этого требуется мандат B<CAP_SYS_ADMIN> или значение в I</proc/sys/kernel/perf_event_paranoid> должно быть меньше 1.

source: B<pid == -1> and B<cpu == -1>
ru: B<pid == -1> и B<cpu == -1>

source: This setting is invalid and will return an error.
ru: Это некорректные значения и будет возвращена ошибка.

source: When I<pid> is greater than zero, permission to perform this system call is governed by a ptrace access mode B<PTRACE_MODE_READ_REALCREDS> check; see B<ptrace>(2).
ru: При I<pid> больше нуля право выполнять этот системный вызов определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_REALCREDS>; смотрите B<ptrace>(2).

source: The I<group_fd> argument allows event groups to be created. An event group has one event which is the group leader. The leader is created first, with I<group_fd> = -1. The rest of the group members are created with subsequent B<perf_event_open>() calls with I<group_fd> being set to the file descriptor of the group leader. (A single event on its own is created with I<group_fd> = -1 and is considered to be a group with only 1 member.) An event group is scheduled onto the CPU as a unit: it will be put onto the CPU only if all of the events in the group can be put onto the CPU. This means that the values of the member events can be meaningfully compared\(emadded, divided (to get ratios), and so on\(emwith each other, since they have counted events for the same set of executed instructions.
ru: Аргумент I<group_fd> позволяет создавать группы событий. У группы событий есть одно событие, которое считается лидером. Лидер создаётся самым первым и имеет I<group_fd> = -1. Оставшиеся члены группы создаются последующими вызовами B<perf_event_open>() с I<group_fd> равным файловому дескриптору лидера группы (единственное событие создаётся с I<group_fd> = -1 и считается, что группу имеет только 1 члена). Группа событий планируется для выполнения на одном ЦП как один элемент: он помещается на ЦП только, если все события в группе могут размещаться на ЦП. Это означает, что значения событий-членов могут сравниваться между собой — добавляться, делиться (соотноситься друг с другом) и так далее — следовательно они подсчитывают события для одного набора исполняемых инструкций.

source: The I<flags> argument is formed by ORing together zero or more of the following values:
ru: Аргумент I<flags> формируется с помощью объединения логической операцией ИЛИ нуля или более следующих значений:

source: B<PERF_FLAG_FD_CLOEXEC> (since Linux 3.14)
ru: B<PERF_FLAG_FD_CLOEXEC> (начиная с Linux 3.14)

source: This flag enables the close-on-exec flag for the created event file descriptor, so that the file descriptor is automatically closed on B<execve>(2). Setting the close-on-exec flags at creation time, rather than later with B<fcntl>(2), avoids potential race conditions where the calling thread invokes B<perf_event_open>() and B<fcntl>(2) at the same time as another thread calls B<fork>(2) then B<execve>(2).
ru: Этот флаг включает флаг close-on-exec на созданном файловом дескрипторе события, то есть файловый дескриптор автоматически закрывается при B<execve>(2). Установка флага close-on-exec при создании, а не в процессе работы с помощью B<fcntl>(2), позволяет избежать потенциальной состязательности, когда вызывающая нить вызывает B<perf_event_open>() и B<fcntl>(2) одновременно с запуском другой нитью вызовов B<fork>(2) и B<execve>(2).

source: This flag tells the event to ignore the I<group_fd> parameter except for the purpose of setting up output redirection using the B<PERF_FLAG_FD_OUTPUT> flag.
ru: Этот флаг указывает событию игнорировать параметр I<group_fd>, если не выполняется настройка перенаправления вывода с помощью флага B<PERF_FLAG_FD_OUTPUT>.

source: B<PERF_FLAG_FD_OUTPUT> (broken since Linux 2.6.35)
ru: B<PERF_FLAG_FD_OUTPUT> (не работает, начиная с Linux 2.6.35)

source: This flag re-routes the event's sampled output to instead be included in the mmap buffer of the event specified by I<group_fd>.
ru: Этот флаг переключает вывод измерений с буфера mmap в событие, указанное I<group_fd>.

source: B<PERF_FLAG_PID_CGROUP> (since Linux 2.6.39)
ru: B<PERF_FLAG_PID_CGROUP> (начиная с Linux 2.6.39)

source: This flag activates per-container system-wide monitoring. A container is an abstraction that isolates a set of resources for finer-grained control (CPUs, memory, etc.). In this mode, the event is measured only if the thread running on the monitored CPU belongs to the designated container (cgroup). The cgroup is identified by passing a file descriptor opened on its directory in the cgroupfs filesystem. For instance, if the cgroup to monitor is called I<test>, then a file descriptor opened on I</dev/cgroup/test> (assuming cgroupfs is mounted on I</dev/cgroup>) must be passed as the I<pid> parameter. cgroup monitoring is available only for system-wide events and may therefore require extra permissions.
ru: Этот флаг включает поконтейнерное системное слежение. Контейнер — это абстракция, которая изолирует набор ресурсов для их точного расходования (ЦП, память и т. п.). В этом режиме событие измеряется только, если нить выполняется в отслеживаемом ЦП, принадлежащем назначенному контейнеру (cgroup). Значение cgroup задаётся переданным файловым дескриптором, открываемом в его каталоге в файловой системе cgroupfs. Например, если отслеживаемая cgroup называется I<test>, то файловый дескриптор для I</dev/cgroup/test> (предполагается, что cgroupfs смонтирована в I</dev/cgroup>) должен передаваться как параметр I<pid>. Слежение за cgroup доступно только для системных событий и поэтому требуется дополнительных прав.

source: The I<perf_event_attr> structure provides detailed configuration information for the event being created.
ru: Структура I<perf_event_attr> предоставляет подробную информацию о создаваемом событии.

source: struct perf_event_attr { __u32 type; /* Type of event */ __u32 size; /* Size of attribute structure */ __u64 config; /* Type-specific configuration */
ru: struct perf_event_attr { __u32 type; /* тип события */ __u32 size; /* размер структуры атрибутов */ __u64 config; /* настройки для типа */

source: union { __u64 sample_period; /* Period of sampling */ __u64 sample_freq; /* Frequency of sampling */ };
ru: union { __u64 sample_period; /* период выборки */ __u64 sample_freq; /* частота выборки */ };

source: __u64 sample_type; /* Specifies values included in sample */ __u64 read_format; /* Specifies values returned in read */
ru: __u64 sample_type; /* значения, включённые в измерение */ __u64 read_format; /* значения, возвращаемые при чтении */

source: __u64 disabled : 1, /* off by default */ inherit : 1, /* children inherit it */ pinned : 1, /* must always be on PMU */ exclusive : 1, /* only group on PMU */ exclude_user : 1, /* don't count user */ exclude_kernel : 1, /* don't count kernel */ exclude_hv : 1, /* don't count hypervisor */ exclude_idle : 1, /* don't count when idle */ mmap : 1, /* include mmap data */ comm : 1, /* include comm data */ freq : 1, /* use freq, not period */ inherit_stat : 1, /* per task counts */ enable_on_exec : 1, /* next exec enables */ task : 1, /* trace fork/exit */ watermark : 1, /* wakeup_watermark */ precise_ip : 2, /* skid constraint */ mmap_data : 1, /* non-exec mmap data */ sample_id_all : 1, /* sample_type all events */ exclude_host : 1, /* don't count in host */ exclude_guest : 1, /* don't count in guest */ exclude_callchain_kernel : 1, /* exclude kernel callchains */ exclude_callchain_user : 1, /* exclude user callchains */ mmap2 : 1, /* include mmap with inode data */ comm_exec : 1, /* flag comm events that are due to exec */ use_clockid : 1, /* use clockid for time fields */ context_switch : 1, /* context switch data */
ru: __u64 disabled : 1, /* по умолчанию выключено */ inherit : 1, /* потомок наследует это */ pinned : 1, /* должно быть всегда на PMU */ exclusive : 1, /* только группа на PMU */ exclude_user : 1, /* не учитывать режим пользователя */ exclude_kernel : 1, /* не учитывать режим ядра */ exclude_hv : 1, /* не учитывать режим гипервизора */ exclude_idle : 1, /* не учитывать простой */ mmap : 1, /* включать данные mmap */ comm : 1, /* включать данные comm */ freq : 1, /* использовать частоту вместо периода */ inherit_stat : 1, /* позадачный учёт */ enable_on_exec : 1, /* включать при следующем exec */ task : 1, /* трассировка fork/exit */ watermark : 1, /* wakeup_watermark */ precise_ip : 2, /* ограничение skid */ mmap_data : 1, /* неисполняемые данные mmap */ sample_id_all : 1, /* sample_type всех событий */ exclude_host : 1, /* не учитывать на узле */ exclude_guest : 1, /* не учитывать на госте */ exclude_callchain_kernel : 1, /* исключать цепочки ядерных вызовов */ exclude_callchain_user : 1, /* исключать цепочки пользовательских вызовов */ mmap2 : 1, /* включать mmap с данными inode */ comm_exec : 1, /* помечать события comm, произошедшие из-за exec */ use_clockid : 1, /* использовать clockid в полях времени */ context_switch : 1, /* данные переключения контекста */

source: union { __u32 wakeup_events; /* wakeup every n events */ __u32 wakeup_watermark; /* bytes before wakeup */ };
ru: union { __u32 wakeup_events; /* пробуждаться каждые n событий */ __u32 wakeup_watermark; /* байт до пробуждения */ };

source: __u32 bp_type; /* breakpoint type */
ru: __u32 bp_type; /* тип точки останова */

source: union { __u64 bp_addr; /* breakpoint address */ __u64 kprobe_func; /* for perf_kprobe */ __u64 uprobe_path; /* for perf_uprobe */ __u64 config1; /* extension of config */ };
ru: union { __u64 bp_addr; /* адрес точки останова */ __u64 kprobe_func; /* для perf_kprobe */ __u64 uprobe_path; /* для perf_uprobe */ __u64 config1; /* расширение of config */ };

source: union { __u64 bp_len; /* breakpoint length */ __u64 kprobe_addr; /* with kprobe_func == NULL */ __u64 probe_offset; /* for perf_[k,u]probe */ __u64 config2; /* extension of config1 */ }; __u64 branch_sample_type; /* enum perf_branch_sample_type */ __u64 sample_regs_user; /* user regs to dump on samples */ __u32 sample_stack_user; /* size of stack to dump on samples */ __s32 clockid; /* clock to use for time fields */ __u64 sample_regs_intr; /* regs to dump on samples */ __u32 aux_watermark; /* aux bytes before wakeup */ __u16 sample_max_stack; /* max frames in callchain */ __u16 __reserved_2; /* align to u64 */
ru: union { __u64 bp_len; /* длина точки останова */ __u64 kprobe_addr; /* с kprobe_func == NULL */ __u64 probe_offset; /* для perf_[k,u]probe */ __u64 config2; /* расширение config1 */ }; __u64 branch_sample_type; /* enum perf_branch_sample_type */ __u64 sample_regs_user; /* пользовательские регистры, записываемые в замер */ __u32 sample_stack_user; /* размер стека, записываемые в замер */ __s32 clockid; /* часы, используемые в полях времени */ __u64 sample_regs_intr; /* регистры, записываемые в замер */ __u32 aux_watermark; /* вспомогательные байт перед пробуждением */ __u16 sample_max_stack; /* максимальное количество фреймов в цепочке вызовов */ __u16 __reserved_2; /* выравнивание до u64 */

source: The fields of the I<perf_event_attr> structure are described in more detail below:
ru: Описание полей структуры I<perf_event_attr>:

source: This field specifies the overall event type. It has one of the following values:
ru: В этом поле указывается общий тип события. Может быть одно из следующих значений:

source: This indicates one of the "generalized" hardware events provided by the kernel. See the I<config> field definition for more details.
ru: Одно из «общих» аппаратных событий, предоставляется ядром. Подробней смотрите в описании поля I<config>.

source: This indicates one of the software-defined events provided by the kernel (even if no hardware support is available).
ru: Одно из программных событий, предоставляется ядром (даже, если нет аппаратной поддержки).

source: This indicates a tracepoint provided by the kernel tracepoint infrastructure.
ru: Точка трассировки, предоставляется ядерной инфраструктурой точек трассировки.

source: This indicates a hardware cache event. This has a special encoding, described in the I<config> field definition.
ru: Событие аппаратного кэша. Создаётся специальным кодированием, смотрите описание к полю I<config>.

source: This indicates a "raw" implementation-specific event in the I<config> field.
ru: «Неструктурированное», определяемое реализацией событие из поля I<config>.

source: B<PERF_TYPE_BREAKPOINT> (since Linux 2.6.33)
ru: B<PERF_TYPE_BREAKPOINT> (начиная с Linux 2.6.33)

source: This indicates a hardware breakpoint as provided by the CPU. Breakpoints can be read/write accesses to an address as well as execution of an instruction address.
ru: Аппаратная точка останова, предоставляемая ЦП. Точки останова можно настроить на событие чтения/записи по адресу, а также на выполнение инструкции по определённому адресу.

source: dynamic PMU
ru: динамический PMU
