Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Enable emulation of 32-bit floating-point mode. When this mode is enabled, it emulates 32-bit floating-point operations by raising a reserved-instruction exception on every instruction that uses 32-bit formats and the kernel then handles the instruction in software. (The problem lies in the discrepancy of handling odd-numbered registers which are the high 32 bits of 64-bit registers with even numbers in B<FR=0> mode and the lower 32-bit parts of odd-numbered 64-bit registers in B<FR=1> mode.) Enabling this bit is necessary when code with the O32 FP32 ABI should operate with code with compatible the O32 FPXX or O32 FP64A ABIs (which require B<FR=1> FPU mode) or when it is executed on newer hardware (MIPS R6 onwards) which lacks B<FR=0> mode support when a binary with the FP32 ABI is used.
ru: Включает эмуляцию 32-битного режима плавающей запятой. Когда этот режим включён, эмуляция 32-битных операций с плавающей запятой выполняется генерацией исключения на каждую инструкцию, использующую 32-битный формат, и ядро обрабатывает инструкцию программно (проблема заключается в несоответствии обработке регистров с нечётными номерами, которые содержатся в 32 старших битах 64-битных регистров с чётными номерами при режиме B<FR=0> и в 32 младших битах 64-битах регистров с нечётными номерами при режиме B<FR=1>). При включении этого бита необходимо, чтобы код с O32 FP32 ABI работал с кодом O32 FPXX или O32 FP64A ABI (для которого требуется режим B<FR=1> FPU) или когда он выполняется на новой аппаратуре (MIPS R6 и новее), в которой нет поддержки режима B<FR=0>, когда используется двоичный файл с FP32 ABI.

source: Note that this mode makes sense only when the FPU is in 64-bit mode (B<FR=1>).
ru: Заметим, что этот режим приобретает смысл только, если FPU в 64-битном режиме (B<FR=1>).

source: Note that the use of emulation inherently has a significant performance hit and should be avoided if possible.
ru: Также заметим, что использование эмуляции по определению уменьшает производительность и её нужно, по возможности, избегать.

source: In the N32/N64 ABI, 64-bit floating-point mode is always used, so FPU emulation is not required and the FPU always operates in B<FR=1> mode.
ru: В N32/N64 ABI всегда используется 64-битный режим плавающей запятой, поэтому эмуляция FPU не требуется и FPU всегда работает в режиме B<FR=1>.

source: This option is mainly intended for use by the dynamic linker (B<ld.so>(8)).
ru: Данный параметр, в основном, предназначен для динамического компоновщика (B<ld.so>(8)).

source: The arguments I<arg3>, I<arg4>, and I<arg5> are ignored.
ru: Аргументы I<arg3>, I<arg4> и I<arg5> игнорируются.

source: B<PR_GET_FP_MODE> (since Linux 4.0, only on MIPS)
ru: B<PR_GET_FP_MODE> (начиная с Linux 4.0, только на MIPS)

source: Get the current floating-point mode (see the description of B<PR_SET_FP_MODE> for details).
ru: Возвращает текущий режим плавающей запятой (смотрите описание B<PR_SET_FP_MODE>).

source: On success, the call returns a bit mask which represents the current floating-point mode.
ru: При успешном выполнении возвращается битовая маска, представляющая текущий режим плавающей запятой.

source: The arguments I<arg2>, I<arg3>, I<arg4>, and I<arg5> are ignored.
ru: Аргументы I<arg2>, I<arg3>, I<arg4> и I<arg5> игнорируются.

source: B<PR_SET_FPEMU> (since Linux 2.4.18, 2.5.9, only on ia64)
ru: B<PR_SET_FPEMU> (начиная с Linux 2.4.18, 2.5.9, только для ia64)

source: Set floating-point emulation control bits to I<arg2>. Pass B<PR_FPEMU_NOPRINT> to silently emulate floating-point operation accesses, or B<PR_FPEMU_SIGFPE> to not emulate floating-point operations and send B<SIGFPE> instead.
ru: Устанавливает значение управляющих эмуляцией плавающей точки бит равным значению I<arg2>. Для негласной (silently) эмуляции операций с плавающей точкой передайте B<PR_FPEMU_NOPRINT>; при указании B<PR_FPEMU_SIGFPE> операции с плавающей точкой не эмулируются, а посылается сигнал B<SIGFPE>.

source: B<PR_GET_FPEMU> (since Linux 2.4.18, 2.5.9, only on ia64)
ru: B<PR_GET_FPEMU> (начиная с Linux 2.4.18, 2.5.9, только для ia64)

source: Return floating-point emulation control bits, in the location pointed to by I<(int\ *) arg2>.
ru: Записывает значение управляющих бит эмуляции плавающей точки по адресу, указанному в I<(int\ *) arg2>.

source: B<PR_SET_FPEXC> (since Linux 2.4.21, 2.5.32, only on PowerPC)
ru: B<PR_SET_FPEXC> (начиная с Linux 2.4.21, 2.5.32, только для PowerPC)

source: Set floating-point exception mode to I<arg2>. Pass B<PR_FP_EXC_SW_ENABLE> to use FPEXC for FP exception enables, B<PR_FP_EXC_DIV> for floating-point divide by zero, B<PR_FP_EXC_OVF> for floating-point overflow, B<PR_FP_EXC_UND> for floating-point underflow, B<PR_FP_EXC_RES> for floating-point inexact result, B<PR_FP_EXC_INV> for floating-point invalid operation, B<PR_FP_EXC_DISABLED> for FP exceptions disabled, B<PR_FP_EXC_NONRECOV> for async nonrecoverable exception mode, B<PR_FP_EXC_ASYNC> for async recoverable exception mode, B<PR_FP_EXC_PRECISE> for precise exception mode.
ru: Устанавливает режим исключений плавающей точки равным I<arg2>. Значение B<PR_FP_EXC_SW_ENABLE> включает использование FPEXC для исключений плавающей точки, B<PR_FP_EXC_DIV> \(em исключение деления на ноль, B<PR_FP_EXC_OVF> \(em исключение переполнения, B<PR_FP_EXC_UND> \(em исключение исчерпания, B<PR_FP_EXC_RES> \(em исключение неточного результата, B<PR_FP_EXC_INV> \(em исключение недопустимой операции, B<PR_FP_EXC_DISABLED> отключает исключения плавающей точки, B<PR_FP_EXC_NONRECOV> включает режим асинхронного невосстанавливаемого исключения, B<PR_FP_EXC_ASYNC> включает режим асинхронного восстанавливаемого исключения, B<PR_FP_EXC_PRECISE> включает режим исключения точности.

source: B<PR_GET_FPEXC> (since Linux 2.4.21, 2.5.32, only on PowerPC)
ru: B<PR_GET_FPEXC> (начиная с Linux 2.4.21, 2.5.32, только для PowerPC)

source: Return floating-point exception mode, in the location pointed to by I<(int\ *) arg2>.
ru: Записывает значение режима исключений плавающей точки по адресу, указанному в I<(int\ *) arg2>.

source: B<PR_SET_KEEPCAPS> (since Linux 2.2.18)
ru: B<PR_SET_KEEPCAPS> (начиная с Linux 2.2.18)

source: Set the state of the calling thread's "keep capabilities" flag. The effect of this flag is described in B<capabilities>(7). I<arg2> must be either 0 (clear the flag) or 1 (set the flag). The "keep capabilities" value will be reset to 0 on subsequent calls to B<execve>(2).
ru: Устанавливает флаг вызывающей нити «оставить мандаты». Этот флаг описан в B<capabilities>(7). Значение I<arg2> должно быть или 0 (сбросить флаг) или 1 (установить флаг). Значение флага «оставить мандаты» будет сброшено в 0 при последующих вызовах B<execve>(2).

source: B<PR_GET_KEEPCAPS> (since Linux 2.2.18)
ru: B<PR_GET_KEEPCAPS> (начиная с Linux 2.2.18)

source: Return (as the function result) the current state of the calling thread's "keep capabilities" flag. See B<capabilities>(7) for a description of this flag.
ru: Возвращает (как результат функции) текущее состояние флага «оставить мандаты» вызывающей нити. Описание флага смотрите в B<capabilities>(7).

source: B<PR_MCE_KILL> (since Linux 2.6.32)
ru: B<PR_MCE_KILL> (начиная с Linux 2.6.32)

source: Set the machine check memory corruption kill policy for the calling thread. If I<arg2> is B<PR_MCE_KILL_CLEAR>, clear the thread memory corruption kill policy and use the system-wide default. (The system-wide default is defined by I</proc/sys/vm/memory_failure_early_kill>; see B<proc>(5).) If I<arg2> is B<PR_MCE_KILL_SET>, use a thread-specific memory corruption kill policy. In this case, I<arg3> defines whether the policy is I<early kill> (B<PR_MCE_KILL_EARLY>), I<late kill> (B<PR_MCE_KILL_LATE>), or the system-wide default (B<PR_MCE_KILL_DEFAULT>). Early kill means that the thread receives a B<SIGBUS> signal as soon as hardware memory corruption is detected inside its address space. In late kill mode, the process is killed only when it accesses a corrupted page. See B<sigaction>(2) for more information on the B<SIGBUS> signal. The policy is inherited by children. The remaining unused B<prctl>() arguments must be zero for future compatibility.
ru: Устанавливает политику удаления (kill) при обнаружении повреждения памяти машинной проверкой для вызывающей нити. Если значение I<arg> равно B<PR_MCE_KILL_CLEAR>, то политика удаления (kill) сбрасывается и используется системная установка по умолчанию. (Значение системной установки по умолчанию определено в I</proc/sys/vm/memory_failure_early_kill>; смотрите B<proc>(5).) Значение I<arg2>, равное B<PR_MCE_KILL_SET>, указывает использовать политику удаления, заданную в нити. В этом случае значение I<arg3> определяет политику: I<раннее удаление> (B<PR_MCE_KILL_EARLY>), I<позднее удаление> (B<PR_MCE_KILL_LATE>) или системная установка по умолчанию (B<PR_MCE_KILL_DEFAULT>). При раннем удалении нить получает сигнал B<SIGBUS> сразу же при аппаратном обнаружении повреждения памяти в её адресном пространстве. В режиме позднего удаления процесс будет удалён только когда обратится к повреждённой странице. Более подробную информацию о сигнале B<SIGBUS> смотрите в I<sigaction(2)>. Политика наследуется потомками. Значения остальных неиспользуемых аргументов B<prctl>() должны быть равны нулю для совместимости в будущем.

source: B<PR_MCE_KILL_GET> (since Linux 2.6.32)
ru: B<PR_MCE_KILL_GET> (начиная с Linux 2.6.32)

source: Return the current per-process machine check kill policy. All unused B<prctl>() arguments must be zero.
ru: Возвращает значение политики удаления при машинной проверке для текущего процесса. Значения всех неиспользуемых аргументов B<prctl>() должны быть равны нулю.

source: B<PR_SET_MM> (since Linux 3.3)
ru: B<PR_SET_MM> (начиная с Linux 3.3)

source: Modify certain kernel memory map descriptor fields of the calling process. Usually these fields are set by the kernel and dynamic loader (see B<ld.so>(8) for more information) and a regular application should not use this feature. However, there are cases, such as self-modifying programs, where a program might find it useful to change its own memory map.
ru: Изменяет определённые поля дескриптора карты памяти ядра вызывающего процесса. Обычно, значения этих полей задаются ядром или динамическим загрузчиком (подробней смотрите B<ld.so>(8)), и обычные приложения не должны использовать эту возможность. Однако, есть случаи (самоизменяющиеся программы), где для программы может оказаться полезным изменение своей карты памяти.

source: The calling process must have the B<CAP_SYS_RESOURCE> capability. The value in I<arg2> is one of the options below, while I<arg3> provides a new value for the option. The I<arg4> and I<arg5> arguments must be zero if unused.
ru: Вызывающий процесс должен иметь мандат B<CAP_SYS_RESOURCE>. Значения аргумента I<arg2> описаны далее, а в I<arg3> задаётся новое значение.Аргументы, I<arg4> и I<arg5>, если не используются, должны быть равно нулю.

source: Before Linux 3.10, this feature is available only if the kernel is built with the B<CONFIG_CHECKPOINT_RESTORE> option enabled.
ru: До Linux 3.10 эта возможность доступна только, если ядро собрано с параметром B<CONFIG_CHECKPOINT_RESTORE>.

source: Set the address above which the program text can run. The corresponding memory area must be readable and executable, but not writable or shareable (see B<mprotect>(2) and B<mmap>(2) for more information).
ru: Устанавливает адрес памяти, выше которого располагается код программы, который может выполняться. Соответствующая область памяти должна быть доступна на чтение и выполнение, но не на запись или быть общедоступной (подробности смотрите в B<mprotect>(2) и B<mmap>(2)).

source: Set the address below which the program text can run. The corresponding memory area must be readable and executable, but not writable or shareable.
ru: Устанавливает адрес памяти, ниже которого располагается код программы, который может выполняться. Соответствующая область памяти должна быть доступна на чтение и выполнение, но не на запись или быть общедоступной.

source: Set the address above which initialized and uninitialized (bss) data are placed. The corresponding memory area must be readable and writable, but not executable or shareable.
ru: Устанавливает адрес памяти, выше которого располагаются инициализированные и не инициализированные (bss) данные. Соответствующая область памяти должна быть доступна на чтение и запись, но не на выполнение или быть в общем доступе.

source: Set the address below which initialized and uninitialized (bss) data are placed. The corresponding memory area must be readable and writable, but not executable or shareable.
ru: Устанавливает адрес памяти, ниже которого располагаются инициализированные и не инициализированные (bss) данные. Соответствующая область памяти должна быть доступна на чтение и запись, но не на выполнение или быть в общем доступе.

source: Set the start address of the stack. The corresponding memory area must be readable and writable.
ru: Устанавливает начальный адрес стека. Соответствующая область памяти должна быть доступна на чтение и запись.

source: Set the address above which the program heap can be expanded with B<brk>(2) call. The address must be greater than the ending address of the current program data segment. In addition, the combined size of the resulting heap and the size of the data segment can't exceed the B<RLIMIT_DATA> resource limit (see B<setrlimit>(2)).
ru: Устанавливает адрес памяти, выше которого можно расширять программную кучу с помощью вызова B<brk>(2). Адрес должен быть больше конечного адреса текущего программного сегмента данных. Также, суммарный размер полученной кучи и сегмента данных не может превышать ограничитель ресурса B<RLIMIT_DATA> (смотрите B<setrlimit>(2)).

source: Set the current B<brk>(2) value. The requirements for the address are the same as for the B<PR_SET_MM_START_BRK> option.
ru: Устанавливает текущее значение B<brk>(2). Требования к адресу те же, что и в параметре B<PR_SET_MM_START_BRK>.

source: The following options are available since Linux 3.5.
ru: Начиная с Linux 3.5 доступны следующие параметры:

source: Set the address above which the program command line is placed.
ru: Задаёт адрес, выше которого размещена командная строка программы.

source: Set the address below which the program command line is placed.
ru: Задаёт адрес, ниже которого размещена командная строка программы.

source: Set the address above which the program environment is placed.
ru: Задаёт адрес, выше которого размещено окружение программы.

source: Set the address below which the program environment is placed.
ru: Задаёт адрес, ниже которого размещено окружение программы.

source: The address passed with B<PR_SET_MM_ARG_START>, B<PR_SET_MM_ARG_END>, B<PR_SET_MM_ENV_START>, and B<PR_SET_MM_ENV_END> should belong to a process stack area. Thus, the corresponding memory area must be readable, writable, and (depending on the kernel configuration) have the B<MAP_GROWSDOWN> attribute set (see B<mmap>(2)).
ru: Адрес, передаваемый с B<PR_SET_MM_ARG_START>, B<PR_SET_MM_ARG_END>, B<PR_SET_MM_ENV_START> и B<PR_SET_MM_ENV_END>, должен принадлежать области стека процесса. То есть, соответствующая память должна быть доступна на чтение, запись и (в зависимости от настройки ядра) у неё должен быть установлен атрибут B<MAP_GROWSDOWN> (смотрите B<mmap>(2)).

source: Set a new auxiliary vector. The I<arg3> argument should provide the address of the vector. The I<arg4> is the size of the vector.
ru: Задаёт новый вспомогательный вектор (auxiliary vector). В аргументе I<arg3> должен передаваться адрес вектора. В аргументе I<arg4> — размер вектора.

source: Supersede the I</proc/pid/exe> symbolic link with a new one pointing to a new executable file identified by the file descriptor provided in I<arg3> argument. The file descriptor should be obtained with a regular B<open>(2) call.
ru: Заменяет символьную ссылку I</proc/pid/exe> новой, указывающей на новый исполняемый файл, задаваемый файловым дескриптором в аргументе I<arg3>. Файловый дескриптор должен быть получен с помощью обычного вызова B<open>(2).

source: To change the symbolic link, one needs to unmap all existing executable memory areas, including those created by the kernel itself (for example the kernel usually creates at least one executable memory area for the ELF I<.text> section).
ru: Для изменения символьной ссылки необходимо отключить (unmap) все существующие исполняемые области памяти, включая созданные самим ядром (например, ядро, обычно, создаёт, как минимум, исполняемую область памяти для раздела ELF I<.text>).

source: In Linux 4.9 and earlier, the B<PR_SET_MM_EXE_FILE> operation can be performed only once in a process's lifetime; attempting to perform the operation a second time results in the error B<EPERM>. This restriction was enforced for security reasons that were subsequently deemed specious, and the restriction was removed in Linux 4.10 because some user-space applications needed to perform this operation more than once.
ru: В Linux 4.9 и старее операцию B<PR_SET_MM_EXE_FILE> можно выполнить только один раз за время существования процесса; повторная попытка выполнения приводит к ошибке B<EPERM>. Это ограничение было введено по причинам безопасности, которые впоследствии стали излишними, и ограничение было удалено в Linux 4.10, так как некоторым приложениям пользовательского пространства требуется выполнять эту операцию более одного раза.

source: The following options are available since Linux 3.18.
ru: Начиная с Linux 3.18 доступны следующие параметры:

source: Provides one-shot access to all the addresses by passing in a I<struct prctl_mm_map> (as defined in I<E<lt>linux/prctl.hE<gt>>). The I<arg4> argument should provide the size of the struct.
ru: Предоставляет однократный доступ ко всем адресам, переданным в I<struct prctl_mm_map> (определена в I<E<lt>linux/prctl.hE<gt>>). В аргументе I<arg4> должен указываться размер структуры.

source: This feature is available only if the kernel is built with the B<CONFIG_CHECKPOINT_RESTORE> option enabled.
ru: Эта возможность доступна только, если ядро собрано с параметром B<CONFIG_CHECKPOINT_RESTORE>.

source: Returns the size of the I<struct prctl_mm_map> the kernel expects. This allows user space to find a compatible struct. The I<arg4> argument should be a pointer to an unsigned int.
ru: Возвращает размер I<struct prctl_mm_map>, который ожидает ядро. Это позволяет пользователю подобрать совместимую структуру. Аргумент I<arg4> должен быть указателем на unsigned int.

source: B<PR_MPX_ENABLE_MANAGEMENT>, B<PR_MPX_DISABLE_MANAGEMENT> (since Linux 3.19)
ru: B<PR_MPX_ENABLE_MANAGEMENT>, B<PR_MPX_DISABLE_MANAGEMENT> (начиная с Linux 3.19)

source: Enable or disable kernel management of Memory Protection eXtensions (MPX) bounds tables. The I<arg2>, I<arg3>, I<arg4>, and I<arg5> arguments must be zero.
ru: Включает или выключает управление таблицами границ Memory Protection eXtensions (MPX) из ядра. Аргументы I<arg2>, I<arg3>, I<arg4> и I<arg5> должны быть равно 0.

source: MPX is a hardware-assisted mechanism for performing bounds checking on pointers. It consists of a set of registers storing bounds information and a set of special instruction prefixes that tell the CPU on which instructions it should do bounds enforcement. There is a limited number of these registers and when there are more pointers than registers, their contents must be "spilled" into a set of tables. These tables are called "bounds tables" and the MPX B<prctl>() operations control whether the kernel manages their allocation and freeing.
ru: MPX — полуаппаратный механизм проверки границ указателей. Он состоит из набора регистров, хранящих информацию о границах и наборе специальных префиксов инструкций, которые указывают ЦП, в каких инструкциях нужно проверить границы. Число регистров ограничено и когда указателей становится больше чем регистров, их содержимое нужно «засыпать» в набор таблиц. Эти таблицы называются «таблицами границ» (bounds tables), а для управления их заполнением и освобождением из ядра существуют операции MPX B<prctl>().

source: When management is enabled, the kernel will take over allocation and freeing of the bounds tables. It does this by trapping the #BR exceptions that result at first use of missing bounds tables and instead of delivering the exception to user space, it allocates the table and populates the bounds directory with the location of the new table. For freeing, the kernel checks to see if bounds tables are present for memory which is not allocated, and frees them if so.
ru: Когда управление разрешено, ядро начинает следить за выделением и освобождением таблиц границ. Это делается через ловлю исключений #BR, которые возникают при первом использовании отсутствующей таблицы границ и в результате доставляется исключение в пользовательское пространство, там выделяется таблица и заполняется каталог границ с расположением новой таблицы. Для освобождения ядро проверяет есть ли таблицы границ для нераспределённой памяти и освобождает их если есть.

source: Before enabling MPX management using B<PR_MPX_ENABLE_MANAGEMENT>, the application must first have allocated a user-space buffer for the bounds directory and placed the location of that directory in the I<bndcfgu> register.
ru: Перед включением управления MPX с помощью B<PR_MPX_ENABLE_MANAGEMENT> приложение сначала должно выделить буфер в пользовательском пространстве для каталог границ и поместить расположение этого каталоге в регистр I<bndcfgu>.

source: These calls fail if the CPU or kernel does not support MPX. Kernel support for MPX is enabled via the B<CONFIG_X86_INTEL_MPX> configuration option. You can check whether the CPU supports MPX by looking for the 'mpx' CPUID bit, like with the following command:
ru: Эти вызовы завершаются ошибкой, если ЦП или ядро не поддерживают MPX. Поддержка MPX в ядре включается параметром настройки B<CONFIG_X86_INTEL_MPX>. Вы можете проверить наличие поддержки MPX в ЦП прочитав бит «mpx» в CPUID следующей командой:

source: A thread may not switch in or out of long (64-bit) mode while MPX is enabled.
ru: Нить может не переключиться в «длинный» режим (64-битный) при включённом MPX.

source: All threads in a process are affected by these calls.
ru: Эти вызовы влияют на все нити процесса.

source: The child of a B<fork>(2) inherits the state of MPX management. During B<execve>(2), MPX management is reset to a state as if B<PR_MPX_DISABLE_MANAGEMENT> had been called.
ru: Потомок B<fork>(2) наследует состояние управления MPX. Во время B<execve>(2) управление MPX сбрасывается в состояние, как если бы выполнился вызов B<PR_MPX_DISABLE_MANAGEMENT>.

source: For further information on Intel MPX, see the kernel source file I<Documentation/x86/intel_mpx.txt>.
ru: Дополнительную информацию по Intel MPX смотрите в файле исходного кода ядра I<Documentation/x86/intel_mpx.txt>.

source: B<PR_SET_NAME> (since Linux 2.6.9)
ru: B<PR_SET_NAME> (начиная с Linux 2.6.9)
