Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The B<FIONREAD> operation is not specified in any standard, but is provided on many implementations.
ru: Операция B<FIONREAD> отсутствует в стандартах, но имеется во многих реализациях.

source: On Linux, the following files control how much memory can be used for pipes:
ru: В Linux управление количеством памяти каналов осуществляется через следующие файлы:

source: I</proc/sys/fs/pipe-max-pages> (only in Linux 2.6.34)
ru: I</proc/sys/fs/pipe-max-pages> (только в Linux 2.6.34)

source: An upper limit, in pages, on the capacity that an unprivileged user (one without the B<CAP_SYS_RESOURCE> capability) can set for a pipe.
ru: Верхнее ограничение (в страницах) ёмкости, которое непривилегированный пользователь (без мандата B<CAP_SYS_RESOURCE>) может задать для канала.

source: The default value for this limit is 16 times the default pipe capacity (see above); the lower limit is two pages.
ru: Значение по умолчанию этого ограничения равно 16 кратному размеру ёмкости канала по умолчанию (смотрите выше); нижнее ограничение равно 2м страницам.

source: This interface was removed in Linux 2.6.35, in favor of I</proc/sys/fs/pipe-max-size>.
ru: Данный интерфейс удалён в Linux 2.6.35; его заменяет I</proc/sys/fs/pipe-max-size>.

source: I</proc/sys/fs/pipe-max-size> (since Linux 2.6.35)
ru: I</proc/sys/fs/pipe-max-size> (начиная с Linux 2.6.35)

source: The maximum size (in bytes) of individual pipes that can be set by users without the B<CAP_SYS_RESOURCE> capability. The value assigned to this file may be rounded upward, to reflect the value actually employed for a convenient implementation. To determine the rounded-up value, display the contents of this file after assigning a value to it.
ru: Максимальный размер (в байтах) отдельных каналов, который может быть установлен пользователем без мандата B<CAP_SYS_RESOURCE>. Значение, записываемое в этот файл, может округлиться в большую сторону, отражая реальное значение, принятое для удобства реализации. Чтобы определить увеличенное значение, прочитайте содержимое этого файла после записи значения.

source: The default value for this file is 1048576 (1\ MiB). The minimum value that can be assigned to this file is the system page size. Attempts to set a limit less than the page size cause B<write>(2) to fail with the error B<EINVAL>.
ru: Значение по умолчанию равно 1048576 (1\ МиБ). Минимальное значение равно размеру системной страницы. При попытке задать меньшее значение вызов B<write>(2) завершится ошибкой B<EINVAL>.

source: Since Linux 4.9, the value on this file also acts as a ceiling on the default capacity of a new pipe or newly opened FIFO.
ru: Начиная с Linux 4.9 значение в данном файле также служит верхним пределом ёмкости по умолчанию для новых каналов или открываемых FIFO.

source: I</proc/sys/fs/pipe-user-pages-hard> (since Linux 4.5)
ru: I</proc/sys/fs/pipe-user-pages-hard> (начиная с Linux 4.5)

source: The hard limit on the total size (in pages) of all pipes created or set by a single unprivileged user (i.e., one with neither the B<CAP_SYS_RESOURCE> nor the B<CAP_SYS_ADMIN> capability). So long as the total number of pages allocated to pipe buffers for this user is at this limit, attempts to create new pipes will be denied, and attempts to increase a pipe's capacity will be denied.
ru: Жёсткое ограничение на общий размер (в страницах) всех каналов создаваемых или изменяемых одним непривилегированным пользователем (т. е., без мандата B<CAP_SYS_RESOURCE> или B<CAP_SYS_ADMIN>). Пока общее количество страниц, выделенных под буферы каналов для этого пользователя, равно этому ограничению, попытки создать новые каналы будут отклоняться, также как и попытки увеличить ёмкость канала.

source: When the value of this limit is zero (which is the default), no hard limit is applied.
ru: Если значение этого ограничения равно нулю (по умолчанию), то жёсткое ограничение не применяется.

source: I</proc/sys/fs/pipe-user-pages-soft> (since Linux 4.5)
ru: I</proc/sys/fs/pipe-user-pages-soft> (начиная с Linux 4.5)

source: The soft limit on the total size (in pages) of all pipes created or set by a single unprivileged user (i.e., one with neither the B<CAP_SYS_RESOURCE> nor the B<CAP_SYS_ADMIN> capability). So long as the total number of pages allocated to pipe buffers for this user is at this limit, individual pipes created by a user will be limited to one page, and attempts to increase a pipe's capacity will be denied.
ru: Мягкое ограничение на общий размер (в страницах) всех каналов создаваемых или изменяемых одним непривилегированным пользователем (т. е., без мандата B<CAP_SYS_RESOURCE> или B<CAP_SYS_ADMIN>). Пока общее количество страниц, выделенных под буферы каналов для этого пользователя, равно этому ограничению, отдельные каналы, создаваемые пользователем, будут ограничены одной страницей, а попытки увеличить ёмкость канала будут отклоняться.

source: When the value of this limit is zero, no soft limit is applied. The default value for this file is 16384, which permits creating up to 1024 pipes with the default capacity.
ru: Если значение этого ограничения равно нулю, то мягкое ограничение не применяется. По умолчанию значение в этом файле равно 16384, что позволяет создать до 1024 каналов с ёмкостью по умолчанию.

source: Before Linux 4.9, some bugs affected the handling of the I<pipe-user-pages-soft> and I<pipe-user-pages-hard> limits; see BUGS.
ru: До Linux 4.9 имелись дефекты, влияющие на обработку ограничений I<pipe-user-pages-soft> и I<pipe-user-pages-hard>; смотрите ДЕФЕКТЫ.

source: POSIX.1 says that B<write>(2)s of less than B<PIPE_BUF> bytes must be atomic: the output data is written to the pipe as a contiguous sequence. Writes of more than B<PIPE_BUF> bytes may be nonatomic: the kernel may interleave the data with data written by other processes. POSIX.1 requires B<PIPE_BUF> to be at least 512 bytes. (On Linux, B<PIPE_BUF> is 4096 bytes.) The precise semantics depend on whether the file descriptor is nonblocking (B<O_NONBLOCK>), whether there are multiple writers to the pipe, and on I<n>, the number of bytes to be written:
ru: В POSIX.1 указано, что операция B<write>(2) для записи меньше чем B<PIPE_BUF> байт должна быть атомарна: выходные данные записываются в канал как непрерывная последовательность. Запись более B<PIPE_BUF> байт может быть не атомарна: ядро может чередовать данные с данными, записываемыми другими процессами. В POSIX.1 требуется, чтобы значение B<PIPE_BUF> было не менее 512 байт (в Linux, B<PIPE_BUF> равно 4096 байт). Точная семантика зависит от вида блокированности файлового дескриптора (B<O_NONBLOCK>), есть ли несколько писателей в канала и от I<n>, количества записываемых байт:

source: B<O_NONBLOCK> disabled, I<n> E<lt>= B<PIPE_BUF>
ru: B<O_NONBLOCK> сброшен, I<n> E<lt>= B<PIPE_BUF>

source: All I<n> bytes are written atomically; B<write>(2) may block if there is not room for I<n> bytes to be written immediately
ru: Все I<n> байт записываются атомарно; B<write>(2) может заблокироваться, если нет места для немедленной записи I<n> байт

source: B<O_NONBLOCK> enabled, I<n> E<lt>= B<PIPE_BUF>
ru: B<O_NONBLOCK> установлен, I<n> E<lt>= B<PIPE_BUF>

source: If there is room to write I<n> bytes to the pipe, then B<write>(2) succeeds immediately, writing all I<n> bytes; otherwise B<write>(2) fails, with I<errno> set to B<EAGAIN>.
ru: Если есть место для записи I<n> байт в канал, то B<write>(2) немедленно завершается без ошибки, записывая все I<n> байт; в противном случае B<write>(2) завершается с ошибкой, а I<errno> присваивается значение B<EAGAIN>.

source: B<O_NONBLOCK> disabled, I<n> E<gt> B<PIPE_BUF>
ru: B<O_NONBLOCK> сброшен, I<n> E<gt> B<PIPE_BUF>

source: The write is nonatomic: the data given to B<write>(2) may be interleaved with B<write>(2)s by other process; the B<write>(2) blocks until I<n> bytes have been written.
ru: Запись не атомарна: данные, переданные во B<write>(2), могут чередоваться с B<write>(2) из других процессов; B<write>(2) блокируется до тех пор, пока не будут записаны I<n> байт.

source: B<O_NONBLOCK> enabled, I<n> E<gt> B<PIPE_BUF>
ru: B<O_NONBLOCK> установлен, I<n> E<gt> B<PIPE_BUF>

source: If the pipe is full, then B<write>(2) fails, with I<errno> set to B<EAGAIN>. Otherwise, from 1 to I<n> bytes may be written (i.e., a "partial write" may occur; the caller should check the return value from B<write>(2) to see how many bytes were actually written), and these bytes may be interleaved with writes by other processes.
ru: Если канала переполнен, то B<write>(2) завершается с ошибкой, а I<errno> присваивается значение B<EAGAIN>. В противном случае, может быть записано от 1 до I<n> байт (т. е., может произойти «частичная запись»; вызывающий должен проверить возвращаемое значение B<write>(2), чтобы узнать сколько байт действительно записано), и эти байты могут чередоваться с данными, записанными другими процессами.

source: Open file status flags
ru: Флаги состояния открытого файла

source: The only open file status flags that can be meaningfully applied to a pipe or FIFO are B<O_NONBLOCK> and B<O_ASYNC>.
ru: К каналу и FIFO из флагов состояния открытого файла применимы только B<O_NONBLOCK> и B<O_ASYNC>.

source: Setting the B<O_ASYNC> flag for the read end of a pipe causes a signal (B<SIGIO> by default) to be generated when new input becomes available on the pipe. The target for delivery of signals must be set using the B<fcntl>(2) B<F_SETOWN> command. On Linux, B<O_ASYNC> is supported for pipes and FIFOs only since kernel 2.6.
ru: Установка флага B<O_ASYNC> для чтения от конца канала проводит к генерации сигнала (по умолчанию B<SIGIO>) при появлении новых данных в канале. Получатель сигнала должен быть указан с помощью команды B<F_SETOWN> вызовом B<fcntl>(2). В Linux B<O_ASYNC> поддерживается для каналов и FIFO только начиная с ядра версии 2.6.

source: Portability notes
ru: Замечания о переносимости

source: On some systems (but not Linux), pipes are bidirectional: data can be transmitted in both directions between the pipe ends. POSIX.1 requires only unidirectional pipes. Portable applications should avoid reliance on bidirectional pipe semantics.
ru: В некоторых системах (но не в Linux), каналы являются двунаправленными: данные можно передавать в обоих направлениях между концами канала. Согласно POSIX.1 требуются только однонаправленные каналы. Переносимые приложения не должны зависеть от семантики двунаправленных каналов.

source: Before Linux 4.9, some bugs affected the handling of the I<pipe-user-pages-soft> and I<pipe-user-pages-hard> limits when using the B<fcntl>(2) B<F_SETPIPE_SZ> operation to change a pipe's capacity:
ru: До Linux 4.9 имелись дефекты, влияющие на обработку ограничений I<pipe-user-pages-soft> и I<pipe-user-pages-hard> при операции B<fcntl>(2) B<F_SETPIPE_SZ> по изменению ёмкости канала:

source: When increasing the pipe capacity, the checks against the soft and hard limits were made against existing consumption, and excluded the memory required for the increased pipe capacity. The new increase in pipe capacity could then push the total memory used by the user for pipes (possibly far) over a limit. (This could also trigger the problem described next.)
ru: При увеличении ёмкости канала, проверки мягких и жёстких ограничений делались по существующему потреблению и не включали память, требуемую для увеличения ёмкости канала. Новое увеличение ёмкости канала в последствии могло превысить ограничение на общее количество памяти, используемой пользователем для каналов (это могло также вызвать проблему, описанную далее).

source: Starting with Linux 4.9, the limit checking includes the memory required for the new pipe capacity.
ru: Начиная с Linux 4.9 при проверке ограничения добавляется память, требуемая под ёмкость нового канала.

source: The limit checks were performed even when the new pipe capacity was less than the existing pipe capacity. This could lead to problems if a user set a large pipe capacity, and then the limits were lowered, with the result that the user could no longer decrease the pipe capacity.
ru: Проверки ограничения выполнялись даже, когда ёмкость нового канала была меньше чем ёмкость существующего канала. Это могло привести к проблемам, если пользователь устанавливал большую ёмкость канала, а затем ограничения снижались, и в результате этого пользователь больше не мог уменьшить ёмкость канала.

source: Starting with Linux 4.9, checks against the limits are performed only when increasing a pipe's capacity; an unprivileged user can always decrease a pipe's capacity.
ru: Начиная с Linux 4.9 проверки ограничений выполняются только когда ёмкость канала увеличивается; непривилегированный пользователь всегда может уменьшить ёмкость канала.

source: The accounting and checking against the limits were done as follows:
ru: Учёт и проверка ограничений выполнялись следующим образом:

source: (a)
ru: (а)

source: Test whether the user has exceeded the limit.
ru: Выполнялась проверка не превышает ли пользователь ограничение.

source: (b)
ru: (б)

source: Make the new pipe buffer allocation.
ru: Выделялся буфер под новый канал.

source: (c)
ru: (в)

source: Account new allocation against the limits.
ru: Учитывалось новое выделение в ограничениях.

source: This was racey. Multiple processes could pass point (a) simultaneously, and then allocate pipe buffers that were accounted for only in step (c), with the result that the user's pipe buffer allocation could be pushed over the limit.
ru: Это приводило к появлению состязательности. Несколько процессов могли пройти пункт (а) одновременно и затем выделить буферы канала, которое учитывалось только в шаге (в), что приводило к превышению пользовательского ограничения размера выделения буферов под канал.

source: Starting with Linux 4.9, the accounting step is performed before doing the allocation, and the operation fails if the limit would be exceeded.
ru: Начиная с Linux 4.9, шаг учёта выполняется до выделения и операция завершается с ошибкой, если бы было превышение ограничения.

source: Before Linux 4.9, bugs similar to points (1) and (3) could also occur when the kernel allocated memory for a new pipe buffer; that is, when calling B<pipe>(2) and when opening a previously unopened FIFO.
ru: До Linux 4.9, дефекты подобные (1) и (3), также могли происходить, когда ядро выделяет память под буферы нового канала; то есть, когда вызывается B<pipe>(2) и когда открывается ранее не открытый FIFO.

source: packet - packet interface on device level
ru: packet - пакетный интерфейс на уровне устройства

source: B<#include E<lt>sys/socket.hE<gt>> B<#include E<lt>linux/if_packet.hE<gt>> B<#include E<lt>net/ethernet.hE<gt> /* the L2 protocols */>
ru: B<#include E<lt>sys/socket.hE<gt>> B<#include E<lt>linux/if_packet.hE<gt>> B<#include E<lt>net/ethernet.hE<gt> /* протоколы L2 */>

source: Packet sockets are used to receive or send raw packets at the device driver (OSI Layer 2) level. They allow the user to implement protocol modules in user space on top of the physical layer.
ru: Пакетные сокеты используются для приёма и передачи неструктурированных пакетов на уровне драйвера устройства (второй уровень OSI). Они позволяют пользователю реализовывать модули протоколов в пользовательском пространстве поверх физического уровня.

source: The I<socket_type> is either B<SOCK_RAW> for raw packets including the link-level header or B<SOCK_DGRAM> for cooked packets with the link-level header removed. The link-level header information is available in a common format in a I<sockaddr_ll> structure. I<protocol> is the IEEE 802.3 protocol number in network byte order. See the I<E<lt>linux/if_ether.hE<gt>> include file for a list of allowed protocols. When protocol is set to B<htons(ETH_P_ALL)>, then all protocols are received. All incoming packets of that protocol type will be passed to the packet socket before they are passed to the protocols implemented in the kernel.
ru: Значением I<socket_type> может быть B<SOCK_RAW> — для неструктурированных пакетов, содержащих заголовок уровня связи, или B<SOCK_DGRAM> — для подготовленных (cooked) пакетов без заголовка уровня связи. Информация заголовка уровня связи имеет общий формат и предоставляется структурой I<sockaddr_ll>. В I<protocol> содержится номер протокола согласно IEEE 802.3 в сетевом порядке байт. Список допустимых протоколов можно найти в заголовочном файле I<E<lt>linux/if_ether.hE<gt>>. Если значение протокола равно B<htons(ETH_P_ALL)>, то принимаются все протоколы. Все входящие пакеты с этим типом протокола будут переданы в пакетный сокет до их передачи протоколам, реализуемым в ядре.

source: In order to create a packet socket, a process must have the B<CAP_NET_RAW> capability in the user namespace that governs its network namespace.
ru: Для создания пакетного сокета процесс должен иметь мандат B<CAP_NET_RAW> в пользовательском пространстве имён, определяемом по его сетевому пространству имён.

source: B<SOCK_RAW> packets are passed to and from the device driver without any changes in the packet data. When receiving a packet, the address is still parsed and passed in a standard I<sockaddr_ll> address structure. When transmitting a packet, the user-supplied buffer should contain the physical-layer header. That packet is then queued unmodified to the network driver of the interface defined by the destination address. Some device drivers always add other headers. B<SOCK_RAW> is similar to but not compatible with the obsolete B<AF_INET/SOCK_PACKET> of Linux 2.0.
ru: Пакеты B<SOCK_RAW> передаются в и из драйвера устройства без каких-либо изменений в данных пакета. При получении пакета, адрес по-прежнему анализируется и передаётся в стандартной адресной структуре I<sockaddr_ll>. При отправке пакета, выделенный пользователем буфер должен содержать заголовок физического уровня. Этот пакет затем ставится без изменений в очередь сетевого драйвера интерфейса, определяемого адресом назначения. Некоторые драйверы устройств всегда добавляют другой заголовок. Пакеты B<SOCK_RAW> похожи, но не совместимы с устаревшими B<AF_INET/SOCK_PACKET> из Linux 2.0.

source: B<SOCK_DGRAM> operates on a slightly higher level. The physical header is removed before the packet is passed to the user. Packets sent through a B<SOCK_DGRAM> packet socket get a suitable physical-layer header based on the information in the I<sockaddr_ll> destination address before they are queued.
ru: При типе B<SOCK_DGRAM> обработка происходит на чуть более высоком уровне. Физический заголовок удаляется перед передачей пакета пользователю. Пакеты, посылаемые через пакетный сокет B<SOCK_DGRAM>, перед постановкой в очередь получают подходящий заголовок физического уровня на основе информации из адреса назначения в I<sockaddr_ll>.

source: By default, all packets of the specified protocol type are passed to a packet socket. To get packets only from a specific interface use B<bind>(2) specifying an address in a I<struct sockaddr_ll> to bind the packet socket to an interface. Fields used for binding are I<sll_family> (should be B<AF_PACKET>), I<sll_protocol>, and I<sll_ifindex>.
ru: По умолчанию, все пакеты заданного типа протокола передаются в пакетный сокет. Для получения пакетов только из определённого интерфейса используйте B<bind>(2), задав адрес в I<struct sockaddr_ll> для привязки пакетного сокета к интерфейсу. Поля, используемые для привязывания: I<sll_family> (должно быть равно B<AF_PACKET>), I<sll_protocol> и I<sll_ifindex>.

source: The B<connect>(2) operation is not supported on packet sockets.
ru: Операция B<connect>(2) не поддерживается для пакетных сокетов.

source: When the B<MSG_TRUNC> flag is passed to B<recvmsg>(2), B<recv>(2), or B<recvfrom>(2), the real length of the packet on the wire is always returned, even when it is longer than the buffer.
ru: Если в B<recvmsg>(2), B<recv>(2) или B<recvfrom>(2) передаётся флаг B<MSG_TRUNC>, то возвращается реальная длина пакета в канале, даже если значение длиннее буфера.

source: Address types
ru: Типы адресов

source: The I<sockaddr_ll> structure is a device-independent physical-layer address.
ru: Структура I<sockaddr_ll> описывает независимый от устройства адрес на физическом уровне.

source: struct sockaddr_ll { unsigned short sll_family; /* Always AF_PACKET */ unsigned short sll_protocol; /* Physical-layer protocol */ int sll_ifindex; /* Interface number */ unsigned short sll_hatype; /* ARP hardware type */ unsigned char sll_pkttype; /* Packet type */ unsigned char sll_halen; /* Length of address */ unsigned char sll_addr[8]; /* Physical-layer address */ };
ru: struct sockaddr_ll { unsigned short sll_family; /* всегда равно AF_PACKET */ unsigned short sll_protocol; /* протокол физического уровня */ int sll_ifindex; /* номер интерфейса */ unsigned short sll_hatype; /* тип аппаратного ARP */ unsigned char sll_pkttype; /* тип пакета */ unsigned char sll_halen; /* длина адреса */ unsigned char sll_addr[8]; /* адрес на физическом уровне */ };

source: The fields of this structure are as follows:
ru: Поля этой структуры имеют следующее назначение:

source: I<sll_protocol> is the standard ethernet protocol type in network byte order as defined in the I<E<lt>linux/if_ether.hE<gt>> include file. It defaults to the socket's protocol.
ru: Поле I<sll_protocol> содержит стандартные типы протокола ethernet в сетевом порядке байт; значения определены в заголовочном файле I<E<lt>linux/if_ether.hE<gt>>. Это значение по умолчанию для протокола сокета.

source: I<sll_ifindex> is the interface index of the interface (see B<netdevice>(7)); 0 matches any interface (only permitted for binding). I<sll_hatype> is an ARP type as defined in the I<E<lt>linux/if_arp.hE<gt>> include file.
ru: Поле I<sll_ifindex> содержит индекс интерфейса (смотрите B<netdevice>(7)); 0 означает любой интерфейс (допустимо только для привязывания). Поле I<sll_hatype> содержит тип ARP; значения хранятся в заголовочном файле I<E<lt>linux/if_arp.hE<gt>>.

source: I<sll_pkttype> contains the packet type. Valid types are B<PACKET_HOST> for a packet addressed to the local host, B<PACKET_BROADCAST> for a physical-layer broadcast packet, B<PACKET_MULTICAST> for a packet sent to a physical-layer multicast address, B<PACKET_OTHERHOST> for a packet to some other host that has been caught by a device driver in promiscuous mode, and B<PACKET_OUTGOING> for a packet originating from the local host that is looped back to a packet socket. These types make sense only for receiving.
ru: В поле I<sll_pkttype> содержится тип пакета. Допустимые типы: B<PACKET_HOST> — пакет предназначен локальному узлу, B<PACKET_BROADCAST> — широковещательный пакет физического уровня, B<PACKET_MULTICAST> — пакет, посланный на групповой (multicast) адрес физического уровня, B<PACKET_OTHERHOST> — пакет предназначен не тому узлу, где он пойман драйвером устройства в неразборчивом режиме, B<PACKET_OUTGOING> — пакет, поступивший от локального узла и завёрнутый обратно в пакетный сокет. Эти типы имеют смысл только для принятых пакетов.

source: I<sll_addr> and I<sll_halen> contain the physical-layer (e.g., IEEE 802.3) address and its length. The exact interpretation depends on the device.
ru: В полях I<sll_addr> и I<sll_halen> содержится адрес физического уровня (например, IEEE 802.3) и его длина. Конкретный смысл зависит от устройства.

source: When you send packets, it is enough to specify I<sll_family>, I<sll_addr>, I<sll_halen>, I<sll_ifindex>, and I<sll_protocol>. The other fields should be 0. I<sll_hatype> and I<sll_pkttype> are set on received packets for your information.
ru: Когда вы посылаете пакеты, достаточно указать I<sll_family>, I<sll_addr>, I<sll_halen>, I<sll_ifindex> и I<sll_protocol>. Остальные поля должны равняться 0. Поля I<sll_hatype> и I<sll_pkttype> заполняются в получаемых пакетах для вашей информированности.

source: Socket options
ru: Параметры сокета
