Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: On success, B<process_vm_readv>() returns the number of bytes read and B<process_vm_writev>() returns the number of bytes written. This return value may be less than the total number of requested bytes, if a partial read/write occurred. (Partial transfers apply at the granularity of I<iovec> elements. These system calls won't perform a partial transfer that splits a single I<iovec> element.) The caller should check the return value to determine whether a partial read/write occurred.
ru: При успешном выполнении B<process_vm_readv>() возвращает количество прочитанных байт, B<process_vm_writev>() возвращает количество записанных байт. Это значение может быть меньше полного числа запрашиваемых байт, если произошло частичное чтение/запись (частичная передача выполняется с точностью по I<iovec> элементам. Эти системные вызовы не выполняют частичной передачи, которая разделила бы один элемент I<iovec>). Вызывающий должен проверить возвращаемое значение, чтобы определить возникало ли частичное чтение/запись.

source: On error, -1 is returned and I<errno> is set appropriately.
ru: В случае ошибки возвращается -1 и значение I<errno> устанавливается соответствующим образом.

source: The memory described by I<local_iov> is outside the caller's accessible address space.
ru: Память, описываемая в I<local_iov>, находится вне пределов доступного адресного пространства вызывающего.

source: The memory described by I<remote_iov> is outside the accessible address space of the process I<pid>.
ru: Память, описываемая в I<remote_iov>, находится вне пределов доступного адресного пространства процесса I<pid>.

source: The sum of the I<iov_len> values of either I<local_iov> or I<remote_iov> overflows a I<ssize_t> value.
ru: Сумма значений I<iov_len> из I<local_iov> или I<remote_iov> превышает значение I<ssize_t>.

source: I<flags> is not 0.
ru: Значение I<flags> не равно 0.

source: I<liovcnt> or I<riovcnt> is too large.
ru: Значение I<liovcnt> или I<riovcnt> слишком велико.

source: Could not allocate memory for internal copies of the I<iovec> structures.
ru: Невозможно выделить память для внутренних копий структур I<iovec>.

source: The caller does not have permission to access the address space of the process I<pid>.
ru: Вызывающий не имеет прав на доступ к адресному пространству процесса I<pid>.

source: No process with ID I<pid> exists.
ru: Процесс с идентификатором I<pid> не существует.

source: These system calls were added in Linux 3.2. Support is provided in glibc since version 2.15.
ru: Данные системные вызовы были добавлены в Linux 3.2. Поддержка в glibc появилась в версии 2.15.

source: These system calls are nonstandard Linux extensions.
ru: Данные системные вызовы являются нестандартными расширениями Linux.

source: The data transfers performed by B<process_vm_readv>() and B<process_vm_writev>() are not guaranteed to be atomic in any way.
ru: При пересылке данных с помощью B<process_vm_readv>() и B<process_vm_writev>() не гарантируется атомарность.

source: These system calls were designed to permit fast message passing by allowing messages to be exchanged with a single copy operation (rather than the double copy that would be required when using, for example, shared memory or pipes).
ru: Эти системные вызовы были разработаны для быстрой передачи сообщений, чтобы позволить выполнить обмен за одну операцию копирования (а не двойного копирования, что требуется, например, при использовании общей памяти или каналов).

source: The following code sample demonstrates the use of B<process_vm_readv>(). It reads 20 bytes at the address 0x10000 from the process with PID 10 and writes the first 10 bytes into I<buf1> and the second 10 bytes into I<buf2>.
ru: В следующем примере показано использование B<process_vm_readv>(). Вызов читает 20 байт по адресу 0x10000 из процесса с PID 10 и записывает первые 10 байт в I<buf1>, а вторые 10 байт в I<buf2>.

source: int main(void) { struct iovec local[2]; struct iovec remote[1]; char buf1[10]; char buf2[10]; ssize_t nread; pid_t pid = 10; /* PID of remote process */
ru: int main(void) { struct iovec local[2]; struct iovec remote[1]; char buf1[10]; char buf2[10]; ssize_t nread; pid_t pid = 10; /* PID удалённого процесса */

source: poll, ppoll - wait for some event on a file descriptor
ru: poll, ppoll - ожидает некоторое событие над файловым дескриптором

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>signal.hE<gt>> B<#include E<lt>poll.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>signal.hE<gt>> B<#include E<lt>poll.hE<gt>>

source: B<poll>() performs a similar task to B<select>(2): it waits for one of a set of file descriptors to become ready to perform I/O.
ru: Вызов B<poll>() выполняет сходную с B<select>(2) задачу: он ждёт пока один дескриптор из набора файловых дескрипторов не станет готов выполнить операцию ввода-вывода.

source: The set of file descriptors to be monitored is specified in the I<fds> argument, which is an array of structures of the following form:
ru: Отслеживаемый набор файловых дескрипторов задаётся в аргументе I<fds>, который представляет собой массив структур:

source: struct pollfd { int fd; /* file descriptor */ short events; /* requested events */ short revents; /* returned events */ };
ru: struct pollfd { int fd; /* файловый дескриптор */ short events; /* запрашиваемые события */ short revents; /* возвращённые события */ };

source: The caller should specify the number of items in the I<fds> array in I<nfds>.
ru: Вызывающий должен указать количество элементов в массиве I<fds> в аргументе I<nfds>.

source: The field I<fd> contains a file descriptor for an open file. If this field is negative, then the corresponding I<events> field is ignored and the I<revents> field returns zero. (This provides an easy way of ignoring a file descriptor for a single B<poll>() call: simply negate the I<fd> field. Note, however, that this technique can't be used to ignore file descriptor 0.)
ru: В поле I<fd> содержится файловый дескриптор открытого файла. Если значение поля отрицательно, то соответствующее поле I<events> игнорируется, а полю I<revents> возвращает ноль (простой способ игнорирования файлового дескриптора в одиночном вызове B<poll>(): просто сделать значение поля I<fd> отрицательным. Заметим, что это нельзя использовать для игнорирования файлового дескриптора 0).

source: The field I<events> is an input parameter, a bit mask specifying the events the application is interested in for the file descriptor I<fd>. This field may be specified as zero, in which case the only events that can be returned in I<revents> are B<POLLHUP>, B<POLLERR>, and B<POLLNVAL> (see below).
ru: Поле I<events> представляет собой входной параметр — битовую маску, указывающую на события, происходящие с файловым дескриптором I<fd>, которые важны для приложения. Если это поле равно нулю, то возвращаемыми событиями в I<revents> могут быть B<POLLHUP>, B<POLLERR> и B<POLLNVAL> (смотрите ниже).

source: The field I<revents> is an output parameter, filled by the kernel with the events that actually occurred. The bits returned in I<revents> can include any of those specified in I<events>, or one of the values B<POLLERR>, B<POLLHUP>, or B<POLLNVAL>. (These three bits are meaningless in the I<events> field, and will be set in the I<revents> field whenever the corresponding condition is true.)
ru: Поле I<revents> представляет собой параметр-результат, в который ядро помещает информацию о произошедших событиях. В I<revents> могут содержаться любые битовые флаги из задаваемых в I<events>, или там может быть одно из значений: B<POLLERR>, B<POLLHUP> или B<POLLNVAL>. Эти три битовых флага не имеют смысла в поле I<events>, но будут установлены в поле I<revents>, если соответствующее условие истинно.

source: If none of the events requested (and no error) has occurred for any of the file descriptors, then B<poll>() blocks until one of the events occurs.
ru: Если ни одно из запрошенных событий с файловыми дескрипторами не произошло или не возникло ошибок, то B<poll>() блокируется до их появления.

source: The I<timeout> argument specifies the number of milliseconds that B<poll>() should block waiting for a file descriptor to become ready. The call will block until either:
ru: В аргументе I<timeout> указывается количество миллисекунд, на которые будет блокироваться B<poll>() в ожидании готовности файлового дескриптора. Вызов будет заблокирован пока:

source: a file descriptor becomes ready;
ru: файловый дескриптор не станет готов;

source: the call is interrupted by a signal handler; or
ru: вызов не прервётся обработчиком сигнала;

source: the timeout expires.
ru: не истечёт время ожидания.

source: Note that the I<timeout> interval will be rounded up to the system clock granularity, and kernel scheduling delays mean that the blocking interval may overrun by a small amount. Specifying a negative value in I<timeout> means an infinite timeout. Specifying a I<timeout> of zero causes B<poll>() to return immediately, even if no file descriptors are ready.
ru: Заметим, что интервал I<timeout> будет округлён с точностью системных часов, а из-за задержки при планировании в ядре блокирующий интервал будет немного больше. Отрицательное значение в I<timeout> означает бесконечное ожидание. Значение I<timeout>, равное нулю, приводит к немедленному завершению B<poll>(), даже если ни один файловый дескриптор не готов.

source: The bits that may be set/returned in I<events> and I<revents> are defined in I<E<lt>poll.hE<gt>>:
ru: Вот возможные биты, описанные в I<E<lt>poll.hE<gt>>, которые могут быть установлены/получены в I<events> и I<revents>:

source: There is data to read.
ru: Есть данные для чтения.

source: There is some exceptional condition on the file descriptor. Possibilities include:
ru: Исключительное состояние файлового дескриптора. Может быть из-за:

source: There is out-of-band data on a TCP socket (see B<tcp>(7)).
ru: Внеполосные данные в сокете TCP (смотрите B<tcp>(7)).

source: A pseudoterminal master in packet mode has seen a state change on the slave (see B<ioctl_tty>(2)).
ru: Мастер псевдо-терминала в пакетном режиме увидел изменение состояния подчинённого терминала (смотрите B<ioctl_tty>(2)).

source: A I<cgroup.events> file has been modified (see B<cgroups>(7)).
ru: Изменился файл I<cgroup.events> (смотрите B<cgroups>(7)).

source: Writing is now possible, though a write larger that the available space in a socket or pipe will still block (unless B<O_NONBLOCK> is set).
ru: Теперь запись возможна, но запись данных больше, чем доступно места в сокете или канале, по-прежнему приводит к блокировке (если не указан B<O_NONBLOCK>).

source: B<POLLRDHUP> (since Linux 2.6.17)
ru: B<POLLRDHUP> (начиная с Linux 2.6.17)

source: Stream socket peer closed connection, or shut down writing half of connection. The B<_GNU_SOURCE> feature test macro must be defined (before including I<any> header files) in order to obtain this definition.
ru: Удалённая сторона потокового сокета закрыла соединение, или отключила запись в одну сторону. Для использования данного определения должен быть определён макрос тестирования свойств B<_GNU_SOURCE> (до включения I<каких-либо> заголовочных файлов).

source: Error condition (only returned in I<revents>; ignored in I<events>). This bit is also set for a file descriptor referring to the write end of a pipe when the read end has been closed.
ru: Состояние ошибки (возвращается только в I<revents>; игнорируется в I<events>). Также этот бит устанавливается для файлового дескриптора, указывающего в пишущий конец канала при закрытом читающем конце.

source: Hang up (only returned in I<revents>; ignored in I<events>). Note that when reading from a channel such as a pipe or a stream socket, this event merely indicates that the peer closed its end of the channel. Subsequent reads from the channel will return 0 (end of file) only after all outstanding data in the channel has been consumed.
ru: Зависание (hang up, возвращается только в I<revents>; игнорируется в I<events>). Заметим, что при чтении из канала, такого как канал (pipe) или потоковый сокет, это событие всего-навсего показывает, что партнёр закрыл канал со своего конца. Дальнейшее чтение из канала будет возвращать 0 (конец файла) только после потребления всех неполученных данных в канале.

source: Invalid request: I<fd> not open (only returned in I<revents>; ignored in I<events>).
ru: Неверный запрос: I<fd> не открыт (возвращается только в I<revents>; игнорируется в I<events>).

source: When compiling with B<_XOPEN_SOURCE> defined, one also has the following, which convey no further information beyond the bits listed above:
ru: При компилировании с установленным B<_XOPEN_SOURCE> также определены следующие значения, которые не передают дополнительной информации вне упомянутых выше битов:

source: Equivalent to B<POLLIN>.
ru: Эквивалентно B<POLLIN>.

source: Priority band data can be read (generally unused on Linux).
ru: Доступны для чтения приоритетные внутриполосные данные (в Linux, обычно, не используется).

source: Equivalent to B<POLLOUT>.
ru: Эквивалентно B<POLLOUT>.

source: Priority data may be written.
ru: Можно писать приоритетные данные.

source: Linux also knows about, but does not use B<POLLMSG>.
ru: В Linux также есть B<POLLMSG>, но он не используется.

source: The relationship between B<poll>() and B<ppoll>() is analogous to the relationship between B<select>(2) and B<pselect>(2): like B<pselect>(2), B<ppoll>() allows an application to safely wait until either a file descriptor becomes ready or until a signal is caught.
ru: Отношения между B<poll>() и B<ppoll>() аналогичны родству B<select>(2) и B<pselect>(2): как B<pselect>(2), B<ppoll>() позволяет приложению безопасно ждать, пока файловый дескриптор не станет готов или пока не будет получен сигнал.

source: Other than the difference in the precision of the I<timeout> argument, the following B<ppoll>() call:
ru: Кроме различия в точности аргумента I<timeout> вызов B<ppoll>()

source: is nearly equivalent to I<atomically> executing the following calls:
ru: почти эквивалентен I<атомарному> выполнению следующих вызовов:

source: The above code segment is described as I<nearly> equivalent because whereas a negative I<timeout> value for B<poll>() is interpreted as an infinite timeout, a negative value expressed in I<*tmo_p> results in an error from B<ppoll>().
ru: Приведённый выше сегмент кода показывает I<ближайший> эквивалент, так как отрицательное значение I<timeout> в B<poll>() рассматривается как бесконечное ожидание, а отрицательное значение в I<*tmo_p> привело бы к ошибке B<ppoll>().

source: See the description of B<pselect>(2) for an explanation of why B<ppoll>() is necessary.
ru: Смотрите в B<pselect>(2) пояснения о необходимости B<ppoll>().

source: If the I<sigmask> argument is specified as NULL, then no signal mask manipulation is performed (and thus B<ppoll>() differs from B<poll>() only in the precision of the I<timeout> argument).
ru: Если значение аргумента I<sigmask> равно NULL, то изменение маски сигналов не происходит (и поэтому B<ppoll>() отличается от B<poll>() только в точности аргумента I<timeout>).

source: The I<tmo_p> argument specifies an upper limit on the amount of time that B<ppoll>() will block. This argument is a pointer to a structure of the following form:
ru: В аргументе I<tmo_p> указывается верхняя граница промежутка времени, на который будет заблокирован B<ppoll>(). Этот аргумент представляет собой указатель на структуру следующего вида:

source: struct timespec { long tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
ru: struct timespec { long tv_sec; /* секунды */ long tv_nsec; /* наносекунды */ };

source: If I<tmo_p> is specified as NULL, then B<ppoll>() can block indefinitely.
ru: Если значение I<tmo_p> равно NULL, то B<ppoll>() может оставаться заблокированным бесконечно.

source: On success, a positive number is returned; this is the number of structures which have nonzero I<revents> fields (in other words, those descriptors with events or errors reported). A value of 0 indicates that the call timed out and no file descriptors were ready. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается положительное значение; оно означает количество структур, в которых поля I<revents> имеют ненулевое значение (другими словами, тех дескрипторов, для которых возникли события или ошибки). Значение 0 означает, что время ожидания истекло, и нет готовых файловых дескрипторов. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The array given as argument was not contained in the calling program's address space.
ru: Указанный аргументом массив содержится вне адресного пространства вызывающей программы.

source: A signal occurred before any requested event; see B<signal>(7).
ru: Получен сигнал раньше какого-либо запрашиваемого события; смотрите B<signal>(7).

source: The I<nfds> value exceeds the B<RLIMIT_NOFILE> value.
ru: Значение I<nfds> превышает значение B<RLIMIT_NOFILE>.

source: (B<ppoll>()) The timeout value expressed in I<*ip> is invalid (negative).
ru: (B<ppoll>()) Время ожидания в I<*ip> некорректно (отрицательное).

source: There was no space to allocate file descriptor tables.
ru: Нет места под таблицы файловых дескрипторов.

source: The B<poll>() system call was introduced in Linux 2.1.23. On older kernels that lack this system call, the glibc (and the old Linux libc) B<poll>() wrapper function provides emulation using B<select>(2).
ru: Системный вызов B<poll>() появился в Linux 2.1.23. Для старых ядер, в которых этот вызов отсутствует, glibc (и старая Linux libc) предоставляет обёрточную функцию B<poll>(), которая эмулируется с помощью B<select>(2).

source: The B<ppoll>() system call was added to Linux in kernel 2.6.16. The B<ppoll>() library call was added in glibc 2.4.
ru: Системный вызов B<ppoll>() был добавлен в ядро Linux в версии 2.6.16. Библиотечный вызов B<ppoll>() был добавлен в glibc 2.4.

source: B<poll>() conforms to POSIX.1-2001 and POSIX.1-2008. B<ppoll>() is Linux-specific.
ru: Вызов B<poll>() соответствует POSIX.1-2001 и POSIX.1-2008. Вызов B<ppoll>() есть только в Linux.

source: The operation of B<poll>() and B<ppoll>() is not affected by the B<O_NONBLOCK> flag.
ru: На операции B<poll>() и B<ppoll>() флаг B<O_NONBLOCK> не влияет.

source: On some other UNIX systems, B<poll>() can fail with the error B<EAGAIN> if the system fails to allocate kernel-internal resources, rather than B<ENOMEM> as Linux does. POSIX permits this behavior. Portable programs may wish to check for B<EAGAIN> and loop, just as with B<EINTR>.
ru: В некоторых системах UNIX вызов B<poll>() может завершаться с ошибкой B<EAGAIN>, если системе не удаётся выделить внутренние ресурсы ядра, вместо ошибки B<ENOMEM> как это происходит в Linux. В POSIX допускается такое поведение. Переносимые программы должны ожидать B<EAGAIN> в цикле, как для B<EINTR>.

source: Some implementations define the nonstandard constant B<INFTIM> with the value -1 for use as a I<timeout> for B<poll>(). This constant is not provided in glibc.
ru: В некоторых реализациях определена нестандартная константа B<INFTIM> со значением -1 для использования в качестве значения I<timeout> в B<poll>(). Эта константа отсутствует в glibc.

source: For a discussion of what may happen if a file descriptor being monitored by B<poll>() is closed in another thread, see B<select>(2).
ru: Обсуждение того, что может случиться, если файловый дескриптор отслеживается B<poll>() и при этом закрывается в другой нити, смотрите в B<select>(2).

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: The Linux B<ppoll>() system call modifies its I<tmo_p> argument. However, the glibc wrapper function hides this behavior by using a local variable for the timeout argument that is passed to the system call. Thus, the glibc B<ppoll>() function does not modify its I<tmo_p> argument.
ru: В Linux системный вызов B<ppoll>() изменяет свой аргумент I<tmo_p>. Однако, обёрточная функция glibc скрывает это поведение с помощью локальной переменной для аргумента timeout, которая передаётся в системный вызов. Поэтому glibc функция B<ppoll>() не изменяет свой аргумент I<tmo_p>.

source: The raw B<ppoll>() system call has a fifth argument, I<size_t sigsetsize>, which specifies the size in bytes of the I<sigmask> argument. The glibc B<ppoll>() wrapper function specifies this argument as a fixed value (equal to I<sizeof(kernel_sigset_t)>). See B<sigprocmask>(2) for a discussion on the differences between the kernel and the libc notion of the sigset.
ru: Ядерный системный вызов B<ppoll>() имеет пятый аргумент, I<size_t sigsetsize>, в котором указывается размер аргумента I<sigmask> в байтах. В обёрточной функции glibc B<ppoll>() в этом аргументе передаётся постоянная величина (равная I<sizeof(kernel_sigset_t)>). Описание различий sigset между ядерным и библиотечным вызовом смотрите в B<sigprocmask>(2).

source: See the discussion of spurious readiness notifications under the BUGS section of B<select>(2).
ru: Смотрите описание ложных уведомлений о готовности в разделе ДЕФЕКТЫ справочной страницы B<select>(2).

source: pkey_alloc, pkey_free - allocate or free a protection key
ru: pkey_alloc, pkey_free - выделяет или освобождает ключ защиты

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>

source: B<pkey_alloc>() allocates a protection key (pkey) and allows it to be passed to B<pkey_mprotect>(2).
ru: Вызов B<pkey_alloc>() выделяет ключ защиты (pkey), который можно передавать в B<pkey_mprotect>(2).

source: The B<pkey_alloc>() I<flags> is reserved for future use and currently must always be specified as 0.
ru: Аргумент I<flags> вызова B<pkey_alloc>() зарезервирован для использования в будущем и в настоящее время должен равняться 0.

source: The B<pkey_alloc>() I<access_rights> argument may contain zero or more disable operations:
ru: Аргумент I<access_rights> вызова B<pkey_alloc>() может содержать ноль или более запретительных операций:

source: Disable all data access to memory covered by the returned protection key.
ru: Запретить доступ ко всем данным памяти, на которую наложен возвращаемый ключ.

source: Disable write access to memory covered by the returned protection key.
ru: Запретить доступ на запись в память, на которую наложен возвращаемый ключ.

source: B<pkey_free>() frees a protection key and makes it available for later allocations. After a protection key has been freed, it may no longer be used in any protection-key-related operations.
ru: Вызов B<pkey_free>() освобождает ключ защиты и делает его доступным для будущего выделения. После освобождения ключа защиты он может больше не использоваться в операциях по защите ключом.

source: An application should not call B<pkey_free>() on any protection key which has been assigned to an address range by B<pkey_mprotect>(2) and which is still in use. The behavior in this case is undefined and may result in an error.
ru: Приложение не должно вызывать B<pkey_free>() с ключом защиты, который был назначен адресному диапазону с помощью B<pkey_mprotect>(2) и который пока используется. Это вызывает непредсказуемое поведение и может привести к ошибке.

source: On success, B<pkey_alloc>() returns a positive protection key value. On success, B<pkey_free>() returns zero. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<pkey_alloc>() возвращается положительное значение ключа защиты. При успешном выполнении B<pkey_free>() возвращается ноль. При ошибке возвращается -1 и I<errno> присваивается соответствующее значение.
