Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: This file specifies the value at which PIDs wrap around (i.e., the value in this file is one greater than the maximum PID). PIDs greater than this value are not allocated; thus, the value in this file also acts as a system-wide limit on the total number of processes and threads. The default value for this file, 32768, results in the same range of PIDs as on earlier kernels. On 32-bit platforms, 32768 is the maximum value for I<pid_max>. On 64-bit systems, I<pid_max> can be set to any value up to 2^22 (B<PID_MAX_LIMIT>, approximately 4 million).
ru: Этот файл задаёт значение, после которого идентификаторы процессов (PID)начинают использоваться с начала (т. е., значение в этом файле на единицу больше,чем максимальный PID). Значения PID больше этого значения не выделяются; то есть значение в этом файле также служит системным ограничением общего количества процессов и нитей. По умолчанию, значение в этом файле составляет 32768, т. е. означает тот же самый диапазон PID-ов, что и в ранних ядрах. На 32-битных платформах максимальное значение I<pid_max> равно 32768. На 64-битных платформах I<pid_max> может принимать любое значение до 2^22 (B<PID_MAX_LIMIT>, приблизительно 4 миллиона).

source: I</proc/sys/kernel/powersave-nap> (PowerPC only)
ru: I</proc/sys/kernel/powersave-nap> (только на PowerPC)

source: This file contains a flag. If set, Linux-PPC will use the "nap" mode of powersaving, otherwise the "doze" mode will be used.
ru: Этот файл содержит флаг. Если он установлен Linux-PPC будет использовать режим "nap" для энергосбережения, в противном случае будет использоваться режим "doze".

source: See B<syslog>(2).
ru: Смотрите B<syslog>(2).

source: I</proc/sys/kernel/pty> (since Linux 2.6.4)
ru: I</proc/sys/kernel/pty> (начиная с Linux 2.6.4)

source: This directory contains two files relating to the number of UNIX 98 pseudoterminals (see B<pts>(4)) on the system.
ru: В этом каталоге содержится два файла, отражающих количество псевдо-терминалов UNIX 98 (см. B<pts>(4)) в системе.

source: This file defines the maximum number of pseudoterminals.
ru: Этот файл определяет максимальное количество псевдо-терминалов.

source: This read-only file indicates how many pseudoterminals are currently in use.
ru: Файл доступен только для чтения, показывает количество используемых в данный момент псевдо-терминалов.

source: This directory contains various parameters controlling the operation of the file I</dev/random>. See B<random>(4) for further information.
ru: Этот каталог содержит различные параметры, управляющие работой файла I</dev/random>. Дополнительную информацию смотрите в B<random>(4).

source: I</proc/sys/kernel/random/uuid> (since Linux 2.4)
ru: I</proc/sys/kernel/random/uuid> (начиная с Linux 2.4)

source: Each read from this read-only file returns a randomly generated 128-bit UUID, as a string in the standard UUID format.
ru: При каждом чтении из этого, доступного только для чтения файла, возвращается генерируемый случайным образом 128-битный UUID в виде строки в стандартном формате UUID.

source: I</proc/sys/kernel/randomize_va_space> (since Linux 2.6.12)
ru: I</proc/sys/kernel/randomize_va_space> (начиная с Linux 2.6.12)

source: Select the address space layout randomization (ASLR) policy for the system (on architectures that support ASLR). Three values are supported for this file:
ru: Выбирает политику случайного выбора адресного пространства (ASLR) в системе (на архитектурах с поддержкой ASLR). Возможны три значения:

source: Turn ASLR off. This is the default for architectures that don't support ASLR, and when the kernel is booted with the I<norandmaps> parameter.
ru: Отключить ASLR. Значение по умолчанию на архитектурах без поддержки ASLR, и если ядро загружено с параметром I<norandmaps>.

source: Make the addresses of B<mmap>(2) allocations, the stack, and the VDSO page randomized. Among other things, this means that shared libraries will be loaded at randomized addresses. The text segment of PIE-linked binaries will also be loaded at a randomized address. This value is the default if the kernel was configured with B<CONFIG_COMPAT_BRK>.
ru: Выполнять выделение адресов B<mmap>(2), стека и страниц VDSO случайным образом. Помимо прочего, это означает, что общие библиотеки будут загружаться по случайным адресам. Текстовый сегмент PIE-скомпонованных библиотек будет также загружен по случайному адресу. Является значением по умолчанию, если ядро собрано с параметром B<CONFIG_COMPAT_BRK>.

source: (Since Linux 2.6.25) Also support heap randomization. This value is the default if the kernel was not configured with B<CONFIG_COMPAT_BRK>.
ru: (начиная с Linux 2.6.25) Также выполнять выделение кучи случайным образом. Является значением по умолчанию, если ядро не собрано с параметром B<CONFIG_COMPAT_BRK>.

source: This file is documented in the Linux kernel source file I<Documentation/admin-guide/initrd.rst> (or I<Documentation/initrd.txt> before Linux 4.10).
ru: Этот файл описывается в файле исходного кода ядра Linux I<Documentation/admin-guide/initrd.rst> (или I<Documentation/initrd.txt> до Linux 4.10).

source: I</proc/sys/kernel/reboot-cmd> (Sparc only)
ru: I</proc/sys/kernel/reboot-cmd> (только на Sparc)

source: This file seems to be a way to give an argument to the SPARC ROM/Flash boot loader. Maybe to tell it what to do after rebooting?
ru: Этот файл, вероятно, является способом задания аргументов для начального загрузчика SPARC ROM/Flash. Способ сказать ему, что делать после перезагрузки?

source: (Only in kernels up to and including 2.6.7; see B<setrlimit>(2)) This file can be used to tune the maximum number of POSIX real-time (queued) signals that can be outstanding in the system.
ru: (Только в ядре 2.6.7 и более ранних; см. B<setrlimit>(2)) Этот файл может быть использован для настройки максимального количества сигналов реального времени POSIX (в очереди), которое может воспринять система.

source: (Only in kernels up to and including 2.6.7.) This file shows the number of POSIX real-time signals currently queued.
ru: (Только в ядре 2.6.7 и более ранних) Этот файл показывает количество сигналов реального времени POSIX, которые в настоящий момент находятся в очереди.

source: I</proc/[pid]/sched_autogroup_enabled> (since Linux 2.6.38)
ru: I</proc/[pid]/sched_autogroup_enabled> (начиная с Linux 2.6.38)

source: I</proc/sys/kernel/sched_child_runs_first> (since Linux 2.6.23)
ru: I</proc/sys/kernel/sched_child_runs_first> (начиная с Linux 2.6.23)

source: If this file contains the value zero, then, after a B<fork>(2), the parent is first scheduled on the CPU. If the file contains a nonzero value, then the child is scheduled first on the CPU. (Of course, on a multiprocessor system, the parent and the child might both immediately be scheduled on a CPU.)
ru: Если этот файл содержит нулевое значение, то после B<fork>(2) первым на ЦП планируется выполнение родителя. Если файл содержит ненулевое значение, то первым на ЦП планируется выполнение потомка (естественно, на многопроцессорной системе может быть запланировано немедленное одновременное выполнение и родителя и потомка).

source: I</proc/sys/kernel/sched_rr_timeslice_ms> (since Linux 3.9)
ru: I</proc/sys/kernel/sched_rr_timeslice_ms> (начиная с Linux 3.9)

source: See B<sched_rr_get_interval>(2).
ru: Смотрите B<sched_rr_get_interval>(2).

source: I</proc/sys/kernel/sched_rt_period_us> (since Linux 2.6.25)
ru: I</proc/sys/kernel/sched_rt_period_us> (начиная с Linux 2.6.25)

source: I</proc/sys/kernel/sched_rt_runtime_us> (since Linux 2.6.25)
ru: I</proc/sys/kernel/sched_rt_runtime_us> (начиная с Linux 2.6.25)

source: I</proc/sys/kernel/seccomp> (since Linux 4.14)
ru: I</proc/sys/kernel/seccomp> (начиная с Linux 4.14)

source: This directory provides additional seccomp information and configuration. See B<seccomp>(2) for further details.
ru: Этот каталог содержит дополнительную информацию и настройки seccomp. Подробней смотрите в B<seccomp>(2).

source: I</proc/sys/kernel/sem> (since Linux 2.4)
ru: I</proc/sys/kernel/sem> (начиная с Linux 2.4)

source: This file contains 4 numbers defining limits for System V IPC semaphores. These fields are, in order:
ru: Этот файл содержит 4 значения, описывающих ограничения семафоров System V IPC. Вот эти значения по порядку:

source: The maximum semaphores per semaphore set.
ru: Максимальное количество семафоров в одном списке семафоров.

source: A system-wide limit on the number of semaphores in all semaphore sets.
ru: Системный лимит на количество семафоров во всех списках семафоров.

source: The maximum number of operations that may be specified in a B<semop>(2) call.
ru: Максимальное количество операций, которое может быть указано в вызове B<semop>(2).

source: A system-wide limit on the maximum number of semaphore identifiers.
ru: Системный лимит на максимальное количество идентификаторов семафоров.

source: This file shows the size of the generic SCSI device (sg) buffer. You can't tune it just yet, but you could change it at compile time by editing I<include/scsi/sg.h> and changing the value of B<SG_BIG_BUFF>. However, there shouldn't be any reason to change this value.
ru: Этот файл показывает размер буфера стандартного SCSI устройства (sg). Вы не можете пока настраивать его, но его можно изменить при компиляции ядра, исправив I<include/scsi/sg.h>, изменив в нём значение B<SG_BIG_BUFF>. Однако, в этом, как правило, нет необходимости.

source: I</proc/sys/kernel/shm_rmid_forced> (since Linux 3.1)
ru: I</proc/sys/kernel/shm_rmid_forced> (начиная с Linux 3.1)

source: If this file is set to 1, all System V shared memory segments will be marked for destruction as soon as the number of attached processes falls to zero; in other words, it is no longer possible to create shared memory segments that exist independently of any attached process.
ru: Если значение в файле равно 1, то все общие сегменты памяти System V будут помечены на уничтожение сразу после сокращения присоединённых процессов до нуля; другими словами становится невозможно создать сегмент общей памяти, существующий независимо от присоединённого процесса.

source: The effect is as though a B<shmctl>(2) B<IPC_RMID> is performed on all existing segments as well as all segments created in the future (until this file is reset to 0). Note that existing segments that are attached to no process will be immediately destroyed when this file is set to 1. Setting this option will also destroy segments that were created, but never attached, upon termination of the process that created the segment with B<shmget>(2).
ru: Это подобно тому, как если бы выполнили B<shmctl>(2) B<IPC_RMID> для всех существующих сегментов, а также выполняли бы для всех сегментов, создаваемых в будущем (пока значение в файле не будет сброшено в 0). Заметим, что при задании в файле значения 1 существующие сегменты, не присоединённые к процессу, будут немедленно уничтожены. Установка этого значения также будет уничтожать сегменты, которые были созданы, но не присоединены — при завершении процесса, который создал эти сегменты с помощью B<shmget>(2).

source: Setting this file to 1 provides a way of ensuring that all System V shared memory segments are counted against the resource usage and resource limits (see the description of B<RLIMIT_AS> in B<getrlimit>(2)) of at least one process.
ru: Установка значения в 1 позволяет быть уверенным, что все общие сегменты памяти System V подсчитаны и следуют заданным ограничениям ресурсов, как минимум, в одном процессе (смотрите описание B<RLIMIT_AS> в B<getrlimit>(2)).

source: Because setting this file to 1 produces behavior that is nonstandard and could also break existing applications, the default value in this file is 0. Set this file to 1 only if you have a good understanding of the semantics of the applications using System V shared memory on your system.
ru: Так как установка в этом файле значения 1 вызывает нестандартное поведение и может привести к неработоспособности приложений, значение по умолчанию равно 0. Указывайте значение 1 только, если хорошо понимаете работу приложений, использующих общую память System V.

source: I</proc/sys/kernel/shmall> (since Linux 2.2)
ru: I</proc/sys/kernel/shmall> (начиная с Linux 2.2)

source: This file contains the system-wide limit on the total number of pages of System V shared memory.
ru: Этот файл содержит системный лимит на общее количество страниц общей памяти по стандарту System\ V.

source: I</proc/sys/kernel/shmmax> (since Linux 2.2)
ru: I</proc/sys/kernel/shmmax> (начиная с Linux 2.2)

source: This file can be used to query and set the run-time limit on the maximum (System V IPC) shared memory segment size that can be created. Shared memory segments up to 1GB are now supported in the kernel. This value defaults to B<SHMMAX>.
ru: Этот файл может быть использован для опроса и установки ограничения максимального размера сегмента общей памяти по стандарту System\ V во время выполнения. В настоящий момент ядро поддерживает сегменты общей памяти до 1ГБ. Значение по умолчанию равно B<SHMMAX>.

source: I</proc/sys/kernel/shmmni> (since Linux 2.4)
ru: I</proc/sys/kernel/shmmni> (начиная с Linux 2.4)

source: This file specifies the system-wide maximum number of System V shared memory segments that can be created.
ru: Задаёт максимальное системное ограничение на количество создаваемых общих сегментов памяти по стандарту System V.

source: I</proc/sys/kernel/sysctl_writes_strict> (since Linux 3.16)
ru: I</proc/sys/kernel/sysctl_writes_strict> (начиная с Linux 3.16)

source: The value in this file determines how the file offset affects the behavior of updating entries in files under I</proc/sys>. The file has three possible values:
ru: Значением в этом файле определяется как учитывать файловое смещение при обновлении записей в файле I</proc/sys>. Есть три возможных значения:

source: This provides legacy handling, with no printk warnings. Each B<write>(2) must fully contain the value to be written, and multiple writes on the same file descriptor will overwrite the entire value, regardless of the file position.
ru: Старый вариант работы, без предупреждения printk. Каждый B<write>(2) должен записывать значение целиком, а повторная запись в тот же файловый дескриптор переписывает значение целиком, независимо от смещения в файле.

source: (default) This provides the same behavior as for -1, but printk warnings are written for processes that perform writes when the file offset is not 0.
ru: (по умолчанию) Такая же работа, как при -1, но выдаёт предупреждение printk для процессов, которые выполняют запись, если файловое смещение не равно 0.

source: Respect the file offset when writing strings into I</proc/sys> files. Multiple writes will I<append> to the value buffer. Anything written beyond the maximum length of the value buffer will be ignored. Writes to numeric I</proc/sys> entries must always be at file offset 0 and the value must be fully contained in the buffer provided to B<write>(2).
ru: Учитывать файловое смещение при записи строк в файлы I</proc/sys>. Повторная запись I<добавляет> значение в буфер. Всё записанное, но превышающее длину буфера будет игнорироваться. Запись чисел в I</proc/sys> всегда должна выполняться по файловому смещению 0 и значение должно полностью помещаться в буфер, предоставленный B<write>(2).

source: This file controls the functions allowed to be invoked by the SysRq key. By default, the file contains 1 meaning that every possible SysRq request is allowed (in older kernel versions, SysRq was disabled by default, and you were required to specifically enable it at run-time, but this is not the case any more). Possible values in this file are:
ru: Этот файл контролирует функции, которые можно вызывать по клавише SysRq. По умолчанию в нём содержится 1, которая означает, что разрешены любые возможные запросы SysRq (в старых ядрах SysRq по умолчанию выключена, и её требовалось явно включать при работе, но теперь этого больше не требуется.). Возможные значения:

source: Disable sysrq completely
ru: Полностью выключить sysrq

source: Enable all functions of sysrq
ru: Включить все функции sysrq

source: Bit mask of allowed sysrq functions, as follows:
ru: Битовая маска разрешённых функций sysrq:

source: Enable control of console logging level
ru: Включить управление уровнем протоколирования консоли

source: Enable control of keyboard (SAK, unraw)
ru: Включить управление клавиатурой (SAK, unraw)

source: Enable debugging dumps of processes etc.
ru: Включить отладочные дампы процессов.

source: Enable sync command
ru: Включить команду sync

source: Enable remount read-only
ru: Включить перемонтирование в режим только для чтения

source: Enable signaling of processes (term, kill, oom-kill)
ru: Включить передачу сигналов процессам (term, kill, oom-kill)

source: Allow reboot/poweroff
ru: Включить выполнение перезагрузки/выключения питания

source: Allow nicing of all real-time tasks
ru: Разрешить изменять уступчивость всех задач реального времени

source: This file is present only if the B<CONFIG_MAGIC_SYSRQ> kernel configuration option is enabled. For further details see the Linux kernel source file I<Documentation/admin-guide/sysrq.rst> (or I<Documentation/sysrq.txt> before Linux 4.10).
ru: Этот файл существует только, если включён параметр сборки ядра B<CONFIG_MAGIC_SYSRQ>. Дополнительную информацию можно найти в исходном коде ядра Linux в файле I<Documentation/admin-guide/sysrq.rst> (или I<Documentation/sysrq.txt> до Linux 4.10).

source: This file contains a string such as:
ru: Этот файл содержит строку, такую как:

source: The "#5" means that this is the fifth kernel built from this source base and the date following it indicates the time the kernel was built.
ru: Часть «#5» означает, что это пятая сборка ядра от исходной базы, а далее указана дата и время сборки ядра.

source: I</proc/sys/kernel/threads-max> (since Linux 2.3.11)
ru: I</proc/sys/kernel/threads-max> (начиная с Linux 2.3.11)

source: This file specifies the system-wide limit on the number of threads (tasks) that can be created on the system.
ru: Этот файл определяет системный лимит на количество нитей (задач), которое может быть создано в системе.

source: Since Linux 4.1, the value that can be written to I<threads-max> is bounded. The minimum value that can be written is 20. The maximum value that can be written is given by the constant B<FUTEX_TID_MASK> (0x3fffffff). If a value outside of this range is written to I<threads-max>, the error B<EINVAL> occurs.
ru: Начиная с Linux 4.1, значение, которое можно записать в I<threads-max> ограничено. Минимальное значение равно 20. Максимальное значение определяется константой B<FUTEX_TID_MASK> (0x3fffffff). Если в I<threads-max> записывается значение вне этого диапазона, то возвращается ошибка B<EINVAL>.

source: The value written is checked against the available RAM pages. If the thread structures would occupy too much (more than 1/8th) of the available RAM pages, I<threads-max> is reduced accordingly.
ru: По записываемому значению проверяется доступные страницы RAM. Если структуры нити заняли бы слишком много (более 1/8й) доступных страниц RAM, то I<threads-max> сокращается соответствующим образом.

source: I</proc/sys/kernel/yama/ptrace_scope> (since Linux 3.5)
ru: I</proc/sys/kernel/yama/ptrace_scope> (начиная с Linux 3.5)

source: See B<ptrace>(2).
ru: Смотрите B<ptrace>(2).

source: I</proc/sys/kernel/zero-paged> (PowerPC only)
ru: I</proc/sys/kernel/zero-paged> (только на PowerPC)

source: This file contains a flag. When enabled (nonzero), Linux-PPC will pre-zero pages in the idle loop, possibly speeding up get_free_pages.
ru: Этот файл содержит флаг. Когда он установлен (не ноль), Linux-PPC будет размещать заранее обнулённые страницы в цикле простоя, что возможно увеличит скорость выполнения get_free_pages.

source: This directory contains networking stuff. Explanations for some of the files under this directory can be found in B<tcp>(7) and B<ip>(7).
ru: Этот каталог содержит некоторую информацию по функционированию сетевой подсистемы. Описание некоторых файлов в этом каталоге можно найти в B<tcp>(7) и B<ip>(7).

source: See B<bpf>(2).
ru: Смотрите B<bpf>(2).

source: This file defines a ceiling value for the I<backlog> argument of B<listen>(2); see the B<listen>(2) manual page for details.
ru: Этот файл определяет наименьшее значение параметра I<backlog> системного вызова B<listen>(2); подробности смотрите в справочной странице B<listen>(2).

source: This directory supports Sun remote procedure call for network filesystem (NFS). On some systems, it is not present.
ru: Данный каталог поддерживает удалённый вызов процедур Sun для сетевой файловой системы (NFS). В некоторых системах его нет.

source: I</proc/sys/user> (since Linux 4.9)
ru: I</proc/sys/user> (начиная с Linux 4.9)

source: See B<namespaces>(7).
ru: Смотрите в B<namespaces>(7).

source: This directory contains files for memory management tuning, buffer and cache management.
ru: Этот каталог содержит файлы для тонкой настройки управления памятью, буферами и кэшем.

source: I</proc/sys/vm/admin_reserve_kbytes> (since Linux 3.10)
ru: I</proc/sys/vm/overcommit_kbytes> (начиная с Linux 3.10)

source: This file defines the amount of free memory (in KiB) on the system that should be reserved for users with the capability B<CAP_SYS_ADMIN>.
ru: В данном файле задаётся количество свободной памяти (в КиБ) в системе, которое должно быть зарезервировано для пользователей с мандатом B<CAP_SYS_ADMIN>.

source: The default value in this file is the minimum of [3% of free pages, 8MiB] expressed as KiB. The default is intended to provide enough for the superuser to log in and kill a process, if necessary, under the default overcommit 'guess' mode (i.e., 0 in I</proc/sys/vm/overcommit_memory>).
ru: Значение по умолчанию равно минимум от [3% свободных страниц, 8МиБ], выраженное в КиБ. Этого достаточно для того, чтобы суперпользователь смог войти и удалить процесс, если нужно, когда система работает в режиме по умолчанию — «угадывание» перерасхода (т. е., 0 в I</proc/sys/vm/overcommit_memory>).

source: Systems running in "overcommit never" mode (i.e., 2 in I</proc/sys/vm/overcommit_memory>) should increase the value in this file to account for the full virtual memory size of the programs used to recover (e.g., B<login>(1) B<ssh>(1), and B<top>(1)) Otherwise, the superuser may not be able to log in to recover the system. For example, on x86-64 a suitable value is 131072 (128MiB reserved).
ru: Для систем, работающих в режиме «без перерасхода» (overcommit never) (т. е., 2 в I</proc/sys/vm/overcommit_memory>) нужно увеличить значение в этом файле с учётом полного размера виртуальной памяти для программ, используемых при восстановлении (например, B<login>(1) B<ssh>(1) и B<top>(1)). В противном случае суперпользователь не сможет войти для восстановления системы. Например, на x86-64 подходящим значением будет 131072 (резервируется 128 МиБ).

source: Changing the value in this file takes effect whenever an application requests memory.
ru: Изменение этого значения влияет на последующие запросы памяти приложениями.

source: I</proc/sys/vm/compact_memory> (since Linux 2.6.35)
ru: I</proc/sys/vm/compact_memory> (начиная с Linux 2.6.35)

source: When 1 is written to this file, all zones are compacted such that free memory is available in contiguous blocks where possible. The effect of this action can be seen by examining I</proc/buddyinfo>.
ru: При записи в этот файл 1 все зоны уплотняются так, чтобы свободная память была непрерывными блоками насколько это возможно. Результат этого действия можно оценить по файлу I</proc/buddyinfo>.

source: Present only if the kernel was configured with B<CONFIG_COMPACTION>.
ru: Доступен только, если ядро собрано с параметром B<CONFIG_COMPACTION>.
