Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: (B<CONFIG_HUGETLB_PAGE> is required.) This is the number of huge pages for which a commitment to allocate from the pool has been made, but no allocation has yet been made. These reserved huge pages guarantee that an application will be able to allocate a huge page from the pool of huge pages at fault time.
ru: (Требуется параметр B<CONFIG_HUGETLB_PAGE>.) Количество огромных страниц, для которых есть обязательство по распределению в пуле, но которые ещё не распределены. Эти зарезервированные огромные страницы гарантируют, что приложение сможет получить огромную страницу из пула огромных страниц при нехватке памяти.

source: I<HugePages_Surp> %lu (since Linux 2.6.24)
ru: I<HugePages_Surp> %lu (начиная с Linux 2.6.24)

source: (B<CONFIG_HUGETLB_PAGE> is required.) This is the number of huge pages in the pool above the value in I</proc/sys/vm/nr_hugepages>. The maximum number of surplus huge pages is controlled by I</proc/sys/vm/nr_overcommit_hugepages>.
ru: (Требуется параметр B<CONFIG_HUGETLB_PAGE>.) Количество огромных страниц в пуле выше значения в I</proc/sys/vm/nr_hugepages>. Максимальное число избыточных огромных страниц настраивается в I</proc/sys/vm/nr_overcommit_hugepages>.

source: (B<CONFIG_HUGETLB_PAGE> is required.) The size of huge pages.
ru: (Требуется параметр B<CONFIG_HUGETLB_PAGE>.) Размер огромных страниц.

source: I<DirectMap4k> %lu (since Linux 2.6.27)
ru: I<DirectMap4k> %lu (начиная с Linux 2.6.27)

source: Number of bytes of RAM linearly mapped by kernel in 4kB pages. (x86.)
ru: Количество байт RAM линейно отображаемых ядром в 4КБ страницы. (x86.)

source: I<DirectMap4M> %lu (since Linux 2.6.27)
ru: I<DirectMap4M> %lu (начиная с Linux 2.6.27)

source: Number of bytes of RAM linearly mapped by kernel in 4MB pages. (x86 with B<CONFIG_X86_64> or B<CONFIG_X86_PAE> enabled.)
ru: Количество байт RAM линейно отображаемых ядром в 4МБ страницы. (x86 с включённым B<CONFIG_X86_64> или B<CONFIG_X86_PAE>).

source: I<DirectMap2M> %lu (since Linux 2.6.27)
ru: I<DirectMap2M> %lu (начиная с Linux 2.6.27)

source: Number of bytes of RAM linearly mapped by kernel in 2MB pages. (x86 with neither B<CONFIG_X86_64> nor B<CONFIG_X86_PAE> enabled.)
ru: Количество байт RAM линейно отображаемых ядром в 2МБ страницы. (x86 с выключенными B<CONFIG_X86_64> и B<CONFIG_X86_PAE>).

source: I<DirectMap1G> %lu (since Linux 2.6.27)
ru: I<DirectMap1G> %lu (начиная с Linux 2.6.27)

source: (x86 with B<CONFIG_X86_64> and B<CONFIG_X86_DIRECT_GBPAGES> enabled.)
ru: (x86 с включёнными B<CONFIG_X86_64> и B<CONFIG_X86_DIRECT_GBPAGES>)

source: A text list of the modules that have been loaded by the system. See also B<lsmod>(8).
ru: Текстовый список модулей, которые были загружены системой. Смотрите также B<lsmod>(8).

source: Before kernel 2.4.19, this file was a list of all the filesystems currently mounted on the system. With the introduction of per-process mount namespaces in Linux 2.4.19 (see B<mount_namespaces>(7)), this file became a link to I</proc/self/mounts>, which lists the mount points of the process's own mount namespace. The format of this file is documented in B<fstab>(5).
ru: До ядра версии 2.4.19, в этом файле содержался список всех файловых систем, которые примонтированы в настоящий момент. С введением попроцессных пространств имён монтирования в Linux 2.4.19 (смотрите B<mount_namespaces>(7)), этот файл стал указывать на I</proc/self/mounts>, в котором представлен список точек монтирования из пространства монтирования процесса. Формат этого файла описан в B<fstab>(5).

source: Memory Type Range Registers. See the Linux kernel source file I<Documentation/x86/mtrr.txt> (or I<Documentation/mtrr.txt> before Linux 2.6.28) for details.
ru: Диапазонные регистры типа памяти. Подробности смотрите в файле дерева исходного кода ядра Linux I<Documentation/x86/mtrr.txt> (или I<Documentation/mtrr.txt> до Linux 2.6.28).

source: This directory contains various files and subdirectories containing information about the networking layer. The files contain ASCII structures and are, therefore, readable with B<cat>(1). However, the standard B<netstat>(8) suite provides much cleaner access to these files.
ru: Данный каталог хранит различные файлы и подкаталоги, содержащие информацию о сетевой подсистеме. В файлах используются структуры в ASCII и поэтому их можно читать утилитой B<cat>(1). Однако, стандартная комплект B<netstat>(8) предоставляет более понятную информацию из этих файлов.

source: With the advent of network namespaces, various information relating to the network stack is virtualized (see B<namespaces>(7)). Thus, since Linux 2.6.25, I</proc/net> is a symbolic link to the directory I</proc/self/net>, which contains the same files and directories as listed below. However, these files and directories now expose information for the network namespace of which the process is a member.
ru: С появлением сетевых пространств имён различная информация о сетевом стеке стала виртуализированной (смотрите B<namespaces>(7)). То есть, начиная с Linux 2.6.25 файл I</proc/net> — это символическая ссылка на каталог I</proc/self/net>, в котором содержатся те же файлы и каталоги, перечисленные ниже. Однако эти файлы и каталоги теперь отражают информацию для сетевого пространства имён, в котором числится процесс.

source: This holds an ASCII readable dump of the kernel ARP table used for address resolutions. It will show both dynamically learned and preprogrammed ARP entries. The format is:
ru: Файл содержит читабельный ASCII-дамп ARP таблицы ядра, которая используется для определения адресов. Она покажет как полученные динамически, так и заданные явно записи ARP. Формат файла:

source: Here "IP address" is the IPv4 address of the machine and the "HW type" is the hardware type of the address from RFC\ 826. The flags are the internal flags of the ARP structure (as defined in I</usr/include/linux/if_arp.h>) and the "HW address" is the data link layer mapping for that IP address if it is known.
ru: Здесь "IP-адрес" это адрес машины в нотации IPv4, "Тип обор." это тип аппаратного обеспечения для этого адреса согласно RFC\ 826. Флаги \(em это внутренние флаги структуры ARP(определённые в I</usr/include/linux/if_arp.h>), а "Аппарат. адрес" \(em это адрес канального уровня для IP-адреса, если он известен.

source: The dev pseudo-file contains network device status information. This gives the number of received and sent packets, the number of errors and collisions and other basic statistics. These are used by the B<ifconfig>(8) program to report device status. The format is:
ru: Псевдо-файл dev содержит информацию о состоянии сетевых устройств. Она представляет собой количество принятых и отправленных пакетов, количество ошибок и коллизий и другую базовую статистику. Эта информация используется программой B<ifconfig>(8) для вывода отчёта о состоянии устройства. Формат информации:

source: Defined in I</usr/src/linux/net/core/dev_mcast.c>:
ru: Определено в I</usr/src/linux/net/core/dev_mcast.c>:

source: indx interface_name dmi_u dmi_g dmi_address 2 eth0 1 0 01005e000001 3 eth1 1 0 01005e000001 4 eth2 1 0 01005e000001
ru: индекс имя_интерфейса dmi_u dmi_g адрес_dmi 2 eth0 1 0 01005e000001 3 eth1 1 0 01005e000001 4 eth2 1 0 01005e000001

source: Internet Group Management Protocol. Defined in I</usr/src/linux/net/core/igmp.c>.
ru: Internet Group Management Protocol (протокол управления группами Интернета). Определён в I</usr/src/linux/net/core/igmp.c>.

source: This file uses the same format as the I<arp> file and contains the current reverse mapping database used to provide B<rarp>(8) reverse address lookup services. If RARP is not configured into the kernel, this file will not be present.
ru: Данный файл использует тот же формат, что и файл I<arp> и содержит текущую обратную базу данных адресов ARP, используемую при работе служб обратного поиска адресов B<rarp>(8). Если поддержки RARP нет в ядре, то этот файл не существует.

source: Holds a dump of the RAW socket table. Much of the information is not of use apart from debugging. The "sl" value is the kernel hash slot for the socket, the "local_address" is the local address and protocol number pair. \&"St" is the internal status of the socket. The "tx_queue" and "rx_queue" are the outgoing and incoming data queue in terms of kernel memory usage. The "tr", "tm-E<gt>when", and "rexmits" fields are not used by RAW. The "uid" field holds the effective UID of the creator of the socket.
ru: Содержит дамп таблицы неструктурированных (RAW) сокетов. Большая часть этой информации не используется ни для чего, кроме отладки. Значение «s»" \(em это хэшируемый слот ядра для сокета, «local_address» \(em это пара локальный адрес, номер протокола. \&«St» \(em это внутреннее состояние сокета. «tx_queue» и «rx_queue» \(em это исходящая и входящая очереди данных в том, виде в каком они используются в памяти ядра. Поля «tr», «tm-E<gt>when» и «rexmits» не используются в RAW. Поле «uid» содержит эффективный UID создателя сокета.

source: This file holds the ASCII data needed for the IP, ICMP, TCP, and UDP management information bases for an SNMP agent.
ru: Этот файл содержит ASCII данные, необходимые SNMP-агенту для баз управляющей информации IP, ICMP, TCP и UDP.

source: Holds a dump of the TCP socket table. Much of the information is not of use apart from debugging. The "sl" value is the kernel hash slot for the socket, the "local_address" is the local address and port number pair. The "rem_address" is the remote address and port number pair (if connected). \&"St" is the internal status of the socket. The "tx_queue" and "rx_queue" are the outgoing and incoming data queue in terms of kernel memory usage. The "tr", "tm-E<gt>when", and "rexmits" fields hold internal information of the kernel socket state and are useful only for debugging. The "uid" field holds the effective UID of the creator of the socket.
ru: Содержит дамп таблицы TCP-сокетов. Большая часть этой информации не используется ни для чего, кроме отладки. Значение «sl» — это хэшируемый слот ядра для сокета, «local_address» — это пара локальный адрес и номер порта. «rem_address» — это пара удалённого локального адреса и номера порта. «st» — это внутреннее состояние сокета. «tx_queue» и «rx_queue» — это исходящая и входящая очереди данных в том, виде в каком они используются в памяти ядра. Поля «tr», «tm-E<gt>when» и «rexmits» содержат внутреннюю информацию ядра о состоянии сокета и полезны только для отладки. Поле «uid» содержит эффективный UID создателя сокета.

source: Holds a dump of the UDP socket table. Much of the information is not of use apart from debugging. The "sl" value is the kernel hash slot for the socket, the "local_address" is the local address and port number pair. The "rem_address" is the remote address and port number pair (if connected). "St" is the internal status of the socket. The "tx_queue" and "rx_queue" are the outgoing and incoming data queue in terms of kernel memory usage. The "tr", "tm-E<gt>when", and "rexmits" fields are not used by UDP. The "uid" field holds the effective UID of the creator of the socket. The format is:
ru: Содержит дамп таблицы UDP-сокетов. Большая часть этой информации не используется ни для чего, кроме отладки. Значение «sl» — это хэшируемый слот ядра для сокета, «local_address» — это пара локальный адрес и номер порта. «rem_address» — это пара удалённого локального адреса и номера порта. «st» — это внутреннее состояние сокета. «tx_queue» и «rx_queue» — это исходящая и входящая очереди данных в том, виде в каком они используются в памяти ядра. Поля «tr», «tm-E<gt>when» и «rexmits» не используются в UDP. Поле «uid» содержит эффективный UID создателя сокета. Формат:

source: Lists the UNIX domain sockets present within the system and their status. The format is:
ru: Показывает список доменных сокетов UNIX, присутствующих в системе, а также их состояния. Формат:

source: the kernel table slot number.
ru: Номер слота таблицы ядра.

source: the number of users of the socket.
ru: Количество пользователей сокета.

source: currently always 0.
ru: Пока всегда 0.

source: the internal kernel flags holding the status of the socket.
ru: Внутренние флаги ядра, содержащие состояние сокета.

source: the socket type. For B<SOCK_STREAM> sockets, this is 0001; for B<SOCK_DGRAM> sockets, it is 0002; and for B<SOCK_SEQPACKET> sockets, it is 0005.
ru: Тип сокета. Для сокетов B<SOCK_STREAM> значение равно 0001; для сокетов B<SOCK_DGRAM> — 0002, для сокетов B<SOCK_SEQPACKET> — 0005.

source: the internal state of the socket.
ru: Внутреннее состояние сокета.

source: the inode number of the socket.
ru: Номер иноды сокета.

source: the bound pathname (if any) of the socket. Sockets in the abstract namespace are included in the list, and are shown with a I<Path> that commences with the character '@'.
ru: Путь привязки (если есть) сокета. Сокеты в абстрактном пространстве имён заключаются в список и показаны в I<Path> начинающимися с символа @.

source: This file contains information about netfilter user-space queueing, if used. Each line represents a queue. Queues that have not been subscribed to by user space are not shown.
ru: В этом файле содержится информация об очередях netfilter в пользовательском пространстве (если используется). Каждая строка описывает очередь. Очередь, на которые которые не было подписок из пространства пользователя, не показываются.

source: The ID of the queue. This matches what is specified in the B<--queue-num> or B<--queue-balance> options to the B<iptables>(8) NFQUEUE target. See B<iptables-extensions>(8) for more information.
ru: Идентификатор очереди. Совпадает с указанным в параметрах B<--queue-num> или B<--queue-balance> B<iptables>(8) для цели NFQUEUE. Подробности смотрите в B<iptables-extensions>(8).

source: The netlink port ID subscribed to the queue.
ru: Идентификатор порта netlink, подписанного на очередь.

source: The number of packets currently queued and waiting to be processed by the application.
ru: Количество пакетов, находящихся сейчас в очереди и ожидающих обработки приложением.

source: The copy mode of the queue. It is either 1 (metadata only) or 2 (also copy payload data to user space).
ru: Режим копирования очереди. Равен 1 (только метаданные) или 2 (также копировать в пространство пользователя данные полезной нагрузки).

source: Copy range; that is, how many bytes of packet payload should be copied to user space at most.
ru: Диапазон копирования; то есть не более скольких байт полезной нагрузки пакета должно быть скопировано в пространство пользователя.

source: queue dropped. Number of packets that had to be dropped by the kernel because too many packets are already waiting for user space to send back the mandatory accept/drop verdicts.
ru: Очередь отброшена. Количество пакетов, которое было отброшено ядром из-за слишком большого количества пакетов уже ожидающих в пространстве пользователя для обратной отправки согласно обязательного решения приёма/отброса.

source: queue user dropped. Number of packets that were dropped within the netlink subsystem. Such drops usually happen when the corresponding socket buffer is full; that is, user space is not able to read messages fast enough.
ru: Очередь пользователя отброшена. Количество пакетов, которое было отброшено внутри подсистемы netlink. Обычно такое отбрасывание происходит когда переполнен соответствующий буфер сокета; то есть пространство пользователя не способно читать сообщения достаточно быстро.

source: sequence number. Every queued packet is associated with a (32-bit) monotonically-increasing sequence number. This shows the ID of the most recent packet queued.
ru: Последовательный номер. Каждый пакет в очереди связывается с (32-битным) постоянно увеличивающимся последовательным номером. Поле отображает ID самого нового пакета в очереди.

source: The last number exists only for compatibility reasons and is always 1.
ru: Последний номер существует только для совместимости и всегда равен 1.

source: Contains the major and minor numbers of each partition as well as the number of 1024-byte blocks and the partition name.
ru: Содержит старший (major) и младший (minor) номер каждого раздела, а также количество 1024-байтных блоков и имя раздела.

source: This is a listing of all PCI devices found during kernel initialization and their configuration.
ru: Это список всех устройств PCI, найденных во время инициализации ядра, а также их конфигурация.

source: This file has been deprecated in favor of a new I</proc> interface for PCI (I</proc/bus/pci>). It became optional in Linux 2.2 (available with B<CONFIG_PCI_OLD_PROC> set at kernel compilation). It became once more nonoptionally enabled in Linux 2.4. Next, it was deprecated in Linux 2.6 (still available with B<CONFIG_PCI_LEGACY_PROC> set), and finally removed altogether since Linux 2.6.17.
ru: Этот файл устарел и был заменён на новый интерфейс I</proc> для PCI (I</proc/bus/pci>). Он стал необязательным в Linux 2.2 (доступен, если установлен параметр сборки ядра B<CONFIG_PCI_OLD_PROC>). Он стал ещё более необязательным в Linux 2.4. В Linux 2.6 он стал не рекомендуемым (но ещё доступным через параметр B<CONFIG_PCI_LEGACY_PROC>), и, наконец, был полностью удалён в Linux 2.6.17.

source: I</proc/profile> (since Linux 2.4)
ru: I</proc/profile> (начиная с Linux 2.4)

source: This file is present only if the kernel was booted with the I<profile=1> command-line option. It exposes kernel profiling information in a binary format for use by B<readprofile>(1). Writing (e.g., an empty string) to this file resets the profiling counters; on some architectures, writing a binary integer "profiling multiplier" of size I<sizeof(int)> sets the profiling interrupt frequency.
ru: Данный файл существует только, если ядро загружено с параметром командной строки I<profile=1>. В нём содержится профилирующая информация ядра в двоичном формате, которую использует B<readprofile>(1). Запись (например, пустой строки) в этот файл обнуляет счётчики профилирования; на некоторых архитектурах запись двоичного целого «профилирующего умножителя» размером с I<sizeof(int)> устанавливает частоту профилирующего прерывания.

source: A directory with the I<scsi> mid-level pseudo-file and various SCSI low-level driver directories, which contain a file for each SCSI host in this system, all of which give the status of some part of the SCSI IO subsystem. These files contain ASCII structures and are, therefore, readable with B<cat>(1).
ru: Каталог с псевдо-файлом I<scsi> и различными каталогами низкоуровневых драйверов SCSI, которые содержат по одному файлу на каждый SCSI-узел в системе, и которые представляют некоторую информацию о части подсистемы ввода/вывода SCSI. Данные файлы содержат ASCII структуры и прекрасно читаются утилитой B<cat>(1).

source: You can also write to some of the files to reconfigure the subsystem or switch certain features on or off.
ru: Также вы можете писать в некоторые из этих файлов для перенастройки подсистемы или включения/выключения некоторых возможностей.

source: This is a listing of all SCSI devices known to the kernel. The listing is similar to the one seen during bootup. scsi currently supports only the I<add-single-device> command which allows root to add a hotplugged device to the list of known devices.
ru: Это список всех SCSI-устройств, которые известны ядру. Список похож на тот, что выдается при начальной загрузке. scsi в настоящий момент поддерживает только команду I<add-single-device>, которая позволяет суперпользователю добавлять устройства на ходу, без выключения машины.

source: will cause host scsi1 to scan on SCSI channel 0 for a device on ID 5 LUN 0. If there is already a device known on this address or the address is invalid, an error will be returned.
ru: заставит адаптер scsi1 просканировать SCSI канал 0, чтобы найти устройство с ID 5 и LUN 0. Если по этому адресу уже есть известное устройство или если заданный адрес неправилен, то будет возвращена ошибка.

source: I</proc/scsi/[drivername]>
ru: I</proc/scsi/[имя_драйвера]>

source: I<[drivername]> can currently be NCR53c7xx, aha152x, aha1542, aha1740, aic7xxx, buslogic, eata_dma, eata_pio, fdomain, in2000, pas16, qlogic, scsi_debug, seagate, t128, u15-24f, ultrastore, or wd7000. These directories show up for all drivers that registered at least one SCSI HBA. Every directory contains one file per registered host. Every host-file is named after the number the host was assigned during initialization.
ru: I<[Именем_драйвера]> в настоящий момент могут быть: NCR53c7xx, aha152x, aha1542, aha1740, aic7xxx, buslogic, eata_dma, eata_pio, fdomain, in2000, pas16, qlogic, scsi_debug, seagate, t128, u15-24f, ultrastore или wd7000. Эти каталоги показывают все драйверы, который зарегистрированы хотя бы одним SCSI HBA. Каждый каталог содержит по одному файлу на каждый зарегистрированный узел. Имя каждого узла соответствует номеру, который был получен этим узлом во время инициализации.

source: Reading these files will usually show driver and host configuration, statistics, and so on.
ru: Чтение данных файлов обычно показывает информацию о конфигурации драйвера и узла, статистику и т. п.

source: Writing to these files allows different things on different hosts. For example, with the I<latency> and I<nolatency> commands, root can switch on and off command latency measurement code in the eata_dma driver. With the I<lockup> and I<unlock> commands, root can control bus lockups simulated by the scsi_debug driver.
ru: Записывая в эти файлы, можно добиться различных результатов от разных узлов. Например, командами I<latency> и I<nolatency> суперпользователь может включить и выключить команду кода вычисления задержки в драйвере eata_dma. Командами I<lockup> и I<unlock> суперпользователь может управлять блокировками шины, которые симулирует драйвер scsi_debug.

source: This directory refers to the process accessing the I</proc> filesystem, and is identical to the I</proc> directory named by the process ID of the same process.
ru: Этот каталог указывает на процесс, обращающийся к файловой системе I</proc>, и идентичен каталогу I</proc>, соответствующему номеру этого процесса.

source: Information about kernel caches. See B<slabinfo>(5) for details.
ru: Информация о кэшах ядра. Подробности в B<slabinfo>(5).

source: kernel/system statistics. Varies with architecture. Common entries include:
ru: Статистика ядра/системы. Различается для разных архитектур. Общие элементы:

source: The amount of time, measured in units of USER_HZ (1/100ths of a second on most architectures, use I<sysconf(_SC_CLK_TCK)> to obtain the right value), that the system ("cpu" line) or the specific CPU ("cpuI<N>" line) spent in various states:
ru: Количество времени, измеряемое в единицах USER_HZ (на большинстве архитектур — 1/100-я секунды; чтобы получить правильное значение используйте I<sysconf(_SC_CLK_TCK)>), которые система (строка «cpu») или определённый ЦП (строка «cpuI<N>») потратила в различных режимах:

source: I<user>
ru: I<пользовательский>

source: (1) Time spent in user mode.
ru: (1) Время, проведённое в пользовательском режиме.

source: (2) Time spent in user mode with low priority (nice).
ru: (2) Время, проведённое в пользовательском режиме с низким приоритетом (nice).

source: I<system>
ru: I<системный>

source: (3) Time spent in system mode.
ru: (3) Время, проведённое в системном режиме.

source: I<idle>
ru: I<простой>

source: (4) Time spent in the idle task. This value should be USER_HZ times the second entry in the I</proc/uptime> pseudo-file.
ru: (4) Время, проведённое в ожидании. Это значение совпадает с значением второго поля в псевдо-файле I</proc/uptime>.

source: I<iowait> (since Linux 2.5.41)
ru: I<iowait> (начиная с Linux 2.5.41)
