Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Signal to be sent to parent when we die.
ru: Сигнал, который будет послан родителю, когда процесс завершит работу.

source: (39) I<processor> \ %d \ (since Linux 2.2.8)
ru: (39) I<processor> \ %d \ (начиная с Linux 2.2.8)

source: CPU number last executed on.
ru: Номер процессора, на котором последний раз выполнялся процесс.

source: (40) I<rt_priority> \ %u \ (since Linux 2.5.19)
ru: (40) I<rt_priority> \ %u \ (начиная с Linux 2.5.19)

source: Real-time scheduling priority, a number in the range 1 to 99 for processes scheduled under a real-time policy, or 0, for non-real-time processes (see B<sched_setscheduler>(2)).
ru: Приоритет выполнения в реальном времени, число из диапазона от 1 до 99 для процессов запланированных выполняться согласно политике реального времени или 0 для процессов, выполняющихся не в реальном времени (см. B<sched_setscheduler>(2)).

source: (41) I<policy> \ %u \ (since Linux 2.5.19)
ru: (41) I<policy> \ %u \ (начиная с Linux 2.5.19)

source: Scheduling policy (see B<sched_setscheduler>(2)). Decode using the SCHED_* constants in I<linux/sched.h>.
ru: Политика планирования (смотрите B<sched_setscheduler>(2)). Декодируется с помощью констант SCHED_* из I<linux/sched.h>.

source: The format for this field was %lu before Linux 2.6.22.
ru: Формат данного поля был %lu до Linux 2.6.22.

source: (42) I<delayacct_blkio_ticks> \ %llu \ (since Linux 2.6.18)
ru: (42) I<delayacct_blkio_ticks> \ %llu \ (начиная с Linux 2.6.18)

source: Aggregated block I/O delays, measured in clock ticks (centiseconds).
ru: Суммарная задержка блочного ввода-вывода, измеряется в тиках (сотых долях секунды).

source: (43) I<guest_time> \ %lu \ (since Linux 2.6.24)
ru: (43) I<guest_time> \ %lu \ (начиная с Linux 2.6.24)

source: Guest time of the process (time spent running a virtual CPU for a guest operating system), measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>).
ru: Гостевое время процесса (время, потраченное на работу виртуального ЦП гостевой операционной системы), измеряется в тиках (поделённых на I<sysconf(_SC_CLK_TCK)>).

source: (44) I<cguest_time> \ %ld \ (since Linux 2.6.24)
ru: (44) I<cguest_time> \ %ld \ (начиная с Linux 2.6.24)

source: Guest time of the process's children, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>).
ru: Гостевое время потомка процесса, измеряется в тиках (поделённых на I<sysconf(_SC_CLK_TCK)>).

source: (45) I<start_data> \ %lu \ (since Linux 3.3) \ [PT]
ru: (45) I<start_data> \ %lu \ (начиная с Linux 3.3) \ [PT]

source: Address above which program initialized and uninitialized (BSS) data are placed.
ru: Адрес, выше которого располагаются инициализированные и не инициализированные (BSS) данные.

source: (46) I<end_data> \ %lu \ (since Linux 3.3) \ [PT]
ru: (46) I<end_data> \ %lu \ (начиная с Linux 3.3) \ [PT]

source: Address below which program initialized and uninitialized (BSS) data are placed.
ru: Адрес, ниже которого располагаются инициализированные и не инициализированные (BSS) данные.

source: (47) I<start_brk> \ %lu \ (since Linux 3.3) \ [PT]
ru: (47) I<start_brk> \ %lu \ (начиная с Linux 3.3) \ [PT]

source: Address above which program heap can be expanded with B<brk>(2).
ru: Адрес, выше которого программа может расширять кучу с помощью B<brk>(2).

source: (48) I<arg_start> \ %lu \ (since Linux 3.5) \ [PT]
ru: (48) I<arg_start> \ %lu \ (начиная с Linux 3.5) \ [PT]

source: Address above which program command-line arguments (I<argv>) are placed.
ru: Адрес, выше которого располагаются аргументы командной строки программы (I<argv>).

source: (49) I<arg_end> \ %lu \ (since Linux 3.5) \ [PT]
ru: (49) I<arg_end> \ %lu \ (начиная с Linux 3.5) \ [PT]

source: Address below program command-line arguments (I<argv>) are placed.
ru: Адрес, ниже которого располагаются аргументы командной строки программы (I<argv>).

source: (50) I<env_start> \ %lu \ (since Linux 3.5) \ [PT]
ru: (50) I<env_start> \ %lu \ (начиная с Linux 3.5) \ [PT]

source: Address above which program environment is placed.
ru: Адрес, выше которого располагается окружение программы.

source: (51) I<env_end> \ %lu \ (since Linux 3.5) \ [PT]
ru: (51) I<env_end> \ %lu \ (начиная с Linux 3.5) \ [PT]

source: Address below which program environment is placed.
ru: Адрес, ниже которого располагается окружение программы.

source: (52) I<exit_code> \ %d \ (since Linux 3.5) \ [PT]
ru: (52) I<exit_code> \ %d \ (начиная с Linux 3.5) \ [PT]

source: The thread's exit status in the form reported by B<waitpid>(2).
ru: Состояние завершения нити в виде, выдаваемом B<waitpid>(2).

source: Provides information about memory usage, measured in pages. The columns are:
ru: Предоставляет информацию об использовании памяти, измеряется в страницах. Колонки:

source: size (1) total program size (same as VmSize in I</proc/[pid]/status>) resident (2) resident set size (same as VmRSS in I</proc/[pid]/status>) shared (3) number of resident shared pages (i.e., backed by a file) (same as RssFile+RssShmem in I</proc/[pid]/status>) text (4) text (code) lib (5) library (unused since Linux 2.6; always 0) data (6) data + stack dt (7) dirty pages (unused since Linux 2.6; always 0)
ru: size (1) полный размер программы (тоже что и VmSize в I</proc/[pid]/status>) resident (2) размер резидентной части (тоже что и VmRSS в I</proc/[pid]/status>) shared (3) количество резидентных общих страниц (т. е., отражаемых файлом) (тоже что и RssFile+RssShmem в I</proc/[pid]/status>) text (4) текст программы (код) lib (5) библиотека (не используется начиная с Linux 2.6; всегда 0) data (6) данные + стек dt (7) недостоверные страницы (не используется начиная с Linux 2.6; всегда 0)

source: Provides much of the information in I</proc/[pid]/stat> and I</proc/[pid]/statm> in a format that's easier for humans to parse. Here's an example:
ru: В основном, предоставляет информацию из I</proc/[pid]/stat> и I</proc/[pid]/statm> в более лёгком для прочтения человеком формате. Пример:

source: I<Name>: Command run by this process.
ru: I<Name>: Команда, выполняемая этим процессом.

source: I<Umask>: Process umask, expressed in octal with a leading zero; see B<umask>(2). (Since Linux 4.7.)
ru: I<Umask>: umask процесса, выражается восьмеричным числом с начальным нулём; смотрите B<umask>(2) (начиная с Linux 4.7).

source: I<State>: Current state of the process. One of "R (running)", "S (sleeping)", "D (disk sleep)", "T (stopped)", "T (tracing stop)", "Z (zombie)", or "X (dead)".
ru: I<State>: Текущее состояние процесса. Может быть "R (работает)", "S (спит)", "D (спит на диске)", "T (остановлен)", "T (остановлен трассировкой)", "Z (зомби)" или "X (завершён)".

source: I<Tgid>: Thread group ID (i.e., Process ID).
ru: I<Tgid>: Групповой ID нити (т.е., ID процесса).

source: I<Ngid>: NUMA group ID (0 if none; since Linux 3.13).
ru: I<Ngid>: идентификатор группы NUMA (0, если нет; начиная с Linux 3.13).

source: I<Pid>: Thread ID (see B<gettid>(2)).
ru: I<Pid>: ID нити (см. B<gettid>(2)).

source: I<PPid>: PID of parent process.
ru: I<PPid>: PID родительского процесса.

source: I<TracerPid>: PID of process tracing this process (0 if not being traced).
ru: I<TracerPid>: PID процесса, который выполняет трассировку данного процесса (0, если трассировки нет).

source: I<Uid>, I<Gid>: Real, effective, saved set, and filesystem UIDs (GIDs).
ru: I<Uid>, I<Gid>: Реальный, эффективный, сохранённый и используемый в файловой системе UID (GID).

source: I<FDSize>: Number of file descriptor slots currently allocated.
ru: I<FDSize>: Количество слотов файловых дескрипторов выделенных в данный момент.

source: I<Groups>: Supplementary group list.
ru: I<Groups>: Список дополнительных групп.

source: I<NStgid>: Thread group ID (i.e., PID) in each of the PID namespaces of which I<[pid]> is a member. The leftmost entry shows the value with respect to the PID namespace of the process that mounted this procfs (or the root namespace if mounted by the kernel), followed by the value in successively nested inner namespaces. (Since Linux 4.1.)
ru: I<NStgid>: Идентификатор группы нитей (т. е., PID) в каждом пространстве имён PID, в которых I<[pid]> является членом. Крайняя левая запись показывает значение в соответствии с пространством имён PID процесса, для которого смонтирован этот procfs (или корневое пространство имён, если смонтировало ядро), далее идёт значение в последующих вложенных внутрь пространств имён (начиная с Linux 4.1).

source: I<NSpid>: Thread ID in each of the PID namespaces of which I<[pid]> is a member. The fields are ordered as for I<NStgid>. (Since Linux 4.1.)
ru: I<NSpid>: Идентификатор нити в каждом пространстве имён PID, в которых I<[pid]> является членом. Поля представлены в том же порядке что и в I<NStgid> (начиная с Linux 4.1).

source: I<NSpgid>: Process group ID in each of the PID namespaces of which I<[pid]> is a member. The fields are ordered as for I<NStgid>. (Since Linux 4.1.)
ru: I<NSpgid>: Идентификатор группы процессов в каждом пространстве имён PID, в которых I<[pid]> является членом. Поля представлены в том же порядке что и в I<NStgid> (начиная с Linux 4.1).

source: I<NSsid>: descendant namespace session ID hierarchy Session ID in each of the PID namespaces of which I<[pid]> is a member. The fields are ordered as for I<NStgid>. (Since Linux 4.1.)
ru: I<NSsid>: идентификатор сеанса пространства имён потомка в иерархии идентификаторов сеанса в каждом пространстве имён PID, в которых I<[pid]> является членом. Поля представлены в том же порядке что и в I<NStgid> (начиная с Linux 4.1).

source: I<VmPeak>: Peak virtual memory size.
ru: I<VmPeak>: Пик размера виртуальной памяти.

source: I<VmSize>: Virtual memory size.
ru: I<VmSize>: Размер виртуальной памяти.

source: I<VmLck>: Locked memory size (see B<mlock>(2)).
ru: I<VmLck>: Размер заблокированной памяти (смотрите B<mlock>(2)).

source: I<VmPin>: Pinned memory size (since Linux 3.2). These are pages that can't be moved because something needs to directly access physical memory.
ru: I<VmPin>: Размер закреплённой памяти (начиная с Linux 3.2). Эти страницы не могут быть перемещены, так как для чего-то требуется прямой доступ к физической памяти.

source: I<VmHWM>: Peak resident set size ("high water mark").
ru: I<VmHWM>: Пик размера резидентной памяти ("отметка высоты прилива").

source: I<VmRSS>: Resident set size. Note that the value here is the sum of I<RssAnon>, I<RssFile>, and I<RssShmem>.
ru: I<VmRSS>: Размер резидентной части. Заметим, что это значение является суммой I<RssAnon>, I<RssFile> и I<RssShmem>.

source: I<RssAnon>: Size of resident anonymous memory. (since Linux 4.5).
ru: I<RssAnon>: Размер резидентной анонимной памяти (начиная с Linux 4.5).

source: I<RssFile>: Size of resident file mappings. (since Linux 4.5).
ru: I<RssFile>: Размер отображений резидентных файлов (начиная с Linux 4.5).

source: I<RssShmem>: Size of resident shared memory (includes System V shared memory, mappings from B<tmpfs>(5), and shared anonymous mappings). (since Linux 4.5).
ru: I<RssShmem>: Размер общей резидентной памяти (включая общую память System V, отображения из B<tmpfs>(5) и общие анонимные отображения) (начиная с Linux 4.5).

source: I<VmData>, I<VmStk>, I<VmExe>: Size of data, stack, and text segments.
ru: I<VmData>, I<VmStk>, I<VmExe>: Размер сегментов данных, стека и кода.

source: I<VmLib>: Shared library code size.
ru: I<VmLib>: Размер кода общей библиотеки.

source: I<VmPTE>: Page table entries size (since Linux 2.6.10).
ru: I<VmPTE>: Размер элементов страничной таблицы (начиная с Linux 2.6.10).

source: I<VmPMD>: Size of second-level page tables (added in Linux 4.0; removed in Linux 4.15).
ru: I<VmPMD>: Размер страничных таблиц второго уровня (добавлено в Linux 4.0; удалено в Linux 4.15).

source: I<VmSwap>: Swapped-out virtual memory size by anonymous private pages; shmem swap usage is not included (since Linux 2.6.34).
ru: I<VmSwap>: Размер виртуальной памяти выгружаемых анонимных частных страниц; подкачка shmem не учитывается (начиная с Linux 2.6.34).

source: I<HugetlbPages>: Size of hugetlb memory portions (since Linux 4.4).
ru: I<HugetlbPages>: Размер частей памяти hugetlb (начиная с Linux 4.4).

source: I<CoreDumping>: Contains the value 1 if the process is currently dumping core, and 0 if it is not (since Linux 4.15). This information can be used by a monitoring process to avoid killing a process that is currently dumping core, which could result in a corrupted core dump file.
ru: I<CoreDumping>: Содержит значение 1, если процесс выполняет создание дампа, и 0, если нет (начиная с Linux 4.15). Это можно использовать для слежения за процессом, чтобы случайно не завершить процесс, который выполняет дамп, что приведёт к повреждению файла дампа.

source: I<Threads>: Number of threads in process containing this thread.
ru: I<Threads>: Количество нитей в процессе, содержащем эту нить.

source: I<SigQ>: This field contains two slash-separated numbers that relate to queued signals for the real user ID of this process. The first of these is the number of currently queued signals for this real user ID, and the second is the resource limit on the number of queued signals for this process (see the description of B<RLIMIT_SIGPENDING> in B<getrlimit>(2)).
ru: I<SigQ>: В этом поле содержится два числа, разделённых косой чертой, которые относятся к сигналам, имеющимся в очереди для реального пользовательского ID этого процесса. Первое число показывает текущее количество сигналов в очереди для реального пользовательского ID, а второе — ограничитель ресурса на количество сигналов в очереди для этого процесса (смотрите описание B<RLIMIT_SIGPENDING> в B<getrlimit>(2)).

source: I<SigPnd>, I<ShdPnd>: Mask (expressed in hexadecimal) of signals pending for thread and for process as a whole (see B<pthreads>(7) and B<signal>(7)).
ru: I<SigPnd>, I<ShdPnd>: Маска (шестнадцатеричное число) сигналов, ждущих обработки нитью и всем процессом (смотрите B<pthreads>(7) и B<signal>(7)).

source: I<SigBlk>, I<SigIgn>, I<SigCgt>: Masks (expressed in hexadecimal) indicating signals being blocked, ignored, and caught (see B<signal>(7)).
ru: I<SigBlk>, I<SigIgn>, I<SigCgt>: Маски (шестнадцатеричное число), отражающие блокированные, игнорируемые и перехваченные сигналы (смотрите B<signal>(7)).

source: I<CapInh>, I<CapPrm>, I<CapEff>: Masks (expressed in hexadecimal) of capabilities enabled in inheritable, permitted, and effective sets (see B<capabilities>(7)).
ru: I<CapInh>, I<CapPrm>, I<CapEff>: Маски (шестнадцатеричное число) мандатов, включённые в наследуемый, разрешающий и эффективный наборы (смотрите B<capabilities>(7)).

source: I<CapBnd>: Capability bounding set, expressed in hexadecimal (since Linux 2.6.26, see B<capabilities>(7)).
ru: I<CapBnd>: Ограничивающий набор мандатов, выраженный шестнадцатеричным числом (начиная с Linux 2.6.26, смотрите B<capabilities>(7)).

source: I<CapAmb>: Ambient capability set, expressed in hexadecimal (since Linux 4.3, see B<capabilities>(7)).
ru: I<CapAmb>: Набор наружных мандатов, выраженный шестнадцатеричным числом (начиная с Linux 4.3, смотрите B<capabilities>(7)).

source: I<NoNewPrivs>: Value of the I<no_new_privs> bit (since Linux 4.10, see B<prctl>(2)).
ru: I<NoNewPrivs>: Значение бита I<no_new_privs> (начиная с Linux 4.10, смотрите B<prctl>(2)).

source: I<Seccomp>: Seccomp mode of the process (since Linux 3.8, see B<seccomp>(2)). 0 means B<SECCOMP_MODE_DISABLED>; 1 means B<SECCOMP_MODE_STRICT>; 2 means B<SECCOMP_MODE_FILTER>. This field is provided only if the kernel was built with the B<CONFIG_SECCOMP> kernel configuration option enabled.
ru: I<Seccomp>: Процесс в режиме seccomp (начиная с Linux 3.8, смотрите B<seccomp>(2)). Значение 0 означает B<SECCOMP_MODE_DISABLED>; 1 — B<SECCOMP_MODE_STRICT>; 2 — B<SECCOMP_MODE_FILTER>. Это поле существует только, если ядро собрано с включённым параметром сборки ядра B<CONFIG_SECCOMP>.

source: I<Speculation_Store_Bypass>: Speculation flaw mitigation state (since Linux 4.17, see B<prctl>(2)).
ru: I<Speculation_Store_Bypass>: Состояние ослабления нежелательной спекулятовности (начиная с Linux 4.17, смотрите B<prctl>(2)).

source: I<Cpus_allowed>: Hexadecimal mask of CPUs on which this process may run (since Linux 2.6.24, see B<cpuset>(7)).
ru: I<Cpus_allowed>: Шестнадцатеричная маска процессоров, на которых может выполняться процесс (начиная с Linux 2.6.24, смотрите B<cpuset>(7)).

source: I<Cpus_allowed_list>: Same as previous, but in "list format" (since Linux 2.6.26, see B<cpuset>(7)).
ru: I<Cpus_allowed_list>: Тоже что предыдущий, но в "формате списка" (начиная с Linux 2.6.26, см. B<cpuset>(7)).

source: I<Mems_allowed>: Mask of memory nodes allowed to this process (since Linux 2.6.24, see B<cpuset>(7)).
ru: I<Mems_allowed>: Маска узлов памяти, разрешённых для этого процесса (начиная с Linux 2.6.24, см. B<cpuset>(7)).

source: I<Mems_allowed_list>: Same as previous, but in "list format" (since Linux 2.6.26, see B<cpuset>(7)).
ru: I<Mems_allowed_list>: Тоже что и предыдущее, но в "формате списка" (начиная с Linux 2.6.26, см. B<cpuset>(7)).

source: I<voluntary_ctxt_switches>, I<nonvoluntary_ctxt_switches>: Number of voluntary and involuntary context switches (since Linux 2.6.23).
ru: I<voluntary_ctxt_switches>, I<nonvoluntary_ctxt_switches>: Количество намеренных и непреднамеренных переключений контекста (начиная с Linux 2.6.23).

source: I</proc/[pid]/syscall> (since Linux 2.6.27)
ru: I</proc/[pid]/syscall> (начиная с Linux 2.6.27)

source: This file exposes the system call number and argument registers for the system call currently being executed by the process, followed by the values of the stack pointer and program counter registers. The values of all six argument registers are exposed, although most system calls use fewer registers.
ru: Данный файл отражает аргументные регистры и номер системного вызова, который выполняется процессом; далее указаны значения регистров указателя стека и программного счётчика. Хотя большинство системных вызовов использует только несколько регистров, видны значения всех шести аргументных регистров.

source: If the process is blocked, but not in a system call, then the file displays -1 in place of the system call number, followed by just the values of the stack pointer and program counter. If process is not blocked, then the file contains just the string "running".
ru: Если процесс заблокирован не системным вызовом, то в файле содержится -1 на месте номера системного вызова, затем указаны только значения указателя стека и программного счётчика. Если процесс не заблокирован, то файл содержит строку «running».

source: This file is present only if the kernel was configured with B<CONFIG_HAVE_ARCH_TRACEHOOK>.
ru: Данный файл доступен только, если ядро собрано с параметром B<CONFIG_HAVE_ARCH_TRACEHOOK>.

source: I</proc/[pid]/task> (since Linux 2.6.0)
ru: I</proc/[pid]/task> (начиная с Linux 2.6.0)

source: This is a directory that contains one subdirectory for each thread in the process. The name of each subdirectory is the numerical thread ID (I<[tid]>) of the thread (see B<gettid>(2)).
ru: В этом каталоге содержатся подкаталоги, под одному на нить процесса. Имя подкаталога задаётся числом, которое является ID (I<[tid]>) нити (смотрите B<gettid>(2)).

source: Within each of these subdirectories, there is a set of files with the same names and contents as under the I</proc/[pid]> directories. For attributes that are shared by all threads, the contents for each of the files under the I<task/[tid]> subdirectories will be the same as in the corresponding file in the parent I</proc/[pid]> directory (e.g., in a multithreaded process, all of the I<task/[tid]/cwd> files will have the same value as the I</proc/[pid]/cwd> file in the parent directory, since all of the threads in a process share a working directory). For attributes that are distinct for each thread, the corresponding files under I<task/[tid]> may have different values (e.g., various fields in each of the I<task/[tid]/status> files may be different for each thread), or they might not exist in I</proc/[pid]> at all.
ru: В каждом подкаталоге есть набор файлов с одинаковыми именами и содержимым как у каталогов I</proc/[pid]>. Для общих атрибутов всех нитей содержимое каждого файла в подкаталогах I<task/[tid]> будет одинаковым, как у соответствующего файла в родительском каталоге I</proc/[pid]> (например, в многонитевом процессе все файлы I<task/[tid]/cwd> будут иметь одинаковое значение, совпадающее с содержимым файла I</proc/[pid]/cwd> в родительском каталоге, так как все нити в процессе используют общий рабочий каталог). Для отличающихся атрибутов нитей соответствующие файлы в I<task/[tid]> могут иметь различные значения (например, различные поля в каждом файле I<task/[tid]/status> могут отличаться в каждой нити) или вообще могут отсутствовать в I</proc/[pid]>.

source: In a multithreaded process, the contents of the I</proc/[pid]/task> directory are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
ru: В многонитевых процессах, содержимое каталога I</proc/[pid]/task> недоступно, если главная нить уже завершила работу (обычно при помощи вызова B<pthread_exit>(3)).

source: I</proc/[pid]/task/[tid]/children> (since Linux 3.5)
ru: I</proc/[pid]/task/[tid]/children> (начиная с Linux 3.5)

source: A space-separated list of child tasks of this task. Each child task is represented by its TID.
ru: Разделённый пробелами список задач-потомков данной задачи. Каждая задача-потомок представлена своим TID.

source: This option is intended for use by the checkpoint-restore (CRIU) system, and reliably provides a list of children only if all of the child processes are stopped or frozen. It does not work properly if children of the target task exit while the file is being read! Exiting children may cause non-exiting children to be omitted from the list. This makes this interface even more unreliable than classic PID-based approaches if the inspected task and its children aren't frozen, and most code should probably not use this interface.
ru: Этот параметр предназначен для использования системой восстановления из контрольных точек (CRIU) и предоставляет достоверный список потомков, только если дочерние процессы остановлены или заморожены. Он не работает правильно, если потомки целевой задачи завершаются во время чтения файла! Завершающиеся потомки могут привести к пропаже из списка не завершившихся потомков. Это делает данный интерфейс ещё более ненадёжным чем классический на основе PID, если просматриваемая задача и её потомки не заморожены, и вероятно, в большинстве программ лучше не использовать данный интерфейс.

source: Until Linux 4.2, the presence of this file was governed by the B<CONFIG_CHECKPOINT_RESTORE> kernel configuration option. Since Linux 4.2, it is governed by the B<CONFIG_PROC_CHILDREN> option.
ru: До Linux 4.2 наличие этого файла управлялось параметром настройки ядра B<CONFIG_CHECKPOINT_RESTORE>. Начиная с Linux 4.2, он управляется параметром B<CONFIG_PROC_CHILDREN>.

source: I</proc/[pid]/timers> (since Linux 3.10)
ru: I</proc/[pid]/timers> (начиная с Linux 3.10)

source: A list of the POSIX timers for this process. Each timer is listed with a line that starts with the string "ID:". For example:
ru: Список таймеров POSIX этого процесса. Каждый таймер описывается в строке, которая начинается со строки «ID:». Пример:

source: The lines shown for each timer have the following meanings:
ru: Строки каждого таймера имеют следующее значение:
