Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: 0 - KPF_LOCKED 1 - KPF_ERROR 2 - KPF_REFERENCED 3 - KPF_UPTODATE 4 - KPF_DIRTY 5 - KPF_LRU 6 - KPF_ACTIVE 7 - KPF_SLAB 8 - KPF_WRITEBACK 9 - KPF_RECLAIM 10 - KPF_BUDDY 11 - KPF_MMAP (since Linux 2.6.31) 12 - KPF_ANON (since Linux 2.6.31) 13 - KPF_SWAPCACHE (since Linux 2.6.31) 14 - KPF_SWAPBACKED (since Linux 2.6.31) 15 - KPF_COMPOUND_HEAD (since Linux 2.6.31) 16 - KPF_COMPOUND_TAIL (since Linux 2.6.31) 17 - KPF_HUGE (since Linux 2.6.31) 18 - KPF_UNEVICTABLE (since Linux 2.6.31) 19 - KPF_HWPOISON (since Linux 2.6.31) 20 - KPF_NOPAGE (since Linux 2.6.31) 21 - KPF_KSM (since Linux 2.6.32) 22 - KPF_THP (since Linux 3.4) 23 - KPF_BALLOON (since Linux 3.18) 24 - KPF_ZERO_PAGE (since Linux 4.0) 25 - KPF_IDLE (since Linux 4.3)
ru: 0 - KPF_LOCKED 1 - KPF_ERROR 2 - KPF_REFERENCED 3 - KPF_UPTODATE 4 - KPF_DIRTY 5 - KPF_LRU 6 - KPF_ACTIVE 7 - KPF_SLAB 8 - KPF_WRITEBACK 9 - KPF_RECLAIM 10 - KPF_BUDDY 11 - KPF_MMAP (начиная с Linux 2.6.31) 12 - KPF_ANON (начиная с Linux 2.6.31) 13 - KPF_SWAPCACHE (начиная с Linux 2.6.31) 14 - KPF_SWAPBACKED (начиная с Linux 2.6.31) 15 - KPF_COMPOUND_HEAD (начиная с Linux 2.6.31) 16 - KPF_COMPOUND_TAIL (начиная с Linux 2.6.31) 17 - KPF_HUGE (начиная с Linux 2.6.31) 18 - KPF_UNEVICTABLE (начиная с Linux 2.6.31) 19 - KPF_HWPOISON (начиная с Linux 2.6.31) 20 - KPF_NOPAGE (начиная с Linux 2.6.31) 21 - KPF_KSM (начиная с Linux 2.6.32) 22 - KPF_THP (начиная с Linux 3.4) 23 - KPF_BALLOON (начиная с Linux 3.18) 24 - KPF_ZERO_PAGE (начиная с Linux 4.0) 25 - KPF_IDLE (начиная с Linux 4.3)

source: For further details on the meanings of these bits, see the kernel source file I<Documentation/admin-guide/mm/pagemap.rst>. Before kernel 2.6.29, B<KPF_WRITEBACK>, B<KPF_RECLAIM>, B<KPF_BUDDY>, and B<KPF_LOCKED> did not report correctly.
ru: Информацию по отдельным битам смотрите в файле исходного кода ядра I<Documentation/admin-guide/mm/pagemap.rst>. До версии ядра 2.6.29, биты B<KPF_WRITEBACK>, B<KPF_RECLAIM>, B<KPF_BUDDY> и B<KPF_LOCKED> показывались некорректно.

source: The I</proc/kpageflags> file is present only if the B<CONFIG_PROC_PAGE_MONITOR> kernel configuration option is enabled.
ru: Файл I</proc/kpageflags> существует только, если включён параметр настройки ядра B<CONFIG_PROC_PAGE_MONITOR>.

source: See I</proc/kallsyms>.
ru: Смотрите I</proc/kallsyms>.

source: The first three fields in this file are load average figures giving the number of jobs in the run queue (state R) or waiting for disk I/O (state D) averaged over 1, 5, and 15 minutes. They are the same as the load average numbers given by B<uptime>(1) and other programs. The fourth field consists of two numbers separated by a slash (/). The first of these is the number of currently runnable kernel scheduling entities (processes, threads). The value after the slash is the number of kernel scheduling entities that currently exist on the system. The fifth field is the PID of the process that was most recently created on the system.
ru: Первые три поля в этом файле содержат параметры средней загрузки, которые предоставляют собой количество заданий в очереди выполнения (состояние R) или ожидают дискового ввода-вывода (состояние D) в среднем за 1, 5 и 15 минут. Это то же самое, что и средняя загрузка, которую выдаёт B<uptime>(1) и другие программы. Четвёртое поле состоит из двух чисел, разделённых косой чертой (/). Первое из них показывает количество исполняемых планируемых ядерных элементов в данный момент (процессы, нити). Значение после косой черты показывает количество планируемых ядерных элементов, существующих в системе. В пятом поле содержится PID процесса, который был создан системой последним.

source: This file shows current file locks (B<flock>(2) and B<fcntl>(2)) and leases (B<fcntl>(2)).
ru: Этот файл показывает текущие файловые блокировки (B<flock>(2) и B<fcntl>(2)) параметры (B<fcntl>(2)).

source: An example of the content shown in this file is the following:
ru: Пример содержимого этого файла:

source: The fields shown in each line are as follows:
ru: Поля каждой строки имеют следующее назначение:

source: The ordinal position of the lock in the list.
ru: Порядковая позиция блокировки в списке.

source: The lock type. Values that may appear here include:
ru: Тип блокировки. Возможные значения:

source: This is a BSD file lock created using B<flock>(2).
ru: Файловая блокировка BSD, созданная B<flock>(2).

source: This is an open file description (OFD) lock created using B<fcntl>(2).
ru: Блокировка открытого файлового описания (OFD), созданная B<fcntl>(2).

source: This is a POSIX byte-range lock created using B<fcntl>(2).
ru: Блокировка байтового диапазона POSIX, созданная B<fcntl>(2).

source: Among the strings that can appear here are the following:
ru: Здесь могут появляться следующие строки:

source: This is an advisory lock.
ru: Консультативная блокировка.

source: This is a mandatory lock.
ru: Обязательная блокировка.

source: The type of lock. Values that can appear here are:
ru: Тип блокировки. Возможные значения:

source: This is a POSIX or OFD read lock, or a BSD shared lock.
ru: Блокировка POSIX или OFD на чтение или общая блокировка BSD.

source: This is a POSIX or OFD write lock, or a BSD exclusive lock.
ru: Блокировка POSIX или OFD на запись или исключительная блокировка BSD.

source: The PID of the process that owns the lock.
ru: PID процесса, которому принадлежит блокировка.

source: Because OFD locks are not owned by a single process (since multiple processes may have file descriptors that refer to the same open file description), the value -1 is displayed in this field for OFD locks. (Before kernel 4.14, a bug meant that the PID of the process that initially acquired the lock was displayed instead of the value -1.)
ru: Так как блокировки OFD принадлежат не одному процессу (так как несколько процессов могут иметь файловые дескрипторы, которые указывают на одно открытое файловое описание), для блокировок OFD в этом поле показывается значение -1 (до ядра 4.14 вместо значения -1 показывался PID процесса, который первым захватил блокировку).

source: Three colon-separated subfields that identify the major and minor device ID of the device containing the filesystem where the locked file resides, followed by the inode number of the locked file.
ru: Три разделённых двоеточием значения: старший и младший идентификаторы устройства, содержащего файловую систему, в которой расположен заблокированный файл, и номер иноды заблокированного файла.

source: The byte offset of the first byte of the lock. For BSD locks, this value is always 0.
ru: Байтовое смещение первого байта блокировки. Для блокировок BSD это значение всегда равно 0.

source: The byte offset of the last byte of the lock. B<EOF> in this field means that the lock extends to the end of the file. For BSD locks, the value shown is always I<EOF>.
ru: Байтовое смещение последнего байта блокировки. Значение B<EOF> в этом поле означает, что блокировка распространяется до конца файла. Для блокировок BSD это значение всегда равно I<EOF>.

source: Since Linux 4.9, the list of locks shown in I</proc/locks> is filtered to show just the locks for the processes in the PID namespace (see B<pid_namespaces>(7)) for which the I</proc> filesystem was mounted. (In the initial PID namespace, there is no filtering of the records shown in this file.)
ru: Начиная с Linux 4.9, список блокировок, показываемых в I</proc/locks>, фильтруется: показываются только блокировки процессов в пространстве имён PID (смотрите B<pid_namespaces>(7)), для которых была смонтирована файловая система I</proc> (в начальном пространстве имён PID записи этого файла не фильтруются).

source: The B<lslocks>(8) command provides a bit more information about each lock.
ru: Команда B<lslocks>(8) выводит больше информации о каждой блокировке.

source: I</proc/malloc> (only up to and including Linux 2.2)
ru: I</proc/malloc> (только до Linux 2.2 включительно)

source: This file is present only if B<CONFIG_DEBUG_MALLOC> was defined during compilation.
ru: Данный файл существует только, если ядро собрано с поддержкой B<CONFIG_DEBUG_MALLOC>.

source: This file reports statistics about memory usage on the system. It is used by B<free>(1) to report the amount of free and used memory (both physical and swap) on the system as well as the shared memory and buffers used by the kernel. Each line of the file consists of a parameter name, followed by a colon, the value of the parameter, and an option unit of measurement (e.g., "kB"). The list below describes the parameter names and the format specifier required to read the field value. Except as noted below, all of the fields have been present since at least Linux 2.6.0. Some fields are displayed only if the kernel was configured with various options; those dependencies are noted in the list.
ru: Этот файл содержит статистику по использованию памяти системы. Он используется программой B<free>(1) для формирования отчёта о свободной и используемой памяти (как физической, так и подкачки), а также общей памяти и памяти под буферы, которую использует ядро. В каждой строке файла содержится имя параметра, двоеточие, значение параметра и необязательная единица измерения (например, «kB»). В списке далее описываются параметры и определитель формата, требуемый для чтения значения поля. За исключением замечаний, представленных ниже, все показанные поля имеются начиная с Linux 2.6.0. Некоторые поля появляются только, если ядро собрано с определёнными параметрами; это зависимости также показаны в списке.

source: Total usable RAM (i.e., physical RAM minus a few reserved bits and the kernel binary code).
ru: Общее количество используемой RAM (т.е. физической RAM минус несколько зарезервированных бит и исполняемый код ядра).

source: The sum of I<LowFree>+I<HighFree>.
ru: Сумма I<LowFree>+I<HighFree>.

source: I<MemAvailable> %lu (since Linux 3.14)
ru: I<MemAvailable> %lu (начиная с Linux 3.14)

source: An estimate of how much memory is available for starting new applications, without swapping.
ru: Предполагаемое количество памяти, доступное для запуска новых приложений, без обращения к подкачке.

source: Relatively temporary storage for raw disk blocks that shouldn't get tremendously large (20MB or so).
ru: Относительно временное хранилище сырых дисковых блоков, которое не должно быть очень велико (порядка 20МБ).

source: In-memory cache for files read from the disk (the page cache). Doesn't include I<SwapCached>.
ru: Кэш в памяти для прочитанных дисковых файлов (страничный кэш). Не включает I<SwapCached>.

source: Memory that once was swapped out, is swapped back in but still also is in the swap file. (If memory pressure is high, these pages don't need to be swapped out again because they are already in the swap file. This saves I/O.)
ru: Память, которая однажды попала в подкачку, выгрузилась обратно в память, но всё равно остаётся в файле подкачки (если нагрузка на память велика, эти страницы не придётся снова выгружать, так как они уже в файле подкачки — предотвращается ввод-вывод).

source: Memory that has been used more recently and usually not reclaimed unless absolutely necessary.
ru: Память, которая часто использовалась и обычно не высвобождается без сильной необходимости.

source: Memory which has been less recently used. It is more eligible to be reclaimed for other purposes.
ru: Память, которая редко использовалась. Кандидат на высвобождение для других нужд.

source: I<Active(anon)> %lu (since Linux 2.6.28)
ru: I<Active(anon)> %lu (начиная с Linux 2.6.28)

source: I<Inactive(anon)> %lu (since Linux 2.6.28)
ru: I<Inactive(anon)> %lu (начиная с Linux 2.6.28)

source: I<Active(file)> %lu (since Linux 2.6.28)
ru: I<Active(file)> %lu (начиная с Linux 2.6.28)

source: I<Inactive(file)> %lu (since Linux 2.6.28)
ru: I<Inactive(file)> %lu (начиная с Linux 2.6.28)

source: I<Unevictable> %lu (since Linux 2.6.28)
ru: I<Unevictable> %lu (начиная с Linux 2.6.28)

source: (From Linux 2.6.28 to 2.6.30, B<CONFIG_UNEVICTABLE_LRU> was required.) [To be documented.]
ru: (В Linux с версии 2.6.28 по 2.6.30, требовался параметр B<CONFIG_UNEVICTABLE_LRU>.) [Будет описано.]

source: I<Mlocked> %lu (since Linux 2.6.28)
ru: I<Mlocked> %lu (начиная с Linux 2.6.28)

source: (Starting with Linux 2.6.19, B<CONFIG_HIGHMEM> is required.) Total amount of highmem. Highmem is all memory above ~860MB of physical memory. Highmem areas are for use by user-space programs, or for the page cache. The kernel must use tricks to access this memory, making it slower to access than lowmem.
ru: (Начиная с Linux 2.6.19, требуется параметр B<CONFIG_HIGHMEM>.) Общее количество highmem. Highmem — это вся память выше ~860МБ физической памяти. Области highmem используются программами пользовательского пространства или страничным кэшем. Ядро должно применять специальные методы для получения доступа к этой памяти, что делает её более медленной по сравнению с lowmem.

source: (Starting with Linux 2.6.19, B<CONFIG_HIGHMEM> is required.) Amount of free highmem.
ru: (Начиная с Linux 2.6.19, требуется параметр B<CONFIG_HIGHMEM>.) Количество свободной highmem.

source: (Starting with Linux 2.6.19, B<CONFIG_HIGHMEM> is required.) Total amount of lowmem. Lowmem is memory which can be used for everything that highmem can be used for, but it is also available for the kernel's use for its own data structures. Among many other things, it is where everything from I<Slab> is allocated. Bad things happen when you're out of lowmem.
ru: (Начиная с Linux 2.6.19, требуется параметр B<CONFIG_HIGHMEM>.) Общее количество lowmem. Lowmem — это память, используемая для всего, что и highmem, но также доступна и для структур ядра. Среди прочего, выделяется для I<Slab>. Когда заканчивается lowmem происходят нехорошие вещи.

source: (Starting with Linux 2.6.19, B<CONFIG_HIGHMEM> is required.) Amount of free lowmem.
ru: (Начиная с Linux 2.6.19, требуется параметр B<CONFIG_HIGHMEM>.) Количество свободной lowmem.

source: I<MmapCopy> %lu (since Linux 2.6.29)
ru: I<MmapCopy> %lu (начиная с Linux 2.6.29)

source: (B<CONFIG_MMU> is required.) [To be documented.]
ru: (Требуется параметр B<CONFIG_MMU>.) [Будет описано.]

source: Total amount of swap space available.
ru: Общее количество доступного пространства подкачки.

source: Amount of swap space that is currently unused.
ru: Общее количество неиспользуемого пространства подкачки.

source: Memory which is waiting to get written back to the disk.
ru: Память, которая ждёт записи обратно на диск.

source: Memory which is actively being written back to the disk.
ru: Память, которая переписывается обратно на диск.

source: I<AnonPages> %lu (since Linux 2.6.18)
ru: I<AnonPages> %lu (начиная с Linux 2.6.18)

source: Non-file backed pages mapped into user-space page tables.
ru: Не файловые фоновые (backed) страницы, отображённые в страничные таблицы пользовательского пространства.

source: Files which have been mapped into memory (with B<mmap>(2)), such as libraries.
ru: Отображённые в память файлы (с помощью B<mmap>(2)), например библиотеки.

source: I<Shmem> %lu (since Linux 2.6.32)
ru: I<Shmem> %lu (начиная с Linux 2.6.32)

source: Amount of memory consumed in B<tmpfs>(5) filesystems.
ru: Объём памяти, использованной в файловых системах B<tmpfs>(5).

source: I<KReclaimable> %lu (since Linux 4.20)
ru: I<KReclaimable> %lu (начиная с Linux 4.20)

source: Kernel allocations that the kernel will attempt to reclaim under memory pressure. Includes I<SReclaimable> (below), and other direct allocations with a shrinker.
ru: Выделения ядра, которые оно будет пытаться отозвать при нехватки памяти. Включают I<SReclaimable> (смотрите ниже) и другие непосредственные выделения сокращателя (shrinker).

source: In-kernel data structures cache. (See B<slabinfo>(5).)
ru: Кэш ядерных структур данных (смотрите B<slabinfo>(5)).

source: I<SReclaimable> %lu (since Linux 2.6.19)
ru: I<SReclaimable> %lu (начиная с Linux 2.6.19)

source: Part of I<Slab>, that might be reclaimed, such as caches.
ru: Часть I<Slab>, которая может быть высвобождена, например кэши.

source: I<SUnreclaim> %lu (since Linux 2.6.19)
ru: I<SUnreclaim> %lu (начиная с Linux 2.6.19)

source: Part of I<Slab>, that cannot be reclaimed on memory pressure.
ru: Часть I<Slab>, которая не может быть высвобождена при нехватке памяти.

source: I<KernelStack> %lu (since Linux 2.6.32)
ru: I<KernelStack> %lu (начиная с Linux 2.6.32)

source: Amount of memory allocated to kernel stacks.
ru: Количество памяти, выделенное под стеки ядра.

source: I<PageTables> %lu (since Linux 2.6.18)
ru: I<PageTables> %lu (начиная с Linux 2.6.18)

source: Amount of memory dedicated to the lowest level of page tables.
ru: Количество памяти, выделенное под страничные таблицы на самом нижнем уровне.

source: I<Quicklists> %lu (since Linux 2.6.27)
ru: I<Quicklists> %lu (начиная с Linux 2.6.27)

source: (B<CONFIG_QUICKLIST> is required.) [To be documented.]
ru: (Требуется параметр B<CONFIG_QUICKLIST>.) [Будет описано.]

source: I<NFS_Unstable> %lu (since Linux 2.6.18)
ru: I<NFS_Unstable> %lu (начиная с Linux 2.6.18)

source: NFS pages sent to the server, but not yet committed to stable storage.
ru: Страницы NFS, полученные сервером, но ещё не записанные в стабильное хранилище.

source: I<Bounce> %lu (since Linux 2.6.18)
ru: I<Bounce> %lu (начиная с Linux 2.6.18)

source: Memory used for block device "bounce buffers".
ru: Память, используемая для блочного устройства «bounce buffers».

source: I<WritebackTmp> %lu (since Linux 2.6.26)
ru: I<WritebackTmp> %lu (начиная с Linux 2.6.26)

source: Memory used by FUSE for temporary writeback buffers.
ru: Память, используемая FUSE для временных буферов обратной записи.

source: I<CommitLimit> %lu (since Linux 2.6.10)
ru: I<CommitLimit> %lu (начиная с Linux 2.6.10)

source: This is the total amount of memory currently available to be allocated on the system, expressed in kilobytes. This limit is adhered to only if strict overcommit accounting is enabled (mode 2 in I</proc/sys/vm/overcommit_memory>). The limit is calculated according to the formula described under I</proc/sys/vm/overcommit_memory>. For further details, see the kernel source file I<Documentation/vm/overcommit-accounting.rst>.
ru: Общее количество памяти, доступное в данный момент в системе для выделения, выражается в байтах. Данное ограничение соблюдается только, если включён жёсткий учёт перерасчёта (strict overcommit accounting) (режим 2 в I</proc/sys/vm/overcommit_memory>). Ограничение вычисляется по формуле, описанной в разделе про I</proc/sys/vm/overcommit_memory>. Подробности смотрите в файле исходного кода ядра I<Documentation/vm/overcommit-accounting.rst>.

source: The amount of memory presently allocated on the system. The committed memory is a sum of all of the memory which has been allocated by processes, even if it has not been "used" by them as of yet. A process which allocates 1GB of memory (using B<malloc>(3) or similar), but touches only 300MB of that memory will show up as using only 300MB of memory even if it has the address space allocated for the entire 1GB.
ru: Количество памяти, распределённое в системе в данный момент. Задействованная память (committed memory) — это сумма всей памяти, распределённая среди всех процессов, даже если она ими ещё не «используется». Для процесса, взявшего 1ГБ памяти (например, с помощью B<malloc>(3)), но задействовавшего только 300МБ этой памяти, будет показано что используются только 300МБ, даже если ему отдано адресное пространство 1ГБ.

source: This 1GB is memory which has been "committed" to by the VM and can be used at any time by the allocating application. With strict overcommit enabled on the system (mode 2 in I</proc/sys/vm/overcommit_memory>), allocations which would exceed the I<CommitLimit> will not be permitted. This is useful if one needs to guarantee that processes will not fail due to lack of memory once that memory has been successfully allocated.
ru: Этот 1ГБ памяти «задействован» VM и может быть использован запросившим приложением в любое время. При включённом режиме жёсткого учёта перерасхода (режим 2 в I</proc/sys/vm/overcommit_memory>), запросы, которые превысили бы I<CommitLimit> (подробности выше), выполнены не будут. Это полезно, если нужно гарантировать, что процессы не завершатся из-за нехватки памяти после того, как память им будет успешно выделена.

source: Total size of vmalloc memory area.
ru: Общий размер области памяти vmalloc.

source: Amount of vmalloc area which is used. Since Linux 4.4, this field is no longer calculated, and is hard coded as 0. See I</proc/vmallocinfo>.
ru: Размер используемой области vmalloc. Начиная с Linux 4.4 это поле не вычисляется и всегда равно 0. Смотрите I</proc/vmallocinfo>.

source: Largest contiguous block of vmalloc area which is free. Since Linux 4.4, this field is no longer calculated and is hard coded as 0. See I</proc/vmallocinfo>.
ru: Самый большой свободный непрерывный блок области vmalloc. Начиная с Linux 4.4 это поле не вычисляется и всегда равно 0. Смотрите I</proc/vmallocinfo>.

source: I<HardwareCorrupted> %lu (since Linux 2.6.32)
ru: I<HardwareCorrupted> %lu (начиная с Linux 2.6.32)

source: (B<CONFIG_MEMORY_FAILURE> is required.) [To be documented.]
ru: (Требуется параметр B<CONFIG_MEMORY_FAILURE>.) [Будет описано.]

source: I<LazyFree> %lu (since Linux 4.12)
ru: I<LazyFree> %lu (начиная с Linux 4.12)

source: Shows the amount of memory marked by B<madvise>(2) B<MADV_FREE>.
ru: Отражает количество памяти, помеченной вызовом B<madvise>(2) B<MADV_FREE>.

source: I<AnonHugePages> %lu (since Linux 2.6.38)
ru: I<AnonHugePages> %lu (начиная с Linux 2.6.38)

source: (B<CONFIG_TRANSPARENT_HUGEPAGE> is required.) Non-file backed huge pages mapped into user-space page tables.
ru: (Требуется параметр B<CONFIG_TRANSPARENT_HUGEPAGE>.) Не файловые фоновые огромные страницы, отображённые в страничные таблицы пользовательского пространства.

source: I<ShmemHugePages> %lu (since Linux 4.8)
ru: I<ShmemHugePages> %lu (начиная с Linux 4.8)

source: (B<CONFIG_TRANSPARENT_HUGEPAGE> is required.) Memory used by shared memory (shmem) and B<tmpfs>(5) allocated with huge pages
ru: (требуется B<CONFIG_TRANSPARENT_HUGEPAGE>) Память, используемая для выделения огромных страниц под общую память (shmem) и B<tmpfs>(5).

source: I<ShmemPmdMapped> %lu (since Linux 4.8)
ru: I<ShmemPmdMapped> %lu (начиная с Linux 4.8)

source: (B<CONFIG_TRANSPARENT_HUGEPAGE> is required.) Shared memory mapped into user space with huge pages.
ru: (Требуется B<CONFIG_TRANSPARENT_HUGEPAGE>.) Общая память, отображённая в пользовательское пространство огромными страницами.

source: I<CmaTotal> %lu (since Linux 3.1)
ru: I<CmaTotal> %lu (начиная с Linux 3.1)

source: Total CMA (Contiguous Memory Allocator) pages. (B<CONFIG_CMA> is required.)
ru: (Требуется B<CONFIG_CMA>.) Общее количество страниц CMA (выделитель непрерывной памяти).

source: I<CmaFree> %lu (since Linux 3.1)
ru: I<CmaFree> %lu (начиная с Linux 3.1)

source: Free CMA (Contiguous Memory Allocator) pages. (B<CONFIG_CMA> is required.)
ru: (Требуется B<CONFIG_CMA>.) Количество свободных страниц CMA (выделитель непрерывной памяти).

source: (B<CONFIG_HUGETLB_PAGE> is required.) The size of the pool of huge pages.
ru: (Требуется параметр B<CONFIG_HUGETLB_PAGE>.) Размер пула огромных страниц.

source: (B<CONFIG_HUGETLB_PAGE> is required.) The number of huge pages in the pool that are not yet allocated.
ru: (Требуется параметр B<CONFIG_HUGETLB_PAGE>.) Количество нераспределённых огромных страниц в пуле.

source: I<HugePages_Rsvd> %lu (since Linux 2.6.17)
ru: I<HugePages_Rsvd> %lu (начиная с Linux 2.6.17)
