Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: I</proc/self/fd/N> is approximately the same as I</dev/fd/N> in some UNIX and UNIX-like systems. Most Linux MAKEDEV scripts symbolically link I</dev/fd> to I</proc/self/fd>, in fact.
ru: I</proc/self/fd/N> \(em это примерно то же, что и I</dev/fd/N> на некоторых системах UNIX и подобных им. Фактически, большинство сценариев MAKEDEV в Linux создают символьную ссылку с именем I</dev/fd> на файл I</proc/self/fd>.

source: Most systems provide symbolic links I</dev/stdin>, I</dev/stdout>, and I</dev/stderr>, which respectively link to the files I<0>, I<1>, and I<2> in I</proc/self/fd>. Thus the example command above could be written as:
ru: Большинство систем предоставляют символьные ссылки I</dev/stdin>, I</dev/stdout> и I</dev/stderr>, которые соответствуют ссылкам на файлы I<0>, I<1> и I<2> в I</proc/self/fd>. Так, пример указанной выше команды может быть переписан в следующем виде:

source: Permission to dereference or read (B<readlink>(2)) the symbolic links in this directory is governed by a ptrace access mode B<PTRACE_MODE_READ_FSCREDS> check; see B<ptrace>(2).
ru: Право разыменовывать или читать (B<readlink>(2)) символические ссылки в этом каталоге определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_FSCREDS>; смотрите B<ptrace>(2).

source: Note that for file descriptors referring to inodes (pipes and sockets, see above), those inodes still have permission bits and ownership information distinct from those of the I</proc/[pid]/fd> entry, and that the owner may differ from the user and group IDs of the process. An unprivileged process may lack permissions to open them, as in this example:
ru: Заметим, что для файловых дескрипторов, указывающих на иноды (каналы и сокеты, смотрите выше), эти иноды по-прежнему имеют биты прав и информация о владельце отличается от имеющейся у I</proc/[pid]/fd> и этот владелец может отличаться от идентификатора пользователя и группы процесса. Непривилегированный процесс может не иметь прав на их открытие, как в этом примере:

source: File descriptor 0 refers to the pipe created by the shell and owned by that shell's user, which is not I<nobody>, so B<cat> does not have permission to create a new file descriptor to read from that inode, even though it can still read from its existing file descriptor 0.
ru: Файловый дескриптор 0 указывает на канал, созданный оболочкой и принадлежащий владельцу оболочки, не I<nobody>, поэтому у программы B<cat> нет прав на создание нового файлового дескриптора для чтения из этой иноды, хотя при этом она всё-таки может читать из существующего файлового дескриптора 0.

source: I</proc/[pid]/fdinfo/> (since Linux 2.6.22)
ru: I</proc/[pid]/fdinfo/> (начиная с Linux 2.6.22)

source: This is a subdirectory containing one entry for each file which the process has open, named by its file descriptor. The files in this directory are readable only by the owner of the process. The contents of each file can be read to obtain information about the corresponding file descriptor. The content depends on the type of file referred to by the corresponding file descriptor.
ru: Этот подкаталог содержит один элемент на каждый файл, который открыл процесс, именем файла будет номер его файлового дескриптора. Файлы в этом каталоге доступны на чтение только владельцу процесса. Содержимое каждого файла может быть прочитано для получения информации о соответствующем файловом дескрипторе. Содержимое зависит от типа файла, на который ссылается соответствующий файловый дескриптор.

source: For regular files and directories, we see something like:
ru: Для обычных файлов и каталогов содержимым будет, что-то типа:

source: The fields are as follows:
ru: Поля:

source: This is a decimal number showing the file offset.
ru: Это десятичное число отражает смещение файла.

source: This is an octal number that displays the file access mode and file status flags (see B<open>(2)). If the close-on-exec file descriptor flag is set, then I<flags> will also include the value B<O_CLOEXEC>.
ru: Это восьмеричное число отражает режим доступа к файлу и флаги состояния файла (смотрите B<open>(2)). Если установлен флаг файлового дескриптора close-on-exec, то I<flags> также содержат значение B<O_CLOEXEC>.

source: Before Linux 3.1, this field incorrectly displayed the setting of B<O_CLOEXEC> at the time the file was opened, rather than the current setting of the close-on-exec flag.
ru: До Linux 3.1 в этом поле некорректно показывалось значение B<O_CLOEXEC> верное на момент открытия файла, а не текущее значение флага close-on-exec.

source: This field, present since Linux 3.15, is the ID of the mount point containing this file. See the description of I</proc/[pid]/mountinfo>.
ru: Это поле, появившееся в Linux 3.15, содержит ID точки монтирования, в которой содержится данный файл. Смотрите описание I</proc/[pid]/mountinfo>.

source: For eventfd file descriptors (see B<eventfd>(2)), we see (since Linux 3.8) the following fields:
ru: Для файловых дескрипторов eventfd (смотрите B<eventfd>(2)) мы увидим (начиная с Linux 3.8) следующие поля:

source: I<eventfd-count> is the current value of the eventfd counter, in hexadecimal.
ru: В I<eventfd-count> содержится текущее значение счётчика eventfd counter (в виде шестнадцатеричного числа).

source: For epoll file descriptors (see B<epoll>(7)), we see (since Linux 3.8) the following fields:
ru: Для файловых дескрипторов epoll (смотрите B<epoll>(7)) мы увидим (начиная с Linux 3.8) следующие поля:

source: Each of the lines beginning I<tfd> describes one of the file descriptors being monitored via the epoll file descriptor (see B<epoll_ctl>(2) for some details). The I<tfd> field is the number of the file descriptor. The I<events> field is a hexadecimal mask of the events being monitored for this file descriptor. The I<data> field is the data value associated with this file descriptor.
ru: Каждая строка, начинающаяся с I<tfd>, описывает один из файловых дескрипторов, который отслеживается через файловый дескриптор epoll (подробности смотрите в B<epoll_ctl>(2)). Поле I<tfd> содержит номер файлового дескриптора. Поле I<events> представляет собой шестнадцатеричную маску событий, которые отслеживаются для этого файлового дескриптора. Поле I<data> содержит данные, связанные с этим файловым дескриптором.

source: For signalfd file descriptors (see B<signalfd>(2)), we see (since Linux 3.8) the following fields:
ru: Для файловых дескрипторов signalfd (смотрите B<signalfd>(2)) мы увидим (начиная с Linux 3.8) следующие поля:

source: I<sigmask> is the hexadecimal mask of signals that are accepted via this signalfd file descriptor. (In this example, bits 2 and 3 are set, corresponding to the signals B<SIGINT> and B<SIGQUIT>; see B<signal>(7).)
ru: В I<sigmask> содержится шестнадцатеричная маска сигналов, которые принимаются через этот файловый дескриптор signalfd (в этом примере биты 2 и 3 установлены, что соответствует сигналам B<SIGINT> и B<SIGQUIT>; смотрите B<signal>(7)).

source: For inotify file descriptors (see B<inotify>(7)), we see (since Linux 3.8) the following fields:
ru: Для файловых дескрипторов inotify (смотрите B<inotify>(7)) мы увидим (начиная с Linux 3.8) следующие поля:

source: Each of the lines beginning with "inotify" displays information about one file or directory that is being monitored. The fields in this line are as follows:
ru: Каждая из строк, начинающаяся с «inotify», содержит информацию об одном отслеживаемом файле или каталоге. Поля в этой строке:

source: A watch descriptor number (in decimal).
ru: Отслеживаемый номер файлового дескриптора (десятичное число).

source: The inode number of the target file (in hexadecimal).
ru: Номер иноды целевого файла (шестнадцатеричное число).

source: The ID of the device where the target file resides (in hexadecimal).
ru: Идентификатор устройства, содержащего целевой файл (шестнадцатеричное число).

source: The mask of events being monitored for the target file (in hexadecimal).
ru: Маска отслеживаемых событий для целевого файла (шестнадцатеричное число).

source: If the kernel was built with exportfs support, the path to the target file is exposed as a file handle, via three hexadecimal fields: I<fhandle-bytes>, I<fhandle-type>, and I<f_handle>.
ru: Если ядро собрано с поддержкой exportfs, то путь целевого файла представляется в виде описателя (handle) файла, выраженного тремя шестнадцатеричными полями: I<fhandle-bytes>, I<fhandle-type> и I<f_handle>.

source: For fanotify file descriptors (see B<fanotify>(7)), we see (since Linux 3.8) the following fields:
ru: Для файловых дескрипторов fanotify (смотрите B<fanotify>(7)) мы увидим (начиная с Linux 3.8) следующие поля:

source: The fourth line displays information defined when the fanotify group was created via B<fanotify_init>(2):
ru: В четвёртой строке содержится информация, определяющая когда была создана с помощью B<fanotify_init>(2) группа fanotify:

source: The I<flags> argument given to B<fanotify_init>(2) (expressed in hexadecimal).
ru: Аргумент I<flags>, переданный B<fanotify_init>(2) (шестнадцатеричное число).

source: The I<event_f_flags> argument given to B<fanotify_init>(2) (expressed in hexadecimal).
ru: Аргумент I<event_f_flags>, переданный B<fanotify_init>(2) (шестнадцатеричное число).

source: Each additional line shown in the file contains information about one of the marks in the fanotify group. Most of these fields are as for inotify, except:
ru: В каждой дополнительной строке файла содержится информация об одной из меток в группе fanotify. Большинство полей аналогичны с inotify, за исключением:

source: The flags associated with the mark (expressed in hexadecimal).
ru: Флаги, связанные с меткой (шестнадцатеричное число).

source: The events mask for this mark (expressed in hexadecimal).
ru: Маска событий, связанная с этой меткой (шестнадцатеричное число).

source: The mask of events that are ignored for this mark (expressed in hexadecimal).
ru: Маска событий, которые игнорируются для этой метки (шестнадцатеричное число).

source: For details on these fields, see B<fanotify_mark>(2).
ru: Подробную информацию об этих полях смотрите в B<fanotify_mark>(2).

source: For timerfd file descriptors (see B<timerfd>(2)), we see (since Linux 3.17) the following fields:
ru: Для файловых дескрипторов timerfd (смотрите B<timerfd>(2)) мы увидим (начиная с Linux 3.17) следующие поля:

source: This is the numeric value of the clock ID (corresponding to one of the B<CLOCK_*> constants defined via I<E<lt>time.hE<gt>>) that is used to mark the progress of the timer (in this example, 0 is B<CLOCK_REALTIME>).
ru: Числовое значение идентификатора часов (соответствует одной из констант B<CLOCK_*>, определённых в I<E<lt>time.hE<gt>>), используемое для отметки действия таймера (в этом примере 0 — B<CLOCK_REALTIME>).

source: This is the number of timer expirations that have occurred, (i.e., the value that B<read>(2) on it would return).
ru: Количество раз прошедших окончаний таймера (т. е., значение, которое вернул бы для него вызов B<read>(2)).

source: This field lists the flags with which the timerfd was last armed (see B<timerfd_settime>(2)), in octal (in this example, both B<TFD_TIMER_ABSTIME> and B<TFD_TIMER_CANCEL_ON_SET> are set).
ru: В этом поле перечислены флаги в восьмеричном виде (в этом примере установлены B<TFD_TIMER_ABSTIME>и B<TFD_TIMER_CANCEL_ON_SET>), с которым был запущен timerfd последний раз (смотрите B<timerfd_settime>(2)).

source: This field contains the amount of time until the timer will next expire, expressed in seconds and nanoseconds. This is always expressed as a relative value, regardless of whether the timer was created using the B<TFD_TIMER_ABSTIME> flag.
ru: В этом поле содержит количество времени до следующего истечения таймера, выраженное в секундах и наносекундах. Это всегда относительное значение, независимо от флага создания таймера B<TFD_TIMER_ABSTIME>.

source: This field contains the interval of the timer, in seconds and nanoseconds. (The I<it_value> and I<it_interval> fields contain the values that B<timerfd_gettime>(2) on this file descriptor would return.)
ru: В этом поле содержится интервал таймера, выраженный в секундах и наносекундах (поля I<it_value> и I<it_interval> содержат значения, которые вернул бы вызов B<timerfd_gettime>(2) для этого файлового дескриптора).

source: I</proc/[pid]/gid_map> (since Linux 3.5)
ru: I</proc/[pid]/gid_map> (начиная с Linux 3.5)

source: I</proc/[pid]/io> (since kernel 2.6.20)
ru: I</proc/[pid]/io> (начиная с версии ядра 2.6.20)

source: This file contains I/O statistics for the process, for example:
ru: Этот файл содержит статистику ввода-вывода процесса, например:

source: I<rchar>: characters read
ru: I<rchar>: прочитано символов

source: The number of bytes which this task has caused to be read from storage. This is simply the sum of bytes which this process passed to B<read>(2) and similar system calls. It includes things such as terminal I/O and is unaffected by whether or not actual physical disk I/O was required (the read might have been satisfied from pagecache).
ru: Количество байт, которое было прочитано данной задачей из хранилища. Это просто сумма байт, которую процесс передал в B<read>(2) и подобные системные вызовы. Здесь учитываются такие вещи как ввод-вывод с терминалом и не учитывается, происходил ли ввод-вывод действительно с физического диска (для чтения могло оказаться достаточно страничного кэша).

source: I<wchar>: characters written
ru: I<wchar>: записано символов

source: The number of bytes which this task has caused, or shall cause to be written to disk. Similar caveats apply here as with I<rchar>.
ru: Количество байт, которые были или должны быть записаны задачей на диск. Применимы те же оговорки, что и для I<rchar>.

source: I<syscr>: read syscalls
ru: I<syscr>: количество системных вызовов чтения

source: Attempt to count the number of read I/O operations\(emthat is, system calls such as B<read>(2) and B<pread>(2).
ru: Попытка подсчитать количество операций чтения — то есть системных вызовов B<read>(2) и B<pread>(2).

source: I<syscw>: write syscalls
ru: I<syscw>: количество системных вызовов записи

source: Attempt to count the number of write I/O operations\(emthat is, system calls such as B<write>(2) and B<pwrite>(2).
ru: Попытка подсчитать количество операций записи — то есть системных вызовов B<write>(2) и B<pwrite>(2).

source: I<read_bytes>: bytes read
ru: I<read_bytes>: прочитано байт

source: Attempt to count the number of bytes which this process really did cause to be fetched from the storage layer. This is accurate for block-backed filesystems.
ru: Попытка подсчитать количество байт, которое процесс действительно получил с уровня хранилища. Является точным для файловых систем блочного хранения.

source: I<write_bytes>: bytes written
ru: I<write_bytes>: записано байт

source: Attempt to count the number of bytes which this process caused to be sent to the storage layer.
ru: Попытка подсчитать количество байт, которое процесс действительно послал на уровень хранилища.

source: The big inaccuracy here is truncate. If a process writes 1MB to a file and then deletes the file, it will in fact perform no writeout. But it will have been accounted as having caused 1MB of write. In other words: this field represents the number of bytes which this process caused to not happen, by truncating pagecache. A task can cause "negative" I/O too. If this task truncates some dirty pagecache, some I/O which another task has been accounted for (in its I<write_bytes>) will not be happening.
ru: Есть большая погрешность при усечении. Если процесс записывает 1МБ в файл, а затем удаляет файл, то, фактически, он ничего не запишет. Но это будет подсчитано как запись 1МБ. Другими словами: это поле представляет количество байт, для которых процесс отменил запись посредством усечения страничного кэша. Задача также может вызвать «отрицательный» ввод-вывод. Если задача усекает часть устаревшего страничного кэша, то некоторый ввод-вывод, который был учтён в другой задаче (в её I<write_bytes>), не произойдёт.

source: I<Note>: In the current implementation, things are a bit racy on 32-bit systems: if process A reads process B's I</proc/[pid]/io> while process B is updating one of these 64-bit counters, process A could see an intermediate result.
ru: I<Замечание>: В текущей реализации существует большая состязательность в 32-битных системах: если процесс A читает I</proc/[pid]/io> процесса B в момент обновления 64-битных счётчиков процесса B, то процесс A может увидеть промежуточный результат.

source: I</proc/[pid]/limits> (since Linux 2.6.24)
ru: I</proc/[pid]/limits> (начиная с Linux 2.6.24)

source: This file displays the soft limit, hard limit, and units of measurement for each of the process's resource limits (see B<getrlimit>(2)). Up to and including Linux 2.6.35, this file is protected to allow reading only by the real UID of the process. Since Linux 2.6.36, this file is readable by all users on the system.
ru: В этом файле содержатся мягкие и жёсткие ограничения (limit), а также измерения по каждого ограничению ресурсов процесса (см. B<getrlimit>(2)). Файл доступен на чтение только реальному UID процесса. Начиная с Linux 2.6.36, может читаться всеми пользователями системы.

source: I</proc/[pid]/map_files/> (since kernel 3.3)
ru: I</proc/[pid]/map_files/> (начиная с версии ядра 3.3)

source: This subdirectory contains entries corresponding to memory-mapped files (see B<mmap>(2)). Entries are named by memory region start and end address pair (expressed as hexadecimal numbers), and are symbolic links to the mapped files themselves. Here is an example, with the output wrapped and reformatted to fit on an 80-column display:
ru: В этом подкаталоге содержатся записи, соответствующие файлам, отображённым в память (смотрит B<mmap>(2)). Имена записей соответствуют начальному и конечному адресу области памяти (в виде шестнадцатеричных чисел), и символьными ссылками на само отображённые файлы. Пример (подогнан под 80-колоночный терминал):

source: Although these entries are present for memory regions that were mapped with the B<MAP_FILE> flag, the way anonymous shared memory (regions created with the B<MAP_ANON | MAP_SHARED> flags) is implemented in Linux means that such regions also appear on this directory. Here is an example where the target file is the deleted I</dev/zero> one:
ru: Хотя эти записи предназначены для областей памяти, отображённых с флагом B<MAP_FILE>, из реализации в Linux области анонимной общей памяти (области, созданные с флагами B<MAP_ANON | MAP_SHARED>) также будут присутствовать в этом каталоге. Пример, в котором файл назначения — удалённый I</dev/zero>:

source: This directory appears only if the B<CONFIG_CHECKPOINT_RESTORE> kernel configuration option is enabled. Privilege (B<CAP_SYS_ADMIN>) is required to view the contents of this directory.
ru: Данный каталог присутствуют только, если ядро собрано с включённым параметром B<CONFIG_CHECKPOINT_RESTORE>. Для просмотра содержимого этого каталога требуется мандат B<CAP_SYS_ADMIN>.

source: A file containing the currently mapped memory regions and their access permissions. See B<mmap>(2) for some further information about memory mappings.
ru: Файл, содержащий адреса областей памяти, которые используются программой в данный момент и права доступа к ним. Информацию об отображении памяти смотрите в B<mmap>(2).

source: The format of the file is:
ru: Формат файла:

source: The I<address> field is the address space in the process that the mapping occupies. The I<perms> field is a set of permissions:
ru: В поле I<address> показано адресное пространство процесса, в которое выполнено отображение, а в поле I<perms> — права доступа:

source: r = read w = write x = execute s = shared p = private (copy on write)
ru: r = можно читать w = можно писать x = можно выполнять s = можно использовать несколькими процессами совместно p = личное (копирование при записи)

source: The I<offset> field is the offset into the file/whatever; I<dev> is the device (major:minor); I<inode> is the inode on that device. 0 indicates that no inode is associated with the memory region, as would be the case with BSS (uninitialized data).
ru: Поле I<offset> — это смещение в файле/где-то ещё; I<dev> — устройство (старший номер:младший номер); I<inode> — индексный дескриптор на данном устройстве. 0 означает, что с данной областью памяти не связаны индексные дескрипторы: примером тому является сегмент BSS (неинициализированные данные).

source: The I<pathname> field will usually be the file that is backing the mapping. For ELF files, you can easily coordinate with the I<offset> field by looking at the Offset field in the ELF program headers (I<readelf\ -l>).
ru: В поле I<pathname> обычно указывается отображённый файл. Если файл в формате ELF, то вы легко можете установить связь с полем I<offset>, посмотрев в Offset программного заголовка ELF (I<readelf\ -l>).

source: There are additional helpful pseudo-paths:
ru: Дополнительные полезные псевдо-пути:

source: The initial process's (also known as the main thread's) stack.
ru: Начальный стек процесса (главной нити).

source: I<[stack:E<lt>tidE<gt>]> (from Linux 3.4 to 4.4)
ru: I<[stack:E<lt>tidE<gt>]> (с Linux 3.4 по 4.4)

source: A thread's stack (where the I<E<lt>tidE<gt>> is a thread ID). It corresponds to the I</proc/[pid]/task/[tid]/> path. This field was removed in Linux 4.5, since providing this information for a process with large numbers of threads is expensive.
ru: Стек нити (где I<E<lt>tidE<gt>> — ID нити). Соответствует пути I</proc/[pid]/task/[tid]/>. Это поле было удалено в Linux 4.5, так как предоставление им информации по процессу с большим количеством нитей оказалось слишком затратным.

source: The virtual dynamically linked shared object. See B<vdso>(7).
ru: Виртуальный, динамически компонуемый, общий объект. Смотрите B<vdso>(7).

source: The process's heap.
ru: Куча процесса.

source: If the I<pathname> field is blank, this is an anonymous mapping as obtained via B<mmap>(2). There is no easy way to coordinate this back to a process's source, short of running it through B<gdb>(1), B<strace>(1), or similar.
ru: Если значение поля I<pathname> пусто, то это анонимное отображение, полученное с помощью B<mmap>(2). Нет простого способа увязать это с источником в процессе, кроме как запустив его в B<gdb>(1), B<strace>(1) и т.п.

source: I<pathname> is shown unescaped except for newline characters, which are replaced with an octal escape sequence. As a result, it is not possible to determine whether the original pathname contained a newline character or the literal I<\ee012> character sequence.
ru: Всё значение I<pathname> является неэкранированным, кроме символа новой строки, который заменяется на восьмеричную экранирующую последовательность. В результате невозможно определить, что в оригинальном пути — символ новой строки или экранирующая последовательность буквенная I<\ee012>.

source: If the mapping is file-backed and the file has been deleted, the string " (deleted)" is appended to the pathname. Note that this is ambiguous too.
ru: Если файл отображается в виртуальную память и удаляется, то к пути добавляется строка " (deleted)". Заметим, что это также проблематичное решение.

source: Under Linux 2.0, there is no field giving pathname.
ru: В Linux 2.0 поле, указывающее на имя файла, отсутствует.

source: This file can be used to access the pages of a process's memory through B<open>(2), B<read>(2), and B<lseek>(2).
ru: Этот файл можно использовать для получения доступа к страницам памяти процесса через вызовы B<open>(2), B<read>(2) и B<lseek>(2).
