Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The B<MSG_TRUNC> B<recvmsg>(2) extension is an ugly hack and should be replaced by a control message. There is currently no way to get the original destination address of packets via B<SOCK_DGRAM>.
ru: Расширение B<MSG_TRUNC> B<recvmsg>(2) является неудачным решением и должно быть заменено на управляющее сообщение. Пока нет способа получить первоначальный адрес назначения пакетов через B<SOCK_DGRAM>.

source: RFC\ 894 for the standard IP Ethernet encapsulation. RFC\ 1700 for the IEEE 802.3 IP encapsulation.
ru: В RFC\ 894 описана упаковка стандартного IP Ethernet. В RFC\ 1700 описана упаковка IP IEEE 802.3.

source: The I<E<lt>linux/if_ether.hE<gt>> include file for physical-layer protocols.
ru: Заголовочный файл I<E<lt>linux/if_ether.hE<gt>> содержит протоколы физического уровня.

source: The Linux kernel source tree. I</Documentation/networking/filter.txt> describes how to apply Berkeley Packet Filters to packet sockets. I</tools/testing/selftests/net/psock_tpacket.c> contains example source code for all available versions of B<PACKET_RX_RING> and B<PACKET_TX_RING>.
ru: Дерево исходного кода ядра Linux. В I</Documentation/networking/filter.txt> описано как к пакетным сокетам применять Berkeley Packet Filters. В I</tools/testing/selftests/net/psock_tpacket.c> содержится пример исходного кода для всех доступных версий B<PACKET_RX_RING> и B<PACKET_TX_RING>.

source: pthreads - POSIX threads
ru: pthreads - нити POSIX

source: POSIX.1 specifies a set of interfaces (functions, header files) for threaded programming commonly known as POSIX threads, or Pthreads. A single process can contain multiple threads, all of which are executing the same program. These threads share the same global memory (data and heap segments), but each thread has its own stack (automatic variables).
ru: В POSIX.1 определён набор интерфейсов (функции, заголовочные файлы) для работы с нитями, более известными как нити POSIX или Pthreads. В одном процессе может быть несколько нитей, которые выполняют одну программу. Эти нити работают с общей глобальной памятью (сегментами данных и кучи), но у каждой нити есть собственный стек (автоматические переменные).

source: POSIX.1 also requires that threads share a range of other attributes (i.e., these attributes are process-wide rather than per-thread):
ru: Также, в POSIX.1 требуется, чтобы нити имели общий диапазон других атрибутов (т. е., эти атрибуты процесса, а не нити):

source: process ID
ru: идентификатор процесса

source: parent process ID
ru: идентификатор родительского процесса

source: process group ID and session ID
ru: Идентификатор группы процессов и сеанса

source: controlling terminal
ru: Управляющий терминал

source: user and group IDs
ru: Идентификаторы пользователя и группы

source: open file descriptors
ru: Открытые файловые дескрипторы

source: record locks (see B<fcntl>(2))
ru: Обычные блокировки (смотрите B<fcntl>(2))

source: signal dispositions
ru: Обработчики сигналов

source: file mode creation mask (B<umask>(2))
ru: Маска создания режима доступа к файлу (B<umask>(2))

source: current directory (B<chdir>(2)) and root directory (B<chroot>(2))
ru: Текущий каталог (B<chdir>(2)) и корневой каталог (B<chroot>(2))

source: interval timers (B<setitimer>(2)) and POSIX timers (B<timer_create>(2))
ru: Интервальные таймеры (B<setitimer>(2)) и таймеры POSIX (B<timer_create>(2))

source: nice value (B<setpriority>(2))
ru: Значение уступчивости (B<setpriority>(2))

source: resource limits (B<setrlimit>(2))
ru: Ограничения по ресурсам (B<setrlimit>(2))

source: measurements of the consumption of CPU time (B<times>(2)) and resources (B<getrusage>(2))
ru: Измерители потребления времени ЦП (B<times>(2)) и ресурсов (B<getrusage>(2))

source: As well as the stack, POSIX.1 specifies that various other attributes are distinct for each thread, including:
ru: Как и для стека, в POSIX.1 определены другие атрибуты, которые уникальны в каждой нити:

source: thread ID (the I<pthread_t> data type)
ru: Идентификатор нити (тип данных I<pthread_t>)

source: signal mask (B<pthread_sigmask>(3))
ru: Маска сигналов (B<pthread_sigmask>(3))

source: the I<errno> variable
ru: Переменная I<errno>

source: alternate signal stack (B<sigaltstack>(2))
ru: Альтернативный стек сигнала (B<sigaltstack>(2))

source: real-time scheduling policy and priority (B<sched>(7))
ru: Алгоритм и приоритет планирования реального времени (B<sched>(7))

source: The following Linux-specific features are also per-thread:
ru: Следующие свойства есть только в Linux и также уникальны в каждой нити:

source: capabilities (see B<capabilities>(7))
ru: мандаты (смотрите B<capabilities>(7))

source: CPU affinity (B<sched_setaffinity>(2))
ru: Привязка к ЦП (B<sched_setaffinity>(2))

source: Pthreads function return values
ru: Возвращаемые значения из функций pthreads

source: Most pthreads functions return 0 on success, and an error number on failure. Note that the pthreads functions do not set I<errno>. For each of the pthreads functions that can return an error, POSIX.1-2001 specifies that the function can never fail with the error B<EINTR>.
ru: Большинство функций pthreads при успешном выполнении возвращает 0 или номер ошибки в противном случае. Заметим, что функции pthreads не изменяют I<errno>. Для каждой функции pthreads, которая может вернуть ошибку, в POSIX.1-2001 определено, что функция никогда не может завершиться с ошибкой B<EINTR>.

source: Thread IDs
ru: Идентификатор нити

source: Each of the threads in a process has a unique thread identifier (stored in the type I<pthread_t>). This identifier is returned to the caller of B<pthread_create>(3), and a thread can obtain its own thread identifier using B<pthread_self>(3).
ru: Каждой нити процесса назначается уникальный идентификатор нити (имеет тип I<pthread_t>). Этот идентификатор возвращается вызывающему B<pthread_create>(3), а в самой нити её идентификатор можно получить с помощью B<pthread_self>(3).

source: Thread IDs are guaranteed to be unique only within a process. (In all pthreads functions that accept a thread ID as an argument, that ID by definition refers to a thread in the same process as the caller.)
ru: Внутри процесса гарантируется уникальность идентификаторов нитей (во всех функциях pthreads, которые принимают аргумент идентификатора нити, подразумевается, что указана нить из процесса вызывающего).

source: The system may reuse a thread ID after a terminated thread has been joined, or a detached thread has terminated. POSIX says: "If an application attempts to use a thread ID whose lifetime has ended, the behavior is undefined."
ru: Система может повторно использовать идентификатор нити после объединения завершённой нити или отсоединения завершённой нити. В POSIX сказано: «Если приложение пытается использовать идентификатор нити, у который закончился срок жизни, то поведение не предсказуемо».

source: Thread-safe functions
ru: Нитебезопасные функции

source: A thread-safe function is one that can be safely (i.e., it will deliver the same results regardless of whether it is) called from multiple threads at the same time.
ru: Нитебезопасная функция — это функция, которую можно безопасно (т. е., это приведёт к единым результатам независимо от окружения) вызывать из нескольких нитей одновременно.

source: POSIX.1-2001 and POSIX.1-2008 require that all functions specified in the standard shall be thread-safe, except for the following functions:
ru: В POSIX.1-2001 и POSIX.1-2008 требуется, чтобы все функции, описанные в стандарте, были нитебезопасными, за исключением следующих функций:

source: asctime() basename() catgets() crypt() ctermid() if passed a non-NULL argument ctime() dbm_clearerr() dbm_close() dbm_delete() dbm_error() dbm_fetch() dbm_firstkey() dbm_nextkey() dbm_open() dbm_store() dirname() dlerror() drand48() ecvt() [POSIX.1-2001 only (function removed in POSIX.1-2008)] encrypt() endgrent() endpwent() endutxent() fcvt() [POSIX.1-2001 only (function removed in POSIX.1-2008)] ftw() gcvt() [POSIX.1-2001 only (function removed in POSIX.1-2008)] getc_unlocked() getchar_unlocked() getdate() getenv() getgrent() getgrgid() getgrnam() gethostbyaddr() [POSIX.1-2001 only (function removed in POSIX.1-2008)] gethostbyname() [POSIX.1-2001 only (function removed in POSIX.1-2008)] gethostent() getlogin() getnetbyaddr() getnetbyname() getnetent() getopt() getprotobyname() getprotobynumber() getprotoent() getpwent() getpwnam() getpwuid() getservbyname() getservbyport() getservent() getutxent() getutxid() getutxline() gmtime() hcreate() hdestroy() hsearch() inet_ntoa() l64a() lgamma() lgammaf() lgammal() localeconv() localtime() lrand48() mrand48() nftw() nl_langinfo() ptsname() putc_unlocked() putchar_unlocked() putenv() pututxline() rand() readdir() setenv() setgrent() setkey() setpwent() setutxent() strerror() strsignal() [Added in POSIX.1-2008] strtok() system() [Added in POSIX.1-2008] tmpnam() if passed a non-NULL argument ttyname() unsetenv() wcrtomb() if its final argument is NULL wcsrtombs() if its final argument is NULL wcstombs() wctomb()
ru: asctime() basename() catgets() crypt() ctermid() если передаётся аргумент не NULL ctime() dbm_clearerr() dbm_close() dbm_delete() dbm_error() dbm_fetch() dbm_firstkey() dbm_nextkey() dbm_open() dbm_store() dirname() dlerror() drand48() ecvt() [только POSIX.1-2001 (удалена из POSIX.1-2008)] encrypt() endgrent() endpwent() endutxent() fcvt() [только POSIX.1-2001 (удалена из POSIX.1-2008)] ftw() gcvt() [только POSIX.1-2001 (удалена из POSIX.1-2008)] getc_unlocked() getchar_unlocked() getdate() getenv() getgrent() getgrgid() getgrnam() gethostbyaddr() [только POSIX.1-2001 (удалена из POSIX.1-2008)] gethostbyname() [только POSIX.1-2001 (удалена из POSIX.1-2008)] gethostent() getlogin() getnetbyaddr() getnetbyname() getnetent() getopt() getprotobyname() getprotobynumber() getprotoent() getpwent() getpwnam() getpwuid() getservbyname() getservbyport() getservent() getutxent() getutxid() getutxline() gmtime() hcreate() hdestroy() hsearch() inet_ntoa() l64a() lgamma() lgammaf() lgammal() localeconv() localtime() lrand48() mrand48() nftw() nl_langinfo() ptsname() putc_unlocked() putchar_unlocked() putenv() pututxline() rand() readdir() setenv() setgrent() setkey() setpwent() setutxent() strerror() strsignal() [добавлена в POSIX.1-2008] strtok() system() [добавлена в POSIX.1-2008] tmpnam() если передаётся аргумент не NULL ttyname() unsetenv() wcrtomb() если конечный аргумент NULL wcsrtombs() если конечный аргумент NULL wcstombs() wctomb()

source: Async-cancel-safe functions
ru: Безопасные асинхронные отменяемые функции

source: An async-cancel-safe function is one that can be safely called in an application where asynchronous cancelability is enabled (see B<pthread_setcancelstate>(3)).
ru: Безопасная асинхронная отменяемая функция (async-cancel-safe function) — это функция, которую можно безопасно вызывать в приложении, в котором разрешено асинхронная отмена (смотрите B<pthread_setcancelstate>(3)).

source: Only the following functions are required to be async-cancel-safe by POSIX.1-2001 and POSIX.1-2008:
ru: Согласно POSIX.1-2001 и POSIX.1-2008 только следующие функции должны быть безопасными асинхронными отменяемыми:

source: Cancellation points
ru: Точки отмены

source: POSIX.1 specifies that certain functions must, and certain other functions may, be cancellation points. If a thread is cancelable, its cancelability type is deferred, and a cancellation request is pending for the thread, then the thread is canceled when it calls a function that is a cancellation point.
ru: В POSIX.1 определено, что некоторые функции должны, а несколько других могут было точками отмены. Если нить отменяема, её тип отменяемости откладывается, и ожидается запрос отмены нити, затем нить отменяется, когда она вызывает функцию, которая является точкой отмены.

source: The following functions are required to be cancellation points by POSIX.1-2001 and/or POSIX.1-2008:
ru: Следующие функции должны быть точками отмены согласно POSIX.1-2001 и/или POSIX.1-2008:

source: accept() aio_suspend() clock_nanosleep() close() connect() creat() fcntl() F_SETLKW fdatasync() fsync() getmsg() getpmsg() lockf() F_LOCK mq_receive() mq_send() mq_timedreceive() mq_timedsend() msgrcv() msgsnd() msync() nanosleep() open() openat() [Added in POSIX.1-2008] pause() poll() pread() pselect() pthread_cond_timedwait() pthread_cond_wait() pthread_join() pthread_testcancel() putmsg() putpmsg() pwrite() read() readv() recv() recvfrom() recvmsg() select() sem_timedwait() sem_wait() send() sendmsg() sendto() sigpause() [POSIX.1-2001 only (moves to "may" list in POSIX.1-2008)] sigsuspend() sigtimedwait() sigwait() sigwaitinfo() sleep() system() tcdrain() usleep() [POSIX.1-2001 only (function removed in POSIX.1-2008)] wait() waitid() waitpid() write() writev()
ru: accept() aio_suspend() clock_nanosleep() close() connect() creat() fcntl() F_SETLKW fdatasync() fsync() getmsg() getpmsg() lockf() F_LOCK mq_receive() mq_send() mq_timedreceive() mq_timedsend() msgrcv() msgsnd() msync() nanosleep() open() openat() [добавлена в POSIX.1-2008] pause() poll() pread() pselect() pthread_cond_timedwait() pthread_cond_wait() pthread_join() pthread_testcancel() putmsg() putpmsg() pwrite() read() readv() recv() recvfrom() recvmsg() select() sem_timedwait() sem_wait() send() sendmsg() sendto() sigpause() [только POSIX.1-2001 (перемещена в список «может» в POSIX.1-2008)] sigsuspend() sigtimedwait() sigwait() sigwaitinfo() sleep() system() tcdrain() usleep() [только POSIX.1-2001 (функция удалена в POSIX.1-2008)] wait() waitid() waitpid() write() writev()

source: The following functions may be cancellation points according to POSIX.1-2001 and/or POSIX.1-2008:
ru: Следующие функции могут быть точками отмены согласно POSIX.1-2001 и/или POSIX.1-2008:

source: access() asctime() asctime_r() catclose() catgets() catopen() chmod() [Added in POSIX.1-2008] chown() [Added in POSIX.1-2008] closedir() closelog() ctermid() ctime() ctime_r() dbm_close() dbm_delete() dbm_fetch() dbm_nextkey() dbm_open() dbm_store() dlclose() dlopen() dprintf() [Added in POSIX.1-2008] endgrent() endhostent() endnetent() endprotoent() endpwent() endservent() endutxent() faccessat() [Added in POSIX.1-2008] fchmod() [Added in POSIX.1-2008] fchmodat() [Added in POSIX.1-2008] fchown() [Added in POSIX.1-2008] fchownat() [Added in POSIX.1-2008] fclose() fcntl() (for any value of cmd argument) fflush() fgetc() fgetpos() fgets() fgetwc() fgetws() fmtmsg() fopen() fpathconf() fprintf() fputc() fputs() fputwc() fputws() fread() freopen() fscanf() fseek() fseeko() fsetpos() fstat() fstatat() [Added in POSIX.1-2008] ftell() ftello() ftw() futimens() [Added in POSIX.1-2008] fwprintf() fwrite() fwscanf() getaddrinfo() getc() getc_unlocked() getchar() getchar_unlocked() getcwd() getdate() getdelim() [Added in POSIX.1-2008] getgrent() getgrgid() getgrgid_r() getgrnam() getgrnam_r() gethostbyaddr() [SUSv3 only (function removed in POSIX.1-2008)] gethostbyname() [SUSv3 only (function removed in POSIX.1-2008)] gethostent() gethostid() gethostname() getline() [Added in POSIX.1-2008] getlogin() getlogin_r() getnameinfo() getnetbyaddr() getnetbyname() getnetent() getopt() (if opterr is nonzero) getprotobyname() getprotobynumber() getprotoent() getpwent() getpwnam() getpwnam_r() getpwuid() getpwuid_r() gets() getservbyname() getservbyport() getservent() getutxent() getutxid() getutxline() getwc() getwchar() getwd() [SUSv3 only (function removed in POSIX.1-2008)] glob() iconv_close() iconv_open() ioctl() link() linkat() [Added in POSIX.1-2008] lio_listio() [Added in POSIX.1-2008] localtime() localtime_r() lockf() [Added in POSIX.1-2008] lseek() lstat() mkdir() [Added in POSIX.1-2008] mkdirat() [Added in POSIX.1-2008] mkdtemp() [Added in POSIX.1-2008] mkfifo() [Added in POSIX.1-2008] mkfifoat() [Added in POSIX.1-2008] mknod() [Added in POSIX.1-2008] mknodat() [Added in POSIX.1-2008] mkstemp() mktime() nftw() opendir() openlog() pathconf() pclose() perror() popen() posix_fadvise() posix_fallocate() posix_madvise() posix_openpt() posix_spawn() posix_spawnp() posix_trace_clear() posix_trace_close() posix_trace_create() posix_trace_create_withlog() posix_trace_eventtypelist_getnext_id() posix_trace_eventtypelist_rewind() posix_trace_flush() posix_trace_get_attr() posix_trace_get_filter() posix_trace_get_status() posix_trace_getnext_event() posix_trace_open() posix_trace_rewind() posix_trace_set_filter() posix_trace_shutdown() posix_trace_timedgetnext_event() posix_typed_mem_open() printf() psiginfo() [Added in POSIX.1-2008] psignal() [Added in POSIX.1-2008] pthread_rwlock_rdlock() pthread_rwlock_timedrdlock() pthread_rwlock_timedwrlock() pthread_rwlock_wrlock() putc() putc_unlocked() putchar() putchar_unlocked() puts() pututxline() putwc() putwchar() readdir() readdir_r() readlink() [Added in POSIX.1-2008] readlinkat() [Added in POSIX.1-2008] remove() rename() renameat() [Added in POSIX.1-2008] rewind() rewinddir() scandir() [Added in POSIX.1-2008] scanf() seekdir() semop() setgrent() sethostent() setnetent() setprotoent() setpwent() setservent() setutxent() sigpause() [Added in POSIX.1-2008] stat() strerror() strerror_r() strftime() symlink() symlinkat() [Added in POSIX.1-2008] sync() syslog() tmpfile() tmpnam() ttyname() ttyname_r() tzset() ungetc() ungetwc() unlink() unlinkat() [Added in POSIX.1-2008] utime() [Added in POSIX.1-2008] utimensat() [Added in POSIX.1-2008] utimes() [Added in POSIX.1-2008] vdprintf() [Added in POSIX.1-2008] vfprintf() vfwprintf() vprintf() vwprintf() wcsftime() wordexp() wprintf() wscanf()
ru: access() asctime() asctime_r() catclose() catgets() catopen() chmod() [добавлена в POSIX.1-2008] chown() [добавлена в POSIX.1-2008] closedir() closelog() ctermid() ctime() ctime_r() dbm_close() dbm_delete() dbm_fetch() dbm_nextkey() dbm_open() dbm_store() dlclose() dlopen() dprintf() [добавлена в POSIX.1-2008] endgrent() endhostent() endnetent() endprotoent() endpwent() endservent() endutxent() faccessat() [добавлена в POSIX.1-2008] fchmod() [добавлена в POSIX.1-2008] fchmodat() [добавлена в POSIX.1-2008] fchown() [добавлена в POSIX.1-2008] fchownat() [Added in POSIX.1-2008] fclose() fcntl() (для любого значения аргумента cmd) fflush() fgetc() fgetpos() fgets() fgetwc() fgetws() fmtmsg() fopen() fpathconf() fprintf() fputc() fputs() fputwc() fputws() fread() freopen() fscanf() fseek() fseeko() fsetpos() fstat() fstatat() [добавлена в POSIX.1-2008] ftell() ftello() ftw() futimens() [добавлена в POSIX.1-2008] fwprintf() fwrite() fwscanf() getaddrinfo() getc() getc_unlocked() getchar() getchar_unlocked() getcwd() getdate() getdelim() [добавлена в POSIX.1-2008] getgrent() getgrgid() getgrgid_r() getgrnam() getgrnam_r() gethostbyaddr() [только SUSv3 (функция удалена из POSIX.1-2008)] gethostbyname() [только SUSv3 (функция удалена из POSIX.1-2008)] gethostent() gethostid() gethostname() getline() [добавлена в POSIX.1-2008] getlogin() getlogin_r() getnameinfo() getnetbyaddr() getnetbyname() getnetent() getopt() (если opterr не равно 0) getprotobyname() getprotobynumber() getprotoent() getpwent() getpwnam() getpwnam_r() getpwuid() getpwuid_r() gets() getservbyname() getservbyport() getservent() getutxent() getutxid() getutxline() getwc() getwchar() getwd() [только SUSv3 (функция удалена из POSIX.1-2008)] glob() iconv_close() iconv_open() ioctl() link() linkat() [добавлена в POSIX.1-2008] lio_listio() [добавлена в POSIX.1-2008] localtime() localtime_r() lockf() [добавлена в POSIX.1-2008] lseek() lstat() mkdir() [добавлена в POSIX.1-2008] mkdirat() [добавлена в POSIX.1-2008] mkdtemp() [добавлена в POSIX.1-2008] mkfifo() [добавлена в POSIX.1-2008] mkfifoat() [добавлена в POSIX.1-2008] mknod() [добавлена в POSIX.1-2008] mknodat() [добавлена в POSIX.1-2008] mkstemp() mktime() nftw() opendir() openlog() pathconf() pclose() perror() popen() posix_fadvise() posix_fallocate() posix_madvise() posix_openpt() posix_spawn() posix_spawnp() posix_trace_clear() posix_trace_close() posix_trace_create() posix_trace_create_withlog() posix_trace_eventtypelist_getnext_id() posix_trace_eventtypelist_rewind() posix_trace_flush() posix_trace_get_attr() posix_trace_get_filter() posix_trace_get_status() posix_trace_getnext_event() posix_trace_open() posix_trace_rewind() posix_trace_set_filter() posix_trace_shutdown() posix_trace_timedgetnext_event() posix_typed_mem_open() printf() psiginfo() [добавлена в POSIX.1-2008] psignal() [добавлена в POSIX.1-2008] pthread_rwlock_rdlock() pthread_rwlock_timedrdlock() pthread_rwlock_timedwrlock() pthread_rwlock_wrlock() putc() putc_unlocked() putchar() putchar_unlocked() puts() pututxline() putwc() putwchar() readdir() readdir_r() readlink() [добавлена в POSIX.1-2008] readlinkat() [добавлена в POSIX.1-2008] remove() rename() renameat() [добавлена в POSIX.1-2008] rewind() rewinddir() scandir() [добавлена в POSIX.1-2008] scanf() seekdir() semop() setgrent() sethostent() setnetent() setprotoent() setpwent() setservent() setutxent() sigpause() [добавлена в POSIX.1-2008] stat() strerror() strerror_r() strftime() symlink() symlinkat() [добавлена в POSIX.1-2008] sync() syslog() tmpfile() tmpnam() ttyname() ttyname_r() tzset() ungetc() ungetwc() unlink() unlinkat() [добавлена в POSIX.1-2008] utime() [добавлена в POSIX.1-2008] utimensat() [добавлена в POSIX.1-2008] utimes() [добавлена в POSIX.1-2008] vdprintf() [добавлена в POSIX.1-2008] vfprintf() vfwprintf() vprintf() vwprintf() wcsftime() wordexp() wprintf() wscanf()

source: An implementation may also mark other functions not specified in the standard as cancellation points. In particular, an implementation is likely to mark any nonstandard function that may block as a cancellation point. (This includes most functions that can touch files.)
ru: Реализация также может помечать другие функции, не указанные в стандарте, как точки отмены. В частности, реализация, вероятно, пометит как точку отмены любую нестандартную функцию, которая может блокироваться (большинство функций, работающих с файлами).

source: Compiling on Linux
ru: Компиляция в Linux

source: On Linux, programs that use the Pthreads API should be compiled using I<cc -pthread>.
ru: В Linux, программы, использующие программный интерфейс pthreads, должны компилироваться с помощью I<cc -pthread>.

source: Linux implementations of POSIX threads
ru: Реализации нитей POSIX в Linux

source: Over time, two threading implementations have been provided by the GNU C library on Linux:
ru: За всё время в библиотеке GNU C было две реализации нитей для Linux:

source: This is the original Pthreads implementation. Since glibc 2.4, this implementation is no longer supported.
ru: Первоначальная реализация pthreads. Начиная с glibc 2.4 эта реализация больше не поддерживается.

source: B<NPTL> (Native POSIX Threads Library)
ru: B<NPTL> (библиотека нитей POSIX)

source: This is the modern Pthreads implementation. By comparison with LinuxThreads, NPTL provides closer conformance to the requirements of the POSIX.1 specification and better performance when creating large numbers of threads. NPTL is available since glibc 2.3.2, and requires features that are present in the Linux 2.6 kernel.
ru: Современная реализация pthreads. По сравнению с LinuxThreads, NPTL более точно соответствует требованиям POSIX.1 и более производительна при создании большого количества нитей. NPTL появилась в glibc начиная с версии 2.3.2, и требует свойства, появившиеся в ядре Linux 2.6.
