Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: if (inheritsched_str != NULL) { if (inheritsched_str[0] == \(aqe\(aq) inheritsched = PTHREAD_EXPLICIT_SCHED; else if (inheritsched_str[0] == \(aqi\(aq) inheritsched = PTHREAD_INHERIT_SCHED; else usage(argv[0], "Value for -i must be \(aqe\(aq or \(aqi\(aq\en");
ru: if (inheritsched_str != NULL) { if (inheritsched_str[0] == \(aqe\(aq) inheritsched = PTHREAD_EXPLICIT_SCHED; else if (inheritsched_str[0] == \(aqi\(aq) inheritsched = PTHREAD_INHERIT_SCHED; else usage(argv[0], "Значение -i должно быть \(aqe\(aq или \(aqi\(aq\en");

source: if (attr_sched_str != NULL) { if (!get_policy(attr_sched_str[0], &policy)) usage(argv[0], "Bad policy for \(aqattr\(aq (-a)\en"); param.sched_priority = strtol(&attr_sched_str[1], NULL, 0);
ru: if (attr_sched_str != NULL) { if (!get_policy(attr_sched_str[0], &policy)) usage(argv[0], "Некорректный алгоритм для \(aqattr\(aq (-a)\en"); param.sched_priority = strtol(&attr_sched_str[1], NULL, 0);

source: /* If we initialized a thread attributes object, display the scheduling attributes that were set in the object */
ru: /* если мы инициализируем объект атрибутов нити, то покажем атрибуты планирования, установленные в объекте */

source: printf("Scheduler settings in \(aqattr\(aq\en"); display_sched_attr(policy, &param);
ru: printf("Настройки планировщика в \(aqattr\(aq\en"); display_sched_attr(policy, &param);

source: s = pthread_attr_getinheritsched(&attr, &inheritsched); printf(" inheritsched is %s\en", (inheritsched == PTHREAD_INHERIT_SCHED) ? "INHERIT" : (inheritsched == PTHREAD_EXPLICIT_SCHED) ? "EXPLICIT" : "???"); printf("\en"); }
ru: s = pthread_attr_getinheritsched(&attr, &inheritsched); printf(" наследование планировщика %s\en", (inheritsched == PTHREAD_INHERIT_SCHED) ? "ВКЛЮЧЕНО" : (inheritsched == PTHREAD_EXPLICIT_SCHED) ? "ЯВНОЕ" : "???"); printf("\en"); }

source: /* Create a thread that will display its scheduling attributes */
ru: /* создаём нить, которая покажет свои атрибуты планирования */

source: /* Destroy unneeded thread attributes object */
ru: /* уничтожаем ненужный объект атрибутов нити */
