Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Packet socket options are configured by calling B<setsockopt>(2) with level B<SOL_PACKET>.
ru: Параметры пакетных сокетов настраиваются вызовом B<setsockopt>(2) с уровнем B<SOL_PACKET>.

source: Packet sockets can be used to configure physical-layer multicasting and promiscuous mode. B<PACKET_ADD_MEMBERSHIP> adds a binding and B<PACKET_DROP_MEMBERSHIP> drops it. They both expect a I<packet_mreq> structure as argument:
ru: Пакетные сокеты можно использовать для настройки неразборчивого режима и групповой рассылки на физическом уровне. Параметр B<PACKET_ADD_MEMBERSHIP> добавляет привязку, B<PACKET_DROP_MEMBERSHIP> отменяет её. Для обоих в качестве аргумента передаётся структура I<packet_mreq>:

source: struct packet_mreq { int mr_ifindex; /* interface index */ unsigned short mr_type; /* action */ unsigned short mr_alen; /* address length */ unsigned char mr_address[8]; /* physical-layer address */ };
ru: struct packet_mreq { int mr_ifindex; /* индекс интерфейса */ unsigned short mr_type; /* действие */ unsigned short mr_alen; /* длина адреса */ unsigned char mr_address[8]; /* адрес физ-кого уровня */ };

source: I<mr_ifindex> contains the interface index for the interface whose status should be changed. The I<mr_type> field specifies which action to perform. B<PACKET_MR_PROMISC> enables receiving all packets on a shared medium (often known as "promiscuous mode"), B<PACKET_MR_MULTICAST> binds the socket to the physical-layer multicast group specified in I<mr_address> and I<mr_alen>, and B<PACKET_MR_ALLMULTI> sets the socket up to receive all multicast packets arriving at the interface.
ru: В I<mr_ifindex> содержится индекс интерфейса, состояние которого нужно изменить. В поле I<mr_type> указывается какое действие нужно выполнить. Значение B<PACKET_MR_PROMISC> включает приём всех пакетов из общего носителя (часто называется «неразборчивый режим»), B<PACKET_MR_MULTICAST> привязывает сокет к групповой рассылке физического уровня, задаваемой в I<mr_address> и I<mr_alen>, а B<PACKET_MR_ALLMULTI> заставляет сокет принимать все пакеты групповых рассылок, поступающих на интерфейс.

source: In addition, the traditional ioctls B<SIOCSIFFLAGS>, B<SIOCADDMULTI>, B<SIOCDELMULTI> can be used for the same purpose.
ru: Также, для тех же целей можно использовать обычные ioctl B<SIOCSIFFLAGS>, B<SIOCADDMULTI>, B<SIOCDELMULTI>.

source: B<PACKET_AUXDATA> (since Linux 2.6.21)
ru: B<PACKET_AUXDATA> (начиная с Linux 2.6.21)

source: If this binary option is enabled, the packet socket passes a metadata structure along with each packet in the B<recvmsg>(2) control field. The structure can be read with B<cmsg>(3). It is defined as
ru: Если включён этот двоичный параметр, то пакетный сокет передаёт структуру метаданных вместе с каждым пакетом в управляющем поле B<recvmsg>(2). Структуру можно прочитать с помощью B<cmsg>(3). Она определена как:

source: struct tpacket_auxdata { __u32 tp_status; __u32 tp_len; /* packet length */ __u32 tp_snaplen; /* captured length */ __u16 tp_mac; __u16 tp_net; __u16 tp_vlan_tci; __u16 tp_padding; };
ru: struct tpacket_auxdata { __u32 tp_status; __u32 tp_len; /* длина пакета */ __u32 tp_snaplen; /* захваченная длина */ __u16 tp_mac; __u16 tp_net; __u16 tp_vlan_tci; __u16 tp_padding; };

source: B<PACKET_FANOUT> (since Linux 3.1)
ru: B<PACKET_FANOUT> (начиная с Linux 3.1)

source: To scale processing across threads, packet sockets can form a fanout group. In this mode, each matching packet is enqueued onto only one socket in the group. A socket joins a fanout group by calling B<setsockopt>(2) with level B<SOL_PACKET> and option B<PACKET_FANOUT>. Each network namespace can have up to 65536 independent groups. A socket selects a group by encoding the ID in the first 16 bits of the integer option value. The first packet socket to join a group implicitly creates it. To successfully join an existing group, subsequent packet sockets must have the same protocol, device settings, fanout mode and flags (see below). Packet sockets can leave a fanout group only by closing the socket. The group is deleted when the last socket is closed.
ru: Для масштабирования обработки на несколько нитей, пакетные сокеты можно объединять в разветвлённую группу (fanout group). В этом режиме каждый подходящий пакет ставится в очередь только одного сокета в группе. Сокет добавляется в разветвлённую группу вызовом B<setsockopt>(2) с уровнем B<SOL_PACKET> и параметром B<PACKET_FANOUT>. Каждое сетевое пространство имён может включать до 65536 независимых групп. Сокет выбирает группу по закодированному ID в первых 16 битах целочисленного значения параметра. Первый пакетный сокет, подключаемый к группе неявно её создаёт. Для успешного подключения к существующей группе все дальнейшие пакетные сокеты должны иметь тот же протокол, настройки устройства, режим разветвления и флаги (смотрите далее). Пакетные сокеты могут покинуть группу только при закрытия сокета. Группа удаляется после закрытия последнего сокета.

source: Fanout supports multiple algorithms to spread traffic between sockets, as follows:
ru: Для разветвления поддерживается несколько алгоритмов распределения трафика по сокетам:

source: The default mode, B<PACKET_FANOUT_HASH>, sends packets from the same flow to the same socket to maintain per-flow ordering. For each packet, it chooses a socket by taking the packet flow hash modulo the number of sockets in the group, where a flow hash is a hash over network-layer address and optional transport-layer port fields.
ru: Режим по умолчанию B<PACKET_FANOUT_HASH> посылает пакеты из одного потока в один и тот же сокет для обеспечения упорядочивания по потоку. Для каждого пакета выбирается сокет, получаемый из хэша потока пакетов, взятого по модулю количества сокетов в группе, где хэш потока — это хэш адреса сетевого уровня и необязательных полей портов транспортного уровня.

source: The load-balance mode B<PACKET_FANOUT_LB> implements a round-robin algorithm.
ru: Режим балансировки нагрузки B<PACKET_FANOUT_LB> реализует карусельный алгоритм.

source: B<PACKET_FANOUT_CPU> selects the socket based on the CPU that the packet arrived on.
ru: В режиме B<PACKET_FANOUT_CPU> выбираются сокеты исходя из ЦП, на который поступил пакет.

source: B<PACKET_FANOUT_ROLLOVER> processes all data on a single socket, moving to the next when one becomes backlogged.
ru: В режиме B<PACKET_FANOUT_ROLLOVER> все данные обрабатываются одним сокетом, следующий задействуется, если текущий занят (backlogged).

source: B<PACKET_FANOUT_RND> selects the socket using a pseudo-random number generator.
ru: В режиме B<PACKET_FANOUT_RND> сокет выбирается согласно генератору псевдослучайных чисел.

source: B<PACKET_FANOUT_QM> (available since Linux 3.14) selects the socket using the recorded queue_mapping of the received skb.
ru: В режиме B<PACKET_FANOUT_QM> (доступен, начиная с Linux 3.14) сокет выбирается с помощью записанного queue_mapping из полученной skb.

source: Fanout modes can take additional options. IP fragmentation causes packets from the same flow to have different flow hashes. The flag B<PACKET_FANOUT_FLAG_DEFRAG>, if set, causes packets to be defragmented before fanout is applied, to preserve order even in this case. Fanout mode and options are communicated in the second 16 bits of the integer option value. The flag B<PACKET_FANOUT_FLAG_ROLLOVER> enables the roll over mechanism as a backup strategy: if the original fanout algorithm selects a backlogged socket, the packet rolls over to the next available one.
ru: Режимы разветвления могут учитывать дополнительные параметры. Фрагментация IP приводит к тому, что пакеты одного потока имеют разные хэши потоков. Если установлен флаг B<PACKET_FANOUT_FLAG_DEFRAG>, то пакеты будут дефрагментироваться перед применением разветвления, что позволит сохранить порядок даже в этом случае. Параметры режима разветвления задаются во вторых 16 битах целочисленного значения параметра. Флаг B<PACKET_FANOUT_FLAG_ROLLOVER> включает механизм перекатывания в качестве запасного: если первоначальный алгоритм разветвления выбрал занятый сокет, то пакет переходит на следующий доступный.

source: B<PACKET_LOSS> (with B<PACKET_TX_RING>)
ru: B<PACKET_LOSS> (с B<PACKET_TX_RING>)

source: When a malformed packet is encountered on a transmit ring, the default is to reset its I<tp_status> to B<TP_STATUS_WRONG_FORMAT> and abort the transmission immediately. The malformed packet blocks itself and subsequently enqueued packets from being sent. The format error must be fixed, the associated I<tp_status> reset to B<TP_STATUS_SEND_REQUEST>, and the transmission process restarted via B<send>(2). However, if B<PACKET_LOSS> is set, any malformed packet will be skipped, its I<tp_status> reset to B<TP_STATUS_AVAILABLE>, and the transmission process continued.
ru: Когда в кольце передачи обнаруживается некорректный пакет, то по умолчанию его состояние в I<tp_status> сбрасывается в B<TP_STATUS_WRONG_FORMAT> и происходит немедленная отмена передачи. Некорректный пакет блокирует как свою отправку, так и всех следующих пакетов в очереди. Ошибка в формате должна быть исправлена, соответствующий I<tp_status> сброшен в значение B<TP_STATUS_SEND_REQUEST>, а передача перезапущена с помощью B<send>(2). Однако, если задан параметр B<PACKET_LOSS>, то все некорректные пакеты будут пропускаться, их I<tp_status> сбрасываться в B<TP_STATUS_AVAILABLE> и процесс передачи продолжаться.

source: B<PACKET_RESERVE> (with B<PACKET_RX_RING>)
ru: B<PACKET_RESERVE> (с B<PACKET_RX_RING>)

source: By default, a packet receive ring writes packets immediately following the metadata structure and alignment padding. This integer option reserves additional headroom.
ru: По умолчанию, в кольцо приёма пакетов сразу за пакетом записывается структура метаданных и заполнитель для выравнивания. Этот целочисленный параметр резервирует дополнительное свободное место.

source: Create a memory-mapped ring buffer for asynchronous packet reception. The packet socket reserves a contiguous region of application address space, lays it out into an array of packet slots and copies packets (up to I<tp_snaplen>) into subsequent slots. Each packet is preceded by a metadata structure similar to I<tpacket_auxdata>. The protocol fields encode the offset to the data from the start of the metadata header. I<tp_net> stores the offset to the network layer. If the packet socket is of type B<SOCK_DGRAM>, then I<tp_mac> is the same. If it is of type B<SOCK_RAW>, then that field stores the offset to the link-layer frame. Packet socket and application communicate the head and tail of the ring through the I<tp_status> field. The packet socket owns all slots with I<tp_status> equal to B<TP_STATUS_KERNEL>. After filling a slot, it changes the status of the slot to transfer ownership to the application. During normal operation, the new I<tp_status> value has at least the B<TP_STATUS_USER> bit set to signal that a received packet has been stored. When the application has finished processing a packet, it transfers ownership of the slot back to the socket by setting I<tp_status> equal to B<TP_STATUS_KERNEL>.
ru: Включает создание отображаемого в памяти кольцевого буфера асинхронного приёма пакетов. Пакетный сокет резервирует непрерывную область в адресном пространстве приложения, размечает её как массив пакетных слотов и последовательно копирует пакеты (не более I<tp_snaplen>) в слоты. В начале каждого пакета помещается структура метаданных, похожая на I<tpacket_auxdata>. В поле протокола кодируется смещение данных от начала заголовка метаданных. В I<tp_net> хранится смещение сетевого уровня. Если тип пакетного сокета — B<SOCK_DGRAM>, то это делается и для I<tp_mac>. Если тип — B<SOCK_RAW>, то в этом поле хранится смещение на кадр канального уровня. Пакетный сокет и приложение обмениваются началом и концом кольца через поле I<tp_status>. Пакетному сокету принадлежат все слоты со значением I<tp_status> равным B<TP_STATUS_KERNEL>. После заполнения слота, изменяется состояние слота и права на него передаются приложению. При нормальной работе в новом значении I<tp_status>, как минимум, установлен бит B<TP_STATUS_USER>, что показывает, что принятый пакет был сохранён. Когда приложение заканчивает обработку пакета, оно передаёт права на слот обратно сокету посредством установки I<tp_status> в значение B<TP_STATUS_KERNEL>.

source: Packet sockets implement multiple variants of the packet ring. The implementation details are described in I<Documentation/networking/packet_mmap.txt> in the Linux kernel source tree.
ru: Для пакетных сокетов реализовано несколько вариантов пакетных колец. Информацию о реализации можно найти в файле I<Documentation/networking/packet_mmap.txt> из дерева исходного кода ядра Linux.

source: Retrieve packet socket statistics in the form of a structure
ru: Возвращает статистику по пакетному сокету в виде структуры

source: struct tpacket_stats { unsigned int tp_packets; /* Total packet count */ unsigned int tp_drops; /* Dropped packet count */ };
ru: struct tpacket_stats { unsigned int tp_packets; /* общее количество пакетов */ unsigned int tp_drops; /* кол-во отброшенных пакетов */ };

source: Receiving statistics resets the internal counters. The statistics structure differs when using a ring of variant B<TPACKET_V3>.
ru: При получении статистики сбрасываются внутренние счётчики. Если используется вариант кольца B<TPACKET_V3>, то статистика имеет другую структуру.

source: B<PACKET_TIMESTAMP> (with B<PACKET_RX_RING>; since Linux 2.6.36)
ru: B<PACKET_TIMESTAMP> (с B<PACKET_RX_RING>; начиная с Linux 2.6.36)

source: The packet receive ring always stores a timestamp in the metadata header. By default, this is a software generated timestamp generated when the packet is copied into the ring. This integer option selects the type of timestamp. Besides the default, it support the two hardware formats described in I<Documentation/networking/timestamping.txt> in the Linux kernel source tree.
ru: В кольце приёма пакетов всегда сохраняется метка времени в заголовке метаданных. По умолчанию, это метка генерируется ПО при копировании пакета в кольцо. Данный целочисленный параметр задаёт тип метки времени. Кроме значения по умолчанию, поддерживается два аппаратных формата, описанных в файле I<Documentation/networking/timestamping.txt> из дерева исходного кода ядра Linux.

source: B<PACKET_TX_RING> (since Linux 2.6.31)
ru: B<PACKET_TX_RING> (начиная с Linux 2.6.31)

source: Create a memory-mapped ring buffer for packet transmission. This option is similar to B<PACKET_RX_RING> and takes the same arguments. The application writes packets into slots with I<tp_status> equal to B<TP_STATUS_AVAILABLE> and schedules them for transmission by changing I<tp_status> to B<TP_STATUS_SEND_REQUEST>. When packets are ready to be transmitted, the application calls B<send>(2) or a variant thereof. The I<buf> and I<len> fields of this call are ignored. If an address is passed using B<sendto>(2) or B<sendmsg>(2), then that overrides the socket default. On successful transmission, the socket resets I<tp_status> to B<TP_STATUS_AVAILABLE>. It immediately aborts the transmission on error unless B<PACKET_LOSS> is set.
ru: Включает создание отображаемого в памяти кольцевого буфера передачи пакетов. Этот параметр подобен B<PACKET_RX_RING> и имеет те же аргументы. Приложение записывает пакеты в слоты со значением I<tp_status> равным B<TP_STATUS_AVAILABLE> и планирует их для передачи делая значение I<tp_status> равным B<TP_STATUS_SEND_REQUEST>. Когда пакеты готовы к передаче, приложение вызывает B<send>(2) или его вариант. Поля I<buf> и I<len> в этом вызове игнорируются. Если передаётся адрес с помощью B<sendto>(2) или B<sendmsg>(2), то он заменяет сокетное значение по умолчанию. При успешной передаче сокет сбрасывает значение I<tp_status> в B<TP_STATUS_AVAILABLE>. При ошибке передача немедленно прерывается, если не задан B<PACKET_LOSS>.

source: B<PACKET_VERSION> (with B<PACKET_RX_RING>; since Linux 2.6.27)
ru: B<PACKET_VERSION> (с B<PACKET_RX_RING>; начиная с Linux 2.6.27)

source: By default, B<PACKET_RX_RING> creates a packet receive ring of variant B<TPACKET_V1>. To create another variant, configure the desired variant by setting this integer option before creating the ring.
ru: По умолчанию, B<PACKET_RX_RING> создаёт кольцо приёма пакетов по варианту B<TPACKET_V1>. Для создания другого варианта, задайте желаемый, указав целочисленное значение в этом параметре перед созданием кольца.

source: B<PACKET_QDISC_BYPASS> (since Linux 3.14)
ru: B<PACKET_QDISC_BYPASS> (начиная с Linux 3.14)

source: By default, packets sent through packet sockets pass through the kernel's qdisc (traffic control) layer, which is fine for the vast majority of use cases. For traffic generator appliances using packet sockets that intend to brute-force flood the network\(emfor example, to test devices under load in a similar fashion to pktgen\(emthis layer can be bypassed by setting this integer option to 1. A side effect is that packet buffering in the qdisc layer is avoided, which will lead to increased drops when network device transmit queues are busy; therefore, use at your own risk.
ru: По умолчанию, пакеты, посылаемые через пакетные сокеты, проходят через уровень ядра qdisc (управление трафиком), что правильно в подавляющем большинстве случаев. Для программно-аппаратных комплексов, использующих пакетные фильтры для затопления сети — например, для тестирования устройств под нагрузкой, подобно тому, как это делает pktgen — этот уровень можно не задействовать, установив целочисленной параметр в 1. Побочным эффектом будет отмена пакетной буферизации на уровне qdisc, что приведёт к увеличению отброшенных пакетов при занятости передающих очередей сетевого устройства; поэтому, пользуйтесь с осторожностью.

source: Ioctls
ru: Вызовы ioctl

source: B<SIOCGSTAMP> can be used to receive the timestamp of the last received packet. Argument is a I<struct timeval> variable.
ru: Вызов B<SIOCGSTAMP> можно использовать для получения метки времени последнего полученного пакета. Аргументом является I<struct timeval>.

source: In addition, all standard ioctls defined in B<netdevice>(7) and B<socket>(7) are valid on packet sockets.
ru: Также, для пакетных сокетов работают все стандартные ioctl, определённые в B<netdevice>(7) и B<socket>(7).

source: Error handling
ru: Обработка ошибок

source: Packet sockets do no error handling other than errors occurred while passing the packet to the device driver. They don't have the concept of a pending error.
ru: Пакетные сокеты не выполняют обработку ошибок, кроме ошибок, которые возникают при передаче пакета драйверу устройства. В них не заложен принцип ожидания ошибки.

source: ERRORS
ru: ОШИБКИ

source: Unknown multicast group address passed.
ru: Передан неизвестный адрес групповой рассылки.

source: User passed invalid memory address.
ru: Пользователь передал неправильный адрес памяти.

source: Invalid argument.
ru: Неверный аргумент.

source: Packet is bigger than interface MTU.
ru: Пакет больше, чем интерфейс MTU.

source: Interface is not up.
ru: Интерфейс не поднят.

source: Not enough memory to allocate the packet.
ru: Недостаточно памяти для размещения пакета.

source: Unknown device name or interface index specified in interface address.
ru: В адресе интерфейса указано неизвестное имя устройства или индекс интерфейса.

source: No packet received.
ru: Пакет не принят.

source: No interface address passed.
ru: Не передан адрес интерфейса.

source: Interface address contained an invalid interface index.
ru: В адресе интерфейса содержится некорректный индекс интерфейса.

source: User has insufficient privileges to carry out this operation.
ru: У пользователя недостаточно прав для выполнения этой операции.

source: In addition, other errors may be generated by the low-level driver.
ru: Также, драйвером низкого уровня могут генерироваться другие ошибки.

source: B<AF_PACKET> is a new feature in Linux 2.2. Earlier Linux versions supported only B<SOCK_PACKET>.
ru: B<AF_PACKET> появился в Linux 2.2. В ранних версиях Linux поддерживался только B<SOCK_PACKET>.

source: For portable programs it is suggested to use B<AF_PACKET> via B<pcap>(3); although this covers only a subset of the B<AF_PACKET> features.
ru: Для переносимых программ предлагается использовать B<AF_PACKET> в B<pcap>(3), хотя это покрывает не весь набор возможностей B<AF_PACKET>.

source: The B<SOCK_DGRAM> packet sockets make no attempt to create or parse the IEEE 802.2 LLC header for a IEEE 802.3 frame. When B<ETH_P_802_3> is specified as protocol for sending the kernel creates the 802.3 frame and fills out the length field; the user has to supply the LLC header to get a fully conforming packet. Incoming 802.3 packets are not multiplexed on the DSAP/SSAP protocol fields; instead they are supplied to the user as protocol B<ETH_P_802_2> with the LLC header prefixed. It is thus not possible to bind to B<ETH_P_802_3>; bind to B<ETH_P_802_2> instead and do the protocol multiplex yourself. The default for sending is the standard Ethernet DIX encapsulation with the protocol filled in.
ru: Пакетные сокеты B<SOCK_DGRAM> не пытаются создать или разобрать заголовок IEEE 802.2 LLC из кадров IEEE 802.3. Если для отправки в качестве протокола указан B<ETH_P_802_3>, то ядро создаёт кадр 802.3 и заполняет поле длины; пользователь передаёт заголовок LLC в пакете уже полностью заполненным. Входящие пакеты 802.3 не уплотняются по полям протокола DSAP/SSAP; вместо этого они передаются пользователю как протокол B<ETH_P_802_2> с начальным заголовком LLC. То есть невозможно выполнить привязку к B<ETH_P_802_3>; вместо этого выполняйте привязку к B<ETH_P_802_2> и выполняйте протокольное уплотнение самостоятельно. По умолчанию, отправка происходит в стандартной упаковке Ethernet DIX с заполненным полем протокола.

source: Packet sockets are not subject to the input or output firewall chains.
ru: Пакетные сокеты недоступны (not subject) во входной и выходной цепочках межсетевого экрана.

source: Compatibility
ru: Совместимость

source: In Linux 2.0, the only way to get a packet socket was with the call:
ru: В Linux 2.0 единственным способом получить пакетный сокет является вызов:

source: socket(AF_INET, SOCK_PACKET, protocol)
ru: socket(AF_INET, SOCK_PACKET, протокол)

source: This is still supported, but deprecated and strongly discouraged. The main difference between the two methods is that B<SOCK_PACKET> uses the old I<struct sockaddr_pkt> to specify an interface, which doesn't provide physical-layer independence.
ru: Он всё ещё поддерживается, но устарел и настоятельно не рекомендуется. Основным отличием между методами — для указания интерфейса через B<SOCK_PACKET> используется старая I<struct sockaddr_pkt>, которая не предоставляет независимого физического уровня.

source: I<spkt_family> contains the device type, I<spkt_protocol> is the IEEE 802.3 protocol type as defined in I<E<lt>sys/if_ether.hE<gt>> and I<spkt_device> is the device name as a null-terminated string, for example, eth0.
ru: В I<spkt_family> содержится тип устройства, в I<spkt_protocol> — тип протокола IEEE 802.3, определённый в I<E<lt>sys/if_ether.hE<gt>>, а в I<spkt_device> — имя устройства в виде строки с null в конце, например, eth0.

source: This structure is obsolete and should not be used in new code.
ru: Эта структура устарела и не должна использоваться в новом коде.

source: The IEEE 802.2/803.3 LLC handling could be considered as a bug.
ru: Способ обработки IEEE 802.2/803.3 LLC не считается за дефектный.

source: Socket filters are not documented.
ru: Не описаны сокетные фильтры.
