Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: This field specifies the format of the data returned by B<read>(2) on a B<perf_event_open>() file descriptor.
ru: В этом поле задаётся формат данных, возвращаемых B<read>(2) из файлового дескриптора B<perf_event_open>().

source: Adds the 64-bit I<time_enabled> field. This can be used to calculate estimated totals if the PMU is overcommitted and multiplexing is happening.
ru: Добавлять 64-битное поле I<time_enabled>. Его можно использовать для вычисления общей оценки, если PMU слишком загружено и возникло мультиплексирование.

source: Adds the 64-bit I<time_running> field. This can be used to calculate estimated totals if the PMU is overcommitted and multiplexing is happening.
ru: Добавлять 64-битное поле I<time_running>. Его можно использовать для вычисления общей оценки, если PMU слишком загружено и возникло мультиплексирование.

source: Adds a 64-bit unique value that corresponds to the event group.
ru: Добавлять 64-битное уникальное значение, которое соответствует группе событий.

source: Allows all counter values in an event group to be read with one read.
ru: Позволить все значения счётчиков в группе событий читать за один проход.

source: The I<disabled> bit specifies whether the counter starts out disabled or enabled. If disabled, the event can later be enabled by B<ioctl>(2), B<prctl>(2), or I<enable_on_exec>.
ru: Битом I<disabled> определяется, будет ли счётчик изначально включен или выключен. Если выключен, то событие может быть включено позже с помощью B<ioctl>(2), B<prctl>(2) или I<enable_on_exec>.

source: When creating an event group, typically the group leader is initialized with I<disabled> set to 1 and any child events are initialized with I<disabled> set to 0. Despite I<disabled> being 0, the child events will not start until the group leader is enabled.
ru: Обычно, при создании группы событий значение I<disabled> лидера группы устанавливается в 1, а у любого дочернего события I<disabled> устанавливается в 0. Несмотря на I<disabled> равное 0, дочерние события не запускаются до тех пор, пока не включится лидер группы.

source: The I<inherit> bit specifies that this counter should count events of child tasks as well as the task specified. This applies only to new children, not to any existing children at the time the counter is created (nor to any new children of existing children).
ru: Битом I<inherit> задаётся, должен ли этот счётчик событий считать события дочерних задач, кроме указанной задачи. Это применяется только к новым потомкам, а не к существующим на момент создания счётчика (и не к новым потомкам существующих потомков).

source: Inherit does not work for some combinations of I<read_format> values, such as B<PERF_FORMAT_GROUP>.
ru: Наследование не работает с некоторыми комбинациями значений I<read_format>, например с B<PERF_FORMAT_GROUP>.

source: The I<pinned> bit specifies that the counter should always be on the CPU if at all possible. It applies only to hardware counters and only to group leaders. If a pinned counter cannot be put onto the CPU (e.g., because there are not enough hardware counters or because of a conflict with some other event), then the counter goes into an 'error' state, where reads return end-of-file (i.e., B<read>(2) returns 0) until the counter is subsequently enabled or disabled.
ru: Битом I<pinned> определяется, что счётчик должен всегда быть на ЦП, если это возможно. Применяется только к аппаратным счётчикам и только для лидеров группы. Если прикреплённый счётчик невозможно поместить на ЦП (например, потому что кончились аппаратные счётчики или возник конфликт с другим событием), то счётчик переводится в состояние «ошибки», в котором чтение возвращает конец файла (т. е., B<read>(2) возвращает 0) до тех пор, пока счётчик не будет включен или выключен.

source: The I<exclusive> bit specifies that when this counter's group is on the CPU, it should be the only group using the CPU's counters. In the future this may allow monitoring programs to support PMU features that need to run alone so that they do not disrupt other hardware counters.
ru: Битом I<exclusive> определяется, что когда эта группа счётчиков на ЦП, то должна быть только одна группа использующая счётчики ЦП. В будущем, это может позволить следящим программам поддерживать возможности PMU, необходимые для автономной работы без нарушения других аппаратных счётчиков.

source: Note that many unexpected situations may prevent events with the I<exclusive> bit set from ever running. This includes any users running a system-wide measurement as well as any kernel use of the performance counters (including the commonly enabled NMI Watchdog Timer interface).
ru: Заметим, что многие неожиданные ситуации могут не позволить событиям с битом I<exclusive> даже выполниться. К ним относятся выполнение любых пользовательских системных измерений, а также использование ядром счётчиков производительности (включая обычно включённый интерфейс NMI Watchdog Timer).

source: If this bit is set, the count excludes events that happen in user space.
ru: Если этот бит установлен, то счётчик не учитывает события, происходящие в пользовательском пространстве.

source: If this bit is set, the count excludes events that happen in kernel space.
ru: Если этот бит установлен, то счётчик не учитывает события, происходящие в пространстве ядра.

source: If this bit is set, the count excludes events that happen in the hypervisor. This is mainly for PMUs that have built-in support for handling this (such as POWER). Extra support is needed for handling hypervisor measurements on most machines.
ru: Если этот бит установлен, то счётчик не учитывает события, происходящие в гипервизоре. В основном для PMU, имеющего для этого возможности (такие как POWER). На большинстве машин необходима дополнительная поддержка для измерений гипервизора.

source: If set, don't count when the CPU is running the idle task. While you can currently enable this for any event type, it is ignored for all but software events.
ru: Если установлен, то счётчик не учитывает когда ЦП выполняет задачу простоя. Хотя сейчас вы и можете включить его для любого типа события, он игнорируется во всех кроме программных событий.

source: The I<mmap> bit enables generation of B<PERF_RECORD_MMAP> samples for every B<mmap>(2) call that has B<PROT_EXEC> set. This allows tools to notice new executable code being mapped into a program (dynamic shared libraries for example) so that addresses can be mapped back to the original code.
ru: Бит I<mmap> включает генерацию измерений B<PERF_RECORD_MMAP> для каждого вызова B<mmap>(2) с установленными битом B<PROT_EXEC>. Это позволяет инструментам замечать новый исполняемый код, отображённый в программу (например, общие динамические библиотеки) так, чтобы адреса можно было отобразить обратно в первоначальный код.

source: The I<comm> bit enables tracking of process command name as modified by the B<exec>(2) and B<prctl>(PR_SET_NAME) system calls as well as writing to I</proc/self/comm>. If the I<comm_exec> flag is also successfully set (possible since Linux 3.16), then the misc flag B<PERF_RECORD_MISC_COMM_EXEC> can be used to differentiate the B<exec>(2) case from the others.
ru: Битом I<comm> включается слежение за именем команды процесса, изменяемого системными вызовами B<exec>(2) и B<prctl>(PR_SET_NAME), а также через запись в I</proc/self/comm>. Если флаг I<comm_exec> также установлен (работает, начиная с Linux 3.16), то можно использовать вспомогательный флаг B<PERF_RECORD_MISC_COMM_EXEC>, чтобы отличить использование B<exec>(2) от остальных.

source: If this bit is set, then I<sample_frequency> not I<sample_period> is used when setting up the sampling interval.
ru: Если этот бит установлен, то задания интервала измерения используется I<sample_frequency>, а не I<sample_period>.

source: This bit enables saving of event counts on context switch for inherited tasks. This is meaningful only if the I<inherit> field is set.
ru: Этот бит включает сохранение счётчика событий при переключении контекста для наследуемых задач. Это полезно только, если установлен бит I<inherit>.

source: If this bit is set, a counter is automatically enabled after a call to B<exec>(2).
ru: Если этот бит установлен, то счётчик автоматически включается после вызова B<exec>(2).

source: If this bit is set, then fork/exit notifications are included in the ring buffer.
ru: Если этот бит установлен, то в кольцевой буфер включаются уведомления fork/exit.

source: If set, have an overflow notification happen when we cross the I<wakeup_watermark> boundary. Otherwise, overflow notifications happen after I<wakeup_events> samples.
ru: Если установлен, то выдаётся уведомление о переполнении при пересечении границы I<wakeup_watermark>. В противном случае, уведомления о переполнении выдаются после I<wakeup_events> измерений.

source: I<precise_ip> (since Linux 2.6.35)
ru: I<precise_ip> (начиная с Linux 2.6.35)

source: This controls the amount of skid. Skid is how many instructions execute between an event of interest happening and the kernel being able to stop and record the event. Smaller skid is better and allows more accurate reporting of which events correspond to which instructions, but hardware is often limited with how small this can be.
ru: Управляет размером ската (skid). Скат — количество инструкций, выполняемое между возникновением интересующего события и когда ядро способно остановиться и записать событие. Чем меньше скат тем лучше: это приближает события к инструкциям, от которых они возникли, но часто значение ограничивается аппаратурой.

source: The possible values of this field are the following:
ru: Возможными значениями этого поля могут быть:

source: B<SAMPLE_IP> can have arbitrary skid.
ru: B<SAMPLE_IP> может иметь произвольный скат.

source: B<SAMPLE_IP> must have constant skid.
ru: B<SAMPLE_IP> должен иметь постоянный скат.

source: B<SAMPLE_IP> requested to have 0 skid.
ru: B<SAMPLE_IP> запрашивает нулевой скат.

source: B<SAMPLE_IP> must have 0 skid. See also the description of B<PERF_RECORD_MISC_EXACT_IP>.
ru: Значение B<SAMPLE_IP> должно иметь 0 скат (skid). Смотрите также описание I в B<PERF_RECORD_MISC_EXACT_IP>().

source: I<mmap_data> (since Linux 2.6.36)
ru: I<mmap_data> (начиная с Linux 2.6.36)

source: This is the counterpart of the I<mmap> field. This enables generation of B<PERF_RECORD_MMAP> samples for B<mmap>(2) calls that do not have B<PROT_EXEC> set (for example data and SysV shared memory).
ru: Противоположно полю I<mmap>. Включает генерацию измерений B<PERF_RECORD_MMAP> для вызовов B<mmap>(2), у которых не установлен бит B<PROT_EXEC> (например, у данных и общей памяти SysV).

source: I<sample_id_all> (since Linux 2.6.38)
ru: I<sample_id_all> (начиная с Linux 2.6.38)

source: If set, then TID, TIME, ID, STREAM_ID, and CPU can additionally be included in non-B<PERF_RECORD_SAMPLE>s if the corresponding I<sample_type> is selected.
ru: Если установлен, то TID, TIME, ID, STREAM_ID и ЦП могут дополнительно включаться в не-B<PERF_RECORD_SAMPLE>, если выбран соответствующий I<sample_type>.

source: If B<PERF_SAMPLE_IDENTIFIER> is specified, then an additional ID value is included as the last value to ease parsing the record stream. This may lead to the I<id> value appearing twice.
ru: Если указан B<PERF_SAMPLE_IDENTIFIER>, то дополнительно включается значение ID в качестве последнего значения для облегчения разбора потока записей. Это может привести к появлению значения I<id> дважды.

source: The layout is described by this pseudo-structure:
ru: Состав описывается следующей псевдо-структурой:

source: struct sample_id { { u32 pid, tid; } /* if PERF_SAMPLE_TID set */ { u64 time; } /* if PERF_SAMPLE_TIME set */ { u64 id; } /* if PERF_SAMPLE_ID set */ { u64 stream_id;} /* if PERF_SAMPLE_STREAM_ID set */ { u32 cpu, res; } /* if PERF_SAMPLE_CPU set */ { u64 id; } /* if PERF_SAMPLE_IDENTIFIER set */ };
ru: struct sample_id { { u32 pid, tid; } /* если есть PERF_SAMPLE_TID */ { u64 time; } /* если есть PERF_SAMPLE_TIME */ { u64 id; } /* если есть PERF_SAMPLE_ID */ { u64 stream_id;} /* если есть PERF_SAMPLE_STREAM_ID */ { u32 cpu, res; } /* если есть PERF_SAMPLE_CPU */ { u64 id; } /* если есть PERF_SAMPLE_IDENTIFIER */ };

source: I<exclude_host> (since Linux 3.2)
ru: I<exclude_host> (начиная с Linux 3.2)

source: When conducting measurements that include processes running VM instances (i.e., have executed a B<KVM_RUN> B<ioctl>(2)), only measure events happening inside a guest instance. This is only meaningful outside the guests; this setting does not change counts gathered inside of a guest. Currently, this functionality is x86 only.
ru: При проведении измерений, которые включают процессы, запускающие экземпляры VM (т. е. выполняют I B<ioctl>(2) B<KVM_RUN>), измеряются только события, возникающие внутри гостевого экземпляра. Имеет смысл только вне гостевых машин; эта настройка не изменяет счётчики, собираемые внутри гостей. В настоящее время работает только на x86.

source: I<exclude_guest> (since Linux 3.2)
ru: I<exclude_guest> (начиная с Linux 3.2)

source: When conducting measurements that include processes running VM instances (i.e., have executed a B<KVM_RUN> B<ioctl>(2)), do not measure events happening inside guest instances. This is only meaningful outside the guests; this setting does not change counts gathered inside of a guest. Currently, this functionality is x86 only.
ru: При проведении измерений, которые включают процессы, запускающие экземпляры VM (т. е. выполняют I B<ioctl>(2) B<KVM_RUN>), не измеряются события, возникающие внутри гостевого экземпляра. Имеет смысл только вне гостевых машин; эта настройка не изменяет счётчики, собираемые внутри гостей. В настоящее время работает только на x86.

source: I<exclude_callchain_kernel> (since Linux 3.7)
ru: I<exclude_callchain_kernel> (начиная с Linux 3.7)

source: Do not include kernel callchains.
ru: Не включать цепочку вызовов ядра.

source: I<exclude_callchain_user> (since Linux 3.7)
ru: I<exclude_callchain_user> (начиная с Linux 3.7)

source: Do not include user callchains.
ru: Не включать цепочку вызовов пользовательского пространства.

source: I<mmap2> (since Linux 3.16)
ru: I<mmap2> (начиная с Linux 3.16)

source: Generate an extended executable mmap record that contains enough additional information to uniquely identify shared mappings. The I<mmap> flag must also be set for this to work.
ru: Генерировать расширенную запись выполняемого mmap, которая содержит дополнительную информацию, достаточную для определения уникальности общих отображений. Для работы также требуется установить флаг I<mmap>.

source: I<comm_exec> (since Linux 3.16)
ru: I<comm_exec> (начиная с Linux 3.16)

source: This is purely a feature-detection flag, it does not change kernel behavior. If this flag can successfully be set, then, when I<comm> is enabled, the B<PERF_RECORD_MISC_COMM_EXEC> flag will be set in the I<misc> field of a comm record header if the rename event being reported was caused by a call to B<exec>(2). This allows tools to distinguish between the various types of process renaming.
ru: Флаг определения свойств, не изменяет поведение ядра. Если флаг установлен, то когда включён I<comm>, будет устанавливаться флаг B<PERF_RECORD_MISC_COMM_EXEC> в поле I<misc> заголовка записи comm, если сообщается о событии переименования, вызванного вызовом B<exec>(2). Это позволяет инструментам различать различные тип переименования процесса.

source: I<use_clockid> (since Linux 4.1)
ru: I<use_clockid> (начиная с Linux 4.1)

source: This allows selecting which internal Linux clock to use when generating timestamps via the I<clockid> field. This can make it easier to correlate perf sample times with timestamps generated by other tools.
ru: Через I<clockid> позволяет выбрать внутренние часы Linux, используемые для генерации меток времени. Это может облегчить соответствие времён измерений с метками времени, сгенерированными другими инструментами.

source: I<context_switch> (since Linux 4.3)
ru: I<context_switch> (начиная с Linux 4.3)

source: This enables the generation of B<PERF_RECORD_SWITCH> records when a context switch occurs. It also enables the generation of B<PERF_RECORD_SWITCH_CPU_WIDE> records when sampling in CPU-wide mode. This functionality is in addition to existing tracepoint and software events for measuring context switches. The advantage of this method is that it will give full information even with strict I<perf_event_paranoid> settings.
ru: Включает генерацию записей B<PERF_RECORD_SWITCH> при переключении контекста. Также включает генерацию записей B<PERF_RECORD_SWITCH_CPU_WIDE> при измерении в режиме CPU-wide. Данная возможность дополняет существующие точки трассировки и программные события для измерения переключений контекста. Преимущество этого метода в том, что он даёт полную информацию даже при ограничительных настройках I<perf_event_paranoid>.

source: This union sets how many samples (I<wakeup_events>) or bytes (I<wakeup_watermark>) happen before an overflow notification happens. Which one is used is selected by the I<watermark> bit flag.
ru: Это объединение задаёт как много измерений (I<wakeup_events>) или байт (I<wakeup_watermark>) должно произойти до уведомления о переполнении. Используемое поле выбирается битом флага I<watermark>.

source: I<wakeup_events> counts only B<PERF_RECORD_SAMPLE> record types. To receive overflow notification for all B<PERF_RECORD> types choose watermark and set I<wakeup_watermark> to 1.
ru: В I<wakeup_events> подсчитываются только записи с типом B<PERF_RECORD_SAMPLE>. Для приёма уведомления о переполнении всех типов B<PERF_RECORD> выберите watermark и присвойте I<wakeup_watermark> значение 1.

source: Prior to Linux 3.0, setting I<wakeup_events> to 0 resulted in no overflow notifications; more recent kernels treat 0 the same as 1.
ru: До Linux 3.0 установка I<wakeup_events> в 0 приводила к выключению уведомления о переполнении; новые ядра считают 0 как 1.

source: I<bp_type> (since Linux 2.6.33)
ru: I<bp_type> (начиная с Linux 2.6.33)

source: This chooses the breakpoint type. It is one of:
ru: Задаёт тип точки останова. Может быть:

source: No breakpoint.
ru: Нет точки останова.

source: Count when we read the memory location.
ru: Считать, когда выполняется чтение из определённого места памяти.

source: Count when we write the memory location.
ru: Считать, когда выполняется запись в определённое место памяти.

source: Count when we read or write the memory location.
ru: Считать, когда выполняется чтение или запись в определённое место памяти.

source: Count when we execute code at the memory location.
ru: Считать, когда выполняется код из определённого места памяти.

source: The values can be combined via a bitwise or, but the combination of B<HW_BREAKPOINT_R> or B<HW_BREAKPOINT_W> with B<HW_BREAKPOINT_X> is not allowed.
ru: Значения можно побитово объединять, но комбинация B<HW_BREAKPOINT_R> или B<HW_BREAKPOINT_W> с B<HW_BREAKPOINT_X> недопустима.

source: I<bp_addr> (since Linux 2.6.33)
ru: I<bp_addr> (начиная с Linux 2.6.33)

source: This is the address of the breakpoint. For execution breakpoints, this is the memory address of the instruction of interest; for read and write breakpoints, it is the memory address of the memory location of interest.
ru: Адрес точки останова. Для точек останова выполнения это адрес памяти интересующей инструкции; для точек останова чтения и записи это адрес памяти интересующего расположения в памяти.

source: I<config1> (since Linux 2.6.39)
ru: I<config1> (начиная с Linux 2.6.39)

source: I<config1> is used for setting events that need an extra register or otherwise do not fit in the regular config field. Raw OFFCORE_EVENTS on Nehalem/Westmere/SandyBridge use this field on Linux 3.3 and later kernels.
ru: Значение I<config1> используется для задания событий, которым нужен дополнительный регистр или не хватает обычного поля config. Это поле используется в Linux 3.3 и новее для неструктурированного OFFCORE_EVENTS на архитектурах Nehalem/Westmere/SandyBridge.

source: I<bp_len> (since Linux 2.6.33)
ru: I<bp_len> (начиная с Linux 2.6.33)

source: I<bp_len> is the length of the breakpoint being measured if I<type> is B<PERF_TYPE_BREAKPOINT>. Options are B<HW_BREAKPOINT_LEN_1>, B<HW_BREAKPOINT_LEN_2>, B<HW_BREAKPOINT_LEN_4>, and B<HW_BREAKPOINT_LEN_8>. For an execution breakpoint, set this to I<sizeof(long)>.
ru: В I<bp_len> содержится длина точки измеряемой останова, если значение I<type> равно B<PERF_TYPE_BREAKPOINT>. Можно указывать B<HW_BREAKPOINT_LEN_1>, B<HW_BREAKPOINT_LEN_2>, B<HW_BREAKPOINT_LEN_4> и B<HW_BREAKPOINT_LEN_8>. Для точки останова выполнения присвойте I<sizeof(long)>.

source: I<config2> (since Linux 2.6.39)
ru: I<config2> (начиная с Linux 2.6.39)

source: I<config2> is a further extension of the I<config1> field.
ru: Поле I<config2> — дальнейшее расширение поля I<config1>.

source: I<branch_sample_type> (since Linux 3.4)
ru: I<branch_sample_type> (начиная с Linux 3.4)

source: If B<PERF_SAMPLE_BRANCH_STACK> is enabled, then this specifies what branches to include in the branch record.
ru: Если установлен B<PERF_SAMPLE_BRANCH_STACK>, то ветви будут включаться в запись ветви.

source: The first part of the value is the privilege level, which is a combination of one of the values listed below. If the user does not set privilege level explicitly, the kernel will use the event's privilege level. Event and branch privilege levels do not have to match.
ru: В первой части значения задаётся уровень привилегий, который может быть комбинацией одного из показанных ниже значений. Если пользователь явно не задал уровень привилегий, то ядро будет использовать уровень привилегий события. Событие и уровни привилегий ветви не совпадают.

source: Branch target is in user space.
ru: Цель ветвления в пользовательском пространстве

source: Branch target is in kernel space.
ru: Цель ветвления в пространстве ядра

source: Branch target is in hypervisor.
ru: Цель ветвления в гипервизоре.

source: A convenience value that is the three preceding values ORed together.
ru: Подходящее значение состоит из трёх предшествующих значений объединённых OR.

source: In addition to the privilege value, at least one or more of the following bits must be set.
ru: В дополнении к значению привилегий, должно быть указано как минимум, одно из следующих:

source: Any branch type.
ru: Любой тип ветвления.

source: Any call branch (includes direct calls, indirect calls, and far jumps).
ru: Любое ветвление (прямые вызовы, косвенные вызовы и дальние переходы).

source: Indirect calls.
ru: Косвенные вызовы.

source: B<PERF_SAMPLE_BRANCH_CALL> (since Linux 4.4)
ru: B<PERF_SAMPLE_BRANCH_CALL> (начиная с Linux 4.4)

source: Direct calls.
ru: Прямые вызовы.

source: Any return branch.
ru: Любой возврат из ветвления.

source: B<PERF_SAMPLE_BRANCH_IND_JUMP> (since Linux 4.2)
ru: B<PERF_SAMPLE_BRANCH_IND_JUMP> (начиная с Linux 4.2)

source: Indirect jumps.
ru: Косвенные прыжки.

source: B<PERF_SAMPLE_BRANCH_COND> (since Linux 3.16)
ru: B<PERF_SAMPLE_BRANCH_COND> (начиная с Linux 3.16)

source: Conditional branches.
ru: Ветвления по условию.

source: B<PERF_SAMPLE_BRANCH_ABORT_TX> (since Linux 3.11)
ru: B<PERF_SAMPLE_BRANCH_ABORT_TX> (начиная с Linux 3.11)

source: Transactional memory aborts.
ru: Аварии транзакционной памяти.

source: B<PERF_SAMPLE_BRANCH_IN_TX> (since Linux 3.11)
ru: B<PERF_SAMPLE_BRANCH_IN_TX> (начиная с Linux 3.11)

source: Branch in transactional memory transaction.
ru: Ветвление в транзакции транзакционной памяти.

source: B<PERF_SAMPLE_BRANCH_NO_TX> (since Linux 3.11)
ru: B<PERF_SAMPLE_BRANCH_NO_TX> (начиная с Linux 3.11)
