Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The I<file_actions> argument specifies a sequence of file operations that are performed in the child process after the general processing described above, and before it performs the B<exec>(3). If I<file_actions> is NULL, then no special action is taken, and standard B<exec>(3) semantics apply--file descriptors open before the exec remain open in the new process, except those for which the B<FD_CLOEXEC> flag has been set. File locks remain in place.
ru: Аргумент I<file_actions> задаёт последовательность файловых операций, которые выполняются в дочернем процессе после общей обработки, описанной выше, и перед выполнением B<exec>(3). Если I<file_actions> равно NULL, то никаких специальных действий не производится и выполняются стандартные действия B<exec>(3) — файловые дескрипторы, открытые до выполнения exec, остаются открытыми и в новом процессе, за исключением тех, у которых установлен флаг B<FD_CLOEXEC>. Файловые блокировки остаются как были.

source: If I<file_actions> is not NULL, then it contains an ordered set of requests to B<open>(2), B<close>(2), and B<dup2>(2) files. These requests are added to the I<file_actions> by B<posix_spawn_file_actions_addopen>(3), B<posix_spawn_file_actions_addclose>(3), and B<posix_spawn_file_actions_adddup2>(3). The requested operations are performed in the order they were added to I<file_actions>.
ru: Если I<file_actions> не равно NULL, то в нём содержится упорядоченный набор запросов B<open>(2), B<close>(2) и B<dup2>(2) на файлы. Эти запросы добавляются в I<file_actions> с помощью B<posix_spawn_file_actions_addopen>(3), B<posix_spawn_file_actions_addclose>(3) и B<posix_spawn_file_actions_adddup2>(3). Запрашиваемые операции выполняются в порядке их добавления в I<file_actions>.

source: If any of the housekeeping actions fails (due to bogus values being passed or other reasons why signal handling, process scheduling, process group ID functions, and file descriptor operations might fail), the child process exits with exit value 127.
ru: Если какая-либо обслуживающая операция завершается с ошибкой, (из-за переданных некорректных значений или по другим причинам, из-за которых обработка сигналов, планирование процесса, функции изменения ID группы процесса и операции с файловыми дескрипторами завершается с ошибкой), дочерний процесс завершается с кодом выхода 127.

source: exec() step
ru: Шаг exec()

source: Once the child has successfully forked and performed all requested pre-exec steps, the child runs the requested executable.
ru: После того как потомок создан (fork) и выполнены все запрошенные шаги до exec, потомок выполняет запуск запрошенного исполняемого файла.

source: The child process takes its environment from the I<envp> argument, which is interpreted as if it had been passed to B<execve>(2). The arguments to the created process come from the I<argv> argument, which is processed as for B<execve>(2).
ru: Дочерний процесс берёт своё окружение из аргумента I<envp>, которое рассматривается также как если бы оно передавалось в B<execve>(2). Аргументы созданного процесса выбираются из аргумента I<argv>, который обрабатывается также как для B<execve>(2).

source: Upon successful completion, B<posix_spawn>() and B<posix_spawnp>() place the PID of the child process in I<pid>, and return 0. If there is an error before or during the B<fork>(2), then no child is created, the contents of I<*pid> are unspecified, and these functions return an error number as described below.
ru: При успешном завершении B<posix_spawn>() и B<posix_spawnp>() помещают PID дочернего процесса в I<pid> и возвращают 0. Если перед или во время B<fork>(2) возникла ошибка, то потомок не создаётся, содержимое I<*pid> неопределенно и функции возвращают номер ошибки (описано далее).

source: Even when these functions return a success status, the child process may still fail for a plethora of reasons related to its pre-B<exec>() initialization. In addition, the B<exec>(3) may fail. In all of these cases, the child process will exit with the exit value of 127.
ru: Даже когда эти функции выполняются без ошибок, дочерний процесс всё ещё может завершиться с ошибкой по многим причинам, касающимся инициализации до B<exec>(). Также, может завершиться ошибкой и B<exec>(3). Во всех этих случаях дочерний процесс завершается с кодом ошибки 127.

source: The B<posix_spawn>() and B<posix_spawnp>() functions fail only in the case where the underlying B<fork>(2) or B<vfork>(2) call fails; in these cases, these functions return an error number, which will be one of the errors described for B<fork>(2) or B<vfork>(2).
ru: Функции B<posix_spawn>() и B<posix_spawnp>() завершаются с ошибкой, только из-за ошибок в используемых вызовах B<fork>(2) и B<vfork>(2); в этих случаях эти функции возвращают номер ошибки, который может быть одним из описанных в B<fork>(2) или B<vfork>(2).

source: In addition, these functions fail if:
ru: Также, эти функции завершаются с ошибкой если:

source: Function not supported on this system.
ru: Функции не поддерживаются в этой системе.

source: The B<posix_spawn>() and B<posix_spawnp>() functions are available since glibc 2.2.
ru: Функции B<posix_spawn>() и B<posix_spawnp>() доступны в glibc начиная с версии 2.2.

source: The housekeeping activities in the child are controlled by the objects pointed to by I<attrp> (for non-file actions) and I<file_actions> In POSIX parlance, the I<posix_spawnattr_t> and I<posix_spawn_file_actions_t> data types are referred to as objects, and their elements are not specified by name. Portable programs should initialize these objects using only the POSIX-specified functions. (In other words, although these objects may be implemented as structures containing fields, portable programs must avoid dependence on such implementation details.)
ru: Обслуживающие действия в потомке управляются объектами, на который указывает I<attrp> (для не файловых действий) и I<file_actions>. В описании POSIX типы данных I<posix_spawnattr_t> и I<posix_spawn_file_actions_t> указываются как объекты, а их элементам не даны имена. Переносимые программы должны инициализировать эти объекты с только помощью функций, определённых в POSIX (другими словами, хотя эти объекты могут быть реализованы как структуры с полями, в переносимых программах нельзя привязываться к такой реализации).

source: According to POSIX, it unspecified whether fork handlers established with B<pthread_atfork>(3) are called when B<posix_spawn>() is invoked. On glibc, fork handlers are called only if the child is created using B<fork>(2).
ru: В POSIX не определено вызывать ли обработчики fork, установленные с помощью B<pthread_atfork>(3), при вызове B<posix_spawn>(). В glibc обработчики fork вызываются только, если потомок создан с помощью B<fork>(2).

source: There is no "posix_fspawn" function (i.e., a function that is to B<posix_spawn>() as B<fexecve>(3) is to B<execve>(2)). However, this functionality can be obtained by specifying the I<path> argument as one of the files in the caller's I</proc/self/fd> directory.
ru: Не существует функции «posix_fspawn» (т. е., функции типа B<posix_spawn>(), которая вызывала бы B<fexecve>(3) вместо B<execve>(2)). Однако, подобное поведение можно получить указав аргумент I<path> как один из файлов в каталоге I</proc/self/fd> вызывающего.

source: POSIX.1 says that when B<POSIX_SPAWN_SETSCHEDULER> is specified in I<spawn-flags>, then the B<POSIX_SPAWN_SETSCHEDPARAM> (if present) is ignored. However, before glibc 2.14, calls to B<posix_spawn>() failed with an error if B<POSIX_SPAWN_SETSCHEDULER> was specified without also specifying B<POSIX_SPAWN_SETSCHEDPARAM>.
ru: В POSIX.1 указано, что когда в I<spawn-flags> определён B<POSIX_SPAWN_SETSCHEDULER>, флаг B<POSIX_SPAWN_SETSCHEDPARAM> (если есть) игнорируется. Однако до glibc 2.14 вызов B<posix_spawn>() завершался с ошибкой, если B<POSIX_SPAWN_SETSCHEDULER> был указан, а B<POSIX_SPAWN_SETSCHEDPARAM> отсутствовал.

source: The program below demonstrates the use of various functions in the POSIX spawn API. The program accepts command-line attributes that can be used to create file actions and attributes objects. The remaining command-line arguments are used as the executable name and command-line arguments of the program that is executed in the child.
ru: Представленная далее программа показывает использование различных функций программного интерфейса POSIX для создания процессов. Она принимает атрибуты из командной строки, которые позволяют задать файловые действия и атрибуты объектов при создании. В остальных аргументах командной строки задаются имя исполняемого файла и аргументы командной строки для программы, исполняемой в потомке.

source: In the first run, the B<date>(1) command is executed in the child, and the B<posix_spawn>() call employs no file actions or attributes objects.
ru: Здесь для исполнения в потомке указана команда B<date>(1) и вызов B<posix_spawn>() не использует каких-либо файловых действий и атрибутов объекта.

source: $ B<./a.out date> PID of child: 7634 Tue Feb 1 19:47:50 CEST 2011 Child status: exited, status=0
ru: $ B<./a.out date> PID потомка: 7634 Tue Feb 1 19:47:50 CEST 2011 Состояние потомка: завершился, состояние=0

source: In the next run, the I<-c> command-line option is used to create a file actions object that closes standard output in the child. Consequently, B<date>(1) fails when trying to perform output and exits with a status of 1.
ru: Здесь параметром командной строки I<-c> передаётся объект файловых действий, которые закрывают стандартный вывод в потомке. В результате этого B<date>(1) завершается с ошибкой, когда пытается выполнить вывод данных и завершается с кодом состояния 1.

source: $ B<./a.out -c date> PID of child: 7636 date: write error: Bad file descriptor Child status: exited, status=1
ru: $ B<./a.out -c date> PID потомка: 7636 date: write error: Bad file descriptor Состояние потомка: завершился, состояние=1

source: In the next run, the I<-s> command-line option is used to create an attributes object that specifies that all (blockable) signals in the child should be blocked. Consequently, trying to kill child with the default signal sent by B<kill>(1) (i.e., B<SIGTERM>) fails, because that signal is blocked. Therefore, to kill the child, B<SIGKILL> is necessary (B<SIGKILL> can't be blocked).
ru: Здесь используется параметр командной строки I<-s> для создания объекта атрибутов, который используется для блокировки всех сигналов (блокируемых) в потомке. В результате этого попытка убить потомка сигналом по умолчанию (т. е., B<SIGTERM>) с помощью B<kill>(1) завершается ошибкой, так как этот сигнал заблокирован. Теперь, чтобы убить потомка, требуется сигнал B<SIGKILL> (B<SIGKILL> невозможно заблокировать).

source: $ B<./a.out -s sleep 60 &> [1] 7637 $ PID of child: 7638
ru: $ B<./a.out -s sleep 60 &> [1] 7637 $ PID потомка: 7638

source: $ B<kill 7638> $ B<kill -KILL 7638> $ Child status: killed by signal 9 [1]+ Done ./a.out -s sleep 60
ru: $ B<kill 7638> $ B<kill -KILL 7638> $ Состояние потомка: убит по сигналу 9 [1]+ Done ./a.out -s sleep 60

source: When we try to execute a nonexistent command in the child, the B<exec>(3) fails and the child exits with a status of 127.
ru: Когда мы пытаемся выполнить в потомке несуществующую команду, B<exec>(3) завершается с ошибкой и потомок завершается с кодом 127.

source: $ B<./a.out xxxxx PID of child: 10190 Child status: exited, status=127>
ru: $ B<./a.out xxxxx PID потомка: 10190 Состояние потомка: завершился, состояние=127>

source: /* Parse command-line options, which can be used to specify an attributes object and file actions object for the child. */
ru: /* разбор параметров командной строки, которые можно использовать в потомке в качестве объекта атрибутов и файловых действий */

source: while ((opt = getopt(argc, argv, "sc")) != -1) { switch (opt) { case \(aqc\(aq: /* -c: close standard output in child */
ru: while ((opt = getopt(argc, argv, "sc")) != -1) { switch (opt) { case \(aqc\(aq: /* -c: закрыть стандартный вывод в потомке */

source: /* Create a file actions object and add a "close" action to it */
ru: /* создаём объект файловых действий и добавляем в него действие «закрыть» */

source: case \(aqs\(aq: /* -s: block all signals in child */
ru: case \(aqs\(aq: /* -s: блокировать все сигналы в потомке */

source: /* Create an attributes object and add a "set signal mask" action to it */
ru: /* создаём объект атрибутов и добавляем в него действие «назначения сигнальной маски» */

source: /* Spawn the child. The name of the program to execute and the command-line arguments are taken from the command-line arguments of this program. The environment of the program execed in the child is made the same as the parent\(aqs environment. */
ru: /* Порождение потомка. Имя исполняемой программы и аргументы командной строки берутся из аргументов командной строки этой программы. Окружение исполняемой программы в потомке делается таким же как у родителя. */

source: /* Destroy any objects that we created earlier */
ru: /* уничтожаем все объекты, которые мы создали ранее */

source: printf("PID of child: %ld\en", (long) child_pid);
ru: printf("PID потомка: %ld\en", (long) child_pid);

source: /* Monitor status of the child until it terminates */
ru: /* отслеживаем состояние потомка до его завершения */

source: printf("Child status: "); if (WIFEXITED(status)) { printf("exited, status=%d\en", WEXITSTATUS(status)); } else if (WIFSIGNALED(status)) { printf("killed by signal %d\en", WTERMSIG(status)); } else if (WIFSTOPPED(status)) { printf("stopped by signal %d\en", WSTOPSIG(status)); } else if (WIFCONTINUED(status)) { printf("continued\en"); } } while (!WIFEXITED(status) && !WIFSIGNALED(status));
ru: printf("Состояние потомка: "); if (WIFEXITED(status)) { printf("завершился, состояние=%d\en", WEXITSTATUS(status)); } else if (WIFSIGNALED(status)) { printf("убит по сигналу %d\en", WTERMSIG(status)); } else if (WIFSTOPPED(status)) { printf("остановлен по сигналу %d\en", WSTOPSIG(status)); } else if (WIFCONTINUED(status)) { printf("выполняется\en"); } } while (!WIFEXITED(status) && !WIFSIGNALED(status));

source: pthread_setconcurrency, pthread_getconcurrency - set/get the concurrency level
ru: pthread_setconcurrency, pthread_getconcurrency - изменяет/возвращает уровень распараллеливания

source: The B<pthread_setconcurrency>() function informs the implementation of the application's desired concurrency level, specified in I<new_level>. The implementation takes this only as a hint: POSIX.1 does not specify the level of concurrency that should be provided as a result of calling B<pthread_setconcurrency>().
ru: Функция B<pthread_setconcurrency>() информирует реализацию приложения о желаемом уровне распараллеливания (concurrency level), задаваемом в I<new_level>. Реализация принимает это только как рекомендацию: в POSIX.1 не указан уровень распараллеливания, который должен получиться в результате вызова B<pthread_setconcurrency>().

source: Specifying I<new_level> as 0 instructs the implementation to manage the concurrency level as it deems appropriate.
ru: Значение I<new_level> равное 0 указывает реализации использовать уровень распараллеливания по своему усмотрению.

source: B<pthread_getconcurrency>() returns the current value of the concurrency level for this process.
ru: Функция B<pthread_getconcurrency>() возвращает текущее значение уровня распараллеливания для этого процесса.

source: On success, B<pthread_setconcurrency>() returns 0; on error, it returns a nonzero error number.
ru: При успешном выполнении B<pthread_setconcurrency>() возвращается 0; при ошибке возвращается ненулевой номер ошибки.

source: B<pthread_getconcurrency>() always succeeds, returning the concurrency level set by a previous call to B<pthread_setconcurrency>(), or 0, if B<pthread_setconcurrency>() has not previously been called.
ru: Функция B<pthread_getconcurrency>() всегда завершается успешно, возвращая уровень распараллеливания, заданный предыдущим вызовом B<pthread_setconcurrency>(), или 0, если функция B<pthread_setconcurrency>() не вызывалась.

source: B<pthread_setconcurrency>() can fail with the following error:
ru: Функция B<pthread_setconcurrency>() может завершиться со следующей ошибкой:

source: I<new_level> is negative.
ru: Значение I<new_level> отрицательно.

source: POSIX.1 also documents an B<EAGAIN> error ("the value specified by I<new_level> would cause a system resource to be exceeded").
ru: В POSIX.1 также описана ошибка B<EAGAIN> («значение, указанное в I<new_level>, привело бы к превышению системного ограничения»).

source: These functions are available in glibc since version 2.1.
ru: Эти функции доступны в glibc начиная с версии 2.1.

source: The default concurrency level is 0.
ru: Значение уровня распараллеливания по умолчанию равно 0.

source: Concurrency levels are meaningful only for M:N threading implementations, where at any moment a subset of a process's set of user-level threads may be bound to a smaller number of kernel-scheduling entities. Setting the concurrency level allows the application to give the system a hint as to the number of kernel-scheduling entities that should be provided for efficient execution of the application.
ru: Уровни распараллеливания имеют смысл только в реализациях нитей M:N, где в любой момент времени поднабор из набора пользовательских нитей процесса может быть ограничен меньшим количеством единиц планирования ядра. Назначение уровня распараллеливания позволяет приложению дать системе подсказку о количестве единиц планирования ядра для эффективного выполнения приложения.

source: Both LinuxThreads and NPTL are 1:1 threading implementations, so setting the concurrency level has no meaning. In other words, on Linux these functions merely exist for compatibility with other systems, and they have no effect on the execution of a program.
ru: В реализациях нитей LinuxThreads и NPTL используется отношение 1:1, поэтому назначение уровня распараллеливания не имеет смысла. Другими словами, в Linux эти функции существуют только лишь для совместимости с другими системами и никак не влияют на выполнение программы.

source: pthread_attr_init, pthread_attr_destroy - initialize and destroy thread attributes object
ru: pthread_attr_init, pthread_attr_destroy - инициализирует и уничтожает объект атрибутов нити

source: The B<pthread_attr_init>() function initializes the thread attributes object pointed to by I<attr> with default attribute values. After this call, individual attributes of the object can be set using various related functions (listed under SEE ALSO), and then the object can be used in one or more B<pthread_create>(3) calls that create threads.
ru: Функция B<pthread_attr_init>() инициализирует объект атрибутов нити, на который указывает I<attr>, значениями атрибутов по умолчанию. После этого вызова отдельные атрибуты объекта можно изменять с помощью различных соответствующих функций (перечислены в разделе СМОТРИТЕ ТАКЖЕ, а после этого объект можно использовать в одном или нескольких вызовах B<pthread_create>(3) для создания нитей.

source: Calling B<pthread_attr_init>() on a thread attributes object that has already been initialized results in undefined behavior.
ru: Вызов B<pthread_attr_init>() с уже инициализированным объектом атрибутов нити приводит к непредсказуемому поведению.

source: When a thread attributes object is no longer required, it should be destroyed using the B<pthread_attr_destroy>() function. Destroying a thread attributes object has no effect on threads that were created using that object.
ru: Когда объект атрибутов нити больше не нужен, он должен быть уничтожен с помощью функции B<pthread_attr_destroy>(). Уничтожение объекта атрибутов нити не влияет на нить, которая была создана с использованием этого объекта.

source: Once a thread attributes object has been destroyed, it can be reinitialized using B<pthread_attr_init>(). Any other use of a destroyed thread attributes object has undefined results.
ru: После уничтожения объекта атрибутов нити его можно инициализировать с помощью B<pthread_attr_init>() повторно. При использовании уничтоженного объекта атрибутов нити другим способом приводит непредсказуемым результатам.

source: POSIX.1 documents an B<ENOMEM> error for B<pthread_attr_init>(); on Linux these functions always succeed (but portable and future-proof applications should nevertheless handle a possible error return).
ru: В POSIX.1 описана ошибка B<ENOMEM> для B<pthread_attr_init>(); в Linux эти функции всегда выполняются успешно (тем не менее, в переносимых приложениях нужно учитывать возможность возврата ошибки).

source: The I<pthread_attr_t> type should be treated as opaque: any access to the object other than via pthreads functions is nonportable and produces undefined results.
ru: Тип I<pthread_attr_t> должен считаться со скрытым форматом: любой доступ к объекту помимо функций pthreads является непереносимым и приводит к непредсказуемым результатам.

source: The program below optionally makes use of B<pthread_attr_init>() and various related functions to initialize a thread attributes object that is used to create a single thread. Once created, the thread uses the B<pthread_getattr_np>(3) function (a nonstandard GNU extension) to retrieve the thread's attributes, and then displays those attributes.
ru: В программе, представленной ниже, для создания одной нити используется B<pthread_attr_init>() и другие функции, относящиеся к инициализации объекта атрибутов нити. После создания в нити используется функция B<pthread_getattr_np>(3) (нестандартное расширение GNU) для получения атрибутов нити, а затем показываются эти атрибуты.

source: If the program is run with no command-line argument, then it passes NULL as the I<attr> argument of B<pthread_create>(3), so that the thread is created with default attributes. Running the program on Linux/x86-32 with the NPTL threading implementation, we see the following:
ru: Если программа запускается без аргументов командной строки, то аргумент I<attr> функции B<pthread_create>(3) равен NULL, и поэтому нить создаётся с атрибутами по умолчанию. При запуске программы на Linux/x86-32 с реализацией нитей NPTL мы увидим следующее:

source: $B< ulimit -s> # No stack limit ==E<gt> default stack size is 2 MB unlimited $B< ./a.out> Thread attributes: Detach state = PTHREAD_CREATE_JOINABLE Scope = PTHREAD_SCOPE_SYSTEM Inherit scheduler = PTHREAD_INHERIT_SCHED Scheduling policy = SCHED_OTHER Scheduling priority = 0 Guard size = 4096 bytes Stack address = 0x40196000 Stack size = 0x201000 bytes
ru: $B< ulimit -s> # стек не ограничен ==E<gt> размер стека по умолчанию 2 МБ unlimited $B< ./a.out> Атрибуты нити: Состояние отсоединения = PTHREAD_CREATE_JOINABLE Область = PTHREAD_SCOPE_SYSTEM Унаследованный планировщик = PTHREAD_INHERIT_SCHED Алгоритм планирования = SCHED_OTHER Приоритет планирования = 0 Размер защиты = 4096 байт Адрес стека = 0x40196000 Размер стека = 0x201000 байт

source: When we supply a stack size as a command-line argument, the program initializes a thread attributes object, sets various attributes in that object, and passes a pointer to the object in the call to B<pthread_create>(3). Running the program on Linux/x86-32 with the NPTL threading implementation, we see the following:
ru: Если в командной строке мы укажем размер стека, то программа инициализирует объект атрибутов нити, задаёт различные атрибуты в этом объекте и передаёт указатель на объект в вызов B<pthread_create>(3). При запуске программы на Linux/x86-32 с реализацией нитей NPTL мы увидим следующее:
