Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Since Linux 2.6.38, B<perf_event_open>() can support multiple PMUs. To enable this, a value exported by the kernel can be used in the I<type> field to indicate which PMU to use. The value to use can be found in the sysfs filesystem: there is a subdirectory per PMU instance under I</sys/bus/event_source/devices>. In each subdirectory there is a I<type> file whose content is an integer that can be used in the I<type> field. For instance, I</sys/bus/event_source/devices/cpu/type> contains the value for the core CPU PMU, which is usually 4.
ru: Начиная с Linux 2.6.38, B<perf_event_open>() поддерживает несколько PMU. Чтобы задать используемый PMU, его указывают в значении I<type>, экспортируемое ядром. Нужное значение можно найти в файловой системе sysfs: для каждого экземпляра PMU создаётся подкаталог в каталоге I</sys/bus/event_source/devices>. В каждом подкаталоге есть файл I<type>, содержащий целое число, которое можно использовать в поле I<type>. Например, в I</sys/bus/event_source/devices/cpu/type> содержится значение для PMU ядра ЦП, которое, обычно равно 4.

source: B<kprobe> and B<uprobe> (since Linux 4.17)
ru: B<kprobe> и B<uprobe> (начиная с Linux 4.17)

source: These two dynamic PMUs create a kprobe/uprobe and attach it to the file descriptor generated by perf_event_open. The kprobe/uprobe will be destroyed on the destruction of the file descriptor. See fields I<kprobe_func>, I<uprobe_path>, I<kprobe_addr>, and I<probe_offset> for more details.
ru: Эти два динамических PMU создают kprobe/uprobe и присоединяют к файловому дескриптору, сгенерованному perf_event_open. kprobe/uprobe будет уничтожен при уничтожении файлового дескриптора. Подробности смотрите в описании полей I<kprobe_func>, I<uprobe_path>, I<kprobe_addr> и I<probe_offset>.

source: The size of the I<perf_event_attr> structure for forward/backward compatibility. Set this using I<sizeof(struct perf_event_attr)> to allow the kernel to see the struct size at the time of compilation.
ru: Размер структуры I<perf_event_attr> совместимости. Присвоение значения I<sizeof(struct perf_event_attr)> позволяет ядру видеть размер структуры во время компиляции.

source: The related define B<PERF_ATTR_SIZE_VER0> is set to 64; this was the size of the first published struct. B<PERF_ATTR_SIZE_VER1> is 72, corresponding to the addition of breakpoints in Linux 2.6.33. B<PERF_ATTR_SIZE_VER2> is 80 corresponding to the addition of branch sampling in Linux 3.4. B<PERF_ATTR_SIZE_VER3> is 96 corresponding to the addition of I<sample_regs_user> and I<sample_stack_user> in Linux 3.7. B<PERF_ATTR_SIZE_VER4> is 104 corresponding to the addition of I<sample_regs_intr> in Linux 3.19. B<PERF_ATTR_SIZE_VER5> is 112 corresponding to the addition of I<aux_watermark> in Linux 4.1.
ru: Соответствующее определение B<PERF_ATTR_SIZE_VER0> равно 64; это размер первой опубликованной структуры. Значение B<PERF_ATTR_SIZE_VER1> равно 72, соответствует добавленным в Linux 2.6.33 точкам останова. Значение B<PERF_ATTR_SIZE_VER2> равно 80, соответствует добавленным в Linux 3.4 ветвям замеров. Значение B<PERF_ATTR_SIZE_VER3> равно 96, соответствует добавленным в Linux 3.7 полям I<sample_regs_user> и I<sample_stack_user>. Значение B<PERF_ATTR_SIZE_VER4> равно 104, соответствует добавленному в Linux 3.19 полю I<sample_regs_intr>. Значение B<PERF_ATTR_SIZE_VER5> равно 112, соответствует добавленному в in Linux 4.1 полю I<aux_watermark>.

source: This specifies which event you want, in conjunction with the I<type> field. The I<config1> and I<config2> fields are also taken into account in cases where 64 bits is not enough to fully specify the event. The encoding of these fields are event dependent.
ru: Здесь указывается требуемое событие в сочетании с полем I<type>. Поля I<config1> и I<config2> также учитываются, если 64 бит недостаточно для полного описания события. Кодирование значения этих полей зависит от события.

source: There are various ways to set the I<config> field that are dependent on the value of the previously described I<type> field. What follows are various possible settings for I<config> separated out by I<type>.
ru: Есть несколько способов присвоения значения полю I<config>, которые зависят от значения описанного ранее поля I<type>. Содержимое различных возможных настроек I<config> выделяется по I<type>.

source: If I<type> is B<PERF_TYPE_HARDWARE>, we are measuring one of the generalized hardware CPU events. Not all of these are available on all platforms. Set I<config> to one of the following:
ru: Если I<type> равно B<PERF_TYPE_HARDWARE>, то измеряется одно из общих аппаратных событий ЦП. Не все из них доступны на всех платформах. В I<config> может быть одно из следующих значений:

source: Total cycles. Be wary of what happens during CPU frequency scaling.
ru: Общее количество циклов. Опасайтесь того, что происходит во время частотного масштабирования ЦП.

source: Retired instructions. Be careful, these can be affected by various issues, most notably hardware interrupt counts.
ru: Запоздалые инструкции (retired instructions). Осторожно, могут влиять различные ситуации, в основном, подсчёт аппаратных прерываний.

source: Cache accesses. Usually this indicates Last Level Cache accesses but this may vary depending on your CPU. This may include prefetches and coherency messages; again this depends on the design of your CPU.
ru: Доступ к кэшу. Обычно, учитывается доступ к кэшу последнего уровня, но для различных ЦП может быть по-разному. Может включать сообщения о предварительной выборке и связности; опять же, зависит от ЦП.

source: Cache misses. Usually this indicates Last Level Cache misses; this is intended to be used in conjunction with the B<PERF_COUNT_HW_CACHE_REFERENCES> event to calculate cache miss rates.
ru: Промахи кэша. Обычно, отражает промахи кэша последнего уровня; предназначена для использования вместе с событием B<PERF_COUNT_HW_CACHE_REFERENCES> для подсчёта коэффициента промахов кэша.

source: Retired branch instructions. Prior to Linux 2.6.35, this used the wrong event on AMD processors.
ru: Запоздалые инструкции ветвления. До Linux 2.6.35 использовалось неправильное сообщение на процессорах AMD.

source: Mispredicted branch instructions.
ru: Непредсказанные инструкции ветвления.

source: Bus cycles, which can be different from total cycles.
ru: Количество циклов шины, которое может отличаться от общего количества циклов.

source: B<PERF_COUNT_HW_STALLED_CYCLES_FRONTEND> (since Linux 3.0)
ru: B<PERF_COUNT_HW_STALLED_CYCLES_FRONTEND> (начиная с Linux 3.0)

source: Stalled cycles during issue.
ru: Блокировано циклов во время проблемы.

source: B<PERF_COUNT_HW_STALLED_CYCLES_BACKEND> (since Linux 3.0)
ru: B<PERF_COUNT_HW_STALLED_CYCLES_BACKEND> (начиная с Linux 3.0)

source: Stalled cycles during retirement.
ru: Блокировано циклов во время запаздывания.

source: B<PERF_COUNT_HW_REF_CPU_CYCLES> (since Linux 3.3)
ru: B<PERF_COUNT_HW_REF_CPU_CYCLES> (начиная с Linux 3.3)

source: Total cycles; not affected by CPU frequency scaling.
ru: Общее количество циклов; не подвержено влиянию частотного масштабирования ЦП.

source: If I<type> is B<PERF_TYPE_SOFTWARE>, we are measuring software events provided by the kernel. Set I<config> to one of the following:
ru: Если значение I<type> равно B<PERF_TYPE_SOFTWARE>, то измеряются программные события, предоставляемые ядром. Значением I<config> может быть одно из следующих:

source: This reports the CPU clock, a high-resolution per-CPU timer.
ru: Сообщить о часах ЦП, таймере высокого разрешения, работающем на каждом ЦП.

source: This reports a clock count specific to the task that is running.
ru: Сообщить о часах выполняющейся задачи.

source: This reports the number of page faults.
ru: Сообщить о количестве сбойных страниц.

source: This counts context switches. Until Linux 2.6.34, these were all reported as user-space events, after that they are reported as happening in the kernel.
ru: Подсчёт числа переключений контекста. До Linux 2.6.34, это считалось событиями пользовательского пространства, теперь об этом сообщается как о происходящем в ядре.

source: This reports the number of times the process has migrated to a new CPU.
ru: Сообщить сколько раз процесс перемещался в другой ЦП.

source: This counts the number of minor page faults. These did not require disk I/O to handle.
ru: Сообщить о количестве незначительных промахов страниц. Они не связаны с обработкой дисковых операций ввода-вывода.

source: This counts the number of major page faults. These required disk I/O to handle.
ru: Сообщить о количестве значительных промахов страниц. Они связаны с обработкой дисковых операций ввода-вывода.

source: B<PERF_COUNT_SW_ALIGNMENT_FAULTS> (since Linux 2.6.33)
ru: B<PERF_COUNT_SW_ALIGNMENT_FAULTS> (начиная с Linux 2.6.33)

source: This counts the number of alignment faults. These happen when unaligned memory accesses happen; the kernel can handle these but it reduces performance. This happens only on some architectures (never on x86).
ru: Сообщить о количестве ошибок выравнивания. Они возникают, когда происходит доступ к памяти по невыровненному адресу; ядро может обработать такую ситуацию, но это снижает производительность. Бывает только на некоторых архитектурах (на x86 — никогда).

source: B<PERF_COUNT_SW_EMULATION_FAULTS> (since Linux 2.6.33)
ru: B<PERF_COUNT_SW_EMULATION_FAULTS> (начиная с Linux 2.6.33)

source: This counts the number of emulation faults. The kernel sometimes traps on unimplemented instructions and emulates them for user space. This can negatively impact performance.
ru: Сообщить о количестве ошибок эмуляции. Ядро иногда попадает в ловушки нереализованных инструкций и эмулирует их в пользовательском пространстве. Это может негативно отражаться на производительности.

source: B<PERF_COUNT_SW_DUMMY> (since Linux 3.12)
ru: B<PERF_COUNT_SW_DUMMY> (начиная с Linux 3.12)

source: This is a placeholder event that counts nothing. Informational sample record types such as mmap or comm must be associated with an active event. This dummy event allows gathering such records without requiring a counting event.
ru: Заместитель события, которое ничего не подсчитывает. This is a placeholder event that counts nothing. Информационные образцы типов записей, таких как mmap или comm, должны быть связаны с активным событием. Данное пустое событие позволяет собирать такие записи без необходимости в подсчитывающем событии.

source: If I<type> is B<PERF_TYPE_TRACEPOINT>, then we are measuring kernel tracepoints. The value to use in I<config> can be obtained from under debugfs I<tracing/events/*/*/id> if ftrace is enabled in the kernel.
ru: Если I<type> равно B<PERF_TYPE_TRACEPOINT>, то измеряется точки трассировки ядра. Значение, используемое в I<config>, можно получить из debugfs I<tracing/events/*/*/id>, если ftrace включён в ядре.

source: If I<type> is B<PERF_TYPE_HW_CACHE>, then we are measuring a hardware CPU cache event. To calculate the appropriate I<config> value use the following equation:
ru: Если I<type> равно B<PERF_TYPE_HW_CACHE>, то измеряется событие кэша аппаратного ЦП. Для вычисления соответствующего значения I<config> используйте следующую формулу:

source: where I<perf_hw_cache_id> is one of:
ru: где I<perf_hw_cache_id> одно из:

source: for measuring Level 1 Data Cache
ru: для измерения кэша данных 1-го уровня

source: for measuring Level 1 Instruction Cache
ru: для измерения кэша инструкций 1-го уровня

source: for measuring Last-Level Cache
ru: для измерения кэша последнего уровня

source: for measuring the Data TLB
ru: для измерения TLB данных

source: for measuring the Instruction TLB
ru: для измерения TLB инструкций

source: for measuring the branch prediction unit
ru: для измерения модуля предсказания ветвлений

source: B<PERF_COUNT_HW_CACHE_NODE> (since Linux 3.1)
ru: B<PERF_COUNT_HW_CACHE_NODE> (начиная с Linux 3.1)

source: for measuring local memory accesses
ru: для измерения доступа к локальной памяти

source: and I<perf_hw_cache_op_id> is one of:
ru: и I<perf_hw_cache_op_id> одно из:

source: for read accesses
ru: для доступа на чтение

source: for write accesses
ru: для доступа на запись

source: for prefetch accesses
ru: для доступа предварительной выборки

source: and I<perf_hw_cache_op_result_id> is one of:
ru: и I<perf_hw_cache_op_result_id> одно из:

source: to measure accesses
ru: для измерения доступа

source: to measure misses
ru: для измерения промахов

source: If I<type> is B<PERF_TYPE_RAW>, then a custom "raw" I<config> value is needed. Most CPUs support events that are not covered by the "generalized" events. These are implementation defined; see your CPU manual (for example the Intel Volume 3B documentation or the AMD BIOS and Kernel Developer Guide). The libpfm4 library can be used to translate from the name in the architectural manuals to the raw hex value B<perf_event_open>() expects in this field.
ru: Если I<type> равно B<PERF_TYPE_RAW>, то требуется пользовательское «неструктурированное» значение I<config>. Большинство ЦП поддерживают события, которые не подпадают под «общие» события. Они определяются реализацией; смотрите руководство на ЦП (например, документацию Intel Volume 3B или AMD BIOS и руководство разработчика ядра). Для трансляции ожидаемых значений в этом поле шестнадцатеричных значений в B<perf_event_open>() из имён справочников по архитектуре можно использовать библиотеку libpfm4.

source: If I<type> is B<PERF_TYPE_BREAKPOINT>, then leave I<config> set to zero. Its parameters are set in other places.
ru: Если I<type> равно B<PERF_TYPE_BREAKPOINT>, то присвойте I<config> значение 0. Его параметры задаются в других местах.

source: If I<type> is B<kprobe> or B<uprobe>, set I<retprobe> (bit 0 of I<config>, see I</sys/bus/event_source/devices/[k,u]probe/format/retprobe>) for kretprobe/uretprobe. See fields I<kprobe_func>, I<uprobe_path>, I<kprobe_addr>, and I<probe_offset> for more details.
ru: Если I<type> равно B<kprobe> или B<uprobe>, установите I<retprobe> (бит 0 в I<config>, смотрите I</sys/bus/event_source/devices/[k,u]probe/format/retprobe>) равным kretprobe/uretprobe. Дополнительную информацию смотрите в описании полей I<kprobe_func>, I<uprobe_path>, I<kprobe_addr> и I<probe_offset>.

source: I<kprobe_func>, I<uprobe_path>, I<kprobe_addr>, and I<probe_offset>
ru: I<kprobe_func>, I<uprobe_path>, I<kprobe_addr> и I<probe_offset>

source: These fields describe the kprobe/uprobe for dynamic PMUs B<kprobe> and B<uprobe>. For B<kprobe>: use I<kprobe_func> and I<probe_offset>, or use I<kprobe_addr> and leave I<kprobe_func> as NULL. For B<uprobe>: use I<uprobe_path> and I<probe_offset>.
ru: Эти поля описывают kprobe/uprobe в динамических PMU B<kprobe> и B<uprobe>. Для B<kprobe>: используйте I<kprobe_func> и I<probe_offset>, или используйте I<kprobe_addr> и оставьте I<kprobe_func> равным NULL. Для B<uprobe>: используйте I<uprobe_path> и I<probe_offset>.

source: A "sampling" event is one that generates an overflow notification every N events, where N is given by I<sample_period>. A sampling event has I<sample_period> E<gt> 0. When an overflow occurs, requested data is recorded in the mmap buffer. The I<sample_type> field controls what data is recorded on each overflow.
ru: «Измеряющее» событие генерирует уведомление о переполнении каждые N событий, где N указывается в I<sample_period>. У измеряющего события I<sample_period> E<gt> 0. Если происходит переполнение, то запрашиваемые данные записываются в буфер mmap. В поле I<sample_type> указывается какие данные записываются при каждом переполнении.

source: I<sample_freq> can be used if you wish to use frequency rather than period. In this case, you set the I<freq> flag. The kernel will adjust the sampling period to try and achieve the desired rate. The rate of adjustment is a timer tick.
ru: Если вы хотите использовать частоту, а не период, то можно использовать I<sample_freq>. В этом случае установите флаг I<freq>. Ядро откорректирует период измерений, чтобы попытаться достигнуть желаемой частоты. Частота измеряется в тактах таймера.

source: The various bits in this field specify which values to include in the sample. They will be recorded in a ring-buffer, which is available to user space using B<mmap>(2). The order in which the values are saved in the sample are documented in the MMAP Layout subsection below; it is not the I<enum perf_event_sample_format> order.
ru: Различными битами этого поля определяется какие значения включать в измерение. Они будут записаны в кольцевой буфер, который доступен в пользовательском пространстве через B<mmap>(2). Порядок сохраняемых значений описан в разделе «Разбивка MMAP» ниже; он не совпадает с порядком I<enum perf_event_sample_format>.

source: Records instruction pointer.
ru: Сохранять указатель инструкций.

source: Records the process and thread IDs.
ru: Сохранять идентификатор процесса и нити.

source: Records a timestamp.
ru: Сохранять метку времени.

source: Records an address, if applicable.
ru: Сохранять адрес (если используется).

source: Record counter values for all events in a group, not just the group leader.
ru: Сохранять значения счётчика для всех событий в группе, а не только для лидера группы.

source: Records the callchain (stack backtrace).
ru: Сохранять цепочку вызовов (обратная трассировка стека).

source: Records a unique ID for the opened event's group leader.
ru: Сохранять уникальный идентификатор для открытых лидером группы событий.

source: Records CPU number.
ru: Сохранять номер ЦП.

source: Records the current sampling period.
ru: Сохранять текущий период измерения.

source: Records a unique ID for the opened event. Unlike B<PERF_SAMPLE_ID> the actual ID is returned, not the group leader. This ID is the same as the one returned by B<PERF_FORMAT_ID>.
ru: Сохранять уникальный идентификатор открытого события. В отличии от B<PERF_SAMPLE_ID> возвращается реальный идентификатор, а не лидера группы. Этот же идентификатор возвращается B<PERF_FORMAT_ID>.

source: Records additional data, if applicable. Usually returned by tracepoint events.
ru: Сохранять дополнительные данные, если есть. Обычно возвращаются для событий трассировки.

source: B<PERF_SAMPLE_BRANCH_STACK> (since Linux 3.4)
ru: B<PERF_SAMPLE_BRANCH_STACK> (начиная с Linux 3.4)

source: This provides a record of recent branches, as provided by CPU branch sampling hardware (such as Intel Last Branch Record). Not all hardware supports this feature.
ru: Сохранять запись о новых ветвях, предоставляемых аппаратурой ветвления ЦП (например, Intel Last Branch Record). Не каждая аппаратура поддерживает данную возможность.

source: See the I<branch_sample_type> field for how to filter which branches are reported.
ru: В описании поля I<branch_sample_type> показано как выбирать ветви, о которых нужно сообщать.

source: B<PERF_SAMPLE_REGS_USER> (since Linux 3.7)
ru: B<PERF_SAMPLE_REGS_USER> (начиная с Linux 3.7)

source: Records the current user-level CPU register state (the values in the process before the kernel was called).
ru: Записывать текущее состояние регистров ЦП на уровне пользователя (значения в процессе до вызова ядра).

source: B<PERF_SAMPLE_STACK_USER> (since Linux 3.7)
ru: B<PERF_SAMPLE_STACK_USER> (начиная с Linux 3.7)

source: Records the user level stack, allowing stack unwinding.
ru: Сохранять стек пользовательского уровня для размотки стека.

source: B<PERF_SAMPLE_WEIGHT> (since Linux 3.10)
ru: B<PERF_SAMPLE_WEIGHT> (начиная с Linux 3.10)

source: Records a hardware provided weight value that expresses how costly the sampled event was. This allows the hardware to highlight expensive events in a profile.
ru: Сохранять данные аппаратуры, предоставляющие весовое значение, которое отражает насколько затратным было измеряемое событие. Это позволяет аппаратуре выявлять затратные события в профиле.

source: B<PERF_SAMPLE_DATA_SRC> (since Linux 3.10)
ru: B<PERF_SAMPLE_DATA_SRC> (начиная с Linux 3.10)

source: Records the data source: where in the memory hierarchy the data associated with the sampled instruction came from. This is available only if the underlying hardware supports this feature.
ru: Сохранять источник данных: где в иерархии памяти находятся данные, связанные с измеряемое инструкцией. Доступно только, если поддерживается аппаратурой.

source: B<PERF_SAMPLE_IDENTIFIER> (since Linux 3.12)
ru: B<PERF_SAMPLE_IDENTIFIER> (начиная с Linux 3.12)

source: Places the B<SAMPLE_ID> value in a fixed position in the record, either at the beginning (for sample events) or at the end (if a non-sample event).
ru: Помещать значение B<SAMPLE_ID> в фиксированном месте записи, или в начале (для измеряемых событий) или в конце (для не измеряемого события).

source: This was necessary because a sample stream may have records from various different event sources with different I<sample_type> settings. Parsing the event stream properly was not possible because the format of the record was needed to find B<SAMPLE_ID>, but the format could not be found without knowing what event the sample belonged to (causing a circular dependency).
ru: Это было необходимо потому, что поток измерений может содержать записи из различных источников событий с различными параметрами I<sample_type>. Корректный разбор потока событий невозможен, так как для формата записи необходимо найти B<SAMPLE_ID>, но формат невозможно определить без значения какому измерению принадлежит событие (что вызывает циклическую зависимость).

source: The B<PERF_SAMPLE_IDENTIFIER> setting makes the event stream always parsable by putting B<SAMPLE_ID> in a fixed location, even though it means having duplicate B<SAMPLE_ID> values in records.
ru: Значение B<PERF_SAMPLE_IDENTIFIER> делает поток всегда анализируемым, помещая B<SAMPLE_ID> в фиксированное расположение, несмотря на уже имеющиеся значения B<SAMPLE_ID> в записях.

source: B<PERF_SAMPLE_TRANSACTION> (since Linux 3.13)
ru: B<PERF_SAMPLE_TRANSACTION> (начиная с Linux 3.13)

source: Records reasons for transactional memory abort events (for example, from Intel TSX transactional memory support).
ru: Сохранять причины событий аварий транзакционной памяти (например, из поддержки транзакционной памяти Intel TSX).

source: The I<precise_ip> setting must be greater than 0 and a transactional memory abort event must be measured or no values will be recorded. Also note that some perf_event measurements, such as sampled cycle counting, may cause extraneous aborts (by causing an interrupt during a transaction).
ru: Значение I<precise_ip> должно быть больше 0 и должно измеряться событие аварии транзакционной памяти или значения не будут записаны. Также отметим, что некоторые измерения perf_event, такие как подсчёт числа циклов, могут приводить к дополнительным авариям (вызванным прерыванием во время транзакции).

source: B<PERF_SAMPLE_REGS_INTR> (since Linux 3.19)
ru: B<PERF_SAMPLE_REGS_INTR> (начиная с Linux 3.19)

source: Records a subset of the current CPU register state as specified by I<sample_regs_intr>. Unlike B<PERF_SAMPLE_REGS_USER> the register values will return kernel register state if the overflow happened while kernel code is running. If the CPU supports hardware sampling of register state (i.e., PEBS on Intel x86) and I<precise_ip> is set higher than zero then the register values returned are those captured by hardware at the time of the sampled instruction's retirement.
ru: Сохранять поднабор текущего состояния регистров ЦП, который определяется I<sample_regs_intr>. В отличии от B<PERF_SAMPLE_REGS_USER> будут возвращены значения регистров из состояния ядра, если произойдёт переполнение при выполнении кода ядра. Если ЦП аппаратно поддерживает измерение состояния регистра (PEBS в Intel x86) и I<precise_ip> больше нуля, то возвращаются значения регистров, захваченных аппаратурой во время измерения запоздалой инструкции.
