Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Change the mask of blocked signals (see B<sigprocmask>(2)) to the value specified in the buffer pointed to by I<data>, which should be a pointer to a buffer of type I<sigset_t>. The I<addr> argument contains the size of the buffer pointed to by I<data> (i.e., I<sizeof(sigset_t)>).
ru: Изменяет маску блокированных сигналов (смотрите B<sigprocmask>(2)) на значение из буфера, указанного в I<data> (должен быть указателем на буфер с типом I<sigset_t>). Аргумент I<addr> содержит размер буфера, указанного в I<data> (т. е. I<sizeof(sigset_t)>).

source: B<PTRACE_SETOPTIONS> (since Linux 2.4.6; see BUGS for caveats)
ru: B<PTRACE_SETOPTIONS> (начиная с Linux 2.4.6; см. предостережения в разделе ДЕФЕКТЫ)

source: Set ptrace options from I<data>. (I<addr> is ignored.) I<data> is interpreted as a bit mask of options, which are specified by the following flags:
ru: Устанавливает флаги ptrace из I<data> (значение I<addr> игнорируется). Значение I<data> воспринимается как битовая маска, в которой задаются следующие флаги:

source: B<PTRACE_O_EXITKILL> (since Linux 3.8)
ru: B<PTRACE_O_EXITKILL> (начиная с Linux 3.8)

source: Send a B<SIGKILL> signal to the tracee if the tracer exits. This option is useful for ptrace jailers that want to ensure that tracees can never escape the tracer's control.
ru: Посылать сигнал B<SIGKILL> трассируемому, если трассировщик существует. Этот параметр полезен для надзирателей ptrace, которые хотят убедиться, что трассируемые никогда не выйдут из-под контроля трассировщика.

source: B<PTRACE_O_TRACECLONE> (since Linux 2.5.46)
ru: B<PTRACE_O_TRACECLONE> (начиная с Linux 2.5.46)

source: Stop the tracee at the next B<clone>(2) and automatically start tracing the newly cloned process, which will start with a B<SIGSTOP>, or B<PTRACE_EVENT_STOP> if B<PTRACE_SEIZE> was used. A B<waitpid>(2) by the tracer will return a I<status> value such that
ru: Останавливать трассируемую нить при следующем вызове B<clone>(2) и автоматически запускать трассировку только что склонированного процесса, который начнёт выполнение с обработки сигнала B<SIGSTOP> или B<PTRACE_EVENT_STOP>, если используется B<PTRACE_SEIZE>. Вызов B<waitpid>(2) вернёт трассировщику значение I<status>, которое равно

source: The PID of the new process can be retrieved with B<PTRACE_GETEVENTMSG>.
ru: Значение PID нового процесса можно получить с помощью B<PTRACE_GETEVENTMSG>.

source: This option may not catch B<clone>(2) calls in all cases. If the tracee calls B<clone>(2) with the B<CLONE_VFORK> flag, B<PTRACE_EVENT_VFORK> will be delivered instead if B<PTRACE_O_TRACEVFORK> is set; otherwise if the tracee calls B<clone>(2) with the exit signal set to B<SIGCHLD>, B<PTRACE_EVENT_FORK> will be delivered if B<PTRACE_O_TRACEFORK> is set.
ru: В некоторых случаях вызовы B<clone>(2) могут быть не пойманы. Если трассируемая нить вызывает B<clone>(2) с флагом B<CLONE_VFORK>, то будет доставлен B<PTRACE_EVENT_VFORK>, если установлен B<PTRACE_O_TRACEVFORK>; в противном случае, если трассируемая нить вызывает B<clone>(2) с установленным сигналом выхода равным B<SIGCHLD>, то будет доставлен B<PTRACE_EVENT_FORK>, если установлен B<PTRACE_O_TRACEFORK>.

source: B<PTRACE_O_TRACEEXEC> (since Linux 2.5.46)
ru: B<PTRACE_O_TRACEEXEC> (начиная с Linux 2.5.46)

source: Stop the tracee at the next B<execve>(2). A B<waitpid>(2) by the tracer will return a I<status> value such that
ru: Останавливать трассируемую нить при следующем вызове B<execve>(). Вызов B<waitpid>(2) вернёт трассировщику значение I<status>, которое равно

source: If the execing thread is not a thread group leader, the thread ID is reset to thread group leader's ID before this stop. Since Linux 3.0, the former thread ID can be retrieved with B<PTRACE_GETEVENTMSG>.
ru: Если исполняемая нить не является лидером группы нитей, то идентификатор нити сбрасывается в значение идентификатора лидера группы нитей перед его остановкой. Начиная с Linux 3.0, предыдущий идентификатор нити может быть получен с помощью B<PTRACE_GETEVENTMSG>.

source: B<PTRACE_O_TRACEEXIT> (since Linux 2.5.60)
ru: B<PTRACE_O_TRACEEXIT> (начиная с Linux 2.5.60)

source: Stop the tracee at exit. A B<waitpid>(2) by the tracer will return a I<status> value such that
ru: Останавливать трассируемую нить при его завершении (exit). Вызов B<waitpid>() вернёт трассировщику значение I<status>, которое равно

source: The tracee's exit status can be retrieved with B<PTRACE_GETEVENTMSG>.
ru: Значение кода завершения трассируемой нити можно получить с помощью B<PTRACE_GETEVENTMSG>.

source: The tracee is stopped early during process exit, when registers are still available, allowing the tracer to see where the exit occurred, whereas the normal exit notification is done after the process is finished exiting. Even though context is available, the tracer cannot prevent the exit from happening at this point.
ru: Остановка трассируемой нити будет выполнена в начальный момент завершения, когда ещё доступны регистры, что позволяет трассировщику увидеть откуда выполнялось завершение (обычное уведомление о завершении выполняется после того как процесс уже завершил работу). Хотя в этот момент ещё доступен контекст, трассировщик уже не может предотвратить завершение.

source: B<PTRACE_O_TRACEFORK> (since Linux 2.5.46)
ru: B<PTRACE_O_TRACEFORK> (начиная с Linux 2.5.46)

source: Stop the tracee at the next B<fork>(2) and automatically start tracing the newly forked process, which will start with a B<SIGSTOP>, or B<PTRACE_EVENT_STOP> if B<PTRACE_SEIZE> was used. A B<waitpid>(2) by the tracer will return a I<status> value such that
ru: Останавливать трассируемую нить при следующем вызове B<fork>(2) и автоматически запускать трассировку только что созданного с помощью fork процесса, который начнёт выполнение с обработки сигнала B<SIGSTOP> или B<PTRACE_EVENT_STOP>, если используется B<PTRACE_SEIZE>. Вызов B<waitpid>(2) вернёт трассировщику значение I<status>, которое равно

source: B<PTRACE_O_TRACESYSGOOD> (since Linux 2.4.6)
ru: B<PTRACE_O_TRACESYSGOOD> (начиная с Linux 2.4.6)

source: When delivering system call traps, set bit 7 in the signal number (i.e., deliver I<SIGTRAP|0x80>). This makes it easy for the tracer to distinguish normal traps from those caused by a system call.
ru: При доставке сигналов ловушек системных вызовов, устанавливать бит 7 в номере сигнала (т. е., доставляется I<SIGTRAP|0x80>). Это позволяет трассировщику легко отличить обычные ловушки от тех, которые были вызваны системным вызовом.

source: B<PTRACE_O_TRACEVFORK> (since Linux 2.5.46)
ru: B<PTRACE_O_TRACEVFORK> (начиная с Linux 2.5.46)

source: Stop the tracee at the next B<vfork>(2) and automatically start tracing the newly vforked process, which will start with a B<SIGSTOP>, or B<PTRACE_EVENT_STOP> if B<PTRACE_SEIZE> was used. A B<waitpid>(2) by the tracer will return a I<status> value such that
ru: Останавливать трассируемую нить при следующем вызове B<vfork>(2) и автоматически запускать трассировку только что созданного с помощью vfork процесса, который начнёт выполнение с обработки сигнала B<SIGSTOP> или B<PTRACE_EVENT_STOP>, если используется B<PTRACE_SEIZE>. Вызов B<waitpid>(2) вернёт трассировщику значение I<status>, которое равно

source: B<PTRACE_O_TRACEVFORKDONE> (since Linux 2.5.60)
ru: B<PTRACE_O_TRACEVFORKDONE> (начиная с Linux 2.5.60)

source: Stop the tracee at the completion of the next B<vfork>(2). A B<waitpid>(2) by the tracer will return a I<status> value such that
ru: Останавливать трассируемую нить при следующем вызове B<vfork>(2). Вызов B<waitpid>(2) вернёт трассировщику значение I<status>, которое равно

source: The PID of the new process can (since Linux 2.6.18) be retrieved with B<PTRACE_GETEVENTMSG>.
ru: Значение PID нового процесса можно получить (начиная с Linux 2.6.18) с помощью B<PTRACE_GETEVENTMSG>.

source: B<PTRACE_O_TRACESECCOMP> (since Linux 3.5)
ru: B<PTRACE_O_TRACESECCOMP> (начиная с Linux 3.5)

source: Stop the tracee when a B<seccomp>(2) B<SECCOMP_RET_TRACE> rule is triggered. A B<waitpid>(2) by the tracer will return a I<status> value such that
ru: Останавливать трассируемую нить при возникновении правила B<seccomp>(2) B<SECCOMP_RET_TRACE>. Вызов B<waitpid>(2) вернёт трассировщику значение I<status>, которое равно

source: While this triggers a B<PTRACE_EVENT> stop, it is similar to a syscall-enter-stop. For details, see the note on B<PTRACE_EVENT_SECCOMP> below. The seccomp event message data (from the B<SECCOMP_RET_DATA> portion of the seccomp filter rule) can be retrieved with B<PTRACE_GETEVENTMSG>.
ru: Так как это останавливает B<PTRACE_EVENT>, это похоже на syscall-enter-stop. Дополнительную информацию смотрите в замечании к B<PTRACE_EVENT_SECCOMP> ниже. Данные сообщения события seccomp (из части B<SECCOMP_RET_DATA> правила фильтрации seccomp) можно получить с помощью B<PTRACE_GETEVENTMSG>.

source: B<PTRACE_O_SUSPEND_SECCOMP> (since Linux 4.3)
ru: B<PTRACE_O_SUSPEND_SECCOMP> (начиная с Linux 4.3)

source: Suspend the tracee's seccomp protections. This applies regardless of mode, and can be used when the tracee has not yet installed seccomp filters. That is, a valid use case is to suspend a tracee's seccomp protections before they are installed by the tracee, let the tracee install the filters, and then clear this flag when the filters should be resumed. Setting this option requires that the tracer have the B<CAP_SYS_ADMIN> capability, not have any seccomp protections installed, and not have B<PTRACE_O_SUSPEND_SECCOMP> set on itself.
ru: Приостановить защиты seccomp трассируемого. Это применяется независимо от режима и может быть использовано когда трассируемый ещё не установил фильтры seccomp. То есть, корректным действием будет приостановка защит seccomp трассируемого, до того как их установит трассируемый, позволить трассируемому установить фильтры, и затем очистить этот флаг, когда нужно возобновить работу фильтров. Установка этого параметра требует, чтобы трассировщик имел мандат B<CAP_SYS_ADMIN>, не было установлено никаких защит seccomp и не установлен сам B<PTRACE_O_SUSPEND_SECCOMP>.

source: B<PTRACE_GETEVENTMSG> (since Linux 2.5.46)
ru: B<PTRACE_GETEVENTMSG> (начиная с Linux 2.5.46)

source: Retrieve a message (as an I<unsigned long>) about the ptrace event that just happened, placing it at the address I<data> in the tracer. For B<PTRACE_EVENT_EXIT>, this is the tracee's exit status. For B<PTRACE_EVENT_FORK>, B<PTRACE_EVENT_VFORK>, B<PTRACE_EVENT_VFORK_DONE>, and B<PTRACE_EVENT_CLONE>, this is the PID of the new process. For B<PTRACE_EVENT_SECCOMP>, this is the B<seccomp>(2) filter's B<SECCOMP_RET_DATA> associated with the triggered rule. (I<addr> is ignored.)
ru: Возвращает сообщения (с типом I<unsigned long>) о событии ptrace, которое только что произошло, помещая его по адресу I<data> в памяти трассировщика. Для B<PTRACE_EVENT_EXIT> это код завершения трассируемой нити. Для B<PTRACE_EVENT_FORK>, B<PTRACE_EVENT_VFORK>, B<PTRACE_EVENT_VFORK_DONE> и B<PTRACE_EVENT_CLONE> это PID нового процесса. Для B<PTRACE_EVENT_SECCOMP> это B<SECCOMP_RET_DATA> из фильтра B<seccomp>(2), связанного со сработавшим правилом (значение I<addr> игнорируется).

source: Restart the stopped tracee process. If I<data> is nonzero, it is interpreted as the number of a signal to be delivered to the tracee; otherwise, no signal is delivered. Thus, for example, the tracer can control whether a signal sent to the tracee is delivered or not. (I<addr> is ignored.)
ru: Возобновляет работу остановленной трассируемой нити. Если значение I<data> не равно нулю, то оно считается номером сигнала, который надо доставить трассируемой нити; в противном случае сигнал не передаётся. Таким образом, например, трассировщик может контролировать передачу сигнала трассируемой нити (значение I<addr> игнорируется).

source: Restart the stopped tracee as for B<PTRACE_CONT>, but arrange for the tracee to be stopped at the next entry to or exit from a system call, or after execution of a single instruction, respectively. (The tracee will also, as usual, be stopped upon receipt of a signal.) From the tracer's perspective, the tracee will appear to have been stopped by receipt of a B<SIGTRAP>. So, for B<PTRACE_SYSCALL>, for example, the idea is to inspect the arguments to the system call at the first stop, then do another B<PTRACE_SYSCALL> and inspect the return value of the system call at the second stop. The I<data> argument is treated as for B<PTRACE_CONT>. (I<addr> is ignored.)
ru: Аналогично B<PTRACE_CONT> они перезапускают остановленную трассируемую нить, но указывают, что процесс должен быть остановлен перед входом/выходом из системного вызова, или после исполнения одной инструкции, соответственно (трассируемая нить также, как обычно, будет остановлена при получении сигнала). С точки зрения трассировщика кажется, что трассируемая нить остановлена из-за получения сигнала B<SIGTRAP>. Так, B<PTRACE_SYSCALL> например, позволяет изучить содержимое аргументов перед системным вызовом, а при следующем B<PTRACE_SYSCALL> можно просмотреть результат исполнения системного вызова. Аргумент I<data> используется как в B<PTRACE_CONT> (значение I<addr> игнорируется).

source: B<PTRACE_SYSEMU>, B<PTRACE_SYSEMU_SINGLESTEP> (since Linux 2.6.14)
ru: B<PTRACE_SYSEMU>, B<PTRACE_SYSEMU_SINGLESTEP> (начиная с Linux 2.6.14)

source: For B<PTRACE_SYSEMU>, continue and stop on entry to the next system call, which will not be executed. See the documentation on syscall-stops below. For B<PTRACE_SYSEMU_SINGLESTEP>, do the same but also singlestep if not a system call. This call is used by programs like User Mode Linux that want to emulate all the tracee's system calls. The I<data> argument is treated as for B<PTRACE_CONT>. The I<addr> argument is ignored. These requests are currently supported only on x86.
ru: Действие B<PTRACE_SYSEMU> приводит к продолжению и остановке на входе в следующий системный вызов, который не будет выполнен . Смотрите описание по syscall-stop ниже. Действие B<PTRACE_SYSEMU_SINGLESTEP> выполняет тоже самое, но для одиночной инструкции, если это не системный вызов. Это действие используется программами, подобными User Mode Linux, которым нужно эмулировать все системные вызовы трассируемых нитей. Аргумент I<data> используется также как у B<PTRACE_CONT>. Аргумент I<addr> игнорируется. Эти запросы поддерживаются только на x86.

source: B<PTRACE_LISTEN> (since Linux 3.4)
ru: B<PTRACE_LISTEN> (начиная с Linux 3.4)

source: Restart the stopped tracee, but prevent it from executing. The resulting state of the tracee is similar to a process which has been stopped by a B<SIGSTOP> (or other stopping signal). See the "group-stop" subsection for additional information. B<PTRACE_LISTEN> works only on tracees attached by B<PTRACE_SEIZE>.
ru: Перезапускает остановленную трассируемую нить, но её выполнение не начинается. Полученное состояние трассируемой нити подобно процессу, который был остановлен по B<SIGSTOP> (или другим останавливающим сигналом). Дополнительную информацию смотрите в подразделе «group-stop». B<PTRACE_LISTEN> работает только для трассируемых нитей, присоединённых с помощью B<PTRACE_SEIZE>.

source: Send the tracee a B<SIGKILL> to terminate it. (I<addr> and I<data> are ignored.)
ru: Посылает трассируемой нити сигнал B<SIGKILL> для его уничтожения (значения I<addr> и I<data> игнорируются).

source: I<This operation is deprecated; do not use it!> Instead, send a B<SIGKILL> directly using B<kill>(2) or B<tgkill>(2). The problem with B<PTRACE_KILL> is that it requires the tracee to be in signal-delivery-stop, otherwise it may not work (i.e., may complete successfully but won't kill the tracee). By contrast, sending a B<SIGKILL> directly has no such limitation.
ru: I<Это действие устарело; не используйте его!> Вместо него отправляйте B<SIGKILL> напрямую с помощью B<kill>(2) или B<tgkill>(2). Проблема с действием B<PTRACE_KILL> в том, что оно требует, чтобы трассируемая нить была режиме signal-delivery-stop, в противном случае оно может не сработать (т. е., может завершиться без ошибок, но трассируемая нить не будет уничтожена). В отличие от него, отправка B<SIGKILL> напрямую не имеет данного ограничения.

source: B<PTRACE_INTERRUPT> (since Linux 3.4)
ru: B<PTRACE_INTERRUPT> (начиная с Linux 3.4)

source: Stop a tracee. If the tracee is running or sleeping in kernel space and B<PTRACE_SYSCALL> is in effect, the system call is interrupted and syscall-exit-stop is reported. (The interrupted system call is restarted when the tracee is restarted.) If the tracee was already stopped by a signal and B<PTRACE_LISTEN> was sent to it, the tracee stops with B<PTRACE_EVENT_STOP> and I<WSTOPSIG(status)> returns the stop signal. If any other ptrace-stop is generated at the same time (for example, if a signal is sent to the tracee), this ptrace-stop happens. If none of the above applies (for example, if the tracee is running in user space), it stops with B<PTRACE_EVENT_STOP> with I<WSTOPSIG(status)> == B<SIGTRAP>. B<PTRACE_INTERRUPT> only works on tracees attached by B<PTRACE_SEIZE>.
ru: Остановить трассируемый объект. Если трассируемый объект выполняется или спит в пространстве ядра и действует B<PTRACE_SYSCALL>, то системный вызов прерывается и сообщается о syscall-exit-stop (прерванный системный вызов перезапускается при перезапуске трассируемого объекта). Если трассируемый объект был уже остановлен по сигналу и ему был послан B<PTRACE_LISTEN>, то трассируемый объект останавливается с B<PTRACE_EVENT_STOP> и I<WSTOPSIG(status)> возвращает сигнал остановки. Если в этот же момент генерируется любое другое событие ptrace-stop (например, если трассируемому посылается сигнал), то возникает ptrace-stop. Если ничего из вышеперечисленного не происходит (например, если трассируемый выполняется в пространстве пользователя), то он останавливается с B<PTRACE_EVENT_STOP> и I<WSTOPSIG(status)> == B<SIGTRAP>. B<PTRACE_INTERRUPT> работает только для трассируемых объектов, к которым подключились с помощью B<PTRACE_SEIZE>.

source: Attach to the process specified in I<pid>, making it a tracee of the calling process. The tracee is sent a B<SIGSTOP>, but will not necessarily have stopped by the completion of this call; use B<waitpid>(2) to wait for the tracee to stop. See the "Attaching and detaching" subsection for additional information. (I<addr> and I<data> are ignored.)
ru: Выполняет присоединение к процессу с указанным I<pid>, делая его трассируемым для вызывающего процесса. Трассируемой нити посылается B<SIGSTOP>, но нет жёсткого правила, что она будет остановлен по завершению этого вызова; используйте B<waitpid>(2) для ожидания остановки трассируемой нити. Дополнительную информацию смотрите в подразделе «Присоединение и отсоединение» (значения I<addr> и I<data> игнорируются).

source: Permission to perform a B<PTRACE_ATTACH> is governed by a ptrace access mode B<PTRACE_MODE_ATTACH_REALCREDS> check; see below.
ru: Право выполнять B<PTRACE_ATTACH> определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_REALCREDS>; смотрите ниже.

source: B<PTRACE_SEIZE> (since Linux 3.4)
ru: B<PTRACE_SEIZE> (начиная с Linux 3.4)

source: Attach to the process specified in I<pid>, making it a tracee of the calling process. Unlike B<PTRACE_ATTACH>, B<PTRACE_SEIZE> does not stop the process. Group-stops are reported as B<PTRACE_EVENT_STOP> and I<WSTOPSIG(status)> returns the stop signal. Automatically attached children stop with B<PTRACE_EVENT_STOP> and I<WSTOPSIG(status)> returns B<SIGTRAP> instead of having B<SIGSTOP> signal delivered to them. B<execve>(2) does not deliver an extra B<SIGTRAP>. Only a B<PTRACE_SEIZE>d process can accept B<PTRACE_INTERRUPT> and B<PTRACE_LISTEN> commands. The "seized" behavior just described is inherited by children that are automatically attached using B<PTRACE_O_TRACEFORK>, B<PTRACE_O_TRACEVFORK>, and B<PTRACE_O_TRACECLONE>. I<addr> must be zero. I<data> contains a bit mask of ptrace options to activate immediately.
ru: Выполняет присоединение к процессу, указанному в I<pid>, делает его трассируемым для вызывающего процесса. В отличие от B<PTRACE_ATTACH>, B<PTRACE_SEIZE> не останавливает процесс. О group-stops сообщается как B<PTRACE_EVENT_STOP> и I<WSTOPSIG(status)> возвращает сигнал остановки. Автоматически присоединённые потомки останавливаются с B<PTRACE_EVENT_STOP> и I<WSTOPSIG(status)> возвращает B<SIGTRAP> вместо доставки им сигнала B<SIGSTOP>. При вызове B<execve>(2) дополнительный B<SIGTRAP> не посылается. Только подключённые с помощью B<PTRACE_SEIZE> процессы могут принимать команды B<PTRACE_INTERRUPT> и B<PTRACE_LISTEN>. Только что описанное поведение «захвата» (seized) наследуется потомками, которые автоматически присоединяются с помощью B<PTRACE_O_TRACEFORK>, B<PTRACE_O_TRACEVFORK> и B<PTRACE_O_TRACECLONE>. Значение I<addr> должно быть равно нулю. В I<data> содержится битовая маска параметров ptrace, которая применяется сразу же.

source: Permission to perform a B<PTRACE_SEIZE> is governed by a ptrace access mode B<PTRACE_MODE_ATTACH_REALCREDS> check; see below.
ru: Право выполнять B<PTRACE_SEIZE> определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_REALCREDS>; смотрите ниже.

source: B<PTRACE_SECCOMP_GET_FILTER> (since Linux 4.4)
ru: B<PTRACE_SECCOMP_GET_FILTER> (начиная с Linux 4.4)

source: This operation allows the tracer to dump the tracee's classic BPF filters.
ru: Эта операция позволяет трассировщику получить дамп классических фильтров BPF трассируемого.

source: I<addr> is an integer specifying the index of the filter to be dumped. The most recently installed filter has the index 0. If I<addr> is greater than the number of installed filters, the operation fails with the error B<ENOENT>.
ru: Значение I<addr> имеет тип integer и задаёт индекс фильтра для дампа. Индекс последнего установленного фильтра равен 0. Если I<addr> больше количества установленных фильтров, то операция завершается ошибкой B<ENOENT>.

source: I<data> is either a pointer to a I<struct sock_filter> array that is large enough to store the BPF program, or NULL if the program is not to be stored.
ru: Значение I<data> является указателем на массив I<struct sock_filter> достаточного размера для сохранения программы BPF, или NULL, если программа не будет сохраняться.

source: Upon success, the return value is the number of instructions in the BPF program. If I<data> was NULL, then this return value can be used to correctly size the I<struct sock_filter> array passed in a subsequent call.
ru: При успешном выполнении возвращаемое значение — количество инструкций в программе BPF. Если I<data> равнялось NULL, то возвращается значение, которое можно использовать для создания массива I<struct sock_filter> корректного размера, который будет передан в последующем вызове.

source: This operation fails with the error B<EACCES> if the caller does not have the B<CAP_SYS_ADMIN> capability or if the caller is in strict or filter seccomp mode. If the filter referred to by I<addr> is not a classic BPF filter, the operation fails with the error B<EMEDIUMTYPE>.
ru: Данная операция завершается ошибкой B<EACCES>, если вызывающий не имеет мандата B<CAP_SYS_ADMIN>, или если вызывающий находится в ограничительном или фильтрующем режиме. Если фильтр, на который ссылается адрес I<addr>, не является классическим фильтром BPF, то операция завершается ошибкой B<EMEDIUMTYPE>.

source: This operation is available if the kernel was configured with both the B<CONFIG_SECCOMP_FILTER> and the B<CONFIG_CHECKPOINT_RESTORE> options.
ru: Эта операция доступна только, если ядро собрано с параметрами B<CONFIG_SECCOMP_FILTER> и B<CONFIG_CHECKPOINT_RESTORE>.
