Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Restarting ptrace commands issued in ptrace-stops other than signal-delivery-stop are not guaranteed to inject a signal, even if I<sig> is nonzero. No error is reported; a nonzero I<sig> may simply be ignored. Ptrace users should not try to "create a new signal" this way: use B<tgkill>(2) instead.
ru: Перезапускающие действия ptrace, выдаваемые в ptrace-stops, отличные от signal-delivery-stop, не гарантируют внедрения сигнала, даже если значение I<sig> не равно нулю. Об ошибках не сообщается; ненулевое значение I<sig> может быть просто проигнорировано. Пользователи ptrace не должны пытаться «создать новый сигнал» таким способом — используйте вместо этого B<tgkill>(2).

source: The fact that signal injection requests may be ignored when restarting the tracee after ptrace stops that are not signal-delivery-stops is a cause of confusion among ptrace users. One typical scenario is that the tracer observes group-stop, mistakes it for signal-delivery-stop, restarts the tracee with
ru: Тот факт, что запросы внедрения сигнала могут игнорироваться при перезапуске трассируемой нити после остановок ptrace не из signal-delivery-stops, вызывает путаницу у пользователей ptrace. Типичный сценарий: трассировщик обнаруживает group-stop, принимает его за signal-delivery-stop, перезапускает трассируемую нить с помощью

source: with the intention of injecting I<stopsig>, but I<stopsig> gets ignored and the tracee continues to run.
ru: пытаясь внедрить I<stopsig>, но I<stopsig> игнорируется и трассируемая нить продолжает выполняться.

source: The B<SIGCONT> signal has a side effect of waking up (all threads of) a group-stopped process. This side effect happens before signal-delivery-stop. The tracer can't suppress this side effect (it can only suppress signal injection, which only causes the B<SIGCONT> handler to not be executed in the tracee, if such a handler is installed). In fact, waking up from group-stop may be followed by signal-delivery-stop for signal(s) I<other than> B<SIGCONT>, if they were pending when B<SIGCONT> was delivered. In other words, B<SIGCONT> may be not the first signal observed by the tracee after it was sent.
ru: Сигнал B<SIGCONT> имеет побочный эффект — пробуждает (все нити) процесс, находящийся в group-stop. Это случается перед signal-delivery-stop. Трассировщик не может повлиять на это побочное действие (он может только подавить внедрение сигнала, что приводит к тому, что обработчик B<SIGCONT> не будет выполнен в трассируемой нити, если он установлен). Фактически, пробуждение из group-stop может следовать после signal-delivery-stop для сигнала(ов) I<отличных от> B<SIGCONT>, если они ожидают момента доставки B<SIGCONT>. Другими словами, B<SIGCONT> может быть не первым сигналом, который обнаруживает трассируемую нить после её посылки.

source: Stopping signals cause (all threads of) a process to enter group-stop. This side effect happens after signal injection, and therefore can be suppressed by the tracer.
ru: Останавливающие сигналы заставляют процесс (все его нити) войти в group-stop. Данный побочный эффект возникает после внедрения сигнала, и поэтому может быть отменён трассировщиком.

source: In Linux 2.4 and earlier, the B<SIGSTOP> signal can't be injected.
ru: В Linux 2.4 и более ранних версиях, сигнал B<SIGSTOP> не может быть внедрён.

source: B<PTRACE_GETSIGINFO> can be used to retrieve a I<siginfo_t> structure which corresponds to the delivered signal. B<PTRACE_SETSIGINFO> may be used to modify it. If B<PTRACE_SETSIGINFO> has been used to alter I<siginfo_t>, the I<si_signo> field and the I<sig> parameter in the restarting command must match, otherwise the result is undefined.
ru: Действие B<PTRACE_GETSIGINFO> может использоваться для получения структуры I<siginfo_t>, которая соответствует доставленному сигналу. Для её изменения можно использовать B<PTRACE_SETSIGINFO>. Если B<PTRACE_SETSIGINFO> использовалась для изменения I<siginfo_t>, то поле I<si_signo> и параметр I<sig> в перезапускающем действии должны совпадать, иначе результат непредсказуем.

source: When a (possibly multithreaded) process receives a stopping signal, all threads stop. If some threads are traced, they enter a group-stop. Note that the stopping signal will first cause signal-delivery-stop (on one tracee only), and only after it is injected by the tracer (or after it was dispatched to a thread which isn't traced), will group-stop be initiated on I<all> tracees within the multithreaded process. As usual, every tracee reports its group-stop separately to the corresponding tracer.
ru: Когда (возможно многонитевой) процесс получает останавливающий сигнал, все нити останавливаются. Если для какой-то нити выполняется трассировка, то она входит в режим group-stop. Заметим, что останавливающий сигнал сначала приведёт к signal-delivery-stop (только в одной трассируемой нити) и только затем будет внедрён трассировщиком (или после того, как будет отправлен нити, над которой не выполняется трассировка), будет начат group-stop в I<всех> трассируемых нитях многонитевого процесса. Как обычно, каждая трассируемая нить сообщает о group-stop соответствующему трассировщику.

source: Group-stop is observed by the tracer as B<waitpid>(2) returning with I<WIFSTOPPED(status)> true, with the stopping signal available via I<WSTOPSIG(status)>. The same result is returned by some other classes of ptrace-stops, therefore the recommended practice is to perform the call
ru: Group-stop обнаруживается трассировщиком с помощью B<waitpid>(2), который возвращается с истинным значением I<WIFSTOPPED(status)> и останавливающим сигналом из I<WSTOPSIG(status)>. Тот же результат возвращается другими классами ptrace-stops, поэтому рекомендуется выполнять вызов

source: The call can be avoided if the signal is not B<SIGSTOP>, B<SIGTSTP>, B<SIGTTIN>, or B<SIGTTOU>; only these four signals are stopping signals. If the tracer sees something else, it can't be a group-stop. Otherwise, the tracer needs to call B<PTRACE_GETSIGINFO>. If B<PTRACE_GETSIGINFO> fails with B<EINVAL>, then it is definitely a group-stop. (Other failure codes are possible, such as B<ESRCH> ("no such process") if a B<SIGKILL> killed the tracee.)
ru: Вызова можно избежать, если сигнал не равен B<SIGSTOP>, B<SIGTSTP>, B<SIGTTIN> или B<SIGTTOU>; только эти четыре сигнала являются останавливающими. Если трассировщик видит что-то другое, то это не может быть group-stop. В противном случае, трассировщику нужно вызвать B<PTRACE_GETSIGINFO>. Если B<PTRACE_GETSIGINFO> завершается с ошибкой B<EINVAL>, то это определённо group-stop (возможны другие коды ошибок, например, B<ESRCH> («нет такого процесса»), если трассируемая нить уничтожена по B<SIGKILL>).

source: If tracee was attached using B<PTRACE_SEIZE>, group-stop is indicated by B<PTRACE_EVENT_STOP>: I<statusE<gt>E<gt>16 == PTRACE_EVENT_STOP>. This allows detection of group-stops without requiring an extra B<PTRACE_GETSIGINFO> call.
ru: Если подключение к трассируемому было сделано с помощью B<PTRACE_SEIZE>, то group-stop указывается B<PTRACE_EVENT_STOP>: I<statusE<gt>E<gt>16 == PTRACE_EVENT_STOP>. Это позволяет обнаружить group-stop без дополнительного вызова B<PTRACE_GETSIGINFO>.

source: As of Linux 2.6.38, after the tracer sees the tracee ptrace-stop and until it restarts or kills it, the tracee will not run, and will not send notifications (except B<SIGKILL> death) to the tracer, even if the tracer enters into another B<waitpid>(2) call.
ru: Начиная с Linux 2.6.38, после того как трассировщик увидит ptrace-stop трассируемой нити и пока он не перезапустит или завершит её, трассируемая нить не будет выполняться, и не будет посылать уведомления (за исключением уничтожения по B<SIGKILL>) трассировщику, даже если трассировщик войдёт в другой вызов B<waitpid>(2).

source: The kernel behavior described in the previous paragraph causes a problem with transparent handling of stopping signals. If the tracer restarts the tracee after group-stop, the stopping signal is effectively ignored\(emthe tracee doesn't remain stopped, it runs. If the tracer doesn't restart the tracee before entering into the next B<waitpid>(2), future B<SIGCONT> signals will not be reported to the tracer; this would cause the B<SIGCONT> signals to have no effect on the tracee.
ru: Поведение ядра, описанное в предыдущем параграфе, вызывает проблемы с прозрачностью обработки останавливающих сигналов. Если трассировщик перезапускает трассируемую нить после group-stop, то останавливающий сигнал просто игнорируется — трассируемая нить продолжает выполняться. Если трассировщик не перезапускает трассируемую нить перед входом в следующий B<waitpid>(2), то о будущих сигналах B<SIGCONT> не будет сообщено трассировщику; это привело бы к тому, что сигналы B<SIGCONT> не повлияли бы на трассируемую нить.

source: Since Linux 3.4, there is a method to overcome this problem: instead of B<PTRACE_CONT>, a B<PTRACE_LISTEN> command can be used to restart a tracee in a way where it does not execute, but waits for a new event which it can report via B<waitpid>(2) (such as when it is restarted by a B<SIGCONT>).
ru: Начиная с Linux 3.4, появился способ преодоления этой проблемы: вместо B<PTRACE_CONT> для перезапуска трассируемой нити можно использовать B<PTRACE_LISTEN>, при которой она не выполняется, а ждёт нового события, и это можно прочитать с помощью B<waitpid>(2) (например, когда был перезапуск по B<SIGCONT>).

source: PTRACE_EVENT stops
ru: Остановки PTRACE_EVENT

source: If the tracer sets B<PTRACE_O_TRACE_*> options, the tracee will enter ptrace-stops called B<PTRACE_EVENT> stops.
ru: Если трассировщик устанавливает флаги B<PTRACE_O_TRACE_*>, то трассируемая нить будет входить в ptrace-stop-ы, называемые остановками B<PTRACE_EVENT>.

source: B<PTRACE_EVENT> stops are observed by the tracer as B<waitpid>(2) returning with I<WIFSTOPPED(status)>, and I<WSTOPSIG(status)> returns B<SIGTRAP>. An additional bit is set in the higher byte of the status word: the value I<statusE<gt>E<gt>8> will be
ru: Остановки B<PTRACE_EVENT> обнаруживаются трассировщиком когда B<waitpid>(2) возвращается с I<WIFSTOPPED(status)> и I<WSTOPSIG(status)> возвращает B<SIGTRAP>. В старшем байте слова состояния устанавливается дополнительный бит: значение I<statusE<gt>E<gt>8> будет равно

source: The following events exist:
ru: Могут происходить следующие события:

source: Stop before return from B<vfork>(2) or B<clone>(2) with the B<CLONE_VFORK> flag. When the tracee is continued after this stop, it will wait for child to exit/exec before continuing its execution (in other words, the usual behavior on B<vfork>(2)).
ru: Остановка перед возвратом из B<vfork>(2) или B<clone>(2) с флагом B<CLONE_VFORK>. Когда трассируемая нить продолжает выполняться после этой остановки, она будет ждать выхода/exec потомка перед продолжением своего исполнения (другими словами, обычное поведение при B<vfork>(2)).

source: Stop before return from B<fork>(2) or B<clone>(2) with the exit signal set to B<SIGCHLD>.
ru: Остановка перед возвратом из B<fork>(2) или B<clone>(2) с установленным сигналом выхода B<SIGCHLD>.

source: Stop before return from B<clone>(2).
ru: Остановка перед возвратом из B<clone>(2).

source: Stop before return from B<vfork>(2) or B<clone>(2) with the B<CLONE_VFORK> flag, but after the child unblocked this tracee by exiting or execing.
ru: Остановка перед возвратом из B<vfork>(2) или B<clone>(2) с установленным флагом B<CLONE_VFORK>, но после того, как потомок разблокирует эту трассируемую нить, завершив работу или выполнив exec.

source: For all four stops described above, the stop occurs in the parent (i.e., the tracee), not in the newly created thread. B<PTRACE_GETEVENTMSG> can be used to retrieve the new thread's ID.
ru: Для всех четырёх остановок, описанных выше, остановка происходит в родителе (т. е., трассируемой нити), а не в только что созданной нити. Для получения ID новой нити может использовать B<PTRACE_GETEVENTMSG>.

source: Stop before return from B<execve>(2). Since Linux 3.0, B<PTRACE_GETEVENTMSG> returns the former thread ID.
ru: Остановка перед возвратом из B<execve>(2). Начиная с Linux 3.0, B<PTRACE_GETEVENTMSG> возвращает ID бывшей нити.

source: Stop before exit (including death from B<exit_group>(2)), signal death, or exit caused by B<execve>(2) in a multithreaded process. B<PTRACE_GETEVENTMSG> returns the exit status. Registers can be examined (unlike when "real" exit happens). The tracee is still alive; it needs to be B<PTRACE_CONT>ed or B<PTRACE_DETACH>ed to finish exiting.
ru: Остановка перед выходом (включая уничтожение из B<exit_group>(2)), уничтожение от сигнала или выход, вызванный B<execve>(2) в многонитевом процессе. B<PTRACE_GETEVENTMSG> возвращает код выхода. Можно прочитать значения регистров (в отличие от случая, когда происходит «реальный» выход). Трассируемая нить всё ещё существует; для завершения выхода должно быть выполнено отсоединение с помощью B<PTRACE_CONT> или B<PTRACE_DETACH>.

source: Stop induced by B<PTRACE_INTERRUPT> command, or group-stop, or initial ptrace-stop when a new child is attached (only if attached using B<PTRACE_SEIZE>).
ru: Остановка вызвана командой B<PTRACE_INTERRUPT>, или group-stop, или начальным ptrace-stop при присоединении к новому потомку (только если для присоединения использовалась B<PTRACE_SEIZE>).

source: Stop triggered by a B<seccomp>(2) rule on tracee syscall entry when B<PTRACE_O_TRACESECCOMP> has been set by the tracer. The seccomp event message data (from the B<SECCOMP_RET_DATA> portion of the seccomp filter rule) can be retrieved with B<PTRACE_GETEVENTMSG>. The semantics of this stop are described in detail in a separate section below.
ru: Остановка вызвана правилом B<seccomp>(2) из-за элемента syscall трассируемого, когда B<PTRACE_O_TRACESECCOMP> была установлена трассировщиком. Данные сообщения события seccomp (из части B<SECCOMP_RET_DATA> фильтрующего правила seccomp) можно получить с помощью B<PTRACE_GETEVENTMSG>. Семантика данного останова подробно описана в отдельном разделе далее.

source: B<PTRACE_GETSIGINFO> on B<PTRACE_EVENT> stops returns B<SIGTRAP> in I<si_signo>, with I<si_code> set to I<(eventE<lt>E<lt>8)\ |\ SIGTRAP>.
ru: B<PTRACE_GETSIGINFO> при остановке B<PTRACE_EVENT> возвращает B<SIGTRAP> в I<si_signo>, а значение I<si_code> устанавливается в I<(eventE<lt>E<lt>8)\ |\ SIGTRAP>.

source: Syscall-stops
ru: Syscall-stop

source: If the tracee was restarted by B<PTRACE_SYSCALL> or B<PTRACE_SYSEMU>, the tracee enters syscall-enter-stop just prior to entering any system call (which will not be executed if the restart was using B<PTRACE_SYSEMU>, regardless of any change made to registers at this point or how the tracee is restarted after this stop). No matter which method caused the syscall-entry-stop, if the tracer restarts the tracee with B<PTRACE_SYSCALL>, the tracee enters syscall-exit-stop when the system call is finished, or if it is interrupted by a signal. (That is, signal-delivery-stop never happens between syscall-enter-stop and syscall-exit-stop; it happens I<after> syscall-exit-stop.). If the tracee is continued using any other method (including B<PTRACE_SYSEMU>), no syscall-exit-stop occurs. Note that all mentions B<PTRACE_SYSEMU> apply equally to B<PTRACE_SYSEMU_SINGLESTEP.>
ru: Если трассируемый был перезапущен по B<PTRACE_SYSCALL> или B<PTRACE_SYSEMU>, то он входит в режим syscall-enter-stop сразу перед тем как войти в какой-либо системный вызов (который не будет выполняться, если перезапуск был из-за B<PTRACE_SYSEMU>, независимо от каких-либо изменений в регистрах на этот момент или если трассируемый перезапускается после своей остановки). Неважно какой метод вызвал syscall-entry-stop, если трассировщик перезапускает трассируемого с помощью B<PTRACE_SYSCALL>, то трассируемый входит в syscall-exit-stop при окончании системного вызова, или если он прерывается сигналом (то есть, signal-delivery-stop никогда не возникает между syscall-enter-stop и syscall-exit-stop; он возникает I<после> syscall-exit-stop). Если трассируемый продолжает выполнение с помощью какого-то другого метода (включая B<PTRACE_SYSEMU>), то syscall-exit-stop не возникает. Заметим, что все упоминания B<PTRACE_SYSEMU> применяются и к B<PTRACE_SYSEMU_SINGLESTEP>.

source: However, even if the tracee was continued using B<PTRACE_SYSCALL>, it is not guaranteed that the next stop will be a syscall-exit-stop. Other possibilities are that the tracee may stop in a B<PTRACE_EVENT> stop (including seccomp stops), exit (if it entered B<_exit>(2) or B<exit_group>(2)), be killed by B<SIGKILL>, or die silently (if it is a thread group leader, the B<execve>(2) happened in another thread, and that thread is not traced by the same tracer; this situation is discussed later).
ru: Однако даже если трассируемый продолжил выполнение с помощью B<PTRACE_SYSCALL>, это не гарантирует, что следующая остановка будет syscall-exit-stop. Также, трассируемый может остановиться в остановке B<PTRACE_EVENT> (включая остановку seccomp), при выходе (если он вошёл в B<_exit>(2) или B<exit_group>(2)), уничтожении по сигналу B<SIGKILL>, или тихом уничтожении (если он является лидером группы нитей, возникает B<execve>(2) в другой нити, и эта нить не трассируется тем же трассировщиком; эта ситуация описана далее).

source: Syscall-enter-stop and syscall-exit-stop are observed by the tracer as B<waitpid>(2) returning with I<WIFSTOPPED(status)> true, and I<WSTOPSIG(status)> giving B<SIGTRAP>. If the B<PTRACE_O_TRACESYSGOOD> option was set by the tracer, then I<WSTOPSIG(status)> will give the value I<(SIGTRAP\ |\ 0x80)>.
ru: Syscall-enter-stop и syscall-exit-stop обнаруживаются трассировщиком из B<waitpid>(2), возвращающем истинное значение I<WIFSTOPPED(status)> и I<WSTOPSIG(status)> выдающем B<SIGTRAP>. Если трассировщиком был установлен флаг B<PTRACE_O_TRACESYSGOOD>, то I<WSTOPSIG(status)> выдаст значение I<(SIGTRAP\ |\ 0x80)>.

source: Syscall-stops can be distinguished from signal-delivery-stop with B<SIGTRAP> by querying B<PTRACE_GETSIGINFO> for the following cases:
ru: Syscall-stop можно отличить от signal-delivery-stop по B<SIGTRAP>, запросив B<PTRACE_GETSIGINFO> в следующих случаях:

source: B<SIGTRAP> was delivered as a result of a user-space action, for example, a system call (B<tgkill>(2), B<kill>(2), B<sigqueue>(3), etc.), expiration of a POSIX timer, change of state on a POSIX message queue, or completion of an asynchronous I/O request.
ru: B<SIGTRAP> был доставлен в результате действия из пространства пользователя, например, системного вызова (B<tgkill>(2), B<kill>(2), B<sigqueue>(3) и т. д.), истечении таймера POSIX, изменении состояния очереди сообщений POSIX или выполнении асинхронного запроса ввода/вывода.

source: B<SIGTRAP> was sent by the kernel.
ru: B<SIGTRAP> был послан ядром.

source: I<si_code> == SIGTRAP or I<si_code> == (SIGTRAP|0x80)
ru: I<si_code> == SIGTRAP или I<si_code> == (SIGTRAP|0x80)

source: This is a syscall-stop.
ru: Это syscall-stop.

source: However, syscall-stops happen very often (twice per system call), and performing B<PTRACE_GETSIGINFO> for every syscall-stop may be somewhat expensive.
ru: Однако, syscall-stop происходят очень часто (дважды за системный вызов), и выполнение B<PTRACE_GETSIGINFO> для каждого syscall-stop может быть отчасти накладно.

source: Some architectures allow the cases to be distinguished by examining registers. For example, on x86, I<rax> == -B<ENOSYS> in syscall-enter-stop. Since B<SIGTRAP> (like any other signal) always happens I<after> syscall-exit-stop, and at this point I<rax> almost never contains -B<ENOSYS>, the B<SIGTRAP> looks like "syscall-stop which is not syscall-enter-stop"; in other words, it looks like a "stray syscall-exit-stop" and can be detected this way. But such detection is fragile and is best avoided.
ru: Некоторые архитектуры позволяют отличать эти случаи по значениям регистров. Например, на x86, при syscall-enter-stop I<rax> == -B<ENOSYS>. Так как B<SIGTRAP> (как и любой сигнал) всегда возникает I<после> syscall-exit-stop, и в этот момент I<rax> почти никогда не содержит B<ENOSYS>, B<SIGTRAP> выглядит как «syscall-stop, который не syscall-enter-stop»; другими словами, это выглядит как «блуждающий syscall-exit-stop» и таким способом может быть обнаружен. Но определение этим способом очень ненадёжно и лучше его не использовать.

source: Using the B<PTRACE_O_TRACESYSGOOD> option is the recommended method to distinguish syscall-stops from other kinds of ptrace-stops, since it is reliable and does not incur a performance penalty.
ru: Использование флага B<PTRACE_O_TRACESYSGOOD> — рекомендуемый метод различения syscall-stop от похожих на них других ptrace-stop, так как это надёжно и не приводит к ухудшению производительности.

source: Syscall-enter-stop and syscall-exit-stop are indistinguishable from each other by the tracer. The tracer needs to keep track of the sequence of ptrace-stops in order to not misinterpret syscall-enter-stop as syscall-exit-stop or vice versa. In general, a syscall-enter-stop is always followed by syscall-exit-stop, B<PTRACE_EVENT> stop, or the tracee's death; no other kinds of ptrace-stop can occur in between. However, note that seccomp stops (see below) can cause syscall-exit-stops, without preceding syscall-entry-stops. If seccomp is in use, care needs to be taken not to misinterpret such stops as syscall-entry-stops.
ru: Syscall-enter-stop и syscall-exit-stop неотличимы друг от друга трассировщиком. Трассировщику требуется отслеживать последовательность ptrace-stop, чтобы правильно истолковать syscall-enter-stop как syscall-exit-stop или наоборот. В общем, за syscall-enter-stop всегда следует syscall-exit-stop, B<PTRACE_EVENT> остановка или уничтожение трассируемого; никаких других ptrace-stop не может возникнуть между ними. Однако заметим, что остановки seccomp (смотрите ниже) могут приводить к syscall-exit-stop без предварительного syscall-entry-stop. Если используется seccomp, необходима осторожность чтобы не посчитать такие остановки за syscall-entry-stop.

source: If after syscall-enter-stop, the tracer uses a restarting command other than B<PTRACE_SYSCALL>, syscall-exit-stop is not generated.
ru: Если после syscall-enter-stop трассировщик использует перезапускающее действие, отличное от B<PTRACE_SYSCALL>, то syscall-exit-stop не генерируется.

source: B<PTRACE_GETSIGINFO> on syscall-stops returns B<SIGTRAP> in I<si_signo>, with I<si_code> set to B<SIGTRAP> or I<(SIGTRAP|0x80)>.
ru: B<PTRACE_GETSIGINFO> при syscall-stop возвращает B<SIGTRAP> в I<si_signo>, значение I<si_code> устанавливается в B<SIGTRAP> или I<(SIGTRAP|0x80)>.

source: PTRACE_EVENT_SECCOMP stops (Linux 3.5 to 4.7)
ru: Остановки PTRACE_EVENT_SECCOMP (Linux 3.5 по 4.7)

source: The behavior of B<PTRACE_EVENT_SECCOMP> stops and their interaction with other kinds of ptrace stops has changed between kernel versions. This documents the behavior from their introduction until Linux 4.7 (inclusive). The behavior in later kernel versions is documented in the next section.
ru: Поведение остановок B<PTRACE_EVENT_SECCOMP> и их взаимодействие с другими видами остановок ptrace различается от версии к версии. Здесь описано поведение от их появления до Linux 4.7 (включительно). Поведение в более новых версиях описано в следующем разделе.
