Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Restart the stopped tracee as for B<PTRACE_CONT>, but first detach from it. Under Linux, a tracee can be detached in this way regardless of which method was used to initiate tracing. (I<addr> is ignored.)
ru: Возобновляет работу остановленной трассируемой нити, аналогично B<PTRACE_CONT>, но сначала отсоединяется от него. В Linux при помощи этого вызова трассируемая нить может быть отсоединёна независимо от того, каким методом была запущена трассировка (значение I<addr> игнорируется).

source: B<PTRACE_GET_THREAD_AREA> (since Linux 2.6.0)
ru: B<PTRACE_GET_THREAD_AREA> (начиная с Linux 2.6.0)

source: This operation performs a similar task to B<get_thread_area>(2). It reads the TLS entry in the GDT whose index is given in I<addr>, placing a copy of the entry into the I<struct user_desc> pointed to by I<data>. (By contrast with B<get_thread_area>(2), the I<entry_number> of the I<struct user_desc> is ignored.)
ru: Данная операция выполняет задачу, подобную B<get_thread_area>(2). Она читает элемент TLS из GDT, чей индекс передан в I<addr>, помещает копию элемента в I<struct user_desc>, указанную в I<data> (в отличие от B<get_thread_area>(2), значение I<entry_number> структуры I<struct user_desc> игнорируется).

source: B<PTRACE_SET_THREAD_AREA> (since Linux 2.6.0)
ru: B<PTRACE_SET_THREAD_AREA> (начиная с Linux 2.6.0)

source: This operation performs a similar task to B<set_thread_area>(2). It sets the TLS entry in the GDT whose index is given in I<addr>, assigning it the data supplied in the I<struct user_desc> pointed to by I<data>. (By contrast with B<set_thread_area>(2), the I<entry_number> of the I<struct user_desc> is ignored; in other words, this ptrace operation can't be used to allocate a free TLS entry.)
ru: Данная операция выполняет задачу, подобную B<set_thread_area>(2). Она изменяет элемент TLS в GDT, чей индекс указан в I<addr>, данными, переданными в структуре I<struct user_desc>, на которую указывает I<data> (в отличие от B<set_thread_area>(2), значение I<entry_number> структуры I<struct user_desc> игнорируется; иначе говоря, данная операция ptrace не может использоваться для выделения свободного элемента TLS).

source: B<PTRACE_GET_SYSCALL_INFO> (since Linux 5.3)
ru: B<PTRACE_GET_SYSCALL_INFO> (начиная с Linux 5.3)

source: Retrieve information about the system call that caused the stop. The information is placed into the buffer pointed by the I<data> argument, which should be a pointer to a buffer of type I<struct ptrace_syscall_info>. The I<addr> argument contains the size of the buffer pointed to by the I<data> argument (i.e., I<sizeof(struct ptrace_syscall_info)>). The return value contains the number of bytes available to be written by the kernel. If the size of the data to be written by the kernel exceeds the size specified by the I<addr> argument, the output data is truncated.
ru: Возвращает информацию о системном вызове, который привёл к останову. Информация помещается в буфер, указанный в аргументе I<data>, который должен быть указателем на буфер с типом I<struct ptrace_syscall_info>. Аргумент I<addr> содержит размер буфера, на который указывает аргумент I<data> (т. е., I<sizeof(struct ptrace_syscall_info)>). Возвращаемое значение равно количеству байт, записанных ядром. Если размер записываемых ядром данных больше значения из аргумента I<addr>, то данные результата обрезаются.

source: The I<ptrace_syscall_info> structure contains the following fields:
ru: Структура I<ptrace_syscall_info> содержит следующие поля:

source: struct ptrace_syscall_info { __u8 op; /* Type of system call stop */ __u32 arch; /* AUDIT_ARCH_* value; see seccomp(2) */ __u64 instruction_pointer; /* CPU instruction pointer */ __u64 stack_pointer; /* CPU stack pointer */ union { struct { /* op == PTRACE_SYSCALL_INFO_ENTRY */ __u64 nr; /* System call number */ __u64 args[6]; /* System call arguments */ } entry; struct { /* op == PTRACE_SYSCALL_INFO_EXIT */ __s64 rval; /* System call return value */ __u8 is_error; /* System call error flag; Boolean: does rval contain an error value (-ERRCODE) or a nonerror return value? */ } exit; struct { /* op == PTRACE_SYSCALL_INFO_SECCOMP */ __u64 nr; /* System call number */ __u64 args[6]; /* System call arguments */ __u32 ret_data; /* SECCOMP_RET_DATA portion of SECCOMP_RET_TRACE return value */ } seccomp; }; };
ru: struct ptrace_syscall_info { __u8 op; /* тип останова системного вызова */ __u32 arch; /* значение AUDIT_ARCH_*; смотрите seccomp(2) */ __u64 instruction_pointer; /* указатель инструкции ЦП*/ __u64 stack_pointer; /* указатель стека ЦП */ union { struct { /* op == PTRACE_SYSCALL_INFO_ENTRY */ __u64 nr; /* номер системнго вызова */ __u64 args[6]; /* аргументы системного вызова */ } entry; struct { /* op == PTRACE_SYSCALL_INFO_EXIT */ __s64 rval; /* возвращаемое системным вызовом значение */ __u8 is_error; /* флаг ошибки системного вызова; логический: содержит ли rval значение ошибки (-ERRCODE) или нет? */ } exit; struct { /* op == PTRACE_SYSCALL_INFO_SECCOMP */ __u64 nr; /* номер системного вызова */ __u64 args[6]; /* аргументы системного вызова */ __u32 ret_data; /* часть SECCOMP_RET_DATA из возвращаемого значения SECCOMP_RET_TRACE */ } seccomp; }; };

source: The I<op>, I<arch>, I<instruction_pointer>, and I<stack_pointer> fields are defined for all kinds of ptrace system call stops. The rest of the structure is a union; one should read only those fields that are meaningful for the kind of system call stop specified by the I<op> field.
ru: Поля I<op>, I<arch>, I<instruction_pointer> и I<stack_pointer> определены для всех вариантов останова системного вызова ptrace. Оставшаяся структура является объединением; из неё должны читаться только те поля, которые подходят для конкретного останова системного вызова, указанного в поле I<op>.

source: The I<op> field has one of the following values (defined in I<E<lt>linux/ptrace.hE<gt>)> indicating what type of stop occurred and which part of the union is filled:
ru: В поле I<op> указывается одно из следующих значений (определены в I<E<lt>linux/ptrace.hE<gt>)>, определяющих тип возникшего останова и какая часть объединения заполнена:

source: The I<entry> component of the union contains information relating to a system call entry stop.
ru: Компонент объединения I<entry> содержит информацию об элементе останова системного вызова.

source: The I<exit> component of the union contains information relating to a system call exit stop.
ru: Компонент объединения I<exit> содержит информацию о выходе из останова системного вызова.

source: The I<exit> component of the union contains information relating to a B<PTRACE_EVENT_SECCOMP> stop.
ru: Компонент объединения I<exit> содержит информацию об останове B<PTRACE_EVENT_SECCOMP>.

source: No component of the union contains relevant information.
ru: Нет компонента объединения с подходящей информацией.

source: Death under ptrace
ru: Смерть в момент ptrace

source: When a (possibly multithreaded) process receives a killing signal (one whose disposition is set to B<SIG_DFL> and whose default action is to kill the process), all threads exit. Tracees report their death to their tracer(s). Notification of this event is delivered via B<waitpid>(2).
ru: Когда (возможно, многонитевой) процесс получает уничтожающий сигнал (из-за того, что обработчик равен B<SIG_DFL> и что действием по умолчанию является уничтожение процесса), все нити завершают работу (exit). Трассируемые нити сообщают о своей смерти своим трассировщикам. Уведомления об этом событии доставляется с помощью B<waitpid>(2).

source: Note that the killing signal will first cause signal-delivery-stop (on one tracee only), and only after it is injected by the tracer (or after it was dispatched to a thread which isn't traced), will death from the signal happen on I<all> tracees within a multithreaded process. (The term "signal-delivery-stop" is explained below.)
ru: Заметим, что уничтожающий сигнал сначала вызовет вхождение в режим signal-delivery-stop (только для одной трассируемой нити), и только после этого будет внедрён трассировщиком (или после того, как был отослан нити, которая не является трассируемой), затем I<все> трассируемые нити в многонитевом процессе завершаются по сигналу (термин «signal-delivery-stop» объяснён далее).

source: B<SIGKILL> does not generate signal-delivery-stop and therefore the tracer can't suppress it. B<SIGKILL> kills even within system calls (syscall-exit-stop is not generated prior to death by B<SIGKILL>). The net effect is that B<SIGKILL> always kills the process (all its threads), even if some threads of the process are ptraced.
ru: Сигнал B<SIGKILL> не генерирует режим signal-delivery-stop и поэтому трассировщик не может подавить его. Сигнал B<SIGKILL> уничтожает даже внутри системных вызовов (syscall-exit-stop не генерируется перед уничтожением по B<SIGKILL>). Конечным результатом B<SIGKILL> всегда является уничтожение процесса (всех его нитей), даже если для некоторых нитей процесса выполняется трассировка.

source: When the tracee calls B<_exit>(2), it reports its death to its tracer. Other threads are not affected.
ru: Когда трассируемая нить вызывает B<_exit>(2), он сообщает о своём уничтожении своему трассировщику. На оставшиеся нити ни какого влияния не оказывается.

source: When any thread executes B<exit_group>(2), every tracee in its thread group reports its death to its tracer.
ru: Если какая-нибудь нить вызывает B<exit_group>(2), то каждая трассируемая нить в этой группе нитей сообщает о своём уничтожении своему трассировщику.

source: If the B<PTRACE_O_TRACEEXIT> option is on, B<PTRACE_EVENT_EXIT> will happen before actual death. This applies to exits via B<exit>(2), B<exit_group>(2), and signal deaths (except B<SIGKILL>, depending on the kernel version; see BUGS below), and when threads are torn down on B<execve>(2) in a multithreaded process.
ru: Если установлен флаг B<PTRACE_O_TRACEEXIT>, то перед непосредственным уничтожением возникает B<PTRACE_EVENT_EXIT>. Это случается при выходе посредством B<exit>(2), B<exit_group>(2) и из-за уничтожения по сигналу (за исключением B<SIGKILL>, в зависимости от версии ядра; смотрите ДЕФЕКТЫ ниже) и когда нити многонитевой процесса разрушаются при B<execve>(2).

source: The tracer cannot assume that the ptrace-stopped tracee exists. There are many scenarios when the tracee may die while stopped (such as B<SIGKILL>). Therefore, the tracer must be prepared to handle an B<ESRCH> error on any ptrace operation. Unfortunately, the same error is returned if the tracee exists but is not ptrace-stopped (for commands which require a stopped tracee), or if it is not traced by the process which issued the ptrace call. The tracer needs to keep track of the stopped/running state of the tracee, and interpret B<ESRCH> as "tracee died unexpectedly" only if it knows that the tracee has been observed to enter ptrace-stop. Note that there is no guarantee that I<waitpid(WNOHANG)> will reliably report the tracee's death status if a ptrace operation returned B<ESRCH>. I<waitpid(WNOHANG)> may return 0 instead. In other words, the tracee may be "not yet fully dead", but already refusing ptrace requests.
ru: Трассировщик не может предполагать, что трассируемая нить, остановленная по ptrace, существует. Если много случаев, когда трассируемая нить может быть уничтожена будучи в остановленном состоянии (например, по B<SIGKILL>). Поэтому, трассировщик должен быть готов обработать ошибку B<ESRCH> при любом действии ptrace. К сожалению, эта же ошибка возвращается, если трассируемая нить существует, но не остановлена по ptrace (для действий, которые требуют остановленной трассируемой нити), или если она не трассируется процессом, который вызвал ptrace. Трассировщику необходимо отслеживать состояние остановки/работы трассируемой нити и воспринимать B<ESRCH> как «трассируемая нить была неожиданно уничтожена» только, если он знает, что трассируемая нить была в состоянии ptrace-stop. Заметим, что нет гарантии того, что I<waitpid(WNOHANG)> всегда сообщит о состоянии уничтожения трассируемой нити, если действие ptrace вернуло B<ESRCH>. Вызов I<waitpid(WNOHANG)> вместо этого может вернуть 0. Другими словами, трассируемая нить может быть «ещё не полностью уничтожена», но уже отклонять действия ptrace.

source: The tracer can't assume that the tracee I<always> ends its life by reporting I<WIFEXITED(status)> or I<WIFSIGNALED(status)>; there are cases where this does not occur. For example, if a thread other than thread group leader does an B<execve>(2), it disappears; its PID will never be seen again, and any subsequent ptrace stops will be reported under the thread group leader's PID.
ru: Трассировщик не может предполагать, что I<всегда> поймает завершение существования трассируемой нити с помощью I<WIFEXITED(status)> или I<WIFSIGNALED(status)>; есть несколько случаев, когда этого не происходит. Например, если нить — не лидер группы нитей — вызывает B<execve>(2) и исчезает; её PID больше не появится снова, и все последующие остановки по ptrace будут приходить от PID лидера группы нитей.

source: Stopped states
ru: Состояния останова

source: A tracee can be in two states: running or stopped. For the purposes of ptrace, a tracee which is blocked in a system call (such as B<read>(2), B<pause>(2), etc.) is nevertheless considered to be running, even if the tracee is blocked for a long time. The state of the tracee after B<PTRACE_LISTEN> is somewhat of a gray area: it is not in any ptrace-stop (ptrace commands won't work on it, and it will deliver B<waitpid>(2) notifications), but it also may be considered "stopped" because it is not executing instructions (is not scheduled), and if it was in group-stop before B<PTRACE_LISTEN>, it will not respond to signals until B<SIGCONT> is received.
ru: Трассируемый может находиться в двух состояниях: выполнения или остановки. В целях ptrace, трассируемый, заблокированный в системном вызове (например, B<read>(2), B<pause>(2) и т.д.), считается выполняющимся, даже если он заблокирован уже долго. Состояние трассируемого после B<PTRACE_LISTEN> находится, отчасти, в «сумеречной зоне»: не не в каком-либо из ptrace-stop (команды ptrace не будут с ним работать и он будет посылать уведомления B<waitpid>(2)), но он также может считаться за «остановленный», так как он не выполняет инструкций (не планируется для этого), и если он был в group-stop до B<PTRACE_LISTEN>, он не будет отвечать на сигналы до тех пор, пока не получит B<SIGCONT>.

source: There are many kinds of states when the tracee is stopped, and in ptrace discussions they are often conflated. Therefore, it is important to use precise terms.
ru: Есть много разновидностей останова, и в обсуждении ptrace они часто объединены. Поэтому очень важно использовать точную терминологию.

source: In this manual page, any stopped state in which the tracee is ready to accept ptrace commands from the tracer is called I<ptrace-stop>. Ptrace-stops can be further subdivided into I<signal-delivery-stop>, I<group-stop>, I<syscall-stop>, I<PTRACE_EVENT stops>, and so on. These stopped states are described in detail below.
ru: В этой справочной странице любое состояние останова, в котором трассируемая нить готова выполнить действия ptrace трассировщика, называется I<ptrace-stop>. В свою очередь, ptrace-stop можно разделить на I<signal-delivery-stop>, I<group-stop>, I<syscall-stop>, I<PTRACE_EVENT stops> и так далее. Далее эти состояния останова будут описаны подробней.

source: When the running tracee enters ptrace-stop, it notifies its tracer using B<waitpid>(2) (or one of the other "wait" system calls). Most of this manual page assumes that the tracer waits with:
ru: Когда выполняющаяся трассируемая нить входит в ptrace-stop, это видит трассировщик с помощью B<waitpid>(2) (или через другой системный вызов «wait»). В большей части текста данной справочной страницы предполагается, что трассировщик ждёт с помощью:

source: pid = waitpid(pid_or_minus_1, &status, __WALL);
ru: pid = waitpid(pid_или_минус_1, &состояние, __WALL);

source: Ptrace-stopped tracees are reported as returns with I<pid> greater than 0 and I<WIFSTOPPED(status)> true.
ru: О трассируемой нити в состоянии ptrace-stop сообщается возвратом I<pid> большим 0 и значением истины по I<WIFSTOPPED(status)>.

source: The B<__WALL> flag does not include the B<WSTOPPED> and B<WEXITED> flags, but implies their functionality.
ru: Флаг B<__WALL> не содержит флагов B<WSTOPPED> и B<WEXITED>, но подразумевает их назначение.

source: Setting the B<WCONTINUED> flag when calling B<waitpid>(2) is not recommended: the "continued" state is per-process and consuming it can confuse the real parent of the tracee.
ru: Устанавливать флаг B<WCONTINUED> при вызове B<waitpid>(2) не рекомендуется: состояние «continued» относится к определённому процессу и его поглощение может запутать реального родителя трассируемой нити.

source: Use of the B<WNOHANG> flag may cause B<waitpid>(2) to return 0 ("no wait results available yet") even if the tracer knows there should be a notification. Example:
ru: Использование флага B<WNOHANG> может привести к тому, что B<waitpid>(2) вернёт 0 («не ждать результатов, если они не готовы»), даже если трассировщик знает, что должно быть уведомление. Пример:

source: errno = 0; ptrace(PTRACE_CONT, pid, 0L, 0L); if (errno == ESRCH) { /* tracee is dead */ r = waitpid(tracee, &status, __WALL | WNOHANG); /* r can still be 0 here! */ }
ru: errno = 0; ptrace(PTRACE_CONT, pid, 0L, 0L); if (errno == ESRCH) { /* трассируемая нить мертва */ r = waitpid(tracee, &status, __WALL | WNOHANG); /* r может быть 0 ! */ }

source: The following kinds of ptrace-stops exist: signal-delivery-stops, group-stops, B<PTRACE_EVENT> stops, syscall-stops. They all are reported by B<waitpid>(2) with I<WIFSTOPPED(status)> true. They may be differentiated by examining the value I<statusE<gt>E<gt>8>, and if there is ambiguity in that value, by querying B<PTRACE_GETSIGINFO>. (Note: the I<WSTOPSIG(status)> macro can't be used to perform this examination, because it returns the value I<(statusE<gt>E<gt>8)\ &\ 0xff>.)
ru: Существуют следующие разновидности ptrace-stop: signal-delivery-stop, group-stop, остановки B<PTRACE_EVENT>, syscall-stop. Все они могут быть получены по B<waitpid>(2) с значением истинным по I<WIFSTOPPED(status)>. Их можно различить, если проверить значение I<statusE<gt>E<gt>8>, и, если есть неоднозначность этого значения, то запросив B<PTRACE_GETSIGINFO> (замечание: для выполнения этой проверки не может использоваться макрос I<WSTOPSIG(status)>, так как он возвращает значение I<(statusE<gt>E<gt>8)\ &\ 0xff>).

source: When a (possibly multithreaded) process receives any signal except B<SIGKILL>, the kernel selects an arbitrary thread which handles the signal. (If the signal is generated with B<tgkill>(2), the target thread can be explicitly selected by the caller.) If the selected thread is traced, it enters signal-delivery-stop. At this point, the signal is not yet delivered to the process, and can be suppressed by the tracer. If the tracer doesn't suppress the signal, it passes the signal to the tracee in the next ptrace restart request. This second step of signal delivery is called I<signal injection> in this manual page. Note that if the signal is blocked, signal-delivery-stop doesn't happen until the signal is unblocked, with the usual exception that B<SIGSTOP> can't be blocked.
ru: Когда процесс (возможно, многонитевой) принимает какой-либо сигнал кроме B<SIGKILL>, ядро выбирает произвольную нить для его обработки (если сигнал генерируется с помощью B<tgkill>(2), то назначаемая нить может быть явно выбрана вызывающим). Если над выбранной нитью выполняется трассировка, то она попадает в режим signal-delivery-stop. В этот момент сигнал ещё не доставлен процессу и может быть отменён трассировщиком. Если трассировщик не отменил сигнал, то он передаётся трассируемой нити при следующем запросе перезапуска ptrace. Этот второй этап доставки сигнала называется в этой справочной странице I<внедрением сигнала>. Заметим, что если сигнал блокируется, то signal-delivery-stop не происходит пока сигнал не будет разблокирован (исключением, как обычно, является B<SIGSTOP>, который нельзя заблокировать).

source: Signal-delivery-stop is observed by the tracer as B<waitpid>(2) returning with I<WIFSTOPPED(status)> true, with the signal returned by I<WSTOPSIG(status)>. If the signal is B<SIGTRAP>, this may be a different kind of ptrace-stop; see the "Syscall-stops" and "execve" sections below for details. If I<WSTOPSIG(status)> returns a stopping signal, this may be a group-stop; see below.
ru: Signal-delivery-stop наблюдается трассировщиком посредством B<waitpid>(2), возвращающим истинное значения для I<WIFSTOPPED(status)> с сигналом, который возвращается по I<WSTOPSIG(status)>. Если возвращается сигнал B<SIGTRAP>, то он может быть разновидностью ptrace-stop; смотрите разделы «Syscall-stops» и «execve» далее. Если I<WSTOPSIG(status)> возвращает останавливающий сигнал, то это может быть group-stop, смотрите далее.

source: Signal injection and suppression
ru: Внедрение и подавление сигнала

source: After signal-delivery-stop is observed by the tracer, the tracer should restart the tracee with the call
ru: После обнаружения трассировщиком signal-delivery-stop, он должен перезапустить трассируемую нить вызовом

source: where B<PTRACE_restart> is one of the restarting ptrace requests. If I<sig> is 0, then a signal is not delivered. Otherwise, the signal I<sig> is delivered. This operation is called I<signal injection> in this manual page, to distinguish it from signal-delivery-stop.
ru: где B<PTRACE_restart> — одно из перезапускающих действий ptrace. Если значение I<sig> равно 0, то сигнал не доставляется. В противном случае, доставляется сигнал I<sig>. Данная операция в справочной странице называется I<внедрением сигнала> для того, чтобы можно отличить её от signal-delivery-stop.

source: The I<sig> value may be different from the I<WSTOPSIG(status)> value: the tracer can cause a different signal to be injected.
ru: Значение I<sig> может отличаться от значения I<WSTOPSIG(status)>: трассировщик может поменять внедряемый сигнал.

source: Note that a suppressed signal still causes system calls to return prematurely. In this case, system calls will be restarted: the tracer will observe the tracee to reexecute the interrupted system call (or B<restart_syscall>(2) system call for a few system calls which use a different mechanism for restarting) if the tracer uses B<PTRACE_SYSCALL>. Even system calls (such as B<poll>(2)) which are not restartable after signal are restarted after signal is suppressed; however, kernel bugs exist which cause some system calls to fail with B<EINTR> even though no observable signal is injected to the tracee.
ru: Заметим, что подавленный сигнал всё равно заставит системные вызовы завершиться как можно скорее. В этом случае системные вызовы будут перезапущены: если трассировщик использует B<PTRACE_SYSCALL>, то обнаружит, когда трассируемая нить повторно выполнила прерванный системный вызов (или системный вызов B<restart_syscall>(2) для некоторых системных вызовов, которые используют другой механизм перезапуска). Даже системные вызовы (такие как B<poll>(2)), которые не перезапускаются по сигналу, будут перезапущены после подавления сигнала; однако, в ядре существуют дефекты, из-за которых некоторые системные вызовы завершаются с ошибкой B<EINTR>, даже если наблюдаемый сигнал не был внедрён в трассируемую нить.
