Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: There is a race condition where concurrent file size increases by another thread or process could result in a file whose size is smaller than expected.
ru: Существует состязательность, где одновременное увеличение размера файла из другой нити или процесса могут привести к тому, что размер файл будет меньше ожидаемого.

source: If I<fd> has been opened with the B<O_APPEND> or B<O_WRONLY> flags, the function fails with the error B<EBADF>.
ru: Если I<fd> был открыт с флагом B<O_APPEND> или B<O_WRONLY>, то функция завершается ошибкой B<EBADF>.

source: In general, the emulation is not MT-safe. On Linux, applications may use B<fallocate>(2) if they cannot tolerate the emulation caveats. In general, this is only recommended if the application plans to terminate the operation if B<EOPNOTSUPP> is returned, otherwise the application itself will need to implement a fallback with all the same problems as the emulation provided by glibc.
ru: Таким образом, эмуляция не является нитебезопасной. В Linux приложения могут использовать B<fallocate>(2), если для них неприемлемы оговорки эмуляции. В общем, функцию рекомендуется использовать только, если приложение планирует завершить операцию, если возвращается B<EOPNOTSUPP>, в противном случае в приложении нужно реализовать обходное решение проблем эмуляции, предоставляемой glibc.

source: pthread_cancel - send a cancellation request to a thread
ru: pthread_cancel - посылает нити запрос отмены

source: Compile and link with I<-pthread>.
ru: Компилируется и компонуется вместе с I<-pthread>.

source: The B<pthread_cancel>() function sends a cancellation request to the thread I<thread>. Whether and when the target thread reacts to the cancellation request depends on two attributes that are under the control of that thread: its cancelability I<state> and I<type>.
ru: Функция B<pthread_cancel>() посылает нити I<thread> запрос отмены. Отреагирует нити назначения и когда на запрос отмены зависит от двух атрибутов, которые управляют этой нитью: I<состояние> и I<тип> возможности отмены.

source: A thread's cancelability state, determined by B<pthread_setcancelstate>(3), can be I<enabled> (the default for new threads) or I<disabled>. If a thread has disabled cancellation, then a cancellation request remains queued until the thread enables cancellation. If a thread has enabled cancellation, then its cancelability type determines when cancellation occurs.
ru: Состояние отменяемости нити, определённое в B<pthread_setcancelstate>(3), может быть I<включено> (по умолчанию у новых нитей) или I<выключено>. Если отменяемость у нити выключена, то запрос отменяемости остаётся в очереди до тех пор, пока нить не включит отменяемость. Если отменяемость у нити включена, то когда произойдёт отмена определяется типом отменяемости.

source: A thread's cancellation type, determined by B<pthread_setcanceltype>(3), may be either I<asynchronous> or I<deferred> (the default for new threads). Asynchronous cancelability means that the thread can be canceled at any time (usually immediately, but the system does not guarantee this). Deferred cancelability means that cancellation will be delayed until the thread next calls a function that is a I<cancellation point>. A list of functions that are or may be cancellation points is provided in B<pthreads>(7).
ru: Тип отменяемости нити, определённый в B<pthread_setcanceltype>(3), может быть I<асинхронным> или I<отложенным> (по умолчанию у новых нитей). Асинхронная отменяемость означает, что нить может быть отменена в любое время (обычно, немедленно, но система не гарантирует этого). Отложенная отменяемость означает, что отмена будет задержана до тех пор, пока нить не вызовет функцию, являющуюся I<точкой отмены>. Список функций, которые могут быть точками отмены, представлен в B<pthreads>(7).

source: When a cancellation requested is acted on, the following steps occur for I<thread> (in this order):
ru: Когда выполняется запрошенная отмена, для I<thread> выполняются следующие шаги (в таком порядке):

source: Cancellation clean-up handlers are popped (in the reverse of the order in which they were pushed) and called. (See B<pthread_cleanup_push>(3).)
ru: Отмена поднимает очищающие обработчики (в обратном порядке их регистрации) и они вызываются (смотрите B<pthread_cleanup_push>(3)).

source: Thread-specific data destructors are called, in an unspecified order. (See B<pthread_key_create>(3).)
ru: Вызываются деструкторы данных нити, в неопределённом порядке (смотрите B<pthread_key_create>(3)).

source: The thread is terminated. (See B<pthread_exit>(3).)
ru: Нить завершается (смотрите B<pthread_exit>(3)).

source: The above steps happen asynchronously with respect to the B<pthread_cancel>() call; the return status of B<pthread_cancel>() merely informs the caller whether the cancellation request was successfully queued.
ru: Приведённые выше шаги выполняются асинхронно по отношению к вызову B<pthread_cancel>(); возвращаемое B<pthread_cancel>() состояние всего лишь информирует вызывающего, что запрос отмены успешно попал в очередь.

source: After a canceled thread has terminated, a join with that thread using B<pthread_join>(3) obtains B<PTHREAD_CANCELED> as the thread's exit status. (Joining with a thread is the only way to know that cancellation has completed.)
ru: После завершения отменённой нити, при объединении с этой нитью с помощью B<pthread_join>(3) возвращается B<PTHREAD_CANCELED> в качестве состояния выхода (объединение с нитью — единственный способ узнать о завершении отмены).

source: On success, B<pthread_cancel>() returns 0; on error, it returns a nonzero error number.
ru: При успешном выполнении B<pthread_cancel>() возвращается 0; при ошибке возвращается ненулевой номер ошибки.

source: On Linux, cancellation is implemented using signals. Under the NPTL threading implementation, the first real-time signal (i.e., signal 32) is used for this purpose. On LinuxThreads, the second real-time signal is used, if real-time signals are available, otherwise B<SIGUSR2> is used.
ru: В Linux отменяемость реализована с помощью сигналов. В реализации нитей NPTL для этой цели используется первый сигнал реального времени (т. е., сигнал). В LinuxThreads используется второй сигнал реального времени (если сигналы реального времени доступны, в противном случае используется B<SIGUSR2>).

source: The program below creates a thread and then cancels it. The main thread joins with the canceled thread to check that its exit status was B<PTHREAD_CANCELED>. The following shell session shows what happens when we run the program:
ru: Программа, представленная ниже, создаёт нить и затем отменяет её. Главная нить объединяется с отменённой нитью, чтобы получить состояние выхода B<PTHREAD_CANCELED>. Далее представлен сеанс работы программы:

source: $ ./a.out thread_func(): started; cancellation disabled main(): sending cancellation request thread_func(): about to enable cancellation main(): thread was canceled
ru: $ ./a.out thread_func(): запущена; отмена выключена main(): отправляем запрос отмены thread_func(): для включения отмены main(): нить была отменена

source: /* Disable cancellation for a while, so that we don\(aqt immediately react to a cancellation request */
ru: /* выключаем отмена на некоторое время для того, чтобы запрос на отмену не сработал сразу же */

source: printf("thread_func(): started; cancellation disabled\en"); sleep(5); printf("thread_func(): about to enable cancellation\en");
ru: printf("thread_func(): запущена; отмена выключена\en"); sleep(5); printf("thread_func(): для включения отмены\en");

source: /* sleep() is a cancellation point */
ru: /* sleep() является точкой отмены */

source: sleep(1000); /* Should get canceled while we sleep */
ru: sleep(1000); /* должна произойти отмена во время сна */

source: /* Should never get here */
ru: /* не должно до сюда дойти */

source: printf("thread_func(): not canceled!\en"); return NULL; }
ru: printf("thread_func(): не отменена!\en"); return NULL; }

source: /* Start a thread and then send it a cancellation request */
ru: /* запускаем нить, а затем посылаем ей запрос отмены */

source: sleep(2); /* Give thread a chance to get started */
ru: sleep(2); /* даём время нити запуститься */

source: printf("main(): sending cancellation request\en"); s = pthread_cancel(thr); if (s != 0) handle_error_en(s, "pthread_cancel");
ru: printf("main(): посылаем запрос отмены\en"); s = pthread_cancel(thr); if (s != 0) handle_error_en(s, "pthread_cancel");

source: /* Join with thread to see what its exit status was */
ru: /* присоединяемся к нити для получения её кода выхода */

source: if (res == PTHREAD_CANCELED) printf("main(): thread was canceled\en"); else printf("main(): thread wasn\(aqt canceled (shouldn\(aqt happen!)\en"); exit(EXIT_SUCCESS); }
ru: if (res == PTHREAD_CANCELED) printf("main(): нить была отменена\en"); else printf("main(): нить не была отменена, чего быть не должно!)\en"); exit(EXIT_SUCCESS); }

source: program_invocation_name, program_invocation_short_name - obtain name used to invoke calling program
ru: program_invocation_name, program_invocation_short_name - имя, использованное для запуска вызвавшей программы

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>errno.hE<gt>>
ru: B<#define _GNU_SOURCE> /* см. feature_test_macros(7) */ B<#include E<lt>errno.hE<gt>>

source: I<program_invocation_name> contains the name that was used to invoke the calling program. This is the same as the value of I<argv[0]> in I<main>(), with the difference that the scope of I<program_invocation_name> is global.
ru: Переменная I<program_invocation_name> содержит имя, которое было использовано для запуска вызвавшей программы. Это значение совпадает с I<argv[0]> в I<main>(); отличие в том, что I<program_invocation_name> — глобальная переменная.

source: I<program_invocation_short_name> contains the basename component of name that was used to invoke the calling program. That is, it is the same value as I<program_invocation_name>, with all text up to and including the final slash (/), if any, removed.
ru: Переменная I<program_invocation_short_name> содержит базовую часть имени, которое было использовано для запуска вызвавшей программы. То есть её значение совпадает с началом I<program_invocation_name> до последней косой черты (/).

source: These variables are automatically initialized by the glibc run-time startup code.
ru: Эти переменные автоматически инициализируются glibc при запуске программы.

source: These variables are GNU extensions, and should not be used in programs intended to be portable.
ru: Эти переменные являются расширениями GNU, и они не должны использоваться в переносимых программах.

source: The Linux-specific I</proc/[number]/cmdline> file provides access to similar information.
ru: В Linux файл I</proc/[number]/cmdline> содержит подобную информацию.

source: pthread_testcancel - request delivery of any pending cancellation request
ru: pthread_testcancel - доставляет ожидающий запрос отмены

source: Calling B<pthread_testcancel>() creates a cancellation point within the calling thread, so that a thread that is otherwise executing code that contains no cancellation points will respond to a cancellation request.
ru: Вызов B<pthread_testcancel>() создаёт точку отмены в вызвавшей нити, из-за чего нить, в выполняемом коде которой нет точек отмены, ответит на запрос отмены.

source: If cancelability is disabled (using B<pthread_setcancelstate>(3)), or no cancellation request is pending, then a call to B<pthread_testcancel>() has no effect.
ru: Если отменяемость выключена (с помощью B<pthread_setcancelstate>(3)) или нет ожидающего запроса отмены, то функция B<pthread_testcancel>() ничего не делает.

source: This function does not return a value. If the calling thread is canceled as a consequence of a call to this function, then the function does not return.
ru: Эта функция не возвращает значения. Если вызвавшая нить отменяется из-за вызова этой функции, то функция не возвращает управление.

source: This function always succeeds.
ru: Данная функция всегда завершается успешно.

source: pthread_mutexattr_getpshared, pthread_mutexattr_setpshared - get/set process-shared mutex attribute
ru: pthread_mutexattr_getpshared, pthread_mutexattr_setpshared - возвращает/изменяет общепроцессный атрибут мьютекса

source: These functions get and set the process-shared attribute in a mutex attributes object. This attribute must be appropriately set to ensure correct, efficient operation of a mutex created using this attributes object.
ru: Эти функции возвращают и изменяют общепроцессный атрибут мьютекса в объекте атрибутов мьютекса. Данный атрибут должен быть установлен соответствующим образом для обеспечения правильной, эффективной работы мьютекса, созданного с использованием данного объекта атрибутов.

source: The process-shared attribute can have one of the following values:
ru: В общепроцессном аргументе можно указать одно из следующих значений:

source: Mutexes created with this attributes object are to be shared only among threads in the same process that initialized the mutex. This is the default value for the process-shared mutex attribute.
ru: Мьютексы, созданные с таким объектом атрибутов, будут считаться общими только для нитей одного процесса, инициализировавшего мьютекс. Это значение используется по умолчанию для общепроцессного атрибута мьютекса.

source: Mutexes created with this attributes object can be shared between any threads that have access to the memory containing the object, including threads in different processes.
ru: Мьютексы, созданные с таким объектом атрибутов, будут считаться общими между всеми нитями, имеющими доступ к памяти, содержащей объект, даже нити разных процессов.

source: B<pthread_mutexattr_getpshared>() places the value of the process-shared attribute of the mutex attributes object referred to by I<attr> in the location pointed to by I<pshared>.
ru: Функция B<pthread_mutexattr_getpshared>() помещает значения общепроцессного атрибута объекта атрибутов мьютекса, на который указывает I<attr>, в расположение, указанное в I<pshared>.

source: B<pthread_mutexattr_setpshared>() sets the value of the process-shared attribute of the mutex attributes object referred to by I<attr> to the value specified in B<pshared>.
ru: Функция B<pthread_mutexattr_setpshared>() изменяет значения общепроцессного атрибута объекта атрибутов мьютекса, на который указывает I<attr>, на значение, заданное в B<pshared>.

source: If I<attr> does not refer to an initialized mutex attributes object, the behavior is undefined.
ru: Если I<attr> не ссылается на инициализированный объект атрибутов мьютекса, то поведение не определено.

source: B<pthread_mutexattr_setpshared>() can fail with the following errors:
ru: Функция B<pthread_mutexattr_setpshared>() может завершаться со следующими ошибками:

source: The value specified in I<pshared> is invalid.
ru: Неверное значение в I<pshared>.

source: I<pshared is> B<PTHREAD_PROCESS_SHARED> but the implementation does not support process-shared mutexes.
ru: Значение I<pshared> равно B<PTHREAD_PROCESS_SHARED>, но реализация не поддерживает общепроцессные мьютексы.

source: pthread_rwlockattr_setkind_np, pthread_rwlockattr_getkind_np - set/get the read-write lock kind of the thread read-write lock attribute object
ru: pthread_rwlockattr_setkind_np, pthread_rwlockattr_getkind_np - изменяет/возвращает вид блокировки чтения-записи у объекта-атрибута блокировки чтения-записи нити

source: The B<pthread_rwlockattr_setkind_np>() function sets the "lock kind" attribute of the read-write lock attribute object referred to by I<attr> to the value specified in I<pref>. The argument I<pref> may be set to one of the following:
ru: Функция B<pthread_rwlockattr_setkind_np>() изменяет атрибут «вида блокировки» у объекта-атрибута блокировки чтения-записи, на который указывает I<attr>, в значение I<pref>. Значением I<pref> может быть одно из:

source: This is the default. A thread may hold multiple read locks; that is, read locks are recursive. According to The Single Unix Specification, the behavior is unspecified when a reader tries to place a lock, and there is no write lock but writers are waiting. Giving preference to the reader, as is set by B<PTHREAD_RWLOCK_PREFER_READER_NP>, implies that the reader will receive the requested lock, even if a writer is waiting. As long as there are readers, the writer will be starved.
ru: Значение по умолчанию. Нить может удерживать многократную блокировку чтения; то есть блокировки чтения рекурсивны. Согласно Single Unix Specification, поведение не определено, если читатель пытается установить блокировку и отсутствует блокировка записи, но писатели ждут. Давая преимущество читателю установкой B<PTHREAD_RWLOCK_PREFER_READER_NP> подразумевается, что читатель будет получать запрашиваемую блокировку даже, если ждёт писатель. Пока есть читатели писатель будет ждать.

source: This is intended as the write lock analog of B<PTHREAD_RWLOCK_PREFER_READER_NP>. This is ignored by glibc because the POSIX requirement to support recursive writer locks would cause this option to create trivial deadlocks; instead use B<PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP> which ensures the application developer will not take recursive read locks thus avoiding deadlocks.
ru: Аналог B<PTHREAD_RWLOCK_PREFER_READER_NP>, но для блокировки записи. Игнорируется glibc, так как с учётом требований POSIX рекурсивная блокировка записи, привела был к созданию вечной блокировки (deadlocks); вместо неё используется B<PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP>, которая не позволяет разработчику приложения получить рекурсивную блокировку чтения, и поэтому вечной блокировки не случится.

source: Setting the lock kind to this avoids writer starvation as long as any read locking is not done in a recursive fashion.
ru: Данный вид блокировки помогает избежать ожидания писателя всё время пока не освободится рекурсивная блокировка чтения.

source: The B<pthread_rwlockattr_getkind_np>() function returns the value of the lock kind attribute of the read-write lock attribute object referred to by I<attr> in the pointer I<pref>.
ru: Функция B<pthread_rwlockattr_getkind_np>() сохраняет атрибут «вида блокировки» у объекта-атрибута блокировки чтения-записи, на который указывает I<attr>, в указатель I<pref>.

source: On success, these functions return 0. Given valid pointer arguments, B<pthread_rwlockattr_getkind_np>() always succeeds. On error, B<pthread_rwlockattr_setkind_np>() returns a nonzero error number.
ru: При успешном выполнении эти функции возвращают 0. При корректных аргументах указателей B<pthread_rwlockattr_getkind_np>() всегда выполняется успешно. При ошибке B<pthread_rwlockattr_setkind_np>() возвращает ненулевой номер ошибки.

source: I<pref> specifies an unsupported value.
ru: Неподдерживаемое значение I<pref>.

source: The B<pthread_rwlockattr_getkind_np>() and B<pthread_rwlockattr_setkind_np>() functions first appeared in glibc 2.1.
ru: Функции B<pthread_rwlockattr_getkind_np>() и B<pthread_rwlockattr_setkind_np>() впервые появились в glibc 2.1.

source: These functions are non-standard GNU extensions; hence the suffix "_np" (nonportable) in the names.
ru: Данные функции являются не стандартизированными расширениями GNU, о чем свидетельствует суффикс «_np» (nonportable).

source: ptsname, ptsname_r - get the name of the slave pseudoterminal
ru: ptsname, ptsname_r - возвращает имя подчинённого псевдо-терминала

source: Since glibc 2.24: _XOPEN_SOURCE\ E<gt>=\ 500 || (_XOPEN_SOURCE\ &&\ _XOPEN_SOURCE_EXTENDED)
ru: начиная с glibc 2.24: _XOPEN_SOURCE\ E<gt>=\ 500 || (_XOPEN_SOURCE\ &&\ _XOPEN_SOURCE_EXTENDED)

source: Glibc 2.23 and earlier: _XOPEN_SOURCE
ru: glibc 2.23 и старее: _XOPEN_SOURCE

source: The B<ptsname>() function returns the name of the slave pseudoterminal device corresponding to the master referred to by I<fd>.
ru: Функция B<ptsname>() возвращает имя устройства подчинённого псевдо-терминала, соответствующего главному, который указан в I<fd>.

source: The B<ptsname_r>() function is the reentrant equivalent of B<ptsname>(). It returns the name of the slave pseudoterminal device as a null-terminated string in the buffer pointed to by I<buf>. The I<buflen> argument specifies the number of bytes available in I<buf>.
ru: Функция B<ptsname_r>() является реентерабельным эквивалентном B<ptsname>(). Она сохраняет имя устройства подчинённого псевдо-терминала в виде строки (завершающейся null) в буфер, указанный в I<buf>. В аргументе I<buflen> задаётся количество байт, доступных в I<buf>.

source: On success, B<ptsname>() returns a pointer to a string in static storage which will be overwritten by subsequent calls. This pointer must not be freed. On failure, NULL is returned.
ru: При успешном выполнении B<ptsname>() возвращает указатель на строку в статическом хранилище, которая будет перезаписана последующими вызовами. Данный указатель не нужно освобождать. При ошибке возвращается NULL.

source: On success, B<ptsname_r>() returns 0. On failure, a nonzero value is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<ptsname_r>() возвращает 0. При ошибке возвращается ненулевое значение и в I<errno> записывается номер ошибки.

source: (B<ptsname_r>() only) I<buf> is NULL. (This error is returned only for glibc 2.25 and earlier.)
ru: (только B<ptsname_r>()) Значение I<buf> равно NULL (эта ошибка возвращается только в glibc 2.25 и старее).

source: I<fd> does not refer to a pseudoterminal master device.
ru: Значение I<fd> не ссылается на устройство главного псевдо-терминала.

source: (B<ptsname_r>() only) I<buf> is too small.
ru: (только B<ptsname_r>()) Значение I<buf> слишком мало.

source: B<ptsname>() is provided in glibc since version 2.1.
ru: Функция B<ptsname>() появилась в glibc версии 2.1.

source: B<ptsname>() is part of the UNIX 98 pseudoterminal support (see B<pts>(4)).
ru: Функция B<ptsname>() является частью поддержки псевдо-терминалов UNIX 98 (смотрите B<pts>(4)).

source: B<ptsname_r>() is a Linux extension, that is proposed for inclusion in the next major revision of POSIX.1 (Issue 8). A version of this function is documented on Tru64 and HP-UX, but on those implementations, -1 is returned on error, with I<errno> set to indicate the error. Avoid using this function in portable programs.
ru: Функция B<ptsname_r>() является расширением Linux, которую предполагается включить в следующую большую версию POSIX.1 (Issue 8). Версия этой функции описана в Tru64 и HP-UX, но в их реализациях при ошибке возвращается -1, а в I<errno> записывается номер ошибки. Не используйте эту функцию в переносимых программах.

source: pthread_getattr_np - get attributes of created thread
ru: pthread_getattr_np - возвращает атрибуты созданной нити

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>pthread.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>pthread.hE<gt>>

source: The B<pthread_getattr_np>() function initializes the thread attributes object referred to by I<attr> so that it contains actual attribute values describing the running thread I<thread>.
ru: Функция B<pthread_getattr_np>() инициализирует объект атрибутов нити, на который указывает I<attr>, так, чтобы он содержал актуальные значения атрибутов выполняющейся нити I<thread>.
