Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: On success, B<pthread_atfork>() returns zero. On error, it returns an error number. B<pthread_atfork>() may be called multiple times by a thread, to register multiple handlers for each phase. The handlers for each phase are called in a specified order: the I<prepare> handlers are called in reverse order of registration; the I<parent> and I<child> handlers are called in the order of registration.
ru: При успешном выполнении B<pthread_atfork>() возвращается ноль. При ошибке возвращается номер ошибки. Функция B<pthread_atfork>() может быть вызвана нитью несколько раз для регистрации нескольких обработчиков каждого шага. Обработчики каждого шага вызываются в определённом порядке: обработчики I<prepare> вызываются в порядке обратном регистрации; обработчики I<parent> и I<child> вызываются в порядке их регистрации.

source: Could not allocate memory to record the form handler entry.
ru: Невозможно выделить память для записи элемента обработчика.

source: When B<fork>(2) is called in a multithreaded process, only the calling thread is duplicated in the child process. The original intention of B<pthread_atfork>() was to allow the calling thread to be returned to a consistent state. For example, at the time of the call to B<fork>(2), other threads may have locked mutexes that are visible in the user-space memory duplicated in the child. Such mutexes would never be unlocked, since the threads that placed the locks are not duplicated in the child. The intent of B<pthread_atfork>() was to provide a mechanism whereby the application (or a library) could ensure that mutexes and other process and thread state would be restored to a consistent state. In practice, this task is generally too difficult to be practicable.
ru: При вызове B<fork>(2) в многонитевом процессе в дочернем процессе делается копия только вызвавшей нити. Первоначальной целью B<pthread_atfork>() было позволить возвращаться в вызывающей нити в целостном состоянии. Например, на момент вызова B<fork>(2) другие нити могут заблокировать мьютексы, которые видимы в памяти пользовательского пространства копии в потомке. Такие мьютексы никогда не разблокируются, так как нити, создавшие блокировку, не копируются в потомок. Целью B<pthread_atfork>() было предоставить механизм, позволяющий приложению (или библиотеке) сделать так, чтобы мьютексы, другой процесс и состояние нити восстанавливались бы в целостном состоянии. На практике, эта задача очень сложна для реализации.

source: After a B<fork>(2) in a multithreaded process returns in the child, the child should call only async-signal-safe functions (see B<signal-safety>(7)) until such time as it calls B<execve>(2) to execute a new program.
ru: В многонитевом процессе B<fork>(2) возвращает управление в потомок; потомок должен вызывать только функции async-signal-safe (смотрите B<signal-safety>(7)) до момента, пока не вызовет B<execve>(2) для выполнения новой программы.

source: POSIX.1 specifies that B<pthread_atfork>() shall not fail with the error B<EINTR>.
ru: В POSIX.1 указано, что B<pthread_atfork>() не должен завершаться ошибкой B<EINTR>.

source: pow10, pow10f, pow10l - base-10 power functions
ru: pow10, pow10f, pow10l - функция возведения числа 10 в степень

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>math.hE<gt>>
ru: B<#define _GNU_SOURCE> /* см. feature_test_macros(7) */ B<#include E<lt>math.hE<gt>>

source: These functions return the value of 10 raised to the power I<x>.
ru: Данные функции возвращают значение 10, возведённое в степень I<x>.

source: B<Note well>: These functions perform exactly the same task as the functions described in B<exp10>(3), with the difference that the latter functions are now standardized in TS\ 18661-4:2015. Those latter functions should be used in preference to the functions described in this page.
ru: B<Примечание>: Эти функции выполняют те же задачи, что и функции, описанные в B<exp10>(3), с той разницей, что последние описаны в TS\ 18661-4:2015. Рекомендуется использовать последние функции, а не описанные в этой странице.

source: These functions first appeared in glibc in version 2.1. Since glibc 2.27, the use of these functions in new programs is no longer supported.
ru: Эти функции впервые появились в glibc 2.1. Начиная с glibc 2.27, использование данных функций в новых программах больше не поддерживается.

source: This functions are nonstandard GNU extensions.
ru: Эти функции являются расширениями GNU.

source: pthread_attr_setstackaddr, pthread_attr_getstackaddr - set/get stack address attribute in thread attributes object
ru: pthread_attr_setstackaddr, pthread_attr_getstackaddr - изменяет/возвращает атрибут адреса стека у объекта атрибутов нити

source: These functions are obsolete: B<do not use them.> Use B<pthread_attr_setstack>(3) and B<pthread_attr_getstack>(3) instead.
ru: Данные функции устарели: B<не используйте их>. Используйте B<pthread_attr_setstack>(3) и B<pthread_attr_getstack>(3).

source: The B<pthread_attr_setstackaddr>() function sets the stack address attribute of the thread attributes object referred to by I<attr> to the value specified in I<stackaddr>. This attribute specifies the location of the stack that should be used by a thread that is created using the thread attributes object I<attr>.
ru: Функция B<pthread_attr_setstackaddr>() изменяет атрибут адреса стека нити в объекте атрибутов нити, на который указывает I<attr>, в значение I<stackaddr>. Данным атрибутом задаётся расположение стека, который будет использоваться нитью, созданной с учётом объекта атрибутов нити I<attr>.

source: I<stackaddr> should point to a buffer of at least B<PTHREAD_STACK_MIN> bytes that was allocated by the caller. The pages of the allocated buffer should be both readable and writable.
ru: Значение I<stackaddr> должно указывать на буфер из, по крайней мере, B<PTHREAD_STACK_MIN> байт, который был выделен вызывающим. Страницы выделенного буфера должны быть доступны на чтение и запись.

source: The B<pthread_attr_getstackaddr>() function returns the stack address attribute of the thread attributes object referred to by I<attr> in the buffer pointed to by I<stackaddr>.
ru: Функция B<pthread_attr_getstackaddr>() возвращает атрибут адреса стека у объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<stackaddr>.

source: No errors are defined (but applications should nevertheless handle a possible error return).
ru: Ошибок не предполагается (тем не менее, приложения должны обрабатывать возможную ошибку возврата).

source: POSIX.1-2001 specifies these functions but marks them as obsolete. POSIX.1-2008 removes the specification of these functions.
ru: В POSIX.1-2001 эта функция определена, но объявлена устаревшей. В POSIX.1-2008 спецификация этих функций удалена.

source: I<Do not use these functions!> They cannot be portably used, since they provide no way of specifying the direction of growth or the range of the stack. For example, on architectures with a stack that grows downward, I<stackaddr> specifies the next address past the I<highest> address of the allocated stack area. However, on architectures with a stack that grows upward, I<stackaddr> specifies the I<lowest> address in the allocated stack area. By contrast, the I<stackaddr> used by B<pthread_attr_setstack>(3) and B<pthread_attr_getstack>(3), is always a pointer to the lowest address in the allocated stack area (and the I<stacksize> argument specifies the range of the stack).
ru: I<Не используйте эти функции!> Они не являются переносимыми, так как не предоставляют возможности указать направление роста или диапазон стека. Например, для архитектур со стеком растущим вниз, в I<stackaddr> указывается следующий адрес за I<самым верхним> адресом выделяемой области стека, Однако для архитектур со стеком растущим вверх, в I<stackaddr> указывается I<самый нижний> адрес выделяемой области стека. area. В отличие от этого, значение I<stackaddr>, используемое B<pthread_attr_setstack>(3) и B<pthread_attr_getstack>(3), всегда является указателем на самый нижний адрес в выделяемой области стека (а в аргументе I<stacksize> указывается диапазон стека).

source: posix_spawn, posix_spawnp - spawn a process
ru: posix_spawn, posix_spawnp - порождает процесс

source: The B<posix_spawn>() and B<posix_spawnp>() functions are used to create a new child process that executes a specified file. These functions were specified by POSIX to provide a standardized method of creating new processes on machines that lack the capability to support the B<fork>(2) system call. These machines are generally small, embedded systems lacking MMU support.
ru: Функции B<posix_spawn>() и B<posix_spawnp>() используются для создания новых дочерних процессов, которые выполняют указываемый файл. Эти функции были определены в POSIX для стандартизации метода создания новых процессов на машинах, у которых нет возможности поддержки системного вызова B<fork>(2). К таким машинах, обычно, относятся встраиваемые системы без поддержки MMU.

source: The B<posix_spawn>() and B<posix_spawnp>() functions provide the functionality of a combined B<fork>(2) and B<exec>(3), with some optional housekeeping steps in the child process before the B<exec>(3). These functions are not meant to replace the B<fork>(2) and B<execve>(2) system calls. In fact, they provide only a subset of the functionality that can be achieved by using the system calls.
ru: Функции B<posix_spawn>() и B<posix_spawnp>() предоставляют комбинацию возможностей B<fork>(2) и B<exec>(3) с некоторыми необязательными обслуживающими действиями в дочернем процессе перед B<exec>(3). Эти функции не служат заменой системных вызовов B<fork>(2) и B<execve>(2). Фактически, они предоставляют только часть функций системных вызовов.

source: The only difference between B<posix_spawn>() and B<posix_spawnp>() is the manner in which they specify the file to be executed by the child process. With B<posix_spawn>(), the executable file is specified as a pathname (which can be absolute or relative). With B<posix_spawnp>(), the executable file is specified as a simple filename; the system searches for this file in the list of directories specified by B<PATH> (in the same way as for B<execvp>(3)). For the remainder of this page, the discussion is phrased in terms of B<posix_spawn>(), with the understanding that B<posix_spawnp>() differs only on the point just described.
ru: Единственным отличием между B<posix_spawnp>() и B<posix_spawnp>() является способ, которым в них указывается исполняемый дочерним процессом файл. В B<posix_spawn>() исполняемый файл задаётся в виде пути (которое может быть абсолютным или относительным). В B<posix_spawnp>() исполняемый файл задаётся в виде имени файла; система ищет этот файл в списке каталогов, указанных в B<PATH> (также, как это делает B<execvp>(3)). Кроме данного отличия далее на этой странице всё описание B<posix_spawn>() также относится и к B<posix_spawnp>().

source: The remaining arguments to these two functions are as follows:
ru: Остальные аргументы функций:

source: The I<pid> argument points to a buffer that is used to return the process ID of the new child process.
ru: Аргумент I<pid> указывает на буфер, в котором возвращается ID нового дочернего процесса.

source: The I<file_actions> argument points to a I<spawn file actions object> that specifies file-related actions to be performed in the child between the B<fork>(2) and B<exec>(3) steps. This object is initialized and populated before the B<posix_spawn>() call using B<posix_spawn_file_actions_init>(3) and the B<posix_spawn_file_actions_*>() functions.
ru: Аргумент I<file_actions> указывает на I<объект файловых действий при создании>, в котором задаются действия с файлом, выполняемые в потомке между шагами B<fork>(2) и B<exec>(3). Данный объект инициализируется и заполняется перед вызовом B<posix_spawn>() с помощью функций B<posix_spawn_file_actions_init>(3) и B<posix_spawn_file_actions_*>().

source: The I<attrp> argument points to an I<attributes objects> that specifies various attributes of the created child process. This object is initialized and populated before the B<posix_spawn>() call using B<posix_spawnattr_init>(3) and the B<posix_spawnattr_*>() functions.
ru: Аргумент I<attrp> указывает на I<объект атрибутов>, в котором задаются различные атрибуты создаваемого дочернего процесса. Данный объект инициализируется и заполняется перед вызовом B<posix_spawn>() с помощью функций B<posix_spawnattr_init>(3) и B<posix_spawnattr_*>().

source: The I<argv> and I<envp> arguments specify the argument list and environment for the program that is executed in the child process, as for B<execve>(2).
ru: В аргументах I<argv> и I<envp> задаётся список аргументов и окружения для программы, выполняемой в дочернем процессе, как для B<execve>(2).

source: Below, the functions are described in terms of a three-step process: the B<fork>() step, the pre-B<exec>() step (executed in the child), and the B<exec>() step (executed in the child).
ru: Далее функции описаны в виде трёх ступенчатого процесса: шаг B<fork>(), шаг перед B<exec>() (выполняется в потомке) и шаг B<exec>() (выполняется в потомке).

source: fork() step
ru: Шаг fork()

source: The B<posix_spawn>() function commences by calling B<fork>(2), or possibly B<vfork>(2) (see below).
ru: Функция B<posix_spawn>() начинает работу с вызова B<fork>(2) или, возможно, B<vfork>(2) (смотрите ниже).

source: The PID of the new child process is placed in I<*pid>. The B<posix_spawn>() function then returns control to the parent process.
ru: PID нового дочернего процесса помещается в I<*pid>. После этого функция B<posix_spawn>() возвращает управление родительскому процессу.

source: Subsequently, the parent can use one of the system calls described in B<wait>(2) to check the status of the child process. If the child fails in any of the housekeeping steps described below, or fails to execute the desired file, it exits with a status of 127.
ru: Соответственно, родитель может использовать один из системных вызовов, описанных в B<wait>(2), для проверки состояния дочернего процесса. Если потомок завершится с ошибкой в любом из служебных шагов, описанных далее, или возникнет ошибка при выполнении желаемого файла, то он завершит работу с кодом состояния 127.

source: The child process is created using B<vfork>(2) instead of B<fork>(2) when either of the following is true:
ru: Дочерний процесс создаётся с помощью B<vfork>(2), а не B<fork>(2) в любом из следующих случаев:

source: the I<spawn-flags> element of the attributes object pointed to by I<attrp> contains the GNU-specific flag B<POSIX_SPAWN_USEVFORK>; or
ru: элемент I<spawn-flags> объекта атрибутов, на который указывает I<attrp>, содержит определённый в GNU флаг B<POSIX_SPAWN_USEVFORK>; или

source: I<file_actions> is NULL and the I<spawn-flags> element of the attributes object pointed to by I<attrp> does I<not> contain B<POSIX_SPAWN_SETSIGMASK>, B<POSIX_SPAWN_SETSIGDEF>, B<POSIX_SPAWN_SETSCHEDPARAM>, B<POSIX_SPAWN_SETSCHEDULER>, B<POSIX_SPAWN_SETPGROUP>, or B<POSIX_SPAWN_RESETIDS>.
ru: I<file_actions> равно NULL и элемент I<spawn-flags> объекта атрибутов, на который указывает I<attrp>, I<не> содержит B<POSIX_SPAWN_SETSIGMASK>, B<POSIX_SPAWN_SETSIGDEF>, B<POSIX_SPAWN_SETSCHEDPARAM>, B<POSIX_SPAWN_SETSCHEDULER>, B<POSIX_SPAWN_SETPGROUP> или B<POSIX_SPAWN_RESETIDS>.

source: In other words, B<vfork>(2) is used if the caller requests it, or if there is no cleanup expected in the child before it B<exec>(3)s the requested file.
ru: Иначе говоря, B<vfork>(2) используется, если это запросил вызывающий или не нужна очистка в потомке перед выполнением B<exec>(3) запрашиваемого файла.

source: pre-exec() step: housekeeping
ru: Шаг перед exec(): служебные действия

source: In between the B<fork>(2) and the B<exec>(3), a child process may need to perform a set of housekeeping actions. The B<posix_spawn>() and B<posix_spawnp>() functions support a small, well-defined set of system tasks that the child process can accomplish before it executes the executable file. These operations are controlled by the attributes object pointed to by I<attrp> and the file actions object pointed to by I<file_actions>. In the child, processing is done in the following sequence:
ru: Между B<fork>(2) и B<exec>(3) дочерний процесс может выполнить набор служебных действий. Функции B<posix_spawn>() и B<posix_spawnp>() поддерживают маленький, хорошо спроектированный набор системных задач, которые дочерний процесс может выполнить перед запуском исполняемого файла. Эти операции управляются объектом атрибутов, на который указывает I<attrp> и объект файловых действий, на который указывает I<file_actions>. В потомке обработка выполняются в следующей последовательности:

source: Process attribute actions: signal mask, signal default handlers, scheduling algorithm and parameters, process group, and effective user and group IDs are changed as specified by the attributes object pointed to by I<attrp>.
ru: Действия с атрибутами процесса: маска сигналов, обработчики сигналов по умолчанию, алгоритм планирования и параметры, ID группы процесса, эффективного пользователя и группы изменяются согласно объекту атрибутов, на который указывает I<attrp>.

source: File actions, as specified in the I<file_actions> argument, are performed in the order that they were specified using calls to the B<posix_spawn_file_actions_add*>() functions.
ru: Файловые действия, указываемые в аргументе I<file_actions>, выполняются в порядке их определения вызовами функций B<posix_spawn_file_actions_add*>().

source: File descriptors with the B<FD_CLOEXEC> flag set are closed.
ru: Закрываются файловые дескрипторы, имеющие флаг B<FD_CLOEXEC>.

source: All process attributes in the child, other than those affected by attributes specified in the object pointed to by I<attrp> and the file actions in the object pointed to by I<file_actions>, will be affected as though the child was created with B<fork>(2) and it executed the program with B<execve>(2).
ru: Все атрибуты процесса-потомка, отличные от атрибутов в объекте, на который указывает I<attrp> и файловые действия в объекте, на который указывает I<file_actions>, будут изменены как если бы потомок создавался с помощью B<fork>(2) и выполнял программу с помощью B<execve>(2).

source: The process attributes actions are defined by the attributes object pointed to by I<attrp>. The I<spawn-flags> attribute (set using B<posix_spawnattr_setflags>(3)) controls the general actions that occur, and other attributes in the object specify values to be used during those actions.
ru: Действия атрибутов процесса определяются атрибутами объекта, на который указывает I<attrp>. Атрибут I<spawn-flags> (устанавливается с помощью B<posix_spawnattr_setflags>(3)) управляет общими действиями, а остальные атрибуты объекта хранят значения, которые будут использованы в этих действиях.

source: The effects of the flags that may be specified in I<spawn-flags> are as follows:
ru: Влияние флагов, которые могут быть указаны в I<spawn-flags>:

source: Set the signal mask to the signal set specified in the I<spawn-sigmask> attribute of the object pointed to by I<attrp>. If the B<POSIX_SPAWN_SETSIGMASK> flag is not set, then the child inherits the parent's signal mask.
ru: Назначить маску сигналов равной набору сигналов, определённой в атрибуте I<spawn-sigmask> объекта, на который указывает I<attrp>. Если не установлен флаг B<POSIX_SPAWN_SETSIGMASK>, то потомок наследует маску сигналов родителя.

source: Reset the disposition of all signals in the set specified in the I<spawn-sigdefault> attribute of the object pointed to by I<attrp> to the default. For the treatment of the dispositions of signals not specified in the I<spawn-sigdefault> attribute, or the treatment when B<POSIX_SPAWN_SETSIGDEF> is not specified, see B<execve>(2).
ru: Сбрасывает обработчики всех сигналов в наборе, заданном в атрибуте I<spawn-sigdefault> объекта, на который указывает I<attrp>, в значения по умолчанию. О том, что происходит с обработчиками сигналов не указанных в атрибуте I<spawn-sigdefault> или когда не указан B<POSIX_SPAWN_SETSIGDEF>, смотрите B<execve>(2).

source: If this flag is set, and the B<POSIX_SPAWN_SETSCHEDULER> flag is not set, then set the scheduling parameters to the parameters specified in the I<spawn-schedparam> attribute of the object pointed to by I<attrp>.
ru: Если этот флаг установлен, а B<POSIX_SPAWN_SETSCHEDULER> нет, то изменяет параметры планирования на значения, указанные в атрибуте I<spawn-schedparam> объекта, на который указывает I<attrp>.

source: Set the scheduling policy algorithm and parameters of the child, as follows:
ru: Назначает алгоритм планирования и параметры потомка:

source: The scheduling policy is set to the value specified in the I<spawn-schedpolicy> attribute of the object pointed to by I<attrp>.
ru: Алгоритму планирования присваивается значение, указанное в атрибуте I<spawn-schedpolicy> объекта, на который указывает I<attrp>.

source: The scheduling parameters are set to the value specified in the I<spawn-schedparam> attribute of the object pointed to by I<attrp> (but see BUGS).
ru: Параметрам планирования присваивается значение, указанное в атрибуте I<spawn-schedparam> объекта, на который указывает I<attrp> (но смотрите ДЕФЕКТЫ).

source: If the B<POSIX_SPAWN_SETSCHEDPARAM> and B<POSIX_SPAWN_SETSCHEDPOLICY> flags are not specified, the child inherits the corresponding scheduling attributes from the parent.
ru: Если не указаны флаги B<POSIX_SPAWN_SETSCHEDPARAM> и B<POSIX_SPAWN_SETSCHEDPOLICY>, то потомок наследует соответствующие атрибуты планирования от родителя.

source: If this flag is set, reset the effective UID and GID to the real UID and GID of the parent process. If this flag is not set, then the child retains the effective UID and GID of the parent. In either case, if the set-user-ID and set-group-ID permission bits are enabled on the executable file, their effect will override the setting of the effective UID and GID (se B<execve>(2)).
ru: Если этот флаг установлен, то сбрасываются эффективный UID и GID в реальный UID и GID родительского процесса. Если флаг не установлен, то потомок сохраняет эффективный UID и GID родителя. В любом случае, если биты прав set-user-ID и set-group-ID включены на исполняемом файле, то это заменяет значения эффективного UID и GID (смотрите B<execve>(2)).

source: Set the process group to the value specified in the I<spawn-pgroup> attribute of the object pointed to by I<attrp>. If the I<spawn-pgroup> attribute has the value 0, the child's process group ID is made the same as its process ID. If the B<POSIX_SPAWN_SETPGROUP> flag is not set, the child inherits the parent's process group ID.
ru: Назначает группе процесса значение, указанное в атрибуте I<spawn-pgroup> объекта, на который указывает I<attrp>. Если атрибут I<spawn-pgroup> равен 0, то ID группы потомка становится равным его ID процесса. Если флаг B<POSIX_SPAWN_SETPGROUP> не установлен, то потомок наследует ID группы процесса родителя.

source: If I<attrp> is NULL, then the default behaviors described above for each flag apply.
ru: Если I<attrp> равно NULL, то выполняются действия по умолчанию, которые описаны выше по каждому флагу.
