Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: I</proc/sys/vm/drop_caches> (since Linux 2.6.16)
ru: I</proc/sys/vm/drop_caches> (начиная с Linux 2.6.16)

source: Writing to this file causes the kernel to drop clean caches, dentries, and inodes from memory, causing that memory to become free. This can be useful for memory management testing and performing reproducible filesystem benchmarks. Because writing to this file causes the benefits of caching to be lost, it can degrade overall system performance.
ru: Запись в этот файл заставляет ядро сбросить чистые кэши, dentries и индексные дескрипторы из памяти, тем самым освобождая её. Это может быть полезно для тестирования управления памятью и выполнения воспроизводимых тестов производительности файловой системы. Так как запись в этот файл вызывает потерю преимуществ кэширования, это может снизить производительность системы в целом.

source: To free pagecache, use:
ru: Для освобождения страничного кэша (pagecache) используйте:

source: To free dentries and inodes, use:
ru: Для освобождения dentries и индексных дескрипторов используйте:

source: To free pagecache, dentries and inodes, use:
ru: Для освобождения страничного кэша, dentries и индексных дескрипторов используйте:

source: Because writing to this file is a nondestructive operation and dirty objects are not freeable, the user should run B<sync>(1) first.
ru: Так как запись в этот файл — неразрушающая операция и изменившиеся (dirty) объекты не свободны, пользователь сначала должен запустить команду B<sync>(1).

source: I</proc/sys/vm/legacy_va_layout> (since Linux 2.6.9)
ru: I</proc/sys/vm/legacy_va_layout> (начиная с Linux 2.6.9)

source: If nonzero, this disables the new 32-bit memory-mapping layout; the kernel will use the legacy (2.4) layout for all processes.
ru: Если не равно нулю, то новая раскладка 32-битного отображения памяти выключается; ядро будет использовать старую (2.4) раскладку для всех процессов.

source: I</proc/sys/vm/memory_failure_early_kill> (since Linux 2.6.32)
ru: I</proc/sys/vm/memory_failure_early_kill> (начиная с Linux 2.6.32)

source: Control how to kill processes when an uncorrected memory error (typically a 2-bit error in a memory module) that cannot be handled by the kernel is detected in the background by hardware. In some cases (like the page still having a valid copy on disk), the kernel will handle the failure transparently without affecting any applications. But if there is no other up-to-date copy of the data, it will kill processes to prevent any data corruptions from propagating.
ru: Управляет, как завершать процессы, когда неисправленная ошибка памяти (обычно, 2-битная ошибка в модуле памяти), которая не может быть обработана ядром, обнаружена в фоновом режиме аппаратным обеспечением. В некоторых случаях (например, когда страница имеет правильную копию на диске), ядро может может прозрачно исправить ошибку без влияния на приложения. Но если актуальной копии данных нет, то ядро завершит процесс, чтобы остановить распространение повреждения данных.

source: The file has one of the following values:
ru: В файле содержатся следующие значения:

source: Kill all processes that have the corrupted-and-not-reloadable page mapped as soon as the corruption is detected. Note that this is not supported for a few types of pages, such as kernel internally allocated data or the swap cache, but works for the majority of user pages.
ru: При обнаружении завершать все процессы, у которых есть повреждённые и не восстановимые с диска страницы. Заметим, что это поддерживается не для всех типов страниц, например для внутренних данных ядра или кэша подкачки, но работает для большинства пользовательских страниц.

source: Unmap the corrupted page from all processes and kill a process only if it tries to access the page.
ru: Отключить отображение повреждённой страницы у всех процессов и завершать процессы, только если они пытаются к ней обратиться.

source: The kill is performed using a B<SIGBUS> signal with I<si_code> set to B<BUS_MCEERR_AO>. Processes can handle this if they want to; see B<sigaction>(2) for more details.
ru: Такое завершение выполняется с использованием сигнала B<SIGBUS> с установления значения I<si_code> равным B<BUS_MCEERR_AO>. Процессы могут обработать такую ситуацию, если захотят; подробней см. B<sigaction>(2).

source: This feature is active only on architectures/platforms with advanced machine check handling and depends on the hardware capabilities.
ru: Это свойство активно только на архитектурах/платформах с дополнительными проверки и зависит от возможностей аппаратного обеспечения.

source: Applications can override the I<memory_failure_early_kill> setting individually with the B<prctl>(2) B<PR_MCE_KILL> operation.
ru: Приложения могут изменить настройку I<memory_failure_early_kill> для себя с помощью операции B<PR_MCE_KILL> вызова B<prctl>(2).

source: Present only if the kernel was configured with B<CONFIG_MEMORY_FAILURE>.
ru: Доступен только, если ядро собрано с параметром B<CONFIG_MEMORY_FAILURE>.

source: I</proc/sys/vm/memory_failure_recovery> (since Linux 2.6.32)
ru: I</proc/sys/vm/memory_failure_recovery> (начиная с Linux 2.6.32)

source: Enable memory failure recovery (when supported by the platform)
ru: Включает восстановление отказов памяти (если поддерживается платформой)

source: Attempt recovery.
ru: Пытаться восстановить.

source: Always panic on a memory failure.
ru: При отказе памяти всегда доводить до паники.

source: I</proc/sys/vm/oom_dump_tasks> (since Linux 2.6.25)
ru: I</proc/sys/vm/oom_dump_tasks> (начиная с Linux 2.6.25)

source: Enables a system-wide task dump (excluding kernel threads) to be produced when the kernel performs an OOM-killing. The dump includes the following information for each task (thread, process): thread ID, real user ID, thread group ID (process ID), virtual memory size, resident set size, the CPU that the task is scheduled on, oom_adj score (see the description of I</proc/[pid]/oom_adj>), and command name. This is helpful to determine why the OOM-killer was invoked and to identify the rogue task that caused it.
ru: Включает системный дамп задач (исключая ядерные нити), который создаётся когда ядро выполняет OOM-killing. Дамп включает следующую информацию по каждой задаче (нити, процессу): ID нити, реальный ID пользователя, ID группы нитей (ID процесса), размер виртуальной памяти, размер резидентной настройки, процессор, на котором работала задача, счётчик oom_adj (описание смотрите в I</proc/[pid]/oom_adj>) и имя команды. Эти данные полезны для определения того, почему был вызван OOM-killer и нахождения экземпляра задачи, его вызвавшего.

source: If this contains the value zero, this information is suppressed. On very large systems with thousands of tasks, it may not be feasible to dump the memory state information for each one. Such systems should not be forced to incur a performance penalty in OOM situations when the information may not be desired.
ru: Если в файле содержится нулевое значение, то информация не выдаётся. На очень больших системах с тысячами задач дамп информации о состоянии памяти может быть неосуществим по каждой задаче. Системы не должны страдать от потери производительности из-за возникновения ситуаций с OOM, если такая информация ненужна.

source: If this is set to nonzero, this information is shown whenever the OOM-killer actually kills a memory-hogging task.
ru: Если задано ненулевое значение, то эта информация показывается в момент когда OOM-killer завершает захватившую память задачу.

source: The default value is 0.
ru: Значение по умолчанию равно 0.

source: I</proc/sys/vm/oom_kill_allocating_task> (since Linux 2.6.24)
ru: I</proc/sys/vm/oom_kill_allocating_task> (начиная с Linux 2.6.24)

source: This enables or disables killing the OOM-triggering task in out-of-memory situations.
ru: Включает или выключает задачу завершения при OOM (исчерпание свободной памяти).

source: If this is set to zero, the OOM-killer will scan through the entire tasklist and select a task based on heuristics to kill. This normally selects a rogue memory-hogging task that frees up a large amount of memory when killed.
ru: Если это значение равно нулю, то OOM-killer будет сканировать весь список задач и выбирать задачу для завершения на основе набора эвристических правил. Обычно выбирается задача, которая больше всех захватила памяти, что при её завершении позволит освободить огромное количество памяти.

source: If this is set to nonzero, the OOM-killer simply kills the task that triggered the out-of-memory condition. This avoids a possibly expensive tasklist scan.
ru: Если это значение не равно нулю, то OOM-killer просто завершит задачу, из-за которой возникла ситуация нехватки памяти. Это позволяет избежать затратной операции сканирования списка задач.

source: If I</proc/sys/vm/panic_on_oom> is nonzero, it takes precedence over whatever value is used in I</proc/sys/vm/oom_kill_allocating_task>.
ru: Если I</proc/sys/vm/panic_on_oom> не равно нулю, то оно имеет приоритет над значением из I</proc/sys/vm/oom_kill_allocating_task>.

source: I</proc/sys/vm/overcommit_kbytes> (since Linux 3.14)
ru: I</proc/sys/vm/overcommit_kbytes> (начиная с Linux 3.14)

source: This writable file provides an alternative to I</proc/sys/vm/overcommit_ratio> for controlling the I<CommitLimit> when I</proc/sys/vm/overcommit_memory> has the value 2. It allows the amount of memory overcommitting to be specified as an absolute value (in kB), rather than as a percentage, as is done with I<overcommit_ratio>. This allows for finer-grained control of I<CommitLimit> on systems with extremely large memory sizes.
ru: Данный, доступный на запись файл является альтернативой управлению I<CommitLimit> через I</proc/sys/vm/overcommit_ratio>, когда I</proc/sys/vm/overcommit_memory> содержит значение 2. Это позволяет задать количество перерасходуемой памяти (memory overcommitting) абсолютным значением (в КБ), а не в виде процента, как это делается через I<overcommit_ratio>. Это предоставляет более точный контроль I<CommitLimit> в системах с очень большим объёмом памяти.

source: Only one of I<overcommit_kbytes> or I<overcommit_ratio> can have an effect: if I<overcommit_kbytes> has a nonzero value, then it is used to calculate I<CommitLimit>, otherwise I<overcommit_ratio> is used. Writing a value to either of these files causes the value in the other file to be set to zero.
ru: Может задействовать либо I<overcommit_kbytes>, либо I<overcommit_ratio>: если значение I<overcommit_kbytes> не равно нулю, то оно используется для вычисления, в противном случае используется I<overcommit_ratio>. Запись значения в один из этих файлов приводит к обнулению значения в другом файле.

source: This file contains the kernel virtual memory accounting mode. Values are:
ru: Этот файл содержит значение режима учёта виртуальной памяти ядра. Значения:

source: 0: heuristic overcommit (this is the default)
ru: 0: эвристический перерасход (значение по умолчанию)

source: 1: always overcommit, never check
ru: 1: всегда разрешать перерасход, не проверять

source: 2: always check, never overcommit
ru: 2: всегда проверять, запретить перерасход

source: In mode 0, calls of B<mmap>(2) with B<MAP_NORESERVE> are not checked, and the default check is very weak, leading to the risk of getting a process "OOM-killed".
ru: В режиме 0 вызов B<mmap>(2) с B<MAP_NORESERVE> не проверяется, и проверка по умолчанию очень поверхностная, что может привести к завершению процесса с помощью OOM-killer.

source: In mode 1, the kernel pretends there is always enough memory, until memory actually runs out. One use case for this mode is scientific computing applications that employ large sparse arrays. In Linux kernel versions before 2.6.0, any nonzero value implies mode 1.
ru: В режиме 1, ядро притворяется, что памяти всегда достаточно, пока помять действительно не закончится. Одним из вариантов использования для этого режима являются приложения для научных вычислений, в которые используются большие разреженные массивы. В ядрах Linux до версии 2.6.0 любое ненулевое значение подразумевает режим 1.

source: In mode 2 (available since Linux 2.6), the total virtual address space that can be allocated (I<CommitLimit> in I</proc/meminfo>) is calculated as
ru: В режиме 2 (доступен начиная с Linux 2.6), общее виртуальное адресное пространство, которое можно выделить (I<CommitLimit> в I</proc/meminfo>) вычисляется по формуле

source: where:
ru: где:

source: I<total_RAM> is the total amount of RAM on the system;
ru: I<total_RAM> — общее количество физической памяти в системе;

source: I<total_huge_TLB> is the amount of memory set aside for huge pages;
ru: I<total_huge_TLB> — количество памяти без учёта огромных страниц;

source: I<overcommit_ratio> is the value in I</proc/sys/vm/overcommit_ratio>; and
ru: I<overcommit_ratio> — значение в I</proc/sys/vm/overcommit_ratio>; и

source: I<total_swap> is the amount of swap space.
ru: I<total_swap> — размер пространства подкачки.

source: For example, on a system with 16GB of physical RAM, 16GB of swap, no space dedicated to huge pages, and an I<overcommit_ratio> of 50, this formula yields a I<CommitLimit> of 24GB.
ru: Например, в системе с 16ГБ физической памяти, 16ГБ подкачки, без выделения огромных страниц и с I<overcommit_ratio> равным 50 по этой формуле значение I<CommitLimit> равно 24ГБ.

source: Since Linux 3.14, if the value in I</proc/sys/vm/overcommit_kbytes> is nonzero, then I<CommitLimit> is instead calculated as:
ru: Начиная с Linux 3.14, если значение в I</proc/sys/vm/overcommit_kbytes> не равно нулю, то I<CommitLimit> вычисляется так:

source: See also the description of I</proc/sys/vm/admin_reserve_kbytes> and I</proc/sys/vm/user_reserve_kbytes>.
ru: Также смотрите описание I</proc/sys/vm/admin_reserve_kbytes> и I</proc/sys/vm/user_reserve_kbytes>.

source: I</proc/sys/vm/overcommit_ratio> (since Linux 2.6.0)
ru: I</proc/sys/vm/overcommit_ratio> (начиная с Linux 2.6.0)

source: This writable file defines a percentage by which memory can be overcommitted. The default value in the file is 50. See the description of I</proc/sys/vm/overcommit_memory>.
ru: Доступный на запись файл содержит процент памяти, который может быть перерасходован (overcommitted). Значение по умолчанию равно 50. Смотрите описание I</proc/sys/vm/overcommit_memory>.

source: I</proc/sys/vm/panic_on_oom> (since Linux 2.6.18)
ru: I</proc/sys/vm/panic_on_oom> (начиная с Linux 2.6.18)

source: This enables or disables a kernel panic in an out-of-memory situation.
ru: Включает или отключает панику ядра при нехватке памяти.

source: If this file is set to the value 0, the kernel's OOM-killer will kill some rogue process. Usually, the OOM-killer is able to kill a rogue process and the system will survive.
ru: Если значение равно 0, то ядерный OOM-killer завершит какой-нибудь вышедший из подчинения процесс. Обычно, OOM-killer способен завершить такой процесс и система продолжит работу.

source: If this file is set to the value 1, then the kernel normally panics when out-of-memory happens. However, if a process limits allocations to certain nodes using memory policies (B<mbind>(2) B<MPOL_BIND>) or cpusets (B<cpuset>(7)) and those nodes reach memory exhaustion status, one process may be killed by the OOM-killer. No panic occurs in this case: because other nodes' memory may be free, this means the system as a whole may not have reached an out-of-memory situation yet.
ru: Если значение в файле равно 1, то ядро, обычно, переходит в состояние паники при нехватке памяти. Однако, если процесс ограничен в выделении определённых элементов (nodes) согласно политике памяти (B<mbind>(2) B<MPOL_BIND>) или процессора (B<cpuset>(7)) и предел таких элементов памяти был достигнут, то такой процесс может быть завершён OOM-killer. В этом случае состояние паники не возникнет, так как другие элементы памяти могут освободиться, что означает, что система в целом может не прийти к ситуации нехватки памяти.

source: If this file is set to the value 2, the kernel always panics when an out-of-memory condition occurs.
ru: Если значение в файле равно 2, то ядро всегда переходит в состояние паники, когда возникает нехватка памяти.

source: The default value is 0. 1 and 2 are for failover of clustering. Select either according to your policy of failover.
ru: Значение по умолчанию равно 0. Значение 1 и 2 используются для отказоустойчивости кластеров. Выберите любое согласно вашей политике отказоустойчивости.

source: The value in this file controls how aggressively the kernel will swap memory pages. Higher values increase aggressiveness, lower values decrease aggressiveness. The default value is 60.
ru: Значение в этом файле определяет, насколько активно ядро будет вытеснять страницы в пространство подкачки. Большие значения увеличивают активность, меньшие значения сокращают активность. По умолчанию значение равно 60.

source: I</proc/sys/vm/user_reserve_kbytes> (since Linux 3.10)
ru: I</proc/sys/vm/user_reserve_kbytes> (начиная с Linux 3.10)

source: Specifies an amount of memory (in KiB) to reserve for user processes, This is intended to prevent a user from starting a single memory hogging process, such that they cannot recover (kill the hog). The value in this file has an effect only when I</proc/sys/vm/overcommit_memory> is set to 2 ("overcommit never" mode). In this case, the system reserves an amount of memory that is the minimum of [3% of current process size, I<user_reserve_kbytes>].
ru: Задаёт количество памяти (в КиБ), которая резервируется под процессы пользователя. Предназначена для предотвращения запуска пользовательского процесса, который бы один съел всю память и это нельзя прекратить (завершить такой процесс). Это значение учитывается только, если значение в I</proc/sys/vm/overcommit_memory> равно 2 (режим «без перерасхода»). В этом случае система резервирует количество памяти, равное, минимум [3% от размера текущего процесса, I<user_reserve_kbytes>].

source: The default value in this file is the minimum of [3% of free pages, 128MiB] expressed as KiB.
ru: Значение по умолчанию равно минимум [3% свободных страниц, 128 МиБ], выражается в КиБ.

source: If the value in this file is set to zero, then a user will be allowed to allocate all free memory with a single process (minus the amount reserved by I</proc/sys/vm/admin_reserve_kbytes>). Any subsequent attempts to execute a command will result in "fork: Cannot allocate memory".
ru: Если значение в файле равно нулю, то пользователю разрешено выделять всю память под один процесс (за минусом резерва из I</proc/sys/vm/admin_reserve_kbytes>). Любая последующая попытка выполнить команду будет завершаться «fork: невозможно выделить память».

source: I</proc/sysrq-trigger> (since Linux 2.4.21)
ru: I</proc/sysrq-trigger> (начиная с Linux 2.4.21)

source: Writing a character to this file triggers the same SysRq function as typing ALT-SysRq-E<lt>characterE<gt> (see the description of I</proc/sys/kernel/sysrq>). This file is normally writable only by I<root>. For further details see the Linux kernel source file I<Documentation/admin-guide/sysrq.rst> (or I<Documentation/sysrq.txt> before Linux 4.10).
ru: Запись символа в этот файл приводит к вызову функции SysRq, как если бы была нажата E<lt>клавишаE<gt> ALT-SysRq (смотрите описание I</proc/sys/kernel/sysrq>). Обычно, этот файл доступен на запись только I<root>. Дополнительную информацию смотрите в исходном коде ядра Linux в файле I<Documentation/admin-guide/sysrq.rst> (или I<Documentation/sysrq.txt> до Linux 4.10).

source: Subdirectory containing the pseudo-files I<msg>, I<sem> and I<shm>. These files list the System V Interprocess Communication (IPC) objects (respectively: message queues, semaphores, and shared memory) that currently exist on the system, providing similar information to that available via B<ipcs>(1). These files have headers and are formatted (one IPC object per line) for easy understanding. B<sysvipc>(7) provides further background on the information shown by these files.
ru: Подкаталог содержит псевдо-файлы I<msg>, I<sem> и I<shm>.Эти файлы описывают объекты межпроцессного взаимодействия (System V Interprocess Communication (IPC)) (соответственно: очереди сообщений, семафоры и общую память), которые существуют в системе в настоящий момент. Похожая информация предоставляется через B<ipcs>(1). Эти файлы имеют заголовки и форматируются (по одному IPC объекту на строку) для более лёгкого понимания. В B<sysvipc>(7) представлена подробное описание информации в этих файлах.

source: I</proc/thread-self> (since Linux 3.17)
ru: I</proc/thread-self> (начиная с Linux 3.17)

source: This directory refers to the thread accessing the I</proc> filesystem, and is identical to the I</proc/self/task/[tid]> directory named by the process thread ID (I<[tid]>) of the same thread.
ru: Этот каталог ссылает на нить, обращающуюся к файловой системе I</proc>, и он идентичен каталогу I</proc/self/task/[tid]>, где в имени ID нити процесса (I<[tid]>) — эта же нить.

source: I</proc/timer_list> (since Linux 2.6.21)
ru: I</proc/timer_list> (начиная с Linux 2.6.21)

source: This read-only file exposes a list of all currently pending (high-resolution) timers, all clock-event sources, and their parameters in a human-readable form.
ru: Этот файл, доступный только для чтения, содержит список всех ожидающих в данный момент таймеров (высокой точности), всех источников событий часов и их параметры.

source: I</proc/timer_stats> (from Linux 2.6.21 until Linux 4.10)
ru: I</proc/timer_stats> (Linux 2.6.21 по Linux 4.10)

source: This is a debugging facility to make timer (ab)use in a Linux system visible to kernel and user-space developers. It can be used by kernel and user-space developers to verify that their code does not make undue use of timers. The goal is to avoid unnecessary wakeups, thereby optimizing power consumption.
ru: Это отладочное средство делает таймер, используемый в системе Linux, видимым разработчикам ядра и в пользовательском пространстве. Оно может использоваться для проверки отсутствия чрезмерной нагрузки на таймеры. Цель — для оптимизации потребления энергии избежать ненужных пробуждений.

source: If enabled in the kernel (B<CONFIG_TIMER_STATS>), but not used, it has almost zero run-time overhead and a relatively small data-structure overhead. Even if collection is enabled at run time, overhead is low: all the locking is per-CPU and lookup is hashed.
ru: Если включено в ядре (B<CONFIG_TIMER_STATS>) и не используется, то почти не задействует процессор и потребляет относительно малое количество памяти под структуры данных. Даже включённый в время выполнения сбор статистики не даёт высокой нагрузки: все блокировки относятся к ЦП, а поиск хэшируется.

source: The I</proc/timer_stats> file is used both to control sampling facility and to read out the sampled information.
ru: Файл I</proc/timer_stats> используется для управления функцией сборки и чтения полученных результатов.

source: The I<timer_stats> functionality is inactive on bootup. A sampling period can be started using the following command:
ru: Средство I<timer_stats> при запуске системы неактивно. Период тестирования может быть запущен командой:

source: The following command stops a sampling period:
ru: Следующая команда остановит период тестирования:

source: The statistics can be retrieved by:
ru: Статистику можно получить так:

source: While sampling is enabled, each readout from I</proc/timer_stats> will see newly updated statistics. Once sampling is disabled, the sampled information is kept until a new sample period is started. This allows multiple readouts.
ru: На время действия периода сбора каждым чтением I</proc/timer_stats> можно получить обновлённую статистику. После выключения сбора статистика останется доступной до следующего начала периода сбора. Это позволяет читать несколько раз.
