Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Only processes with the B<CAP_SYS_PTRACE> capability in the user namespace of the target process may perform B<PTRACE_MODE_ATTACH> operations or trace children that employ B<PTRACE_TRACEME>.
ru: Только процессы с мандатом B<CAP_SYS_PTRACE> в пользовательском пространстве имён процесса назначения могут выполнять операции B<PTRACE_MODE_ATTACH> или трассировать потомков, выполнивших B<PTRACE_TRACEME>.

source: 3 ("no attach")
ru: 3 («присоединение заблокировано»)

source: No process may perform B<PTRACE_MODE_ATTACH> operations or trace children that employ B<PTRACE_TRACEME>.
ru: Никакие процессы не могут выполнять операции B<PTRACE_MODE_ATTACH> или трассировать потомков, выполнивших B<PTRACE_TRACEME>.

source: Once this value has been written to the file, it cannot be changed.
ru: После записи такого значения в файл, его нельзя изменить.

source: With respect to values 1 and 2, note that creating a new user namespace effectively removes the protection offered by Yama. This is because a process in the parent user namespace whose effective UID matches the UID of the creator of a child namespace has all capabilities (including B<CAP_SYS_PTRACE>) when performing operations within the child user namespace (and further-removed descendants of that namespace). Consequently, when a process tries to use user namespaces to sandbox itself, it inadvertently weakens the protections offered by the Yama LSM.
ru: Относительно значений 1 и 2 заметим, что создание нового пользовательского пространства имён фактически удаляет защиту, предлагаемую Yama. Это происходит из-за того, что процесс в родительском пользовательском пространстве имён, у которого эффективный UID совпадает с UID создателя дочернего пространства имён, имеет все мандаты (включая B<CAP_SYS_PTRACE>) при выполнении им операций внутри дочернего пользовательского пространства имён (вплоть до удаления потомков этого пространства имён). В результате, когда процесс сам пытается использовать пользовательские пространства имён для песочницы, это непреднамеренно ослабляет защиту, предлагаемую Yama LSM.

source: At the system call level, the B<PTRACE_PEEKTEXT>, B<PTRACE_PEEKDATA>, and B<PTRACE_PEEKUSER> requests have a different API: they store the result at the address specified by the I<data> parameter, and the return value is the error flag. The glibc wrapper function provides the API given in DESCRIPTION above, with the result being returned via the function return value.
ru: На уровне системных вызовов запросы B<PTRACE_PEEKTEXT>, B<PTRACE_PEEKDATA> и B<PTRACE_PEEKUSER> имеют разный программный интерфейс: они сохраняют результат по адресу, указанному в параметре I<data>, а возвращаемое значение является индикатором ошибки. Обёрточная функция glibc предоставляет программный интерфейс, описанные ОПИСАНИЕ выше, а результат возвращается в виде возвращаемого значения функции.

source: On hosts with 2.6 kernel headers, B<PTRACE_SETOPTIONS> is declared with a different value than the one for 2.4. This leads to applications compiled with 2.6 kernel headers failing when run on 2.4 kernels. This can be worked around by redefining B<PTRACE_SETOPTIONS> to B<PTRACE_OLDSETOPTIONS>, if that is defined.
ru: На машинах с заголовочными файлами ядра 2.6 значение B<PTRACE_SETOPTIONS> отличается от использованного в версии 2.4. Это приводит к тому, что приложения, скомпилированные с такими заголовочными файлами, не работают при использовании ядер 2.4. Этого можно избежать сделав B<PTRACE_SETOPTIONS> равным B<PTRACE_OLDSETOPTIONS>, если данная константа определена.

source: Group-stop notifications are sent to the tracer, but not to real parent. Last confirmed on 2.6.38.6.
ru: Уведомления group-stop посылаются трассировщику, но не реальному родителю. Последнее подтверждение в версии 2.6.38.6.

source: If a thread group leader is traced and exits by calling B<_exit>(2), a B<PTRACE_EVENT_EXIT> stop will happen for it (if requested), but the subsequent B<WIFEXITED> notification will not be delivered until all other threads exit. As explained above, if one of other threads calls B<execve>(2), the death of the thread group leader will I<never> be reported. If the execed thread is not traced by this tracer, the tracer will never know that B<execve>(2) happened. One possible workaround is to B<PTRACE_DETACH> the thread group leader instead of restarting it in this case. Last confirmed on 2.6.38.6.
ru: Если трассируется лидер группы нитей и завершается с помощью вызова B<_exit>(2), то происходит его останов B<PTRACE_EVENT_EXIT> (если это запрашивалось), но последующее уведомление B<WIFEXITED> не будет доставлено пока все остальные нити не завершат работу. Как объяснялось выше, если одна из остальных нитей вызывает B<execve>(2), то о завершении лидера группы I<никогда> не будет сообщено. Если исполняемая нить не трассируется этим трассировщиком, то трассировщик никогда не узнает, что происходил B<execve>(2). Одним из обходных вариантов решения в этом случае является выполнение B<PTRACE_DETACH> для лидера группы вместо перезапуска. Последнее подтверждение в версии 2.6.38.6.

source: A B<SIGKILL> signal may still cause a B<PTRACE_EVENT_EXIT> stop before actual signal death. This may be changed in the future; B<SIGKILL> is meant to always immediately kill tasks even under ptrace. Last confirmed on Linux 3.13.
ru: Сигнал B<SIGKILL> всё ещё может вызвать остановку B<PTRACE_EVENT_EXIT> перед настоящем завершением процесса по сигналу. Это поведение может измениться в будущем; B<SIGKILL> всегда подразумевает немедленное завершение задач даже под ptrace. Последняя подтверждённая версия Linux — 3.13.

source: Some system calls return with B<EINTR> if a signal was sent to a tracee, but delivery was suppressed by the tracer. (This is very typical operation: it is usually done by debuggers on every attach, in order to not introduce a bogus B<SIGSTOP>). As of Linux 3.2.9, the following system calls are affected (this list is likely incomplete): B<epoll_wait>(2), and B<read>(2) from an B<inotify>(7) file descriptor. The usual symptom of this bug is that when you attach to a quiescent process with the command
ru: Некоторые системные вызовы возвращаются с B<EINTR>, если сигнал был послан трассируемой нити, но доставка была подавлена трассировщиком (это очень распространённая операция: она обычно выполняется отладчиками при каждом присоединении, чтобы не вызывать ненужный B<SIGSTOP>). Начиная с Linux 3.2.9, подвержены следующие системные вызовы (вероятно, это не полный список): B<epoll_wait>(2) и B<read>(2) из файлового дескриптора B<inotify>(7). Обычный симптом этой ошибки: когда вы присоединяетесь к неактивному процессу с помощью команды

source: then, instead of the usual and expected one-line output such as
ru: то вместо обычного и ожидаемого вывода одной строки

source: ('_' denotes the cursor position), you observe more than one line. For example:
ru: («_» означает позицию курсора), вы видите несколько строк. Пример:

source: What is not visible here is that the process was blocked in B<epoll_wait>(2) before B<strace>(1) has attached to it. Attaching caused B<epoll_wait>(2) to return to user space with the error B<EINTR>. In this particular case, the program reacted to B<EINTR> by checking the current time, and then executing B<epoll_wait>(2) again. (Programs which do not expect such "stray" B<EINTR> errors may behave in an unintended way upon an B<strace>(1) attach.)
ru: Здесь не видно, что процесс был заблокирован в B<epoll_wait>(2) до того, как B<strace>(1) присоединился к нему. Присоединение заставляет B<epoll_wait>(2) вернуться в пользовательское пространство с ошибкой B<EINTR>. В этом частном случае, программа отвечает на B<EINTR> проверкой текущего времени и затем вызывает B<epoll_wait>(2) снова (программы, которые не ожидают таких «побочных» ошибок B<EINTR>, при присоединении B<strace>(1) могут повести себя непредсказуемо).

source: Contrary to the normal rules, the glibc wrapper for B<ptrace>() can set I<errno> to zero.
ru: В отличие от обычных правил, обёрточная функция glibc для B<ptrace>() может присваивать I<errno> значение нуля.

source: protocols - protocols definition file
ru: protocols - файл определения протоколов

source: This file is a plain ASCII file, describing the various DARPA internet protocols that are available from the TCP/IP subsystem. It should be consulted instead of using the numbers in the ARPA include files, or, even worse, just guessing them. These numbers will occur in the protocol field of any IP header.
ru: Данный файл является простым файлом в кодировке ASCII и описывает различные протоколы DARPA internet, которые доступны через подсистему TCP/IP. Вместо того, чтобы использовать номера протоколов из заголовочных (include) файлов ARPA или, ещё хуже, строить догадки относительно номеров протоколов, нужно использовать данный файл. Номера протоколов присутствуют в поле протокола в любом IP-заголовке.

source: Keep this file untouched since changes would result in incorrect IP packages. Protocol numbers and names are specified by the IANA (Internet Assigned Numbers Authority).
ru: Не изменяйте этот файл, так как изменения могут привести к некорректному формированию IP-пакетов. Номера протоколов и их имена определяются Центром Сетевой Информации (DDN Network Information Center).

source: Each line is of the following format:
ru: Каждая строка файла имеет следующий формат:

source: I<protocol number aliases ...>
ru: I<протокол номер псевдоним ...>

source: where the fields are delimited by spaces or tabs. Empty lines are ignored. If a line contains a hash mark (#), the hash mark and the part of the line following it are ignored.
ru: Поля отделяются друг от друга пробелами или символами табуляции. Пустые строки игнорируются. Если строка содержит символ решётки (#), то он сам и часть строки, которая следует за этим символом, игнорируется.

source: The field descriptions are:
ru: Описание полей:

source: I<protocol>
ru: I<протокол>

source: the native name for the protocol. For example I<ip>, I<tcp>, or I<udp>.
ru: Имя протокола. Например, I<ip>, I<tcp> или I<udp>.

source: I<number>
ru: I<номер>

source: the official number for this protocol as it will appear within the IP header.
ru: Официальный номер этого протокола, который будет помещаться в IP-заголовок.

source: I<aliases>
ru: I<псевдонимы>

source: optional aliases for the protocol.
ru: Необязательные псевдонимы этого протокола.

source: This file might be distributed over a network using a network-wide naming service like Yellow Pages/NIS or BIND/Hesiod.
ru: Данный файл может распространяться по сети с помощью сетевых служб имён, таких как Yellow Pages/NIS или BIND/Hesiod.

source: The protocols definition file.
ru: Файл определения протоколов.

source: proc - process information pseudo-filesystem
ru: proc - псевдо-файловая система с информацией о процессах

source: The B<proc> filesystem is a pseudo-filesystem which provides an interface to kernel data structures. It is commonly mounted at I</proc>. Typically, it is mounted automatically by the system, but it can also be mounted manually using a command such as:
ru: Файловая система B<proc> — это псевдо-файловая система, которая предоставляет интерфейс к структурам данных ядра. Обычно, она монтируется в I</proc> и это выполняется системой автоматически, но также можно монтировать её вручную с помощью команды:

source: Most of the files in the B<proc> filesystem are read-only, but some files are writable, allowing kernel variables to be changed.
ru: Большинство файлов файловой системы B<proc> доступны только для чтения, но есть и доступные на запись, через которые можно изменять переменные ядра.

source: Mount options
ru: Параметры монтирования

source: The B<proc> filesystem supports the following mount options:
ru: Файловая система B<proc> поддерживает следующие параметры монтирования:

source: B<hidepid>=I<n> (since Linux 3.3)
ru: B<hidepid>=I<n> (начиная с Linux 3.3)

source: This option controls who can access the information in I</proc/[pid]> directories. The argument, I<n>, is one of the following values:
ru: Позволяет управлять доступом к информации в каталогах I</proc/[pid]>. В аргументе I<n> может указываться одно из следующих значений:

source: Everybody may access all I</proc/[pid]> directories. This is the traditional behavior, and the default if this mount option is not specified.
ru: Все имеют доступ ко всем каталогам I</proc/[pid]>. Обычное поведение, используется по умолчанию, если этот параметр не указан.

source: Users may not access files and subdirectories inside any I</proc/[pid]> directories but their own (the I</proc/[pid]> directories themselves remain visible). Sensitive files such as I</proc/[pid]/cmdline> and I</proc/[pid]/status> are now protected against other users. This makes it impossible to learn whether any user is running a specific program (so long as the program doesn't otherwise reveal itself by its behavior).
ru: Пользователи не имеют доступа к файлам и подкаталогам любого каталога I</proc/[pid]> кроме их собственных (сами каталоги I</proc/[pid]> остаются видимыми). Важные файлы I</proc/[pid]/cmdline> и I</proc/[pid]/status> теперь защищены от других пользователей. Это делает невозможным увидеть какие программы запустил пользователь (до тех пор, пока сама программа не раскрывает себя своим поведением).

source: As for mode 1, but in addition the I</proc/[pid]> directories belonging to other users become invisible. This means that I</proc/[pid]> entries can no longer be used to discover the PIDs on the system. This doesn't hide the fact that a process with a specific PID value exists (it can be learned by other means, for example, by "kill -0 $PID"), but it hides a process's UID and GID, which could otherwise be learned by employing B<stat>(2) on a I</proc/[pid]> directory. This greatly complicates an attacker's task of gathering information about running processes (e.g., discovering whether some daemon is running with elevated privileges, whether another user is running some sensitive program, whether other users are running any program at all, and so on).
ru: Как режим 1, но дополнительно и каталоги I</proc/[pid]>, принадлежащие другим пользователям, становятся невидимыми. Это означает, что элементы I</proc/[pid]> теперь нельзя использовать для получения PID в системе. Это не скрывает факт того, что процесса с определённым PID не существует (это можно определить по другому, например, командой «kill -0 $PID»), но это скрывает UID и GID процесса, которые можно было определять с помощью B<stat>(2) на каталог I</proc/[pid]>. Это сильно усложняет атакующему задачу по сбору информации о выполняющихся процессах (например, определение того, запущены ли некоторые службы с повышенными правами, запустил ли другой пользователь некоторую важную программу, выполняет ли вообще какую-либо программу другой пользователь и так далее).

source: B<gid>=I<gid> (since Linux 3.3)
ru: B<gid>=I<gid> (начиная с Linux 3.3)

source: Specifies the ID of a group whose members are authorized to learn process information otherwise prohibited by B<hidepid> (i.e., users in this group behave as though I</proc> was mounted with I<hidepid=0>). This group should be used instead of approaches such as putting nonroot users into the B<sudoers>(5) file.
ru: Задаёт ID группы, члены которой могут просматривать информацию о процессах в обход запрещению B<hidepid>, (т. е. пользователям в этой группе кажется, что I</proc> смонтирована с I<hidepid=0>). Эту группу нужно использовать вместо помещения непривилегированных пользователем в файл B<sudoers>(5) для тех же целей.

source: Overview
ru: Обзор

source: Underneath I</proc>, there are the following general groups of files and subdirectories:
ru: В каталоге I</proc> существуют следующие общие группы файлов и подкаталогов:

source: I</proc/[pid]> subdirectories
ru: Подкаталоги I</proc/[pid]>

source: Each one of these subdirectories contains files and subdirectories exposing information about the process with the corresponding process ID.
ru: Каждый из этих подкаталогов включает файлы и подкаталоги, которые содержат информацию о процессе с соответствующим ID процесса.

source: Underneath each of the I</proc/[pid]> directories, a I<task> subdirectory contains subdirectories of the form I<task/[tid]>, which contain corresponding information about each of the threads in the process, where I<tid> is the kernel thread ID of the thread.
ru: В каждом каталоге I</proc/[pid]> есть подкаталог I<task>, включающий подкаталоги вида I<task/[tid]>, которые содержат информацию о каждой нить процесса, где I<tid> — ID нити ядра.

source: The I</proc/[pid]> subdirectories are visible when iterating through I</proc> with B<getdents>(2) (and thus are visible when one uses B<ls>(1) to view the contents of I</proc>).
ru: Подкаталоги I</proc/[pid]> видимы при обходе I</proc> с помощью B<getdents>(2) (и поэтому они видимы программам подобным B<ls>(1), которые используются для просмотра содержимого I</proc>).

source: I</proc/[tid]> subdirectories
ru: Подкаталоги I</proc/[tid]>

source: Each one of these subdirectories contains files and subdirectories exposing information about the thread with the corresponding thread ID. The contents of these directories are the same as the corresponding I</proc/[pid]/task/[tid]> directories.
ru: В каждом из этих подкаталогов содержатся файлы и подкаталоги с информацией о нити с соответствующим ID нити. Содержимое этих каталогов такое же как у соответствующих каталогов I</proc/[pid]/task/[tid]>.

source: The I</proc/[tid]> subdirectories are I<not> visible when iterating through I</proc> with B<getdents>(2) (and thus are I<not> visible when one uses B<ls>(1) to view the contents of I</proc>).
ru: Подкаталоги I</proc/[tid]> I<не> видимы при обходе I</proc> с помощью B<getdents>(2) (и поэтому они I<не> видимы программам подобным B<ls>(1), которые используются для просмотра содержимого I</proc>).

source: When a process accesses this magic symbolic link, it resolves to the process's own I</proc/[pid]> directory.
ru: Когда процесс обращается по этой символьной ссылке, она указывает на каталог I</proc/[pid]> самого процесса.

source: When a thread accesses this magic symbolic link, it resolves to the process's own I</proc/self/task/[tid]> directory.
ru: Когда нить обращается по этой символьной ссылке, она указывает на каталог I</proc/self/task/[tid]> самого процесса.

source: Various other files and subdirectories under I</proc> expose system-wide information.
ru: Другие файлы и подкаталоги в I</proc> предоставляют информацию о системе.

source: All of the above are described in more detail below.
ru: Всё перечисленное выше далее будет описано подробней.

source: Files and directories
ru: Файлы и каталоги

source: The following list provides details of many of the files and directories under the I</proc> hierarchy.
ru: В следующем списке подробно описаны многие файлы и каталоги в иерархии I</proc>.

source: There is a numerical subdirectory for each running process; the subdirectory is named by the process ID. Each I</proc/[pid]> subdirectory contains the pseudo-files and directories described below.
ru: Эти числовые подкаталоги соответствуют работающим процессам; имя подкаталога соответствует идентификатору процесса. Каждый подкаталог I</proc/[pid]> содержит псевдо-файлы и каталоги, описываемые далее.

source: The files inside each I</proc/[pid]> directory are normally owned by the effective user and effective group ID of the process. However, as a security measure, the ownership is made I<root:root> if the process's "dumpable" attribute is set to a value other than 1.
ru: Файлы в каждом каталоге I</proc/[pid]>, обычно, принадлежат действующему идентификатору пользователя и группы процесса. Однако в целях безопасности, владельцем устанавливается I<root:root>, если у процесса атрибут «dumpable» установлен в значение, отличное от 1.

source: Before Linux 4.11, I<root:root> meant the "global" root user ID and group ID (i.e., UID 0 and GID 0 in the initial user namespace). Since Linux 4.11, if the process is in a noninitial user namespace that has a valid mapping for user (group) ID 0 inside the namespace, then the user (group) ownership of the files under I</proc/[pid]> is instead made the same as the root user (group) ID of the namespace. This means that inside a container, things work as expected for the container "root" user.
ru: До Linux 4.11, I<root:root> означал «глобальный» идентификатор суперпользователя и группы (т. е., UID 0 и GID 0 в первоначальном пользовательском пространстве имён). Начиная с Linux 4.11, если процесс находится не первоначальном пользовательском пространстве имён, имеющий корректное отображение идентификатор 0 пользователя (группы) внутри пространства имён, то владельцем (группой) файлов в I</proc/[pid]> вместо этого будет тот же идентификатор суперпользователя (группы) как у пространства имён. Это означает, что внутри контейнера для контейнерного «суперпользователя» всё будет работать как ожидается.

source: The process's "dumpable" attribute may change for the following reasons:
ru: Атрибут процесса «dumpable» может измениться по следующим причинам:

source: The attribute was explicitly set via the B<prctl>(2) B<PR_SET_DUMPABLE> operation.
ru: Атрибут был явно изменён с помощью операции B<PR_SET_DUMPABLE> вызова B<prctl>(2).

source: The attribute was reset to the value in the file I</proc/sys/fs/suid_dumpable> (described below), for the reasons described in B<prctl>(2).
ru: Атрибут был сброшен в значение из файла I</proc/sys/fs/suid_dumpable> (описан далее) по причинам, описанным в B<prctl>(2).

source: Resetting the "dumpable" attribute to 1 reverts the ownership of the I</proc/[pid]/*> files to the process's effective UID and GID.
ru: Сброс атрибута «dumpable» в 1 возвращает владение файлами I</proc/[pid]/*> действующим UID и GID процесса.

source: The files in this directory provide an API for security modules. The contents of this directory are files that can be read and written in order to set security-related attributes. This directory was added to support SELinux, but the intention was that the API be general enough to support other security modules. For the purpose of explanation, examples of how SELinux uses these files are provided below.
ru: Файлы в этом катале предоставляют программный интерфейс к модулям безопасности. Содержимое этого каталога представляет собой файлы для чтения и записи атрибутов безопасности. Этот каталог был добавлен для поддержки SELinux, но данный программный интерфейс может использоваться для поддержки других модулей безопасности. Как работать с этими файлами показано на примере с SELinux ниже.

source: This directory is present only if the kernel was configured with B<CONFIG_SECURITY>.
ru: Данный каталог доступен только, если ядро собрано с параметром B<CONFIG_SECURITY>.

source: I</proc/[pid]/attr/current> (since Linux 2.6.0)
ru: I</proc/[pid]/attr/current> (начиная с Linux 2.6.0)

source: The contents of this file represent the current security attributes of the process.
ru: В этом файле представлены текущие атрибуты безопасности процесса.
