Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Both of these are so-called 1:1 implementations, meaning that each thread maps to a kernel scheduling entity. Both threading implementations employ the Linux B<clone>(2) system call. In NPTL, thread synchronization primitives (mutexes, thread joining, and so on) are implemented using the Linux B<futex>(2) system call.
ru: Обе реализации являются, так называемыми реализациями 1:1, то есть каждая нить отображается в планируемый элемента ядра. Обе реализации используют системный вызов Linux B<clone>(2). В NPTL примитивы синхронизации нитей (мьютексы, объединение нитей и т .п.) реализованы с помощью системного вызова Linux B<futex>(2).

source: The notable features of this implementation are the following:
ru: Отличительные свойства данной реализации:

source: In addition to the main (initial) thread, and the threads that the program creates using B<pthread_create>(3), the implementation creates a "manager" thread. This thread handles thread creation and termination. (Problems can result if this thread is inadvertently killed.)
ru: В дополнении к главной (начальной) нити, нити программы создаются с помощью B<pthread_create>(3), реализация создаёт «управляющую» нить. Эта нить выполняет создание и завершение нитей (что приводит к проблемам, если эта нить случайно завершится).

source: Signals are used internally by the implementation. On Linux 2.2 and later, the first three real-time signals are used (see also B<signal>(7)). On older Linux kernels, B<SIGUSR1> and B<SIGUSR2> are used. Applications must avoid the use of whichever set of signals is employed by the implementation.
ru: Внутри реализации используются сигналы. В Linux 2.2 и новее используются первые три сигнала реального времени (смотрите также B<signal>(7)). В старых ядрах Linux используются сигналы B<SIGUSR1> и B<SIGUSR2>. В приложениях нельзя использовать набор сигналов, задействованный в реализации.

source: Threads do not share process IDs. (In effect, LinuxThreads threads are implemented as processes which share more information than usual, but which do not share a common process ID.) LinuxThreads threads (including the manager thread) are visible as separate processes using B<ps>(1).
ru: У нитей разные ID процесса (фактически, нити LinuxThreads реализованы как процессы, у которых больше общей информации чем обычно, но которые имеют разный идентификаторы процесса). Нити LinuxThreads (включая управляющую нить) в B<ps>(1) видимы как отдельные процессы.

source: The LinuxThreads implementation deviates from the POSIX.1 specification in a number of ways, including the following:
ru: Реализация LinuxThreads отклоняется от спецификации POSIX.1 в нескольких местах, а именно:

source: Calls to B<getpid>(2) return a different value in each thread.
ru: Вызов B<getpid>(2) возвращает разные значения для каждой нити.

source: Calls to B<getppid>(2) in threads other than the main thread return the process ID of the manager thread; instead B<getppid>(2) in these threads should return the same value as B<getppid>(2) in the main thread.
ru: Вызов B<getppid>(2) в нитях, кроме главной, возвращает идентификатор процесса управляющей нити; вместо B<getppid>(2) в этих нитях будет возвращаться тоже значение, что и из B<getppid>(2) в главной нити.

source: When one thread creates a new child process using B<fork>(2), any thread should be able to B<wait>(2) on the child. However, the implementation allows only the thread that created the child to B<wait>(2) on it.
ru: Когда нить создаёт новый процесс-потомок с помощью B<fork>(2), все нити должны ожидать потомка в B<wait>(2). Однако реализация позволяет вызвать B<wait>(2) только в нити, которая создала потомка.

source: When a thread calls B<execve>(2), all other threads are terminated (as required by POSIX.1). However, the resulting process has the same PID as the thread that called B<execve>(2): it should have the same PID as the main thread.
ru: Когда нить вызывает B<execve>(2), остальные нити завершают работу (требование POSIX.1). Однако, получаемый процесс имеет тот же PID, что и нить, которая вызвала B<execve>(2): это должен быть тот же PID, что и у главной нити.

source: Threads do not share user and group IDs. This can cause complications with set-user-ID programs and can cause failures in Pthreads functions if an application changes its credentials using B<seteuid>(2) or similar.
ru: У нитей разные ID пользователя и группы. Это может вызвать сложности в программах с set-user-ID и может привести к ошибкам функций pthreads, если приложение изменяет свои учётные данные с помощью B<seteuid>(2) и подобных вызовов.

source: Threads do not share a common session ID and process group ID.
ru: У нитей разные ID сеанса и группы процессов.

source: Threads do not share record locks created using B<fcntl>(2).
ru: У нитей разные записи о блокировках, созданных B<fcntl>(2).

source: The information returned by B<times>(2) and B<getrusage>(2) is per-thread rather than process-wide.
ru: Информация, возвращаемая B<times>(2) и B<getrusage>(2), относится только к нити, а не к процессу в целом.

source: Threads do not share semaphore undo values (see B<semop>(2)).
ru: У нитей разные значения отмен семафоров (смотрите B<semop>(2)).

source: Threads do not share interval timers.
ru: У нитей разные интервалы таймеров.

source: Threads do not share a common nice value.
ru: У нитей разные значения уступчивости.

source: POSIX.1 distinguishes the notions of signals that are directed to the process as a whole and signals that are directed to individual threads. According to POSIX.1, a process-directed signal (sent using B<kill>(2), for example) should be handled by a single, arbitrarily selected thread within the process. LinuxThreads does not support the notion of process-directed signals: signals may be sent only to specific threads.
ru: В POSIX.1 различаются сигналы, адресованные процессу в целом и отдельным нитям. Согласно POSIX.1, сигналы, направленные процессу (посланные, например, с помощью B<kill>(2)), должны обрабатываться одной произвольно выбранной нитью внутри процесса. LinuxThreads не поддерживает сигналы, направленные процессу: сигналы могут посылаться только определённым нитям.

source: Threads have distinct alternate signal stack settings. However, a new thread's alternate signal stack settings are copied from the thread that created it, so that the threads initially share an alternate signal stack. (A new thread should start with no alternate signal stack defined. If two threads handle signals on their shared alternate signal stack at the same time, unpredictable program failures are likely to occur.)
ru: Нити имеют разные настройки альтернативного стека сигналов. Однако, новые настройки альтернативного стека сигналов копируются из нити, которая его создаёт, так что изначально нити имеют единый альтернативный стек сигналов (новая нить должна запускаться без альтернативного стека сигналов. Если две нити обрабатывают сигналы в едином альтернативном стеке сигналов одновременно, то в программе возникнет непредсказуемая ошибка).

source: With NPTL, all of the threads in a process are placed in the same thread group; all members of a thread group share the same PID. NPTL does not employ a manager thread.
ru: В NPTL все нити процесса помещаются в одну группу нитей; все члены группы нитей имеют один PID. В NPTL нет управляющей нити.

source: NPTL makes internal use of the first two real-time signals; these signals cannot be used in applications. See B<nptl>(7) for further details.
ru: Внутри NPTL используются первые два сигнала реального времени; эти сигналы нельзя использовать в приложениях. Подробности смотрите в B<nptl>(7).

source: NPTL still has at least one nonconformance with POSIX.1:
ru: NPTL тоже не соответствует POSIX.1, как минимум, в одном:

source: Some NPTL nonconformances occur only with older kernels:
ru: Несколько несоответствий NPTL проявляется только при работе со старыми ядрами:

source: The information returned by B<times>(2) and B<getrusage>(2) is per-thread rather than process-wide (fixed in kernel 2.6.9).
ru: Информация, возвращаемая B<times>(2) и B<getrusage>(2), относится только к нити, а не к процессу в целом (исправлено в ядре 2.6.9).

source: Threads do not share resource limits (fixed in kernel 2.6.10).
ru: У нитей разные ограничения по ресурсам (исправлено в ядре 2.6.10).

source: Threads do not share interval timers (fixed in kernel 2.6.12).
ru: У нитей разные интервалы таймеров (исправлено в ядре 2.6.12).

source: Only the main thread is permitted to start a new session using B<setsid>(2) (fixed in kernel 2.6.16).
ru: Только из главной нити разрешено запускать новый сеанс с помощью B<setsid>(2) (исправлено в версии 2.6.16).

source: Only the main thread is permitted to make the process into a process group leader using B<setpgid>(2) (fixed in kernel 2.6.16).
ru: Только из главной нити разрешено делать процесс лидером группы процессов с помощью B<setpgid>(2) (исправлено в версии 2.6.16).

source: Threads have distinct alternate signal stack settings. However, a new thread's alternate signal stack settings are copied from the thread that created it, so that the threads initially share an alternate signal stack (fixed in kernel 2.6.16).
ru: Нити имеют разные настройки альтернативного стека сигналов Однако, новые настройки альтернативного стека сигналов копируются из нити, которая его создаёт, так что изначально нити имеют единый альтернативный стек сигналов (исправлено в ядре 2.6.16).

source: Note the following further points about the NPTL implementation:
ru: Также стоит учитывать следующее о реализации NPTL:

source: If the stack size soft resource limit (see the description of B<RLIMIT_STACK> in B<setrlimit>(2)) is set to a value other than I<unlimited>, then this value defines the default stack size for new threads. To be effective, this limit must be set before the program is executed, perhaps using the I<ulimit -s> shell built-in command (I<limit stacksize> in the C shell).
ru: Если мягкое ограничение ресурса на размер стека (смотрите описание B<RLIMIT_STACK> в B<setrlimit>(2)) устанавливается в значение, отличное от I<unlimited>, то это значение определяет размер стека по умолчанию для новых нитей. В целях эффективности, это ограничение должно быть установлено но выполнения программы, возможно с помощью встроенной команды оболочки I<ulimit -s> (I<limit stacksize> в оболочке C).

source: Determining the threading implementation
ru: Определение реализации нитей

source: Since glibc 2.3.2, the B<getconf>(1) command can be used to determine the system's threading implementation, for example:
ru: Начиная с glibc 2.3.2, для определение реализации нитей в системе можно использовать команду B<getconf>(1), например:

source: With older glibc versions, a command such as the following should be sufficient to determine the default threading implementation:
ru: При наличии старых версий glibc можно использовать команду:

source: Selecting the threading implementation: LD_ASSUME_KERNEL
ru: Выбор реализации нитей: LD_ASSUME_KERNEL

source: On systems with a glibc that supports both LinuxThreads and NPTL (i.e., glibc 2.3.I<x>), the B<LD_ASSUME_KERNEL> environment variable can be used to override the dynamic linker's default choice of threading implementation. This variable tells the dynamic linker to assume that it is running on top of a particular kernel version. By specifying a kernel version that does not provide the support required by NPTL, we can force the use of LinuxThreads. (The most likely reason for doing this is to run a (broken) application that depends on some nonconformant behavior in LinuxThreads.) For example:
ru: В системах с glibc, которая поддерживает и LinuxThreads и NPTL (например, glibc 2.3.I<x>), можно воспользоваться переменной окружения B<LD_ASSUME_KERNEL> для замены выбранной динамическим компоновщиков реализации нитей по умолчанию. Эта переменная указывает динамическому компоновщику считать, что он запускается с определённой версией ядра в системе. Указав версию ядра, в которой не поддержки, требуемой NPTL, его можно заставить использовать LinuxThreads (наиболее вероятной причиной для этого будет необходимость запуска (сломанного) приложения, которое зависит от некоторого не совместимого поведения LinuxThreads). Пример:

source: Various Pthreads manual pages, for example: B<pthread_atfork>(3), B<pthread_attr_init>(3), B<pthread_cancel>(3), B<pthread_cleanup_push>(3), B<pthread_cond_signal>(3), B<pthread_cond_wait>(3), B<pthread_create>(3), B<pthread_detach>(3), B<pthread_equal>(3), B<pthread_exit>(3), B<pthread_key_create>(3), B<pthread_kill>(3), B<pthread_mutex_lock>(3), B<pthread_mutex_unlock>(3), B<pthread_mutexattr_destroy>(3), B<pthread_mutexattr_init>(3), B<pthread_once>(3), B<pthread_spin_init>(3), B<pthread_spin_lock>(3), B<pthread_rwlockattr_setkind_np>(3), B<pthread_setcancelstate>(3), B<pthread_setcanceltype>(3), B<pthread_setspecific>(3), B<pthread_sigmask>(3), B<pthread_sigqueue>(3), and B<pthread_testcancel>(3)
ru: Различные справочные страницы pthreads, например: B<pthread_atfork>(3), B<pthread_attr_init>(3), B<pthread_cancel>(3), B<pthread_cleanup_push>(3), B<pthread_cond_signal>(3), B<pthread_cond_wait>(3), B<pthread_create>(3), B<pthread_detach>(3), B<pthread_equal>(3), B<pthread_exit>(3), B<pthread_key_create>(3), B<pthread_kill>(3), B<pthread_mutex_lock>(3), B<pthread_mutex_unlock>(3), B<pthread_mutexattr_destroy>(3), B<pthread_mutexattr_init>(3), B<pthread_once>(3), B<pthread_spin_init>(3), B<pthread_spin_lock>(3), B<pthread_rwlockattr_setkind_np>(3), B<pthread_setcancelstate>(3), B<pthread_setcanceltype>(3), B<pthread_setspecific>(3), B<pthread_sigmask>(3), B<pthread_sigqueue>(3) и B<pthread_testcancel>(3)

source: process-keyring - per-process shared keyring
ru: process-keyring - общая связка ключей для процесса

source: The process keyring is a keyring used to anchor keys on behalf of a process. It is created only when a process requests it. The process keyring has the name (description) I<_pid>.
ru: Связка ключей процесса — это связка ключей, используемая для привязки ключей процесса. Она создаётся только по запросу процесса. Связка ключей процесса имеет имя (описание) I<_pid>.

source: A special serial number value, B<KEY_SPEC_PROCESS_KEYRING>, is defined that can be used in lieu of the actual serial number of the calling process's process keyring.
ru: Существует специальное значение, B<KEY_SPEC_PROCESS_KEYRING>, которое можно использовать вместо настоящего серийного номера связки ключей процесса вызывающего процесса.

source: From the B<keyctl>(1) utility, 'B<@p>' can be used instead of a numeric key ID in much the same way, but since B<keyctl>(1) is a program run after forking, this is of no utility.
ru: В утилите B<keyctl>(1) подобным образом можно использовать «B<@p>» вместо числового ID ключа, но так как B<keyctl>(1) выполняется после разветвления, это не используется.

source: A thread created using the B<clone>(2) B<CLONE_THREAD> flag has the same process keyring as the caller of B<clone>(2). When a new process is created using B<fork>() it initially has no process keyring. A process's process keyring is cleared on B<execve>(2). The process keyring is destroyed when the last thread that refers to it terminates.
ru: Нить, создаваемая B<clone>(2) с флагом B<CLONE_THREAD>, имеет ту же связку ключей процесса, что и вызвавший B<clone>(2). Если новый процесс создаётся с помощью B<fork>(), то изначально он не имеет связки ключей процесса. Связка ключей процесса очищается при B<execve>(2). Связка ключей процесса уничтожается когда завершается последняя нить, которая на неё ссылалась.

source: If a process doesn't have a process keyring when it is accessed, then the process keyring will be created if the keyring is to be modified; otherwise, the error B<ENOKEY> results.
ru: Если процесс не имеет связки ключей процесса, когда к ней обращается, то она будет создана, если запрашивается изменение связки ключей; в противном случае возвращается ошибка B<ENOKEY>.

source: process_vm_readv, process_vm_writev - transfer data between process address spaces
ru: process_vm_readv, process_vm_writev - производит обмен данными между адресными пространствами процессов

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: These system calls transfer data between the address space of the calling process ("the local process") and the process identified by I<pid> ("the remote process"). The data moves directly between the address spaces of the two processes, without passing through kernel space.
ru: Данные системные вызовы перемещают данные между адресным пространством вызывающего процесса («локального процесса») и процесса с указанным I<pid> («удалённый процесс»). Данные перемещаются прямо между адресными пространствами двух процессов, без копирования через пространство ядра.

source: The B<process_vm_readv>() system call transfers data from the remote process to the local process. The data to be transferred is identified by I<remote_iov> and I<riovcnt>: I<remote_iov> is a pointer to an array describing address ranges in the process I<pid>, and I<riovcnt> specifies the number of elements in I<remote_iov>. The data is transferred to the locations specified by I<local_iov> and I<liovcnt>: I<local_iov> is a pointer to an array describing address ranges in the calling process, and I<liovcnt> specifies the number of elements in I<local_iov>.
ru: Системный вызов B<process_vm_readv>() перемещает данные из удалённого процесса в локальный. Перемещаемые данные задаются I<remote_iov> и I<riovcnt>: I<remote_iov> — указатель на массив, описывающий адресные пространства в процессе I<pid>, и в I<riovcnt> указывается количество элементов в I<remote_iov>. Данные перемещаются в расположения, задаваемые I<local_iov> и I<liovcnt>: I<local_iov> — указатель на массив, описывающий адресные пространства в вызывающем процессе, а в I<liovcnt> задаётся количество элементов в I<local_iov>.

source: The B<process_vm_writev>() system call is the converse of B<process_vm_readv>()\(emit transfers data from the local process to the remote process. Other than the direction of the transfer, the arguments I<liovcnt>, I<local_iov>, I<riovcnt>, and I<remote_iov> have the same meaning as for B<process_vm_readv>().
ru: Системный вызов B<process_vm_writev>() выполняет операцию, обратную B<process_vm_readv>() — перемещает данные из локального процесса в удалённый. Кроме направления передачи, аргументы I<liovcnt>, I<local_iov>, I<riovcnt> и I<remote_iov> имеют то назначение что и для B<process_vm_readv>().

source: The I<local_iov> and I<remote_iov> arguments point to an array of I<iovec> structures, defined in I<E<lt>sys/uio.hE<gt>> as:
ru: Аргументы I<local_iov> и I<remote_iov> указывают на массив структур I<iovec>, определённых в I<E<lt>sys/uio.hE<gt>>:

source: struct iovec { void *iov_base; /* Starting address */ size_t iov_len; /* Number of bytes to transfer */ };
ru: struct iovec { void *iov_base; /* начальный адрес */ size_t iov_len; /* количество перемещаемых байт */ };

source: Buffers are processed in array order. This means that B<process_vm_readv>() completely fills I<local_iov[0]> before proceeding to I<local_iov[1]>, and so on. Likewise, I<remote_iov[0]> is completely read before proceeding to I<remote_iov[1]>, and so on.
ru: Буферы обрабатываются в порядке, в каком они указаны в массиве. Это означает, что B<process_vm_readv>() сначала полностью заполнит I<local_iov[0]> и только потом перейдёт к I<local_iov[1]> и так далее. Подобным образом I<remote_iov[0]> сначала полностью читается перед переходом к I<remote_iov[1]> и так далее.

source: Similarly, B<process_vm_writev>() writes out the entire contents of I<local_iov[0]> before proceeding to I<local_iov[1]>, and it completely fills I<remote_iov[0]> before proceeding to I<remote_iov[1]>.
ru: Подобным образом B<process_vm_writev>() записывает всё содержимое I<local_iov[0]> перед тем, как перейти к I<local_iov[1]>, и это полностью заполняет I<remote_iov[0]> перед тем как перейти к I<remote_iov[1]>.

source: The lengths of I<remote_iov[i].iov_len> and I<local_iov[i].iov_len> do not have to be the same. Thus, it is possible to split a single local buffer into multiple remote buffers, or vice versa.
ru: Длины I<remote_iov[i].iov_len> и I<local_iov[i].iov_len> могут быть не одинаковы. То есть, возможно разделить одни локальный буфер на несколько удалённых буферов и наоборот.

source: The I<flags> argument is currently unused and must be set to 0.
ru: В настоящее время аргумент I<flags> не используется и должен равняться 0.

source: The values specified in the I<liovcnt> and I<riovcnt> arguments must be less than or equal to B<IOV_MAX> (defined in I<E<lt>limits.hE<gt>> or accessible via the call I<sysconf(_SC_IOV_MAX)>).
ru: Значения, указанные в аргументах I<liovcnt> и I<riovcnt>, должны быть меньше или равны B<IOV_MAX> (определено в I<E<lt>limits.hE<gt>> или доступно через вызов I<sysconf(_SC_IOV_MAX)>).

source: The count arguments and I<local_iov> are checked before doing any transfers. If the counts are too big, or I<local_iov> is invalid, or the addresses refer to regions that are inaccessible to the local process, none of the vectors will be processed and an error will be returned immediately.
ru: Количество аргументов и I<local_iov> проверяется перед началом передачи. Если количество слишком велико или I<local_iov> содержит некорректное значение, или адреса областей недоступны локальному процессу, то ни один из векторов не будет обработан и сразу возвращается ошибка.

source: Note, however, that these system calls do not check the memory regions in the remote process until just before doing the read/write. Consequently, a partial read/write (see RETURN VALUE) may result if one of the I<remote_iov> elements points to an invalid memory region in the remote process. No further reads/writes will be attempted beyond that point. Keep this in mind when attempting to read data of unknown length (such as C strings that are null-terminated) from a remote process, by avoiding spanning memory pages (typically 4\ KiB) in a single remote I<iovec> element. (Instead, split the remote read into two I<remote_iov> elements and have them merge back into a single write I<local_iov> entry. The first read entry goes up to the page boundary, while the second starts on the next page boundary.)
ru: Однако заметим, что эти системные вызовы не проверяют области памяти в удалённом процессе до начала выполнения чтения/записи. Следовательно может выполниться частичное чтение/запись (смотрите ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ), если один из элементов I<remote_iov> указывает на некорректную область памяти в удалённом процессе. После нахождения такого элемента дальнейшее чтение/запись не производится. Помните об этом, когда читаете данные неизвестной длины (например, строки C, завершающиеся null) из удалённого процесса, избегайте объединения страниц памяти (обычно, 4\ КиБ) одного удалённого элемента I<iovec> (вместо этого разделите чтение удалённого элемента на два элемента I<remote_iov> и объедините их обратно в одну запись I<local_iov> entry. Первый читаемый элемент дойдёт до границы страницы, а второй начнётся на следующей границе страницы).

source: Permission to read from or write to another process is governed by a ptrace access mode B<PTRACE_MODE_ATTACH_REALCREDS> check; see B<ptrace>(2).
ru: Право читать или писать в другой процесс определяется проверкой режима доступа ptrace B<PTRACE_MODE_ATTACH_REALCREDS>; смотрите B<ptrace>(2).

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
