Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: A new thread inherits a copy of its creator's signal mask.
ru: Новая нить наследует копию маски сигналов своего создателя.

source: The glibc B<pthread_sigmask>() function silently ignores attempts to block the two real-time signals that are used internally by the NPTL threading implementation. See B<nptl>(7) for details.
ru: Функция glibc B<pthread_sigmask>() просто игнорирует попытки блокирования двух сигналов реального времени, которые используются внутри реализации NPTL. Подробности смотрите в B<nptl>(7).

source: The program below blocks some signals in the main thread, and then creates a dedicated thread to fetch those signals via B<sigwait>(3). The following shell session demonstrates its use:
ru: Показанная далее программа блокирует некоторые сигналы в главной нити, а затем создаёт отдельную нить для получения этих сигналов с помощью B<sigwait>(3). Пример работы программы:

source: $B< ./a.out &> [1] 5423 $B< kill -QUIT %1> Signal handling thread got signal 3 $B< kill -USR1 %1> Signal handling thread got signal 10 $B< kill -TERM %1> [1]+ Terminated ./a.out
ru: $B< ./a.out &> [1] 5423 $B< kill -QUIT %1> Нить обработки сигналов получила сигнал 3 $B< kill -USR1 %1> Нить обработки сигналов получила сигнал 10 $B< kill -TERM %1> [1]+ Terminated ./a.out

source: /* Simple error handling functions */
ru: /* Простая функция обработки сигналов */

source: for (;;) { s = sigwait(set, &sig); if (s != 0) handle_error_en(s, "sigwait"); printf("Signal handling thread got signal %d\en", sig); } }
ru: for (;;) { s = sigwait(set, &sig); if (s != 0) handle_error_en(s, "sigwait"); printf("Нить обработки сигналов получила сигнал %d\en", sig); } }

source: /* Block SIGQUIT and SIGUSR1; other threads created by main() will inherit a copy of the signal mask. */
ru: /* Блокируем SIGQUIT и SIGUSR1; нити, созданные main(), унаследуют копию маски сигналов. */

source: /* Main thread carries on to create other threads and/or do other work */
ru: /* Главная нить служит для создания других нитей и/или выполняет другую работу */

source: pause(); /* Dummy pause so we can test program */ }
ru: pause(); /* Просто пауза, чтобы мы могли протестировать программу */ }

source: posix_memalign, aligned_alloc, memalign, valloc, pvalloc - allocate aligned memory
ru: posix_memalign, aligned_alloc, memalign, valloc, pvalloc - выделяет выровненную область памяти

source: Since glibc 2.12:
ru: Начиная с glibc 2.12:

source: (_XOPEN_SOURCE\ E<gt>=\ 500) && !(_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: (_XOPEN_SOURCE\ E<gt>=\ 500) && !(_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версии glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: Before glibc 2.12:
ru: До glibc 2.12:

source: (The (nonstandard) header file I<E<lt>malloc.hE<gt>> also exposes the declaration of B<valloc>(); no feature test macros are required.)
ru: (Заголовочный файл I<E<lt>malloc.hE<gt>> (нестандартный) также содержит объявление B<valloc>(); макросов тестирования свойств не требуется)

source: The function B<posix_memalign>() allocates I<size> bytes and places the address of the allocated memory in I<*memptr>. The address of the allocated memory will be a multiple of I<alignment>, which must be a power of two and a multiple of I<sizeof(void\ *)>. If I<size> is 0, then the value placed in I<*memptr> is either NULL, or a unique pointer value that can later be successfully passed to B<free>(3).
ru: Функция B<posix_memalign>() выделяет I<size> байт и помещает адрес выделенной памяти в I<*memptr>. Этот адрес будет кратен значению I<alignment>, которое должно быть степенью двойки и кратно I<sizeof(void\ *)>. Если I<size> равно 0, то значение, помещаемое в I<*memptr>, равно NULL, или является уникальным значением указателя, который позднее можно передавать в B<free>(3).

source: The obsolete function B<memalign>() allocates I<size> bytes and returns a pointer to the allocated memory. The memory address will be a multiple of I<alignment>, which must be a power of two.
ru: Устаревшая функция B<memalign>() выделяет I<size> байт и возвращает указатель на выделенную память. Адрес памяти будет кратен значению I<alignment>, которое должны быть степенью двойки.

source: The function B<aligned_alloc>() is the same as B<memalign>(), except for the added restriction that I<size> should be a multiple of I<alignment>.
ru: Функция B<aligned_alloc>() подобна B<memalign>(), но добавляет ограничение для значения I<size>, которое должно быть кратно I<alignment>.

source: The obsolete function B<valloc>() allocates I<size> bytes and returns a pointer to the allocated memory. The memory address will be a multiple of the page size. It is equivalent to I<memalign(sysconf(_SC_PAGESIZE),size)>.
ru: Устаревшая функция B<valloc>() выделяет I<size> байт и возвращает указатель на выделенную память. Адрес памяти будет кратен размеру страницы. Она эквивалентна вызову I<memalign(sysconf(_SC_PAGESIZE),size)>.

source: The obsolete function B<pvalloc>() is similar to B<valloc>(), but rounds the size of the allocation up to the next multiple of the system page size.
ru: Устаревшая функция B<pvalloc>() подобна B<valloc>(), но округляет выделяемый размер до следующего кратного значения системной страницы.

source: For all of these functions, the memory is not zeroed.
ru: Эти функции не обнуляют выделяемую память.

source: B<aligned_alloc>(), B<memalign>(), B<valloc>(), and B<pvalloc>() return a pointer to the allocated memory on success. On error, NULL is returned, and I<errno> is set to indicate the cause of the error.
ru: Функции B<aligned_alloc>(), B<memalign>(), B<valloc>() и B<pvalloc>() при успешном выполнении возвращают указатель на выделенную память. При ошибке возвращается NULL, а I<errno> присваивается номер ошибки.

source: B<posix_memalign>() returns zero on success, or one of the error values listed in the next section on failure. The value of I<errno> is not set. On Linux (and other systems), B<posix_memalign>() does not modify I<memptr> on failure. A requirement standardizing this behavior was added in POSIX.1-2016.
ru: При успешном выполнении функция B<posix_memalign>() возвращает ноль и одно из значений, перечисленных в далее, при ошибке. Значение I<errno> не изменяется. В Linux (и других системах) B<posix_memalign>() при ошибке не изменяет I<memptr>. Требование стандартизации такого поведения было добавлено в POSIX.1-2016.

source: The I<alignment> argument was not a power of two, or was not a multiple of I<sizeof(void\ *)>.
ru: Аргумент I<alignment> не является степенью двойки или не кратен I<sizeof(void\ *)>.

source: There was insufficient memory to fulfill the allocation request.
ru: Недостаточно памяти для выполнения запроса о выделении.

source: The functions B<memalign>(), B<valloc>(), and B<pvalloc>() have been available in all Linux libc libraries.
ru: Функции B<memalign>(), B<valloc>() и B<pvalloc>() доступны во всех библиотеках Linux libc.

source: The function B<aligned_alloc>() was added to glibc in version 2.16.
ru: Функция B<aligned_alloc>() впервые появилась в glibc 2.16.

source: The function B<posix_memalign>() is available since glibc 2.1.91.
ru: Функция B<posix_memalign>() доступна в glibc начиная с версии 2.1.91.

source: The function B<valloc>() appeared in 3.0BSD. It is documented as being obsolete in 4.3BSD, and as legacy in SUSv2. It does not appear in POSIX.1.
ru: Функция B<valloc>() появилась из 3.0BSD. Она описана как устаревшая в 4.3BSD и в SUSv2. Отсутствует в POSIX.1.

source: The function B<pvalloc>() is a GNU extension.
ru: Функция B<pvalloc>() является расширением GNU.

source: The function B<memalign>() appears in SunOS 4.1.3 but not in 4.4BSD.
ru: Функция B<memalign>() появилась из SunOS 4.1.3, но отсутствует в 4.4BSD.

source: The function B<posix_memalign>() comes from POSIX.1d and is specified in POSIX.1-2001 and POSIX.1-2008.
ru: Функция B<posix_memalign>() появилась из POSIX.1d и описана в POSIX.1-2001 и POSIX.1-2008.

source: The function B<aligned_alloc>() is specified in the C11 standard.
ru: Функция B<aligned_alloc>() описана в стандарте C11.

source: Headers
ru: Заголовки

source: Everybody agrees that B<posix_memalign>() is declared in I<E<lt>stdlib.hE<gt>>.
ru: Функция B<posix_memalign>() везде объявлена в I<E<lt>stdlib.hE<gt>>.

source: On some systems B<memalign>() is declared in I<E<lt>stdlib.hE<gt>> instead of I<E<lt>malloc.hE<gt>>.
ru: В некоторых системах B<memalign>() объявлена в I<E<lt>stdlib.hE<gt>>, а не в I<E<lt>malloc.hE<gt>>.

source: According to SUSv2, B<valloc>() is declared in I<E<lt>stdlib.hE<gt>>. Libc4,5 and glibc declare it in I<E<lt>malloc.hE<gt>>, and also in I<E<lt>stdlib.hE<gt>> if suitable feature test macros are defined (see above).
ru: В SUSv2 функция B<valloc>() объявлена в I<E<lt>stdlib.hE<gt>>. В Libc4,5 и glibc она объявлена в I<E<lt>malloc.hE<gt>>, а также в I<E<lt>stdlib.hE<gt>>, если определены соответствующие макросы тестирования свойств (смотрите выше).

source: On many systems there are alignment restrictions, for example, on buffers used for direct block device I/O. POSIX specifies the I<pathconf(path,_PC_REC_XFER_ALIGN)> call that tells what alignment is needed. Now one can use B<posix_memalign>() to satisfy this requirement.
ru: Во многих системах накладываются ограничения по выравниванию, например, на буферы, используемые для прямого ввода-вывода в блочные устройства. В POSIX определён вызов I<pathconf(path,_PC_REC_XFER_ALIGN)>, показывающий необходимость выравнивания. В настоящее время можно использовать B<posix_memalign>() для удовлетворения этого требования.

source: B<posix_memalign>() verifies that I<alignment> matches the requirements detailed above. B<memalign>() may not check that the I<alignment> argument is correct.
ru: Функция B<posix_memalign>() проверяет, что I<alignment> удовлетворяет требованиям, описанным выше. Функция B<memalign>() может не проверять корректность аргумента I<alignment>.

source: POSIX requires that memory obtained from B<posix_memalign>() can be freed using B<free>(3). Some systems provide no way to reclaim memory allocated with B<memalign>() or B<valloc>() (because one can pass to B<free>(3) only a pointer obtained from B<malloc>(3), while, for example, B<memalign>() would call B<malloc>(3) and then align the obtained value). The glibc implementation allows memory obtained from any of these functions to be reclaimed with B<free>(3).
ru: В POSIX требуется, чтобы память, полученная через B<posix_memalign>(), могла освобождаться с помощью B<free>(3). В некоторых системах отсутствует механизм освобождения памяти, выделенной B<memalign>() или B<valloc>() (так как в них во B<free>(3) передаётся только указатель, полученный из B<malloc>(3), но, например, B<memalign>() выполняет вызов B<malloc>(3) и затем выравнивает полученное значение). Реализация glibc позволяет освобождать память, полученную через эти функции, с помощью B<free>(3).

source: The glibc B<malloc>(3) always returns 8-byte aligned memory addresses, so these functions are needed only if you require larger alignment values.
ru: Функция glibc B<malloc>(3) всегда возвращает адреса памяти, выровненные по 8-байтовой границе, поэтому данные функции требуются только, если нужны значения с большим выравниванием.

source: printf, fprintf, dprintf, sprintf, snprintf, vprintf, vfprintf, vdprintf, vsprintf, vsnprintf - formatted output conversion
ru: printf, fprintf, dprintf, sprintf, snprintf, vprintf, vfprintf, vdprintf, vsprintf, vsnprintf - преобразование форматированного вывода

source: _XOPEN_SOURCE\ E<gt>=\ 500 || _ISOC99_SOURCE || || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || _ISOC99_SOURCE || || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: The functions in the B<printf>() family produce output according to a I<format> as described below. The functions B<printf>() and B<vprintf>() write output to I<stdout>, the standard output stream; B<fprintf>() and B<vfprintf>() write output to the given output I<stream>; B<sprintf>(), B<snprintf>(), B<vsprintf>() and B<vsnprintf>() write to the character string I<str>.
ru: Функции семейства B<printf>() выводят данные в соответствии с параметром I<format>, описанным ниже. Функции B<printf>() и B<vprintf>() направляют данные в стандартный поток вывода I<stdout>; функции B<fprintf>() и B<vfprintf>() направляют данные в заданный поток вывода I<stream>; функции B<sprintf>(), B<snprintf>(), B<vsprintf>() и B<vsnprintf>() направляют данные в символьную строку I<str>.

source: The function B<dprintf>() is the same as B<fprintf>() except that it outputs to a file descriptor, I<fd>, instead of to a I<stdio> stream.
ru: Функция B<dprintf>() подобна B<fprintf>() за исключением того, что выводит данные в файловый дескриптор I<fd>, а не в поток I<stdio>.

source: The functions B<snprintf>() and B<vsnprintf>() write at most I<size> bytes (including the terminating null byte (\(aq\e0\(aq)) to I<str>.
ru: Функции B<snprintf>() и B<vsnprintf>() записывают не более I<size> байт (включая конечный байт null (\(aq\e0\(aq)) в I<str>.

source: The functions B<vprintf>(), B<vfprintf>(), B<vdprintf>(), B<vsprintf>(), B<vsnprintf>() are equivalent to the functions B<printf>(), B<fprintf>(), B<dprintf>(), B<sprintf>(), B<snprintf>(), respectively, except that they are called with a I<va_list> instead of a variable number of arguments. These functions do not call the I<va_end> macro. Because they invoke the I<va_arg> macro, the value of I<ap> is undefined after the call. See B<stdarg>(3).
ru: Функции B<vprintf>(), B<vfprintf>(), B<vdprintf>(), B<vsprintf>(), B<vsnprintf>() эквивалентны B<printf>(), B<fprintf>(), B<dprintf>(), B<sprintf>(), B<snprintf>(), соответственно, за исключением того, что они вызываются с I<va_list>, а не переменным числом аргументов. Эти функции не вызывают макрос I<va_end>. Так как они вызывают макрос I<va_arg>, значение I<ap> не определено после вызова. Смотрите B<stdarg>(3).

source: All of these functions write the output under the control of a I<format> string that specifies how subsequent arguments (or arguments accessed via the variable-length argument facilities of B<stdarg>(3)) are converted for output.
ru: Все эти функции выводят данные в соответствии со строкой I<format>, которая определяет, каким образом последующие параметры (или доступные параметры переменной длины из B<stdarg>(3)) преобразуют поток вывода.

source: C99 and POSIX.1-2001 specify that the results are undefined if a call to B<sprintf>(), B<snprintf>(), B<vsprintf>(), or B<vsnprintf>() would cause copying to take place between objects that overlap (e.g., if the target string array and one of the supplied input arguments refer to the same buffer). See NOTES.
ru: В C99 и POSIX.1-2001 указано, что результат не определён, если вызов B<sprintf>(), B<snprintf>(), B<vsprintf>() или B<vsnprintf>() привёл бы копированию между перекрывающимися объектами (например, если массив строк назначения и один из указанных входных аргументов ссылаются на один буфер). Смотрите ЗАМЕЧАНИЯ.

source: Format of the format string
ru: Структура строки параметров

source: The format string is a character string, beginning and ending in its initial shift state, if any. The format string is composed of zero or more directives: ordinary characters (not B<%>), which are copied unchanged to the output stream; and conversion specifications, each of which results in fetching zero or more subsequent arguments. Each conversion specification is introduced by the character B<%>, and ends with a I<conversion specifier>. In between there may be (in this order) zero or more I<flags>, an optional minimum I<field width>, an optional I<precision> and an optional I<length modifier>.
ru: Строка параметров — это строка символов, начинающаяся и заканчивающаяся в своём начальном состоянии сдвига, если оно есть. Строка может состоять из нуля или более директив: обычных символов (кроме B<%>), которые неизменно копируются в поток выхода; и спецификаторов преобразования, по каждому из которых выбирается ноль или более последующих параметров. Каждый спецификатор преобразований начинается с символа B<%> и заканчивается I<спецификатором преобразования>. Между ними могут находиться (в определённом порядке) ноль или более I<флагов>, необязательная минимальная I<ширина поля>, необязательная I<точность> и необязательный I<модификатор длины>.

source: The arguments must correspond properly (after type promotion) with the conversion specifier. By default, the arguments are used in the order given, where each \(aq*\(aq (see I<Field width> and I<Precision> below) and each conversion specifier asks for the next argument (and it is an error if insufficiently many arguments are given). One can also specify explicitly which argument is taken, at each place where an argument is required, by writing "%m$" instead of \(aq%\(aq and "*m$" instead of \(aq*\(aq, where the decimal integer I<m> denotes the position in the argument list of the desired argument, indexed starting from 1. Thus,
ru: Параметры должны точно соответствовать (после преобразования типа) спецификаторам преобразований. По умолчанию параметры используются в порядке поступления, где каждая «*» (смотрите I<Ширина поля> и I<Точность> ниже) и каждый спецификатор преобразования требуют последующего параметра (если указано недостаточно параметров, то это приведёт к ошибке). Возможно явное указание на то, какой параметр будет следующим, с помощью записи «%m$» вместо «%» и «*m$» вместо «*ю, где десятичная цифра I<m> означает позицию нужного параметра в их списке; список начинается с единицы. Таким образом,

source: and
ru: и

source: are equivalent. The second style allows repeated references to the same argument. The C99 standard does not include the style using \(aq$\(aq, which comes from the Single UNIX Specification. If the style using \(aq$\(aq is used, it must be used throughout for all conversions taking an argument and all width and precision arguments, but it may be mixed with "%%" formats, which do not consume an argument. There may be no gaps in the numbers of arguments specified using \(aq$\(aq; for example, if arguments 1 and 3 are specified, argument 2 must also be specified somewhere in the format string.
ru: означают одно и то же. Вторая форма записи позволяет производить указание на тот же параметр несколько раз. Стандарт C99 не поддерживает использование «$», который пришёл из Single UNIX Specification. Если используется «$», то он должен использоваться для всех преобразований аргументов и во всех аргументах ширины и точности, но он может быть смешан с форматами «%%», которые не поглощают аргументы. Там может не быть пробелов между числами аргументов, обусловленные использованием «$». Например, если аргументы 1 и 3 определены, то аргумент 2 должен также быть определён где-то в строке параметров.

source: For some numeric conversions a radix character ("decimal point") or thousands' grouping character is used. The actual character used depends on the B<LC_NUMERIC> part of the locale. (See B<setlocale>(3).) The POSIX locale uses \(aq.\(aq as radix character, and does not have a grouping character. Thus,
ru: В некоторых цифровых преобразованиях используется символ разделения целой и дробной частей или символ разделения тысяч. Текущий символ зависит от локали, а именно от значения переменной B<LC_NUMERIC> (смотрите B<setlocale>(3)).В локали POSIX по умолчанию используется символ «.» и не отсутствует символ разделения. Таким образом,

source: results in "1234567.89" in the POSIX locale, in "1234567,89" in the nl_NL locale, and in "1.234.567,89" in the da_DK locale.
ru: выводит «1234567.89» при локали POSIX, «1234567,89» при локали nl_NL и «1.234.567,89» при локали da_DK.

source: Flag characters
ru: Флаги

source: The character % is followed by zero or more of the following flags:
ru: За символом % может быть указано ноль или несколько следующих флагов:

source: The value should be converted to an "alternate form". For B<o> conversions, the first character of the output string is made zero (by prefixing a 0 if it was not zero already). For B<x> and B<X> conversions, a nonzero result has the string "0x" (or "0X" for B<X> conversions) prepended to it. For B<a>, B<A>, B<e>, B<E>, B<f>, B<F>, B<g>, and B<G> conversions, the result will always contain a decimal point, even if no digits follow it (normally, a decimal point appears in the results of those conversions only if a digit follows). For B<g> and B<G> conversions, trailing zeros are not removed from the result as they would otherwise be. For other conversions, the result is undefined.
ru: Значение преобразуется в «альтернативную форму». Для преобразования типа B<o> первый символ выходного потока будет нуль (префикс 0, если до этого его не было указано). Для преобразований типа B<x> и B<X> к ненулевому результату добавляется «0x» (или «0X» для преобразования типа B<X>). При преобразованиях типа B<a>, B<A>, B<e>, B<E>, B<f>, B<F>, B<g> и B<G> результат всегда будет содержать десятичную точку, даже если за ней не следует цифр (обычно десятичная точка присутствует в результате таких преобразований только, если за ними следуют цифры). Для преобразований B<g> и B<G> завершающие нули не удаляются из результата, как это обычно случается. Результат для других преобразований не определён.

source: The value should be zero padded. For B<d>, B<i>, B<o>, B<u>, B<x>, B<X>, B<a>, B<A>, B<e>, B<E>, B<f>, B<F>, B<g>, and B<G> conversions, the converted value is padded on the left with zeros rather than blanks. If the B<\&0> and B<-> flags both appear, the B<\&0> flag is ignored. If a precision is given with a numeric conversion (B<d>, B<i>, B<o>, B<u>, B<x>, and B<X>), the B<\&0> flag is ignored. For other conversions, the behavior is undefined.
ru: В значение добавляются нули. При преобразованиях типа B<d>, B<i>, B<o>, B<u>, B<x>, B<X>, B<a>, B<A>, B<e>, B<E>, B<f>, B<F>, B<g> и B<G> преобразуемое значение слева дополняется нулями (вместо пробелов). Если присутствуют флаги B<\&0> и B<->, то флаг B<\&0> игнорируется. Если в числовом преобразовании указана точность (B<d>, B<i>, B<o>, B<u>, B<x>, и B<X>), то флаг B<\&0> игнорируется. Поведение флага при других преобразованиях не определено.

source: The converted value is to be left adjusted on the field boundary. (The default is right justification.) The converted value is padded on the right with blanks, rather than on the left with blanks or zeros. A B<-> overrides a B<\&0> if both are given.
ru: Выравнивает результат преобразования по левой границе поля (по умолчанию выравнивание выполняется справа). Преобразованное значение дополняется справа пробелами, а не пробелами или нулями слева. Флаг B<-> отменяет флаг «0», если было указано оба флага.

source: (a space) A blank should be left before a positive number (or empty string) produced by a signed conversion.
ru: (пробел). Устанавливает слева перед положительными числами (или пустой строкой) знак пробела при знаковых преобразованиях.

source: A sign (+ or -) should always be placed before a number produced by a signed conversion. By default, a sign is used only for negative numbers. A B<+> overrides a space if both are used.
ru: Знак + или - всегда помещается перед преобразованным числом со знаком. По умолчанию знак используется только для отрицательных чисел. Флаг B<+> отменяет действие пробела, если указаны оба флага.
