Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The persistent keyring is independent of B<clone>(2), B<fork>(2), B<vfork>(2), B<execve>(2), and B<_exit>(2). It persists until its expiration timer triggers, at which point it is garbage collected. This allows the persistent keyring to carry keys beyond the life of the kernel's record of the corresponding UID (the destruction of which results in the destruction of the B<user-keyring>(7) and the B<user-session-keyring>(7)). The persistent keyring can thus be used to hold authentication tokens for processes that run without user interaction, such as programs started by B<cron>(8).
ru: Постоянная связка ключей не зависит от B<clone>(2), B<fork>(2), B<vfork>(2), B<execve>(2) и B<_exit>(2). Она существует до истечения срока действия таймера, после чего удаляется сборщиком мусора. Это позволяет связке ключей хранить ключи дольше жизни ядерной записи соответствующего UID (удаление которой приводит к уничтожению B<user-keyring>(7) и B<user-session-keyring>(7)). Таким образом, постоянную связку ключей можно использовать для хранения токенов аутентификации для процессов, которые выполняются без взаимодействия с пользователем, например программы, выполняемые B<cron>(8).

source: The persistent keyring is used to store UID-specific objects that themselves have limited lifetimes (e.g., kerberos tokens). If those tokens cease to be used (i.e., the persistent keyring is not accessed), then the timeout of the persistent keyring ensures that the corresponding objects are automatically discarded.
ru: Постоянная связка ключей используется для хранения объектов, для UID, которые сами имеют ограниченный срок жизни (например, токены kerberos). Если такие токены больше не используются (т. е., связка ключей недоступна), то срок действия постоянной связки ключей позволяет автоматически удалять соответствующие ей объекты.

source: Special operations
ru: Специальные операции

source: The I<keyutils> library provides the B<keyctl_get_persistent>(3) function for manipulating persistent keyrings. (This function is an interface to the B<keyctl>(2) B<KEYCTL_GET_PERSISTENT> operation.) This operation allows the calling thread to get the persistent keyring corresponding to its own UID or, if the thread has the B<CAP_SETUID> capability, the persistent keyring corresponding to some other UID in the same user namespace.
ru: Библиотека I<keyutils> для работы с постоянными связками ключей предоставляет функцию B<keyctl_get_persistent>(3) (эта функция является интерфейсом к операции B<keyctl>(2) B<KEYCTL_GET_PERSISTENT>). Данная операция позволяет вызывающей нити получить постоянную связку ключей, соответствующую её UID или, если нить имеет мандат B<CAP_SETUID>, то постоянная связка ключей соответствует какому-то другому UID в этом же пространстве имён пользователя.

source: Each user namespace owns a keyring called I<.persistent_register> that contains links to all of the persistent keys in that namespace. (The I<.persistent_register> keyring can be seen when reading the contents of the I</proc/keys> file for the UID 0 in the namespace.) The B<keyctl_get_persistent>(3) operation looks for a key with a name of the form I<_persistent.E<lt>UIDE<gt>> in that keyring, creates the key if it does not exist, and links it into the keyring.
ru: Каждое пространство имён пользователя имеет свою связку ключей с именем I<.persistent_register>, в которой содержатся ссылки на все постоянные ключи в этом пространстве имён (связку ключей I<.persistent_register> можно увидеть при чтении в пространстве имён содержимого файла I</proc/keys> для UID 0). Операция B<keyctl_get_persistent>(3) ищет ключ с именем в виде I<_persistent.E<lt>UIDE<gt>> в этой связке ключей, создаёт ключ, если он не существует и прицепляет его в связку ключей.

source: posixoptions - optional parts of the POSIX standard
ru: posixoptions - необязательные части стандарта POSIX

source: The POSIX standard (the information below is from POSIX.1-2001) describes a set of behaviors and interfaces for a compliant system. However, many interfaces are optional and there are feature test macros to test the availability of interfaces at compile time, and functions B<sysconf>(3), B<fpathconf>(3), B<pathconf>(3), B<confstr>(3) to do this at run time. From shell scripts one can use B<getconf>(1). For more detail, see B<sysconf>(3).
ru: В стандарте POSIX (информация взята POSIX.1-2001) описан набор правил работы и интерфейсы, требуемый от совместимой системы. Однако много интерфейсов являются необязательными и имеется набор макросов тестирования свойств для проверки доступности интерфейсов во время компиляции, а также есть функции B<sysconf>(3), B<fpathconf>(3), B<pathconf>(3), B<confstr>(3), которые выполняют проверки во время выполнения. Из сценариев оболочки можно использовать B<getconf>(1). Подробности смотрите в B<sysconf>(3).

source: We give the name of the POSIX abbreviation, the option, the name of the B<sysconf>(3) parameter used to inquire about the option, and possibly a very short description. Much more precise detail can be found in the POSIX standard itself, versions of which can nowadays be accessed freely on the web.
ru: Мы приводим имя из POSIX, свойство, имя параметра B<sysconf>(3), который используется для запроса этого свойство, и возможно, очень краткое описание. Более полную информацию можно найти в самом стандарте POSIX, из версий, которые теперь свободно доступны через веб.

source: The following advisory functions are present:
ru: Доступны следующие консультативные функции:

source: The header I<E<lt>aio.hE<gt>> is present. The following functions are present:
ru: Доступен заголовочный файл I<E<lt>aio.hE<gt>>. Доступны следующие функции:

source: This option implies the B<_POSIX_THREADS> and B<_POSIX_THREAD_SAFE_FUNCTIONS> options. The following functions are present:
ru: Это свойство подразумевает свойства B<_POSIX_THREADS> и B<_POSIX_THREAD_SAFE_FUNCTIONS>. Доступны следующие функции:

source: If this option is in effect (as it always is under POSIX.1-2001), then only root may change the owner of a file, and nonroot can set the group of a file only to one of the groups it belongs to. This affects the following functions
ru: Если действует это свойство (всегда, согласно POSIX.1-2001), то только суперпользователь может изменять владельца файла, а обычный пользователь может задать группу файла только на одну из групп, которой принадлежит. Учитывается в функциях:

source: This option implies the B<_POSIX_TIMERS> option. The following functions are present:
ru: Это свойство подразумевает свойство B<_POSIX_TIMERS>. Доступны следующие функции:

source: If B<CLOCK_REALTIME> is changed by the function I<clock_settime>(), then this affects all timers set for an absolute time.
ru: Если B<CLOCK_REALTIME> изменяется функцией I<clock_settime>(), то это влияет на все таймеры, заданные абсолютным временем.

source: The B<CLOCK_PROCESS_CPUTIME_ID> clock ID is supported. The initial value of this clock is 0 for each process. This option implies the B<_POSIX_TIMERS> option. The function I<clock_getcpuclockid>() is present.
ru: Поддерживается идентификатор часов B<CLOCK_PROCESS_CPUTIME_ID>. Начальное значение этих часов равно нулю для каждого процесса. Данное свойство подразумевает свойство B<_POSIX_TIMERS>. Доступна функция I<clock_getcpuclockid>().

source: This option has been deleted. Not in final XPG6.
ru: Эта функция была удалена. Нет в окончательной XPG6.

source: The function I<fsync>() is present.
ru: Доступна функция I<fsync>().

source: Internet Protocol Version 6 is supported.
ru: Поддерживается Internet Protocol Version 6.

source: If this option is in effect (as it always is under POSIX.1-2001), then the system implements POSIX-style job control, and the following functions are present:
ru: Если доступно это свойство (всегда в POSIX.1-2001), то в системе реализовано управление заданиями в стиле POSIX и доступны следующие функции:

source: Shared memory is supported. The include file I<E<lt>sys/mman.hE<gt>> is present. The following functions are present:
ru: Поддерживается общая память. Доступен заголовочный файл I<E<lt>sys/mman.hE<gt>>. Доступны следующие функции:

source: Shared memory can be locked into core. The following functions are present:
ru: Общая память может блокироваться в ядре (core). Доступны следующие функции:

source: More precisely, ranges can be locked into core. The following functions are present:
ru: Более точно, диапазоны могут блокироваться в ядре (core). Доступны следующие функции:

source: The function I<mprotect>() is present.
ru: Доступна функция I<mprotect>().

source: The include file I<E<lt>mqueue.hE<gt>> is present. The following functions are present:
ru: Доступен заголовочный файл I<E<lt>mqueue.hE<gt>>. Доступны следующие функции:

source: B<CLOCK_MONOTONIC> is supported. This option implies the B<_POSIX_TIMERS> option. The following functions are affected:
ru: Поддерживается B<CLOCK_MONOTONIC>. Это свойство подразумевает свойство B<_POSIX_TIMERS>. Влияет на следующие функции:

source: If this option is in effect (as it always is under POSIX.1-2001), then pathname components longer than B<NAME_MAX> are not truncated, but give an error. This property may be dependent on the path prefix of the component.
ru: Если доступно это свойство (всегда в POSIX.1-2001), то компоненты пути длиннее чем B<NAME_MAX> не обрезаются, а выдаётся ошибка. Данное свойство может зависеть от префикса компонента пути.

source: This option says that one can specify priorities for asynchronous I/O. This affects the functions
ru: Это свойство показывает, то можно задавать приоритеты для асинхронного ввода-вывода. Влияет на следующие функции:

source: The include file I<E<lt>sched.hE<gt>> is present. The following functions are present:
ru: Доступен заголовочный файл I<E<lt>sched.hE<gt>>. Доступны следующие функции:

source: If also B<_POSIX_SPAWN> is in effect, then the following functions are present:
ru: Если также доступно свойство B<_POSIX_SPAWN>, доступны следующие функции:

source: Raw sockets are supported. The following functions are affected:
ru: Поддерживаются неструктурированные сокеты. Влияет на следующие функции:

source: This option implies the B<_POSIX_THREADS> option. Conversely, under POSIX.1-2001 the B<_POSIX_THREADS> option implies this option.
ru: Это свойство подразумевает свойство B<_POSIX_THREADS>. И наоборот, согласно POSIX.1-2001, свойство B<_POSIX_THREADS> подразумевает это свойство.

source: The following functions are present:
ru: Доступны следующие функции:

source: Realtime signals are supported. The following functions are present:
ru: Доступны сигналы реального времени. Доступны следующие функции:

source: If this option is in effect (as it always is under POSIX.1-2001), then POSIX regular expressions are supported and the following functions are present:
ru: Если доступно это свойство (всегда в POSIX.1-2001), то поддерживаются регулярные выражения POSIX и доступны следующие функции:

source: If this option is in effect (as it always is under POSIX.1-2001), then a process has a saved set-user-ID and a saved set-group-ID. The following functions are affected:
ru: Если доступно это свойство (всегда в POSIX.1-2001), то у процесса имеются сохранённый set-user-ID и сохранённый set-group-ID. Влияет на следующие функции:

source: The include file I<E<lt>semaphore.hE<gt>> is present. The following functions are present:
ru: Доступен заголовочный файл I<E<lt>semaphore.hE<gt>>. Доступны следующие функции:

source: If this option is in effect (as it always is under POSIX.1-2001), the function I<system>() is present.
ru: Если доступно это свойство (всегда в POSIX.1-2001), то в системе доступна функция I<system>().

source: This option describes support for process creation in a context where it is difficult or impossible to use I<fork>(), for example, because no MMU is present.
ru: Данное свойство выделяет процесс создания поддержки в связи с тем, что трудно или невозможно использовать I<fork>(), например, из-за отсутствия MMU.

source: If B<_POSIX_SPAWN> is in effect, then the include file I<E<lt>spawn.hE<gt>> and the following functions are present:
ru: Если задействовано свойство B<_POSIX_SPAWN>, то доступен заголовочный файл I<E<lt>spawn.hE<gt>> и следующие функции:

source: If also B<_POSIX_PRIORITY_SCHEDULING> is in effect, then the following functions are present:
ru: Если также доступно свойство B<_POSIX_PRIORITY_SCHEDULING>, то доступны следующие функции:

source: The scheduling policy B<SCHED_SPORADIC> is supported. This option implies the B<_POSIX_PRIORITY_SCHEDULING> option. The following functions are affected:
ru: Поддерживается алгоритм планирования B<SCHED_SPORADIC>. Это свойство подразумевает свойство B<_POSIX_PRIORITY_SCHEDULING>. Влияет на следующие функции:

source: The following functions are affected:
ru: Влияет на следующие функции:

source: The clockID CLOCK_THREAD_CPUTIME_ID is supported. This option implies the B<_POSIX_TIMERS> option. The following functions are affected:
ru: Поддерживается идентификатор часов CLOCK_THREAD_CPUTIME_ID. Это свойство подразумевает свойство B<_POSIX_TIMERS>. Влияет на следующие функции:

source: If this option is in effect, the different threads inside a process can run with different priorities and/or different schedulers. The following functions are affected:
ru: Если доступно это свойство, то нити в процессе можно выполнять с разными приоритетами или планировщиками. Влияет на следующие функции:

source: This option implies the B<_POSIX_THREAD_PRIORITY_SCHEDULING> option. The following functions are affected:
ru: Это свойство подразумевает свойство B<_POSIX_THREAD_PRIORITY_SCHEDULING>. Влияет на следующие функции:

source: Basic support for POSIX threads is available. The following functions are present:
ru: Доступна начальная поддержка нитей POSIX. Доступны следующие функции:

source: POSIX tracing is available. The following functions are present:
ru: Доступна поддержка трассировки POSIX. Доступны следующие функции:

source: This option implies the B<_POSIX_TRACE> option. The following functions are present:
ru: Это свойство подразумевает свойство B<_POSIX_TRACE>. Доступны следующие функции:

source: Tracing children of the traced process is supported. This option implies the B<_POSIX_TRACE> option. The following functions are present:
ru: Поддерживается трассировка потомков трассируемого процесса. Это свойство подразумевает свойство B<_POSIX_TRACE>. Доступны следующие функции:

source: Always present (probably 0). Value to set a changeable special control character to indicate that it is disabled.
ru: Имеется всегда (вероятное значение — 0). Присвоение значения специального управляющего символа означает выключение.

source: X/OPEN SYSTEM INTERFACE EXTENSIONS
ru: РАСШИРЕНИЯ X/OPEN SYSTEM INTERFACE

source: This option implies the following options:
ru: Это свойство подразумевает следующие свойства:

source: The Advanced Realtime option group implies that the following options are all defined to 200112L:
ru: Группа свойств Advanced Realtime подразумевает, что все следующие свойства определены до 200112L:

source: (implies B<_POSIX_TIMERS>)
ru: (подразумевает B<_POSIX_TIMERS>)

source: (implies B<_POSIX_PRIORITY_SCHEDULING>)
ru: (подразумевает B<_POSIX_PRIORITY_SCHEDULING>)

source: This option implies that the following options are all defined to 200112L:
ru: Это свойство подразумевает, что все следующие свойства определены до 200112L:

source: (implies B<_POSIX_THREADS>, B<_POSIX_THREAD_SAFE_FUNCTIONS>)
ru: (подразумевает B<_POSIX_THREADS>, B<_POSIX_THREAD_SAFE_FUNCTIONS>)

source: (implies B<_POSIX_THREAD_PRIORITY_SCHEDULING>)
ru: (подразумевает B<_POSIX_THREAD_PRIORITY_SCHEDULING>)

source: Functions included in the legacy option group were previously mandatory, but are now optional in this version. The following functions are present:
ru: Функции, включённые в группу устаревших свойств, которые были обязательны ранее, но в этой версии стали необязательными. Это относится к следующим функциям:

source: This option may imply the following options from the XSI option groups:
ru: Это свойство может подразумевать следующие свойства из групп свойств XSI:

source: Encryption (B<_XOPEN_CRYPT>)
ru: Шифрование (B<_XOPEN_CRYPT>)

source: pipe - overview of pipes and FIFOs
ru: pipe - обзор каналов и FIFO

source: Pipes and FIFOs (also known as named pipes) provide a unidirectional interprocess communication channel. A pipe has a I<read end> and a I<write end>. Data written to the write end of a pipe can be read from the read end of the pipe.
ru: Каналы и FIFO (также называемые именованными каналами) предоставляют двунаправленный канал обмена между процессами. У канала имеется I<конец для чтения> (read end) и I<конец для записи> (write end). Данные, записанные в конец для записи, можно прочитать из конца для чтения.

source: A pipe is created using B<pipe>(2), which creates a new pipe and returns two file descriptors, one referring to the read end of the pipe, the other referring to the write end. Pipes can be used to create a communication channel between related processes; see B<pipe>(2) for an example.
ru: Канал создаётся с помощью вызова B<pipe>(2), который образует новый канал и возвращает два файловых дескриптора, один указывает на конец для чтения, а другой на конец для записи. Каналы можно использовать для создания канала обмена между процессами; пример смотрите в B<pipe>(2).

source: A FIFO (short for First In First Out) has a name within the filesystem (created using B<mkfifo>(3)), and is opened using B<open>(2). Any process may open a FIFO, assuming the file permissions allow it. The read end is opened using the B<O_RDONLY> flag; the write end is opened using the B<O_WRONLY> flag. See B<fifo>(7) for further details. I<Note>: although FIFOs have a pathname in the filesystem, I/O on FIFOs does not involve operations on the underlying device (if there is one).
ru: У FIFO (сокращение от First In First Out, первым вошёл, первым вышел) имеется имя в файловой системе (создаётся с помощью B<mkfifo>(3)), и такой канал открывается с помощью B<open>(2). Любой процесс может открыть FIFO, если это ему разрешено правами на файл. Конец для чтения открывается при указании флага B<O_RDONLY>; конец для записи открывается при указании флага B<O_WRONLY>. Подробней смотрите B<fifo>(7). I<Замечание>: хотя у FIFO есть путь в файловой системе, при вводе-выводе из FIFO не используются операции с нижележащим устройством (если оно есть).

source: I/O on pipes and FIFOs
ru: Ввод-вывод из каналов и FIFO

source: The only difference between pipes and FIFOs is the manner in which they are created and opened. Once these tasks have been accomplished, I/O on pipes and FIFOs has exactly the same semantics.
ru: Каналы и FIFO отличаются только способом создания и открытия. После выполнения этих задач, ввод-вывод из каналов и FIFO имеет одинаковую семантику.

source: If a process attempts to read from an empty pipe, then B<read>(2) will block until data is available. If a process attempts to write to a full pipe (see below), then B<write>(2) blocks until sufficient data has been read from the pipe to allow the write to complete. Nonblocking I/O is possible by using the B<fcntl>(2) B<F_SETFL> operation to enable the B<O_NONBLOCK> open file status flag.
ru: Если процесс пытается выполнить чтение из пустого канала, то B<read>(2) заблокирует выполнение в ожидании данных. Если процесс пытается выполнить запись в заполненный канал (смотрите далее), то B<write>(2) заблокирует выполнение до тех пор, пока из канала не будут прочитаны данные, чтобы можно было записать ожидающие. Возможен неблокируемый ввод-вывод с помощью вызова B<fcntl>(2) с операцией B<F_SETFL>, включающей флаг B<O_NONBLOCK> в состоянии открытого файла.

source: The communication channel provided by a pipe is a I<byte stream>: there is no concept of message boundaries.
ru: Канал обмена, предоставляемый каналом, является I<потоком байт>: какие-либо границы сообщений отсутствуют.

source: If all file descriptors referring to the write end of a pipe have been closed, then an attempt to B<read>(2) from the pipe will see end-of-file (B<read>(2) will return 0). If all file descriptors referring to the read end of a pipe have been closed, then a B<write>(2) will cause a B<SIGPIPE> signal to be generated for the calling process. If the calling process is ignoring this signal, then B<write>(2) fails with the error B<EPIPE>. An application that uses B<pipe>(2) and B<fork>(2) should use suitable B<close>(2) calls to close unnecessary duplicate file descriptors; this ensures that end-of-file and B<SIGPIPE>/B<EPIPE> are delivered when appropriate.
ru: Если все файловые дескрипторы, указывающие на конец канала для записи, были закрыты, то попытка выполнить B<read>(2) из канала возвратит конец файла (B<read>(2) вернёт 0). Если все файловые дескрипторы, указывающие на конец канала для чтения, были закрыты, то B<write>(2) завершится сигналом B<SIGPIPE>, который будет послан вызывающему процессу. Если вызывающий процесс игнорирует этот сигнал, то B<write>(2) завершится ошибкой B<EPIPE>. Приложение, использующее B<pipe>(2) и B<fork>(2), должно использовать правильные вызовы B<close>(2) для закрытия ненужных копий файловых дескрипторов; это обеспечит появления конца файла и доставку B<SIGPIPE>/B<EPIPE> в подходящий момент.

source: It is not possible to apply B<lseek>(2) to a pipe.
ru: Для канала невозможно вызвать B<lseek>(2).

source: Pipe capacity
ru: Ёмкость канала

source: A pipe has a limited capacity. If the pipe is full, then a B<write>(2) will block or fail, depending on whether the B<O_NONBLOCK> flag is set (see below). Different implementations have different limits for the pipe capacity. Applications should not rely on a particular capacity: an application should be designed so that a reading process consumes data as soon as it is available, so that a writing process does not remain blocked.
ru: Канал имеет ограниченную ёмкость. Если канал переполнен, то B<write>(2) заблокируется или завершится с ошибкой, в зависимости от наличия флага B<O_NONBLOCK> (смотрите далее). В различных реализациях разные ограничения на ёмкость канала. Приложения не должны полагаться на определённую величину: их нужно разрабатывать так, чтобы читающий процесс перерабатывал данные как только они появляются, чтобы пишущий процесс не блокировался.

source: In Linux versions before 2.6.11, the capacity of a pipe was the same as the system page size (e.g., 4096 bytes on i386). Since Linux 2.6.11, the pipe capacity is 16 pages (i.e., 65,536 bytes in a system with a page size of 4096 bytes). Since Linux 2.6.35, the default pipe capacity is 16 pages, but the capacity can be queried and set using the B<fcntl>(2) B<F_GETPIPE_SZ> and B<F_SETPIPE_SZ> operations. See B<fcntl>(2) for more information.
ru: В Linux до версии 2.6.11, ёмкость канала была равна размеру системной страницы (4096 байт на i386). Начиная с Linux 2.6.11, ёмкость канала равна 16 страницам (т. е., 65536 байтам в системе с размером страницы в 4096 байта). Начиная с Linux 2.6.35, ёмкость канала по умолчанию равна 16 страницам, но это значение можно прочитать и изменить с помощью вызова B<fcntl>(2) с операциями B<F_GETPIPE_SZ> и B<F_SETPIPE_SZ>. Подробности смотрите в B<fcntl>(2).

source: The following B<ioctl>(2) operation, which can be applied to a file descriptor that refers to either end of a pipe, places a count of the number of unread bytes in the pipe in the I<int> buffer pointed to by the final argument of the call:
ru: Следующая операция B<ioctl>(2), которая может быть применена к файловому дескриптору, указывающему на любой конец канала, помещает количество непрочитанных байт канала в буфер I<int>, задаваемый последним аргументом вызова:
