Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The ptrace API (ab)uses the standard UNIX parent/child signaling over B<waitpid>(2). This used to cause the real parent of the process to stop receiving several kinds of B<waitpid>(2) notifications when the child process is traced by some other process.
ru: Программный интерфейс ptrace использует стандартный обмен сигналами UNIX между родителем и потомком через B<waitpid>(2). Это приводит к тому, что настоящий родитель процесса перестаёт получать некоторые виды уведомлений B<waitpid>(2), когда дочерний процесс трассируется другим процессом.

source: Many of these bugs have been fixed, but as of Linux 2.6.38 several still exist; see BUGS below.
ru: Многие из этих дефектов были исправлены, но на момент версии Linux 2.6.38 некоторые из них всё ещё существуют; смотрите ДЕФЕКТЫ далее.

source: As of Linux 2.6.38, the following is believed to work correctly:
ru: На момент версии Linux 2.6.38 работает правильно:

source: exit/death by signal is reported first to the tracer, then, when the tracer consumes the B<waitpid>(2) result, to the real parent (to the real parent only when the whole multithreaded process exits). If the tracer and the real parent are the same process, the report is sent only once.
ru: при выходе/уничтожении по сигналу об этом сначала сообщается трассировщику, а затем,когда трассировщик подтвердит результат B<waitpid>(2), настоящему родителю (настоящему родителю только когда завершается многонитевой процесс целиком). Если трассировщик и реальный родитель — один и тот же процесс, то сообщение приходит лишь однажды.

source: On success, the B<PTRACE_PEEK*> requests return the requested data (but see NOTES), the B<PTRACE_SECCOMP_GET_FILTER> request returns the number of instructions in the BPF program, and other requests return zero.
ru: При успешном выполнении запросы B<PTRACE_PEEK*> возвращают запрашиваемые данные (но смотрите ЗАМЕЧАНИЯ), запрос B<PTRACE_SECCOMP_GET_FILTER> возвращает количество инструкций в программе BPF, а другие запросы возвращают ноль.

source: On error, all requests return -1, and I<errno> is set appropriately. Since the value returned by a successful B<PTRACE_PEEK*> request may be -1, the caller must clear I<errno> before the call, and then check it afterward to determine whether or not an error occurred.
ru: При ошибке для всех действий возвращается -1, а переменной I<errno> присваивается номер ошибки. Так как значение, возвращаемое при удачном выполнении B<PTRACE_PEEK*>, может равняться -1, перед вызовом вызывающий должен очистить содержимое I<errno>, чтобы узнать, возникала ошибка или нет.

source: (i386 only) There was an error with allocating or freeing a debug register.
ru: (только для i386) Произошла ошибка при размещении или освобождении отладочного регистра.

source: There was an attempt to read from or write to an invalid area in the tracer's or the tracee's memory, probably because the area wasn't mapped or accessible. Unfortunately, under Linux, different variations of this fault will return B<EIO> or B<EFAULT> more or less arbitrarily.
ru: Была сделана попытка чтения или записи информации в область памяти трассируемой нити или трассировщика, но, скорее всего, эта память не отображена или недоступна. К сожалению, в Linux в разных ситуациях в результате этой ошибки возвращаются значения B<EIO> или B<EFAULT>, что не всегда поддается объяснению.

source: An attempt was made to set an invalid option.
ru: Попытка установить недопустимое значение.

source: I<request> is invalid, or an attempt was made to read from or write to an invalid area in the tracer's or the tracee's memory, or there was a word-alignment violation, or an invalid signal was specified during a restart request.
ru: Задано неверное значение I<request>, или была попытка чтения или записи информации в неподходящую область памяти трассируемой нити или трассировщика; ошибка выравнивания слов по границе, или при запросе возобновления работы дочернего процесса был задан неверно номер сигнала.

source: The specified process cannot be traced. This could be because the tracer has insufficient privileges (the required capability is B<CAP_SYS_PTRACE>); unprivileged processes cannot trace processes that they cannot send signals to or those running set-user-ID/set-group-ID programs, for obvious reasons. Alternatively, the process may already be being traced, or (on kernels before 2.6.26) be B<init>(1) (PID 1).
ru: Указанный процесс не может быть трассирован. Это может произойти потому, что трассировщик не имеет прав на трассировку (требуется мандат B<CAP_SYS_PTRACE>); непривилегированные процессы не могут трассировать процессы, так как они не могут посылать сигналы, или если у них установлен set-user-ID/set-group-ID бит. Также, процесс может уже трассироваться или (на ядрах до версии 2.6.26) быть B<init>(1) (PID 1).

source: The specified process does not exist, or is not currently being traced by the caller, or is not stopped (for requests that require a stopped tracee).
ru: Указанный процесс не существует, в данный момент не трассируется вызывающим процессом, или не остановлен (для выполнения действий, которые требуют остановки трассируемой нити).

source: Although arguments to B<ptrace>() are interpreted according to the prototype given, glibc currently declares B<ptrace>() as a variadic function with only the I<request> argument fixed. It is recommended to always supply four arguments, even if the requested operation does not use them, setting unused/ignored arguments to I<0L> or I<(void\ *)\ 0>.
ru: Хотя параметры B<ptrace>() воспринимаются согласно заданному прототипу, в настоящее время в glibc B<ptrace>() объявлена как функция с переменным числом параметров, в которой фиксирован только параметр I<request>. Рекомендуется всегда передавать четыре параметра, даже если в запрашиваемом действии они не используются (неиспользуемые аргументы указывайте как I<0L> или I<(void\ *)\ 0>).

source: In Linux kernels before 2.6.26, B<init>(1), the process with PID 1, may not be traced.
ru: В ядрах Linux до версии 2.6.26, процесс B<init>(1) с PID 1 не может быть трассирован.

source: A tracees parent continues to be the tracer even if that tracer calls B<execve>(2).
ru: Родитель трассируемой нити остаётся трассировщиком даже, если трассировщик вызывает B<execve>(2).

source: The layout of the contents of memory and the USER area are quite operating-system- and architecture-specific. The offset supplied, and the data returned, might not entirely match with the definition of I<struct user>.
ru: Структура памяти и области USER зависят от ОС и архитектуры системы. Указываемое смещение и возвращаемые данные могут не полностью соответствовать определению I<struct user>.

source: The size of a "word" is determined by the operating-system variant (e.g., for 32-bit Linux it is 32 bits).
ru: Размер «слова» определяется вариантом ОС (например, для 32-битного варианта Linux слово будет 32-битным).

source: This page documents the way the B<ptrace>() call works currently in Linux. Its behavior differs significantly on other flavors of UNIX. In any case, use of B<ptrace>() is highly specific to the operating system and architecture.
ru: Эта страница описывает работу системного вызова B<ptrace>() в Linux. Его работа значительно отличается от поведения в других системах UNIX. В любом случае, использование B<ptrace>() очень сильно зависит от ОС и архитектуры.

source: Ptrace access mode checking
ru: Проверка режима доступа ptrace

source: Various parts of the kernel-user-space API (not just B<ptrace>() operations), require so-called "ptrace access mode" checks, whose outcome determines whether an operation is permitted (or, in a few cases, causes a "read" operation to return sanitized data). These checks are performed in cases where one process can inspect sensitive information about, or in some cases modify the state of, another process. The checks are based on factors such as the credentials and capabilities of the two processes, whether or not the "target" process is dumpable, and the results of checks performed by any enabled Linux Security Module (LSM)\(emfor example, SELinux, Yama, or Smack\(emand by the commoncap LSM (which is always invoked).
ru: Для различных частей программного интерфейса ядро — пользовательское пространство (не только операции B<ptrace>()) требуются так называемые проверки «режима доступа ptrace», чьими результатами определяется будет ли разрешена операция (или это, в некоторых случаях, заставит операцию «чтения» цензурировать возвращаемые данные). Эти проверки выполняются в случаях, когда один процесс может просмотреть конфиденциальную информацию или, в некоторых случаях, изменять состояние другого процесса. Проверки основываются на учётных данных и мандатах двух процессов, разрешено ли создание дампа «целевого» процесса, а результаты проверок выполняются любым включённым модулем безопасности Linux (LSM) — например, SELinux, Yama и Smack — и commoncap LSM (который вызывается всегда).

source: Prior to Linux 2.6.27, all access checks were of a single type. Since Linux 2.6.27, two access mode levels are distinguished:
ru: До Linux 2.6.27 все проверки доступа были одного вида. Начиная с Linux 2.6.27 различают два уровня проверок доступа:

source: For "read" operations or other operations that are less dangerous, such as: B<get_robust_list>(2); B<kcmp>(2); reading I</proc/[pid]/auxv>, I</proc/[pid]/environ>, or I</proc/[pid]/stat>; or B<readlink>(2) of a I</proc/[pid]/ns/*> file.
ru: Для операций «чтения» или других менее опасных операций: B<get_robust_list>(2); B<kcmp>(2); чтение I</proc/[pid]/auxv>, I</proc/[pid]/environ> или I</proc/[pid]/stat>, или B<readlink>(2) для файла I</proc/[pid]/ns/*>.

source: For "write" operations, or other operations that are more dangerous, such as: ptrace attaching (B<PTRACE_ATTACH>) to another process or calling B<process_vm_writev>(2). (B<PTRACE_MODE_ATTACH> was effectively the default before Linux 2.6.27.)
ru: Для операций «записи» или других более опасных операций: присоединение ptrace (B<PTRACE_ATTACH>) к другому процессу или вызов B<process_vm_writev>(2) (B<PTRACE_MODE_ATTACH> было эффективным значением по умолчанию до Linux 2.6.27).

source: Since Linux 4.5, the above access mode checks are combined (ORed) with one of the following modifiers:
ru: Начиная с Linux 4.5 приведённые выше проверки режима доступа объединяются (ИЛИ) с одним из следующих модификаторов:

source: Use the caller's filesystem UID and GID (see B<credentials>(7)) or effective capabilities for LSM checks.
ru: Использовать UID и GID файловой системы у вызывающего (смотрите B<credentials>(7)) или эффективные мандаты для проверок LSM.

source: Use the caller's real UID and GID or permitted capabilities for LSM checks. This was effectively the default before Linux 4.5.
ru: Использовать реальные UID и GID у вызывающего или разрешающие мандаты для проверок LSM. Это было эффективным значением по умолчанию до Linux 4.5.

source: Because combining one of the credential modifiers with one of the aforementioned access modes is typical, some macros are defined in the kernel sources for the combinations:
ru: Так как объединение модификаторов мандатов с одной из вышеупомянутых режимов доступа часто используется, то в исходном коде ядра было определено несколько макросов:

source: Defined as B<PTRACE_MODE_READ | PTRACE_MODE_FSCREDS>.
ru: Определён как B<PTRACE_MODE_READ | PTRACE_MODE_FSCREDS>.

source: Defined as B<PTRACE_MODE_READ | PTRACE_MODE_REALCREDS>.
ru: Определён как B<PTRACE_MODE_READ | PTRACE_MODE_REALCREDS>.

source: Defined as B<PTRACE_MODE_ATTACH | PTRACE_MODE_FSCREDS>.
ru: Определён как B<PTRACE_MODE_ATTACH | PTRACE_MODE_FSCREDS>.

source: Defined as B<PTRACE_MODE_ATTACH | PTRACE_MODE_REALCREDS>.
ru: Определён как B<PTRACE_MODE_ATTACH | PTRACE_MODE_REALCREDS>.

source: One further modifier can be ORed with the access mode:
ru: Один из следующих модификаторов может быть объединённых с режимом доступа:

source: B<PTRACE_MODE_NOAUDIT> (since Linux 3.3)
ru: B<PTRACE_MODE_NOAUDIT> (начиная с Linux 3.3)

source: Don't audit this access mode check. This modifier is employed for ptrace access mode checks (such as checks when reading I</proc/[pid]/stat>) that merely cause the output to be filtered or sanitized, rather than causing an error to be returned to the caller. In these cases, accessing the file is not a security violation and there is no reason to generate a security audit record. This modifier suppresses the generation of such an audit record for the particular access check.
ru: Не протоколировать (audit) проверку режима доступа. Данный модификатор применяется для проверок режима доступа ptrace (например, проверки при чтении I</proc/[pid]/stat>), которые просто фильтруют или цензурируют вывод, вместо возврата ошибки вызывающему. В этих случаях, доступ к файлу не нарушает правила безопасности и нет причины генерировать запись о нарушении. Данный модификатор отключает создание подобных протокольных записей для определённых проверок доступа.

source: Note that all of the B<PTRACE_MODE_*> constants described in this subsection are kernel-internal, and not visible to user space. The constant names are mentioned here in order to label the various kinds of ptrace access mode checks that are performed for various system calls and accesses to various pseudofiles (e.g., under I</proc>). These names are used in other manual pages to provide a simple shorthand for labeling the different kernel checks.
ru: Заметим, что все константы B<PTRACE_MODE_*>, описанные в данном разделе, доступны только для ядра и не видны из пользовательского пространства. Имена упомянутых констант служат обозначением различных видов проверок режима доступа ptrace, которые выполняются для разных системных вызовов и получении доступа к разным псевдо-файлам (например, в каталоге I</proc>). Эти имена используются в других справочных страницах как простые сокращения различных проверок ядра.

source: The algorithm employed for ptrace access mode checking determines whether the calling process is allowed to perform the corresponding action on the target process. (In the case of opening I</proc/[pid]> files, the "calling process" is the one opening the file, and the process with the corresponding PID is the "target process".) The algorithm is as follows:
ru: Задействуемый алгоритм проверок режима доступа ptrace определяется по разрешению вызывающему процессу выполнять соответствующее действие над процессом назначения (в случае открытия файлов I</proc/[pid]> «вызывающий процесс» это открывающий файл, а процесс с соответствующим PID — «процесс назначения»). Возможные алгоритмы:

source: If the calling thread and the target thread are in the same thread group, access is always allowed.
ru: Если вызывающая нить и нить назначения в одной группе нитей, то доступ всегда разрешён.

source: If the access mode specifies B<PTRACE_MODE_FSCREDS>, then, for the check in the next step, employ the caller's filesystem UID and GID. (As noted in B<credentials>(7), the filesystem UID and GID almost always have the same values as the corresponding effective IDs.)
ru: Если режим доступа равен B<PTRACE_MODE_FSCREDS>, то для проверки на следующем шаге используется UID и GID файловой системы у вызывающего (как упомянуто в B<credentials>(7), UID и GID файловой системы почти всегда равны значениям соответствующих эффективных идентификаторов).

source: Otherwise, the access mode specifies B<PTRACE_MODE_REALCREDS>, so use the caller's real UID and GID for the checks in the next step. (Most APIs that check the caller's UID and GID use the effective IDs. For historical reasons, the B<PTRACE_MODE_REALCREDS> check uses the real IDs instead.)
ru: В противном случае режим доступа равен B<PTRACE_MODE_REALCREDS>, и на следующем шаге проверок используются реальные UID и GID вызывающего (большинство программных интерфейсов, которые проверяют UID и GID вызывающего, используют эффективные идентификаторы. В проверке B<PTRACE_MODE_REALCREDS> используются реальные ID только в силу исторических причин).

source: Deny access if I<neither> of the following is true:
ru: Запрещается доступ, если срабатывает I<любое> из этих правил:

source: The real, effective, and saved-set user IDs of the target match the caller's user ID, I<and> the real, effective, and saved-set group IDs of the target match the caller's group ID.
ru: Реальные, эффективные и сохранённые пользовательские ID назначения совпадают с пользовательским ID вызывающего, I<и> Реальные, эффективные и сохранённые групповые ID назначения совпадают с групповым ID вызывающего.

source: The caller has the B<CAP_SYS_PTRACE> capability in the user namespace of the target.
ru: Вызывающий имеет мандат B<CAP_SYS_PTRACE> в пользовательском пространстве имён назначения.

source: Deny access if the target process "dumpable" attribute has a value other than 1 (B<SUID_DUMP_USER>; see the discussion of B<PR_SET_DUMPABLE> in B<prctl>(2)), and the caller does not have the B<CAP_SYS_PTRACE> capability in the user namespace of the target process.
ru: Доступ запрещается, если у процесса назначения значение атрибута «возможности дампа» не равно 1 (B<SUID_DUMP_USER>; смотрите обсуждение B<PR_SET_DUMPABLE> в B<prctl>(2)), и вызывающий не имеет мандата B<CAP_SYS_PTRACE> в пользовательском пространстве имён назначения.

source: The kernel LSM I<security_ptrace_access_check>() interface is invoked to see if ptrace access is permitted. The results depend on the LSM(s). The implementation of this interface in the commoncap LSM performs the following steps:
ru: Для проверки того, что доступ ptrace разрешён, вызывается интерфейс ядра LSM I<security_ptrace_access_check>(). Результат зависит от LSM. Реализация интерфейса в commoncap LSM выполняет следующие шаги:

source: a)
ru: а)

source: If the access mode includes B<PTRACE_MODE_FSCREDS>, then use the caller's I<effective> capability set in the following check; otherwise (the access mode specifies B<PTRACE_MODE_REALCREDS>, so) use the caller's I<permitted> capability set.
ru: Если режим доступа включает B<PTRACE_MODE_FSCREDS>, то используется I<эффективный> набор мандатов вызывающего в последующей проверке; в противном случае (режим доступа равен B<PTRACE_MODE_REALCREDS>) используется I<допускающий> набор мандатов.

source: b)
ru: б)

source: The caller and the target process are in the same user namespace, and the caller's capabilities are a superset of the target process's I<permitted> capabilities.
ru: Вызывающий и процесс назначения находятся в одном пользовательском пространстве имён, и мандаты вызывающего составляют покрывающий набор I<допускающих> мандатов процесса назначения.

source: The caller has the B<CAP_SYS_PTRACE> capability in the target process's user namespace.
ru: Вызывающий имеет мандат B<CAP_SYS_PTRACE> в пользовательском пространстве имён процесса назначения.

source: Note that the commoncap LSM does not distinguish between B<PTRACE_MODE_READ> and B<PTRACE_MODE_ATTACH>.
ru: Заметим, что commoncap LSM не различает B<PTRACE_MODE_READ> и B<PTRACE_MODE_ATTACH>.

source: If access has not been denied by any of the preceding steps, then access is allowed.
ru: Если доступ не был запрещён в предыдущих шагах, то доступ разрешается.

source: On systems with the Yama Linux Security Module (LSM) installed (i.e., the kernel was configured with B<CONFIG_SECURITY_YAMA>), the I</proc/sys/kernel/yama/ptrace_scope> file (available since Linux 3.4) can be used to restrict the ability to trace a process with B<ptrace>() (and thus also the ability to use tools such as B<strace>(1) and B<gdb>(1)). The goal of such restrictions is to prevent attack escalation whereby a compromised process can ptrace-attach to other sensitive processes (e.g., a GPG agent or an SSH session) owned by the user in order to gain additional credentials that may exist in memory and thus expand the scope of the attack.
ru: В системах с установленным модулем Yama Linux Security Module (LSM) (т. е., ядро было настроено с параметром B<CONFIG_SECURITY_YAMA>) можно использовать файл I</proc/sys/kernel/yama/ptrace_scope> (доступен, начиная с Linux 3.4) для того, чтобы огранить возможность трассировки процесса с помощью B<ptrace>() (то есть ограничить использование таких инструментов как B<strace>(1) и B<gdb>(1)). Целью ограничения является предотвращение возможности атаки, посредством которой скомпроментированный процесс подключается через ptrace к другим ответственным процессам (например, к агенту GPG или сеансу SSH), принадлежащим пользователю, чтобы получить дополнительные полномочия (которые могут существовать в памяти) и, таким образом, расширить атакуемое пространство.

source: More precisely, the Yama LSM limits two types of operations:
ru: Более точно, Yama LSM ограничивает два типа операций:

source: Any operation that performs a ptrace access mode B<PTRACE_MODE_ATTACH> check\(emfor example, B<ptrace>() B<PTRACE_ATTACH>. (See the "Ptrace access mode checking" discussion above.)
ru: Все операции, которые выполняют проверку режима доступа ptrace B<PTRACE_MODE_ATTACH>, например, B<ptrace>() B<PTRACE_ATTACH> (смотрите «Проверка режима доступа ptrace» выше).

source: A process that has the B<CAP_SYS_PTRACE> capability can update the I</proc/sys/kernel/yama/ptrace_scope> file with one of the following values:
ru: Процесс, имеющий мандат B<CAP_SYS_PTRACE>, может записать в файл I</proc/sys/kernel/yama/ptrace_scope> одно из следующих значений:

source: 0 ("classic ptrace permissions")
ru: 0 («обычные права ptrace»)

source: No additional restrictions on operations that perform B<PTRACE_MODE_ATTACH> checks (beyond those imposed by the commoncap and other LSMs).
ru: Без дополнительных ограничений на операции, выполняющие проверки B<PTRACE_MODE_ATTACH> (кроме накладываемых commoncap и другими LSM).

source: The use of B<PTRACE_TRACEME> is unchanged.
ru: Использование B<PTRACE_TRACEME> не изменяется.

source: 1 ("restricted ptrace") [default value]
ru: 1 («ограниченный ptrace») [значение по умолчанию]

source: When performing an operation that requires a B<PTRACE_MODE_ATTACH> check, the calling process must either have the B<CAP_SYS_PTRACE> capability in the user namespace of the target process or it must have a predefined relationship with the target process. By default, the predefined relationship is that the target process must be a descendant of the caller.
ru: Когда выполняется операция, требующая проверки B<PTRACE_MODE_ATTACH>, вызывающий процесс должен иметь мандат B<CAP_SYS_PTRACE> в пользовательском пространстве имён процесса назначения или должен иметь предопределённые отношения с процессом назначения. По умолчанию, предопределённые отношения это когда процесс назначения должен быть потомком вызывающего.

source: A target process can employ the B<prctl>(2) B<PR_SET_PTRACER> operation to declare an additional PID that is allowed to perform B<PTRACE_MODE_ATTACH> operations on the target. See the kernel source file I<Documentation/admin-guide/LSM/Yama.rst> (or I<Documentation/security/Yama.txt> before Linux 4.13) for further details.
ru: Процесс назначения может выполнить операцию B<prctl>(2) B<PR_SET_PTRACER> для объявления дополнительного PID, которому разрешено выполнять операции B<PTRACE_MODE_ATTACH> над процессом назначения. Подробности смотрите в файле исходного кода ядра I<Documentation/admin-guide/LSM/Yama.rst> (или I<Documentation/security/Yama.txt> до Linux 4.13).

source: 2 ("admin-only attach")
ru: 2 («только администраторское присоединение»)
