Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: POSIX.1 says that the effect of using I<return>, I<break>, I<continue>, or I<goto> to prematurely leave a block bracketed B<pthread_cleanup_push>() and B<pthread_cleanup_pop>() is undefined. Portable applications should avoid doing this.
ru: В POSIX.1 сказано, что результат использования I<return>, I<break>, I<continue> или I<goto> для преждевременного оставления блока, окружающего B<pthread_cleanup_push>() и B<pthread_cleanup_pop>(), не определён. В переносимых приложениях не нужно так делать.

source: The program below provides a simple example of the use of the functions described in this page. The program creates a thread that executes a loop bracketed by B<pthread_cleanup_push>() and B<pthread_cleanup_pop>(). This loop increments a global variable, I<cnt>, once each second. Depending on what command-line arguments are supplied, the main thread sends the other thread a cancellation request, or sets a global variable that causes the other thread to exit its loop and terminate normally (by doing a I<return>).
ru: Далее показан простой пример использования функций, описанных на этой странице. Программа создаёт нить, которая выполняет цикл обрамлённый B<pthread_cleanup_push>() и B<pthread_cleanup_pop>(). В этом цикле каждую секунду увеличивается глобальная переменная I<cnt>. В зависимости от аргументов командной строки главная нить посылает другой нити запрос на отмену или изменяет глобальную переменную, что заставляет другую нить выйти из цикла и завершить работу (с помощью I<return>).

source: In the following shell session, the main thread sends a cancellation request to the other thread:
ru: В этом сеансе главная нить посылает запрос отмены другой нити:

source: $ B<./a.out> New thread started cnt = 0 cnt = 1 Canceling thread Called clean-up handler Thread was canceled; cnt = 0
ru: $ B<./a.out> Запущена новая нить cnt = 0 cnt = 1 Отменяем нить Вызван очищающий обработчик Нить отменена; cnt = 0

source: From the above, we see that the thread was canceled, and that the cancellation clean-up handler was called and it reset the value of the global variable I<cnt> to 0.
ru: Здесь мы видим, что нить была отменена и что был вызван очищающий обработчик и он сбросил значение глобальной переменной I<cnt> в 0.

source: In the next run, the main program sets a global variable that causes other thread to terminate normally:
ru: В следующем сеансе главная программа изменяет глобальную переменную, что вызывает штатное завершение другой нити:

source: $ B<./a.out x> New thread started cnt = 0 cnt = 1 Thread terminated normally; cnt = 2
ru: $ B<./a.out x> Запущена новая нить cnt = 0 cnt = 1 Нить завершилась штатным образом; cnt = 2

source: From the above, we see that the clean-up handler was not executed (because I<cleanup_pop_arg> was 0), and therefore the value of I<cnt> was not reset.
ru: Здесь мы видим, что очищающий обработчик не вызывался (так как I<cleanup_pop_arg> равно 0), и поэтому значение I<cnt> не сброшено.

source: In the next run, the main program sets a global variable that causes the other thread to terminate normally, and supplies a nonzero value for I<cleanup_pop_arg>:
ru: В следующем сеансе главная программа изменяет глобальную переменную, что вызывает штатное завершение другой нити, передаёт ненулевое значение в I<cleanup_pop_arg>:

source: $ B<./a.out x 1> New thread started cnt = 0 cnt = 1 Called clean-up handler Thread terminated normally; cnt = 0
ru: $ B<./a.out x 1> Запущена новая нить cnt = 0 cnt = 1 Вызван очищающий обработчик Нить завершилась штатным образом; cnt = 0

source: In the above, we see that although the thread was not canceled, the clean-up handler was executed, because the argument given to B<pthread_cleanup_pop>() was nonzero.
ru: Здесь мы видим, что хотя нить не отменена, всё же вызван очищающий обработчик, так как в B<pthread_cleanup_pop>() передан ненулевой аргумент.

source: static void cleanup_handler(void *arg) { printf("Called clean-up handler\en"); cnt = 0; }
ru: static void cleanup_handler(void *arg) { printf("Вызван очищающий обработчик\en"); cnt = 0; }

source: printf("New thread started\en");
ru: printf("Запущена новая нить\en");

source: while (!done) { pthread_testcancel(); /* A cancellation point */ if (curr E<lt> time(NULL)) { curr = time(NULL); printf("cnt = %d\en", cnt); /* A cancellation point */ cnt++; } }
ru: while (!done) { pthread_testcancel(); /* точка отмены */ if (curr E<lt> time(NULL)) { curr = time(NULL); printf("cnt = %d\en", cnt); /* точка отмены */ cnt++; } }

source: sleep(2); /* Allow new thread to run a while */
ru: sleep(2); /* даём время нити запуститься */

source: } else { printf("Canceling thread\en"); s = pthread_cancel(thr); if (s != 0) handle_error_en(s, "pthread_cancel"); }
ru: } else { printf("Отменяем нить\en"); s = pthread_cancel(thr); if (s != 0) handle_error_en(s, "pthread_cancel"); }

source: if (res == PTHREAD_CANCELED) printf("Thread was canceled; cnt = %d\en", cnt); else printf("Thread terminated normally; cnt = %d\en", cnt); exit(EXIT_SUCCESS); }
ru: if (res == PTHREAD_CANCELED) printf("Нить была отменена; cnt = %d\en", cnt); else printf("Нить завершилась штатным образом; cnt = %d\en", cnt); exit(EXIT_SUCCESS); }

source: pthread_equal - compare thread IDs
ru: pthread_equal - сравнивает идентификаторы нитей

source: The B<pthread_equal>() function compares two thread identifiers.
ru: Функция B<pthread_equal>() два идентификатора нитей.

source: If the two thread IDs are equal, B<pthread_equal>() returns a nonzero value; otherwise, it returns 0.
ru: Если два идентификатора нитей одинаковы, то B<pthread_equal>() возвращает ненулевое значение; в противном случае возвращается 0.

source: The B<pthread_equal>() function is necessary because thread IDs should be considered opaque: there is no portable way for applications to directly compare two I<pthread_t> values.
ru: Функция B<pthread_equal>() необходима, так как формат идентификаторов нитей следует считать «чёрным ящиком»: не существует переносимого способа сравнения двух непосредственно значений I<pthread_t> из приложения.

source: psignal, psiginfo - print signal message
ru: psignal, psiginfo - выводит сообщение о сигнале

source: B<psignal>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<psignal>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: I<sys_siglist>: Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<sys_siglist>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE

source: The B<psignal>() function displays a message on I<stderr> consisting of the string I<s>, a colon, a space, a string describing the signal number I<sig>, and a trailing newline. If the string I<s> is NULL or empty, the colon and space are omitted. If I<sig> is invalid, the message displayed will indicate an unknown signal.
ru: Функция B<psignal>() выводит сообщение в I<stderr>, состоящее из строки I<s>, двоеточия, пробела, строки описания номера сигнала I<sig> и конечного символа новой строки. Если строка I<s> равна NULL или пуста, то двоеточие и пробел не выводятся. Если значение I<sig> некорректно, то выводится сообщение о неизвестном сигнале.

source: The B<psiginfo>() function is like B<psignal>(), except that it displays information about the signal described by I<pinfo>, which should point to a valid I<siginfo_t> structure. As well as the signal description, B<psiginfo>() displays information about the origin of the signal, and other information relevant to the signal (e.g., the relevant memory address for hardware-generated signals, the child process ID for B<SIGCHLD>, and the user ID and process ID of the sender, for signals set using B<kill>(2) or B<sigqueue>(3)).
ru: Функция B<psiginfo>() подобна B<psignal>(), но выводит информацию о сигнале, указанном в аргументе I<pinfo>, который должен указывать на корректную структуры I<siginfo_t>. Кроме описания сигнала B<psiginfo>() выводит информацию об источнике сигнала и другую информацию о сигнале (например, соответствующий адрес памяти, в случае аппаратных сигналов, идентификатор процесса-потомка для B<SIGCHLD> и идентификаторы пользователя и процесса отправителя для сигналов, посланных с помощью B<kill>(2) или B<sigqueue>(3)).

source: The array I<sys_siglist> holds the signal description strings indexed by signal number.
ru: В массиве I<sys_siglist> содержатся строки описаний сигналов, упорядоченные по номеру сигнала.

source: The B<psignal>() and B<psiginfo>() functions return no value.
ru: Функции B<psignal>() и B<psiginfo>() ничего не возвращают.

source: The B<psiginfo>() function was added to glibc in version 2.10.
ru: Функция B<psiginfo>() впервые появилась в glibc 2.10.

source: In glibc versions up to 2.12, B<psiginfo>() had the following bugs:
ru: В glibc до версии 2.12, в B<psiginfo>() были следующие дефекты:

source: In some circumstances, a trailing newline is not printed.
ru: При определённых условиях не выводился символ новой строки.

source: Additional details are not displayed for real-time signals.
ru: Для сигналов реального времени не выводилась дополнительная информация.

source: pow, powf, powl - power functions
ru: pow, powf, powl - функции возведения в степень

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions return the value of I<x> raised to the power of I<y>.
ru: Данные функции возвращают значение I<x>, возведённое в степень I<y>.

source: On success, these functions return the value of I<x> to the power of I<y>.
ru: При успешном выполнении данные функции возвращают значение I<x>, возведённое в степень I<y>.

source: If I<x> is a finite value less than 0, and I<y> is a finite noninteger, a domain error occurs, and a NaN is returned.
ru: Если I<x> — конечное значение меньшее 0 и I<y> — конечное не целое, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If the result overflows, a range error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively, with the mathematically correct sign.
ru: Если происходит переполнение результата, возникает ошибка диапазона, а функция возвращает B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, соответственно, с математически правильным знаком.

source: If result underflows, and is not representable, a range error occurs, and 0.0 is returned.
ru: Если в результате исчерпана степень числа и оно не представимо, то возникает ошибка диапазона и возвращается 0.0.

source: Except as specified below, if I<x> or I<y> is a NaN, the result is a NaN.
ru: За исключениями, указанными далее, если значение I<x> или I<y> равно NaN, то результат равен NaN.

source: If I<x> is +1, the result is 1.0 (even if I<y> is a NaN).
ru: Если I<x> равно +1, то результат равен 1.0 (даже если I<y> равно NaN).

source: If I<y> is 0, the result is 1.0 (even if I<x> is a NaN).
ru: Если I<y> равно 0, то результат равен 1.0 (даже если I<x> равно NaN).

source: If I<x> is +0 (-0), and I<y> is an odd integer greater than 0, the result is +0 (-0).
ru: Если I<x> равно +0 (-0) и I<y> — нечётное целое большее 0, то результат равен +0 (-0).

source: If I<x> is 0, and I<y> greater than 0 and not an odd integer, the result is +0.
ru: Если I<x> равно 0 и I<y> больше 0 и не чётное целое, то результат равен +0.

source: If I<x> is -1, and I<y> is positive infinity or negative infinity, the result is 1.0.
ru: Если I<x> равно -1 и I<y> стремится к плюс или минус бесконечности, то результат равен 1.0.

source: If the absolute value of I<x> is less than 1, and I<y> is negative infinity, the result is positive infinity.
ru: Если абсолютное значение I<x> меньше 1 и I<y> стремится к минус бесконечности, то результат стремится к плюс бесконечности.

source: If the absolute value of I<x> is greater than 1, and I<y> is negative infinity, the result is +0.
ru: Если абсолютное значение I<x> больше 1 и I<y> стремится к минус бесконечности, то результат равен +0.

source: If the absolute value of I<x> is less than 1, and I<y> is positive infinity, the result is +0.
ru: Если абсолютное значение I<x> меньше 1 и I<y> стремится к плюс бесконечности, то результат равен +0.

source: If the absolute value of I<x> is greater than 1, and I<y> is positive infinity, the result is positive infinity.
ru: Если абсолютное значение I<x> больше 1 и I<y> стремится к плюс бесконечности, то результат стремится к плюс бесконечности.

source: If I<x> is negative infinity, and I<y> is an odd integer less than 0, the result is -0.
ru: Если I<x> стремится к минус бесконечности и I<y> — нечётное целое меньшее 0, то результат равен -0.

source: If I<x> is negative infinity, and I<y> less than 0 and not an odd integer, the result is +0.
ru: Если I<x> стремится к минус бесконечности и I<y> — меньше 0 и чётное целое, то результат равен +0.

source: If I<x> is negative infinity, and I<y> is an odd integer greater than 0, the result is negative infinity.
ru: Если I<x> стремится к минус бесконечности и I<y> — нечётное целое большее 0, то результат стремится к минус бесконечности.

source: If I<x> is negative infinity, and I<y> greater than 0 and not an odd integer, the result is positive infinity.
ru: Если I<x> стремится к минус бесконечности и I<y> — больше 0 и чётное целое, то результат стремится к плюс бесконечности.

source: If I<x> is positive infinity, and I<y> less than 0, the result is +0.
ru: Если I<x> стремится к плюс бесконечности и I<y> — меньше 0, то результат равен +0.

source: If I<x> is positive infinity, and I<y> greater than 0, the result is positive infinity.
ru: Если I<x> стремится к плюс бесконечности и I<y> — больше 0, то результат стремится к плюс бесконечности.

source: If I<x> is +0 or -0, and I<y> is an odd integer less than 0, a pole error occurs and B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, is returned, with the same sign as I<x>.
ru: Если I<x> равно +0 или -0 и I<y> — нечётное целое меньшее 0, то генерируется ошибка особой точки и возвращается B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>с тем же знаком что и у I<x>.

source: If I<x> is +0 or -0, and I<y> is less than 0 and not an odd integer, a pole error occurs and +B<HUGE_VAL>, +B<HUGE_VALF>, or +B<HUGE_VALL>, is returned.
ru: Если I<x> равно + или -0 и I<y> — меньше 0 и чётное целое, то генерируется ошибка особой точки и возвращается +B<HUGE_VAL>, +B<HUGE_VALF> или +B<HUGE_VALL>.

source: See B<math_error>(7) for information on how to determine whether an error has occurred when calling these functions.
ru: Смотрите B<math_error>(7), чтобы определить, где возникла ошибка при вызове этих функций.

source: The following errors can occur:
ru: Могут возникать следующие ошибки:

source: Domain error: I<x> is negative, and I<y> is a finite noninteger
ru: Ошибка области: I<x> является отрицательным и I<y> конечное нецелое

source: I<errno> is set to B<EDOM>. An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: I<errno> устанавливается в B<EDOM>. Возникает исключение неправильной плавающей запятой (B<FE_INVALID>).

source: Pole error: I<x> is zero, and I<y> is negative
ru: Ошибка особой точки: I<x> равно нулю и I<y> отрицательно

source: I<errno> is set to B<ERANGE> (but see BUGS). A divide-by-zero floating-point exception (B<FE_DIVBYZERO>) is raised.
ru: I<errno> устанавливается в B<ERANGE> (но смотрите ДЕФЕКТЫ). Возникает исключение деления плавающей запятой на ноль (B<FE_DIVBYZERO>).

source: Range error: the result overflows
ru: Ошибка диапазона: результат превысил разрядность

source: I<errno> is set to B<ERANGE>. An overflow floating-point exception (B<FE_OVERFLOW>) is raised.
ru: Значение I<errno> устанавливается в B<ERANGE>. Возникает исключение переполнения плавающей запятой (B<FE_OVERFLOW>).

source: Range error: the result underflows
ru: Ошибка диапазона: результат исчерпал степень

source: I<errno> is set to B<ERANGE>. An underflow floating-point exception (B<FE_UNDERFLOW>) is raised.
ru: Значение I<errno> устанавливается в B<ERANGE>. Возникает исключение исчерпания степени чисел с плавающей запятой (B<FE_UNDERFLOW>).

source: The variant returning I<double> also conforms to SVr4, 4.3BSD, C89.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD, C89.

source: On 64-bits, B<pow>() may be more than 10,000 times slower for some (rare) inputs than for other nearby inputs. This affects only B<pow>(), and not B<powf>() nor B<powl>().
ru: На 64-битных архитектурах B<pow>() может быть медленнее более чем в 10000 раз для некоторых значений (очень редких). Это происходит только с B<pow>(), и отсутствует у B<powf>() и B<powl>().

source: In glibc 2.9 and earlier, when a pole error occurs, I<errno> is set to B<EDOM> instead of the POSIX-mandated B<ERANGE>. Since version 2.10, glibc does the right thing.
ru: В glibc 2.9 и ранее при возникновении ошибки особой точки, значению I<errno> присваивается B<EDOM> вместо B<ERANGE> согласно POSIX. Начиная с версии 2.10, в glibc это исправлено.

source: If I<x> is negative, then large negative or positive I<y> values yield a NaN as the function result, with I<errno> set to B<EDOM>, and an invalid (B<FE_INVALID>) floating-point exception. For example, with B<pow>(), one sees this behavior when the absolute value of I<y> is greater than about 9.223373e18.
ru: Если I<x> отрицательно, то большие отрицательные или положительные значения I<y> приводят к результату NaN, с присвоением I<errno> значения B<EDOM> или исключению неправильной плавающей запятой (B<FE_INVALID>). Например для B<pow>() такое случает когда абсолютное значение I<y> больше 9.223373e18.

source: In version 2.3.2 and earlier, when an overflow or underflow error occurs, glibc's B<pow>() generates a bogus invalid floating-point exception (B<FE_INVALID>) in addition to the overflow or underflow exception.
ru: В glibc версии 2.3.2 или старее при возникновении ошибки переполнения или исчерпания, функция B<pow>() в дополнение к исключениям переполнения и исчерпания генерирует необоснованное исключение неправильной плавающей запятой (B<FE_INVALID>)

source: pthread_attr_setstacksize, pthread_attr_getstacksize - set/get stack size attribute in thread attributes object
ru: pthread_attr_setstacksize, pthread_attr_getstacksize - изменяет/возвращает атрибут размера стека у объекта атрибутов нити

source: The B<pthread_attr_setstacksize>() function sets the stack size attribute of the thread attributes object referred to by I<attr> to the value specified in I<stacksize>.
ru: Функция B<pthread_attr_setstacksize>() изменяет атрибут размера стека у объекта атрибутов нити, на который указывает I<attr>, в значение I<stacksize>.

source: The stack size attribute determines the minimum size (in bytes) that will be allocated for threads created using the thread attributes object I<attr>.
ru: Атрибутом размера стека определяется минимальный размер (в байтах), который будет выделен для нитей, созданных с учётом объекта атрибутов нити I<attr>.

source: The B<pthread_attr_getstacksize>() function returns the stack size attribute of the thread attributes object referred to by I<attr> in the buffer pointed to by I<stacksize>.
ru: Функция B<pthread_attr_getstacksize>() возвращает атрибут размера стека у объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<stacksize>.

source: B<pthread_attr_setstacksize>() can fail with the following error:
ru: Функция B<pthread_attr_setstacksize>() может завершиться со следующей ошибкой:

source: The stack size is less than B<PTHREAD_STACK_MIN> (16384) bytes.
ru: Размер стека меньше B<PTHREAD_STACK_MIN> (16384) байт.

source: On some systems, B<pthread_attr_setstacksize>() can fail with the error B<EINVAL> if I<stacksize> is not a multiple of the system page size.
ru: В некоторых системах B<pthread_attr_setstacksize>() может завершиться ошибкой B<EINVAL>, если значение I<stacksize> не кратно размеру системной страницы.

source: These functions are provided by glibc since version 2.1.
ru: Эти функции доступны в glibc начиная с версии 2.1.

source: For details on the default stack size of new threads, see B<pthread_create>(3).
ru: Подробную информацию о размере стека по умолчанию для новых нитей смотрите в B<pthread_create>(3).

source: A thread's stack size is fixed at the time of thread creation. Only the main thread can dynamically grow its stack.
ru: Размер стека нити не изменяется во время создания нити. Только главная нить может динамически увеличивать свой стек.

source: The B<pthread_attr_setstack>(3) function allows an application to set both the size and location of a caller-allocated stack that is to be used by a thread.
ru: Функция B<pthread_attr_setstack>(3) позволяет приложению изменять размер и положение стека вызывающего, который будет использован нитью.

source: As at glibc 2.8, if the specified I<stacksize> is not a multiple of B<STACK_ALIGN> (16 bytes on most architectures), it may be rounded I<downward>, in violation of POSIX.1, which says that the allocated stack will be at least I<stacksize> bytes.
ru: Как указано в glibc 2.8, если указанное значение I<stacksize> не кратно B<STACK_ALIGN> (для большинства архитектур 16 байт), то оно может быть округлено I<в меньшую сторону>, нарушая при этом POSIX.1, где говорится, что выделенный стек должен быть не менее I<stacksize> байт.

source: See B<pthread_create>(3).
ru: Смотрите B<pthread_create>(3).

source: pthread_atfork - register fork handlers
ru: pthread_atfork - регистрирует обработчики ветвления

source: Link with I<-pthread>.
ru: Компонуется при указании параметра I<-pthread>.

source: The B<pthread_atfork>() function registers fork handlers that are to be executed when B<fork>(2) is called by this thread. The handlers are executed in the context of the thread that calls B<fork>(2).
ru: Функция B<pthread_atfork>() регистрирует обработчик ветвления, которые будут запускаться при вызове B<fork>(2) этой нитью. Обработчики запускаются в контексте нити, которая вызвала B<fork>(2).

source: Three kinds of handler can be registered:
ru: Можно регистрировать три типа обработчиков:

source: I<prepare> specifies a handler that is executed before B<fork>(2) processing starts.
ru: Типом I<prepare> задаётся обработчик, который выполняется од начала работы B<fork>(2).

source: I<parent> specifies a handler that is executed in the parent process after B<fork>(2) processing completes.
ru: Типом I<parent> задаётся обработчик, который выполняется в родительском процессе после завершения работы B<fork>(2).

source: I<child> specifies a handler that is executed in the child process after B<fork>(2) processing completes.
ru: Типом I<child> задаётся обработчик, который выполняется в потомке после завершения работы B<fork>(2).

source: Any of the three arguments may be NULL if no handler is needed in the corresponding phase of B<fork>(2) processing.
ru: Любой из трёх аргументов может быть равен NULL, если обработчик не требуется на соответствующем шаге работы B<fork>(2).
