Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The five flag characters above are defined in the C99 standard. The Single UNIX Specification specifies one further flag character.
ru: Пять флагов, описанных выше, определены в стандарте C99. В стандарте Single UNIX Specification определён ещё один дополнительный флаг.

source: For decimal conversion (B<i>, B<d>, B<u>, B<f>, B<F>, B<g>, B<G>) the output is to be grouped with thousands' grouping characters if the locale information indicates any. (See B<setlocale>(3).) Note that many versions of B<gcc>(1) cannot parse this option and will issue a warning. (SUSv2 did not include I<%\(aqF>, but SUSv3 added it.)
ru: При десятичных преобразованиях (B<i>, B<d>, B<u>, B<f>, B<F>, B<g>, B<G>) результат группируется символом разделителя тысяч, если информация локализации указывает на это (смотрите B<setlocale>(3)). Заметим, что многие версии B<gcc>(1) не могут распознать этот флаг и выводят соответствующее предупреждение (SUSv2 не содержи I<%\(aqF>, но в SUSv3 его добавили).

source: glibc 2.2 adds one further flag character.
ru: В glibc 2.2 добавлен ещё один флаг.

source: For decimal integer conversion (B<i>, B<d>, B<u>) the output uses the locale's alternative output digits, if any. For example, since glibc 2.2.3 this will give Arabic-Indic digits in the Persian ("fa_IR") locale.
ru: При преобразовании целых десятичных чисел (B<i>, B<d>, B<u>) в результате используется альтернативное представление цифр согласно локали. Например, начиная с glibc 2.2.3 это даёт арабско-индийские цифры для персидской локали («fa_IR»).

source: Field width
ru: Ширина поля

source: An optional decimal digit string (with nonzero first digit) specifying a minimum field width. If the converted value has fewer characters than the field width, it will be padded with spaces on the left (or right, if the left-adjustment flag has been given). Instead of a decimal digit string one may write "*" or "*m$" (for some decimal integer I<m>) to specify that the field width is given in the next argument, or in the I<m>-th argument, respectively, which must be of type I<int>. A negative field width is taken as a \(aq-\(aq flag followed by a positive field width. In no case does a nonexistent or small field width cause truncation of a field; if the result of a conversion is wider than the field width, the field is expanded to contain the conversion result.
ru: Необязательная строка из десятичных цифр (с первой цифрой, отличной от нуля) определяет минимальную ширину поля. Если преобразованное значение имеет меньшее количество знаков, чем ширина поля, то оно слева дополняется пробелами (или справа, если указан флаг выравнивания по левому краю). Вместо строки десятичных цифр можно указать «*» или «*m$» (для некоторого десятичного числа I<m>), чтобы определить ширину поля по ширине следующего аргумента или аргумента с номером I<m> (должен быть типа I<int>), соответственно. Отрицательная ширина поля принимается как флаг «-», устанавливающий положительную ширину поля. Несуществующая или небольшая ширина поля не делает его усечённым; если результат преобразования больше ширины поля, то поле расширяется, чтобы вместить в себя преобразованное значение.

source: Precision
ru: Точность

source: An optional precision, in the form of a period (\(aq.\(aq) followed by an optional decimal digit string. Instead of a decimal digit string one may write "*" or "*m$" (for some decimal integer I<m>) to specify that the precision is given in the next argument, or in the I<m>-th argument, respectively, which must be of type I<int>. If the precision is given as just \(aq.\(aq, the precision is taken to be zero. A negative precision is taken as if the precision were omitted. This gives the minimum number of digits to appear for B<d>, B<i>, B<o>, B<u>, B<x>, and B<X> conversions, the number of digits to appear after the radix character for B<a>, B<A>, B<e>, B<E>, B<f>, and B<F> conversions, the maximum number of significant digits for B<g> and B<G> conversions, or the maximum number of characters to be printed from a string for B<s> and B<S> conversions.
ru: Необязательный параметр точности в виде знака точки («.») сопровождается необязательной строкой десятичных цифр. Вместо строки десятичных цифр можно указать «*» или «*m$» (для некоторого десятичного числа I<m>), чтобы определить значение точности по следующему аргументу или аргументу с номером I<m> (должен быть типа I<int>), соответственно. Если точность указана как «.», то она обрабатывается как нулевая. Отрицательная точность обрабатывается как если не указывалась совсем. Это позволяет ограничивать количество выводимых символов для преобразований B<d>, B<i>, B<o>, B<u>, B<x> и B<X>; показывать определённое количество цифр после десятичной точки для преобразований B<a>, B<A>, B<e>, B<E>, B<f> и B<F>; показывать максимальное количество значащих цифр для преобразований B<g> и B<G> или максимальное количество символов для печати строк при преобразованиях B<s> и B<S>.

source: Length modifier
ru: Модификатор длины

source: Here, "integer conversion" stands for B<d>, B<i>, B<o>, B<u>, B<x>, or B<X> conversion.
ru: Устанавливаются для следующих «преобразований целого» B<d>, B<i>, B<o>, B<u>, B<x> или B<X>.

source: A following integer conversion corresponds to a I<signed char> or I<unsigned char> argument, or a following B<n> conversion corresponds to a pointer to a I<signed char> argument.
ru: Преобразование целого числа соответствует аргументам I<signed char> или I<unsigned char>, а также тип преобразования B<n> соответствует указателю на аргумент I<signed char>.

source: A following integer conversion corresponds to a I<short int> or I<unsigned short int> argument, or a following B<n> conversion corresponds to a pointer to a I<short int> argument.
ru: Преобразование целого числа соответствует аргументам I<short int> или I<unsigned short int>, а также тип преобразования B<n> соответствует указателю на аргумент I<short int>.

source: (ell) A following integer conversion corresponds to a I<long int> or I<unsigned long int> argument, or a following B<n> conversion corresponds to a pointer to a I<long int> argument, or a following B<c> conversion corresponds to a I<wint_t> argument, or a following B<s> conversion corresponds to a pointer to I<wchar_t> argument.
ru: (эль) Преобразование целого числа соответствует аргументам I<long int> или I<unsigned long int>; тип преобразования B<n> соответствует указателю на аргумент I<long int>; тип преобразования B<c> соответствует аргументу I<wint_t>; тип преобразования B<s> соответствует указателю на аргумент I<wchar_t>.

source: (ell-ell). A following integer conversion corresponds to a I<long long int> or I<unsigned long long int> argument, or a following B<n> conversion corresponds to a pointer to a I<long long int> argument.
ru: (эль-эль) Преобразование целого числа соответствует аргументам I<long long int> или I<unsigned long long int>, а также тип преобразования B<n> соответствует указателю на аргумент I<long long int>.

source: A synonym for B<ll>. This is a nonstandard extension, derived from BSD; avoid its use in new code.
ru: Синоним B<ll>. Является нестандартным расширением, унаследовано от BSD; не используйте в новом коде.

source: A following B<a>, B<A>, B<e>, B<E>, B<f>, B<F>, B<g>, or B<G> conversion corresponds to a I<long double> argument. (C99 allows %LF, but SUSv2 does not.)
ru: Типы преобразования B<a>, B<A>, B<e>, B<E>, B<f>, B<F>, B<g> или B<G> соответствуют аргументу I<long double> (в C99 допускается %LF, но в SUSv2 нет).

source: A following integer conversion corresponds to an I<intmax_t> or I<uintmax_t> argument, or a following B<n> conversion corresponds to a pointer to an I<intmax_t> argument.
ru: Преобразование целого числа соответствует аргументам I<intmax_t> или I<uintmax_t>, а также тип преобразования B<n> соответствует указателю на аргумент I<intmax_t>.

source: A following integer conversion corresponds to a I<size_t> or I<ssize_t> argument, or a following B<n> conversion corresponds to a pointer to a I<size_t> argument.
ru: Преобразование целого числа соответствует аргументам I<size_t> или I<ssize_t>, а также тип преобразования B<n> соответствует указателю на аргумент I<size_t>.

source: A nonstandard synonym for B<z> that predates the appearance of B<z>. Do not use in new code.
ru: Нестандартный синоним B<z>, который появился до B<z>. Не используйте в новом коде.

source: A following integer conversion corresponds to a I<ptrdiff_t> argument, or a following B<n> conversion corresponds to a pointer to a I<ptrdiff_t> argument.
ru: Преобразование целого числа соответствует аргументам I<ptrdiff_t> или тип преобразования B<n> соответствует указателю на аргумент I<ptrdiff_t>.

source: SUSv3 specifies all of the above, except for those modifiers explicitly noted as being nonstandard extensions. SUSv2 specified only the length modifiers B<h> (in B<hd>, B<hi>, B<ho>, B<hx>, B<hX>, B<hn>) and B<l> (in B<ld>, B<li>, B<lo>, B<lx>, B<lX>, B<ln>, B<lc>, B<ls>) and B<L> (in B<Le>, B<LE>, B<Lf>, B<Lg>, B<LG>).
ru: В SUSv3 определено всё вышеперечисленное, за исключением указанных как нестандартное расширение. В SUSv2 определены только модификаторы длины B<h> (в B<hd>, B<hi>, B<ho>, B<hx>, B<hX>, B<hn>) и B<l> (в B<ld>, B<li>, B<lo>, B<lx>, B<lX>, B<ln>, B<lc>, B<ls>) и B<L> (в B<Le>, B<LE>, B<Lf>, B<Lg>, B<LG>).

source: As a nonstandard extension, the GNU implementations treats B<ll> and B<L> as synonyms, so that one can, for example, write B<llg> (as a synonym for the standards-compliant LgB<)> and B<Ld> (as a synonym for the standards compliant B<lld>). Such usage is nonportable.
ru: Не по стандарту реализации GNU считают B<ll> и B<L> синонимами, поэтому, например, можно написать B<llg> (синоним стандартного LgB<)> и B<Ld> (синоним стандартного B<lld>). Такое использование не переносимо.

source: Conversion specifiers
ru: Тип преобразования

source: A character that specifies the type of conversion to be applied. The conversion specifiers and their meanings are:
ru: Символы, которые определены как типы преобразования. Типы преобразования и их значения:

source: The I<int> argument is converted to signed decimal notation. The precision, if any, gives the minimum number of digits that must appear; if the converted value requires fewer digits, it is padded on the left with zeros. The default precision is 1. When 0 is printed with an explicit precision 0, the output is empty.
ru: Параметр I<int> преобразует символы в их знаковое десятичное отображение. Точность (если указана) задаёт минимальное количество цифр в изображении результата; если результат можно показать с помощью меньшего количества цифр, то слева добавляются незначащие нули. По умолчанию значение точности равно единице. При выводе нуля с нулевой точностью выходной поток будет пуст.

source: The I<unsigned int> argument is converted to unsigned octal (B<o>), unsigned decimal (B<u>), or unsigned hexadecimal (B<x> and B<X>) notation. The letters B<abcdef> are used for B<x> conversions; the letters B<ABCDEF> are used for B<X> conversions. The precision, if any, gives the minimum number of digits that must appear; if the converted value requires fewer digits, it is padded on the left with zeros. The default precision is 1. When 0 is printed with an explicit precision 0, the output is empty.
ru: Параметр I<unsigned int> преобразуется в беззнаковое восьмеричное число (B<o>), беззнаковое десятичное (B<u>) или беззнаковое шестнадцатеричное (B<x> и B<X>). Буквы B<abcdef> используются в преобразованиях B<x>; буквы B<ABCDEF> используются в преобразованиях B<X>. Точность (если указана) задаёт минимальное количество цифр в изображении результата; если результат можно показать с помощью меньшего количества цифр, то слева добавляются незначащие нули. По умолчанию значение точности равно единице. При выводе нуля с нулевой точностью выходной поток будет пуст.

source: The I<double> argument is rounded and converted in the style [-]dB<\&.>dddB<e>\(+-dd where there is one digit (which is nonzero if the argument is nonzero) before the decimal-point character and the number of digits after it is equal to the precision; if the precision is missing, it is taken as 6; if the precision is zero, no decimal-point character appears. An B<E> conversion uses the letter B<E> (rather than B<e>) to introduce the exponent. The exponent always contains at least two digits; if the value is zero, the exponent is 00.
ru: Параметр I<double> округляется и преобразуется в вид [-]dB<\&.>dddB<e>\(+-dd, в котором есть одна цифра (не равная нулю, если аргумент не равен нулю) до символа десятичной точки и количество цифр после, указывающих на требуемую точность. Если точность отсутствует, она принимается равной 6; если точность равна нулю, десятичная точка не показывается. В преобразовании для представление экспоненты B<E> используется буква B<E> (а не B<e>). В экспоненте всегда не менее двух цифр; если значение ноль, то экспонента выводится как 00.

source: The I<double> argument is rounded and converted to decimal notation in the style [-]dddB<\&.>ddd, where the number of digits after the decimal-point character is equal to the precision specification. If the precision is missing, it is taken as 6; if the precision is explicitly zero, no decimal-point character appears. If a decimal point appears, at least one digit appears before it.
ru: Параметр I<double> округляется и преобразуется в десятичное выражение в виде [-]dddB<\&.>ddd, где количество цифр после десятичной точки указывает на требуемую точность. Если точность отсутствует, она принимается равной 6-и; если точность равна нулю, десятичная точка не показывается. Если десятичная точка есть, перед ней должна быть минимум одна цифра

source: (SUSv2 does not know about B<F> and says that character string representations for infinity and NaN may be made available. SUSv3 adds a specification for B<F>. The C99 standard specifies "[-]inf" or "[-]infinity" for infinity, and a string starting with "nan" for NaN, in the case of B<f> conversion, and "[-]INF" or "[-]INFINITY" or "NAN" in the case of B<F> conversion.)
ru: (в SUSv2 отсутствует информация о B<F> и указано, что этот символ предназначен для отображения символов бесконечности и NaN. В SUSv3 добавлен тип B<F>. В стандарте C99 определены «[-]inf» или «[-]infinity» для указания бесконечности, и строка начинающаяся с «nan» для NaN в случае, если тип преобразования равен B<f>, а начинающаяся с «[-]INF», «[-]INFINITY» или «NAN» в случае, если тип преобразования равен B<F>).

source: The I<double> argument is converted in style B<f> or B<e> (or B<F> or B<E> for B<G> conversions). The precision specifies the number of significant digits. If the precision is missing, 6 digits are given; if the precision is zero, it is treated as 1. Style B<e> is used if the exponent from its conversion is less than -4 or greater than or equal to the precision. Trailing zeros are removed from the fractional part of the result; a decimal point appears only if it is followed by at least one digit.
ru: Параметр I<double> преобразуется в стиле B<f> или B<e> (или B<F> или B<E>, для преобразования B<G>). Точность определяется количеством значащих цифр. Если точность отсутствует, то она определяется равной 6-и цифрам; если точность равна нулю, то она трактуется как 1. Стиль B<e> используется, если экспонента преобразования меньше -4, или больше или равна ей. Завершающие нули удаляются из дробной части результата; десятичная точка стоит, только если за ней следует, по крайней мере, одна цифра.

source: (C99; not in SUSv2, but added in SUSv3) For B<a> conversion, the I<double> argument is converted to hexadecimal notation (using the letters abcdef) in the style [-]B<0x>hB<\&.>hhhhB<p>\(+-; for B<A> conversion the prefix B<0X>, the letters ABCDEF, and the exponent separator B<P> is used. There is one hexadecimal digit before the decimal point, and the number of digits after it is equal to the precision. The default precision suffices for an exact representation of the value if an exact representation in base 2 exists and otherwise is sufficiently large to distinguish values of type I<double>. The digit before the decimal point is unspecified for nonnormalized numbers, and nonzero but otherwise unspecified for normalized numbers.
ru: (C99; отсутствует в SUSv2, до добавлено в SUSv3) Для преобразования типа B<a> параметр I<double> отображается в шестнадцатеричной форме (с помощью букв abcdef) вида [-]B<0x>hB<\&.>hhhhB<p>\(+-; для преобразований типа B<A> используется префикс B<0X>, буквы ABCDEF и и разделитель экспоненты B<P>. Точность равна шестнадцатеричному разряду перед десятичной точкой и количеству цифр после неё. По умолчанию точность принимается равной точному значению разряда, если оно соответствует ему по основанию 2, и в противном случае размер её является достаточным для определения значения типа I<double>. Разряд перед десятичной точкой не определён для ненормализованных чисел и не равен нулю, но не определён для нормализованных чисел.

source: If no B<l> modifier is present, the I<int> argument is converted to an I<unsigned char>, and the resulting character is written. If an B<l> modifier is present, the I<wint_t> (wide character) argument is converted to a multibyte sequence by a call to the B<wcrtomb>(3) function, with a conversion state starting in the initial state, and the resulting multibyte string is written.
ru: Если модификатор B<l> не указан, то параметр I<int> преобразуется в I<unsigned char> и выводится как результирующее значение. Если B<l> указан, то параметр I<wint_t> (широкий символ) преобразуется в многобайтовую последовательность вызовом функции B<wcrtomb>(3); первое его значение преобразуется в начальное значение и выводится в виде многобайтовой строки.

source: If no B<l> modifier is present: the I<const char\ *> argument is expected to be a pointer to an array of character type (pointer to a string). Characters from the array are written up to (but not including) a terminating null byte (\(aq\e0\(aq); if a precision is specified, no more than the number specified are written. If a precision is given, no null byte need be present; if the precision is not specified, or is greater than the size of the array, the array must contain a terminating null byte.
ru: Если модификатор B<l> не указан: параметр I<const char\ *> преобразуется в указатель на массив символьного типа (строковый указатель). Символы из массива выводятся до конечного байта null (\(aq\e0\(aq, не включая его); если указана точность, то выводится не более установленного количества символов. Если точность указана, то байт null не нужен. Если точность не указана или она больше, чем размер массива, то массив должен содержать конечный байт null.

source: If an B<l> modifier is present: the I<const wchar_t\ *> argument is expected to be a pointer to an array of wide characters. Wide characters from the array are converted to multibyte characters (each by a call to the B<wcrtomb>(3) function, with a conversion state starting in the initial state before the first wide character), up to and including a terminating null wide character. The resulting multibyte characters are written up to (but not including) the terminating null byte. If a precision is specified, no more bytes than the number specified are written, but no partial multibyte characters are written. Note that the precision determines the number of I<bytes> written, not the number of I<wide characters> or I<screen positions>. The array must contain a terminating null wide character, unless a precision is given and it is so small that the number of bytes written exceeds it before the end of the array is reached.
ru: Если модификатор B<l> указан: параметр I<const wchar_t\ *> должен быть указателем на массив широких символов. Широкие символы из массива преобразуются в многобайтовые символы (каждый вызовом функции B<wcrtomb>(3), при этом первое значение преобразуется в начальное значение первого широкого символа) и так до конечного широкого символа null. Результирующие многобайтовые символы выводятся до конечного байта null (не включая его). Если указана точность, то выводится количество байтов, не превышающее это значение, а оставшаяся часть многобайтовых символов не выводится. Заметим, что точность определяется количеством выведенных I<байт>, не I<широких символов> или I<положением на экране>. Массив должен содержать конечный широкий символ null, если точность не указана, и содержать количество байт, меньше размера массива.

source: (Not in C99 or C11, but in SUSv2, SUSv3, and SUSv4.) Synonym for B<lc>. Don't use.
ru: (отсутствует в C99 или C11, но есть в SUSv2, SUSv3 и SUSv4) Синоним B<lc>. Не используйте.

source: (Not in C99 or C11, but in SUSv2, SUSv3, and SUSv4.) Synonym for B<ls>. Don't use.
ru: (отсутствует в C99 или C11, но есть в SUSv2, SUSv3 и SUSv4) Синоним B<ls>. Не используйте.

source: The I<void\ *> pointer argument is printed in hexadecimal (as if by B<%#x> or B<%#lx>).
ru: Параметр указателя I<void\ *>, выводящийся в шестнадцатеричном виде (также как при B<%#x> или B<%#lx>).

source: The number of characters written so far is stored into the integer pointed to by the corresponding argument. That argument shall be an I<int\ *>, or variant whose size matches the (optionally) supplied integer length modifier. No argument is converted. (This specifier is not supported by the bionic C library.) The behavior is undefined if the conversion specification includes any flags, a field width, or a precision.
ru: Количество символов, выводящихся в целом типе int * (или других) без преобразующих параметров. Данный параметр должен быть I<int\ *> или его вариантом, размер которого совпадает с (необязательно) указываемым целым модификатором длины. Параметр не преобразуется (данный тип не поддерживается библиотекой bionic C). Поведение не определено, если тип преобразования содержит флаги, ширину поля или точность.

source: (Glibc extension; supported by uClibc and musl.) Print output of I<strerror(errno)>. No argument is required.
ru: (расширение glibc; поддерживается uClibc и musl) Выводит содержимое I<strerror(errno)>. Параметр не требуется.

source: A \(aq%\(aq is written. No argument is converted. The complete conversion specification is \(aq%%\(aq.
ru: Выводит символ \(aq%\(aq. Параметр не требуется. Полный спецификатор преобразования — \(aq%%\(aq.

source: Upon successful return, these functions return the number of characters printed (excluding the null byte used to end output to strings).
ru: При успешном выполнении данные функции возвращают количество напечатанных символов (не включая байт null, используемый в конце выводимых строк).

source: The functions B<snprintf>() and B<vsnprintf>() do not write more than I<size> bytes (including the terminating null byte (\(aq\e0\(aq)). If the output was truncated due to this limit, then the return value is the number of characters (excluding the terminating null byte) which would have been written to the final string if enough space had been available. Thus, a return value of I<size> or more means that the output was truncated. (See also below under NOTES.)
ru: Функции B<snprintf>() и B<vsnprintf>() записывают не более I<size> байт (включая конечный байт null (\(aq\e0\(aq)). Если вывод был обрезан из-за данного ограничения, то возвращаемое значение это количество символов (не включая конечный байт null), которое было бы записано в результирующую строку, если бы было достаточно места. Таким образом, если возвращённое значение больше или равно I<size>, то вывод был обрезан (также смотрите ЗАМЕЧАНИЯ ниже).

source: If an output error is encountered, a negative value is returned.
ru: Если возникла ошибка, то возвращается отрицательное значение.
