Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: In SELinux, this file is used to get the security context of a process. Prior to Linux 2.6.11, this file could not be used to set the security context (a write was always denied), since SELinux limited process security transitions to B<execve>(2) (see the description of I</proc/[pid]/attr/exec>, below). Since Linux 2.6.11, SELinux lifted this restriction and began supporting "set" operations via writes to this node if authorized by policy, although use of this operation is only suitable for applications that are trusted to maintain any desired separation between the old and new security contexts.
ru: В SELinux этот файл используется для получения контекста безопасности процесса. До Linux 2.6.11 этот файл нельзя было использовать для задания контекста безопасности (запись была запрещена), так как ограничение безопасности SELinux процесса изменяется при B<execve>(2) (смотрите описание I</proc/[pid]/attr/exec> ниже). Начиная с Linux 2.6.11 в SELinux это ограничение снято и началась поддержка операций «установки» посредством записи в эту ноду, если это допускается политикой, хотя использование данной операции подходит только для приложений, которым можно доверять управление любым желаемым разделением между старым и новым контекстами безопасности.

source: Prior to Linux 2.6.28, SELinux did not allow threads within a multi-threaded process to set their security context via this node as it would yield an inconsistency among the security contexts of the threads sharing the same memory space. Since Linux 2.6.28, SELinux lifted this restriction and began supporting "set" operations for threads within a multithreaded process if the new security context is bounded by the old security context, where the bounded relation is defined in policy and guarantees that the new security context has a subset of the permissions of the old security context.
ru: До Linux 2.6.28 в SELinux нитям не разрешалось внутри многонитевого процесса задавать свой контекст безопасности через эту ноду, так как это привело бы к нестыковке контекстов безопасности нитей, использующи[ общее адресное пространство. Начиная с Linux 2.6.28 в SELinux это ограничение снято и началась поддержка поддержка операций «установки» для нитей внутри многонитевого процесса, если новый контекст безопасности привязан к старому контексту безопасности, где связь определена политикой и гарантируется, что новый контекст безопасности является поднабором прав старого контекста безопасности.

source: Other security modules may choose to support "set" operations via writes to this node.
ru: Другие модули безопасности могут также добавить поддержку операций «установки» через запись в эту ноду.

source: I</proc/[pid]/attr/exec> (since Linux 2.6.0)
ru: I</proc/[pid]/attr/exec> (начиная с Linux 2.6.0)

source: This file represents the attributes to assign to the process upon a subsequent B<execve>(2).
ru: В этом файле представлены атрибуты, назначаемые процессу при последующем B<execve>(2).

source: In SELinux, this is needed to support role/domain transitions, and B<execve>(2) is the preferred point to make such transitions because it offers better control over the initialization of the process in the new security label and the inheritance of state. In SELinux, this attribute is reset on B<execve>(2) so that the new program reverts to the default behavior for any B<execve>(2) calls that it may make. In SELinux, a process can set only its own I</proc/[pid]/attr/exec> attribute.
ru: В SELinux это необходимо для поддержки перехода роль/домен и B<execve>(2) является предпочтительным местом выполнения таких изменений, так как предлагает лучший контроль над инициализацией процесса с новой меткой безопасности и наследуемым состоянием. В SELinux этот атрибут сбрасывается при B<execve>(2) и новая программа получает поведение по умолчанию для всех вызовов B<execve>(2), которые она может сделать. В SELinux процесс может задать только свой атрибут в I</proc/[pid]/attr/exec>.

source: I</proc/[pid]/attr/fscreate> (since Linux 2.6.0)
ru: I</proc/[pid]/attr/fscreate> (начиная с Linux 2.6.0)

source: This file represents the attributes to assign to files created by subsequent calls to B<open>(2), B<mkdir>(2), B<symlink>(2), and B<mknod>(2)
ru: В этом файле представлены атрибуты для назначения файлам, создаваемым последующими вызовами B<open>(2), B<mkdir>(2), B<symlink>(2) и B<mknod>(2).

source: SELinux employs this file to support creation of a file (using the aforementioned system calls) in a secure state, so that there is no risk of inappropriate access being obtained between the time of creation and the time that attributes are set. In SELinux, this attribute is reset on B<execve>(2), so that the new program reverts to the default behavior for any file creation calls it may make, but the attribute will persist across multiple file creation calls within a program unless it is explicitly reset. In SELinux, a process can set only its own I</proc/[pid]/attr/fscreate> attribute.
ru: SELinux создаёт этот файл для поддержки создания файла (с помощью вышеупомянутых системных вызовов) в безопасном состоянии, исключая, таким образом, риск неправомерного доступа, который можно получить в промежутке между созданием и назначением атрибутов. В SELinux этот атрибут сбрасывается при B<execve>(2), поэтому новой программе возвращается поведение по умолчанию при любых вызовах создания файла, но атрибут сохраняется между несколькими вызовами создания файла внутри программы, пока она явно его не сбросит. В SELinux процесс может установить только свой атрибут I</proc/[pid]/attr/fscreate>.

source: I</proc/[pid]/attr/keycreate> (since Linux 2.6.18)
ru: I</proc/[pid]/attr/keycreate> (начиная с Linux 2.6.18)

source: If a process writes a security context into this file, all subsequently created keys (B<add_key>(2)) will be labeled with this context. For further information, see the kernel source file I<Documentation/security/keys/core.rst> (or file I<Documentation/security/keys.txt> on Linux between 3.0 and 4.13, or I<Documentation/keys.txt> before Linux 3.0).
ru: Если процесс записывает контекст безопасности в этот файл, то все создаваемые далее ключи (B<add_key>(2)) будут помечены этим контекстом. Подробности смотрите в файле исходного кода ядра I<Documentation/security/keys/core.rst> (или в файле I<Documentation/security/keys.txt> в версиях Linux между 3.0 и 4.13, или в I<Documentation/keys.txt> до Linux 3.0).

source: I</proc/[pid]/attr/prev> (since Linux 2.6.0)
ru: I</proc/[pid]/attr/prev> (начиная с Linux 2.6.0)

source: This file contains the security context of the process before the last B<execve>(2); that is, the previous value of I</proc/[pid]/attr/current>.
ru: Этот файл содержит контекст безопасности процесса перед последним B<execve>(2) — предыдущее значение I</proc/[pid]/attr/current>.

source: I</proc/[pid]/attr/socketcreate> (since Linux 2.6.18)
ru: I</proc/[pid]/attr/socketcreate> (начиная с Linux 2.6.18)

source: If a process writes a security context into this file, all subsequently created sockets will be labeled with this context.
ru: Если процесс записывает контекст безопасности в этот файл, то все создаваемые далее сокеты будут помечены этим контекстом.

source: I</proc/[pid]/autogroup> (since Linux 2.6.38)
ru: I</proc/[pid]/autogroup> (начиная с Linux 2.6.38)

source: See B<sched>(7).
ru: Смотрите B<sched>(7).

source: I</proc/[pid]/auxv> (since 2.6.0)
ru: I</proc/[pid]/auxv> (начиная с 2.6.0)

source: This contains the contents of the ELF interpreter information passed to the process at exec time. The format is one I<unsigned long> ID plus one I<unsigned long> value for each entry. The last entry contains two zeros. See also B<getauxval>(3).
ru: Содержит информацию, полученную интерпретатором ELF и переданную процессу во время выполнения. Формат \(em это один идентификатор типа I<unsigned long> ID и по одному значению типа I<unsigned long> для каждого из элементов. Последний элемент содержит два нуля. Смотрите также B<getauxval>(3).

source: Permission to access this file is governed by a ptrace access mode B<PTRACE_MODE_READ_FSCREDS> check; see B<ptrace>(2).
ru: Право доступа к этому файлу определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_FSCREDS>; смотрите B<ptrace>(2).

source: I</proc/[pid]/cgroup> (since Linux 2.6.24)
ru: I</proc/[pid]/cgroup> (начиная с Linux 2.6.24)

source: See B<cgroups>(7).
ru: Смотрите B<cgroups>(7).

source: I</proc/[pid]/clear_refs> (since Linux 2.6.22)
ru: I</proc/[pid]/clear_refs> (начиная с Linux 2.6.22)

source: This is a write-only file, writable only by owner of the process.
ru: Данный файл доступен только для записи и только владельцу процесса.

source: The following values may be written to the file:
ru: В файл могут быть записаны следующие значения:

source: 1 (since Linux 2.6.22)
ru: 1 (начиная с Linux 2.6.22)

source: Reset the PG_Referenced and ACCESSED/YOUNG bits for all the pages associated with the process. (Before kernel 2.6.32, writing any nonzero value to this file had this effect.)
ru: Сбросить биты PG_Referenced и ACCESSED/YOUNG для всех страниц, связанных с процессом (до ядра версии 2.6.32, такое действие происходило при записи любого ненулевого значения в этот файл).

source: 2 (since Linux 2.6.32)
ru: 2 (начиная с Linux 2.6.32)

source: Reset the PG_Referenced and ACCESSED/YOUNG bits for all anonymous pages associated with the process.
ru: Сбросить биты PG_Referenced и ACCESSED/YOUNG для всех анонимных страниц, связанных с процессом.

source: 3 (since Linux 2.6.32)
ru: 3 (начиная с Linux 2.6.32)

source: Reset the PG_Referenced and ACCESSED/YOUNG bits for all file-mapped pages associated with the process.
ru: Сбросить биты PG_Referenced и ACCESSED/YOUNG для всех страниц отображения файлов, связанных с процессом.

source: Clearing the PG_Referenced and ACCESSED/YOUNG bits provides a method to measure approximately how much memory a process is using. One first inspects the values in the "Referenced" fields for the VMAs shown in I</proc/[pid]/smaps> to get an idea of the memory footprint of the process. One then clears the PG_Referenced and ACCESSED/YOUNG bits and, after some measured time interval, once again inspects the values in the "Referenced" fields to get an idea of the change in memory footprint of the process during the measured interval. If one is interested only in inspecting the selected mapping types, then the value 2 or 3 can be used instead of 1.
ru: Очистка бит PG_Referenced и ACCESSED/YOUNG предоставляет метод приблизительного измерения количества памяти, используемой процессом. Во-первых, нужно прочитать значения в полях «Referenced» для VMA, показанных в I</proc/[pid]/smaps>, и получить объём используемой процессом памяти. Во-вторых, очистить биты PG_Referenced и ACCESSED/YOUNG и после некоторого известного временного интервала ещё раз прочитать значения в полях «Referenced», чтобы получить размер используемой процессом памяти за известный интервал. Если это интересно только для изучения выбранных типов отображения, то вместо значение 1 можно использовать 2 или 3.

source: Further values can be written to affect different properties:
ru: Дополнительные записываемые значения, влияющие на другие свойства:

source: 4 (since Linux 3.11)
ru: 4 (начиная с Linux 3.11)

source: Clear the soft-dirty bit for all the pages associated with the process. This is used (in conjunction with I</proc/[pid]/pagemap>) by the check-point restore system to discover which pages of a process have been dirtied since the file I</proc/[pid]/clear_refs> was written to.
ru: Очистить бит несильного загрязнения (soft-dirty) для всех страниц, связанных с процессом. Это используется (вместе с I</proc/[pid]/pagemap>) системой восстановления контрольной точки для обнаружения какие страницы процесса были испачканы (dirtied) из-за записи в файл I</proc/[pid]/clear_refs>.

source: 5 (since Linux 4.0)
ru: 5 (начиная с Linux 4.0)

source: Reset the peak resident set size ("high water mark") to the process's current resident set size value.
ru: Сбрасывает пик размера резидентной памяти ("отметка высоты прилива") в текущее значение размера резидентной памяти.

source: Writing any value to I</proc/[pid]/clear_refs> other than those listed above has no effect.
ru: Запись любого значения в I</proc/[pid]/clear_refs>, отличного от перечисленных выше, ничего не меняет.

source: The I</proc/[pid]/clear_refs> file is present only if the B<CONFIG_PROC_PAGE_MONITOR> kernel configuration option is enabled.
ru: Файл I</proc/[pid]/clear_refs> существует только, если включён параметр настройки ядра B<CONFIG_PROC_PAGE_MONITOR>.

source: This read-only file holds the complete command line for the process, unless the process is a zombie. In the latter case, there is nothing in this file: that is, a read on this file will return 0 characters. The command-line arguments appear in this file as a set of strings separated by null bytes (\(aq\e0\(aq), with a further null byte after the last string.
ru: Данный файл, доступный только для чтения, содержит полную командную строку процесса, если процесс не является зомби. В последнем случае этот файл пуст, поэтому чтение из него вернёт 0 символов. Аргументы командной строки в этом файле представлены в виде набора строк, разделённых байтами null (\(aq\e0\(aq) и байтом null после последней строки.

source: I</proc/[pid]/comm> (since Linux 2.6.33)
ru: I</proc/[pid]/comm> (начиная с Linux 2.6.33)

source: This file exposes the process's I<comm> value\(emthat is, the command name associated with the process. Different threads in the same process may have different I<comm> values, accessible via I</proc/[pid]/task/[tid]/comm>. A thread may modify its I<comm> value, or that of any of other thread in the same thread group (see the discussion of B<CLONE_THREAD> in B<clone>(2)), by writing to the file I</proc/self/task/[tid]/comm>. Strings longer than B<TASK_COMM_LEN> (16) characters are silently truncated.
ru: В этом файле содержится значение I<comm> процесса — то есть имя команды, связанное с процессом. Разные нити одного процесса могут иметь разные значение I<comm>, они доступны через I</proc/[pid]/task/[tid]/comm>. Значение I<comm> можно изменить из самой нити или из другой нити в той же группе нитей (смотрите описание B<CLONE_THREAD> в B<clone>(2)) записью в файл I</proc/self/task/[tid]/comm>. Строки длиннее B<TASK_COMM_LEN> (16) символов просто обрезаются.

source: This file provides a superset of the B<prctl>(2) B<PR_SET_NAME> and B<PR_GET_NAME> operations, and is employed by B<pthread_setname_np>(3) when used to rename threads other than the caller.
ru: Этот файл содержит поднабор операций B<prctl>(2) B<PR_SET_NAME> и B<PR_GET_NAME>, и возвращается B<pthread_setname_np>(3) при использовании для переименования нитями, отличающимся от вызывающего.

source: I</proc/[pid]/coredump_filter> (since Linux 2.6.23)
ru: I</proc/[pid]/coredump_filter> (начиная с Linux 2.6.23)

source: See B<core>(5).
ru: Смотрите B<core>(5).

source: I</proc/[pid]/cpuset> (since Linux 2.6.12)
ru: I</proc/[pid]/cpuset> (начиная с Linux 2.6.12)

source: See B<cpuset>(7).
ru: Смотрите B<cpuset>(7).

source: This is a symbolic link to the current working directory of the process. To find out the current working directory of process 20, for instance, you can do this:
ru: Это символьная ссылка на текущий рабочий каталог процесса. Например, чтобы узнать текущий каталог процесса 20, вы должны проделать следующее:

source: Note that the I<pwd> command is often a shell built-in, and might not work properly. In B<bash>(1), you may use I<pwd\ -P>.
ru: Отметим, что команда I<pwd> часто является встроенной в оболочку, и поэтому может работать не корректно. В B<bash>(1) вы можете воспользоваться I<pwd\ -P>.

source: In a multithreaded process, the contents of this symbolic link are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
ru: В многонитевых процессах, содержимое этой символьной ссылки недоступно, если головная нить уже завершила работу (обычно с помощью вызова B<pthread_exit>(3)).

source: Permission to dereference or read (B<readlink>(2)) this symbolic link is governed by a ptrace access mode B<PTRACE_MODE_READ_FSCREDS> check; see B<ptrace>(2).
ru: Право разыменовывать или читать (B<readlink>(2)) эту символическую ссылку определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_FSCREDS>; смотрите B<ptrace>(2).

source: This file contains the initial environment that was set when the currently executing program was started via B<execve>(2). The entries are separated by null bytes (\(aq\e0\(aq), and there may be a null byte at the end. Thus, to print out the environment of process 1, you would do:
ru: Этот файл содержит начальное окружение, которое было настроено при запуске с помощью B<execve>(2) выполняемой в настоящий момент программы. Элементы разделяются байтами null (\(aq\e0\(aq), а также может быть байт null в конце. То есть, чтобы вывести окружение процесса 1, вы можете сделать следующее:

source: If, after an B<execve>(2), the process modifies its environment (e.g., by calling functions such as B<putenv>(3) or modifying the B<environ>(7) variable directly), this file will I<not> reflect those changes.
ru: Если после B<execve>(2) процесс изменил своё окружение (например, вызвав функцию B<putenv>(3) или напрямую изменив переменную B<environ>(7)), то этот файл I<не> показываются такие изменения.

source: Furthermore, a process may change the memory location that this file refers via B<prctl>(2) operations such as B<PR_SET_MM_ENV_START>.
ru: Кроме этого, процесс может изменить расположение памяти с помощью операции B<prctl>(2) B<PR_SET_MM_ENV_START>, на которое ссылается этот файл.

source: Under Linux 2.2 and later, this file is a symbolic link containing the actual pathname of the executed command. This symbolic link can be dereferenced normally; attempting to open it will open the executable. You can even type I</proc/[pid]/exe> to run another copy of the same executable that is being run by process [pid]. If the pathname has been unlinked, the symbolic link will contain the string \(aq(deleted)\(aq appended to the original pathname. In a multithreaded process, the contents of this symbolic link are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
ru: В Linux 2.2 и новее этот файл является символьной ссылкой, содержащей актуальный путь выполняемой команды. Данная символьная ссылка может обрабатываться обычным образом; попытка её открытия приведёт к открытию исполняемого файла. Вы даже можете ввести I</proc/[pid]/exe> для запуска другой копии того же исполняемого файла, который выполняется процессом [pid]. Если путь был удалён, то символьная ссылка будет содержать строку \(aq(deleted)\(aq, добавленную к оригинальному пути. В многонитевом процессе содержимое этой символьной ссылки недоступно, если основная нить уже завершилась (обычно вызовом B<pthread_exit>(3)).

source: Under Linux 2.0 and earlier, I</proc/[pid]/exe> is a pointer to the binary which was executed, and appears as a symbolic link. A B<readlink>(2) call on this file under Linux 2.0 returns a string in the format:
ru: В ядрах Linux 2.0 и более ранних, I</proc/[pid]/exe> указывает на двоичный файл, который был выполнен, и работает как символьная ссылка. Вызов B<readlink>(2) над этим файлом в Linux 2.0 вернёт строку следующего вида:

source: For example, [0301]:1502 would be inode 1502 on device major 03 (IDE, MFM, etc. drives) minor 01 (first partition on the first drive).
ru: Например, [0301]:1502 указывает на inode 1502 на устройстве со старшим номером устройства 03 (IDE, MFM, и т.п. диски), младшим номером 01 (первый раздел на первом диске).

source: B<find>(1) with the I<-inum> option can be used to locate the file.
ru: Для поиска файла можно воспользоваться B<find>(1) с параметром I<-inum>.

source: This is a subdirectory containing one entry for each file which the process has open, named by its file descriptor, and which is a symbolic link to the actual file. Thus, 0 is standard input, 1 standard output, 2 standard error, and so on.
ru: Этот подкаталог содержит одну запись для каждого файла, открытого процессом, именем является номер его файлового дескриптора, и которая является символьной ссылкой на настоящий файл. Так, 0 — это стандартный поток ввода, 1 — стандартный поток вывода, 2 — стандартный поток ошибок и т.п.

source: For file descriptors for pipes and sockets, the entries will be symbolic links whose content is the file type with the inode. A B<readlink>(2) call on this file returns a string in the format:
ru: Для файловых дескрипторов каналов и сокетов записи будут символьными ссылками, содержимое которых — тип файла и inode. Вызов B<readlink>(2) для такого файла вернёт строку в формате:

source: type:[inode]
ru: тип:[inode]

source: For example, I<socket:[2248868]> will be a socket and its inode is 2248868. For sockets, that inode can be used to find more information in one of the files under I</proc/net/>.
ru: Например, I<socket:[2248868]> — для сокета с inode 2248868. Для сокетов эту inode можно использовать для поиска дополнительной информации в одном из файлов в I</proc/net/>.

source: For file descriptors that have no corresponding inode (e.g., file descriptors produced by B<bpf>(2), B<epoll_create>(2), B<eventfd>(2), B<inotify_init>(2), B<perf_event_open>(2), B<signalfd>(2), B<timerfd_create>(2), and B<userfaultfd>(2)), the entry will be a symbolic link with contents of the form
ru: Для файловых дескриптор без соответствующей иноды (например, файловые дескрипторы, создаваемые B<bpf>(2), B<epoll_create>(2), B<eventfd>(2), B<inotify_init>(2), B<perf_event_open>(2), B<signalfd>(2), B<timerfd_create>(2) и B<userfaultfd>(2)), запись будет символьной ссылкой с содержимым в виде

source: anon_inode:E<lt>file-typeE<gt>
ru: anon_inode:E<lt>тип-файлаE<gt>

source: In many cases (but not all), the I<file-type> is surrounded by square brackets.
ru: Во многих случаях (но не всех) I<тип-файла> заключается в квадратные скобки.

source: For example, an epoll file descriptor will have a symbolic link whose content is the string I<anon_inode:[eventpoll]>.
ru: Например, файловый дескриптор epoll будет иметь символьную ссылку с содержимым в виде строки I<anon_inode:[eventpoll]>.

source: In a multithreaded process, the contents of this directory are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
ru: В многонитевых процессах, содержимое этого каталога недоступно, если главная нить уже завершила работу (обычно при помощи вызова B<pthread_exit>(3)).

source: Programs that take a filename as a command-line argument, but don't take input from standard input if no argument is supplied, and programs that write to a file named as a command-line argument, but don't send their output to standard output if no argument is supplied, can nevertheless be made to use standard input or standard output by using I</proc/[pid]/fd> files as command-line arguments. For example, assuming that I<-i> is the flag designating an input file and I<-o> is the flag designating an output file:
ru: Программы, принимающие в аргументе командной строки имя файлы, не читают данные из стандартного ввода, если аргумент не указан, а программы, которые выполняют запись в файл с именем, указанным в аргументе командной строки, не пишут данные в стандартный вывод, если аргумент не указан, но, тем не менее, могут использовать стандартный ввод или вывод через файлы I</proc/[pid]/fd>, указанные в аргументе командной строки. Например, подразумевая что I<-i> является флагом, обозначающим входной файл, и I<-o> является флагом, обозначающим выходной файл, вы можете указать:

source: and you have a working filter.
ru: и вы получите работающий фильтр.
