Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: I</proc/sys/fs/protected_symlinks> (since Linux 3.6)
ru: I</proc/sys/fs/protected_symlinks> (начиная с Linux 3.6)

source: When the value in this file is 0, no restrictions are placed on following symbolic links (i.e., this is the historical behavior before Linux 3.6). When the value in this file is 1, symbolic links are followed only in the following circumstances:
ru: Если значение в этом файле равно 0, то на переход по символьным ссылкам никаких ограничений не накладывается (т. е., обычное поведение ядра Linux до версии 3.6). Если значение в файле равно 1, то переход по символьным ссылкам происходит только при следующих условиях:

source: the filesystem UID of the process following the link matches the owner (UID) of the symbolic link (as described in B<credentials>(7), a process's filesystem UID is normally the same as its effective UID);
ru: UID файловой системы процесса, переходящего по ссылке, совпадает с владельцем (UID) символьной ссылки (как описано в B<credentials>(7), UID файловой системы процесса обычно совпадает с эффективным UID);

source: the link is not in a sticky world-writable directory; or
ru: ссылка не является «прилипшим» (sticky) каталогом, доступным на запись всем; или

source: the symbolic link and its parent directory have the same owner (UID)
ru: символьная ссылка и её родительский каталог имеют одного владельца (UID)

source: A system call that fails to follow a symbolic link because of the above restrictions returns the error B<EACCES> in I<errno>.
ru: Системный вызов, который не может перейти по символьной ссылке из-за перечисленных выше ограничений, возвращает ошибку B<EACCES> в I<errno>.

source: The default value in this file is 0. Setting the value to 1 avoids a longstanding class of security issues based on time-of-check, time-of-use races when accessing symbolic links.
ru: Значение по умолчанию в файле равно 0. Установка значения в 1 закрывает долголетний класс проблем с безопасностью, вызванных проверкой времени, состязательностью при использовании времени при доступе к символьным ссылкам.

source: I</proc/sys/fs/suid_dumpable> (since Linux 2.6.13)
ru: I</proc/sys/fs/suid_dumpable> (начиная с Linux 2.6.13)

source: The value in this file is assigned to a process's "dumpable" flag in the circumstances described in B<prctl>(2). In effect, the value in this file determines whether core dump files are produced for set-user-ID or otherwise protected/tainted binaries. The "dumpable" setting also affects the ownership of files in a process's I</proc/[pid]> directory, as described above.
ru: Значение из этого файла присваивается флагу «возможность создания дампа» процесса в случаях, описанных в B<prctl>(2). Фактически, значение в этом файле определяет будут ли создаваться файлы дампа памяти для файлов с установленным битом set-user-ID или других защищённых/с добавкой (tainted) исполняемых файлов. Настройка «возможность создания дампа» также влияет на владение файлами в каталоге процесса I</proc/[pid]> как описано выше.

source: Three different integer values can be specified:
ru: Можно указать три разных целых значения:

source: This provides the traditional (pre-Linux 2.6.13) behavior. A core dump will not be produced for a process which has changed credentials (by calling B<seteuid>(2), B<setgid>(2), or similar, or by executing a set-user-ID or set-group-ID program) or whose binary does not have read permission enabled.
ru: Традиционное поведение ( до Linux 2.6.13). Дамп памяти не создаётся для процесса, у которого изменены учётные данные (вызовом B<seteuid>(2), B<setgid>(2) и подобным или при исполнении программы с установленными битами set-user-ID или set-group-ID) или если для исполняемого файла нет права на чтение.

source: All processes dump core when possible. (Reasons why a process might nevertheless not dump core are described in B<core>(5).) The core dump is owned by the filesystem user ID of the dumping process and no security is applied. This is intended for system debugging situations only: this mode is insecure because it allows unprivileged users to examine the memory contents of privileged processes.
ru: Все процессы создают дамп памяти, если это возможно (причины невозможности создания дампа описаны в B<core>(5)). Дамп памяти принадлежит ID пользователя файловой системы выполнявшегося процесса и никаких мер безопасности не предпринимается. Предназначено только для системной отладки: данный режим небезопасен, так как позволяет непривилегированным пользователями просматривать содержимое памяти привилегированных процессов.

source: Any binary which normally would not be dumped (see "0" above) is dumped readable by root only. This allows the user to remove the core dump file but not to read it. For security reasons core dumps in this mode will not overwrite one another or other files. This mode is appropriate when administrators are attempting to debug problems in a normal environment.
ru: Дамп памяти будет выполняться для любого исполняемого файла, для которого обычно это не происходит (см. «0» ранее) и будет доступен на чтение только суперпользователю. Файл с дампом памяти обычный пользователь может удалять, но не читать. По соображениям безопасности дампы памяти в этом режиме не будут перезаписываться новыми или другими файлами. Этот режим подходит для администраторов, когда администраторы пытаются разобраться с проблемами в обычном окружении.

source: Additionally, since Linux 3.6, I</proc/sys/kernel/core_pattern> must either be an absolute pathname or a pipe command, as detailed in B<core>(5). Warnings will be written to the kernel log if I<core_pattern> does not follow these rules, and no core dump will be produced.
ru: Также, начиная с Linux 3.6, значение I</proc/sys/kernel/core_pattern> должно быть абсолютным путём или командой с каналом, как это описано в B<core>(5). В ядерный журнал будет выдано предупреждение, если значение I<core_pattern> отступает от этих правил, и дамп создан не будет.

source: For details of the effect of a process's "dumpable" setting on ptrace access mode checking, see B<ptrace>(2).
ru: О том, как влияет флаг «возможности создания дампа» процесса на проверку режима доступа ptrace, смотрите в B<ptrace>(2).

source: This file controls the maximum number of superblocks, and thus the maximum number of mounted filesystems the kernel can have. You need increase only I<super-max> if you need to mount more filesystems than the current value in I<super-max> allows you to.
ru: Этот файл управляет максимальным значением суперблоков и таким образом максимальным количеством файловых систем, которое может смонтировать ядро. Вам необходимо увеличивать I<super-max> только в том случае, если нужно смонтировать больше файловых систем, чем это позволяет значение в файле I<super-max>.

source: This file contains the number of filesystems currently mounted.
ru: Этот файл содержит количество файловых систем, которое смонтировано в данный момент.

source: This directory contains files controlling a range of kernel parameters, as described below.
ru: В этом каталоге содержатся файлы, контролирующие набор параметров ядра, описанных далее.

source: This file contains three numbers: I<highwater>, I<lowwater>, and I<frequency>. If BSD-style process accounting is enabled, these values control its behavior. If free space on filesystem where the log lives goes below I<lowwater> percent, accounting suspends. If free space gets above I<highwater> percent, accounting resumes. I<frequency> determines how often the kernel checks the amount of free space (value is in seconds). Default values are 4, 2 and 30. That is, suspend accounting if 2% or less space is free; resume it if 4% or more space is free; consider information about amount of free space valid for 30 seconds.
ru: В этом файле содержатся три числа: I<highwater>, I<lowwater> и I<frequency>. Если включён учёт процессов в стиле BSD, то эти значения управляют его поведением. Если свободного места на файловой системе, куда осуществляется протоколирование учёта, становится меньше, чем I<lowwater> процентов, то учёт процессов приостанавливается. Если свободного места становится больше, чем I<highwater> процентов, то учёт процессов возобновляется. Значение I<frequency> определяет как часто ядро проверяет свободное место (в секундах). По умолчанию значения соответственно составляют 4, 2 и 30. Таким образом, приостановка учёта осуществляется, если свободно менее 2% места на диске; возобновление если места больше или равно 4%; информация о свободном месте обновляется каждые 30 секунд.

source: I</proc/sys/kernel/auto_msgmni> (Linux 2.6.27 to 3.18)
ru: I</proc/sys/kernel/auto_msgmni> (Linux с 2.6.27 по 3.18)

source: From Linux 2.6.27 to 3.18, this file was used to control recomputing of the value in I</proc/sys/kernel/msgmni> upon the addition or removal of memory or upon IPC namespace creation/removal. Echoing "1" into this file enabled I<msgmni> automatic recomputing (and triggered a recomputation of I<msgmni> based on the current amount of available memory and number of IPC namespaces). Echoing "0" disabled automatic recomputing. (Automatic recomputing was also disabled if a value was explicitly assigned to I</proc/sys/kernel/msgmni>.) The default value in I<auto_msgmni> was 1.
ru: С Linux 2.6.27 по 3.18 этот файл использовался для управления перерасчётом значения в I</proc/sys/kernel/msgmni> при добавлении или удалении памяти или при создании/удалении пространства имён IPC. Запись «1» в этот файл включает автоматический перерасчёт I<msgmni> (и возбуждает перерасчёт I<msgmni> на основе текущего количества доступной памяти и количества пространств имён IPC). Запись «0» отключает автоматический перерасчёт (также автоматический перерасчёт отключается, если значение I</proc/sys/kernel/msgmni> было назначено явно). Значением I<auto_msgmni> по умолчанию было 1.

source: Since Linux 3.19, the content of this file has no effect (because I<msgmni> defaults to near the maximum value possible), and reads from this file always return the value "0".
ru: Начиная с Linux 3.19 содержимое этого файла не учитывается (так как значение I<msgmni> по умолчанию близко к максимально возможному), а чтение из этого файла всегда возвращает «0».

source: I</proc/sys/kernel/cap_last_cap> (since Linux 3.2)
ru: I</proc/sys/kernel/cap_last_cap> (начиная с Linux 3.2)

source: See B<capabilities>(7).
ru: Смотрите B<capabilities>(7).

source: I</proc/sys/kernel/cap-bound> (from Linux 2.2 to 2.6.24)
ru: I</proc/sys/kernel/cap-bound> (с Linux 2.2 до 2.6.24)

source: This file holds the value of the kernel I<capability bounding set> (expressed as a signed decimal number). This set is ANDed against the capabilities permitted to a process during B<execve>(2). Starting with Linux 2.6.25, the system-wide capability bounding set disappeared, and was replaced by a per-thread bounding set; see B<capabilities>(7).
ru: Этот файл содержит I<набор привязанных мандатов> ядра (выражаемый как десятичные числа со знаком). Этот набор мандатов, предоставляемых процессу во время B<execve>(2), которые складываются посредством битового умножения (AND). Начиная с Linux 2.6.25, глобального набора привязанных мандатов больше нет, теперь свой набор привязанных мандатов есть у каждой нити; смотрите B<capabilities>(7).

source: This file controls the handling of Ctrl-Alt-Del from the keyboard. When the value in this file is 0, Ctrl-Alt-Del is trapped and sent to the B<init>(1) program to handle a graceful restart. When the value is greater than zero, Linux's reaction to a Vulcan Nerve Pinch (tm) will be an immediate reboot, without even syncing its dirty buffers. Note: when a program (like dosemu) has the keyboard in "raw" mode, the ctrl-alt-del is intercepted by the program before it ever reaches the kernel tty layer, and it's up to the program to decide what to do with it.
ru: Этот файл управляет обработкой нажатия клавиш Ctrl-Alt-Del. Когда значение в этом файле равно 0, Ctrl-Alt-Del обрабатывается и производит вызов программы B<init>(1) для выполнения контролируемого перезапуска системы. Когда значение в файле больше 0, реакция Linux соответствует Vulcan Nerve Pinch (tm) [коронный приём расы Vulcan, см. сериал Star Trek], согласно которому произойдёт немедленная перезагрузка, даже без синхронизации буферов дисков. Замечание: когда какая-либо программа (типа dosemu) работает с клавиатурой в режиме «без обработки», нажатие ctrl-alt-del обработается этой программой, до того как оно достигнет уровня tty ядра и, таким образом, именно эта программа будет решать, что делать.

source: I</proc/sys/kernel/dmesg_restrict> (since Linux 2.6.37)
ru: I</proc/sys/kernel/dmesg_restrict> (начиная с Linux 2.6.37)

source: The value in this file determines who can see kernel syslog contents. A value of 0 in this file imposes no restrictions. If the value is 1, only privileged users can read the kernel syslog. (See B<syslog>(2) for more details.) Since Linux 3.4, only users with the B<CAP_SYS_ADMIN> capability may change the value in this file.
ru: Значение этого файла определяет, кто может видеть содержимое syslog от ядра. Значение 0 снимает все ограничения. Если значение равно 1,то только привилегированные пользователи могут читать syslog от ядра (подробности смотрите B<syslog>(2) в). Начиная с Linux 3.4, только пользователи с мандатом B<CAP_SYS_ADMIN> могут изменять содержимое этого файла.

source: I</proc/sys/kernel/domainname> and I</proc/sys/kernel/hostname>
ru: I</proc/sys/kernel/domainname> и I</proc/sys/kernel/hostname>

source: can be used to set the NIS/YP domainname and the hostname of your box in exactly the same way as the commands B<domainname>(1) and B<hostname>(1), that is:
ru: могут быть использованы для установки имени домена службы NIS/YP и имени узла вашей машины точно таким же образом как и командами B<domainname>(1) и B<hostname>(1), т.е.:

source: has the same effect as
ru: выполнят тоже самое, что и команды

source: Note, however, that the classic darkstar.frop.org has the hostname "darkstar" and DNS (Internet Domain Name Server) domainname "frop.org", not to be confused with the NIS (Network Information Service) or YP (Yellow Pages) domainname. These two domain names are in general different. For a detailed discussion see the B<hostname>(1) man page.
ru: Однако заметим, что классический darkstar.frop.org имеет имя узла "darkstar" и доменное имя DNS (Сервера Доменных Имен) "frop.org", не путайте с доменным именем NIS (Службы Сетевой Информации) или как она раньше называлась YP (Yellow Pages). Эти два доменных имени полностью различны по своей сути. Подробности об это можно найти в справочной странице B<hostname>(1).

source: This file contains the pathname for the hotplug policy agent. The default value in this file is I</sbin/hotplug>.
ru: Этот файл содержит путь для агента политики устройств. По умолчанию это файл I</sbin/hotplug>.

source: I</proc/sys/kernel/htab-reclaim> (before Linux 2.4.9.2)
ru: I</proc/sys/kernel/htab-reclaim> (до Linux 2.4.9.2)

source: (PowerPC only) If this file is set to a nonzero value, the PowerPC htab (see kernel file I<Documentation/powerpc/ppc_htab.txt>) is pruned each time the system hits the idle loop.
ru: (только для PowerPC) Если значение в этом файле установлено в ненулевое значение, то PowerPC htab (см. файл I<Documentation/powerpc/ppc_htab.txt> в исходном коде ядра) сокращается каждый раз, когда система входит в цикл простоя.

source: This directory contains various files that define parameters and limits for the key-management facility. These files are described in B<keyrings>(7).
ru: В этом каталоге содержатся различные файлы, определяющие параметры и ограничения инфраструктуры управления ключами. Эти файлы описаны в B<keyrings>(7).

source: I</proc/sys/kernel/kptr_restrict> (since Linux 2.6.38)
ru: I</proc/sys/kernel/kptr_restrict> (начиная с Linux 2.6.38)

source: The value in this file determines whether kernel addresses are exposed via I</proc> files and other interfaces. A value of 0 in this file imposes no restrictions. If the value is 1, kernel pointers printed using the I<%pK> format specifier will be replaced with zeros unless the user has the B<CAP_SYSLOG> capability. If the value is 2, kernel pointers printed using the I<%pK> format specifier will be replaced with zeros regardless of the user's capabilities. The initial default value for this file was 1, but the default was changed to 0 in Linux 2.6.39. Since Linux 3.4, only users with the B<CAP_SYS_ADMIN> capability can change the value in this file.
ru: Значением этого файла определяется будут ли видны ядра ядра, показываемые в файлах I</proc> и других интерфейсах. Значение 0 снимает все ограничения. Если значение равно 1, то указатели ядра, выводимые по формату I<%pK>, будут заменены на нули, если пользователь не имеет мандата B<CAP_SYSLOG>. Если значение равно 2, то указатели ядра, выводимые по формату I<%pK>, будут заменены на нули, независимо от наличия мандатов у пользователя. В начале значение по умолчанию было равно 1, но изменилось на 0 в Linux 2.6.39. Начиная с Linux 3.4, только пользователи с мандатом B<CAP_SYS_ADMIN> могут изменять значение в этом файле.

source: (PowerPC only) This file contains a flag that controls the L2 cache of G3 processor boards. If 0, the cache is disabled. Enabled if nonzero.
ru: (только для PowerPC) Этот файл содержит флаг, который управляет кэшем L2 на процессорных платах G3. Если 0, кэш выключен. Если не ноль, то включён.

source: This file contains the pathname for the kernel module loader. The default value is I</sbin/modprobe>. The file is present only if the kernel is built with the B<CONFIG_MODULES> (B<CONFIG_KMOD> in Linux 2.6.26 and earlier) option enabled. It is described by the Linux kernel source file I<Documentation/kmod.txt> (present only in kernel 2.4 and earlier).
ru: В этом файле содержится путь к загрузчику модулей ядра. Значение по умолчанию равно I</sbin/modprobe>. Файл существует только, если ядро собрано с параметром B<CONFIG_MODULES> (B<CONFIG_KMOD> — в Linux 2.6.26 и более ранних). Он описан в файле I<Documentation/kmod.txt> из дерева исходного кода ядра Linux (есть только в ядре версии 2.4 и более ранних).

source: I</proc/sys/kernel/modules_disabled> (since Linux 2.6.31)
ru: I</proc/sys/kernel/modules_disabled> (начиная с Linux 2.6.31)

source: A toggle value indicating if modules are allowed to be loaded in an otherwise modular kernel. This toggle defaults to off (0), but can be set true (1). Once true, modules can be neither loaded nor unloaded, and the toggle cannot be set back to false. The file is present only if the kernel is built with the B<CONFIG_MODULES> option enabled.
ru: Значение-переключатель, показывающий, можно ли загружать модули в модульное ядро. Значение по умолчанию равно 0 (можно загружать), но может быть установлено в 1 (нельзя загружать). При значении 1 модули нельзя не загружать не выгружать, и значение-переключатель тоже нельзя изменить. Данный файл появляется только, если ядро собрано с включённым параметром B<CONFIG_MODULES>.

source: I</proc/sys/kernel/msgmax> (since Linux 2.2)
ru: I</proc/sys/kernel/msgmax> (начиная с Linux 2.2)

source: This file defines a system-wide limit specifying the maximum number of bytes in a single message written on a System V message queue.
ru: Этот файл определяет системный лимит на максимальное число байт в одном сообщении, которое пишется в очередь сообщений System\ V.

source: I</proc/sys/kernel/msgmni> (since Linux 2.4)
ru: I</proc/sys/kernel/msgmni> (начиная с Linux 2.4)

source: This file defines the system-wide limit on the number of message queue identifiers. See also I</proc/sys/kernel/auto_msgmni>.
ru: Этот файл определяет системное ограничение на количество идентификаторов в очереди сообщений. Смотрите также I</proc/sys/kernel/auto_msgmni>.

source: I</proc/sys/kernel/msgmnb> (since Linux 2.2)
ru: I</proc/sys/kernel/msgmnb> (начиная с Linux 2.2)

source: This file defines a system-wide parameter used to initialize the I<msg_qbytes> setting for subsequently created message queues. The I<msg_qbytes> setting specifies the maximum number of bytes that may be written to the message queue.
ru: Этот файл определяет системный параметр, используемый при начальной настройке I<msg_qbytes> для последовательно создаваемых очередей сообщений. Настройка I<msg_qbytes> задаёт максимальное число байт, которые могут быть записаны в очередь сообщений.

source: I</proc/sys/kernel/ngroups_max> (since Linux 2.6.4)
ru: I</proc/sys/kernel/ngroups_max> (начиная с Linux 2.6.4)

source: This is a read-only file that displays the upper limit on the number of a process's group memberships.
ru: Этот файл только для чтения, отображает верхний предел на количество членов группы процесса.

source: I</proc/sys/kernel/ns_last_pid> (since Linux 3.3)
ru: I</proc/sys/kernel/ns_last_pid> (начиная с Linux 3.3)

source: See B<pid_namespaces>(7).
ru: Смотрите B<pid_namespaces>(7).

source: I</proc/sys/kernel/ostype> and I</proc/sys/kernel/osrelease>
ru: I</proc/sys/kernel/ostype> и I</proc/sys/kernel/osrelease>

source: These files give substrings of I</proc/version>.
ru: Эти файлы содержат подстроки из I</proc/version>.

source: I</proc/sys/kernel/overflowgid> and I</proc/sys/kernel/overflowuid>
ru: I</proc/sys/kernel/overflowgid> и I</proc/sys/kernel/overflowuid>

source: These files duplicate the files I</proc/sys/fs/overflowgid> and I</proc/sys/fs/overflowuid>.
ru: Эти файлы дублируют файлы I</proc/sys/fs/overflowgid> и I</proc/sys/fs/overflowuid>.

source: This file gives read/write access to the kernel variable I<panic_timeout>. If this is zero, the kernel will loop on a panic; if nonzero, it indicates that the kernel should autoreboot after this number of seconds. When you use the software watchdog device driver, the recommended setting is 60.
ru: Этот файл предоставляет доступ на чтение и запись к переменной ядра I<panic_timeout>. Если значение в файле равно нулю, ядро будет зацикливаться при крахе системы по panic; если не ноль, то это означает, что ядро должно выполнить автоматическую перезагрузку после этого количества секунд. Когда вы используете программный драйвер устройства watchdog (устройство, периодически делающее проверку, что система функционирует), то рекомендуется установить значение 60.

source: I</proc/sys/kernel/panic_on_oops> (since Linux 2.5.68)
ru: I</proc/sys/kernel/panic_on_oops> (начиная с Linux 2.5.68)

source: This file controls the kernel's behavior when an oops or BUG is encountered. If this file contains 0, then the system tries to continue operation. If it contains 1, then the system delays a few seconds (to give klogd time to record the oops output) and then panics. If the I</proc/sys/kernel/panic> file is also nonzero, then the machine will be rebooted.
ru: Этот файл управляет поведением ядра, когда случается oops или BUG. Если файл содержит 0, то система пытается продолжить работу. Если содержит 1, то система выполняет задержку на несколько секунд (чтобы дать время klogd записать вывод oops) и затем генерирует крах системы через panic. Если файл I</proc/sys/kernel/panic> также содержит ненулевое значение, то машина будет перезагружена.

source: I</proc/sys/kernel/pid_max> (since Linux 2.5.34)
ru: I</proc/sys/kernel/pid_max> (начиная с Linux 2.5.34)
