Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Currently, there are limitations in the kernel implementation logic for B<wait>(2)ing on a stopped thread group with a dead thread group leader. This can manifest in problems such as a locked terminal if a stop signal is sent to a foreground process whose thread group leader has already called B<pthread_exit>().
ru: В настоящее время в реализуемой ядром логики есть ограничения для остановленных групп нитей с помощью B<wait>(2) с мёртвым лидером группы нитей. Из-за этого могут возникнуть такие проблемы как заблокированный терминал, если сигнал останова посылается фоновому процессу, у которого лидер группы нитей уже вызвал B<pthread_exit>().

source: pthread_setname_np, pthread_getname_np - set/get the name of a thread
ru: pthread_setname_np, pthread_getname_np - изменяет/возвращает имя нити

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>pthread.hE<gt>> B<int pthread_setname_np(pthread_t >I<thread>B<, const char *>I<name>B<);> B<int pthread_getname_np(pthread_t >I<thread>B<,> B< char *>I<name>B<, size_t >I<len>B<);>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>pthread.hE<gt>> B<int pthread_setname_np(pthread_t >I<thread>B<, const char *>I<name>B<);> B<int pthread_getname_np(pthread_t >I<thread>B<,> B< char *>I<name>B<, size_t >I<len>B<);>

source: By default, all the threads created using B<pthread_create>() inherit the program name. The B<pthread_setname_np>() function can be used to set a unique name for a thread, which can be useful for debugging multithreaded applications. The thread name is a meaningful C language string, whose length is restricted to 16 characters, including the terminating null byte (\(aq\e0\(aq). The I<thread> argument specifies the thread whose name is to be changed; I<name> specifies the new name.
ru: По умолчанию, все нити, созданные B<pthread_create>(), наследуют имя программы. Функция B<pthread_setname_np>() позволяет задать уникальное имя нити, которое можно использовать при отладки многонитевых приложений. Имя нити задаётся по правилам строк языка C, его длина ограничена 16 символами, включая конечный байт null (\(aq\e0\(aq). В аргументе I<thread> указывается нить, чьё имя будет изменено; в I<name> указывается новое имя.

source: The B<pthread_getname_np>() function can be used to retrieve the name of the thread. The I<thread> argument specifies the thread whose name is to be retrieved. The buffer I<name> is used to return the thread name; I<len> specifies the number of bytes available in I<name>. The buffer specified by I<name> should be at least 16 characters in length. The returned thread name in the output buffer will be null terminated.
ru: Функция B<pthread_getname_np>() возвращает имя нити. В аргументе I<thread> указывает нить, чьё имя будет возвращено. В буфер I<name> возвращается имя нити; в аргументе I<len> указывается количество байт, доступное в I<name>. Длина буфера I<name> должна быть не менее 16 символов. Возвращаемое имя в выходном буфере завершается байтом null.

source: The B<pthread_setname_np>() function can fail with the following error:
ru: Функция B<pthread_setname_np>() может завершиться со следующей ошибкой:

source: The length of the string specified pointed to by I<name> exceeds the allowed limit.
ru: Длина строки, на которую ссылается I<name>, превышает разрешённую.

source: The B<pthread_getname_np>() function can fail with the following error:
ru: Функция B<pthread_getname_np>() может завершиться со следующей ошибкой:

source: The buffer specified by I<name> and I<len> is too small to hold the thread name.
ru: Буфер, задаваемый I<name> и I<len>, слишком мал для имени нити.

source: If either of these functions fails to open I</proc/self/task/[tid]/comm>, then the call may fail with one of the errors described in B<open>(2).
ru: Если одна из этих функций завершается с ошибкой открытия I</proc/self/task/[tid]/comm>, то вызов может завершиться одной из ошибок, описанных в B<open>(2).

source: These functions first appeared in glibc in version 2.12.
ru: Эти функции впервые появились в glibc 2.12.

source: B<pthread_setname_np>() internally writes to the thread-specific I<comm> file under the I</proc> filesystem: I</proc/self/task/[tid]/comm>. B<pthread_getname_np>() retrieves it from the same location.
ru: Запись B<pthread_setname_np>() выполняет через файл нити I<comm> из файловой системы I</proc>: I</proc/self/task/[tid]/comm>. Функция B<pthread_getname_np>() также используется его для возврата имени.

source: The program below demonstrates the use of B<pthread_setname_np>() and B<pthread_getname_np>().
ru: Представленная ниже программа показывает использование B<pthread_setname_np>() и B<pthread_getname_np>().

source: The following shell session shows a sample run of the program:
ru: Пример сеанса работы с программой:

source: $B< ./a.out> Created a thread. Default name is: a.out The thread name after setting it is THREADFOO. B<^Z> # Suspend the program [1]+ Stopped ./a.out $ B<ps H -C a.out -o 'pid tid cmd comm'> PID TID CMD COMMAND 5990 5990 ./a.out a.out 5990 5991 ./a.out THREADFOO $ B<cat /proc/5990/task/5990/comm> a.out $ B<cat /proc/5990/task/5991/comm> THREADFOO
ru: $B< ./a.out> Нить создана. Имя по умолчанию: a.out Имя нити после изменения — THREADFOO. B<^Z> # Приостановка программы [1]+ Stopped ./a.out $ B<ps H -C a.out -o 'pid tid cmd comm'> PID TID CMD COMMAND 5990 5990 ./a.out a.out 5990 5991 ./a.out THREADFOO $ B<cat /proc/5990/task/5990/comm> a.out $ B<cat /proc/5990/task/5991/comm> THREADFOO

source: static void * threadfunc(void *parm) { sleep(5); // allow main program to set the thread name return NULL; }
ru: static void * threadfunc(void *parm) { sleep(5); // позволить главной программе изменить имя нити return NULL; }

source: printf("Created a thread. Default name is: %s\en", thread_name); rc = pthread_setname_np(thread, (argc E<gt> 1) ? argv[1] : "THREADFOO"); if (rc != 0) errExitEN(rc, "pthread_setname_np");
ru: printf("Нить создана. Имя по умолчанию: %s\en", thread_name); rc = pthread_setname_np(thread, (argc E<gt> 1) ? argv[1] : "THREADFOO"); if (rc != 0) errExitEN(rc, "pthread_setname_np");

source: rc = pthread_getname_np(thread, thread_name, (argc E<gt> 2) ? atoi(argv[1]) : NAMELEN); if (rc != 0) errExitEN(rc, "pthread_getname_np"); printf("The thread name after setting it is %s.\en", thread_name);
ru: rc = pthread_getname_np(thread, thread_name, (argc E<gt> 2) ? atoi(argv[1]) : NAMELEN); if (rc != 0) errExitEN(rc, "pthread_getname_np"); printf("Имя нити после изменения — %s.\en", thread_name);

source: pthread_getattr_default_np, pthread_setattr_default_np, - get or set default thread-creation attributes
ru: pthread_getattr_default_np, pthread_setattr_default_np - возврат или изменение атрибутов создания нити по умолчанию

source: The B<pthread_setattr_default_np>() function sets the default attributes used for creation of a new thread\(emthat is, the attributes that are used when B<pthread_create>(3) is called with a second argument that is NULL. The default attributes are set using the attributes supplied in I<*attr>, a previously initialized thread attributes object. Note the following details about the supplied attributes object:
ru: Функция B<pthread_setattr_default_np>() изменяет атрибуты по умолчанию, используемые при создании новой нити — то есть атрибуты, которые используются при вызове B<pthread_create>(3) со вторым аргументом, равным NULL. Атрибуты по умолчанию изменяются в соответствии с атрибутами, переданными в I<*attr> — объекте атрибутов нити, инициализированном ранее. Вот, что нужно знать об объекте атрибутов:

source: The attribute settings in the object must be valid.
ru: Значения атрибутов в объекте должны быть корректными.

source: The I<stack address> attribute must not be set in the object.
ru: Атрибут I<stack address> не должен быть указан в объекте.

source: Setting the I<stack size> attribute to zero means leave the default stack size unchanged.
ru: Значение нуля в I<stack size> означает, что размер стека по умолчанию остаётся без изменения.

source: The B<pthread_getattr_default_np>() function initializes the thread attributes object referred to by I<attr> so that it contains the default attributes used for thread creation.
ru: Функция B<pthread_getattr_default_np>() инициализирует объект атрибутов нити, на который указывает I<attr>, так, что он содержит значения атрибутов по умолчанию, использованные при создании нити.

source: (B<pthread_setattr_default_np>()) One of the attribute settings in I<attr> is invalid, or the stack address attribute is set in I<attr>.
ru: (B<pthread_setattr_default_np>()) Одно из значений атрибутов в I<attr> неверно или в I<attr> изменён атрибут адреса стека.

source: (B<pthread_setattr_default_np>()) Insufficient memory.
ru: (B<pthread_setattr_default_np>()) Недостаточно памяти.

source: These functions are available in glibc since version 2.18.
ru: Эти функции доступны в glibc начиная с версии 2.18.

source: These functions are nonstandard GNU extensions; hence the suffix "_np" (nonportable) in their names.
ru: Данные функции являются не стандартизированными расширениями GNU, о чём свидетельствует наличие суффикса «_np» (nonportable).

source: The program below uses B<pthread_getattr_default_np>() to fetch the default thread-creation attributes and then displays various settings from the returned thread attributes object. When running the program, we see the following output:
ru: В программе, показанной далее, используется B<pthread_getattr_default_np()> для получения атрибутов создания нити по умолчанию, а затем выводятся различные параметры полученного объекта. Вывод работы программы:

source: $ B<./a.out> Stack size: 8388608 Guard size: 4096 Scheduling policy: SCHED_OTHER Scheduling priority: 0 Detach state: JOINABLE Inherit scheduler: INHERIT
ru: $ B<./a.out> Размер стека: 8388608 Размер защиты: 4096 Алгоритм планирования: SCHED_OTHER Приоритет планирования: 0 Состояние отсоединения: JOINABLE Наследование планировщика: INHERIT

source: s = pthread_attr_getstacksize(attr, &stacksize); if (s != 0) errExitEN(s, "pthread_attr_getstacksize"); printf("Stack size: %zd\en", stacksize);
ru: s = pthread_attr_getstacksize(attr, &stacksize); if (s != 0) errExitEN(s, "pthread_attr_getstacksize"); printf("Размер стека: %zd\en", stacksize);

source: s = pthread_attr_getguardsize(attr, &guardsize); if (s != 0) errExitEN(s, "pthread_attr_getguardsize"); printf("Guard size: %zd\en", guardsize);
ru: s = pthread_attr_getguardsize(attr, &guardsize); if (s != 0) errExitEN(s, "pthread_attr_getguardsize"); printf("Размер защиты: %zd\en", guardsize);

source: s = pthread_attr_getschedpolicy(attr, &policy); if (s != 0) errExitEN(s, "pthread_attr_getschedpolicy"); printf("Scheduling policy: %s\en", (policy == SCHED_FIFO) ? "SCHED_FIFO" : (policy == SCHED_RR) ? "SCHED_RR" : (policy == SCHED_OTHER) ? "SCHED_OTHER" : "[unknown]");
ru: s = pthread_attr_getschedpolicy(attr, &policy); if (s != 0) errExitEN(s, "pthread_attr_getschedpolicy"); printf("Алгоритм планирования: %s\en", (policy == SCHED_FIFO) ? "SCHED_FIFO" : (policy == SCHED_RR) ? "SCHED_RR" : (policy == SCHED_OTHER) ? "SCHED_OTHER" : "[неизвестно]");

source: s = pthread_attr_getschedparam(attr, &schedparam); if (s != 0) errExitEN(s, "pthread_attr_getschedparam"); printf("Scheduling priority: %d\en", schedparam.sched_priority);
ru: s = pthread_attr_getschedparam(attr, &schedparam); if (s != 0) errExitEN(s, "pthread_attr_getschedparam"); printf("Приоритет планирования: %d\en", schedparam.sched_priority);

source: s = pthread_attr_getdetachstate(attr, &detachstate); if (s != 0) errExitEN(s, "pthread_attr_getdetachstate"); printf("Detach state: %s\en", (detachstate == PTHREAD_CREATE_DETACHED) ? "DETACHED" : (detachstate == PTHREAD_CREATE_JOINABLE) ? "JOINABLE" : "???");
ru: s = pthread_attr_getdetachstate(attr, &detachstate); if (s != 0) errExitEN(s, "pthread_attr_getdetachstate"); printf("Состояние отсоединения: %s\en", (detachstate == PTHREAD_CREATE_DETACHED) ? "DETACHED" : (detachstate == PTHREAD_CREATE_JOINABLE) ? "JOINABLE" : "???");

source: s = pthread_attr_getinheritsched(attr, &inheritsched); if (s != 0) errExitEN(s, "pthread_attr_getinheritsched"); printf("Inherit scheduler: %s\en", (inheritsched == PTHREAD_INHERIT_SCHED) ? "INHERIT" : (inheritsched == PTHREAD_EXPLICIT_SCHED) ? "EXPLICIT" : "???"); }
ru: s = pthread_attr_getinheritsched(attr, &inheritsched); if (s != 0) errExitEN(s, "pthread_attr_getinheritsched"); printf("Наследование планировщика: %s\en", (inheritsched == PTHREAD_INHERIT_SCHED) ? "INHERIT" : (inheritsched == PTHREAD_EXPLICIT_SCHED) ? "EXPLICIT" : "???"); }

source: pthread_join - join with a terminated thread
ru: pthread_join - присоединение к завершённой нити

source: The B<pthread_join>() function waits for the thread specified by I<thread> to terminate. If that thread has already terminated, then B<pthread_join>() returns immediately. The thread specified by I<thread> must be joinable.
ru: Функция B<pthread_join>() ждёт завершения нити, указанной в I<thread>. Если нить уже завершила работу, то B<pthread_join>() завершается сразу. Нить, задаваемая в I<thread>, должна позволять присоединение.

source: If I<retval> is not NULL, then B<pthread_join>() copies the exit status of the target thread (i.e., the value that the target thread supplied to B<pthread_exit>(3)) into the location pointed to by I<retval>. If the target thread was canceled, then B<PTHREAD_CANCELED> is placed in the location pointed to by I<retval>.
ru: Если I<retval> не равно NULL, то B<pthread_join>() копирует код выхода нити назначения (т. е., значение, которое нить назначения передала через B<pthread_exit>(3)) в расположение по указателю I<retval>. Если нить назначения была отменена, то в расположение по указателю I<retval> помещается значение B<PTHREAD_CANCELED>.

source: If multiple threads simultaneously try to join with the same thread, the results are undefined. If the thread calling B<pthread_join>() is canceled, then the target thread will remain joinable (i.e., it will not be detached).
ru: Если к одной нити одновременно пытаются присоединиться несколько нитей, то результат не определён. Если нити вызвавшая B<pthread_join>(), отменяется, то нить назначения остаётся доступной для присоединения (т. е., не будет отсоединена).

source: On success, B<pthread_join>() returns 0; on error, it returns an error number.
ru: При успешном выполнении B<pthread_join>() возвращается 0; при ошибке возвращается номер ошибки.

source: A deadlock was detected (e.g., two threads tried to join with each other); or I<thread> specifies the calling thread.
ru: Обнаружена взаимная блокировка (например, когда две нити пытаются присоединиться друг к другу); или в I<thread> указана вызывающая нить.

source: Another thread is already waiting to join with this thread.
ru: Другая нить уже ждёт присоединения к этой нити.

source: After a successful call to B<pthread_join>(), the caller is guaranteed that the target thread has terminated. The caller may then choose to do any clean-up that is required after termination of the thread (e.g., freeing memory or other resources that were allocated to the target thread).
ru: После успешного выполнения B<pthread_join>() вызывающему гарантируется, что целевая нить завершила работу. Вызывающий теперь может сделать нужные после завершения нити операции по очистке (например, освободить память или другие ресурсы, которые использовались целевой нитью).

source: Joining with a thread that has previously been joined results in undefined behavior.
ru: Присоединение к нити, из которой уже был получен результат присоединения, приводит к непредсказуемым последствиям.

source: Failure to join with a thread that is joinable (i.e., one that is not detached), produces a "zombie thread". Avoid doing this, since each zombie thread consumes some system resources, and when enough zombie threads have accumulated, it will no longer be possible to create new threads (or processes).
ru: Ошибка присоединения к нити, доступной для присоединения (т. е., не отсоединённой), создаёт «нить-зомби». Лучше их избегать, так как нить-зомби потребляет некоторые системные ресурсы, и когда накапливается много нитей-зомби становится невозможно создание новых нитей (или процессов).

source: There is no pthreads analog of I<waitpid(-1,\ &status,\ 0)>, that is, "join with any terminated thread". If you believe you need this functionality, you probably need to rethink your application design.
ru: Аналога I<waitpid(-1,\ &status,\ 0)> в pthreads не существует, то есть присоединиться к любой завершившейся нити». Если вы уверены, что вам нужна такая возможность, то, вероятно, стоит пересмотреть проект приложения.

source: All of the threads in a process are peers: any thread can join with any other thread in the process.
ru: Все нити в процессе равноправны: любая нить может присоединиться к любой другой нити процесса.

source: pthread_attr_setschedparam, pthread_attr_getschedparam - set/get scheduling parameter attributes in thread attributes object
ru: pthread_attr_setschedparam, pthread_attr_getschedparam - изменяет/возвращает атрибуты параметров планирования из объекта атрибутов нити

source: The B<pthread_attr_setschedparam>() function sets the scheduling parameter attributes of the thread attributes object referred to by I<attr> to the values specified in the buffer pointed to by I<param>. These attributes determine the scheduling parameters of a thread created using the thread attributes object I<attr>.
ru: Функция B<pthread_attr_setschedparam>() изменяет атрибуты параметров планирования в объекте атрибутов нити, на который указывает I<attr>, в значения из буфера, на который указывает I<param>. Данными атрибутами определяются параметры планирования нити, созданной с учётом объекта атрибутов нити I<attr>.

source: The B<pthread_attr_getschedparam>() returns the scheduling parameter attributes of the thread attributes object I<attr> in the buffer pointed to by I<param>.
ru: Функция B<pthread_attr_getschedparam>() возвращает атрибуты параметров планирования у объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<param>.

source: Scheduling parameters are maintained in the following structure:
ru: Параметры планирования хранятся в структуре следующего вида:

source: struct sched_param { int sched_priority; /* Scheduling priority */ };
ru: struct sched_param { int sched_priority; /* планируемый приоритет */ };

source: As can be seen, only one scheduling parameter is supported. For details of the permitted ranges for scheduling priorities in each scheduling policy, see B<sched>(7).
ru: Из той структуры видно, что поддерживается только один параметр. Подробности о разрешённых диапазонах планируемых приоритетов для каждого алгоритма планирования смотрите в B<sched>(7).

source: In order for the parameter setting made by B<pthread_attr_setschedparam>() to have effect when calling B<pthread_create>(3), the caller must use B<pthread_attr_setinheritsched>(3) to set the inherit-scheduler attribute of the attributes object I<attr> to B<PTHREAD_EXPLICIT_SCHED>.
ru: Для учёта значения параметра, заданного B<pthread_attr_setschedparam>(), при вызове B<pthread_create>(3), вызывающий должен использовать B<pthread_attr_setinheritsched>(3) для присвоения атрибуту inherit-scheduler объекта атрибутов I<attr> значения B<PTHREAD_EXPLICIT_SCHED>.

source: B<pthread_attr_setschedparam>() can fail with the following error:
ru: Функция B<pthread_attr_setschedparam>() может завершиться со следующей ошибкой:

source: The priority specified in I<param> does not make sense for the current scheduling policy of I<attr>.
ru: Приоритет, указанный в I<param>, не имеет смысла при текущей политике планирования I<attr>.

source: POSIX.1 also documents an B<ENOTSUP> error for B<pthread_attr_setschedparam>(). This value is never returned on Linux (but portable and future-proof applications should nevertheless handle this error return value).
ru: В POSIX.1 также описана ошибка B<ENOTSUP> для B<pthread_attr_setschedparam>(). Это значение никогда не возвращается Linux (тем не менее, в переносимых и новых приложениях нужно учитывать возможность возврата этого значения ошибки).

source: See B<pthread_attr_setschedpolicy>(3) for a list of the thread scheduling policies supported on Linux.
ru: Список алгоритмов планирования для нитей, поддерживаемых в Linux смотрите в B<pthread_attr_setschedpolicy>(3).

source: See B<pthread_setschedparam>(3).
ru: Смотрите B<pthread_setschedparam>(3).

source: pthread_self - obtain ID of the calling thread
ru: pthread_self - возвращает ID вызвавшей нити

source: The B<pthread_self>() function returns the ID of the calling thread. This is the same value that is returned in I<*thread> in the B<pthread_create>(3) call that created this thread.
ru: Функция B<pthread_self>() возвращает идентификатор вызвавшей нити. Это значение совпадает с возвращаемым в I<*thread> вызовом B<pthread_create>(3) при создании этой нити.

source: This function always succeeds, returning the calling thread's ID.
ru: Данная функция всегда завершается успешно, возвращая идентификатор вызвавшей нити.

source: POSIX.1 allows an implementation wide freedom in choosing the type used to represent a thread ID; for example, representation using either an arithmetic type or a structure is permitted. Therefore, variables of type I<pthread_t> can't portably be compared using the C equality operator (B<==>); use B<pthread_equal>(3) instead.
ru: В POSIX.1 предоставляет реализации большую свободу выбора типа, используемого под идентификатор нити; например, допускается представление как виде целого числа так и структуры. Поэтому переменные типа I<pthread_t> нельзя сравнивать оператором равенства C (B<==>); для этого предназначена функция B<pthread_equal>(3).

source: Thread identifiers should be considered opaque: any attempt to use a thread ID other than in pthreads calls is nonportable and can lead to unspecified results.
ru: Состав идентификаторов нити следует считать «чёрным ящиком»: все попытки использовать ID нити кроме как в вызовах pthreads являются непереносимыми и могут приводить к непредсказуемым результатам.

source: Thread IDs are guaranteed to be unique only within a process. A thread ID may be reused after a terminated thread has been joined, or a detached thread has terminated.
ru: Для идентификаторов нити гарантируется их уникальность только внутри процесса. Идентификатор нити может использоваться повторно после присоединения завершённой нити или завершения отключённой нити.

source: The thread ID returned by B<pthread_self>() is not the same thing as the kernel thread ID returned by a call to B<gettid>(2).
ru: Идентификатор нити, возвращаемый B<pthread_self>() не тоже самое что идентификатор нити возвращаемый вызовом ядра B<gettid>(2).

source: pthread_sigmask - examine and change mask of blocked signals
ru: pthread_sigmask - проверяет и изменяет маску заблокированных сигналов

source: The B<pthread_sigmask>() function is just like B<sigprocmask>(2), with the difference that its use in multithreaded programs is explicitly specified by POSIX.1. Other differences are noted in this page.
ru: Функция B<pthread_sigmask>() подобна B<sigprocmask>(2), но используется в многонитевых программах, что явно указано в POSIX.1. Другие отличия приведены в этой странице.

source: For a description of the arguments and operation of this function, see B<sigprocmask>(2).
ru: Описание аргументов и работы функции смотрите в B<sigprocmask>(2).

source: On success, B<pthread_sigmask>() returns 0; on error, it returns an error number.
ru: При успешном выполнении B<pthread_sigmask>() возвращается 0; при ошибке возвращается номер ошибки.

source: See B<sigprocmask>(2).
ru: Смотрите B<sigprocmask>(2).
