Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The I<cpumask> file contains a comma-separated list of integers that indicate a representative CPU number for each socket (package) on the motherboard. This is needed when setting up uncore or northbridge events, as those PMUs present socket-wide events.
ru: В файле I<cpumask> содержится список целых чисел (через запятую), которые представляют номер ЦП для каждого сокета (пакета) на материнской плате. Он необходим для настройки внеядерных событий или событий северного моста, поскольку эти PMU представляют события всего сокета.

source: B<perf_event_open>() returns the new file descriptor, or -1 if an error occurred (in which case, I<errno> is set appropriately).
ru: Вызов B<perf_event_open>() возвращает новый дескриптор файла или -1 в случае ошибки (в этом случае I<errno> устанавливается в соответствующее значение).

source: The errors returned by B<perf_event_open>() can be inconsistent, and may vary across processor architectures and performance monitoring units.
ru: Ошибки, возвращаемые B<perf_event_open>(), могут различаться на разных процессорных архитектурах и модулях слежения за производительностью.

source: Returned if the I<perf_event_attr> I<size> value is too small (smaller than B<PERF_ATTR_SIZE_VER0>), too big (larger than the page size), or larger than the kernel supports and the extra bytes are not zero. When B<E2BIG> is returned, the I<perf_event_attr> I<size> field is overwritten by the kernel to be the size of the structure it was expecting.
ru: Возвращается, если значение I<perf_event_attr> I<size> слишком мало (меньше чем B<PERF_ATTR_SIZE_VER0>), слишком велико (больше размера страницы) или больше чем поддерживает ядро и дополнительные байты не равны нулю. При возврате B<E2BIG> ядро перезаписывает поле I<size> I<perf_event_attr> размером структуры, который ожидался.

source: Returned when the requested event requires B<CAP_SYS_ADMIN> permissions (or a more permissive perf_event paranoid setting). Some common cases where an unprivileged process may encounter this error: attaching to a process owned by a different user; monitoring all processes on a given CPU (i.e., specifying the I<pid> argument as -1); and not setting I<exclude_kernel> when the paranoid setting requires it.
ru: Возвращается, когда для запрашиваемого события требуется мандат B<CAP_SYS_ADMIN> (или более разрешительная параноидное perf_event). Распространённые случае, в которых непривилегированный процесс получает эту ошибку: присоединение к процессу, принадлежащему другому пользователю; слежение за всеми процессами на указанном ЦП (т. е., указание в аргументе I<pid> значения -1); не указано I<exclude_kernel>, когда параноидная настройка требует этого.

source: Returned if the I<group_fd> file descriptor is not valid, or, if B<PERF_FLAG_PID_CGROUP> is set, the cgroup file descriptor in I<pid> is not valid.
ru: Возвращается, если файловый дескриптор I<group_fd> некорректен, или если установлен B<PERF_FLAG_PID_CGROUP> и файловый дескриптор cgroup в I<pid> некорректен.

source: B<EBUSY> (since Linux 4.1)
ru: B<EBUSY> (начиная с Linux 4.1)

source: Returned if another event already has exclusive access to the PMU.
ru: Возвращается, если другое событие уже владеет эксклюзивным доступом к PMU.

source: Returned if the I<attr> pointer points at an invalid memory address.
ru: Возвращается, если указатель I<attr> указывает на некорректный адрес памяти.

source: Returned if the specified event is invalid. There are many possible reasons for this. A not-exhaustive list: I<sample_freq> is higher than the maximum setting; the I<cpu> to monitor does not exist; I<read_format> is out of range; I<sample_type> is out of range; the I<flags> value is out of range; I<exclusive> or I<pinned> set and the event is not a group leader; the event I<config> values are out of range or set reserved bits; the generic event selected is not supported; or there is not enough room to add the selected event.
ru: Возвращается, если указано некорректное событие. Может быть по многим причинам. Неполный список: значение I<sample_freq> больше, чем максимальное настроенное; значение I<cpu> для слежения не существует; значение I<read_format> вне пределов диапазона; значение I<sample_type> вне пределов диапазона; значение I<flags> вне пределов диапазона; указано значение I<exclusive> или I<pinned> и событие не является лидером группы; значения события I<config> вне пределов диапазона или задают зарезервированные биты; выбранное общее событие не поддерживается; не хватает места для добавления события.

source: Each opened event uses one file descriptor. If a large number of events are opened, the per-process limit on the number of open file descriptors will be reached, and no more events can be created.
ru: Каждое открытое событие использует один файловый дескриптор. Если открыто большое количество событий, то достигается процессное ограничение на количество открытых файловых дескрипторов и больше событий создать будет невозможно.

source: Returned when the event involves a feature not supported by the current CPU.
ru: Возвращается, когда событие используется свойство, которое не поддерживается текущим ЦП.

source: Returned if the I<type> setting is not valid. This error is also returned for some unsupported generic events.
ru: Возвращается, если значение I<type> некорректно. Эта ошибка также возвращается для некоторых неподдерживаемых общих событий.

source: Prior to Linux 3.3, if there was not enough room for the event, B<ENOSPC> was returned. In Linux 3.3, this was changed to B<EINVAL>. B<ENOSPC> is still returned if you try to add more breakpoint events than supported by the hardware.
ru: До Linux 3.3, при недостаточности места для события возвращалось значение B<ENOSPC>. В Linux 3.3 она была заменена на B<EINVAL>. Значение B<ENOSPC> всё ещё возвращается, если вы попытаетесь добавить больше событий точек прерывания, чем поддерживается аппаратно.

source: Returned if B<PERF_SAMPLE_STACK_USER> is set in I<sample_type> and it is not supported by hardware.
ru: Возвращается, если установлен B<PERF_SAMPLE_STACK_USER> в I<sample_type> и не поддерживается оборудованием.

source: Returned if an event requiring a specific hardware feature is requested but there is no hardware support. This includes requesting low-skid events if not supported, branch tracing if it is not available, sampling if no PMU interrupt is available, and branch stacks for software events.
ru: Возвращается, если требуемое событие запрашивает специального свойства аппаратуры, но оно отсутствует. Возникает при запросе низкоуровневых (low-skid) событий без поддержки, трассировке ветвления без поддержки, выборки, если отсутствует прерывание PMU и стеки ветви для программных событий.

source: B<EOVERFLOW> (since Linux 4.8)
ru: B<EOVERFLOW> (начиная с Linux 4.8)

source: Returned if B<PERF_SAMPLE_CALLCHAIN> is requested and I<sample_max_stack> is larger than the maximum specified in I</proc/sys/kernel/perf_event_max_stack>.
ru: Возвращается, если запрошена B<PERF_SAMPLE_CALLCHAIN> и значение I<sample_max_stack> больше максимального, указанного в I</proc/sys/kernel/perf_event_max_stack>.

source: Returned on many (but not all) architectures when an unsupported I<exclude_hv>, I<exclude_idle>, I<exclude_user>, or I<exclude_kernel> setting is specified.
ru: Возвращается на многих (но не всех) архитектурах, если указана неподдерживаемая настройка I<exclude_hv>, I<exclude_idle>, I<exclude_user> или I<exclude_kernel>.

source: It can also happen, as with B<EACCES>, when the requested event requires B<CAP_SYS_ADMIN> permissions (or a more permissive perf_event paranoid setting). This includes setting a breakpoint on a kernel address, and (since Linux 3.13) setting a kernel function-trace tracepoint.
ru: Также это может случаться как при B<EACCES>, когда запрашиваемое событие требует мандата B<CAP_SYS_ADMIN> (или более разрешительную параноидную настройку perf_event). Это относится к установке точки останова на адрес ядра и (начиная с Linux 3.13) установке точки трассировки функции ядра.

source: Returned if attempting to attach to a process that does not exist.
ru: Возвращается при попытке присоединения к несуществующему процессу.

source: VERSION
ru: ВЕРСИЯ

source: B<perf_event_open>() was introduced in Linux 2.6.31 but was called B<perf_counter_open>(). It was renamed in Linux 2.6.32.
ru: Системный вызов B<perf_event_open>() появился в Linux 2.6.31, но с именем B<perf_counter_open>(). Он был переименован в Linux 2.6.32.

source: This B<perf_event_open>() system call Linux-specific and should not be used in programs intended to be portable.
ru: Данный системный вызов B<perf_event_open>() существует только в Linux и не должен использоваться переносимых программах.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2). See the example below.
ru: В glibc нет обёртки для данного системного вызова; запускайте его с помощью B<syscall>(2). Смотрите пример ниже.

source: The official way of knowing if B<perf_event_open>() support is enabled is checking for the existence of the file I</proc/sys/kernel/perf_event_paranoid>.
ru: Официальным способом наличия поддержки B<perf_event_open>() является проверка существования файла I</proc/sys/kernel/perf_event_paranoid>.

source: The B<F_SETOWN_EX> option to B<fcntl>(2) is needed to properly get overflow signals in threads. This was introduced in Linux 2.6.32.
ru: Значение B<F_SETOWN_EX> в B<fcntl>(2) требуется для правильного получения сигналов переполнения в нитях. Появилось в Linux 2.6.32.

source: Prior to Linux 2.6.33 (at least for x86), the kernel did not check if events could be scheduled together until read time. The same happens on all known kernels if the NMI watchdog is enabled. This means to see if a given set of events works you have to B<perf_event_open>(), start, then read before you know for sure you can get valid measurements.
ru: До Linux 2.6.33 (как минимум, на x86), ядро не проверяло возможность планирования события для совместной работы до чтения. Это же происходит на всех известных ядрах при включённом сторожке NMI. Чтобы увидеть, работает ли заданный набор событий, выполните B<perf_event_open>(), запуск, затем выполните чтения, зная наверняка, что ещё не можете получить корректные измерения.

source: Prior to Linux 2.6.34, event constraints were not enforced by the kernel. In that case, some events would silently return "0" if the kernel scheduled them in an improper counter slot.
ru: До Linux 2.6.34 ограничения на события не соблюдались ядром. В этом случае некоторые события просто возвращали «0», если ядро планировало их в неподходящий слот счётчика.

source: Prior to Linux 2.6.34, there was a bug when multiplexing where the wrong results could be returned.
ru: До Linux 2.6.34 существовала ошибка в мультиплексировании, при котором могли вернуться некорректные результаты.

source: Kernels from Linux 2.6.35 to Linux 2.6.39 can quickly crash the kernel if "inherit" is enabled and many threads are started.
ru: Ядра с Linux 2.6.35 по Linux 2.6.39 могли быстро упасть, если включено «наследование» и запускалось много нитей.

source: Prior to Linux 2.6.35, B<PERF_FORMAT_GROUP> did not work with attached processes.
ru: До Linux 2.6.35 функция B<PERF_FORMAT_GROUP> не работает с присоединёнными процессами.

source: There is a bug in the kernel code between Linux 2.6.36 and Linux 3.0 that ignores the "watermark" field and acts as if a wakeup_event was chosen if the union has a nonzero value in it.
ru: Существует ошибка в коде ядра с Linux 2.6.36 по Linux 3.0, из-за которой игнорируется поле «watermark» и ядро работает, как если бы было выбрано wakeup_event, если объединение в нём не равно нулю.

source: From Linux 2.6.31 to Linux 3.4, the B<PERF_IOC_FLAG_GROUP> ioctl argument was broken and would repeatedly operate on the event specified rather than iterating across all sibling events in a group.
ru: С Linux 2.6.31 по Linux 3.4 аргумент ioctl B<PERF_IOC_FLAG_GROUP> работает неправильно и постоянно применяется к указанному событию, а не ко всем одноуровневым событиям в группе.

source: From Linux 3.4 to Linux 3.11, the mmap I<cap_usr_rdpmc> and I<cap_usr_time> bits mapped to the same location. Code should migrate to the new I<cap_user_rdpmc> and I<cap_user_time> fields instead.
ru: С Linux 3.4 по Linux 3.11, биты mmap I<cap_usr_rdpmc> и I<cap_usr_time> отображаются на одно расположение. Использующий их код нужно переписать, использовав новые поля I<cap_user_rdpmc> и I<cap_user_time>.

source: Always double-check your results! Various generalized events have had wrong values. For example, retired branches measured the wrong thing on AMD machines until Linux 2.6.35.
ru: Всегда дважды проверяйте результаты! Различные обобщённые события содержат некорректные результаты. Например, прошедшие ветви измеряются неправильно на машинах сAMD до Linux 2.6.35.

source: The following is a short example that measures the total instruction count of a call to B<printf>(3).
ru: Следующий короткий пример показывает как подсчитать количество инструкций в вызове B<printf>(3).

source: fd = perf_event_open(&pe, 0, -1, -1, 0); if (fd == -1) { fprintf(stderr, "Error opening leader %llx\en", pe.config); exit(EXIT_FAILURE); }
ru: fd = perf_event_open(&pe, 0, -1, -1, 0); if (fd == -1) { fprintf(stderr, "Ошибка открытия лидера %llx\en", pe.config); exit(EXIT_FAILURE); }

source: printf("Measuring instruction count for this printf\en");
ru: printf("Измерение счётчика количества инструкций для этого printf\en");

source: printf("Used %lld instructions\en", count);
ru: printf("Использовано %lld инструкций\en", count);

source: personality - set the process execution domain
ru: personality - задаёт домен исполнения процесса

source: Linux supports different execution domains, or personalities, for each process. Among other things, execution domains tell Linux how to map signal numbers into signal actions. The execution domain system allows Linux to provide limited support for binaries compiled under other UNIX-like operating systems.
ru: Linux поддерживает несколько видов доменов исполнения процессов или специализаций (personalities) для каждого процесса. Среди прочего, домены исполнения указывают Linux как связывать номера сигналов с обработчиками сигналов. Система доменов исполнения позволяет Linux частично поддерживать программы, собранные в других ОС, подобных UNIX.

source: If I<persona> is not 0xffffffff, then B<personality>() sets the caller's execution domain to the value specified by I<persona>. Specifying I<persona> as 0xffffffff provides a way of retrieving the current persona without changing it.
ru: Если значение I<persona> не равно 0xffffffff, то B<personality>() установит домен исполнения вызывающего равным значению I<persona>. Если значение I<persona> равно 0xffffffff, то возвращается текущую специализацию (persona) не изменяя её.

source: A list of the available execution domains can be found in I<E<lt>sys/personality.hE<gt>>. The execution domain is a 32-bit value in which the top three bytes are set aside for flags that cause the kernel to modify the behavior of certain system calls so as to emulate historical or architectural quirks. The least significant byte is value defining the personality the kernel should assume. The flag values are as follows:
ru: Список доступных доменов исполнения можно найти в I<E<lt>sys/personality.hE<gt>>. Домен исполнения — это 32-битное значение, в котором верхние три байта отведены под флаги, заставляющие ядро изменить поведение определённых системных вызов, чтобы они эмулировали устаревшие или архитектурные особенности. Младший байт содержит значение, определяющее специализацию, которую должно предполагать ядро. Значения флагов:

source: B<ADDR_COMPAT_LAYOUT> (since Linux 2.6.9)
ru: B<ADDR_COMPAT_LAYOUT> (начиная с Linux 2.6.9)

source: With this flag set, provide legacy virtual address space layout.
ru: При указании этого флага предоставляется устаревшая раскладка виртуального адресного пространства.

source: B<ADDR_NO_RANDOMIZE> (since Linux 2.6.12)
ru: B<ADDR_NO_RANDOMIZE> (начиная с Linux 2.6.12)

source: With this flag set, disable address-space-layout randomization.
ru: При указании этого флага отключается случайное расположение виртуального адресного пространства.

source: B<ADDR_LIMIT_32BIT> (since Linux 2.2)
ru: B<ADDR_LIMIT_32BIT> (начиная с Linux 2.2)

source: Limit the address space to 32 bits.
ru: Ограничивает адресное пространство 32 битами.

source: B<ADDR_LIMIT_3GB> (since Linux 2.4.0)
ru: B<ADDR_LIMIT_3GB> (начиная с Linux 2.4.0)

source: With this flag set, use 0xc0000000 as the offset at which to search a virtual memory chunk on B<mmap>(2); otherwise use 0xffffe000.
ru: При указании этого флага значение 0xc0000000 используется как смещение, по которому ищется блок (chunk) виртуальной памяти в B<mmap>(2); в противном случае используется 0xffffe000.

source: B<FDPIC_FUNCPTRS> (since Linux 2.6.11)
ru: B<FDPIC_FUNCPTRS> (начиная с Linux 2.6.11)

source: User-space function pointers to signal handlers point (on certain architectures) to descriptors.
ru: Указатели на функции пользовательского пространства для сигнальных обработчиков указывают (на определённых архитектурах) на дескрипторы.

source: B<MMAP_PAGE_ZERO> (since Linux 2.4.0)
ru: B<MMAP_PAGE_ZERO> (начиная с Linux 2.4.0)

source: Map page 0 as read-only (to support binaries that depend on this SVr4 behavior).
ru: Отображать страницу 0 только для чтения (для поддержки двоичных файлов, зависящих от такого поведения согласно SVr4).

source: B<READ_IMPLIES_EXEC> (since Linux 2.6.8)
ru: B<READ_IMPLIES_EXEC> (начиная с Linux 2.6.8)

source: With this flag set, B<PROT_READ> implies B<PROT_EXEC> for B<mmap>(2).
ru: При указании этого флага операция B<PROT_READ> в B<mmap>(2) подразумевает и B<PROT_EXEC>.

source: B<SHORT_INODE> (since Linux 2.4.0)
ru: B<SHORT_INODE> (начиная с Linux 2.4.0)

source: No effects(?).
ru: Никак не влияет(?).

source: B<STICKY_TIMEOUTS> (since Linux 1.2.0)
ru: B<STICKY_TIMEOUTS> (начиная с Linux 1.2.0)

source: With this flag set, B<select>(2), B<pselect>(2), and B<ppoll>(2) do not modify the returned timeout argument when interrupted by a signal handler.
ru: При указании этого флага вызовы B<select>(2), B<pselect>(2) и B<ppoll>(2) не изменяют возвращаемый аргумент ожидания, если их работа прерывается обработчиком сигнала.

source: B<UNAME26> (since Linux 3.1)
ru: B<UNAME26> (начиная с Linux 3.1)

source: Have B<uname>(2) report a 2.6.40+ version number rather than a 3.x version number. Added as a stopgap measure to support broken applications that could not handle the kernel version-numbering switch from 2.6.x to 3.x.
ru: Заставляет B<uname>(2) выдавать номер версии 2.6.40+, а не 3.x. Добавлен как временная мера поддержки некорректных приложений, которые не могут учесть переход в нумерации версий ядра с 2.6.x на 3.x.

source: B<WHOLE_SECONDS> (since Linux 1.2.0)
ru: B<WHOLE_SECONDS> (начиная с Linux 1.2.0)

source: The available execution domains are:
ru: Список доступных доменов исполнения:

source: B<PER_BSD> (since Linux 1.2.0)
ru: B<PER_BSD> (начиная с Linux 1.2.0)

source: BSD. (No effects.)
ru: BSD. (Никак не влияет)

source: B<PER_HPUX> (since Linux 2.4)
ru: B<PER_HPUX> (начиная с Linux 2.4)

source: Support for 32-bit HP/UX. This support was never complete, and was dropped so that since Linux 4.0, this value has no effect.
ru: Поддержка 32-битного HP/UX. Никогда не была полной и удалена начиная с Linux 4.0, данное значение никак не влияет на работу.

source: B<PER_IRIX32> (since Linux 2.2)
ru: B<PER_IRIX32> (начиная с Linux 2.2)

source: IRIX 5 32-bit. Never fully functional; support dropped in Linux 2.6.27. Implies B<STICKY_TIMEOUTS>.
ru: Поддержка 32-битного IRIX 5. Никогда полностью не работала; удалена в Linux 2.6.27. Подразумевает B<STICKY_TIMEOUTS>.

source: B<PER_IRIX64> (since Linux 2.2)
ru: B<PER_IRIX64> (начиная с Linux 2.2)

source: IRIX 6 64-bit. Implies B<STICKY_TIMEOUTS>; otherwise no effects.
ru: IRIX 6, 64-битная версия. Подразумевает B<STICKY_TIMEOUTS>; в противном случае никак не влияет.

source: B<PER_IRIXN32> (since Linux 2.2)
ru: B<PER_IRIXN32> (начиная с Linux 2.2)

source: IRIX 6 new 32-bit. Implies B<STICKY_TIMEOUTS>; otherwise no effects.
ru: IRIX 6, новая 32-битная версия. Подразумевает B<STICKY_TIMEOUTS>; в противном случае никак не влияет.

source: B<PER_ISCR4> (since Linux 1.2.0)
ru: B<PER_ISCR4> (начиная с Linux 1.2.0)

source: Implies B<STICKY_TIMEOUTS>; otherwise no effects.
ru: Подразумевает B<STICKY_TIMEOUTS>; в противном случае никак не влияет.

source: B<PER_LINUX> (since Linux 1.2.0)
ru: B<PER_LINUX> (начиная с Linux 1.2.0)

source: B<PER_LINUX32> (since Linux 2.2)
ru: B<PER_LINUX32> (начиная с Linux 2.2)

source: [To be documented.]
ru: [Будет описано.]

source: B<PER_LINUX32_3GB> (since Linux 2.4)
ru: B<PER_LINUX32_3GB> (начиная с Linux 2.4)

source: Implies B<ADDR_LIMIT_3GB>.
ru: Подразумевает B<ADDR_LIMIT_3GB>.

source: B<PER_LINUX_32BIT> (since Linux 2.0)
ru: B<PER_LINUX_32BIT> (начиная с Linux 2.0)

source: Implies B<ADDR_LIMIT_32BIT>.
ru: Подразумевает B<ADDR_LIMIT_32BIT>.

source: B<PER_LINUX_FDPIC> (since Linux 2.6.11)
ru: B<PER_LINUX_FDPIC> (начиная с Linux 2.6.11)

source: Implies B<FDPIC_FUNCPTRS>.
ru: Подразумевает B<FDPIC_FUNCPTRS>.

source: B<PER_OSF4> (since Linux 2.4)
ru: B<PER_OSF4> (начиная с Linux 2.4)

source: OSF/1 v4. On alpha, clear top 32 bits of iov_len in the user's buffer for compatibility with old versions of OSF/1 where iov_len was defined as. I<int>.
ru: OSF/1 v4. На alpha, очищает верхние 32 бита iov_len в пользовательском буфере для совместимости со старыми версиями OSF/1, где iov_len определено как I<int>.

source: B<PER_OSR5> (since Linux 2.4)
ru: B<PER_OSR5> (начиная с Linux 2.4)

source: Implies B<STICKY_TIMEOUTS> and B<WHOLE_SECONDS>; otherwise no effects.
ru: Подразумевает B<STICKY_TIMEOUTS> и B<WHOLE_SECONDS>; в противном случае никак не влияет.

source: B<PER_RISCOS> (since Linux 2.2)
ru: B<PER_RISCOS> (начиная с Linux 2.2)

source: B<PER_SCOSVR3> (since Linux 1.2.0)
ru: B<PER_SCOSVR3> (начиная с Linux 1.2.0)

source: Implies B<STICKY_TIMEOUTS>, B<WHOLE_SECONDS>, and B<SHORT_INODE>; otherwise no effects.
ru: Подразумевает B<STICKY_TIMEOUTS>, B<WHOLE_SECONDS> и B<SHORT_INODE>; в противном случае никак не влияет.

source: B<PER_SOLARIS> (since Linux 2.4)
ru: B<PER_SOLARIS> (начиная с Linux 2.4)

source: B<PER_SUNOS> (since Linux 2.4.0)
ru: B<PER_SUNOS> (начиная с Linux 2.4.0)

source: Implies B<STICKY_TIMEOUTS>. Divert library and dynamic linker searches to I</usr/gnemul>. Buggy, largely unmaintained, and almost entirely unused; support was removed in Linux 2.6.26.
ru: Подразумевает B<STICKY_TIMEOUTS>. Библиотека отклонений и динамический компоновщик ищутся в I</usr/gnemul>. Содержит ошибки, практически не сопровождается и почти никем не используется; поддержка была удалена в Linux 2.6.26.

source: B<PER_SVR3> (since Linux 1.2.0)
ru: B<PER_SVR3> (начиная с Linux 1.2.0)

source: Implies B<STICKY_TIMEOUTS> and B<SHORT_INODE>; otherwise no effects.
ru: Подразумевает B<STICKY_TIMEOUTS> и B<SHORT_INODE>; в противном случае никак не влияет.

source: B<PER_SVR4> (since Linux 1.2.0)
ru: B<PER_SVR4> (начиная с Linux 1.2.0)

source: Implies B<STICKY_TIMEOUTS> and B<MMAP_PAGE_ZERO>; otherwise no effects.
ru: Подразумевает B<STICKY_TIMEOUTS> и B<MMAP_PAGE_ZERO>; в противном случае никак не влияет.

source: B<PER_UW7> (since Linux 2.4)
ru: B<PER_UW7> (начиная с Linux 2.4)

source: B<PER_WYSEV386> (since Linux 1.2.0)
ru: B<PER_WYSEV386> (начиная с Linux 1.2.0)

source: B<PER_XENIX> (since Linux 1.2.0)
ru: B<PER_XENIX> (начиная с Linux 1.2.0)
