Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The I<passwd> structure is defined in I<E<lt>pwd.hE<gt>> as follows:
ru: Структура I<passwd> определена в I<E<lt>pwd.hE<gt>> таким образом:

source: struct passwd { char *pw_name; /* username */ char *pw_passwd; /* user password */ uid_t pw_uid; /* user ID */ gid_t pw_gid; /* group ID */ char *pw_gecos; /* real name */ char *pw_dir; /* home directory */ char *pw_shell; /* shell program */ };
ru: struct passwd { char *pw_name; /* имя пользователя */ char *pw_passwd; /* пароль пользователя */ uid_t pw_uid; /* идентификатор пользователя */ gid_t pw_gid; /* идентификатор группы */ char *pw_gecos; /* настоящее имя */ char *pw_dir; /* домашний каталог */ char *pw_shell; /* программная оболочка */ };

source: The B<putpwent>() function returns 0 on success, or -1 if an error occurs. In the event of an error, I<errno> is set to indicate the cause.
ru: Функция B<putpwent>() возвращает ноль при успешном выполнении и -1 в противном случае. При ошибке I<errno> отражает причину ошибки.

source: Invalid (NULL) argument given.
ru: Неверное значение (NULL) аргумента.

source: pthread_spin_init, pthread_spin_destroy - initialize or destroy a spin lock
ru: pthread_spin_init, pthread_spin_destroy - инициализирует или уничтожает циклическую блокировку

source: I<General note>: Most programs should use mutexes instead of spin locks. Spin locks are primarily useful in conjunction with real-time scheduling policies. See NOTES.
ru: I<Общее замечание>: Большинству программ достаточно использования мьютексов, а не циклических блокировок. В основном, циклические блокировки полезны при применении алгоритмов планирования реального времени. Смотрите ЗАМЕЧАНИЯ.

source: The B<pthread_spin_init>() function allocates any resources required for the use of the spin lock referred to by I<lock> and initializes the lock to be in the unlocked state. The I<pshared> argument must have one of the following values:
ru: Функция B<pthread_spin_init>() выделяет ресурсы, требуемые для работы циклической блокировки, на которую указывает I<lock>, и инициализирует блокировку в неблокированном состоянии. В аргументе I<pshared> должно быть одно из следующих значений:

source: The spin lock is to be operated on only by threads in the same process as the thread that calls B<pthread_spin_init>(). (Attempting to share the spin lock between processes results in undefined behavior.)
ru: Циклическая блокировка будет использоваться только нитями одного процесса, которому принадлежит вызвавшая B<pthread_spin_init>() нить (попытка использования такой циклической блокировки между процессами приводит к непредсказуемому поведению).

source: The spin lock may be operated on by any thread in any process that has access to the memory containing the lock (i.e., the lock may be in a shared memory object that is shared among multiple processes).
ru: Циклическая блокировка может использоваться любой нитью любого процесса, который имеет доступ к памяти, содержащей блокировку (т. е., блокировка может находиться в объекте общей памяти, который используется несколькими процессами).

source: Calling B<pthread_spin_init>() on a spin lock that has already been initialized results in undefined behavior.
ru: Вызов B<pthread_spin_init>() с уже инициализированной циклической блокировкой приводит к непредсказуемому поведению.

source: The B<pthread_spin_destroy>() function destroys a previously initialized spin lock, freeing any resources that were allocated for that lock. Destroying a spin lock that has not been previously been initialized or destroying a spin lock while another thread holds the lock results in undefined behavior.
ru: Функция B<pthread_spin_destroy>() уничтожает ранее инициализированную циклическую блокировку, освобождая все выделенные ей ресурсы. Уничтожение ещё не инициализированной циклической блокировки или уничтожение циклической блокировки, которая захвачена другой нитью,приводит к непредсказуемым результатам.

source: Once a spin lock has been destroyed, performing any operation on the lock other than once more initializing it with B<pthread_spin_init>() results in undefined behavior.
ru: После того, как циклическая блокировка уничтожена, выполнение с ней любой операции кроме инициализации B<pthread_spin_init>() приводит к непредсказуемому поведению.

source: The result of performing operations such as B<pthread_spin_lock>(3), B<pthread_spin_unlock>(3), and B<pthread_spin_destroy>(3) on I<copies> of the object referred to by I<lock> is undefined.
ru: Результат выполнения операций B<pthread_spin_lock>(3), B<pthread_spin_unlock>(3) и B<pthread_spin_destroy>(3) с I<копией> объекта, на который указывает I<lock>, не определён.

source: On success, there functions return zero. On failure, they return an error number. In the event that B<pthread_spin_init>() fails, the lock is not initialized.
ru: При успешном выполнении эти функции возвращают ноль. При ошибке возвращается номер ошибки. Если ошибкой завершается B<pthread_spin_init>(), то инициализация блокировки не происходит.

source: B<pthread_spin_init>() may fail with the following errors:
ru: Функция B<pthread_spin_init>() может завершаться со следующими ошибками:

source: The system has insufficient resources to initialize a new spin lock.
ru: В системе не хватает ресурсов для инициализации новой циклической блокировки.

source: Insufficient memory to initialize the spin lock.
ru: Недостаточно памяти для инициализации циклической блокировки.

source: Support for process-shared spin locks is a POSIX option. The option is supported in the glibc implementation.
ru: Поддержка общих для процессов циклических блокировок указана в POSIX. Она поддерживается реализацией glibc.

source: Spin locks should be employed in conjunction with real-time scheduling policies (B<SCHED_FIFO>, or possibly B<SCHED_RR>). Use of spin locks with nondeterministic scheduling policies such as B<SCHED_OTHER> probably indicates a design mistake. The problem is that if a thread operating under such a policy is scheduled off the CPU while it holds a spin lock, then other threads will waste time spinning on the lock until the lock holder is once more rescheduled and releases the lock.
ru: Циклические блокировки должны использоваться вместе с алгоритмами выполнения реального времени (B<SCHED_FIFO> или, возможно, B<SCHED_RR>). Использование циклических блокировок с недерминированными алгоритмами планирования, такими как B<SCHED_OTHER>, вероятно, указывают на ошибки при проектировании. Проблема в том, что если нить, выполняющаяся по такому алгоритму, вытеснится с ЦП в момент когда она удерживает циклическую блокировку, остальные нити будут впустую тратить время на ожидание блокировки, пока держатель не будет запланирован к выполнению и не освободит блокировку.

source: If threads create a deadlock situation while employing spin locks, those threads will spin forever consuming CPU time.
ru: Если нити создают ситуацию взаимной блокировки при работе с циклическими блокировками, то эти нити будут ждать блокировку бесконечно потребляя время ЦП.

source: User-space spin locks are I<not> applicable as a general locking solution. They are, by definition, prone to priority inversion and unbounded spin times. A programmer using spin locks must be exceptionally careful not only in the code, but also in terms of system configuration, thread placement, and priority assignment.
ru: Циклические блокировки пользовательского пространства I<не> применяются в качестве обычного решения по блокировкам. Они, по определению, подвержены смене приоритетов и неограниченны по времени ожидания. Программист, использующий циклические блокировки, должен быть исключительно осмотрителен не только с кодом, но и с настройкой системы, размещением нити и назначением приоритета.

source: pthread_mutex_consistent - make a robust mutex consistent
ru: pthread_mutex_consistent - делает устойчивый мьютекс согласованным

source: This function makes a robust mutex consistent if it is in an inconsistent state. A mutex can be left in an inconsistent state if its owner terminates while holding the mutex, in which case the next owner who acquires the mutex will succeed and be notified by a return value of B<EOWNERDEAD> from a call to B<pthread_mutex_lock>().
ru: Данная функция делает устойчивый мьютекс согласованным, если он находится в рассогласованном состоянии. Мьютекс может остаться в рассогласованном состоянии, если владелец завершил работу, удерживая мьютекс; в этом случае следующий владелец, захвативший мьютекс вызовом B<pthread_mutex_lock>(), получит уведомление возвращаемым значением B<EOWNERDEAD> .

source: On success, I<pthread_mutex_consistent>() returns 0. Otherwise, it returns a positive error number to indicate the cause of the error.
ru: При успешном выполнении I<pthread_mutex_consistent>() возвращает 0. В противном случае возвращается положительный номер, указывающий на причину ошибки.

source: The mutex is either not robust or is not in an inconsistent state.
ru: Мьютекс находит не в согласованном состоянии и не в рассогласованном состоянии.

source: B<pthread_mutex_consistent>() was added to glibc in version 2.12.
ru: Функция B<pthread_mutex_consistent>() впервые появилась в glibc 2.12.

source: B<pthread_mutex_consistent>() simply informs the implementation that the state (shared data) guarded by the mutex has been restored to a consistent state and that normal operations can now be performed with the mutex. It is the application's responsibility to ensure that the shared data has been restored to a consistent state before calling B<pthread_mutex_consistent>().
ru: Функция B<pthread_mutex_consistent>() просто информирует реализацию, что состояние (общие данные) защищаемые мьютексом, были восстановлены в согласованное состояние и что теперь с мьютексом можно выполнять обычные операции. Перед вызовом B<pthread_mutex_consistent>() приложение само должно приводить данные в согласованное состояние.

source: Before the addition of B<pthread_mutex_consistent>() to POSIX, glibc defined the following equivalent nonstandard function if B<_GNU_SOURCE> was defined:
ru: До появления B<pthread_mutex_consistent>() в POSIX, в glibc определялся следующий эквивалент нестандартной функции, если определён B<_GNU_SOURCE>:

source: This GNU-specific API, which first appeared in glibc 2.4, is nowadays obsolete and should not be used in new programs.
ru: Данный имеющийся только в GNU программный интерфейс, впервые появившийся в glibc 2.4, в настоящее время устарел и не должен использоваться в новых программах.

source: See B<pthread_mutexattr_setrobust>(3).
ru: Смотрите B<pthread_mutexattr_setrobust>(3).

source: pthread_setschedparam, pthread_getschedparam - set/get scheduling policy and parameters of a thread
ru: pthread_setschedparam, pthread_getschedparam - изменяет/возвращает параметры и алгоритм планирования нити

source: The B<pthread_setschedparam>() function sets the scheduling policy and parameters of the thread I<thread>.
ru: Функция B<pthread_setschedparam>() назначает параметры и алгоритм планирования нити I<thread>.

source: I<policy> specifies the new scheduling policy for I<thread>. The supported values for I<policy>, and their semantics, are described in B<sched>(7).
ru: В I<policy> указывается новый алгоритм планирования I<thread>. Поддерживаемые значения I<policy> и их семантика описана в B<sched>(7).

source: The structure pointed to by I<param> specifies the new scheduling parameters for I<thread>. Scheduling parameters are maintained in the following structure:
ru: Структура, на которую указывает I<param> определяет новые параметры планирования I<thread>. Параметры планирования хранятся в структуре следующего вида:

source: The B<pthread_getschedparam>() function returns the scheduling policy and parameters of the thread I<thread>, in the buffers pointed to by I<policy> and I<param>, respectively. The returned priority value is that set by the most recent B<pthread_setschedparam>(), B<pthread_setschedprio>(3), or B<pthread_create>(3) call that affected I<thread>. The returned priority does not reflect any temporary priority adjustments as a result of calls to any priority inheritance or priority ceiling functions (see, for example, B<pthread_mutexattr_setprioceiling>(3) and B<pthread_mutexattr_setprotocol>(3)).
ru: Функция B<pthread_getschedparam>() возвращает параметры и алгоритм планирования нити I<thread> в буфер, указанный I<policy> и I<param>, соответственно. Возвращаемое значение приоритета совпадает с заданным с помощью последнего вызова B<pthread_setschedparam>(), B<pthread_setschedprio>(3) или B<pthread_create>(3), относящегося к I<thread>. Возвращаемые приоритет не отражает каких-либо временных подстроек приоритета в результате вызовов функций наследования приоритета или потолка (например, смотрите B<pthread_mutexattr_setprioceiling>(3) и B<pthread_mutexattr_setprotocol>(3)).

source: On success, these functions return 0; on error, they return a nonzero error number. If B<pthread_setschedparam>() fails, the scheduling policy and parameters of I<thread> are not changed.
ru: При успешном выполнении эти функции возвращают 0; при ошибке возвращается ненулевой номер ошибки. Если B<pthread_setschedparam>() завершается ошибкой, то параметры и алгоритм планирования I<thread> не изменяется.

source: Both of these functions can fail with the following error:
ru: Это функции могут завершиться со следующей ошибкой:

source: B<pthread_setschedparam>() may additionally fail with the following errors:
ru: Функция B<pthread_setschedparam>() может также завершиться со следующими ошибками:

source: I<policy> is not a recognized policy, or I<param> does not make sense for the I<policy>.
ru: Неизвестное значение I<policy> или значение I<param> не имеет смысла для I<policy>.

source: The caller does not have appropriate privileges to set the specified scheduling policy and parameters.
ru: Вызывающий не имеет соответствующих прав для установки указанного алгоритма планирования и параметров.

source: POSIX.1 also documents an B<ENOTSUP> ("attempt was made to set the policy or scheduling parameters to an unsupported value") error for B<pthread_setschedparam>().
ru: Для B<pthread_setschedparam>() в POSIX.1 также описана необязательная ошибка B<ENOTSUP> («попытка изменить параметры и алгоритм планирования на не поддерживаемое значение»).

source: For a description of the permissions required to, and the effect of, changing a thread's scheduling policy and priority, and details of the permitted ranges for priorities in each scheduling policy, see B<sched>(7).
ru: Список требуемых прав, результат, изменение алгоритма и приоритета планирования нити и подробности разрешённых диапазонов приоритетов для каждого алгоритма планирования смотрите в B<sched>(7).

source: The program below demonstrates the use of B<pthread_setschedparam>() and B<pthread_getschedparam>(), as well as the use of a number of other scheduling-related pthreads functions.
ru: Представленная ниже программа показывает использование B<pthread_setschedparam>() и B<pthread_getschedparam>(), а также других относящихся к планированию функций программного интерфейса pthreads.

source: In the following run, the main thread sets its scheduling policy to B<SCHED_FIFO> with a priority of 10, and initializes a thread attributes object with a scheduling policy attribute of B<SCHED_RR> and a scheduling priority attribute of 20. The program then sets (using B<pthread_attr_setinheritsched>(3)) the inherit scheduler attribute of the thread attributes object to B<PTHREAD_EXPLICIT_SCHED>, meaning that threads created using this attributes object should take their scheduling attributes from the thread attributes object. The program then creates a thread using the thread attributes object, and that thread displays its scheduling policy and priority.
ru: В этом сеансе, главная нить изменяет свой алгоритм планирования на B<SCHED_FIFO> с приоритетом 10, и инициализирует объект атрибутов нити с атрибутом алгоритма планирования B<SCHED_RR> и атрибутом приоритета планирования 20. Затем программа изменяет (с помощью B<pthread_attr_setinheritsched>(3)) атрибут наследования планировщика в объекте атрибутов нити на B<PTHREAD_EXPLICIT_SCHED>, из-за чего создаваемые с использованием данного объекта атрибутов нити получат значения атрибуты планирования из объекта атрибутов нити. Затем программа создаёт нить с учётом объекта атрибутов нити, после чего эта нить выводит значения своего алгоритма и приоритета планирования.

source: $ B<su> # Need privilege to set real-time scheduling policies Password: # B<./a.out -mf10 -ar20 -i e> Scheduler settings of main thread policy=SCHED_FIFO, priority=10
ru: $ B<su> # требуются права для назначения алгоритмов планирования реального времени Пароль: # B<./a.out -mf10 -ar20 -i e> Настройки планировщика главной нити алгоритм=SCHED_FIFO, приоритет=10

source: Scheduler settings in \(aqattr\(aq policy=SCHED_RR, priority=20 inheritsched is EXPLICIT
ru: Настройки планировщика в \(aqattr\(aq алгоритм=SCHED_RR, приоритет=20 наследование планировщика ЯВНОЕ

source: Scheduler attributes of new thread policy=SCHED_RR, priority=20
ru: Атрибуты планировщика в новой нити алгоритм=SCHED_RR, приоритет=20

source: In the above output, one can see that the scheduling policy and priority were taken from the values specified in the thread attributes object.
ru: В показанном выше выводе можно видеть приоритет и алгоритм планирования, которые были взяты из объекта атрибутов нити.

source: The next run is the same as the previous, except that the inherit scheduler attribute is set to B<PTHREAD_INHERIT_SCHED>, meaning that threads created using the thread attributes object should ignore the scheduling attributes specified in the attributes object and instead take their scheduling attributes from the creating thread.
ru: Следующий сеанс похож на предыдущий, то в нём атрибут наследования планировщика равен B<PTHREAD_INHERIT_SCHED>, то есть создаваемые с использованием объекта атрибутов нити игнорируют значения параметров и алгоритм планирования, заданные в объекте атрибутов нити, и берут их от создавшей нити.

source: # B<./a.out -mf10 -ar20 -i i> Scheduler settings of main thread policy=SCHED_FIFO, priority=10
ru: # B<./a.out -mf10 -ar20 -i i> Настройки планировщика главной нити алгоритм=SCHED_FIFO, приоритет=10

source: Scheduler settings in \(aqattr\(aq policy=SCHED_RR, priority=20 inheritsched is INHERIT
ru: Настройки планировщика в \(aqattr\(aq алгоритм=SCHED_RR, приоритет=20 наследование планировщика ВКЛЮЧЕНО

source: Scheduler attributes of new thread policy=SCHED_FIFO, priority=10
ru: Атрибуты планировщика в новой нити алгоритм=SCHED_FIFO, приоритет=10

source: In the above output, one can see that the scheduling policy and priority were taken from the creating thread, rather than the thread attributes object.
ru: В показанном выше выводе можно видеть приоритет и алгоритм планирования, которые были взяты из создаваемой нити, а не из объекта атрибутов нити.

source: Note that if we had omitted the I<-i\ i> option, the output would have been the same, since B<PTHREAD_INHERIT_SCHED> is the default for the inherit scheduler attribute.
ru: Заметим, чти если не указать параметр I<-i\ i>, то вывод будет тем же самым, так как B<PTHREAD_INHERIT_SCHED> является значением по умолчанию для атрибута наследования планировщика.

source: fprintf(stderr, "Usage: %s [options]\en", prog_name); fprintf(stderr, "Options are:\en"); #define fpe(msg) fprintf(stderr, "\et%s", msg); /* Shorter */ fpe("-aE<lt>policyE<gt>E<lt>prioE<gt> Set scheduling policy and priority in\en"); fpe(" thread attributes object\en"); fpe(" E<lt>policyE<gt> can be\en"); fpe(" f SCHED_FIFO\en"); fpe(" r SCHED_RR\en"); fpe(" o SCHED_OTHER\en"); fpe("-A Use default thread attributes object\en"); fpe("-i {e|i} Set inherit scheduler attribute to\en"); fpe(" \(aqexplicit\(aq or \(aqinherit\(aq\en"); fpe("-mE<lt>policyE<gt>E<lt>prioE<gt> Set scheduling policy and priority on\en"); fpe(" main thread before pthread_create() call\en"); exit(EXIT_FAILURE); }
ru: fprintf(stderr, "Использование: %s [параметры]\en", prog_name); fprintf(stderr, "Параметры:\en"); #define fpe(msg) fprintf(stderr, "\et%s", msg); /* для краткости */ fpe("-aE<lt>алгоритмE<gt>E<lt>приоритетE<gt> Алгоритм и приоритет планирования\en"); fpe(" объекте атрибутов нити\en"); fpe(" значения для E<lt>алгоритмE<gt>:\en"); fpe(" f SCHED_FIFO\en"); fpe(" r SCHED_RR\en"); fpe(" o SCHED_OTHER\en"); fpe("-A Исп. объект атрибутов нити по умолчанию\en"); fpe("-i {e|i} Атрибут наследования планировщика\en"); fpe(" \(aqявный\(aq or \(aqунаследованный\(aq\en"); fpe("-mE<lt>алгоритмE<gt>E<lt>приоритетE<gt> Алгоритм и приоритет планирования\en"); fpe(" главной нити перед вызовом pthread_create()\en"); exit(EXIT_FAILURE); }

source: static void display_sched_attr(int policy, struct sched_param *param) { printf(" policy=%s, priority=%d\en", (policy == SCHED_FIFO) ? "SCHED_FIFO" : (policy == SCHED_RR) ? "SCHED_RR" : (policy == SCHED_OTHER) ? "SCHED_OTHER" : "???", param-E<gt>sched_priority); }
ru: static void display_sched_attr(int policy, struct sched_param *param) { printf(" алгоритм=%s, приоритет=%d\en", (policy == SCHED_FIFO) ? "SCHED_FIFO" : (policy == SCHED_RR) ? "SCHED_RR" : (policy == SCHED_OTHER) ? "SCHED_OTHER" : "???", param-E<gt>sched_priority); }

source: static void * thread_start(void *arg) { display_thread_sched_attr("Scheduler attributes of new thread");
ru: static void * thread_start(void *arg) { display_thread_sched_attr("Атрибуты планировщика в новой нити");

source: /* Process command-line options */
ru: /* обработка параметров командной строки */

source: while ((opt = getopt(argc, argv, "a:Ai:m:")) != -1) { switch (opt) { case \(aqa\(aq: attr_sched_str = optarg; break; case \(aqA\(aq: use_null_attrib = 1; break; case \(aqi\(aq: inheritsched_str = optarg; break; case \(aqm\(aq: main_sched_str = optarg; break; default: usage(argv[0], "Unrecognized option\en"); } }
ru: while ((opt = getopt(argc, argv, "a:Ai:m:")) != -1) { switch (opt) { case \(aqa\(aq: attr_sched_str = optarg; break; case \(aqA\(aq: use_null_attrib = 1; break; case \(aqi\(aq: inheritsched_str = optarg; break; case \(aqm\(aq: main_sched_str = optarg; break; default: usage(argv[0], "Неизвестный параметр\en"); } }

source: if (use_null_attrib && (inheritsched_str != NULL || attr_sched_str != NULL)) usage(argv[0], "Can\(aqt specify -A with -i or -a\en");
ru: if (use_null_attrib && (inheritsched_str != NULL || attr_sched_str != NULL)) usage(argv[0], "Нельзя указывать -A вместе с -i или -a\en");

source: /* Optionally set scheduling attributes of main thread, and display the attributes */
ru: /* необязательная установка атрибутов планирования главной нити вывод этих атрибутов */

source: if (main_sched_str != NULL) { if (!get_policy(main_sched_str[0], &policy)) usage(argv[0], "Bad policy for main thread (-m)\en"); param.sched_priority = strtol(&main_sched_str[1], NULL, 0);
ru: if (main_sched_str != NULL) { if (!get_policy(main_sched_str[0], &policy)) usage(argv[0], "Некоррект. алгоритм для главной нити (-m)\en"); param.sched_priority = strtol(&main_sched_str[1], NULL, 0);

source: display_thread_sched_attr("Scheduler settings of main thread"); printf("\en");
ru: display_thread_sched_attr("Настройки планировщика главной нити"); printf("\en");

source: /* Initialize thread attributes object according to options */
ru: /* инициализация объекта атрибутов нити согласно параметрам */
