Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Each thread has two associated timer slack values: a "default" value, and a "current" value. This operation sets the "current" timer slack value for the calling thread. I<arg2> is an unsigned long value, then maximum "current" value is ULONG_MAX and the minimum "current" value is 1. If the nanosecond value supplied in I<arg2> is greater than zero, then the "current" value is set to this value. If I<arg2> is equal to zero, the "current" timer slack is reset to the thread's "default" timer slack value.
ru: Каждая нити имеет два связанных с таймером значения допуска: значение «по умолчанию» и «текущее» значение. Эта операция изменяет «текущее» значение допуска таймера вызывающей нити. Значение I<arg2> имеет тип длинного беззнакового целого, то есть максимальное «текущее» значение равно ULONG_MAX, а минимальное «текущее» значение равно 1. Если наносекундное значение из I<arg2> больше нуля, то оно присваивается «текущему» значению. Если I<arg2> равно 0, то «текущий» допуск таймера нити сбрасывается в значение допуска таймера «по умолчанию».

source: The "current" timer slack is used by the kernel to group timer expirations for the calling thread that are close to one another; as a consequence, timer expirations for the thread may be up to the specified number of nanoseconds late (but will never expire early). Grouping timer expirations can help reduce system power consumption by minimizing CPU wake-ups.
ru: «Текущий» допуск таймера используется ядром для группировки таймерных окончаний при вызовах нити, которые происходят очень часто; как следствие, таймерные окончания нити могут быть равны до указанной наносекундной задержки (но никогда не будут истекать ранее). Группировка таймерных окончаний может помочь сократить потребление энергии системой, в следствии сокращения количества пробуждений ЦП.

source: The timer expirations affected by timer slack are those set by B<select>(2), B<pselect>(2), B<poll>(2), B<ppoll>(2), B<epoll_wait>(2), B<epoll_pwait>(2), B<clock_nanosleep>(2), B<nanosleep>(2), and B<futex>(2) (and thus the library functions implemented via futexes, including B<pthread_cond_timedwait>(3), B<pthread_mutex_timedlock>(3), B<pthread_rwlock_timedrdlock>(3), B<pthread_rwlock_timedwrlock>(3), and B<sem_timedwait>(3)).
ru: Таймерные окончания, на которые влияет допуск таймера, устанавливаются B<select>(2), B<pselect>(2), B<poll>(2), B<ppoll>(2), B<epoll_wait>(2), B<epoll_pwait>(2), B<clock_nanosleep>(2), B<nanosleep>(2) и B<futex>(2) (и, следовательно, все библиотечными функциями, реализованными через futex: B<pthread_cond_timedwait>(3), B<pthread_mutex_timedlock>(3), B<pthread_rwlock_timedrdlock>(3), B<pthread_rwlock_timedwrlock>(3) и B<sem_timedwait>(3)).

source: Timer slack is not applied to threads that are scheduled under a real-time scheduling policy (see B<sched_setscheduler>(2)).
ru: Допуск таймера не применяется к нитям, которые планируются в соответствии с политикой реального времени (смотрите B<sched_setscheduler>(2)).

source: When a new thread is created, the two timer slack values are made the same as the "current" value of the creating thread. Thereafter, a thread can adjust its "current" timer slack value via B<PR_SET_TIMERSLACK>. The "default" value can't be changed. The timer slack values of I<init> (PID 1), the ancestor of all processes, are 50,000 nanoseconds (50 microseconds). The timer slack value is inherited by a child created via B<fork>(2), and is preserved across B<execve>(2).
ru: При создании новой нити этим двум значениям присваивается значение «текущего» допуска создающей нити. После этого нить может подстроить значение своего «текущего» допуска таймера с помощью B<PR_SET_TIMERSLACK> (значение по умолчанию не может быть изменено). Значения допуска таймера для I<init> (PID 1), предка всех процессов, равно 50000 наносекунд (50 микросекунд). Значения допуска таймера наследуются потомком при B<fork>(2) и сохраняются при вызове B<execve>(2).

source: Since Linux 4.6, the "current" timer slack value of any process can be examined and changed via the file I</proc/[pid]/timerslack_ns>. See B<proc>(5).
ru: Начиная с Linux 4.6 значение «текущего» допуска таймера любого процесса можно получить и изменить через файл I</proc/[pid]/timerslack_ns>. Смотрите B<proc>(5).

source: B<PR_GET_TIMERSLACK> (since Linux 2.6.28)
ru: B<PR_GET_TIMERSLACK> (начиная с Linux 2.6.28)

source: Return (as the function result) the "current" timer slack value of the calling thread.
ru: Возвращает значение «текущего» допуска (как результат функции) таймера вызывающей нити.

source: B<PR_SET_TIMING> (since Linux 2.6.0)
ru: B<PR_SET_TIMING> (начиная с Linux 2.6.0)

source: Set whether to use (normal, traditional) statistical process timing or accurate timestamp-based process timing, by passing B<PR_TIMING_STATISTICAL> or B<PR_TIMING_TIMESTAMP> to I<arg2>. B<PR_TIMING_TIMESTAMP> is not currently implemented (attempting to set this mode will yield the error B<EINVAL>).
ru: Включает использование обычного статистического временного режима выполнения процесса (process timing) или точного режима на основе меток времени (timestamp-based process timing), при передаче B<PR_TIMING_STATISTICAL> или B<PR_TIMING_TIMESTAMP> в I<arg2>. Действия для B<PR_TIMING_TIMESTAMP> пока не реализованы (попытка установить этот режим приведёт к ошибке B<EINVAL>).

source: B<PR_GET_TIMING> (since Linux 2.6.0)
ru: B<PR_GET_TIMING> (начиная с Linux 2.6.0)

source: Return (as the function result) which process timing method is currently in use.
ru: Возвращает (как результат функции) тип используемого в данный момент временного режима выполнения процесса.

source: B<PR_SET_TSC> (since Linux 2.6.26, x86 only)
ru: B<PR_SET_TSC> (начиная с Linux 2.6.26, только для x86)

source: Set the state of the flag determining whether the timestamp counter can be read by the process. Pass B<PR_TSC_ENABLE> to I<arg2> to allow it to be read, or B<PR_TSC_SIGSEGV> to generate a B<SIGSEGV> when the process tries to read the timestamp counter.
ru: Устанавливает состояние флага, определяющего может ли процесс прочитать счётчик метки времени (timestamp counter). Значение B<PR_TSC_ENABLE> в I<arg2> разрешает чтение, B<PR_TSC_SIGSEGV> включает генерацию B<SIGSEGV>, если процесс пытается прочитать счётчик метки времени.

source: B<PR_GET_TSC> (since Linux 2.6.26, x86 only)
ru: B<PR_GET_TSC> (начиная с Linux 2.6.26, только для x86)

source: Return the state of the flag determining whether the timestamp counter can be read, in the location pointed to by I<(int\ *) arg2>.
ru: Записывает значение флага, определяющего может ли быть прочитан счётчик метки времени (timestamp counter), по адресу, указанному в I<(int\ *) arg2>.

source: (Only on: ia64, since Linux 2.3.48; parisc, since Linux 2.6.15; PowerPC, since Linux 2.6.18; Alpha, since Linux 2.6.22; sh, since Linux 2.6.34; tile, since Linux 3.12) Set unaligned access control bits to I<arg2>. Pass B<PR_UNALIGN_NOPRINT> to silently fix up unaligned user accesses, or B<PR_UNALIGN_SIGBUS> to generate B<SIGBUS> on unaligned user access. Alpha also supports an additional flag with the value of 4 and no corresponding named constant, which instructs kernel to not fix up unaligned accesses (it is analogous to providing the B<UAC_NOFIX> flag in B<SSI_NVPAIRS> operation of the B<setsysinfo>() system call on Tru64).
ru: (только для: ia64, начиная с Linux 2.3.48; parisc, начиная с Linux 2.6.15; PowerPC, начиная с Linux 2.6.18; Alpha, начиная с Linux 2.6.22; sh, начиная с Linux 2.6.34; tile, начиная с Linux 3.12) Устанавливает значение битов контроля доступа выравнивания равным значению I<arg2>. При значении B<PR_UNALIGN_NOPRINT> пользовательский доступ без выравнивания без уведомления исправляется, а при B<PR_UNALIGN_SIGBUS> генерируется сигнал B<SIGBUS>. На Alpha также поддерживается дополнительный флаг со значением 4 (именованная константа отсутствует), который указывает ядру не исправлять невыровненный доступ (аналогично флагу B<UAC_NOFIX> в операции B<SSI_NVPAIRS> системного вызова B<setsysinfo>() на Tru64).

source: (see B<PR_SET_UNALIGN> for information on versions and architectures) Return unaligned access control bits, in the location pointed to by I<(unsigned int\ *) arg2>.
ru: (информацию о версиях и архитектурах смотрите в B<PR_SET_UNALIGN>) Записывает значение битов контроля доступа выравнивания по адресу, указанному в I<(unsigned int\ *) arg2>.

source: On success, B<PR_GET_DUMPABLE>, B<PR_GET_KEEPCAPS>, B<PR_GET_NO_NEW_PRIVS>, B<PR_GET_THP_DISABLE>, B<PR_CAPBSET_READ>, B<PR_GET_TIMING>, B<PR_GET_TIMERSLACK>, B<PR_GET_SECUREBITS>, B<PR_MCE_KILL_GET>, B<PR_CAP_AMBIENT>+B<PR_CAP_AMBIENT_IS_SET>, and (if it returns) B<PR_GET_SECCOMP> return the nonnegative values described above. All other I<option> values return 0 on success. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении для операций B<PR_GET_DUMPABLE>, B<PR_GET_KEEPCAPS>, B<PR_GET_NO_NEW_PRIVS>, B<PR_GET_THP_DISABLE>, B<PR_CAPBSET_READ>, B<PR_GET_TIMING>, B<PR_GET_TIMERSLACK>, B<PR_GET_SECUREBITS>, B<PR_MCE_KILL_GET>, B<PR_CAP_AMBIENT>+B<PR_CAP_AMBIENT_IS_SET>, и (если возвращается) B<PR_GET_SECCOMP> возвращаются неотрицательные значения, описанные ранее. При успешном выполнении для остальных значений I<option> возвращается 0. При ошибке возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: I<option> is B<PR_SET_SECCOMP> and I<arg2> is B<SECCOMP_MODE_FILTER>, but the process does not have the B<CAP_SYS_ADMIN> capability or has not set the I<no_new_privs> attribute (see the discussion of B<PR_SET_NO_NEW_PRIVS> above).
ru: Значение I<option> равно B<PR_SET_SECCOMP> и I<arg2> равно B<SECCOMP_MODE_FILTER>, но процесс не имеет мандата B<CAP_SYS_ADMIN> или установленного атрибута I<no_new_privs> (смотрите обсуждение B<PR_SET_NO_NEW_PRIVS> выше).

source: I<option> is B<PR_SET_MM>, and I<arg3> is B<PR_SET_MM_EXE_FILE>, the file is not executable.
ru: Значение I<option> равно B<PR_SET_MM>, а I<arg3> — B<PR_SET_MM_EXE_FILE>, файл не является исполняемым.

source: I<option> is B<PR_SET_MM>, I<arg3> is B<PR_SET_MM_EXE_FILE>, and the file descriptor passed in I<arg4> is not valid.
ru: Значение I<option> равно B<PR_SET_MM>, I<arg3> — B<PR_SET_MM_EXE_FILE>, и файловый дескриптор, переданный в I<arg4>, некорректен.

source: I<option> is B<PR_SET_MM>, I<arg3> is B<PR_SET_MM_EXE_FILE>, and this the second attempt to change the I</proc/pid/exe> symbolic link, which is prohibited.
ru: Значение I<option> равно B<PR_SET_MM>, I<arg3> — B<PR_SET_MM_EXE_FILE>, и это вторая попытка изменить символьную ссылку I</proc/pid/exe>, что запрещено.

source: I<arg2> is an invalid address.
ru: В I<arg2> указан неправильный адрес.

source: I<option> is B<PR_SET_SECCOMP>, I<arg2> is B<SECCOMP_MODE_FILTER>, the system was built with B<CONFIG_SECCOMP_FILTER>, and I<arg3> is an invalid address.
ru: Значение I<option> равно B<PR_SET_SECCOMP>, I<arg2> равно B<SECCOMP_MODE_FILTER>, система была собрана с B<CONFIG_SECCOMP_FILTER> и I<arg3> содержит некорректный адрес.

source: The value of I<option> is not recognized.
ru: Не распознано значение I<option>.

source: I<option> is B<PR_MCE_KILL> or B<PR_MCE_KILL_GET> or B<PR_SET_MM>, and unused B<prctl>() arguments were not specified as zero.
ru: Значение I<option> равно B<PR_MCE_KILL>, B<PR_MCE_KILL_GET> или B<PR_SET_MM>, и неиспользуемые аргументы B<prctl>() не равны нулю.

source: I<arg2> is not valid value for this I<option>.
ru: Неверное значение I<arg2> для указанной в I<option> операции.

source: I<option> is B<PR_SET_SECCOMP> or B<PR_GET_SECCOMP>, and the kernel was not configured with B<CONFIG_SECCOMP>.
ru: Значение I<option> равно B<PR_SET_SECCOMP> или B<PR_GET_SECCOMP>, и ядро не собрано с параметром B<CONFIG_SECCOMP>.

source: I<option> is B<PR_SET_SECCOMP>, I<arg2> is B<SECCOMP_MODE_FILTER>, and the kernel was not configured with B<CONFIG_SECCOMP_FILTER>.
ru: Значение I<option> равно B<PR_SET_SECCOMP>, I<arg2> равно B<SECCOMP_MODE_FILTER> и ядро было собрано без B<CONFIG_SECCOMP_FILTER>.

source: I<option> is B<PR_SET_MM>, and one of the following is true
ru: Значение I<option> равно B<PR_SET_MM> и одно из следующего является истиной:

source: I<arg4> or I<arg5> is nonzero;
ru: Значение I<arg4> или I<arg5> не равно нулю;

source: I<arg3> is greater than B<TASK_SIZE> (the limit on the size of the user address space for this architecture);
ru: Значение I<arg3> больше B<TASK_SIZE> (ограничение на размер пользовательского адресного пространства для этой архитектуры);

source: I<arg2> is B<PR_SET_MM_START_CODE>, B<PR_SET_MM_END_CODE>, B<PR_SET_MM_START_DATA>, B<PR_SET_MM_END_DATA>, or B<PR_SET_MM_START_STACK>, and the permissions of the corresponding memory area are not as required;
ru: Значение I<arg2> равно B<PR_SET_MM_START_CODE>, B<PR_SET_MM_END_CODE>, B<PR_SET_MM_START_DATA>, B<PR_SET_MM_END_DATA> или B<PR_SET_MM_START_STACK>, и права на соответствующую область памяти не удовлетворяют требованиям;

source: I<arg2> is B<PR_SET_MM_START_BRK> or B<PR_SET_MM_BRK>, and I<arg3> is less than or equal to the end of the data segment or specifies a value that would cause the B<RLIMIT_DATA> resource limit to be exceeded.
ru: Значение I<arg2> равно B<PR_SET_MM_START_BRK> или B<PR_SET_MM_BRK>, и значение I<arg3> меньше или равно концу сегмента данных, или было бы превышено ограничение ресурса B<RLIMIT_DATA>.

source: I<option> is B<PR_SET_PTRACER> and I<arg2> is not 0, B<PR_SET_PTRACER_ANY>, or the PID of an existing process.
ru: Значение I<option> равно B<PR_SET_PTRACER> и значение I<arg2> не равно 0, B<PR_SET_PTRACER_ANY> или PID существующего процесса.

source: I<option> is B<PR_SET_PDEATHSIG> and I<arg2> is not a valid signal number.
ru: Значение I<option> равно B<PR_SET_PDEATHSIG> и значение I<arg2> не является корректным номером сигнала.

source: I<option> is B<PR_SET_DUMPABLE> and I<arg2> is neither B<SUID_DUMP_DISABLE> nor B<SUID_DUMP_USER>.
ru: Значение I<option> равно B<PR_SET_DUMPABLE> и значение I<arg2> не равно B<SUID_DUMP_DISABLE> или B<SUID_DUMP_USER>.

source: I<option> is B<PR_SET_TIMING> and I<arg2> is not B<PR_TIMING_STATISTICAL>.
ru: Значение I<option> равно B<PR_SET_TIMING> и значение I<arg2> не равно B<PR_TIMING_STATISTICAL>.

source: I<option> is B<PR_SET_NO_NEW_PRIVS> and I<arg2> is not equal to 1 or I<arg3>, I<arg4>, or I<arg5> is nonzero.
ru: Значение I<option> равно B<PR_SET_NO_NEW_PRIVS> и значение I<arg2> не равно 1 или I<arg3>, I<arg4> или I<arg5> не равны нулю.

source: I<option> is B<PR_GET_NO_NEW_PRIVS> and I<arg2>, I<arg3>, I<arg4>, or I<arg5> is nonzero.
ru: Значение I<option> равно B<PR_GET_NO_NEW_PRIVS> и значения I<arg2>, I<arg3>, I<arg4> или I<arg5> не равны нулю.

source: I<option> is B<PR_SET_THP_DISABLE> and I<arg3>, I<arg4>, or I<arg5> is nonzero.
ru: Значение I<option> равно B<PR_SET_THP_DISABLE> и I<arg3>, I<arg4> или I<arg5> не равны нулю.

source: I<option> is B<PR_GET_THP_DISABLE> and I<arg2>, I<arg3>, I<arg4>, or I<arg5> is nonzero.
ru: Значение I<option> равно B<PR_GET_THP_DISABLE> и значения I<arg2>, I<arg3>, I<arg4> или I<arg5> не равны нулю.

source: I<option> is B<PR_CAP_AMBIENT> and an unused argument (I<arg4>, I<arg5>, or, in the case of B<PR_CAP_AMBIENT_CLEAR_ALL>, I<arg3>) is nonzero; or I<arg2> has an invalid value; or I<arg2> is B<PR_CAP_AMBIENT_LOWER>, B<PR_CAP_AMBIENT_RAISE>, or B<PR_CAP_AMBIENT_IS_SET> and I<arg3> does not specify a valid capability.
ru: Значение I<option> равно B<PR_CAP_AMBIENT> и неиспользуемый аргумент (I<arg4>, I<arg5> или, в случае B<PR_CAP_AMBIENT_CLEAR_ALL>, I<arg3>) не равен нулю; или I<arg2> содержит некорректное значение; или I<arg2> равно B<PR_CAP_AMBIENT_LOWER>, B<PR_CAP_AMBIENT_RAISE> или B<PR_CAP_AMBIENT_IS_SET> и в I<arg3> указан некорректный мандат.

source: I<option> was B<PR_SET_SPECULATION_CTRL> the kernel or CPU does not support the requested speculation misfeature.
ru: Значение I<option> равно B<PR_SET_SPECULATION_CTRL>, но ядро или ЦП не поддерживает запрашиваемую нежелательную спекулятовность.

source: I<option> was B<PR_MPX_ENABLE_MANAGEMENT> or B<PR_MPX_DISABLE_MANAGEMENT> and the kernel or the CPU does not support MPX management. Check that the kernel and processor have MPX support.
ru: Значение I<option> было B<PR_MPX_ENABLE_MANAGEMENT> или B<PR_MPX_DISABLE_MANAGEMENT> и ядро или ЦП не поддерживают управление MPX. Проверьте, что ядро и процессор поддерживают MPX.

source: I<option> was B<PR_SET_SPECULATION_CTRL> implies that the control of the selected speculation misfeature is not possible. See B<PR_GET_SPECULATION_CTRL> for the bit fields to determine which option is available.
ru: Значение I<option>, равное B<PR_SET_SPECULATION_CTRL>, подразумевает, что управление выбранной нежелательной спекулятовности невозможно. Доступные значения смотрите в описании битовых полей B<PR_GET_SPECULATION_CTRL>.

source: I<option> is B<PR_SET_FP_MODE> and I<arg2> has an invalid or unsupported value.
ru: Значение I<option> равно B<PR_SET_FP_MODE> и I<arg2> содержит неправильное или неподдерживаемое значение.

source: I<option> is B<PR_SET_SECUREBITS>, and the caller does not have the B<CAP_SETPCAP> capability, or tried to unset a "locked" flag, or tried to set a flag whose corresponding locked flag was set (see B<capabilities>(7)).
ru: Значение I<option> равно B<PR_SET_SECUREBITS>, и вызывающий не имеет мандата B<CAP_SETPCAP>, или пытается сбросить «заблокированный» флаг, или пытается установить флаг, для которого установлен соответствующий заблокированный флаг (смотрите B<capabilities>(7)).

source: I<option> is B<PR_SET_SPECULATION_CTRL> wherein the speculation was disabled with B<PR_SPEC_FORCE_DISABLE> and caller tried to enable it again.
ru: Значение I<option> равно B<PR_SET_SPECULATION_CTRL>, но спекулятивность была отключена с помощью B<PR_SPEC_FORCE_DISABLE>, а вызывающий пытается включить её снова.

source: I<option> is B<PR_SET_KEEPCAPS>, and the caller's B<SECBIT_KEEP_CAPS_LOCKED> flag is set (see B<capabilities>(7)).
ru: Значение I<option> равно B<PR_SET_KEEPCAPS>, и у вызывающего установлен флаг B<SECBIT_KEEP_CAPS_LOCKED> (смотрите B<capabilities>(7)).

source: I<option> is B<PR_CAPBSET_DROP>, and the caller does not have the B<CAP_SETPCAP> capability.
ru: Значение I<option> равно B<PR_CAPBSET_DROP>, и вызывающий не имеет мандата B<CAP_SETPCAP>.

source: I<option> is B<PR_SET_MM>, and the caller does not have the B<CAP_SYS_RESOURCE> capability.
ru: Значение I<option> равно B<PR_SET_MM>, и вызывающий не имеет мандата B<CAP_SYS_RESOURCE>.

source: I<option> is B<PR_CAP_AMBIENT> and I<arg2> is B<PR_CAP_AMBIENT_RAISE>, but either the capability specified in I<arg3> is not present in the process's permitted and inheritable capability sets, or the B<PR_CAP_AMBIENT_LOWER> securebit has been set.
ru: Значение I<option> равно B<PR_CAP_AMBIENT> и I<arg2> равно B<PR_CAP_AMBIENT_RAISE>, но мандат, указанный в I<arg3>, отсутствует в разрешительном или унаследованном наборе мандатов, или был установлен бит безопасности B<PR_CAP_AMBIENT_LOWER>.

source: I<option> was B<PR_SET_SPECULATION_CTRL> and I<arg3> is neither B<PR_SPEC_ENABLE>, B<PR_SPEC_DISABLE>, nor B<PR_SPEC_FORCE_DISABLE>.
ru: Значение I<option> равно B<PR_SET_SPECULATION_CTRL>, но значение I<arg3> не равно B<PR_SPEC_ENABLE>, B<PR_SPEC_DISABLE> или B<PR_SPEC_FORCE_DISABLE>.

source: I<option> was B<PR_GET_SPECULATION_CTRL> or B<PR_SET_SPECULATION_CTRL> and unused arguments to B<prctl>() are not 0.
ru: Значение I<option> равно B<PR_GET_SPECULATION_CTRL> или B<PR_SET_SPECULATION_CTRL>, но неиспользуемые аргументы B<prctl>() не равны 0.

source: The B<prctl>() system call was introduced in Linux 2.1.57.
ru: Системный вызов B<prctl>() впервые появился в Linux 2.1.57.

source: This call is Linux-specific. IRIX has a B<prctl>() system call (also introduced in Linux 2.1.44 as irix_prctl on the MIPS architecture), with prototype
ru: Данный вызов существует только в Linux. В IRIX есть системный вызов B<prctl>() (также представленный в Linux 2.1.44 как irix_prctl на архитектуре MIPS) объявленный как

source: and options to get the maximum number of processes per user, get the maximum number of processors the calling process can use, find out whether a specified process is currently blocked, get or set the maximum stack size, and so on.
ru: а также операции, позволяющие получить максимальное количество процессов для каждого пользователя, максимальное количество процессоров, которое может использовать вызывающий процесс; определить, блокирован ли заданный процесс; получить или установить максимальный размер стека и т. д.

source: posix_fadvise - predeclare an access pattern for file data
ru: posix_fadvise - предварительно декларирует вариант доступа для данных файла

source: Programs can use B<posix_fadvise>() to announce an intention to access file data in a specific pattern in the future, thus allowing the kernel to perform appropriate optimizations.
ru: Программы могут использовать B<posix_fadvise>() для объявления намерений осуществить доступ к файлу данных в скором будущем определённым образом, тем самым позволяя ядру выполнить некоторые операции по оптимизации.

source: The I<advice> applies to a (not necessarily existent) region starting at I<offset> and extending for I<len> bytes (or until the end of the file if I<len> is 0) within the file referred to by I<fd>. The I<advice> is not binding; it merely constitutes an expectation on behalf of the application.
ru: Аргумент I<advice> применяется к (не обязательно существующей) области, начинающейся с I<offset>, длиной I<len> байт (или до конца файла, если I<len> равно 0) внутри файла, на который ссылается I<fd>. Аргумент I<advice> не является привязкой; он всего лишь выражает ожидание приложения.

source: Permissible values for I<advice> include:
ru: Допустимые значения I<advice>:

source: Indicates that the application has no advice to give about its access pattern for the specified data. If no advice is given for an open file, this is the default assumption.
ru: Указывает, что приложение не может подсказать тип доступа для указанных данных. Если не указано предположение для открываемого файла, то используется предположение по умолчанию.

source: The application expects to access the specified data sequentially (with lower offsets read before higher ones).
ru: Приложение ожидает последовательный доступ к указанным данным (чтение выполняется начиная с младших адресов).

source: The specified data will be accessed in random order.
ru: Указанные данные будут запрашиваться в случайном порядке.

source: The specified data will be accessed only once.
ru: Указанные данные будут запрошены только один раз.

source: In kernels before 2.6.18, B<POSIX_FADV_NOREUSE> had the same semantics as B<POSIX_FADV_WILLNEED>. This was probably a bug; since kernel 2.6.18, this flag is a no-op.
ru: В ядрах до версии 2.6.18, для B<POSIX_FADV_NOREUSE> использовалась такая же семантика что и у B<POSIX_FADV_WILLNEED>. Это, вероятно, было дефектом; начиная с ядра 2.6.18 для этого флага нет операции.

source: The specified data will be accessed in the near future.
ru: Указанные данные будут запрошены в скором будущем.

source: B<POSIX_FADV_WILLNEED> initiates a nonblocking read of the specified region into the page cache. The amount of data read may be decreased by the kernel depending on virtual memory load. (A few megabytes will usually be fully satisfied, and more is rarely useful.)
ru: При B<POSIX_FADV_WILLNEED> запускается неблокировочное чтение указанной области в страницу кэша. Число неблокированных данных может быть уменьшено ядром в зависимости от загрузки виртуальной памяти (несколько мегабайт памяти наверняка будут выделены, а больше, обычно, и не бывает нужно).

source: The specified data will not be accessed in the near future.
ru: Указанные данные не будут запрошены в скором будущем.
