Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: A B<PTRACE_EVENT_SECCOMP> stop occurs whenever a B<SECCOMP_RET_TRACE> rule is triggered. This is independent of which methods was used to restart the system call. Notably, seccomp still runs even if the tracee was restarted using B<PTRACE_SYSEMU> and this system call is unconditionally skipped.
ru: Остановка B<PTRACE_EVENT_SECCOMP> возникает из-за срабатывания правила B<SECCOMP_RET_TRACE>. Она не зависит от используемых методов перезапуска системного вызова. Примечательно, что seccomp по прежнему работает даже, если трассируемый был перезапущен с помощью B<PTRACE_SYSEMU> и этот системный вызов безоговорочно пропускается.

source: Restarts from this stop will behave as if the stop had occurred right before the system call in question. In particular, both B<PTRACE_SYSCALL> and B<PTRACE_SYSEMU> will normally cause a subsequent syscall-entry-stop. However, if after the B<PTRACE_EVENT_SECCOMP> the system call number is negative, both the syscall-entry-stop and the system call itself will be skipped. This means that if the system call number is negative after a B<PTRACE_EVENT_SECCOMP> and the tracee is restarted using B<PTRACE_SYSCALL>, the next observed stop will be a syscall-exit-stop, rather than the syscall-entry-stop that might have been expected.
ru: Перезапуск из этой остановки будет вести себя как если бы остановка возникла прямо перед рассматриваемым системным вызовом. В частности, B<PTRACE_SYSCALL> и B<PTRACE_SYSEMU> как обычно вызовут последующий syscall-entry-stop. Однако, если после B<PTRACE_EVENT_SECCOMP> номер системного вызова отрицательный, то и syscall-entry-stop и сам системный вызов будут пропущены. Это означает, что если номер системного вызова отрицательный после B<PTRACE_EVENT_SECCOMP> и трассируемый перезапущен с помощью B<PTRACE_SYSCALL>, то следующая наблюдаемая остановка будет syscall-exit-stop, а не syscall-entry-stop, как можно было ожидать.

source: PTRACE_EVENT_SECCOMP stops (since Linux 4.8)
ru: Остановки PTRACE_EVENT_SECCOMP (начиная с Linux 4.8)

source: Starting with Linux 4.8, the B<PTRACE_EVENT_SECCOMP> stop was reordered to occur between syscall-entry-stop and syscall-exit-stop. Note that seccomp no longer runs (and no B<PTRACE_EVENT_SECCOMP> will be reported) if the system call is skipped due to B<PTRACE_SYSEMU>.
ru: Начиная с Linux 4.8, остановка B<PTRACE_EVENT_SECCOMP> была преобразована при возникновении между syscall-entry-stop и syscall-exit-stop. Заметим, что seccomp больше не выполняется (и B<PTRACE_EVENT_SECCOMP> не будет выдан), если системный вызов пропускается из-за B<PTRACE_SYSEMU>.

source: Functionally, a B<PTRACE_EVENT_SECCOMP> stop functions comparably to a syscall-entry-stop (i.e., continuations using B<PTRACE_SYSCALL> will cause syscall-exit-stops, the system call number may be changed and any other modified registers are visible to the to-be-executed system call as well). Note that there may be, but need not have been a preceding syscall-entry-stop.
ru: Функционально, остановка B<PTRACE_EVENT_SECCOMP> работает как syscall-entry-stop (т. е., продолжение использования B<PTRACE_SYSCALL> приведёт к syscall-exit-stop, может измениться номер системного вызова и любые другие регистры, видимые выполняемому в будущем системному вызову). Заметим, что это может быть, но не обязательно предваряется syscall-entry-stop.

source: After a B<PTRACE_EVENT_SECCOMP> stop, seccomp will be rerun, with a B<SECCOMP_RET_TRACE> rule now functioning the same as a B<SECCOMP_RET_ALLOW>. Specifically, this means that if registers are not modified during the B<PTRACE_EVENT_SECCOMP> stop, the system call will then be allowed.
ru: После остановки B<PTRACE_EVENT_SECCOMP>, seccomp будет выполнен повторно с правилом B<SECCOMP_RET_TRACE>, которое теперь работает также как B<SECCOMP_RET_ALLOW>. Точнее говоря, это означает, что если регистры не изменились во время остановки B<PTRACE_EVENT_SECCOMP>,то после этого системный вызов будет разрешён.

source: PTRACE_SINGLESTEP stops
ru: Остановки PTRACE_SINGLESTEP

source: [Details of these kinds of stops are yet to be documented.]
ru: [Пока не описаны.]

source: Informational and restarting ptrace commands
ru: Информационные и перезапускающие действия ptrace

source: Most ptrace commands (all except B<PTRACE_ATTACH>, B<PTRACE_SEIZE>, B<PTRACE_TRACEME>, B<PTRACE_INTERRUPT>, and B<PTRACE_KILL>) require the tracee to be in a ptrace-stop, otherwise they fail with B<ESRCH>.
ru: Для большинства действий ptrace (все, за исключением B<PTRACE_ATTACH>, B<PTRACE_SEIZE>, B<PTRACE_TRACEME>, B<PTRACE_INTERRUPT> и B<PTRACE_KILL>) требуется, чтобы трассируемая нить была в режиме ptrace-stop, в противном случае они завершаются с ошибкой B<ESRCH>.

source: When the tracee is in ptrace-stop, the tracer can read and write data to the tracee using informational commands. These commands leave the tracee in ptrace-stopped state:
ru: Когда трассируемая нить в ptrace-stop, трассировщик может читать и записывать данные в трассируемую нить с помощью информационных действий. Эти действия оставляют трассируемую нить в состоянии ptrace-stop:

source: Note that some errors are not reported. For example, setting signal information (I<siginfo>) may have no effect in some ptrace-stops, yet the call may succeed (return 0 and not set I<errno>); querying B<PTRACE_GETEVENTMSG> may succeed and return some random value if current ptrace-stop is not documented as returning a meaningful event message.
ru: Заметим, что о некоторых ошибках не сообщается. Например, установка информации о сигнале (I<siginfo>) может никак не отразиться в некоторых ptrace-stop, при этом вызов может завершиться без ошибок (возвращается 0 и значение I<errno> не устанавливается); действие B<PTRACE_GETEVENTMSG> может выполниться без ошибок и вернуть произвольное значение, если текущий ptrace-stop не описан как возвращающий какое-то осмысленное сообщение о событии.

source: The call
ru: Вызов

source: affects one tracee. The tracee's current flags are replaced. Flags are inherited by new tracees created and "auto-attached" via active B<PTRACE_O_TRACEFORK>, B<PTRACE_O_TRACEVFORK>, or B<PTRACE_O_TRACECLONE> options.
ru: затрагивает одну трассируемую нить. Текущие флаги трассируемой нити заменяются. Флаги, наследуемые новой трассируемой нитью, создаются и «автоматически присоединяются» через активные флаги B<PTRACE_O_TRACEFORK>, B<PTRACE_O_TRACEVFORK> или B<PTRACE_O_TRACECLONE>.

source: Another group of commands makes the ptrace-stopped tracee run. They have the form:
ru: Другая группа действий заставляет трассируемую нить, находящуюся в ptrace-stop, выполняться. Они могут иметь вид:

source: where I<cmd> is B<PTRACE_CONT>, B<PTRACE_LISTEN>, B<PTRACE_DETACH>, B<PTRACE_SYSCALL>, B<PTRACE_SINGLESTEP>, B<PTRACE_SYSEMU>, or B<PTRACE_SYSEMU_SINGLESTEP>. If the tracee is in signal-delivery-stop, I<sig> is the signal to be injected (if it is nonzero). Otherwise, I<sig> may be ignored. (When restarting a tracee from a ptrace-stop other than signal-delivery-stop, recommended practice is to always pass 0 in I<sig>.)
ru: где значение I<cmd> равно B<PTRACE_CONT>, B<PTRACE_LISTEN>, B<PTRACE_DETACH>, B<PTRACE_SYSCALL>, B<PTRACE_SINGLESTEP>, B<PTRACE_SYSEMU> или B<PTRACE_SYSEMU_SINGLESTEP>. Если трассируемая нить в signal-delivery-stop, то в I<sig> указывается сигнал, который будет внедрён (если не равен нулю). В противном случае, I<sig> может игнорироваться (при перезапуске трассируемой нити из ptrace-stop в отличный от signal-delivery-stop, рекомендуется передавать в I<sig> значение 0).

source: Attaching and detaching
ru: Присоединение и отсоединение

source: A thread can be attached to the tracer using the call
ru: Нить можно присоединить к трассировщику с помощью вызова

source: or
ru: или

source: B<PTRACE_ATTACH> sends B<SIGSTOP> to this thread. If the tracer wants this B<SIGSTOP> to have no effect, it needs to suppress it. Note that if other signals are concurrently sent to this thread during attach, the tracer may see the tracee enter signal-delivery-stop with other signal(s) first! The usual practice is to reinject these signals until B<SIGSTOP> is seen, then suppress B<SIGSTOP> injection. The design bug here is that a ptrace attach and a concurrently delivered B<SIGSTOP> may race and the concurrent B<SIGSTOP> may be lost.
ru: B<PTRACE_ATTACH> посылает в нить B<SIGSTOP>. Если трассировщик хочет отменить действие B<SIGSTOP>, ему нужно его подавить. Заметим, что если при присоединении в эту нить в тоже время посылаются другие сигналы, то трассировщик может увидеть, что трассируемая нить сначала вошла в signal-delivery-stop из этих сигналов! Обычной практикой является повторное внедрение этих сигналов до тех пор, пока не будет обнаружен B<SIGSTOP>, а затем подавление внедрения B<SIGSTOP>. Здесь есть ошибка в проектировании в том, что присоединение ptrace и одновременно доставляемый B<SIGSTOP> могут состязаться и одновременный B<SIGSTOP> может быть утерян.

source: Since attaching sends B<SIGSTOP> and the tracer usually suppresses it, this may cause a stray B<EINTR> return from the currently executing system call in the tracee, as described in the "Signal injection and suppression" section.
ru: Так как при присоединении посылается B<SIGSTOP> и трассировщик обычно подавляет его, то это может привести к блуждающему возврату B<EINTR> из в данный момент выполняемого системного вызова в трассируемой нити, как описано в разделе «Внедрение и отмена сигнала».

source: Since Linux 3.4, B<PTRACE_SEIZE> can be used instead of B<PTRACE_ATTACH>. B<PTRACE_SEIZE> does not stop the attached process. If you need to stop it after attach (or at any other time) without sending it any signals, use B<PTRACE_INTERRUPT> command.
ru: Начиная с Linux 3.4, вместо B<PTRACE_ATTACH> можно использовать B<PTRACE_SEIZE>. B<PTRACE_SEIZE> не останавливает присоединённый. Если вам нужно остановить его после присоединения (или в любое другое время) без отправки каких-либо, используйте действие B<PTRACE_INTERRUPT>.

source: The request
ru: Запрос

source: turns the calling thread into a tracee. The thread continues to run (doesn't enter ptrace-stop). A common practice is to follow the B<PTRACE_TRACEME> with
ru: включает трассировку вызвавшей нити. Нить продолжает выполняться (не входит в ptrace-stop). Обычно, за B<PTRACE_TRACEME> следует

source: and allow the parent (which is our tracer now) to observe our signal-delivery-stop.
ru: и это позволяет родителю (который теперь трассировщик) отследить signal-delivery-stop.

source: If the B<PTRACE_O_TRACEFORK>, B<PTRACE_O_TRACEVFORK>, or B<PTRACE_O_TRACECLONE> options are in effect, then children created by, respectively, B<vfork>(2) or B<clone>(2) with the B<CLONE_VFORK> flag, B<fork>(2) or B<clone>(2) with the exit signal set to B<SIGCHLD>, and other kinds of B<clone>(2), are automatically attached to the same tracer which traced their parent. B<SIGSTOP> is delivered to the children, causing them to enter signal-delivery-stop after they exit the system call which created them.
ru: Если включены флаги B<PTRACE_O_TRACEFORK>, B<PTRACE_O_TRACEVFORK> или B<PTRACE_O_TRACECLONE>, то потомок, создаваемый, соответственно, B<vfork>(2) или B<clone>(2) с флагом B<CLONE_VFORK>, B<fork>(2) или B<clone>(2) с установленным выходным сигналом равным B<SIGCHLD>, и другими видами B<clone>(2), автоматически присоединяется к тому же трассировщику, которой трассирует их родителя. Сигнал B<SIGSTOP> доставляется потомку, заставляя его войти в signal-delivery-stop после завершения системного вызова, который его создал.

source: Detaching of the tracee is performed by:
ru: Отсоединение от трассируемой нити выполняется с помощью:

source: B<PTRACE_DETACH> is a restarting operation; therefore it requires the tracee to be in ptrace-stop. If the tracee is in signal-delivery-stop, a signal can be injected. Otherwise, the I<sig> parameter may be silently ignored.
ru: B<PTRACE_DETACH> является перезапускающей операцией, поэтому она требует, чтобы трассируемая нить была в ptrace-stop. Если трассируемая нить в signal-delivery-stop, то может быть внедрён сигнал. В противном случае параметр I<sig> может быть проигнорирован.

source: If the tracee is running when the tracer wants to detach it, the usual solution is to send B<SIGSTOP> (using B<tgkill>(2), to make sure it goes to the correct thread), wait for the tracee to stop in signal-delivery-stop for B<SIGSTOP> and then detach it (suppressing B<SIGSTOP> injection). A design bug is that this can race with concurrent B<SIGSTOP>s. Another complication is that the tracee may enter other ptrace-stops and needs to be restarted and waited for again, until B<SIGSTOP> is seen. Yet another complication is to be sure that the tracee is not already ptrace-stopped, because no signal delivery happens while it is\(emnot even B<SIGSTOP>.
ru: Если трассировщик хочет отсоединиться,а трассируемая нить выполняется, то решением является посылка сигнала B<SIGSTOP> (с помощью B<tgkill>(2), чтобы точно достичь текущей нити), ожидание пока трассируемая нить не войдёт в signal-delivery-stop для доставки B<SIGSTOP> и затем отсоединение от неё (подавив внедрение B<SIGSTOP>). Ошибкой проектирования является возможность гонок с параллельно отправленными B<SIGSTOP>. Другая трудность в том, что трассируемая нить может войти в другой ptrace-stop и потребуется его перезапуск и повторное ожидание появления B<SIGSTOP>. Ещё одной сложностью является в проверки, что трассируемая нить уже не в ptrace-stop, так как в этом случае доставки сигнала не происходит — даже B<SIGSTOP>.

source: If the tracer dies, all tracees are automatically detached and restarted, unless they were in group-stop. Handling of restart from group-stop is currently buggy, but the "as planned" behavior is to leave tracee stopped and waiting for B<SIGCONT>. If the tracee is restarted from signal-delivery-stop, the pending signal is injected.
ru: Если трассировщик завершает работу, то все трассируемые нити автоматически отсоединяются и перезапускаются, если они не в group-stop. Выполнение перезапуска из group-stop в настоящее время содержит ошибки, но «плановым» поведением считается оставить трассируемую нить остановленной и подождать B<SIGCONT>. Если трассируемая нить перезапускается из signal-delivery-stop, то внедряется ожидающий сигнал.

source: execve(2) under ptrace
ru: Выполнение execve(2) во время ptrace

source: When one thread in a multithreaded process calls B<execve>(2), the kernel destroys all other threads in the process, and resets the thread ID of the execing thread to the thread group ID (process ID). (Or, to put things another way, when a multithreaded process does an B<execve>(2), at completion of the call, it appears as though the B<execve>(2) occurred in the thread group leader, regardless of which thread did the B<execve>(2).) This resetting of the thread ID looks very confusing to tracers:
ru: Когда одна нить многонитевого процесса вызывает B<execve>(2), то ядро уничтожает все остальные нити процесса и сбрасывает ID выполняющейся нити в значение ID группы нитей (ID процесса. Или, говоря иначе, когда многонитевой процесс выполняет B<execve>(2), то по завершению вызова это выглядит как если бы B<execve>(2) произошёл в лидере группе нитей, независимо от того, какая нить вызвала B<execve>(2)). Такой сброс ID нити запутывает трассировщиков:

source: All other threads stop in B<PTRACE_EVENT_EXIT> stop, if the B<PTRACE_O_TRACEEXIT> option was turned on. Then all other threads except the thread group leader report death as if they exited via B<_exit>(2) with exit code 0.
ru: Все остальные нити останавливаются в останове B<PTRACE_EVENT_EXIT>, если включён флаг B<PTRACE_O_TRACEEXIT>. Затем все остальные нити, за исключением лидера группы нитей, сообщают о завершении, как если бы они кончили работу с помощью B<_exit>(2) с кодом выхода 0.

source: The execing tracee changes its thread ID while it is in the B<execve>(2). (Remember, under ptrace, the "pid" returned from B<waitpid>(2), or fed into ptrace calls, is the tracee's thread ID.) That is, the tracee's thread ID is reset to be the same as its process ID, which is the same as the thread group leader's thread ID.
ru: У исполняемой трассируемой нити изменяется ID, так как она выполняет B<execve>(2) (помните, что в ptrace «pid», возвращаемый из B<waitpid>(2) или подаваемый в вызовы ptrace, это ID трассируемой нити). То есть ID трассируемой нити сбрасывается в значение ID своего процесса, который равен ID лидера группы нитей.

source: Then a B<PTRACE_EVENT_EXEC> stop happens, if the B<PTRACE_O_TRACEEXEC> option was turned on.
ru: Затем происходит остановка B<PTRACE_EVENT_EXEC>, если включён флаг B<PTRACE_O_TRACEEXEC>.

source: If the thread group leader has reported its B<PTRACE_EVENT_EXIT> stop by this time, it appears to the tracer that the dead thread leader "reappears from nowhere". (Note: the thread group leader does not report death via I<WIFEXITED(status)> until there is at least one other live thread. This eliminates the possibility that the tracer will see it dying and then reappearing.) If the thread group leader was still alive, for the tracer this may look as if thread group leader returns from a different system call than it entered, or even "returned from a system call even though it was not in any system call". If the thread group leader was not traced (or was traced by a different tracer), then during B<execve>(2) it will appear as if it has become a tracee of the tracer of the execing tracee.
ru: Если в это время лидер группы нитей сообщил о своей остановке B<PTRACE_EVENT_EXIT> в это время, то трассировщику кажется, что завершившийся лидер группы «возник из ниоткуда» (замечание: лидер группы нитей не сообщает о завершении через I<WIFEXITED(status)> до тех пор, пока есть одна работающая нить. Это не даёт возможности трассировщику увидеть его завершение и повторное появление). Если лидер группы нитей всё ещё выполнялся, то для трассировщика может казаться, что лидер группы нитей вернулся из другого системного вызова в который входил, или даже «вернулся из системного вызова, хотя не был ни в каком системном вызове». Если лидер группы нитей не трассируется (или трассируется другим трассировщиком), то во время B<execve>(2) он выглядит так, как если бы стал трассируемым трассировщиком выполняющейся трассируемой нити.

source: All of the above effects are the artifacts of the thread ID change in the tracee.
ru: Все перечисленные выше эффекты происходят из-за смены ID трассируемой нити.

source: The B<PTRACE_O_TRACEEXEC> option is the recommended tool for dealing with this situation. First, it enables B<PTRACE_EVENT_EXEC> stop, which occurs before B<execve>(2) returns. In this stop, the tracer can use B<PTRACE_GETEVENTMSG> to retrieve the tracee's former thread ID. (This feature was introduced in Linux 3.0.) Second, the B<PTRACE_O_TRACEEXEC> option disables legacy B<SIGTRAP> generation on B<execve>(2).
ru: В этой ситуации рекомендуется использовать флаг B<PTRACE_O_TRACEEXEC>. Во-первых, он включает остановку B<PTRACE_EVENT_EXEC>, которая происходит перед возвратом из B<execve>(2). В этой остановке трассировщик может использовать B<PTRACE_GETEVENTMSG> для получения предыдущего ID трассируемой нити (эта возможность появилась в Linux 3.0). Во-вторых, флаг B<PTRACE_O_TRACEEXEC> отключает устаревшую генерацию B<SIGTRAP> при B<execve>(2).

source: When the tracer receives B<PTRACE_EVENT_EXEC> stop notification, it is guaranteed that except this tracee and the thread group leader, no other threads from the process are alive.
ru: Когда трассировщик получает уведомление об остановке B<PTRACE_EVENT_EXEC>, гарантируется, что за исключением этой трассируемой нити и лидера группы нитей, больше живых нитей в этом процессе нет.

source: On receiving the B<PTRACE_EVENT_EXEC> stop notification, the tracer should clean up all its internal data structures describing the threads of this process, and retain only one data structure\(emone which describes the single still running tracee, with
ru: По получению уведомления об остановке B<PTRACE_EVENT_EXEC> трассировщик должен очистить все свои внутренние структуры данных, описывающие нити этого процесса, и оставить только одну структуру данных, которая описывает одну ещё выполняющуюся трассируемую нить, у которой

source: thread ID == thread group ID == process ID.
ru: ID нити == ID группы нитей == ID процесса.

source: Example: two threads call B<execve>(2) at the same time:
ru: Пример: две нити вызывают B<execve>(2) одновременно:

source: *** we get syscall-enter-stop in thread 1: ** PID1 execve("/bin/foo", "foo" E<lt>unfinished ...E<gt> *** we issue PTRACE_SYSCALL for thread 1 ** *** we get syscall-enter-stop in thread 2: ** PID2 execve("/bin/bar", "bar" E<lt>unfinished ...E<gt> *** we issue PTRACE_SYSCALL for thread 2 ** *** we get PTRACE_EVENT_EXEC for PID0, we issue PTRACE_SYSCALL ** *** we get syscall-exit-stop for PID0: ** PID0 E<lt>... execve resumedE<gt> ) = 0
ru: *** мы получаем syscall-enter-stop в нити 1: ** PID1 execve("/bin/foo", "foo" E<lt>unfinished ...E<gt> *** мы выдаём PTRACE_SYSCALL для нити 1 ** *** мы получаем syscall-enter-stop в нити 2: ** PID2 execve("/bin/bar", "bar" E<lt>unfinished ...E<gt> *** мы выдаём PTRACE_SYSCALL для нити 2 ** *** мы получаем PTRACE_EVENT_EXEC for PID0, мы выдаём PTRACE_SYSCALL ** *** мы получаем syscall-exit-stop для PID0: ** PID0 E<lt>... execve resumedE<gt> ) = 0

source: If the B<PTRACE_O_TRACEEXEC> option is I<not> in effect for the execing tracee, and if the tracee was B<PTRACE_ATTACH>ed rather that B<PTRACE_SEIZE>d, the kernel delivers an extra B<SIGTRAP> to the tracee after B<execve>(2) returns. This is an ordinary signal (similar to one which can be generated by I<kill -TRAP>), not a special kind of ptrace-stop. Employing B<PTRACE_GETSIGINFO> for this signal returns I<si_code> set to 0 (I<SI_USER>). This signal may be blocked by signal mask, and thus may be delivered (much) later.
ru: Если флаг B<PTRACE_O_TRACEEXEC> I<не> действует на выполняющуюся трассируемую нить и если трассируемая нить подключена с помощью B<PTRACE_ATTACH>, а не B<PTRACE_SEIZE>, то ядро доставляет ей дополнительный B<SIGTRAP> после возврата из B<execve>(2). Это обычный сигнал (похожий на тот, который генерируется с помощью I<kill -TRAP>), а не какая-то специальная разновидность ptrace-stop. Выдача B<PTRACE_GETSIGINFO> для этого сигнала возвращает I<si_code> равный 0 (I<SI_USER>). Этот сигнал может быть блокирован маской сигналов и поэтому может быть доставлен (намного) позже.

source: Usually, the tracer (for example, B<strace>(1)) would not want to show this extra post-execve B<SIGTRAP> signal to the user, and would suppress its delivery to the tracee (if B<SIGTRAP> is set to B<SIG_DFL>, it is a killing signal). However, determining I<which> B<SIGTRAP> to suppress is not easy. Setting the B<PTRACE_O_TRACEEXEC> option or using B<PTRACE_SEIZE> and thus suppressing this extra B<SIGTRAP> is the recommended approach.
ru: Обычно, трассировщик (например, B<strace>(1)) не хотел бы показывать этот дополнительный пост-execve B<SIGTRAP> сигнал пользователю, и хотел бы подавить его доставку в трассируемую нить (если обработчик B<SIGTRAP> равен B<SIG_DFL>, то это уничтожающий сигнал). Однако, определить I<какой> B<SIGTRAP> подавлять, нелегко. Рекомендуется установить флаг B<PTRACE_O_TRACEEXEC> или B<PTRACE_SEIZE> и затем подавить этот дополнительный B<SIGTRAP>.

source: Real parent
ru: Настоящий родитель
