Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: I<pkey>, I<flags>, or I<access_rights> is invalid.
ru: Неверное значение I<pkey>, I<flags> или I<access_rights>.

source: (B<pkey_alloc>()) All protection keys available for the current process have been allocated. The number of keys available is architecture-specific and implementation-specific and may be reduced by kernel-internal use of certain keys. There are currently 15 keys available to user programs on x86.
ru: (B<pkey_alloc>()) Все ключи защиты, доступные текущему процессу уже распределены. Количество доступных ключей зависит от архитектуры и реализации и может быть меньшим из-за использования отдельных ключей самим ядром. В настоящее время на x86 для пользовательской программы доступно 15 ключей.

source: This error will also be returned if the processor or operating system does not support protection keys. Applications should always be prepared to handle this error, since factors outside of the application's control can reduce the number of available pkeys.
ru: Также эта ошибка возвращается, если процессор или операционная система не поддерживают ключи защиты. Приложения всегда должны быть готовы к получению этой ошибки, так как приложение не может контролировать сокращение количества доступных pkey.

source: B<pkey_alloc>() and B<pkey_free>() were added to Linux in kernel 4.9; library support was added in glibc 2.27.
ru: Вызовы B<pkey_alloc>() и B<pkey_free>() были добавлены в Linux 4.9; поддержка в glibc доступна с версии 2.27.

source: The B<pkey_alloc>() and B<pkey_free>() system calls are Linux-specific.
ru: Системные вызовы B<pkey_alloc>() и B<pkey_free>() есть только в Linux.

source: B<pkey_alloc>() is always safe to call regardless of whether or not the operating system supports protection keys. It can be used in lieu of any other mechanism for detecting pkey support and will simply fail with the error B<ENOSPC> if the operating system has no pkey support.
ru: Вызов B<pkey_alloc>() всегда безопасен в независимости от поддержки ключей операционной системой. Его можно использовать как механизм определения поддержки pkey; он всегда просто возвращает ошибку B<ENOSPC>, если операционная система не поддерживает pkey.

source: The kernel guarantees that the contents of the hardware rights register (PKRU) will be preserved only for allocated protection keys. Any time a key is unallocated (either before the first call returning that key from B<pkey_alloc>() or after it is freed via B<pkey_free>()), the kernel may make arbitrary changes to the parts of the rights register affecting access to that key.
ru: Ядро гарантирует, что содержимое аппаратных регистров прав (PKRU) будет сохранено только для выделенных ключей защиты. Пока ключ не выделен (до первого вызова, возвращающего этот ключ B<pkey_alloc>(), или после его освобождения с помощью B<pkey_free>()), ядро может вносить произвольные изменения в части регистров прав, относящихся к этому ключу.

source: See B<pkeys>(7).
ru: Смотрите B<pkeys>(7).

source: pivot_root - change the root filesystem
ru: pivot_root - изменяет корневую файловую систему

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
ru: I<Замечание>: В glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: B<pivot_root>() moves the root filesystem of the calling process to the directory I<put_old> and makes I<new_root> the new root filesystem of the calling process.
ru: Вызов B<pivot_root>() перемещает корневую систему вызывающего процесса в каталог I<put_old> и делает каталог I<new_root> новой корневой файловой системой у вызывающего процесса.

source: The typical use of B<pivot_root>() is during system startup, when the system mounts a temporary root filesystem (e.g., an B<initrd>), then mounts the real root filesystem, and eventually turns the latter into the current root of all relevant processes or threads.
ru: Обычно, B<pivot_root>() используется при загрузке, когда система монтирует временную корневую файловую систему (например, B<initrd>), а затем монтирует настоящую корневую файловую систему, делая, тем самым, её корневой для всех последующих процессов или нитей.

source: B<pivot_root>() may or may not change the current root and the current working directory of any processes or threads which use the old root directory. The caller of B<pivot_root>() must ensure that processes with root or current working directory at the old root operate correctly in either case. An easy way to ensure this is to change their root and current working directory to I<new_root> before invoking B<pivot_root>().
ru: Вызов B<pivot_root>() может изменить (или не изменить) текущий корневой и текущий рабочий каталоги во всех процессах или нитях, использующих старый корневой каталог. Вызывающий B<pivot_root>() должен быть уверен в том, что процессы у которых корневой или текущий рабочий каталог равен старому корневому каталогу, работают нормально в каждом случае. Самый простой способ достичь этого — сменить их корневой и текущий рабочий каталог на I<new_root> до вызова B<pivot_root>().

source: The paragraph above is intentionally vague because the implementation of B<pivot_root>() may change in the future. At the time of writing, B<pivot_root>() changes root and current working directory of each process or thread to I<new_root> if they point to the old root directory. This is necessary in order to prevent kernel threads from keeping the old root directory busy with their root and current working directory, even if they never access the filesystem in any way. In the future, there may be a mechanism for kernel threads to explicitly relinquish any access to the filesystem, such that this fairly intrusive mechanism can be removed from B<pivot_root>().
ru: Содержимое предыдущего абзаца, на самом деле, является не совсем определённым, потому что реализация B<pivot_root>() может измениться в будущем. На момент написания этого документа B<pivot_root>() изменяет корневой и текущий рабочий каталоги каждого процесса или нити на I<new_root>, если они указывают на старый корневой каталог. Это необходимо для того, чтобы нити ядра не занимали старый корневой и текущий рабочий каталог, даже если они вообще не обращались к файловой системе. В будущем, возможно, будет создан механизм, заставляющий нити ядра отказаться от доступа к файловой системе, что позволит удалить этот довольно навязчивый механизм из B<pivot_root>().

source: Note that this also applies to the calling process: B<pivot_root>() may or may not affect its current working directory. It is therefore recommended to call B<chdir("/")> immediately after B<pivot_root>().
ru: Заметим, что всё это относится и к вызывающему процессу: B<pivot_root>() может изменить (а может и не изменить) его текущий рабочий каталог. По этой причине рекомендуется вызывать B<chdir("/")> сразу после вызова B<pivot_root>().

source: The following restrictions apply to I<new_root> and I<put_old>:
ru: На значения I<new_root> и I<put_old> накладываются следующие ограничения:

source: They must be directories.
ru: Они должны быть каталогами.

source: I<new_root> and I<put_old> must not be on the same filesystem as the current root.
ru: Аргументы I<new_root> и I<put_old> не могут быть в одной файловой системе с текущим корневым каталогом.

source: I<put_old> must be underneath I<new_root>, that is, adding a nonzero number of I</..> to the string pointed to by I<put_old> must yield the same directory as I<new_root>.
ru: Аргумент I<put_old> должен быть в дереве каталогов I<new_root>, т.е., путём добавления ненулевого количества I</..> в строке, на которую указывает I<put_old>, можно получить каталог, равный I<new_root>.

source: No other filesystem may be mounted on I<put_old>.
ru: К I<put_old> не должны быть подмонтированы файловые системы.

source: See also B<pivot_root>(8) for additional usage examples.
ru: См. также страницу B<pivot_root>(8), в которой приведены примеры возможного использования.

source: If the current root is not a mount point (e.g., after B<chroot>(2) or B<pivot_root>(), see also below), not the old root directory, but the mount point of that filesystem is mounted on I<put_old>.
ru: Если текущий корневой каталог не является точкой монтирования (например, после B<chroot>(2) или B<pivot_root>(), см. ниже), то к I<put_old> подключается не старый корневой каталог, а точка монтирования этой файловой системы.

source: I<new_root> must be a mount point. (If it is not otherwise a mount point, it suffices to bind mount I<new_root> on top of itself.)
ru: Значение I<new_root> должно быть точкой монтирования (если это не точка монтирования, то достаточно привязать монтирование I<new_root> поверх самой себя).

source: The propagation type of I<new_root> and its parent mount must not be B<MS_SHARED>; similarly, if I<put_old> is an existing mount point, its propagation type must not be B<MS_SHARED>.
ru: Типа распространения I<new_root> и его родительского монтирования не должно быть B<MS_SHARED>; схожим образом, если I<put_old> — существующая точка монтирования, то её тип распространения не должен быть B<MS_SHARED>.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: B<pivot_root>() may return (in I<errno>) any of the errors returned by B<stat>(2). Additionally, it may return:
ru: Вызов B<pivot_root>() может возвращать (в I<errno>) любые ошибки, которые возвращаются B<stat>(2). Также он может вернуть:

source: I<new_root> or I<put_old> are on the current root filesystem, or a filesystem is already mounted on I<put_old>.
ru: Аргумент I<new_root> или I<put_old> находится в текущей корневой файловой системе, или какая-то файловая система уже смонтирована в I<put_old>.

source: I<new_root> is not a mount point.
ru: Значение I<new_root> не является точкой монтирования.

source: I<put_old> is not underneath I<new_root>.
ru: Аргумент I<put_old> не находится в дереве каталогов I<new_root>.

source: The current root is on the rootfs (initial ramfs) filesystem.
ru: Текущий корень расположен на файловой системе rootfs (начальная ramfs).

source: Either the mount point at I<new_root>, or the parent mount of that mount point, has propagation type B<MS_SHARED>.
ru: Точка монтирования I<new_root> и её родительское монтирование имеет тип распространения B<MS_SHARED>.

source: I<put_old> is a mount point and has the propagation type B<MS_SHARED>.
ru: Значение I<put_old> является точкой монтирования и имеет тип распространения B<MS_SHARED>.

source: I<new_root> or I<put_old> is not a directory.
ru: Аргумент I<new_root> или I<put_old> не является каталогом.

source: The calling process does not have the B<CAP_SYS_ADMIN> capability.
ru: Вызывающий процесс не имеет мандата B<CAP_SYS_ADMIN>.

source: B<pivot_root>() was introduced in Linux 2.3.41.
ru: Вызов B<pivot_root>() появился в Linux 2.3.41.

source: B<pivot_root>() is Linux-specific and hence is not portable.
ru: Вызов B<pivot_root>() есть только в Linux и поэтому его использование не переносимо.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2).
ru: В glibc нет обёртки для данного системного вызова; запускайте его с помощью B<syscall>(2).

source: The rootfs (initial ramfs) cannot be B<pivot_root>()ed. The recommended method of changing the root filesystem in this case is to delete everything in rootfs, overmount rootfs with the new root, attach I<stdin>/I<stdout>/I<stderr> to the new I</dev/console>, and exec the new B<init>(1). Helper programs for this process exist; see B<switch_root>(8).
ru: Для rootfs (начальная ramfs) нельзя вызвать B<pivot_root>(). Рекомендуемым методом изменения корневой файловой системы в этом случае является удаление всего в rootfs, перемонтирование в rootfs нового корня, присоединение I<stdin>/I<stdout>/I<stderr> к новой I</dev/console> и запуск нового B<init>(1). Для этого существуют вспомогательные программы; смотрите B<switch_root>(8).

source: B<pivot_root>() should not have to change root and current working directory of all other processes in the system.
ru: Вызов B<pivot_root>() не должен изменять корневой и рабочий каталоги других процессов в системе.

source: Some of the more obscure uses of B<pivot_root>() may quickly lead to insanity.
ru: Некорректное использование B<pivot_root>() может привести к непредсказуемым последствиям.

source: pause - wait for signal
ru: pause - ждать сигнала

source: B<pause>() causes the calling process (or thread) to sleep until a signal is delivered that either terminates the process or causes the invocation of a signal-catching function.
ru: B<pause>() заставляет вызвавший процесс (или нить) уснуть до тех пор, пока не поступит сигнал, который или завершит процесс, или приведёт к запуску функции, обрабатывающей сигнал.

source: B<pause>() returns only when a signal was caught and the signal-catching function returned. In this case, B<pause>() returns -1, and I<errno> is set to B<EINTR>.
ru: B<pause>() возвращает значение, только когда был пойман сигнал и завершилась функция его обработки. В этом случае B<pause>() возвращает -1, а I<errno> устанавливается равной B<EINTR>.

source: a signal was caught and the signal-catching function returned.
ru: пойман сигнал и завершилась функция его обработки.

source: pipe, pipe2 - create pipe
ru: pipe, pipe2 - создаёт канал

source: /* On Alpha, IA-64, MIPS, SuperH, and SPARC/SPARC64; see NOTES */ B<struct fd_pair {> B<long fd[2];> B<};> B<struct fd_pair pipe();>
ru: /* На Alpha, IA-64, MIPS, SuperH и SPARC/SPARC64; смотрите ЗАМЕЧАНИЯ */ B<struct fd_pair {> B<long fd[2];> B<};> B<struct fd_pair pipe();>

source: /* On all other architectures */ B<int pipe(int >I<pipefd>B<[2]);>
ru: /* На остальных архитектурах */ B<int pipe(int >I<pipefd>B<[2]);>

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>> /* Obtain O_* constant definitions */ B<#include E<lt>unistd.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>> /* Определение констант O_* */ B<#include E<lt>unistd.hE<gt>>

source: B<pipe>() creates a pipe, a unidirectional data channel that can be used for interprocess communication. The array I<pipefd> is used to return two file descriptors referring to the ends of the pipe. I<pipefd[0]> refers to the read end of the pipe. I<pipefd[1]> refers to the write end of the pipe. Data written to the write end of the pipe is buffered by the kernel until it is read from the read end of the pipe. For further details, see B<pipe>(7).
ru: B<pipe>() создаёт однонаправленный канал данных, который можно использовать для взаимодействия между процессами. Массив I<pipefd> используется для возврата двух файловых описателей, указывающих на концы канала. I<pipefd[0]> указывает на конец канала для чтения. I<pipefd[1]> указывает на конец канала для записи. Данные, записанные в конец канала, буферизируются ядром до тех пор, пока не будут прочитаны из конца канала для чтения. Подробней см. B<pipe>(7).

source: If I<flags> is 0, then B<pipe2>() is the same as B<pipe>(). The following values can be bitwise ORed in I<flags> to obtain different behavior:
ru: Если I<flags> равно 0, то B<pipe2>() выполняет то же что и B<pipe>(). Следующие значения могут быть побитово сложены в I<flags> для получения различного поведения:

source: Set the close-on-exec (B<FD_CLOEXEC>) flag on the two new file descriptors. See the description of the same flag in B<open>(2) for reasons why this may be useful.
ru: Устанавливает флаг close-on-exec (B<FD_CLOEXEC>) для двух новых открытых файловых дескрипторов. Смотрите описание того же флага в B<open>(2) для того, чтобы узнать как это может пригодиться.

source: B<O_DIRECT> (since Linux 3.4)
ru: B<O_DIRECT> (начиная с Linux 3.4)

source: Create a pipe that performs I/O in "packet" mode. Each B<write>(2) to the pipe is dealt with as a separate packet, and B<read>(2)s from the pipe will read one packet at a time. Note the following points:
ru: Создаёт канал, в котором ввод-вывод выполняется в «пакетном» режиме. Каждый B<write>(2) в канал рассматривается как отдельный пакет, а B<read>(2) из канала читает один пакет за раз. Заметим следующее:

source: Writes of greater than B<PIPE_BUF> bytes (see B<pipe>(7)) will be split into multiple packets. The constant B<PIPE_BUF> is defined in I<E<lt>limits.hE<gt>>.
ru: Запись более B<PIPE_BUF> байт (смотрите B<pipe>(7)) будет разделена на несколько пакетов. Константа B<PIPE_BUF> определена в I<E<lt>limits.hE<gt>>.

source: If a B<read>(2) specifies a buffer size that is smaller than the next packet, then the requested number of bytes are read, and the excess bytes in the packet are discarded. Specifying a buffer size of B<PIPE_BUF> will be sufficient to read the largest possible packets (see the previous point).
ru: Если в B<read>(2) указан размер буфера меньше чем следующий пакет, то читается запрашиваемое количество байт, а лишние байты пакета отбрасываются. Указание B<PIPE_BUF> в качестве размера буфера будет достаточно для чтения самых больших пакетов (смотрите предыдущее примечание).

source: Zero-length packets are not supported. (A B<read>(2) that specifies a buffer size of zero is a no-op, and returns 0.)
ru: Пакеты нулевой длины не поддерживаются (вызов B<read>(2) с нулевым размером буфера ничего не делает и возвращает 0).

source: Older kernels that do not support this flag will indicate this via an B<EINVAL> error.
ru: Старые ядра, которые не поддерживают этот флаг, возвращают ошибку B<EINVAL>.

source: Since Linux 4.5, it is possible to change the B<O_DIRECT> setting of a pipe file descriptor using B<fcntl>(2).
ru: Начиная с Linux 4.5, у файлового дескриптора канала возможно менять установку B<O_DIRECT> с помощью B<fcntl>(2).

source: Set the B<O_NONBLOCK> file status flag on the open file descriptions referred to by the new file descriptors. Using this flag saves extra calls to B<fcntl>(2) to achieve the same result.
ru: Устанавливает флаг состояния файла B<O_NONBLOCK> для открытого файлового описания, на которое ссылаются новые файловые дескрипторы. Использование данного флага делает ненужными дополнительные вызовы B<fcntl>(2) для достижения того же результата.

source: On success, zero is returned. On error, -1 is returned, I<errno> is set appropriately, and I<pipefd> is left unchanged.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, I<errno> устанавливается в соответствующее значение, а I<pipefd> не изменяется.

source: On Linux (and other systems), B<pipe>() does not modify I<pipefd> on failure. A requirement standardizing this behavior was added in POSIX.1-2016. The Linux-specific B<pipe2>() system call likewise does not modify I<pipefd> on failure.
ru: В Linux (и других системах) B<pipe>() не изменяет I<pipefd> при ошибке. Требование стандартизации этого поведения было добавлено в POSIX.1-2016. Системный вызов Linux B<pipe2>() также не изменяет I<pipefd> при ошибке.

source: I<pipefd> is not valid.
ru: I<pipefd> задан некорректно.

source: (B<pipe2>()) Invalid value in I<flags>.
ru: (B<pipe2>()) Некорректное значение I<flags>.

source: The per-process limit on the number of open file descriptors has been reached.
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: The system-wide limit on the total number of open files has been reached.
ru: Достигнуто максимальное количество открытых файлов в системе.

source: The user hard limit on memory that can be allocated for pipes has been reached and the caller is not privileged; see B<pipe>(7).
ru: Достигнуто жёсткое пользовательское ограничение на выделение памяти для каналов и вызывающий не имеет дополнительных прав; смотрите B<pipe>(7).

source: B<pipe2>() was added to Linux in version 2.6.27; glibc support is available starting with version 2.9.
ru: Вызов B<pipe2>() был добавлен в Linux начиная с версии 2.6.27; поддержка в glibc появилась начиная с версии 2.9.

source: The SystemV ABI on some architectures allows the use of more than one register for returning multiple values; several architectures (namely, Alpha, IA-64, MIPS, SuperH, and SPARC/SPARC64) (ab)use this feature in order to implement the B<pipe>() system call in a functional manner: the call doesn't take any arguments and returns a pair of file descriptors as the return value on success. The glibc B<pipe>() wrapper function transparently deals with this. See B<syscall>(2) for information regarding registers used for storing second file descriptor.
ru: SystemV ABI на некоторых архитектурах позволяет использовать более одного регистра для возврата нескольких значений; в нескольких архитектурах (Alpha, IA-64, MIPS, SuperH и SPARC/SPARC64) использована эта возможность для реализации системного вызова B<pipe>() подобно функциям: вызов не использует параметры и при успешном выполнении возвращает пару файловых дескрипторов как результат. Обёрточная функция glibc B<pipe>() учитывает это. Описание регистров хранения второго файлового дескриптора смотрите в B<syscall>(2).

source: B<pipe2>() is Linux-specific.
ru: Вызов B<pipe2>() есть только в Linux.

source: The following program creates a pipe, and then B<fork>(2)s to create a child process; the child inherits a duplicate set of file descriptors that refer to the same pipe. After the B<fork>(2), each process closes the file descriptors that it doesn't need for the pipe (see B<pipe>(7)). The parent then writes the string contained in the program's command-line argument to the pipe, and the child reads this string a byte at a time from the pipe and echoes it on standard output.
ru: Следующая программа создаёт канал, и затем выполняет B<fork>(2) для создания потомка; потомок наследует скопированный набор файловых дескрипторов, которые указывают на тот же канал. После B<fork>(2) каждый процесс закрывает файловые дескрипторы, которые ненужны каналу (см. B<pipe>(7)). Затем родитель записывает строку, переданную в качестве аргумента командной строки, в канал, а потомок читает эту строку из канала по байту за раз, и выводит её на стандартный вывод.

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>stringE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s E<lt>stringE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: if (cpid == 0) { /* Child reads from pipe */ close(pipefd[1]); /* Close unused write end */
ru: if (cpid == 0) { /* Потомок читает из канала */ close(pipefd[1]); /* Закрывает неиспользуемый конец для записи */

source: } else { /* Parent writes argv[1] to pipe */ close(pipefd[0]); /* Close unused read end */ write(pipefd[1], argv[1], strlen(argv[1])); close(pipefd[1]); /* Reader will see EOF */ wait(NULL); /* Wait for child */ exit(EXIT_SUCCESS); } }
ru: } else { /* Родитель пишет значение argv[1] в канал */ close(pipefd[0]); /* Закрывает неиспользуемый конец для чтения */ write(pipefd[1], argv[1], strlen(argv[1])); close(pipefd[1]); /* Читатель видит EOF */ wait(NULL); /* Ожидание потомка */ exit(EXIT_SUCCESS); } }

source: perfmonctl - interface to IA-64 performance monitoring unit
ru: perfmonctl - интерфейс к блоку слежения за производительностью IA-64
