Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The B<pthread_setcanceltype>() sets the cancelability type of the calling thread to the value given in I<type>. The previous cancelability type of the thread is returned in the buffer pointed to by I<oldtype>. The I<type> argument must have one of the following values:
ru: Функция B<pthread_setcanceltype>() изменяет тип отменяемости вызывающий нити на значение I<type>. Предыдущий тип отменяемости нити возвращается в буфер, на который указывает I<oldstate>. Аргументом I<type> должно быть одно из следующих значений:

source: A cancellation request is deferred until the thread next calls a function that is a cancellation point (see B<pthreads>(7)). This is the default cancelability type in all new threads, including the initial thread.
ru: Запрос отменяемости откладывается до тех пор, пока нить не вызовет функцию, являющуюся точкой отмены (смотрите B<pthreads>(7)). Данный тип является умолчательным для всех нитей, включая начальную.

source: The thread can be canceled at any time. (Typically, it will be canceled immediately upon receiving a cancellation request, but the system doesn't guarantee this.)
ru: Нить может быть отменена в любой момент (практически сразу же после получения запроса об отмене, однако система не гарантирует этого).

source: The set-and-get operation performed by each of these functions is atomic with respect to other threads in the process calling the same function.
ru: Операции установки и получения (set-and-get), выполняемые каждой из этих функций, являются атомарными для предотвращения пересечения с другими процессами, вызывающими ту же функцию.

source: The B<pthread_setcancelstate>() can fail with the following error:
ru: Функция B<pthread_setcancelstate>() может завершиться со следующей ошибкой:

source: Invalid value for I<state>.
ru: Неправильное значение для I<state>.

source: The B<pthread_setcanceltype>() can fail with the following error:
ru: Функция B<pthread_setcanceltype>() может завершиться со следующей ошибкой:

source: Invalid value for I<type>.
ru: Неправильное значение для I<type>.

source: For details of what happens when a thread is canceled, see B<pthread_cancel>(3).
ru: Информацию о том, что происходит с отменяемой нитью, смотрите в B<pthread_cancel>(3).

source: Briefly disabling cancelability is useful if a thread performs some critical action that must not be interrupted by a cancellation request. Beware of disabling cancelability for long periods, or around operations that may block for long periods, since that will render the thread unresponsive to cancellation requests.
ru: Запрет отмены на короткое время полезен, если нить выполняет какое-то важное действие, которое не должно прерываться запросом отмены. Остерегайтесь запретов отмены на длительный срок или для операций, которые могут занять много времени, так как нить при этом перестанет отвечать на запросы отмены.

source: Asynchronous cancelability
ru: Асинхронная отменяемость

source: Setting the cancelability type to B<PTHREAD_CANCEL_ASYNCHRONOUS> is rarely useful. Since the thread could be canceled at I<any> time, it cannot safely reserve resources (e.g., allocating memory with B<malloc>(3)), acquire mutexes, semaphores, or locks, and so on. Reserving resources is unsafe because the application has no way of knowing what the state of these resources is when the thread is canceled; that is, did cancellation occur before the resources were reserved, while they were reserved, or after they were released? Furthermore, some internal data structures (e.g., the linked list of free blocks managed by the B<malloc>(3) family of functions) may be left in an inconsistent state if cancellation occurs in the middle of the function call. Consequently, clean-up handlers cease to be useful.
ru: Задание типа отменяемости B<PTHREAD_CANCEL_ASYNCHRONOUS> полезно редко. Так как нить может быть отменена в I<любой> момент, невозможно безопасно резервировать ресурсы (например, выделять память с помощью B<malloc>(3)), захватывать мьютексы, семафоры или блокировки и так далее. Резервирование ресурсов небезопасно, так как приложение не может узнать состояние этих ресурсов при отмене нити; то есть, произошла ли отмена до резервирования ресурсов, во время из резервирования или после их освобождения? Кроме того, некоторые внутренние структуры данных (например, связные списки свободных блоков, управляемые семейством функций B<malloc>(3)) могут остаться в не целостном состоянии, если отмена происходит в середине вызова функции. Следовательно, обработчики очистки перестают быть полезными.

source: Functions that can be safely asynchronously canceled are called I<async-cancel-safe functions>. POSIX.1-2001 and POSIX.1-2008 require only that B<pthread_cancel>(3), B<pthread_setcancelstate>(), and B<pthread_setcanceltype>() be async-cancel-safe. In general, other library functions can't be safely called from an asynchronously cancelable thread.
ru: Функции, которые можно безопасно асинхронно отменять называются I<функциями async-cancel-safe>. В POSIX.1-2001 и POSIX.1-2008 требуется, чтобы такими функция были только B<pthread_cancel>(3), B<pthread_setcancelstate>() и B<pthread_setcanceltype>(). В общем, другие функции библиотеки нельзя безопасно вызывать из асинхронно отменяемой нити.

source: One of the few circumstances in which asynchronous cancelability is useful is for cancellation of a thread that is in a pure compute-bound loop.
ru: Одной из нескольких ситуаций, в которых асинхронная отменяемость полезна, является отменяемость нити, которая находится в цикле, занимающимся только вычислениями.

source: The Linux threading implementations permit the I<oldstate> argument of B<pthread_setcancelstate>() to be NULL, in which case the information about the previous cancelability state is not returned to the caller. Many other implementations also permit a NULL I<oldstat> argument, but POSIX.1 does not specify this point, so portable applications should always specify a non-NULL value in I<oldstate>. A precisely analogous set of statements applies for the I<oldtype> argument of B<pthread_setcanceltype>().
ru: Реализации нитей в Linux позволяют присваивать аргументу I<oldstate> функции B<pthread_setcancelstate>() значение NULL; в этом случае информация о предыдущем состоянии отмены не возвращается вызывающему. Многие другие реализации также допускают NULL в качестве значения I<oldstat>, но POSIX.1 этот случай не рассматривается, поэтому переносимые приложения должны всегда указывать в I<oldstate> значение, отличное от NULL. Эти утверждения относятся и к аргументу I<oldtype> функции B<pthread_setcanceltype>().

source: See B<pthread_cancel>(3).
ru: Смотрите B<pthread_cancel>(3).

source: pthread_attr_setstack, pthread_attr_getstack - set/get stack attributes in thread attributes object
ru: pthread_attr_setstack, pthread_attr_getstack - изменяет/возвращает атрибуты стека из объекта атрибутов нити

source: The B<pthread_attr_setstack>() function sets the stack address and stack size attributes of the thread attributes object referred to by I<attr> to the values specified in I<stackaddr> and I<stacksize>, respectively. These attributes specify the location and size of the stack that should be used by a thread that is created using the thread attributes object I<attr>.
ru: Функция B<pthread_attr_setstack>() изменяет атрибуты адреса и размера стека в объекте атрибутов нити, на который указывает I<attr>, на значения, задаваемые в I<stackaddr> и I<stacksize>, соответственно. Данными атрибутами задаёт расположение и размер стека, который будет использоваться нитью, создаваемой с использованием объекта атрибутов нити I<attr>.

source: I<stackaddr> should point to the lowest addressable byte of a buffer of I<stacksize> bytes that was allocated by the caller. The pages of the allocated buffer should be both readable and writable.
ru: Значение I<stackaddr> должно указывать на самый младший адресуемый байт буфера из I<stacksize> байт, выделенного вызывающим. Страницы выделенного буфера должны быть доступны на чтение и запись.

source: The B<pthread_attr_getstack>() function returns the stack address and stack size attributes of the thread attributes object referred to by I<attr> in the buffers pointed to by I<stackaddr> and I<stacksize>, respectively.
ru: Функция B<pthread_attr_getstack>() возвращает атрибуты адреса и размера стека из объекта атрибутов нити, на который указывает I<attr>, в буфер, на который указывает I<stackaddr> и I<stacksize>, соответственно.

source: B<pthread_attr_setstack>() can fail with the following error:
ru: Функция B<pthread_attr_setstack>() может завершиться со следующей ошибкой:

source: I<stacksize> is less than B<PTHREAD_STACK_MIN> (16384) bytes. On some systems, this error may also occur if I<stackaddr> or I<stackaddr\ +\ stacksize> is not suitably aligned.
ru: Значение I<stacksize> меньше B<PTHREAD_STACK_MIN> (16384) байт. В некоторых системах эта ошибка также может возникать, если значения I<stackaddr> или I<stackaddr\ +\ stacksize> не выровнены правильным образом.

source: POSIX.1 also documents an B<EACCES> error if the stack area described by I<stackaddr> and I<stacksize> is not both readable and writable by the caller.
ru: В POSIX.1 также описана ошибка B<EACCES>, которая возникает, если область стека, определённая I<stackaddr> и I<stacksize>, недоступна вызывающему на чтение и запись.

source: These functions are provided by glibc since version 2.2.
ru: Эти функции определены в glibc начиная с версии 2.2.

source: These functions are provided for applications that must ensure that a thread's stack is placed in a particular location. For most applications, this is not necessary, and the use of these functions should be avoided. (Use B<pthread_attr_setstacksize>(3) if an application simply requires a stack size other than the default.)
ru: Эти функции нужны приложениям, в которых нужно размещать стек в определённом месте. В большинстве приложений это не нужно и эти функции использовать не стоит (используйте B<pthread_attr_setstacksize>(3), если приложению нужно задать только размер стека, отличный от умолчательного).

source: When an application employs B<pthread_attr_setstack>(), it takes over the responsibility of allocating the stack. Any guard size value that was set using B<pthread_attr_setguardsize>(3) is ignored. If deemed necessary, it is the application's responsibility to allocate a guard area (one or more pages protected against reading and writing) to handle the possibility of stack overflow.
ru: Когда приложение использует B<pthread_attr_setstack>(), оно самостоятельно выделяет место под стек. Защитный размер, задаваемый B<pthread_attr_setguardsize>(3), игнорируется. Если его учитывать необходимо, то приложение должно самостоятельно выделять защитную область (одну или несколько страниц, защищённых от чтения и записи) для обработки возможного переполнения стека.

source: The address specified in I<stackaddr> should be suitably aligned: for full portability, align it on a page boundary (I<sysconf(_SC_PAGESIZE)>). B<posix_memalign>(3) may be useful for allocation. Probably, I<stacksize> should also be a multiple of the system page size.
ru: Адрес, указанный в I<stackaddr>, должен быть выровнен соответствующим образом: для полной переносимости выравнивайте его по границе страницы (I<sysconf(_SC_PAGESIZE)>). Для выделения полезно использовать функцию B<posix_memalign>(3). Вероятно, значение I<stacksize> также должно быть кратно размеру системной страницы.

source: If I<attr> is used to create multiple threads, then the caller must change the stack address attribute between calls to B<pthread_create>(3); otherwise, the threads will attempt to use the same memory area for their stacks, and chaos will ensue.
ru: Если I<attr> используется при создании нескольких нитей, то вызывающий должен изменять атрибут адреса стека между вызовами B<pthread_create>(3); в противном случае нити будут пытаться использовать одну и ту же область памяти для стека и возникнет хаос.

source: pthread_attr_setinheritsched, pthread_attr_getinheritsched - set/get inherit-scheduler attribute in thread attributes object
ru: pthread_attr_setinheritsched, pthread_attr_getinheritsched - изменяет/возвращает атрибут наследования планировщика из объекта атрибутов нити

source: The B<pthread_attr_setinheritsched>() function sets the inherit-scheduler attribute of the thread attributes object referred to by I<attr> to the value specified in I<inheritsched>. The inherit-scheduler attribute determines whether a thread created using the thread attributes object I<attr> will inherit its scheduling attributes from the calling thread or whether it will take them from I<attr>.
ru: Функция B<pthread_attr_setinheritsched>() изменяет атрибут наследования планировщика у объекта атрибутов нити, на которую указывает I<attr>, на значение, заданное в I<inheritsched>. Атрибут наследования планировщика определяет будет ли нить, создаваемая с учётом объекта атрибутов нити I<attr>, наследовать свои атрибуты планировщика от вызывающей нити или для этого будут использованы значения из I<attr>.

source: The following scheduling attributes are affected by the inherit-scheduler attribute: scheduling policy (B<pthread_attr_setschedpolicy>(3)), scheduling priority (B<pthread_attr_setschedparam>(3)), and contention scope (B<pthread_attr_setscope>(3)).
ru: Атрибуты планирования, на которые влияет атрибут наследования планировщика: алгоритм планирования (B<pthread_attr_setschedpolicy>(3)), приоритет планирования (B<pthread_attr_setschedparam>(3)) и область конкурирования (B<pthread_attr_setscope>(3)).

source: The following values may be specified in I<inheritsched>:
ru: В I<inheritsched> можно указать следующие значения:

source: Threads that are created using I<attr> inherit scheduling attributes from the creating thread; the scheduling attributes in I<attr> are ignored.
ru: Нити, создаваемые с учётом I<attr>, наследуют атрибуты планирования от создающей нити; атрибуты планирования I<attr> игнорируются.

source: Threads that are created using I<attr> take their scheduling attributes from the values specified by the attributes object.
ru: Нити, создаваемые с учётом I<attr>, берут значения атрибутов планирования из указанного объекта атрибутов.

source: The default setting of the inherit-scheduler attribute in a newly initialized thread attributes object is B<PTHREAD_INHERIT_SCHED>.
ru: Значением по умолчанию для атрибута наследования планировщика в инициализируемом объекте атрибутов нити является B<PTHREAD_INHERIT_SCHED>.

source: The B<pthread_attr_getinheritsched>() returns the inherit-scheduler attribute of the thread attributes object I<attr> in the buffer pointed to by I<inheritsched>.
ru: Функция B<pthread_attr_getinheritsched>() возвращает атрибут наследования планировщика у объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<inheritsched>.

source: B<pthread_attr_setinheritsched>() can fail with the following error:
ru: Функция B<pthread_attr_setinheritsched>() может завершиться со следующей ошибкой:

source: Invalid value in I<inheritsched>.
ru: Некорректное значение I<inheritsched>.

source: POSIX.1 also documents an optional B<ENOTSUP> error ("attempt was made to set the attribute to an unsupported value") for B<pthread_attr_setinheritsched>().
ru: Для B<pthread_attr_setinheritsched>() в POSIX.1 также описана необязательная ошибка B<ENOTSUP> («попытка изменить атрибут на не поддерживаемое значение»).

source: As at glibc 2.8, if a thread attributes object is initialized using B<pthread_attr_init>(3), then the scheduling policy of the attributes object is set to B<SCHED_OTHER> and the scheduling priority is set to 0. However, if the inherit-scheduler attribute is then set to B<PTHREAD_EXPLICIT_SCHED>, then a thread created using the attribute object wrongly inherits its scheduling attributes from the creating thread. This bug does not occur if either the scheduling policy or scheduling priority attribute is explicitly set in the thread attributes object before calling B<pthread_create>(3).
ru: По состоянию на glibc 2.8, если объект атрибутов нити инициализирован с помощью B<pthread_attr_init>(3), то алгоритму планирования в объекте атрибутов присваивается B<SCHED_OTHER>, а приоритет планирования равен 0. Однако, если затем атрибут наследования планировщика устанавливается в B<PTHREAD_EXPLICIT_SCHED>, то нить, создаваемая с учётом объекта атрибутов, неправильно наследует свои атрибуты планирования от создающей нити. Этот дефект не проявляется, если значение атрибута алгоритма планирования или приоритета планирования назначается явно в объекте атрибутов нити до вызова B<pthread_create>(3).

source: pthread_kill_other_threads_np - terminate all other threads in process
ru: pthread_kill_other_threads_np - завершает все остальные нити процесса

source: B<pthread_kill_other_threads_np>() has an effect only in the LinuxThreads threading implementation. On that implementation, calling this function causes the immediate termination of all threads in the application, except the calling thread. The cancellation state and cancellation type of the to-be-terminated threads are ignored, and the cleanup handlers are not called in those threads.
ru: Функция B<pthread_kill_other_threads_np>() эффективна только в реализации нитей LinuxThreads. В этой реализации вызов данной функции приводит к немедленному завершению всех нитей приложения, кроме той, из которой вызвана функция. Состояние и тип отмены завершаемых нитей игнорируются, а очищающие обработчики не вызываются.

source: B<pthread_kill_other_threads_np>() is intended to be called just before a thread calls B<execve>(2) or a similar function. This function is designed to address a limitation in the obsolete LinuxThreads implementation whereby the other threads of an application are not automatically terminated (as POSIX.1-2001 requires) during B<execve>(2).
ru: Функция B<pthread_kill_other_threads_np>() предназначена для вызова из нити B<execve>(2) или подобной функции. Она разработана для преодоления ограничения в устаревшей реализации LinuxThreads, где нити приложения не завершаются автоматически (как того требуется в POSIX.1-2001) при B<execve>(2).

source: In the NPTL threading implementation, B<pthread_kill_other_threads_np>() exists, but does nothing. (Nothing needs to be done, because the implementation does the right thing during an B<execve>(2).)
ru: В реализации нитей NPTL функция B<pthread_kill_other_threads_np>() также существует, но ничего не делает (делать ничего не нужно, так как реализация правильно работает во время B<execve>(2)).

source: pthread_cleanup_push_defer_np, pthread_cleanup_pop_restore_np - push and pop thread cancellation clean-up handlers while saving cancelability type
ru: pthread_cleanup_push_defer_np, pthread_cleanup_pop_restore_np - добавляет и удаляет очищающие обработчики отмены нити при сохранении типа отмены

source: These functions are the same as B<pthread_cleanup_push>(3) and B<pthread_cleanup_pop>(3), except for the differences noted on this page.
ru: Эти функции работают также как B<pthread_cleanup_push>(3) и B<pthread_cleanup_pop>(3), за исключением различий, описанных в данной справочной странице.

source: Like B<pthread_cleanup_push>(3), B<pthread_cleanup_push_defer_np>() pushes I<routine> onto the thread's stack of cancellation clean-up handlers. In addition, it also saves the thread's current cancelability type, and sets the cancelability type to "deferred" (see B<pthread_setcanceltype>(3)); this ensures that cancellation clean-up will occur even if the thread's cancelability type was "asynchronous" before the call.
ru: Подобно B<pthread_cleanup_push>(3), B<pthread_cleanup_push_defer_np>() добавляет I<routine> в стек нити к очищающим обработчикам отмены. Кроме этого, она также сохраняет текущий тип отмены нити, и изменяет тип отмены на «отложенный» (смотрите B<pthread_setcanceltype>(3)); это гарантирует, что очистка при отмене произойдёт даже, если тип отмены нити перед вызовом был «асинхронный».

source: Like B<pthread_cleanup_pop>(3), B<pthread_cleanup_pop_restore_np>() pops the top-most clean-up handler from the thread's stack of cancellation clean-up handlers. In addition, it restores the thread's cancelability type to its value at the time of the matching B<pthread_cleanup_push_defer_np>().
ru: Подобно B<pthread_cleanup_pop>(3), B<pthread_cleanup_pop_restore_np>() удаляет самый верхний очищающий обработчик из стека нити очищающих обработчиков отмены. Кроме этого, она восстанавливает тип отмены нити в значение на момент, когда была вызвана B<pthread_cleanup_push_defer_np>().

source: The caller must ensure that calls to these functions are paired within the same function, and at the same lexical nesting level. Other restrictions apply, as described in B<pthread_cleanup_push>(3).
ru: Вызывающий должен гарантировать, что вызовы этих функций будут попарными внутри одной функции, и на одном лексическом уровне вложенности. Остальные ограничения описаны в B<pthread_cleanup_push>(3).

source: This sequence of calls:
ru: Последовательность вызовов:

source: is equivalent to (but shorter and more efficient than):
ru: эквивалентна (но короче и эффективнее):

source: profil - execution time profile
ru: profil - профилирование времени работы

source: Since glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 and 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Up to and including glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)
ru: Начиная с glibc 2.21: _DEFAULT_SOURCE В glibc 2.19 и 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) По glibc 2.19 включительно: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)

source: This routine provides a means to find out in what areas your program spends most of its time. The argument I<buf> points to I<bufsiz> bytes of core. Every virtual 10 milliseconds, the user's program counter (PC) is examined: I<offset> is subtracted and the result is multiplied by I<scale> and divided by 65536. If the resulting value is less than I<bufsiz>, then the corresponding entry in I<buf> is incremented. If I<buf> is NULL, profiling is disabled.
ru: Эта функция позволяет выяснить какие области вашей программы работают больше всего. В аргументе I<buf> указывается I<bufsiz> байт ядра. Каждые 10 виртуальных миллисекунд проверяется пользовательский программный счётчик (PC): из него вычитается I<offset>, умножается на I<scale> и делится на 65536. Если полученное значение меньше I<bufsiz>, то в I<buf> увеличивается соответствующая запись. Если I<buf> равно NULL, профилирование выключено.

source: Zero is always returned.
ru: Всегда возвращается ноль.

source: Similar to a call in SVr4 (but not POSIX.1).
ru: Подобно вызову в SVr4 (но не POSIX.1).

source: B<profil>() cannot be used on a program that also uses B<ITIMER_PROF> interval timers (see B<setitimer>(2)).
ru: Функцию B<profil>() нельзя использовать на программе, которая также использует таймеры интервалов B<ITIMER_PROF> (смотрите B<setitimer>(2)).

source: True kernel profiling provides more accurate results. Libc 4.4 contained a kernel patch providing a system call profil.
ru: При профилировании настоящим ядром получаются более точные результаты. В libc 4.4 есть заплата к ядру, добавляющая системный вызов profil.

source: putpwent - write a password file entry
ru: putpwent - записывает элемент в файл паролей

source: B<putpwent>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _SVID_SOURCE
ru: B<putpwent>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _SVID_SOURCE

source: The B<putpwent>() function writes a password entry from the structure I<p> in the file associated with I<stream>.
ru: Функция B<putpwent>() выполняет запись элемента пароля из структуры I<p> в файл, связанный с I<stream>.
