Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The following values may be specified in I<detachstate>:
ru: В I<detachstate> можно указать следующие значения:

source: Threads that are created using I<attr> will be created in a detached state.
ru: Нити, создаваемые с I<attr>, будут созданы в отключённом состоянии.

source: Threads that are created using I<attr> will be created in a joinable state.
ru: Нити, создаваемые с I<attr>, будут созданы в присоединяемом состоянии.

source: The default setting of the detach state attribute in a newly initialized thread attributes object is B<PTHREAD_CREATE_JOINABLE>.
ru: Значением по умолчанию для атрибута состояния отключённости в инициализируемом объекте атрибутов нити является B<PTHREAD_CREATE_JOINABLE>.

source: The B<pthread_attr_getdetachstate>() returns the detach state attribute of the thread attributes object I<attr> in the buffer pointed to by I<detachstate>.
ru: Функция B<pthread_attr_getdetachstate>() возвращает атрибут состояния отключённости нити у объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<detachstate>.

source: B<pthread_attr_setdetachstate>() can fail with the following error:
ru: Функция B<pthread_attr_setdetachstate>() может завершиться со следующей ошибкой:

source: An invalid value was specified in I<detachstate>.
ru: Указано неверное значение в I<detachstate>.

source: See B<pthread_create>(3) for more details on detached and joinable threads.
ru: Дополнительную информацию об отключённых и присоединяемых нитях смотрите в B<pthread_create>(3).

source: A thread that is created in a joinable state should eventually either be joined using B<pthread_join>(3) or detached using B<pthread_detach>(3); see B<pthread_create>(3).
ru: Нить, созданная в присоединяемом состоянии, должна быть в последствии присоединена с помощью B<pthread_join>(3) или отключена с помощью B<pthread_detach>(3); смотрите B<pthread_create>(3).

source: It is an error to specify the thread ID of a thread that was created in a detached state in a later call to B<pthread_detach>(3) or B<pthread_join>(3).
ru: Если указать ID нити, которая была создана в отключённом состоянии в вызове B<pthread_detach>(3) или B<pthread_join>(3), то возникает ошибка.

source: See B<pthread_attr_init>(3).
ru: Смотрите B<pthread_attr_init>(3).

source: pthread_yield - yield the processor
ru: pthread_yield - освобождает процессор

source: B<pthread_yield>() causes the calling thread to relinquish the CPU. The thread is placed at the end of the run queue for its static priority and another thread is scheduled to run. For further details, see B<sched_yield>(2)
ru: Функция B<pthread_yield>() заставляет вызывающую нить освободить процессор. Нить помещается в конец очереди выполнения согласно её статическому приоритету, и управление передаётся другой нити. Дополнительную информацию можно найти в B<sched_yield>(2).

source: On success, B<pthread_yield>() returns 0; on error, it returns an error number.
ru: При успешном выполнении B<pthread_yield>() возвращается 0; при ошибке возвращается номер ошибки.

source: On Linux, this call always succeeds (but portable and future-proof applications should nevertheless handle a possible error return).
ru: В Linux эта функция всегда выполняется успешно (но в переносимых приложениях нужно учитывать возможность возврата ошибки).

source: This call is nonstandard, but present on several other systems. Use the standardized B<sched_yield>(2) instead.
ru: Эта функция является нестандартной, но присутствует в некоторых других системах. Вместо неё используйте стандартный вызов B<sched_yield>(2).

source: On Linux, this function is implemented as a call to B<sched_yield>(2).
ru: В Linux эта функция реализована как вызов B<sched_yield>(2).

source: B<pthread_yield>() is intended for use with real-time scheduling policies (i.e., B<SCHED_FIFO> or B<SCHED_RR>). Use of B<pthread_yield>() with nondeterministic scheduling policies such as B<SCHED_OTHER> is unspecified and very likely means your application design is broken.
ru: Функция B<pthread_yield>() предназначена для использования с алгоритмами планирования реального времени (т. е., B<SCHED_FIFO> или B<SCHED_RR>). Использование B<pthread_yield>() с недерминированными алгоритмами планирования, такими как B<SCHED_OTHER>, не определено и указывает на, вероятно, неправильно разработанное приложение.

source: posix_openpt - open a pseudoterminal device
ru: posix_openpt - открывает псевдо-терминальное устройство

source: The B<posix_openpt>() function opens an unused pseudoterminal master device, returning a file descriptor that can be used to refer to that device.
ru: Функция B<posix_openpt>() открывает неиспользуемое главное псевдо-терминальное устройство, возвращая файловый дескриптор, который можно использовать для работы с устройством.

source: The I<flags> argument is a bit mask that ORs together zero or more of the following flags:
ru: Аргумент I<flags> представляет собой битовую маску из комбинации (OR) нуля или более следующих флагов:

source: Open the device for both reading and writing. It is usual to specify this flag.
ru: Открыть устройство для чтения и записи. Обычно, указывается этот флаг.

source: Do not make this device the controlling terminal for the process.
ru: Не делать данное устройство управляющим терминалом процесса.

source: On success, B<posix_openpt>() returns a nonnegative file descriptor which is the lowest numbered unused file descriptor. On failure, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<posix_openpt>() возвращает неотрицательный файловый дескриптор с наименьшим номером неиспользуемого файлового дескриптора. При ошибке возвращается -1, и в I<errno> записывается номер ошибки.

source: See B<open>(2).
ru: Смотрите B<open>(2).

source: Glibc support for B<posix_openpt>() has been provided since version 2.2.1.
ru: Поддержка B<posix_openpt>() в glibc появилась в версии 2.2.1.

source: B<posix_openpt>() is part of the UNIX 98 pseudoterminal support (see B<pts>(4)).
ru: Функция B<posix_openpt>() является частью поддержки псевдо-терминалов UNIX 98 (смотрите B<pts>(4)).

source: Some older UNIX implementations that support System V (aka UNIX 98) pseudoterminals don't have this function, but it is easy to implement:
ru: В некоторых старых реализациях UNIX, поддерживающих System V (также называемом UNIX 98), для псевдо-терминалов нет этой функции, но её легко написать:

source: Calling B<posix_openpt>() creates a pathname for the corresponding pseudoterminal slave device. The pathname of the slave device can be obtained using B<ptsname>(3). The slave device pathname exists only as long as the master device is open.
ru: При вызове B<posix_openpt>() создаётся путь для соответствующего подчинённого псевдо-терминального устройства. Путь подчинённого устройства можно получить с помощью B<ptsname>(3). Путь подчинённого устройства существует только пока открыто главное устройство.

source: pthread_setschedprio - set scheduling priority of a thread
ru: pthread_setschedprio - изменяет приоритет планирования нити

source: The B<pthread_setschedprio>() function sets the scheduling priority of the thread I<thread> to the value specified in I<prio>. (By contrast B<pthread_setschedparam>(3) changes both the scheduling policy and priority of a thread.)
ru: Функция B<pthread_setschedprio>() изменяет приоритет планирования нити I<thread> на значение, указанное в I<prio> (по сравнению с B<pthread_setschedparam>(3), которая изменяет сразу алгоритм планирования и приоритет нити).

source: On success, this function returns 0; on error, it returns a nonzero error number. If B<pthread_setschedprio>() fails, the scheduling priority of I<thread> is not changed.
ru: При успешном выполнении функция возвращает 0; при ошибке возвращается ненулевой номер ошибки. Если B<pthread_setschedprio>() завершается ошибкой, то приоритет планирования I<thread> не изменяется.

source: I<prio> is not valid for the scheduling policy of the specified thread.
ru: Значение I<prio> некорректно для приоритета планирования указанной нити.

source: The caller does not have appropriate privileges to set the specified priority.
ru: Вызывающий не имеет соответствующих прав для установки указанного приоритета.

source: POSIX.1 also documents an B<ENOTSUP> ("attempt was made to set the priority to an unsupported value") error for B<pthread_setschedparam>(3).
ru: Для B<pthread_setschedparam>(3) в POSIX.1 также описана необязательная ошибка B<ENOTSUP> («попытка изменить приоритет на не поддерживаемое значение»).

source: This function is available in glibc since version 2.3.4.
ru: Эта функция доступна в glibc начиная с версии 2.3.4.

source: For a description of the permissions required to, and the effect of, changing a thread's scheduling priority, and details of the permitted ranges for priorities in each scheduling policy, see B<sched>(7).
ru: Список требуемых прав, результат, изменение приоритета планирования нити и подробности разрешённых диапазонов приоритетов для каждого алгоритма планирования смотрите в B<sched>(7).

source: putenv - change or add an environment variable
ru: putenv - изменяет или добавляет переменную окружения

source: B<putenv>(): _XOPEN_SOURCE || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE
ru: B<putenv>(): _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _SVID_SOURCE

source: The B<putenv>() function adds or changes the value of environment variables. The argument I<string> is of the form I<name>=I<value>. If I<name> does not already exist in the environment, then I<string> is added to the environment. If I<name> does exist, then the value of I<name> in the environment is changed to I<value>. The string pointed to by I<string> becomes part of the environment, so altering the string changes the environment.
ru: Функция B<putenv>() добавляет или изменяет значение переменных окружения. Аргумент I<string> должен быть представлен в форме I<name>=I<value>. Если переменной с именем I<name> нет в окружении, то I<string> добавляется к окружению. Если переменная I<name> уже существует, то значение I<name> в окружении изменяется на I<value>. Строка, на которую указывает I<string>, становится частью окружения, так что её изменение приведёт к изменению окружения.

source: The B<putenv>() function returns zero on success, or nonzero if an error occurs. In the event of an error, I<errno> is set to indicate the cause.
ru: Функция B<putenv>() возвращает ноль при успешном выполнении и не ноль в противном случае. При ошибке I<errno> отражает причину ошибки.

source: Insufficient space to allocate new environment.
ru: Недостаточно памяти под новое окружение.

source: The B<putenv>() function is not required to be reentrant, and the one in glibc 2.0 is not, but the glibc 2.1 version is.
ru: От функции B<putenv>() не требуется быть реентерабельной, и она такова в glibc 2.0, но в glibc 2.1 она реентерабельна.

source: Since version 2.1.2, the glibc implementation conforms to SUSv2: the pointer I<string> given to B<putenv>() is used. In particular, this string becomes part of the environment; changing it later will change the environment. (Thus, it is an error to call B<putenv>() with an automatic variable as the argument, then return from the calling function while I<string> is still part of the environment.) However, glibc versions 2.0 to 2.1.1 differ: a copy of the string is used. On the one hand this causes a memory leak, and on the other hand it violates SUSv2.
ru: Начиная с версии 2.1.2 glibc соответствует SUSv2: используется указатель I<string>, передаваемый B<putenv>(). В частности, эта строка становится частью окружения; последующее её изменение приводит к изменению окружения. Таким образом, ошибочным будет вызывать B<putenv>() с автоматической переменной в качестве аргумента, так как после возврата из вызвавшей функции строка I<string> является частью окружения. Однако, версии glibc 2.0 по 2.1.1 работают по-другому: используется копия строки. С одной стороны, это вызывает утечку памяти, с другой стороны, это не соответствует SUSv2.

source: The 4.4BSD version, like glibc 2.0, uses a copy.
ru: В версии 4.4BSD как и в glibc 2.0 используется копия.

source: SUSv2 removes the I<const> from the prototype, and so does glibc 2.1.3.
ru: В SUSv2 удалено I<const> из прототипа и это сделано в glibc 2.1.3.

source: The GNU C library implementation provides a nonstandard extension. If I<string> does not include an equal sign:
ru: Реализация библиотеки GNU C предоставляет нестандартное расширение. Если I<string> не включает знака равно:

source: then the named variable is removed from the caller's environment.
ru: то именованная переменная удаляется из окружения вызывающего.

source: putwchar - write a wide character to standard output
ru: putwchar - записывает широкий символ в стандартный выходной поток

source: The B<putwchar>() function is the wide-character equivalent of the B<putchar>(3) function. It writes the wide character I<wc> to I<stdout>. If I<ferror(stdout)> becomes true, it returns B<WEOF>. If a wide character conversion error occurs, it sets I<errno> to B<EILSEQ> and returns B<WEOF>. Otherwise, it returns I<wc>.
ru: Функция B<putwchar> — это эквивалент функции B<putchar>(3), но для широких символов. Она записывает широкий символ I<wc> в поток I<stdout>. Если значение I<ferror(stdout)> истинно, то возвращается B<WEOF>. Если при преобразовании в широкий символ возникает ошибка, то значение переменной I<errno> устанавливается равным B<EILSEQ> и возвращается B<WEOF>. В любом другом случае возвращается I<wc>.

source: For a nonlocking counterpart, see B<unlocked_stdio>(3).
ru: Неблокирующий аналог смотрите в B<unlocked_stdio>(3).

source: The B<putwchar>() function returns I<wc> if no error occurred, or B<WEOF> to indicate an error.
ru: При успешном выполнении B<putwchar>() возвращается I<wc>; при ошибке возвращается B<WEOF>.

source: The behavior of B<putwchar>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<putwchar>() зависит от категории B<LC_CTYPE> текущей локали.

source: It is reasonable to expect that B<putwchar>() will actually write the multibyte sequence corresponding to the wide character I<wc>.
ru: Закономерно ожидать, что B<putwchar>() на самом деле пишет многобайтовую последовательность, соответствующую широкому символу I<wc>.

source: posix_madvise - give advice about patterns of memory usage
ru: posix_madvise - отсылает предложения по шаблонам использования памяти

source: The B<posix_madvise>() function allows an application to advise the system about its expected patterns of usage of memory in the address range starting at I<addr> and continuing for I<len> bytes. The system is free to use this advice in order to improve the performance of memory accesses (or to ignore the advice altogether), but calling B<posix_madvise>() shall not affect the semantics of access to memory in the specified range.
ru: Функция B<posix_madvise>() позволяет приложению показывать системе свои ожидания при использовании памяти в диапазоне начиная с адреса I<addr> и длиной I<len> байт. Система может использовать это предложение для улучшения производительности доступа к памяти (или игнорировать), но вызов B<posix_madvise>() не повлияет на семантику доступа к памяти в указанном диапазоне.

source: The I<advice> argument is one of the following:
ru: В аргументе I<advice> указывается одно из следующих значений:

source: The application has no special advice regarding its memory usage patterns for the specified address range. This is the default behavior.
ru: Приложение не даёт каких-либо предложений о том, как будет использована память в указанном диапазоне. Поведение по умолчанию.

source: The application expects to access the specified address range sequentially, running from lower addresses to higher addresses. Hence, pages in this region can be aggressively read ahead, and may be freed soon after they are accessed.
ru: Приложение будет последовательно обращаться к памяти в указанном диапазоне адресов, от младшего адреса к старшему. Следовательно, все страницы в этом диапазоне можно заранее прочитать и освободить сразу после доступа к ним.

source: The application expects to access the specified address range randomly. Thus, read ahead may be less useful than normally.
ru: Приложение будет обращаться по указанному диапазону адресов в случайном порядке. То есть упреждающее чтение может быть менее эффективным, чем обычно.

source: The application expects to access the specified address range in the near future. Thus, read ahead may be beneficial.
ru: Приложение обратится по указанному диапазону адресов в в ближайшем будущем. То есть от упреждающего чтения можно выиграть.

source: The application expects that it will not access the specified address range in the near future.
ru: Приложение не будет обращаться по указанному диапазону адресов в в ближайшем будущем.

source: On success, B<posix_madvise>() returns 0. On failure, it returns a positive error number.
ru: При успешном выполнении B<posix_madvise>() возвращает 0. При ошибке возвращается положительный номер ошибки.

source: I<addr> is not a multiple of the system page size or I<len> is negative.
ru: Значение I<addr> не кратно размеру системной страницы или значение I<len> отрицательно.

source: I<advice> is invalid.
ru: Неверное значение I<advice>.

source: Addresses in the specified range are partially or completely outside the caller's address space.
ru: Адреса в указанном диапазоне частично или полностью лежат вне адресного пространства вызывающего.

source: Support for B<posix_madvise>() first appeared in glibc version 2.2.
ru: Поддержка B<posix_madvise>() появилась в glibc 2.2.

source: POSIX.1 permits an implementation to generate an error if I<len> is 0. On Linux, specifying I<len> as 0 is permitted (as a successful no-op).
ru: В POSIX.1 допускается, что реализация генерирует ошибку, если I<len> равно 0. В Linux допустимо значение I<len> равное 0 (ничего не делается).

source: In glibc, this function is implemented using B<madvise>(2). However, since glibc 2.6, B<POSIX_MADV_DONTNEED> is treated as a no-op, because the corresponding B<madvise>(2) value, B<MADV_DONTNEED>, has destructive semantics.
ru: В glibc эта функция реализована через вызов B<madvise>(2). Однако, начиная с glibc 2.6, B<POSIX_MADV_DONTNEED> для ничего не делается, так как соответствующее значение в B<madvise>(2), B<MADV_DONTNEED>, имеет разрушительную семантику.

source: pthread_getcpuclockid - retrieve ID of a thread's CPU time clock
ru: pthread_getcpuclockid - возвращает ID таймера времени ЦП у нити

source: The B<pthread_getcpuclockid>() function returns the clock ID for the CPU time clock of the thread I<thread>.
ru: Функция B<pthread_getcpuclockid>() возвращает ID таймера времени ЦП у нити I<thread>.

source: Per-thread CPU time clocks are not supported by the system.
ru: В системе не поддерживаются выделенные таймеры времени ЦП для каждой нити.

source: This function is available in glibc since version 2.2.
ru: Эта функция доступна в glibc начиная с версии 2.2.

source: When I<thread> refers to the calling thread, this function returns an identifier that refers to the same clock manipulated by B<clock_gettime>(2) and B<clock_settime>(2) when given the clock ID B<CLOCK_THREAD_CPUTIME_ID>.
ru: Если I<thread> указывает на вызвавшую нить, то функция возвращает идентификатор, указывающий на таймер, управляемый B<clock_gettime>(2) и B<clock_settime>(2), если ID таймера равно B<CLOCK_THREAD_CPUTIME_ID>.

source: The program below creates a thread and then uses B<clock_gettime>(2) to retrieve the total process CPU time, and the per-thread CPU time consumed by the two threads. The following shell session shows an example run:
ru: Программа, показанная далее, создаёт нить и используя B<clock_gettime>(2) показывает общее время ЦП и время ЦП, затраченное на работу нитей по отдельности. Пример сеанса работы:

source: $ B<./a.out> Main thread sleeping Subthread starting infinite loop Main thread consuming some CPU time... Process total CPU time: 1.368 Main thread CPU time: 0.376 Subthread CPU time: 0.992
ru: $ B<./a.out> Главная нить спит Вторая нить входит в бесконечный цикл Главная нить использует немного времени ЦП… Общее время ЦП для процесса: 1.368 Время ЦП для главной нити: 0.376 Время ЦП для второй нити: 0.992

source: /* Link with "-lrt" */
ru: /* компоновка с "-lrt" */

source: static void * thread_start(void *arg) { printf("Subthread starting infinite loop\en"); for (;;) continue; }
ru: static void * thread_start(void *arg) { printf("Вторая нить входит в бесконечный цикл\en"); for (;;) continue; }

source: printf("Main thread sleeping\en"); sleep(1);
ru: printf("Главная нить спит\en"); sleep(1);

source: printf("Main thread consuming some CPU time...\en"); for (j = 0; j E<lt> 2000000; j++) getppid();
ru: printf("Главная нить использует немного времени ЦП…\en"); for (j = 0; j E<lt> 2000000; j++) getppid();

source: pclock("Process total CPU time: ", CLOCK_PROCESS_CPUTIME_ID);
ru: pclock("Общее время ЦП для процесса: ", CLOCK_PROCESS_CPUTIME_ID);

source: s = pthread_getcpuclockid(pthread_self(), &cid); if (s != 0) handle_error_en(s, "pthread_getcpuclockid"); pclock("Main thread CPU time: ", cid);
ru: s = pthread_getcpuclockid(pthread_self(), &cid); if (s != 0) handle_error_en(s, "pthread_getcpuclockid"); pclock("Время ЦП для главной нити: ", cid);

source: /* The preceding 4 lines of code could have been replaced by: pclock("Main thread CPU time: ", CLOCK_THREAD_CPUTIME_ID); */
ru: /* предыдущие 4 строки можно заменить на: pclock("Время ЦП для главной нити:", CLOCK_THREAD_CPUTIME_ID); */

source: s = pthread_getcpuclockid(thread, &cid); if (s != 0) handle_error_en(s, "pthread_getcpuclockid"); pclock("Subthread CPU time: 1 ", cid);
ru: s = pthread_getcpuclockid(thread, &cid); if (s != 0) handle_error_en(s, "pthread_getcpuclockid"); pclock("Время ЦП для второй нити: ", cid);

source: exit(EXIT_SUCCESS); /* Terminates both threads */ }
ru: exit(EXIT_SUCCESS); /* завершаем обе нити */ }

source: pthread_setcancelstate, pthread_setcanceltype - set cancelability state and type
ru: pthread_setcancelstate, pthread_setcanceltype - изменяет состояния и тип отменяемости

source: The B<pthread_setcancelstate>() sets the cancelability state of the calling thread to the value given in I<state>. The previous cancelability state of the thread is returned in the buffer pointed to by I<oldstate>. The I<state> argument must have one of the following values:
ru: Функция B<pthread_setcancelstate>() изменяет состояние отменяемости вызывающий нити на значение I<state>. Предыдущее состояние отменяемости нити возвращается в буфер, на который указывает I<oldstate>. Аргументом I<state> должно быть одно из следующих значений:

source: The thread is cancelable. This is the default cancelability state in all new threads, including the initial thread. The thread's cancelability type determines when a cancelable thread will respond to a cancellation request.
ru: Нить является отменяемой. Для всех новых нитей, включая начальную, это состояние является основным по умолчанию. Тип отменяемости нити определяет, когда нить будет отвечать на запрос об отмене.

source: The thread is not cancelable. If a cancellation request is received, it is blocked until cancelability is enabled.
ru: Нить является неотменяемой. Если был получен запрос об отмене, он будет блокироваться до тех пор, пока не будет включена отменяемость.
