Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The B<dprintf>() and B<vdprintf>() functions were originally GNU extensions that were later standardized in POSIX.1-2008.
ru: Функции B<dprintf>() и B<vdprintf>() изначально являлись расширениями GNU, но позже были стандартизованы в POSIX.1-2008.

source: Concerning the return value of B<snprintf>(), SUSv2 and C99 contradict each other: when B<snprintf>() is called with I<size>=0 then SUSv2 stipulates an unspecified return value less than 1, while C99 allows I<str> to be NULL in this case, and gives the return value (as always) as the number of characters that would have been written in case the output string has been large enough. POSIX.1-2001 and later align their specification of B<snprintf>() with C99.
ru: Что касается возвращаемого значения B<snprintf>(), то стандарты SUSv2 и C99 противоречат друг другу: когда B<snprintf>() вызывается с I<size>=0, то SUSv2 предусматривает возврат неопределённого значения меньше единицы, а C99 устанавливает в этом случае I<str> равным NULL и возвращает значение (как обычно) в виде количества символов, достаточного для выходной строки. В POSIX.1-2001 и новее поведение B<snprintf>() совпадает с C99.

source: glibc 2.1 adds length modifiers B<hh>, B<j>, B<t>, and B<z> and conversion characters B<a> and B<A>.
ru: В glibc 2.1 добавлены модификаторы длины B<hh>, B<j>, B<t> и B<z> и символы преобразования B<a> и B<A>.

source: glibc 2.2 adds the conversion character B<F> with C99 semantics, and the flag character B<I>.
ru: В glibc 2.2 добавлен символ преобразования B<F> с семантикой C99, а также флаг B<I>.

source: Some programs imprudently rely on code such as the following
ru: В некоторых программах неосмотрительно используется код

source: to append text to I<buf>. However, the standards explicitly note that the results are undefined if source and destination buffers overlap when calling B<sprintf>(), B<snprintf>(), B<vsprintf>(), and B<vsnprintf>(). Depending on the version of B<gcc>(1) used, and the compiler options employed, calls such as the above will B<not> produce the expected results.
ru: для добавления текста в I<buf>. Однако в стандартах явно сказано, что результат не определён, если буферы источника и приёмника перекрываются при вызовах B<sprintf>(), B<snprintf>(), B<vsprintf>() и B<vsnprintf>(). В зависимости о версии B<gcc>(1) и указанных параметрах компилятора, подобные вызовы B<не> приводят к ожидаемым результатам.

source: The glibc implementation of the functions B<snprintf>() and B<vsnprintf>() conforms to the C99 standard, that is, behaves as described above, since glibc version 2.1. Until glibc 2.0.6, they would return -1 when the output was truncated.
ru: Реализация функций B<snprintf>() и B<vsnprintf>() в glibc 2.1 соответствует стандарту C99 как было описано выше. До glibc 2.0.6, они возвращали -1 при обрезанном выводе.

source: Because B<sprintf>() and B<vsprintf>() assume an arbitrarily long string, callers must be careful not to overflow the actual space; this is often impossible to assure. Note that the length of the strings produced is locale-dependent and difficult to predict. Use B<snprintf>() and B<vsnprintf>() instead (or B<asprintf>(3) and B<vasprintf>(3)).
ru: Так как B<sprintf>() и B<vsprintf>() работают со строкой произвольной длины, вызывающие должны стараться не переполнить реальное пространство; часто это невозможно гарантировать. Заметим, что длина получаемых строк зависит от локали и её сложно предсказать. Вместо них используйте B<snprintf>() и B<vsnprintf>() (или B<asprintf>(3) и B<vasprintf>(3)).

source: Code such as B<printf(>I<foo>B<);> often indicates a bug, since I<foo> may contain a % character. If I<foo> comes from untrusted user input, it may contain B<%n>, causing the B<printf>() call to write to memory and creating a security hole.
ru: Код, подобный B<printf(>I<foo>B<);> часто означает ошибку, так как I<foo> может содержать символ %. Если содержимое I<foo> пришло из недоверительного пользовательского ввода, то в нём может содержаться B<%n>, из-за чего вызов B<printf>() сделать запись в память и создаст дыру в безопасности.

source: To print I<Pi> to five decimal places:
ru: Печать I<Pi> с пятью знаками:

source: To print a date and time in the form "Sunday, July 3, 10:02", where I<weekday> and I<month> are pointers to strings:
ru: Печать даты и времени в виде «Sunday, July 3, 10:02», где I<weekday> и I<month> указатели на строки:

source: Many countries use the day-month-year order. Hence, an internationalized version must be able to print the arguments in an order specified by the format:
ru: Во многих странах используется порядок день-месяц-год. Вот печать аргументов в формате с учётом интернациональности:

source: where I<format> depends on locale, and may permute the arguments. With the value:
ru: где I<format> зависит от локали и может переставлять аргументы. Со значением:

source: one might obtain "Sonntag, 3. Juli, 10:02".
ru: получается «Sonntag, 3. Juli, 10:02».

source: To allocate a sufficiently large string and print into it (code correct for both glibc 2.0 and glibc 2.1):
ru: Выделение достаточно большой строки и печать в неё (код работает и с glibc 2.0, и с glibc 2.1):

source: /* Determine required size */
ru: /* определим требуемый размер */

source: size++; /* For '\e0' */ p = malloc(size); if (p == NULL) return NULL;
ru: size++; /* для '\e0' */ p = malloc(size); if (p == NULL) return NULL;

source: If truncation occurs in glibc versions prior to 2.0.6, this is treated as an error instead of being handled gracefully.
ru: Если происходит обрезание в версиях glibc до 2.0.6, то это считается ошибкой.

source: fputc, fputs, putc, putchar, puts - output of characters and strings
ru: fputc, fputs, putc, putchar, puts - вывод символов и строк

source: B<fputc>() writes the character I<c>, cast to an I<unsigned char>, to I<stream>.
ru: Функция B<fputc>() записывает символ I<c>, преобразуя его в I<unsigned char>, в I<stream>.

source: B<fputs>() writes the string I<s> to I<stream>, without its terminating null byte (\(aq\e0\(aq).
ru: Функция B<fputs>() записывает строку I<s> в I<stream> без добавления нулевого байта (\(aq\e0\(aq).

source: B<putc>() is equivalent to B<fputc>() except that it may be implemented as a macro which evaluates I<stream> more than once.
ru: Функция B<putc>() является эквивалентом B<fputc>() за исключением того, что она может быть реализована в качестве макрокоманды, которая проверяет I<stream> более одного раза.

source: B<putchar(>I<c>B<)> is equivalent to B<putc(>I<c>B<, >I<stdout>B<)>.
ru: Вызов B<putchar(>I<c>B<)> является эквивалентом B<putc(>I<c>B<, >I<stdout>B<)>.

source: B<puts>() writes the string I<s> and a trailing newline to I<stdout>.
ru: Функция B<puts>() записывает строку I<s> и завершающую новую строку в I<stdout>.

source: Calls to the functions described here can be mixed with each other and with calls to other output functions from the I<stdio> library for the same output stream.
ru: Вызовы описанных здесь функций могут быть смешаны между собой и вызовами других функций вывода из библиотеки I<stdio> в пределах одного и того же потока вывода.

source: For nonlocking counterparts, see B<unlocked_stdio>(3).
ru: Для неблокирующих аналогов, см. B<unlocked_stdio>(3).

source: B<fputc>(), B<putc>() and B<putchar>() return the character written as an I<unsigned char> cast to an I<int> or B<EOF> on error.
ru: Функции B<fputc>(), B<putc>() and B<putchar>() возвращают записанный символ, преобразованный из I<unsigned char> в I<int> или B<EOF> в случае ошибки.

source: B<puts>() and B<fputs>() return a nonnegative number on success, or B<EOF> on error.
ru: Функции B<puts>() и B<fputs>() возвращают неотрицательное число в случае успеха или B<EOF> в случае ошибки.

source: It is not advisable to mix calls to output functions from the I<stdio> library with low-level calls to B<write>(2) for the file descriptor associated with the same output stream; the results will be undefined and very probably not what you want.
ru: Не рекомендуется смешивать вызовы функций вывода из библиотеки I<stdio> с вызовами B<write>(2) для файлового дескриптора, связанного с одним и тем же потоком вывода. Результаты могут быть непредсказуемыми и, очень вероятно, совсем не теми, что вы ожидали увидеть.

source: pthread_kill - send a signal to a thread
ru: pthread_kill - посылает сигнал в нить

source: The B<pthread_kill>() function sends the signal I<sig> to I<thread>, a thread in the same process as the caller. The signal is asynchronously directed to I<thread>.
ru: Функция B<pthread_kill>() посылает сигнал I<sig> в I<thread> — нить из того же процесса, что и вызвавший функцию. Сигнал доставляется I<thread> асинхронно.

source: If I<sig> is 0, then no signal is sent, but error checking is still performed.
ru: Если I<sig> равно 0, то сигнал не посылается, но выполняется проверка на ошибки.

source: On success, B<pthread_kill>() returns 0; on error, it returns an error number, and no signal is sent.
ru: При успешном выполнении B<pthread_kill>() возвращается 0; при ошибке возвращается номер ошибки и сигнал не посылается.

source: An invalid signal was specified.
ru: Указан некорректный сигнал.

source: Signal dispositions are process-wide: if a signal handler is installed, the handler will be invoked in the thread I<thread>, but if the disposition of the signal is "stop", "continue", or "terminate", this action will affect the whole process.
ru: Область действия сигнала — весь процесс: если установлен обработчик сигнала, то он будет вызван в нити I<thread>, но если этот сигнал «stop», «continue» или «terminate», то это действие повлияет на весь процесс.

source: The glibc implementation of B<pthread_kill>() gives an error (B<EINVAL>) on attempts to send either of the real-time signals used internally by the NPTL threading implementation. See B<nptl>(7) for details.
ru: Реализация B<sigaction>() в glibc выдаёт ошибку (B<EINVAL>) при попытке послать сигналы реального времени, которые используются внутри реализации NPTL. Подробности смотрите в B<nptl>(7).

source: POSIX.1-2008 recommends that if an implementation detects the use of a thread ID after the end of its lifetime, B<pthread_kill>() should return the error B<ESRCH>. The glibc implementation returns this error in the cases where an invalid thread ID can be detected. But note also that POSIX says that an attempt to use a thread ID whose lifetime has ended produces undefined behavior, and an attempt to use an invalid thread ID in a call to B<pthread_kill>() can, for example, cause a segmentation fault.
ru: В POSIX.1-2008 рекомендуется, что если реализация обнаруживает использование ID нити после её срока жизни, то B<pthread_kill>() должна возвращать ошибку B<ESRCH>. Реализация glibc возвращает эту ошибку в случае, когда обнаруживается некорректный ID нити. Но также заметим, что в POSIX говорится, что попытка использовать ID нити с завершённым сроком жизни приводит к непредсказуемому поведению, и попытка использовать некорректный ID нити в вызове B<pthread_kill>() может приводить, например, к ошибке сегментирования.

source: pthread_sigqueue - queue a signal and data to a thread
ru: pthread_sigqueue - вставляет сигнал и данные в очередь нити

source: The B<pthread_sigqueue>() function performs a similar task to B<sigqueue>(3), but, rather than sending a signal to a process, it sends a signal to a thread in the same process as the calling thread.
ru: Функция B<pthread_sigqueue>() выполняет схожу с B<sigqueue>(3) задачу, но посылает сигнал не процессу, а нити из того же процесса, что и вызвавшая функцию нить.

source: The I<thread> argument is the ID of a thread in the same process as the caller. The I<sig> argument specifies the signal to be sent. The I<value> argument specifies data to accompany the signal; see B<sigqueue>(3) for details.
ru: В аргументе I<thread> указывается ID нити в том же процессе, что и вызывающий. В аргументе I<sig> задаётся отправляемый сигнал. В аргументе I<value> указываются данные, прилагаемые к сигналу; подробности смотрите в B<sigqueue>(3).

source: On success, B<pthread_sigqueue>() returns 0; on error, it returns an error number.
ru: При успешном выполнении B<pthread_sigqueue>() возвращается 0; при ошибке возвращается номер ошибки.

source: The limit of signals which may be queued has been reached. (See B<signal>(7) for further information.)
ru: Достигнуто ограничение на количество сигналов в очереди (подробней об этом смотрите в B<signal>(7)).

source: I<sig> was invalid.
ru: Значение I<sig> некорректно.

source: B<pthread_sigqueue>() is not supported on this system.
ru: Функция B<pthread_sigqueue>() не поддерживается в этой системе.

source: I<thread> is not valid.
ru: Некорректное значение I<thread>.

source: The B<pthread_sigqueue>() function first appeared in glibc 2.11.
ru: Функция B<pthread_sigqueue>() впервые появилась в glibc 2.11.

source: The glibc implementation of B<pthread_sigqueue>() gives an error (B<EINVAL>) on attempts to send either of the real-time signals used internally by the NPTL threading implementation. See B<nptl>(7) for details.
ru: Реализация B<pthread_sigqueue>() в glibc выдаёт ошибку (B<EINVAL>) при попытке послать сигналы реального времени, которые используются внутри реализации NPTL. Подробности смотрите в B<nptl>(7).

source: pthread_tryjoin_np, pthread_timedjoin_np - try to join with a terminated thread
ru: pthread_tryjoin_np, pthread_timedjoin_np - пытается присоединиться к завершённой нити

source: These functions operate in the same way as B<pthread_join>(3), except for the differences described on this page.
ru: Эти функции работают также как B<pthread_join>(3) за исключением различий, описанных в данной справочной странице.

source: The B<pthread_tryjoin_np>() function performs a nonblocking join with the thread I<thread>, returning the exit status of the thread in I<*retval>. If I<thread> has not yet terminated, then instead of blocking, as is done by B<pthread_join>(3), the call returns an error.
ru: Функция B<pthread_tryjoin_np>() выполняет неблокирующую присоединение к нити I<thread>, возвращая в I<*retval> код выхода нити. Если I<thread> ещё не завершилась, то вместо блокировки, как это делает B<pthread_join>(3), вызов возвращает ошибку.

source: The B<pthread_timedjoin_np>() function performs a join-with-timeout. If I<thread> has not yet terminated, then the call blocks until a maximum time, specified in I<abstime>. If the timeout expires before I<thread> terminates, the call returns an error. The I<abstime> argument is a structure of the following form, specifying an absolute time measured since the Epoch (see B<time>(2)):
ru: Функция B<pthread_timedjoin_np>() выполняет присоединение-с-ожиданием. Если I<thread> ещё не завершилась, то вызов блокируется на максимальное время, заданное в I<abstime>. Если время истекло до завершения I<thread>, то вызов возвращает ошибку. Аргумент I<abstime> представляет собой структуру представления абсолютного времени, измеряемого с начала Эпохи (смотрите B<time>(2)):

source: struct timespec { time_t tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
ru: struct timespec { time_t tv_sec; /* секунды */ long tv_nsec; /* наносекунды */ };

source: On success, these functions return 0; on error, they return an error number.
ru: При успешном выполнении эти функции возвращают 0; при ошибке возвращается номер ошибки.

source: These functions can fail with the same errors as B<pthread_join>(3). B<pthread_tryjoin_np>() can in addition fail with the following error:
ru: Эти функции могут завершиться с теми же ошибками что и B<pthread_join>(3). Дополнительно, функция B<pthread_tryjoin_np>() может завершиться со следующей ошибкой:

source: I<thread> had not yet terminated at the time of the call.
ru: Нить I<thread> не завершилась на момент вызова.

source: B<pthread_timedjoin_np>() can in addition fail with the following errors:
ru: Дополнительно, функция B<pthread_timedjoin_np>() может завершиться со следующими ошибками:

source: The call timed out before I<thread> terminated.
ru: Истёк период ожидания раньше завершения I<thread>.

source: I<abstime> value is invalid (I<tv_sec> is less than 0 or I<tv_nsec> is greater than 1e9).
ru: Некорректное значение I<abstime> (I<tv_sec> меньше 0 или I<tv_nsec> больше 1e9).

source: B<pthread_timedjoin_np>() never returns the error B<EINTR>.
ru: Функция B<pthread_timedjoin_np>() никогда не возвращает ошибку B<EINTR>.

source: These functions first appeared in glibc in version 2.3.3.
ru: Эти функции впервые появились в glibc 2.3.3.

source: The following code waits to join for up to 5 seconds:
ru: Следующий код ждёт присоединения к нити не более 5 секунд:

source: if (clock_gettime(CLOCK_REALTIME, &ts) == -1) { /* Handle error */ }
ru: if (clock_gettime(CLOCK_REALTIME, &ts) == -1) { /* обработка ошибки */ }

source: s = pthread_timedjoin_np(thread, NULL, &ts); if (s != 0) { /* Handle error */ }
ru: s = pthread_timedjoin_np(thread, NULL, &ts); if (s != 0) { /* обработка ошибки */ }

source: pthread_attr_setschedpolicy, pthread_attr_getschedpolicy - set/get scheduling policy attribute in thread attributes object
ru: pthread_attr_setschedpolicy, pthread_attr_getschedpolicy - изменяет/возвращает атрибут политики планирования из объекта атрибутов нити

source: The B<pthread_attr_setschedpolicy>() function sets the scheduling policy attribute of the thread attributes object referred to by I<attr> to the value specified in I<policy>. This attribute determines the scheduling policy of a thread created using the thread attributes object I<attr>.
ru: Функция B<pthread_attr_setschedpolicy>() изменяет атрибут политики планирования в объекте атрибутов нити, на который указывает I<attr>, в значение I<policy>. Данным атрибутом определяется политика планирования у нити, созданной с учётом объекта атрибутов нити I<attr>.

source: The supported values for I<policy> are B<SCHED_FIFO>, B<SCHED_RR>, and B<SCHED_OTHER>, with the semantics described in B<sched>(7).
ru: Поддерживаемые значения I<policy>: B<SCHED_FIFO>, B<SCHED_RR> и B<SCHED_OTHER>, с семантикой, описанной в B<sched>(7).

source: The B<pthread_attr_getschedpolicy>() returns the scheduling policy attribute of the thread attributes object I<attr> in the buffer pointed to by I<policy>.
ru: Функция B<pthread_attr_getschedpolicy>() возвращает атрибут планирования нити у объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<policy>.

source: In order for the policy setting made by B<pthread_attr_setschedpolicy>() to have effect when calling B<pthread_create>(3), the caller must use B<pthread_attr_setinheritsched>(3) to set the inherit-scheduler attribute of the attributes object I<attr> to B<PTHREAD_EXPLICIT_SCHED>.
ru: Для учёта значения политики, заданной B<pthread_attr_setschedpolicy>(), при вызове B<pthread_create>(3), вызывающий должен использовать B<pthread_attr_setinheritsched>(3) для присвоения атрибуту inherit-scheduler объекта атрибутов I<attr> значения B<PTHREAD_EXPLICIT_SCHED>.

source: B<pthread_attr_setschedpolicy>() can fail with the following error:
ru: Функция B<pthread_attr_setschedpolicy>() может завершиться со следующей ошибкой:

source: Invalid value in I<policy>.
ru: Некорректное значение I<policy>.

source: POSIX.1 also documents an optional B<ENOTSUP> error ("attempt was made to set the attribute to an unsupported value") for B<pthread_attr_setschedpolicy>().
ru: Для B<pthread_attr_setschedpolicy>() в POSIX.1 также описана необязательная ошибка B<ENOTSUP> («попытка изменить атрибут на не поддерживаемое значение»).

source: pthread_attr_setguardsize, pthread_attr_getguardsize - set/get guard size attribute in thread attributes object
ru: pthread_attr_setguardsize, pthread_attr_getguardsize - изменяет/возвращает атрибут размера защиты у объекта атрибутов нити

source: The B<pthread_attr_setguardsize>() function sets the guard size attribute of the thread attributes object referred to by I<attr> to the value specified in I<guardsize>.
ru: Функция B<pthread_attr_setguardsize>() изменяет атрибут размера защиты у объекта атрибутов нити, на который указывает I<attr>, в значение I<guardsize>.

source: If I<guardsize> is greater than 0, then for each new thread created using I<attr> the system allocates an additional region of at least I<guardsize> bytes at the end of the thread's stack to act as the guard area for the stack (but see BUGS).
ru: Если I<guardsize> больше 0, то для каждой новой нити, созданной с использованием атрибута I<attr>, система выделяет дополнительную область не менее I<guardsize> байт в конце стека нити, которая служит как защитная область стека (но смотрите ДЕФЕКТЫ).

source: If I<guardsize> is 0, then new threads created with I<attr> will not have a guard area.
ru: Если I<guardsize> равно 0, то новые нити, создаваемые с использованием I<attr>, не будут иметь защитной области.

source: The default guard size is the same as the system page size.
ru: Размер защиты по умолчанию совпадает с размером системной страницы.

source: If the stack address attribute has been set in I<attr> (using B<pthread_attr_setstack>(3) or B<pthread_attr_setstackaddr>(3)), meaning that the caller is allocating the thread's stack, then the guard size attribute is ignored (i.e., no guard area is created by the system): it is the application's responsibility to handle stack overflow (perhaps by using B<mprotect>(2) to manually define a guard area at the end of the stack that it has allocated).
ru: Если в I<attr> установлен атрибут адреса стека (с помощью B<pthread_attr_setstack>(3) или B<pthread_attr_setstackaddr>(3)), означающий, что вызывающий выделяет стек для нити, то атрибут размера защиты игнорируется (т. е., система не создаёт защитную область): само приложение должно обрабатывать переполнение стека (возможно, с помощью B<mprotect>(2), для задания защитной области в конце выделенного стека).

source: The B<pthread_attr_getguardsize>() function returns the guard size attribute of the thread attributes object referred to by I<attr> in the buffer pointed to by I<guardsize>.
ru: Функция B<pthread_attr_getguardsize>() возвращает атрибут размера защиты у объекта атрибутов нити, на который указывает I<attr>, в буфер на который указывает I<guardsize>.

source: POSIX.1 documents an B<EINVAL> error if I<attr> or I<guardsize> is invalid. On Linux these functions always succeed (but portable and future-proof applications should nevertheless handle a possible error return).
ru: В POSIX.1 описана ошибка B<EINVAL> при некорректном значении I<attr> или I<guardsize>. В Linux эти функции всегда выполняются успешно (тем не менее, в переносимых приложениях нужно учитывать возможность возврата ошибки).

source: A guard area consists of virtual memory pages that are protected to prevent read and write access. If a thread overflows its stack into the guard area, then, on most hard architectures, it receives a B<SIGSEGV> signal, thus notifying it of the overflow. Guard areas start on page boundaries, and the guard size is internally rounded up to the system page size when creating a thread. (Nevertheless, B<pthread_attr_getguardsize>() returns the guard size that was set by B<pthread_attr_setguardsize>().)
ru: Защитная область состоит из страниц виртуальной памяти, которые защищены от чтения и записи. Если нить переполнит свой стек и попадёт в защитную область, то на большинстве аппаратных архитектур она получит сигнал B<SIGSEGV> и таким образом узнает о переполнении. Защитные области начинаются на границах страниц, а размер защиты внутри округляется до размера системной страницы при создании нити (тем не менее, функция B<pthread_attr_getguardsize>() возвращает размер защиты, установленный B<pthread_attr_setguardsize>()).
