Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: This is the program to run at login (if empty, use I</bin/sh>). If set to a nonexistent executable, the user will be unable to login through B<login>(1). The value in this field is used to set the B<SHELL> environment variable.
ru: Это программа, которая запускается после входа в систему (если это поле пустое, то используется I</bin/sh>). Если в поле указан несуществующий исполняемый файл, то пользователь не сможет войти в систему с помощью B<login>(1). Значение данного поля используется для настройки переменной окружения B<SHELL>.

source: If you want to create user groups, there must be an entry in I</etc/group>, or no group will exist.
ru: Если вы хотите создать группу пользователя, то такая группа должна существовать в файле I</etc/group>, иначе группа не будет существовать.

source: If the encrypted password is set to an asterisk (*), the user will be unable to login using B<login>(1), but may still login using B<rlogin>(1), run existing processes and initiate new ones through B<rsh>(1), B<cron>(8), B<at>(1), or mail filters, etc. Trying to lock an account by simply changing the shell field yields the same result and additionally allows the use of B<su>(1).
ru: Если вместо зашифрованного пароля установлена звёздочка (*), то пользователь не сможет войти в систему, используя команду B<login>(1), но сможет войти в систему, используя B<rlogin>(1), запустить существующие процессы и инициировать новые, используя B<rsh>(1), B<cron>(8), B<at>(1) или почтовые фильтры и т.д. Попытка заблокировать учётную запись простым изменением поля shell, даст тот же результат и в дополнении разрешит использование B<su>(1).

source: pthread_detach - detach a thread
ru: pthread_detach - отсоединяет нить

source: Compile and link with I<-pthread>.
ru: Компилируется и компонуется вместе с I<-pthread>.

source: The B<pthread_detach>() function marks the thread identified by I<thread> as detached. When a detached thread terminates, its resources are automatically released back to the system without the need for another thread to join with the terminated thread.
ru: Функция B<pthread_detach>() помечает нить, указанную I<thread>, как отсоединённую. Когда отсоединённая нить завершается, её ресурсы автоматически отдаются обратно системе и не нужно объединять другую нить с завершившей работу.

source: Attempting to detach an already detached thread results in unspecified behavior.
ru: Попытка отсоединить уже отсоединённую нить приводит к непредсказуемым последствиям.

source: On success, B<pthread_detach>() returns 0; on error, it returns an error number.
ru: При успешном выполнении B<pthread_detach>() возвращается 0; при ошибке возвращается номер ошибки.

source: I<thread> is not a joinable thread.
ru: Нить I<thread> не является присоединяемой.

source: No thread with the ID I<thread> could be found.
ru: Нить с идентификатором I<thread> не найдена.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: Once a thread has been detached, it can't be joined with B<pthread_join>(3) or be made joinable again.
ru: После отсоединения нить её нельзя обратно присоединить с помощью B<pthread_join>(3) или снова сделать присоединяемой.

source: A new thread can be created in a detached state using B<pthread_attr_setdetachstate>(3) to set the detached attribute of the I<attr> argument of B<pthread_create>(3).
ru: Новую нить можно создать в отсоединённом состоянии с помощью B<pthread_attr_setdetachstate>(3), установив атрибут отсоединения у аргумента I<attr> при B<pthread_create>(3).

source: The detached attribute merely determines the behavior of the system when the thread terminates; it does not prevent the thread from being terminated if the process terminates using B<exit>(3) (or equivalently, if the main thread returns).
ru: Атрибут отсоединения просто определяет поведение системы при завершении нити; он не препятствует завершению нити при завершении работы процесс с помощью B<exit>(3) (или эквивалента, если завершается основная нить).

source: Either B<pthread_join>(3) or B<pthread_detach>() should be called for each thread that an application creates, so that system resources for the thread can be released. (But note that the resources of any threads for which one of these actions has not been done will be freed when the process terminates.)
ru: Функция B<pthread_join>(3) или B<pthread_detach>() должна вызываться для каждой нити, созданной приложением, для того, чтобы можно было освободить системные ресурсы нити (но, заметим, что ресурсы всех нитей, для которых выполняется одно из этих действий, освобождаются при завершении процесса).

source: The following statement detaches the calling thread:
ru: Следующее выражение отсоединяет вызвавшую нить:

source: pthread_spin_lock, pthread_spin_trylock, pthread_spin_unlock - lock and unlock a spin lock
ru: pthread_spin_lock, pthread_spin_trylock, pthread_spin_unlock - блокирует и разблокирует блокировку циклически (spin lock)

source: The B<pthread_spin_lock>() function locks the spin lock referred to by I<lock>. If the spin lock is currently unlocked, the calling thread acquires the lock immediately. If the spin lock is currently locked by another thread, the calling thread spins, testing the lock until it becomes available, at which point the calling thread acquires the lock.
ru: Функция B<pthread_spin_lock>() блокирует циклическую блокировку (spin lock), на которую указывает I<lock>. Если циклическая блокировка разблокирована, то вызывающая нить сразу же захватывает блокировку. Если циклическая блокировка заблокирована, то проверка блокировки продолжается до тех пор, пока она не освободится, и в этот момент вызывающая нить захватит блокировку.

source: Calling B<pthread_spin_lock>() on a lock that is already held by the caller or a lock that has not been initialized with B<pthread_spin_init>(3) results in undefined behavior.
ru: Вызов B<pthread_spin_lock>() для блокировки, которая уже захвачена вызывающим или не была инициализирована с помощью B<pthread_spin_init>(3), приводит к непредсказуемому поведению.

source: The B<pthread_spin_trylock>() function is like B<pthread_spin_lock>(), except that if the spin lock referred to by I<lock> is currently locked, then, instead of spinning, the call returns immediately with the error B<EBUSY>.
ru: Функция B<pthread_spin_trylock>() подобна B<pthread_spin_lock>(), за исключением того, что если циклическая блокировка, на которую указывает I<lock> заблокирована, то вместо зацикливания вызов завершается с ошибкой B<EBUSY>.

source: The B<pthread_spin_unlock>() function unlocks the spin lock referred to I<lock>. If any threads are spinning on the lock, one of those threads will then acquire the lock.
ru: Функция B<pthread_spin_unlock>() разблокирует циклическую блокировку, на которую указывает I<lock>. Если какая-то нить зациклена в ожидании блокировки, то она захватит блокировку.

source: Calling B<pthread_spin_unlock>() on a lock that is not held by the caller results in undefined behavior.
ru: Вызов B<pthread_spin_unlock>() для блокировки, которая не была захвачена вызывающим, приводит к непредсказуемому поведению.

source: On success, these functions return zero. On failure, they return an error number.
ru: При успешном выполнении эти функции возвращают ноль. При ошибке возвращается номер ошибки.

source: B<pthread_spin_lock>() may fail with the following errors:
ru: Функция B<pthread_spin_lock>() может завершаться со следующими ошибками:

source: The system detected a deadlock condition.
ru: Система обнаружила условие взаимной блокировки.

source: B<pthread_spin_trylock>() fails with the following errors:
ru: Функция B<pthread_spin_trylock>() может завершаться со следующими ошибками:

source: The spin lock is currently locked by another thread.
ru: Циклическая блокировка уже заблокирована другой нитью.

source: These functions first appeared in glibc in version 2.2.
ru: Эти функции впервые появились в glibc 2.2.

source: Applying any of the functions described on this page to an uninitialized spin lock results in undefined behavior.
ru: Применение любой из описанных в этой странице функций к не инициализированной циклической блокировке приведёт к непредсказуемому поведению.

source: Carefully read NOTES in B<pthread_spin_init>(3).
ru: Внимательно прочитайте ЗАМЕЧАНИЯ в B<pthread_spin_init>(3).

source: pthread_mutexattr_getrobust, pthread_mutexattr_setrobust - get and set the robustness attribute of a mutex attributes object
ru: pthread_mutexattr_getrobust, pthread_mutexattr_setrobust - возвращает и изменяет атрибут устойчивости в объекте мьютексных атрибутов

source: The B<pthread_mutexattr_getrobust>() function places the value of the robustness attribute of the mutex attributes object referred to by I<attr> in I<*robustness>. The B<pthread_mutexattr_setrobust>() function sets the value of the robustness attribute of the mutex attributes object referred to by I<attr> to the value specified in I<*robustness>.
ru: Функция B<pthread_mutexattr_getrobust>() помещает значение атрибута устойчивости (robustness) из объекта мьютексных атрибутов, на который указывает I<attr>, в I<*robustness>. Функция B<pthread_mutexattr_setrobust>() изменяет значение атрибута устойчивости в объекте мьютексных атрибутов, на который указывает I<attr>, на значение, заданное в I<*robustness>.

source: The robustness attribute specifies the behavior of the mutex when the owning thread dies without unlocking the mutex. The following values are valid for I<robustness>:
ru: Атрибут устойчивости определяет поведение мьютекса после того как владеющая нить завершает работу, но не разблокировала мьютекс. Для I<robustness> возможны следующие значения:

source: This is the default value for a mutex attributes object. If a mutex is initialized with the B<PTHREAD_MUTEX_STALLED> attribute and its owner dies without unlocking it, the mutex remains locked afterwards and any future attempts to call B<pthread_mutex_lock>(3) on the mutex will block indefinitely.
ru: Значение по умолчанию для объекта мьютексных атрибутов. Если мьютекс инициализирован с атрибутом B<PTHREAD_MUTEX_STALLED> и его владелец завершает работу без его разблокировки, то после этого мьютекс остаётся заблокированным и все последующие попытки вызова B<pthread_mutex_lock>(3) для этого мьютекса будут заблокированы навсегда.

source: If a mutex is initialized with the B<PTHREAD_MUTEX_ROBUST> attribute and its owner dies without unlocking it, any future attempts to call B<pthread_mutex_lock>(3) on this mutex will succeed and return B<EOWNERDEAD> to indicate that the original owner no longer exists and the mutex is in an inconsistent state. Usually after B<EOWNERDEAD> is returned, the next owner should call B<pthread_mutex_consistent>(3) on the acquired mutex to make it consistent again before using it any further.
ru: Если мьютекса инициализирован с атрибутом B<PTHREAD_MUTEX_ROBUST> и и его владелец завершает работу без его разблокировки,то все последующие попытки вызова B<pthread_mutex_lock>(3) для этого мьютекса будут успешно выполнены возвращается B<EOWNERDEAD>, чтобы показать, что первоначальный владелец не существует и мьютекс находится в неопределенном состоянии. Обычно, после возврата B<EOWNERDEAD> перед началом использования следующий владелец должен вызвать B<pthread_mutex_consistent>(3) над полученным мьютексом, чтобы снова сделать его согласованным.

source: If the next owner unlocks the mutex using B<pthread_mutex_unlock>(3) before making it consistent, the mutex will be permanently unusable and any subsequent attempts to lock it using B<pthread_mutex_lock>(3) will fail with the error B<ENOTRECOVERABLE>. The only permitted operation on such a mutex is B<pthread_mutex_destroy>(3).
ru: Если следующий владелец разблокирует мьютекс с помощью B<pthread_mutex_unlock>(3) до того, как сделать его согласованным, мьютекс станет необратимо неработоспособен и последующие попытки заблокировать его с помощью B<pthread_mutex_lock>(3) будут завершаться ошибкой B<ENOTRECOVERABLE>. Для такого мьютекса доступна только одна операция — B<pthread_mutex_destroy>(3).

source: If the next owner terminates before calling B<pthread_mutex_consistent>(3), further B<pthread_mutex_lock>(3) operations on this mutex will still return B<EOWNERDEAD>.
ru: Если следующий владелец завершит работу до вызова B<pthread_mutex_consistent>(3), то последующие операций B<pthread_mutex_lock>(3) с этим мьютексом будут по прежнему возвращать B<EOWNERDEAD>.

source: Note that the I<attr> argument of B<pthread_mutexattr_getrobust>() and B<pthread_mutexattr_setrobust>() should refer to a mutex attributes object that was initialized by B<pthread_mutexattr_init>(3), otherwise the behavior is undefined.
ru: Заметим, что аргумент I<attr> у B<pthread_mutexattr_getrobust>() и B<pthread_mutexattr_setrobust>() должен указывать на объект мьютексных атрибутов, который был инициализирован B<pthread_mutexattr_init>(3), в противном случае поведение не определено.

source: On success, these functions return 0. On error, they return a positive error number.
ru: При успешном выполнении эти функции возвращают 0. При ошибке возвращается положительный номер ошибки.

source: In the glibc implementation, B<pthread_mutexattr_getrobust>() always return zero.
ru: В реализации glibc функция B<pthread_mutexattr_getrobust>() всегда возвращает ноль.

source: A value other than B<PTHREAD_MUTEX_STALLED> or B<PTHREAD_MUTEX_ROBUST> was passed to B<pthread_mutexattr_setrobust>().
ru: Помимо B<PTHREAD_MUTEX_STALLED> или B<PTHREAD_MUTEX_ROBUST> в B<pthread_mutexattr_setrobust>() передано что-то ещё.

source: B<pthread_mutexattr_getrobust>() and B<pthread_mutexattr_setrobust>() were added to glibc in version 2.12.
ru: Функции B<pthread_mutexattr_getrobust>() и B<pthread_mutexattr_setrobust>() добавлены в glibc версии 2.12.

source: In the Linux implementation, when using process-shared robust mutexes, a waiting thread also receives the B<EOWNERDEAD> notification if the owner of a robust mutex performs an B<execve>(2) without first unlocking the mutex. POSIX.1 does not specify this detail, but the same behavior also occurs in at least some other implementations.
ru: В реализации Linux при использовании общих для процессов устойчивых мьютексов ожидающая нить также получает уведомление B<EOWNERDEAD>, если владелец устойчивого мьютекса выполняет B<execve>(2) без предварительной разблокировки мьютекса. В POSIX.1 не указана данная подробность, но такое же поведение также встречается и в нескольких других реализациях.

source: Before the addition of B<pthread_mutexattr_getrobust>() and B<pthread_mutexattr_setrobust>() to POSIX, glibc defined the following equivalent nonstandard functions if B<_GNU_SOURCE> was defined:
ru: До появления B<pthread_mutexattr_getrobust>() и B<pthread_mutexattr_setrobust>() в POSIX, в glibc определись следующие эквиваленты нестандартных функций, если определён B<_GNU_SOURCE>:

source: Correspondingly, the constants B<PTHREAD_MUTEX_STALLED_NP> and B<PTHREAD_MUTEX_ROBUST_NP> were also defined.
ru: Соответственно, также определены константы B<PTHREAD_MUTEX_STALLED_NP> и B<PTHREAD_MUTEX_ROBUST_NP>.

source: These GNU-specific APIs, which first appeared in glibc 2.4, are nowadays obsolete and should not be used in new programs.
ru: Данный имеющийся только в GNU программный интерфейс, впервые появившийся в glibc 2.4, в настоящее время устарел и не должен использоваться в новых программах.

source: The program below demonstrates the use of the robustness attribute of a mutex attributes object. In this program, a thread holding the mutex dies prematurely without unlocking the mutex. The main thread subsequently acquires the mutex successfully and gets the error B<EOWNERDEAD>, after which it makes the mutex consistent.
ru: В программе, представленной далее, показывается использование атрибута устойчивости в объекте мьютексных атрибутов. В этой программе нить, удерживающая мьютекс, завершает работу без разблокировки мьютекса. После этого главная нить захватывает мьютекс и получает ошибку B<EOWNERDEAD>, после чего делает мьютекс согласованным.

source: The following shell session shows what we see when running this program:
ru: Пример сеанса работы с программой:

source: $ B<./a.out> [original owner] Setting lock... [original owner] Locked. Now exiting without unlocking. [main thread] Attempting to lock the robust mutex. [main thread] pthread_mutex_lock() returned EOWNERDEAD [main thread] Now make the mutex consistent [main thread] Mutex is now consistent; unlocking
ru: $ B<./a.out> [первый владелец] Установка блокировки… [первый владелец] Готово. Теперь выходим без разблокировки. [главная нить] Пытаемся получить заблокировать устойчивый мьютекс. [главная нить] pthread_mutex_lock() вернула EOWNERDEAD [главная нить] Теперь делаем мьютекс согласованным [главная нить] Мьютекс согласован; разблокируем

source: static void * original_owner_thread(void *ptr) { printf("[original owner] Setting lock...\en"); pthread_mutex_lock(&mtx); printf("[original owner] Locked. Now exiting without unlocking.\en"); pthread_exit(NULL); }
ru: static void * original_owner_thread(void *ptr) { printf("[первый владелец] Установка блокировки…\en"); pthread_mutex_lock(&mtx); printf("[original owner] Готово. Теперь выходим без разблокировки.\en"); pthread_exit(NULL); }

source: pthread_mutexattr_init(&attr); /* initialize the attributes object */ pthread_mutexattr_setrobust(&attr, PTHREAD_MUTEX_ROBUST); /* set robustness */
ru: pthread_mutexattr_init(&attr); /* инициализируем объект атрибутов */ pthread_mutexattr_setrobust(&attr, PTHREAD_MUTEX_ROBUST); /* задаём устойчивость */

source: pthread_mutex_init(&mtx, &attr); /* initialize the mutex */
ru: pthread_mutex_init(&mtx, &attr); /* инициализируем мьютекс */

source: /* "original_owner_thread" should have exited by now */
ru: /* «нить_первый_владелец» к этому моменту должна завершиться */

source: printf("[main thread] Attempting to lock the robust mutex.\en"); s = pthread_mutex_lock(&mtx); if (s == EOWNERDEAD) { printf("[main thread] pthread_mutex_lock() returned EOWNERDEAD\en"); printf("[main thread] Now make the mutex consistent\en"); s = pthread_mutex_consistent(&mtx); if (s != 0) handle_error_en(s, "pthread_mutex_consistent"); printf("[main thread] Mutex is now consistent; unlocking\en"); s = pthread_mutex_unlock(&mtx); if (s != 0) handle_error_en(s, "pthread_mutex_unlock");
ru: printf("[главная нить] Пытаемся получить заблокировать устойчивый мьютекс.\en"); s = pthread_mutex_lock(&mtx); if (s == EOWNERDEAD) { printf("[главная нить] pthread_mutex_lock() вернула EOWNERDEAD\en"); printf("[главная нить] Теперь делаем мьютекс согласованным\en"); s = pthread_mutex_consistent(&mtx); if (s != 0) handle_error_en(s, "pthread_mutex_consistent"); printf("[главная нить] Мьютекс согласован; разблокируем\en"); s = pthread_mutex_unlock(&mtx); if (s != 0) handle_error_en(s, "pthread_mutex_unlock");

source: exit(EXIT_SUCCESS); } else if (s == 0) { printf("[main thread] pthread_mutex_lock() unexpectedly succeeded\en"); exit(EXIT_FAILURE); } else { printf("[main thread] pthread_mutex_lock() unexpectedly failed\en"); handle_error_en(s, "pthread_mutex_lock"); } }
ru: exit(EXIT_SUCCESS); } else if (s == 0) { printf("[главная нить] pthread_mutex_lock() неожиданно завершилась успешно\en"); exit(EXIT_FAILURE); } else { printf("[главная нить] pthread_mutex_lock() завершилась с ошибкой\en"); handle_error_en(s, "pthread_mutex_lock"); } }

source: posix_fallocate - allocate file space
ru: posix_fallocate - выделяет пространство для файла

source: The function B<posix_fallocate>() ensures that disk space is allocated for the file referred to by the file descriptor I<fd> for the bytes in the range starting at I<offset> and continuing for I<len> bytes. After a successful call to B<posix_fallocate>(), subsequent writes to bytes in the specified range are guaranteed not to fail because of lack of disk space.
ru: Функция B<posix_fallocate>() гарантирует, что дисковое пространство, выделено для файла, на который указывает файловый дескриптор I<fd>, для байт в диапазоне начиная с I<offset> и длиной I<len> байт. После успешного выполнения B<posix_fallocate>() последующие операции записи в байты указанного диапазона гарантировано не закончатся ошибкой из-за нехватки места на диске.

source: If the size of the file is less than I<offset>+I<len>, then the file is increased to this size; otherwise the file size is left unchanged.
ru: Если размер файла меньше чем I<offset>+I<len>, то файл увеличится до своего размера; в противном случае размер файла останется не изменённым.

source: B<posix_fallocate>() returns zero on success, or an error number on failure. Note that I<errno> is not set.
ru: При успешном выполнении функции B<posix_fallocate>() возвращается 0, а при ошибке возвращается её номер. Заметим, что I<errno> не изменяется.

source: I<fd> is not a valid file descriptor, or is not opened for writing.
ru: I<fd> не является допустимым файловым дескриптором или не открыт на запись.

source: I<offset+len> exceeds the maximum file size.
ru: Сумма I<offset+len> превышает максимальный размер файла.

source: A signal was caught during execution.
ru: При выполнении поступил сигнал.

source: I<offset> was less than 0, or I<len> was less than or equal to 0, or the underlying filesystem does not support the operation.
ru: Значение I<offset> меньше, или I<len> меньше или равно 0, или используемая файловая система, хранящая файл, не поддерживает операцию.

source: I<fd> does not refer to a regular file.
ru: Дескриптор I<fd> не указывает на обычный файл.

source: There is not enough space left on the device containing the file referred to by I<fd>.
ru: Недостаточно дискового пространства на устройстве, на котором расположен файл, указанный в I<fd>.

source: I<fd> refers to a pipe.
ru: Значение I<fd> указывает на канал.

source: B<posix_fallocate>() is available since glibc 2.1.94.
ru: Функция B<posix_fallocate>() доступна в glibc начиная с версии 2.1.94.

source: MT-Safe (but see NOTES)
ru: MT-Safe (но смотрите ДЕФЕКТЫ)

source: POSIX.1-2008 says that an implementation I<shall> give the B<EINVAL> error if I<len> was 0, or I<offset> was less than 0. POSIX.1-2001 says that an implementation I<shall> give the B<EINVAL> error if I<len> is less than 0, or I<offset> was less than 0, and I<may> give the error if I<len> equals zero.
ru: В POSIX.1-2008 указано, что реализация I<должна> возвращать ошибку B<EINVAL>, если I<len> равно 0 или I<offset> меньше 0. В POSIX.1-2001 сказано, что реализация I<должна> возвращать ошибку B<EINVAL>, если I<len> меньше 0 или I<offset> меньше 0, и I<может> возвращать ошибку, если I<len> равно 0.

source: In the glibc implementation, B<posix_fallocate>() is implemented using the B<fallocate>(2) system call, which is MT-safe. If the underlying filesystem does not support B<fallocate>(2), then the operation is emulated with the following caveats:
ru: В glibc функция B<posix_fallocate>() реализована с помощью системного вызова B<fallocate>(2), который является нитебезопасным. Если подлежащая файловая система не поддерживает B<fallocate>(2), то операция эмулируется со следующими оговорками:

source: The emulation is inefficient.
ru: Эмуляция не считается эффективной.

source: There is a race condition where concurrent writes from another thread or process could be overwritten with null bytes.
ru: Существует состязательность, где одновременные записи из другой нити или процесса могут быть перезаписаны null байтами.
