Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: (5) Time waiting for I/O to complete. This value is not reliable, for the following reasons:
ru: (5) Время ожидания завершения операций ввода-вывода. Это значение ненадёжно по следующим причинам:

source: The CPU will not wait for I/O to complete; iowait is the time that a task is waiting for I/O to complete. When a CPU goes into idle state for outstanding task I/O, another task will be scheduled on this CPU.
ru: ЦП не будет ждать завершения ввода-вывода; iowait это время, которое задача ждёт завершения ввода-вывода. Когда ЦП переходит в состояние простоя из-за ожидания задачей ввода-вывода, на этом ЦП будет запланирована к выполнению другая задача.

source: On a multi-core CPU, the task waiting for I/O to complete is not running on any CPU, so the iowait of each CPU is difficult to calculate.
ru: На многоядерных ЦП задача, ожидающая завершения ввода-вывода, не выполняется на каком-либо ЦП, поэтому iowait каждого ЦП трудно подсчитать.

source: The value in this field may I<decrease> in certain conditions.
ru: Значение этого поля при определённых условиях может I<уменьшаться>.

source: I<irq> (since Linux 2.6.0)
ru: I<irq> (начиная с Linux 2.6.0)

source: (6) Time servicing interrupts.
ru: (6) Время обслуживания прерываний.

source: I<softirq> (since Linux 2.6.0
ru: I<softirq> (начиная с Linux 2.6.0)

source: (7) Time servicing softirqs.
ru: (7) Время обслуживания softirq.

source: I<steal> (since Linux 2.6.11)
ru: I<steal> (начиная с Linux 2.6.11)

source: (8) Stolen time, which is the time spent in other operating systems when running in a virtualized environment
ru: (8) Упущенное время — время, потраченное в других операционных системах при работе в виртуализованном окружении.

source: I<guest> (since Linux 2.6.24)
ru: I<guest> (начиная с Linux 2.6.24)

source: (9) Time spent running a virtual CPU for guest operating systems under the control of the Linux kernel.
ru: (9) Время, потраченное на работу виртуального процессора для гостевых операционных системах, управляемых ядром Linux.

source: I<guest_nice> (since Linux 2.6.33)
ru: I<guest_nice> (начиная с Linux 2.6.33)

source: (10) Time spent running a niced guest (virtual CPU for guest operating systems under the control of the Linux kernel).
ru: (10) Время, потраченное на работу гостевого niced (виртуального процессора для гостевых операционных системах, управляемых ядром Linux).

source: The number of pages the system paged in and the number that were paged out (from disk).
ru: Количество страниц, которые система загрузила с диска и выгрузила на диск.

source: The number of swap pages that have been brought in and out.
ru: Количество страниц подкачки, которые загружены и выгружены.

source: This line shows counts of interrupts serviced since boot time, for each of the possible system interrupts. The first column is the total of all interrupts serviced including unnumbered architecture specific interrupts; each subsequent column is the total for that particular numbered interrupt. Unnumbered interrupts are not shown, only summed into the total.
ru: В этой строке содержится счётчик прерываний, обработанных с момента загрузки системы, по каждому возможному системному прерыванию. В первом столбце содержится общее количество всех обработанных прерываний, включая ненумерованные, специфичные для архитектуры; в каждом последующем столбце содержится общее количество по конкретному прерыванию. Ненумерованные прерывания не показываются, выдаётся только их общее количество.

source: (major,disk_idx):(noinfo, read_io_ops, blks_read, write_io_ops, blks_written)
ru: (major,minor):(noinfo, read_io_ops, blks_read, write_io_ops, blks_written)

source: (Linux 2.4 only)
ru: (только в Linux 2.4)

source: The number of context switches that the system underwent.
ru: Количество переключений контекста, произошедших в системе.

source: boot time, in seconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
ru: Время начальной загрузки прошедшее с начала эпохи, 1970-01-01 00:00:00 +0000 (UTC), в секундах.

source: Number of forks since boot.
ru: Количество разветвлений (вызовов fork) с момента начальной загрузки.

source: Number of processes in runnable state. (Linux 2.5.45 onward.)
ru: Количество процессов в состоянии работы (Linux 2.5.45 и новее).

source: Number of processes blocked waiting for I/O to complete. (Linux 2.5.45 onward.)
ru: Количество заблокированных процессов, ожидающих завершения ввода-вывода (Linux 2.5.45 и новее).

source: This line shows the number of softirq for all CPUs. The first column is the total of all softirqs and each subsequent column is the total for particular softirq. (Linux 2.6.31 onward.)
ru: В этой строке показывается количество softirq для всех ЦП. В первой колонке содержится общее количество всех softirq, а в каждой следующей колонке содержится общее количество определённых softirq (начиная с Linux 2.6.31).

source: Swap areas in use. See also B<swapon>(8).
ru: Используемое пространство подкачки. См. также B<swapon>(8).

source: This directory (present since 1.3.57) contains a number of files and subdirectories corresponding to kernel variables. These variables can be read and sometimes modified using the I</proc> filesystem, and the (deprecated) B<sysctl>(2) system call.
ru: Этот каталог (присутствующий, начиная с версии 1.3.57) содержит несколько файлов и подкаталогов, которые соответствуют переменным ядра. Эти переменные могут быть прочитаны и иногда изменены через файловую систему I</proc>, а также с помощью (не рекомендуется) системного вызова B<sysctl>(2).

source: String values may be terminated by either \(aq\e0\(aq or \(aq\en\(aq.
ru: Строковые значения могут заканчиваться \(aq\e0\(aq или \(aq\en\(aq.

source: Integer and long values may be written either in decimal or in hexadecimal notation (e.g. 0x3FFF). When writing multiple integer or long values, these may be separated by any of the following whitespace characters: \(aq\ \(aq, \(aq\et\(aq, or \(aq\en\(aq. Using other separators leads to the error B<EINVAL>.
ru: Целые и длинные целые значения могут записываться в десятичной или шестнадцатеричной системе счисления (например, 0x3FFF). При записи нескольких значений их можно разделять любым из следующих пробельных символов: \(aq\ \(aq, \(aq\et\(aq или \(aq\en\(aq. При использовании других разделителей возникает ошибка B<EINVAL>.

source: I</proc/sys/abi> (since Linux 2.4.10)
ru: I</proc/sys/abi> (начиная с Linux 2.4.10)

source: This directory may contain files with application binary information. See the Linux kernel source file I<Documentation/sysctl/abi.txt> for more information.
ru: Этот каталог может содержать файлы информацию об исполнении приложений (application binary information). Дополнительную информацию смотрите в файле исходного кода ядра Linux I<Documentation/sysctl/abi.txt>.

source: This directory may be empty.
ru: Данный каталог может быть пуст.

source: This directory contains device-specific information (e.g., I<dev/cdrom/info>). On some systems, it may be empty.
ru: Данный каталог содержит информацию, специфичную для устройств (например, I<dev/cdrom/info>). В некоторых системах он может быть пуст.

source: This directory contains the files and subdirectories for kernel variables related to filesystems.
ru: Подкаталог, содержащий файлы и подкаталоги с переменными ядра, касающиеся файловых систем.

source: Documentation for files in this directory can be found in the Linux kernel source in the file I<Documentation/admin-guide/binfmt-misc.rst> (or in I<Documentation/binfmt_misc.txt> on older kernels).
ru: Документацию по файлам в этом каталоге можно найти в файле исходного кода ядра Linux I<Documentation/admin-guide/binfmt-misc.rst> (в старых ядрах — в I<Documentation/binfmt_misc.txt>).

source: I</proc/sys/fs/dentry-state> (since Linux 2.2)
ru: I</proc/sys/fs/dentry-state> (начиная с Linux 2.2)

source: This file contains information about the status of the directory cache (dcache). The file contains six numbers, I<nr_dentry>, I<nr_unused>, I<age_limit> (age in seconds), I<want_pages> (pages requested by system) and two dummy values.
ru: Файл содержит информацию о состоянии кэша каталогов (dcache). В нём есть шесть чисел, I<nr_dentry>, I<nr_unused>, I<age_limit> (возраст в секундах), I<want_pages> (страниц, запрошенных системой) и два пустых значения.

source: I<nr_dentry> is the number of allocated dentries (dcache entries). This field is unused in Linux 2.2.
ru: I<nr_dentry> содержит количество отведённых dentries (элементов dcache). Это поле не используется в Linux 2.2.

source: I<nr_unused> is the number of unused dentries.
ru: I<nr_unused> содержит количество неиспользуемых dentries.

source: I<age_limit> is the age in seconds after which dcache entries can be reclaimed when memory is short.
ru: I<age_limit> \(em это возраст в секундах по истечении которого элементы dcache могут быть отозваны, когда памяти становится мало.

source: I<want_pages> is nonzero when the kernel has called shrink_dcache_pages() and the dcache isn't pruned yet.
ru: I<want_pages> не равно нулю, если ядро вызвало shrink_dcache_pages(), а dcache ещё не сокращён (pruned).

source: This file can be used to disable or enable the I<dnotify> interface described in B<fcntl>(2) on a system-wide basis. A value of 0 in this file disables the interface, and a value of 1 enables it.
ru: Этот файл может быть использован для включения и выключения интерфейса I<dnotify>, описанного в B<fcntl>(2), во всей системе. Значение 0 в этом файле отключает интерфейс, а значение 1 включает его.

source: This file shows the maximum number of cached disk quota entries. On some (2.4) systems, it is not present. If the number of free cached disk quota entries is very low and you have some awesome number of simultaneous system users, you might want to raise the limit.
ru: Этот файл показывает максимальное количество кэшируемых элементов дисковых квот. В некоторых (2.4) системах его нет. Если число свободных кэшируемых дисковых квот является очень маленьким, а у вас в системе одновременно работает большое количество пользователей, то вам, возможно, захочется увеличить этот лимит.

source: This file shows the number of allocated disk quota entries and the number of free disk quota entries.
ru: Этот файл показывает количество выделенных в использование элементов дисковых квот и количество свободных элементов дисковых квот.

source: I</proc/sys/fs/epoll> (since Linux 2.6.28)
ru: I</proc/sys/fs/epoll> (начиная с Linux 2.6.28)

source: This directory contains the file I<max_user_watches>, which can be used to limit the amount of kernel memory consumed by the I<epoll> interface. For further details, see B<epoll>(7).
ru: В этом каталоге содержится файл I<max_user_watches>, который можно использовать для ограничения количества памяти ядра, потребляемой интерфейсом I<epoll>. Подробности смотрите в B<epoll>(7).

source: This file defines a system-wide limit on the number of open files for all processes. System calls that fail when encountering this limit fail with the error B<ENFILE>. (See also B<setrlimit>(2), which can be used by a process to set the per-process limit, B<RLIMIT_NOFILE>, on the number of files it may open.) If you get lots of error messages in the kernel log about running out of file handles (look for "VFS: file-max limit E<lt>numberE<gt> reached"), try increasing this value:
ru: Этот файл показывает системный лимит на количество открытых файлов для всех процессов. Системные вызовы, возвращающие ошибку при достижении этого лимита возвращают B<ENFILE> (смотрите также B<setrlimit>(2), который можно использовать, чтобы установить ограничение B<RLIMIT_NOFILE> на количество открытых файлов файлов на процесс). Если вы получаете большое количество сообщений в журнале ядра об ошибках о невозможности открыть файловые дескрипторы (такие как «VFS: file-max limit E<lt>numberE<gt> reached»), попытайтесь увеличить это значение:

source: Privileged processes (B<CAP_SYS_ADMIN>) can override the I<file-max> limit.
ru: Привилегированный процесс (с B<CAP_SYS_ADMIN>) может изменять ограничение I<file-max>.

source: This (read-only) file contains three numbers: the number of allocated file handles (i.e., the number of files presently opened); the number of free file handles; and the maximum number of file handles (i.e., the same value as I</proc/sys/fs/file-max>). If the number of allocated file handles is close to the maximum, you should consider increasing the maximum. Before Linux 2.6, the kernel allocated file handles dynamically, but it didn't free them again. Instead the free file handles were kept in a list for reallocation; the "free file handles" value indicates the size of that list. A large number of free file handles indicates that there was a past peak in the usage of open file handles. Since Linux 2.6, the kernel does deallocate freed file handles, and the "free file handles" value is always zero.
ru: Этот файл (доступный только для чтения) содержит три числа: количество выделенных файловых дескрипторов (handles), количество свободных файловых дескрипторов (handles) и максимальное количество файловых дескрипторов (handles). Ядро выделяет файловые дескрипторы динамически, но оно не освобождает их сразу же. Если количество выделенных файловых дескрипторов приближается к максимальному, то вам необходимо увеличить максимальное значение. До Linux 2.6 ядро выделяло файловые дескрипторы динамически, но не освобождало их. Вместо этого свободные файловые дескрипторы оставались в списке для повторного выделения; значение «количество свободных файловых дескрипторов» показывает размер этого списка. Большое когда количество свободных файловых дескрипторов указывает на то, что ранее был пик использования свободных файловых дескрипторов. Начиная с Linux 2.6 ядро освобождает свободные файловые дескрипторы и «количество свободных файловых дескрипторов» всегда равно 0.

source: I</proc/sys/fs/inode-max> (only present until Linux 2.2)
ru: I</proc/sys/fs/inode-max> (только до Linux 2.2)

source: This file contains the maximum number of in-memory inodes. This value should be 3\(en4 times larger than the value in I<file-max>, since I<stdin>, I<stdout> and network sockets also need an inode to handle them. When you regularly run out of inodes, you need to increase this value.
ru: Этот файл содержит максимальное количество индексных дескрипторов, находящихся в памяти. Это значение должно быть в 3\(en4 раза больше, чем максимальное значение в I<file-max>, так как I<stdin>, I<stdout> и сетевым сокетам также необходимы индексные дескрипторы. Если вам регулярно не хватает индексных дескрипторов, то вам необходимо увеличить это значение.

source: Starting with Linux 2.4, there is no longer a static limit on the number of inodes, and this file is removed.
ru: Начиная с Linux 2.4, больше не существует статического ограничения на количество индексных дескрипторов и этот файл удалён.

source: This file contains the first two values from I<inode-state>.
ru: Этот файл содержит первые два значения из I<inode-state>.

source: This file contains seven numbers: I<nr_inodes>, I<nr_free_inodes>, I<preshrink>, and four dummy values (always zero).
ru: Этот файл содержит сем чисел: I<nr_inodes>, I<nr_free_inodes>, I<preshrink> и четыре заглушки (всегда равные нулю).

source: I<nr_inodes> is the number of inodes the system has allocated. I<nr_free_inodes> represents the number of free inodes.
ru: В I<nr_inodes> содержится количество выделенных системой индексных дескрипторов. В I<nr_free_inodes> содержится количество свободных индексных дескрипторов.

source: I<preshrink> is nonzero when the I<nr_inodes> E<gt> I<inode-max> and the system needs to prune the inode list instead of allocating more; since Linux 2.4, this field is a dummy value (always zero).
ru: Значение I<preshrink> не равно нулю, если I<nr_inodes> E<gt> I<inode-max> и системе нужно сократить список индексных дескрипторов, а не выделять новые; начиная с Linux 2.4 это значение не используется (всегда равно нулю).

source: I</proc/sys/fs/inotify> (since Linux 2.6.13)
ru: I</proc/sys/fs/inotify> (начиная с Linux 2.6.13)

source: This directory contains files I<max_queued_events>, I<max_user_instances>, and I<max_user_watches>, that can be used to limit the amount of kernel memory consumed by the I<inotify> interface. For further details, see B<inotify>(7).
ru: Этот каталог содержит файлы I<max_queued_events>, I<max_user_instances>, и I<max_user_watches>, которые можно использовать для ограничения количества памяти ядра, потребляемом интерфейсом I<inotify>. Подробней смотрите в B<inotify>(7).

source: This file specifies the grace period that the kernel grants to a process holding a file lease (B<fcntl>(2)) after it has sent a signal to that process notifying it that another process is waiting to open the file. If the lease holder does not remove or downgrade the lease within this grace period, the kernel forcibly breaks the lease.
ru: В этом файле задаётся период, в течении которого, ядро предоставляет процессу возможность удерживать файл (B<fcntl>(2)), по окончании которого оно посылает сигнал процессу, извещая его о том, что другой процесс ожидает открытия этого файла. Если удерживающий файл процесс не удалит или не отменит удержание файла в течении указанного периода, то ядро принудительно снимет удержание.

source: This file can be used to enable or disable file leases (B<fcntl>(2)) on a system-wide basis. If this file contains the value 0, leases are disabled. A nonzero value enables leases.
ru: Этот файл можно использовать, чтобы разрешить или запретить в системе возможность удержания файла (B<fcntl>(2)). Если файл содержит 0, удержание запрещено. Если не ноль \(em разрешено.

source: I</proc/sys/fs/mount-max> (since Linux 4.9)
ru: I</proc/sys/fs/mount-max> (начиная с Linux 4.9)

source: The value in this file specifies the maximum number of mounts that may exist in a mount namespace. The default value in this file is 100,000.
ru: Значение в этом файле задаёт максимальное количество монтирований, которые могут существовать в пространстве имён монтирования. Значения файла по умолчанию равно 100000.

source: I</proc/sys/fs/mqueue> (since Linux 2.6.6)
ru: I</proc/sys/fs/mqueue> (начиная с Linux 2.6.6)

source: This directory contains files I<msg_max>, I<msgsize_max>, and I<queues_max>, controlling the resources used by POSIX message queues. See B<mq_overview>(7) for details.
ru: В этом каталоге содержатся файлы I<msg_max>, I<msgsize_max> и I<queues_max>, которые контролируют ресурсы, используемые очередями сообщений POSIX. Подробней смотрите в B<mq_overview>(7).

source: I</proc/sys/fs/nr_open> (since Linux 2.6.25)
ru: I</proc/sys/fs/nr_open> (начиная с Linux 2.6.25)

source: This file imposes ceiling on the value to which the B<RLIMIT_NOFILE> resource limit can be raised (see B<getrlimit>(2)). This ceiling is enforced for both unprivileged and privileged process. The default value in this file is 1048576. (Before Linux 2.6.25, the ceiling for B<RLIMIT_NOFILE> was hard-coded to the same value.)
ru: Этот файл налагает потолок на значение, до которого может быть повышен ограничитель ресурса B<RLIMIT_NOFILE> (смотрите B<getrlimit>(2)). Этот потолок применяется к непривилегированным и привилегированным процессам. Значение по умолчанию в этом файле равно 1048576 (до Linux 2.6.25 потолок для B<RLIMIT_NOFILE> был неизменяемым с этим же значением).

source: I</proc/sys/fs/overflowgid> and I</proc/sys/fs/overflowuid>
ru: I</proc/sys/fs/overflowgid> и I</proc/sys/fs/overflowuid>

source: These files allow you to change the value of the fixed UID and GID. The default is 65534. Some filesystems support only 16-bit UIDs and GIDs, although in Linux UIDs and GIDs are 32 bits. When one of these filesystems is mounted with writes enabled, any UID or GID that would exceed 65535 is translated to the overflow value before being written to disk.
ru: Эти файлы позволяют вам изменить значение фиксированных UID и GID. По умолчанию оно равно 65534. Некоторые файловые системы поддерживают только 16-битные UID и GID, в то время как в Linux UID и GID являются 32-битными. Когда монтируется одна из таких файловых систем с правами, позволяющими запись, все UID или GID, которые превышают 65535, транслируются перед записью на диск в значения переполнения.

source: See B<pipe>(7).
ru: Смотрите B<pipe>(7).

source: I</proc/sys/fs/protected_hardlinks> (since Linux 3.6)
ru: I</proc/sys/fs/protected_hardlinks> (начиная с Linux 3.6)

source: When the value in this file is 0, no restrictions are placed on the creation of hard links (i.e., this is the historical behavior before Linux 3.6). When the value in this file is 1, a hard link can be created to a target file only if one of the following conditions is true:
ru: Если значение в файле равно 0, то на создание жёстких ссылок не накладываются ограничения (соответствует поведению до Linux 3.6). Если значение в файле равно 1, то жёсткая ссылка может быть создана, если соблюдается одно из следующих условий:

source: The calling process has the B<CAP_FOWNER> capability in its user namespace and the file UID has a mapping in the namespace.
ru: Вызывающий процесс имеет мандат B<CAP_FOWNER> в своём пользовательском пространстве имён и UID файла отображён в пространстве имён.

source: The filesystem UID of the process creating the link matches the owner (UID) of the target file (as described in B<credentials>(7), a process's filesystem UID is normally the same as its effective UID).
ru: UID файловой системы процесса, создающего ссылку, совпадает с владельцем (UID) файла, на который создаётся ссылка (как описано в B<credentials>(7), UID файловой системы процесса обычно совпадает с эффективным UID).

source: All of the following conditions are true:
ru: Все следующие условия выполняются:

source: the target is a regular file;
ru: целевой файл является обычным;

source: the target file does not have its set-user-ID mode bit enabled;
ru: на целевом файле не установлен бит режима set-user-ID;

source: the target file does not have both its set-group-ID and group-executable mode bits enabled; and
ru: на целевом файле не установлены биты режима set-group-ID и group-executable; и

source: the caller has permission to read and write the target file (either via the file's permissions mask or because it has suitable capabilities).
ru: вызывающий имеет право на чтение и запись целевого файла (согласно маске прав на файл или из-за имеющихся мандатов).

source: The default value in this file is 0. Setting the value to 1 prevents a longstanding class of security issues caused by hard-link-based time-of-check, time-of-use races, most commonly seen in world-writable directories such as I</tmp>. The common method of exploiting this flaw is to cross privilege boundaries when following a given hard link (i.e., a root process follows a hard link created by another user). Additionally, on systems without separated partitions, this stops unauthorized users from "pinning" vulnerable set-user-ID and set-group-ID files against being upgraded by the administrator, or linking to special files.
ru: Значение по умолчанию в файле равно 0. Установка значения в 1 закрывает долголетний класс проблем с безопасностью, вызванных проверкой времени на основе жёсткой ссылки, состязательностью при использовании времени, наиболее часто встречающейся в каталогах доступным на запись всем, таким как I</tmp>. Распространённый метод использования этой уязвимости — присвоение прав при переходе по жёсткой ссылке (т.е., процесс суперпользователя переходит по жёсткой ссылке, созданной другим пользователем). Также, в системах без выделенных разделов это останавливает неправомочных пользователей от «закрепления» уязвимых файлов с битами set-user-ID и set-group-ID при выполнении администратором обновления, или компоновки со специальными файлами.
