Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: B<POSIX_FADV_DONTNEED> attempts to free cached pages associated with the specified region. This is useful, for example, while streaming large files. A program may periodically request the kernel to free cached data that has already been used, so that more useful cached pages are not discarded instead.
ru: При указании B<POSIX_FADV_DONTNEED> вызов пытается высвободить кэшированные страницы, связанные с указанной областью. Это полезно, например, при потоковой обработке больших файлов. Программа может периодически запрашивать ядро об освобождении уже использованных кэшированных данных, так что полезные кэшированные страницы не будут освобождаться.

source: Requests to discard partial pages are ignored. It is preferable to preserve needed data than discard unneeded data. If the application requires that data be considered for discarding, then I<offset> and I<len> must be page-aligned.
ru: Запросы на удаление частичных страниц игнорируются. Предпочтительней сохранять необходимые данные, а не удалять ненужные. Если приложению требуется, чтобы данные считались подходящими для удаления, то I<offset> и I<len> должны быть выровнены по границе страницы.

source: The implementation I<may> attempt to write back dirty pages in the specified region, but this is not guaranteed. Any unwritten dirty pages will not be freed. If the application wishes to ensure that dirty pages will be released, it should call B<fsync>(2) or B<fdatasync>(2) first.
ru: Реализация I<может> пытаться записать неактуальные (dirty) страницы указанную область, но это не гарантируется. Все не записанные неактуальные страницы не будут освобождены. Если приложение хочет обязательно освободить неактуальные страницы, то оно сначала должно вызвать B<fsync>(2) или B<fdatasync>(2).

source: On success, zero is returned. On error, an error number is returned.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается номер ошибки.

source: The I<fd> argument was not a valid file descriptor.
ru: Аргумент I<fd> не является правильным файловым дескриптором.

source: An invalid value was specified for I<advice>.
ru: Неверное значение I<advice>.

source: The specified file descriptor refers to a pipe or FIFO. (B<ESPIPE> is the error specified by POSIX, but before kernel version 2.6.16, Linux returned B<EINVAL> in this case.)
ru: Указанный файловый дескриптор ссылается на канал (pipe) или FIFO (в этом случае в Linux до версии 2.6.16, возвращал B<EINVAL>, хотя согласно POSIX ошибка должна быть B<ESPIPE>).

source: Kernel support first appeared in Linux 2.5.60; the underlying system call is called B<fadvise64>(). Library support has been provided since glibc version 2.2, via the wrapper function B<posix_fadvise>().
ru: Поддержка в ядре впервые появилась в Linux 2.5.60; используемый системный вызов называется B<fadvise64>(). Поддержка в библиотеке glibc появилась в версии 2.2; обёрточная функция называется B<posix_fadvise>().

source: Since Linux 3.18, support for the underlying system call is optional, depending on the setting of the B<CONFIG_ADVISE_SYSCALLS> configuration option.
ru: Начиная с Linux 3.18 поддержка данного системного вызова необязательна, она зависит от того, собрано ли ядро с параметром B<CONFIG_ADVISE_SYSCALLS>.

source: POSIX.1-2001, POSIX.1-2008. Note that the type of the I<len> argument was changed from I<size_t> to I<off_t> in POSIX.1-2003 TC1.
ru: POSIX.1-2001, POSIX.1-2008. Заметим, что в POSIX.1-2003 TC1 тип аргумента I<len> был изменён с I<size_t> на I<off_t>.

source: Under Linux, B<POSIX_FADV_NORMAL> sets the readahead window to the default size for the backing device; B<POSIX_FADV_SEQUENTIAL> doubles this size, and B<POSIX_FADV_RANDOM> disables file readahead entirely. These changes affect the entire file, not just the specified region (but other open file handles to the same file are unaffected).
ru: В Linux B<POSIX_FADV_NORMAL> устанавливает окно упреждающего чтения согласно используемому размеру по умолчанию для ниже лежащего устройства; B<POSIX_FADV_SEQUENTIAL> удваивает этот размер, а B<POSIX_FADV_RANDOM> отменяет упреждающее чтение вообще. Эти изменения влияют на весь файл, а не только на указанную его область (но другие открытые обработчики файлов на этом файле не изменяются).

source: The contents of the kernel buffer cache can be cleared via the I</proc/sys/vm/drop_caches> interface described in B<proc>(5).
ru: Содержимое буферного кэша ядра может быть очищено через интерфейс I</proc/sys/vm/drop_caches>, описанный в B<proc>(5).

source: One can obtain a snapshot of which pages of a file are resident in the buffer cache by opening a file, mapping it with B<mmap>(2), and then applying B<mincore>(2) to the mapping.
ru: Можно получить снимок страниц файла, которые располагаются в буферном кэше: открыть файл, отобразить его через B<mmap>(2) и затем применить B<mincore>(2) к отображению.

source: The name of the wrapper function in the C library is B<posix_fadvise>(). The underlying system call is called B<fadvise64>() (or, on some architectures, B<fadvise64_64>()); the difference between the two is that the former system call assumes that the type of the I<len> argument is I<size_t>, while the latter expects I<loff_t> there.
ru: Обёрточная функция в библиотеке C называется B<posix_fadvise>(). Используемый ей системный вызов называется B<fadvise64>() (на некоторых архитектурах — B<fadvise64_64>()); разница между ними в том, что в библиотечной функциитип аргумента I<len> равен I<size_t>, а у системного вызова — I<loff_t>.

source: Architecture-specific variants
ru: Варианты, зависящие от архитектуры

source: Some architectures require 64-bit arguments to be aligned in a suitable pair of registers (see B<syscall>(2) for further detail). On such architectures, the call signature of B<posix_fadvise>() shown in the SYNOPSIS would force a register to be wasted as padding between the I<fd> and I<offset> arguments. Therefore, these architectures define a version of the system call that orders the arguments suitably, but is otherwise exactly the same as B<posix_fadvise>().
ru: На некоторых архитектурах требуется, чтобы 64-битные аргументы были выровнены в подходящей паре регистров (подробности в B<syscall>(2)). На таких архитектурах показанная в СИНТАКСИСЕ форма вызова B<posix_fadvise>() приводила бы пустой трате регистра для заполнения между аргументами I<fd> и I<offset>. Поэтому на этих архитектурах определена версия системного вызова с исправленным порядком аргументов, иначе используется формат как у B<posix_fadvise>().

source: For example, since Linux 2.6.14, ARM has the following system call:
ru: Например, начиная с Linux 2.6.14, в ARM есть следующий системный вызов:

source: These architecture-specific details are generally hidden from applications by the glibc B<posix_fadvise>() wrapper function, which invokes the appropriate architecture-specific system call.
ru: Данные, зависящие от архитектуры, детали, обычно, скрываются от приложений в обёрточной функции glibc B<posix_fadvise>(), которая использует соответствующий архитектуре системный вызов.

source: In kernels before 2.6.6, if I<len> was specified as 0, then this was interpreted literally as "zero bytes", rather than as meaning "all bytes through to the end of the file".
ru: В ядрах до версии 2.6.6, если значение I<len> равнялось 0, то это воспринималось дословно как «ноль байт», а не как «все байты до конца файла».

source: ptrace - process trace
ru: ptrace - трассировка процесса

source: The B<ptrace>() system call provides a means by which one process (the "tracer") may observe and control the execution of another process (the "tracee"), and examine and change the tracee's memory and registers. It is primarily used to implement breakpoint debugging and system call tracing.
ru: Системный вызов B<ptrace>() позволяет указать какому процессу («трассировщику») можно наблюдать и контролировать выполнение другого процесса («трассироемого»), просматривать и изменять его память и регистры. Обычно, он используется для реализации отладочных точек прерывания и для отслеживания системных вызовов.

source: A tracee first needs to be attached to the tracer. Attachment and subsequent commands are per thread: in a multithreaded process, every thread can be individually attached to a (potentially different) tracer, or left not attached and thus not debugged. Therefore, "tracee" always means "(one) thread", never "a (possibly multithreaded) process". Ptrace commands are always sent to a specific tracee using a call of the form
ru: Сначала, трассировщик должен присоединиться к трассируемой нити. Присоединение и последующие команды выполняются для нитей: в многонитевом процессе трассировщик может подключаться как к каждой нити (трассировщики могут быть у разных нитей разными), так и не подключаться к некоторым нитям вовсе. Поэтому на самом деле «трассируемая нить» всегда означает «(одну) нить», а не «процесс в целом (возможно многонитевой)». Команды ptrace всегда посылаются определённой трассируемой нити с помощью вызова

source: where I<pid> is the thread ID of the corresponding Linux thread.
ru: где I<pid> — идентификатор соответствующей нити Linux.

source: (Note that in this page, a "multithreaded process" means a thread group consisting of threads created using the B<clone>(2) B<CLONE_THREAD> flag.)
ru: Заметим, что в этой странице «многонитевой процесс» означает группу нитей, состоящую из нитей, созданных с помощью B<clone>(2) с флагом B<CLONE_THREAD>.

source: A process can initiate a trace by calling B<fork>(2) and having the resulting child do a B<PTRACE_TRACEME>, followed (typically) by an B<execve>(2). Alternatively, one process may commence tracing another process using B<PTRACE_ATTACH> or B<PTRACE_SEIZE>.
ru: Процесс может начать трассировку с вызова B<fork>(2), в получившемся дочернем процессе выполнить действие B<PTRACE_TRACEME>, после чего (обычно) выполнить B<execve>(2). Или же один процесс может начать отладку другого процесса при помощи B<PTRACE_ATTACH> или B<PTRACE_SEIZE>.

source: While being traced, the tracee will stop each time a signal is delivered, even if the signal is being ignored. (An exception is B<SIGKILL>, which has its usual effect.) The tracer will be notified at its next call to B<waitpid>(2) (or one of the related "wait" system calls); that call will return a I<status> value containing information that indicates the cause of the stop in the tracee. While the tracee is stopped, the tracer can use various ptrace requests to inspect and modify the tracee. The tracer then causes the tracee to continue, optionally ignoring the delivered signal (or even delivering a different signal instead).
ru: При трассировке трассируемая нить останавливается каждый раз при получении сигнала, даже если этот сигнал игнорируется (исключением является B<SIGKILL>, работающий обычным образом). Трассировщик будет уведомлён об этом при следующем вызове B<waitpid>(2) (или подобном «ожидающем» системном вызове); этот вызов вернёт значение I<status>, в котором содержится информация, указывающая на причину остановки трассируемой нити. Так как трассируемая нить остановлена, трассировщик может использовать различные запросы ptrace для обследования и изменения трассируемой нити. По окончании трассировщик разрешает трассируемой нити продолжить работу, возможно подавляя посылаемый ему сигнал (или даже отправляя вместо него другой сигнал).

source: If the B<PTRACE_O_TRACEEXEC> option is not in effect, all successful calls to B<execve>(2) by the traced process will cause it to be sent a B<SIGTRAP> signal, giving the parent a chance to gain control before the new program begins execution.
ru: Если флаг B<PTRACE_O_TRACEEXEC> не действует, то все успешные вызовы B<execve>(2) трассируемой нитью будут приводить к отправки сигнала B<SIGTRAP>, давая таким образом родителю шанс перехватить управление до того, как начнёт выполняться новая программа.

source: When the tracer is finished tracing, it can cause the tracee to continue executing in a normal, untraced mode via B<PTRACE_DETACH>.
ru: По окончании трассировки трассировщик может заставить трассируемую нить продолжить свою работу в обычном не трассируемом режиме с помощью B<PTRACE_DETACH>.

source: The value of I<request> determines the action to be performed:
ru: Значение аргумента I<request> определяет выполняемое действие:

source: Indicate that this process is to be traced by its parent. A process probably shouldn't make this request if its parent isn't expecting to trace it. (I<pid>, I<addr>, and I<data> are ignored.)
ru: Указывает, что этот процесс будет трассирован своим родительским процессом. Вероятно, процессу не следует посылать этот запрос, если родительский процесс не готов к трассировке (аргументы I<pid>, I<addr> и I<data> игнорируются).

source: The B<PTRACE_TRACEME> request is used only by the tracee; the remaining requests are used only by the tracer. In the following requests, I<pid> specifies the thread ID of the tracee to be acted on. For requests other than B<PTRACE_ATTACH>, B<PTRACE_SEIZE>, B<PTRACE_INTERRUPT>, and B<PTRACE_KILL>, the tracee must be stopped.
ru: Действие B<PTRACE_TRACEME> используется только в трассируемой нити; остальные действия предназначены только для трассировщика. Для значений, описанных ниже, в параметре I<pid> задаётся идентификатор трассируемой нити, над которой будет производиться действие. Перед выполнением действий (кроме B<PTRACE_ATTACH>, B<PTRACE_SEIZE>, B<PTRACE_INTERRUPT> и B<PTRACE_KILL>) трассируемая нить должна быть остановлена.

source: Read a word at the address I<addr> in the tracee's memory, returning the word as the result of the B<ptrace>() call. Linux does not have separate text and data address spaces, so these two requests are currently equivalent. (I<data> is ignored; but see NOTES.)
ru: Читает слово по адресу I<addr>, находящееся в памяти трассируемой нити, возвращая это слово как результат вызова B<ptrace>() Linux не разделяет адресные пространства текста и данных, поэтому оба вызова абсолютно идентичны (значение I<data> игнорируется; но смотрите ЗАМЕЧАНИЯ).

source: Read a word at offset I<addr> in the tracee's USER area, which holds the registers and other information about the process (see I<E<lt>sys/user.hE<gt>>). The word is returned as the result of the B<ptrace>() call. Typically, the offset must be word-aligned, though this might vary by architecture. See NOTES. (I<data> is ignored; but see NOTES.)
ru: Читает слово по смещению I<addr> из области USER трассируемой нити, которая содержит информацию о регистрах и процессе (смотрите I<E<lt>sys/userhE<gt>>). Слово возвращается в качестве результата вызова B<ptrace>(). Обычно, смещение должно быть выровнено по границе слова, хотя это может зависеть от архитектуры системы. Смотрите ЗАМЕЧАНИЯ (значение I<data> игнорируется; но смотрите ЗАМЕЧАНИЯ).

source: Copy the word I<data> to the address I<addr> in the tracee's memory. As for B<PTRACE_PEEKTEXT> and B<PTRACE_PEEKDATA>, these two requests are currently equivalent.
ru: Копирует слово I<data> в память трассируемой нити по адресу I<addr>. В настоящее время, как и для B<PTRACE_PEEKTEXT> и B<PTRACE_PEEKDATA>, эти два действия одинаковы.

source: Copy the word I<data> to offset I<addr> in the tracee's USER area. As for B<PTRACE_PEEKUSER>, the offset must typically be word-aligned. In order to maintain the integrity of the kernel, some modifications to the USER area are disallowed.
ru: Копирует слово I<data> по смещению I<addr> в область USER трассирумой нити. Как и для B<PTRACE_PEEKUSER>, смещение должно быть выровнено по границе слова. Для того, чтобы сохранить целостность ядра, некоторые изменения в область USER вносить запрещено.

source: Copy the tracee's general-purpose or floating-point registers, respectively, to the address I<data> in the tracer. See I<E<lt>sys/user.hE<gt>> for information on the format of this data. (I<addr> is ignored.) Note that SPARC systems have the meaning of I<data> and I<addr> reversed; that is, I<data> is ignored and the registers are copied to the address I<addr>. B<PTRACE_GETREGS> and B<PTRACE_GETFPREGS> are not present on all architectures.
ru: Копирует, соответственно, регистры общего назначения или регистры сопроцессора трассируемой нити в память трассировщика по адресу I<data>. Формат передаваемой структуры описан в файле I<E<lt>sys/user.hE<gt>> (значение I<addr> игнорируется). Заметим, что в системах SPARC предназначение I<data> и I<addr> поменяны местами; то есть I<data> игнорируется, а регистры копируются по адресу I<addr>. B<PTRACE_GETREGS> и B<PTRACE_GETFPREGS> есть не на всех архитектурах.

source: B<PTRACE_GETREGSET> (since Linux 2.6.34)
ru: B<PTRACE_GETREGSET> (начиная с Linux 2.6.34)

source: Read the tracee's registers. I<addr> specifies, in an architecture-dependent way, the type of registers to be read. B<NT_PRSTATUS> (with numerical value 1) usually results in reading of general-purpose registers. If the CPU has, for example, floating-point and/or vector registers, they can be retrieved by setting I<addr> to the corresponding B<NT_foo> constant. I<data> points to a B<struct iovec>, which describes the destination buffer's location and length. On return, the kernel modifies B<iov.len> to indicate the actual number of bytes returned.
ru: Читает регистры трассируемой нити. В I<addr> указывается, в зависящей от архитектуры форме, тип читаемых регистров. Значение B<NT_PRSTATUS> (равно 1) обычно служит для чтения регистров общего назначения. Если в ЦП есть, например, векторные регистры и для плавающей запятой, то их можно получить назначив I<addr> соответствующую константу B<NT_foo>. Значение I<data> указывает на B<struct iovec>, которая описывает расположение буфера назначения и длину. При возврате ядро изменяет B<iov.len>, возвращая реальное количество возвращаемых байт.

source: Modify the tracee's general-purpose or floating-point registers, respectively, from the address I<data> in the tracer. As for B<PTRACE_POKEUSER>, some general-purpose register modifications may be disallowed. (I<addr> is ignored.) Note that SPARC systems have the meaning of I<data> and I<addr> reversed; that is, I<data> is ignored and the registers are copied from the address I<addr>. B<PTRACE_SETREGS> and B<PTRACE_SETFPREGS> are not present on all architectures.
ru: Копирует, соответственно, регистры общего назначения или регистры для плавающей запятой трассируемой нити из памяти трассировщика по адресу I<data>. Как и в случае c B<PTRACE_POKEUSER>, изменения некоторых регистров общего назначения запрещены (значение I<addr> игнорируется). Заметим, что в системах SPARC предназначение I<data> и I<addr> переставлены местами; то есть I<data> игнорируется, а регистры копируются из памяти, на которую указывает адрес I<addr>. B<PTRACE_SETREGS> и B<PTRACE_SETFPREGS> есть не для всех архитектур.

source: B<PTRACE_SETREGSET> (since Linux 2.6.34)
ru: B<PTRACE_SETREGSET> (начиная с Linux 2.6.34)

source: Modify the tracee's registers. The meaning of I<addr> and I<data> is analogous to B<PTRACE_GETREGSET>.
ru: Изменяет регистры трассируемой нити. Значение I<addr> и I<data> аналогичны B<PTRACE_GETREGSET>.

source: B<PTRACE_GETSIGINFO> (since Linux 2.3.99-pre6)
ru: B<PTRACE_GETSIGINFO> (начиная с Linux 2.3.99-pre6)

source: Retrieve information about the signal that caused the stop. Copy a I<siginfo_t> structure (see B<sigaction>(2)) from the tracee to the address I<data> in the tracer. (I<addr> is ignored.)
ru: Получает информацию о сигнале, который вызвал остановку. Копирует структуру I<siginfo_t> (смотрите B<sigaction>(2)) из трассируемой нити в память трассировщика по адресу I<data> (значение I<addr> игнорируется).

source: B<PTRACE_SETSIGINFO> (since Linux 2.3.99-pre6)
ru: B<PTRACE_SETSIGINFO> (начиная с Linux 2.3.99-pre6)

source: Set signal information: copy a I<siginfo_t> structure from the address I<data> in the tracer to the tracee. This will affect only signals that would normally be delivered to the tracee and were caught by the tracer. It may be difficult to tell these normal signals from synthetic signals generated by B<ptrace>() itself. (I<addr> is ignored.)
ru: Устанавливает информацию о сигнале. Копирует структуру I<siginfo_t>, расположенную по адресу I<data> трассировщика, в память трассируемой нити. Влияет только на сигналы, которые обычно были бы доставлены трассируемой нити и были пойманы трассировщиком. Затруднительно отличить обычные сигналы от созданных самим B<ptrace>() (значение I<addr> игнорируется).

source: B<PTRACE_PEEKSIGINFO> (since Linux 3.10)
ru: B<PTRACE_PEEKSIGINFO> (начиная с Linux 3.10)

source: Retrieve I<siginfo_t> structures without removing signals from a queue. I<addr> points to a I<ptrace_peeksiginfo_args> structure that specifies the ordinal position from which copying of signals should start, and the number of signals to copy. I<siginfo_t> structures are copied into the buffer pointed to by I<data>. The return value contains the number of copied signals (zero indicates that there is no signal corresponding to the specified ordinal position). Within the returned I<siginfo> structures, the I<si_code> field includes information (B<__SI_CHLD>, B<__SI_FAULT>, etc.) that are not otherwise exposed to user space.
ru: Получает структуры I<siginfo_t> не удаляя сигналы из очереди. Значение I<addr> указывает на структуру I<ptrace_peeksiginfo_args>, которая задаёт начальную позицию, из которой нужно начать копирование сигналов, а также их количество. Структуры I<siginfo_t> копируются в буфер, указываемый в I<data>. Возвращаемое значение содержит количество скопированных сигналов (ноль означает, что сигналов в указанной позиции нет). Внутри возвращаемых структур I<siginfo> в поле I<si_code> включается информация (B<__SI_CHLD>, B<__SI_FAULT> и т. д.), которая по-другому никак не выдаётся в пользовательское пространство.

source: struct ptrace_peeksiginfo_args { u64 off; /* Ordinal position in queue at which to start copying signals */ u32 flags; /* PTRACE_PEEKSIGINFO_SHARED or 0 */ s32 nr; /* Number of signals to copy */ };
ru: struct ptrace_peeksiginfo_args { u64 off; /* начальная позиция в очереди, с которой начинается копирование сигналов */ u32 flags; /* PTRACE_PEEKSIGINFO_SHARED или 0 */ s32 nr; /* количество копируемых сигналов */ };

source: Currently, there is only one flag, B<PTRACE_PEEKSIGINFO_SHARED>, for dumping signals from the process-wide signal queue. If this flag is not set, signals are read from the per-thread queue of the specified thread.
ru: В настоящее время определён только один флаг, B<PTRACE_PEEKSIGINFO_SHARED>, служащий для выборки сигналов из общей очереди сигналов процессов. Если этот флаг не указан, то сигналы читаются из очереди указанной нити.

source: B<PTRACE_GETSIGMASK> (since Linux 3.11)
ru: B<PTRACE_GETSIGMASK> (начиная с Linux 3.11)

source: Place a copy of the mask of blocked signals (see B<sigprocmask>(2)) in the buffer pointed to by I<data>, which should be a pointer to a buffer of type I<sigset_t>. The I<addr> argument contains the size of the buffer pointed to by I<data> (i.e., I<sizeof(sigset_t)>).
ru: Помещает копию маски блокированных сигналов (смотрите B<sigprocmask>(2)) в буфер, указанный в I<data> (должен быть указателем на буфер с типом I<sigset_t>). Аргумент I<addr> содержит размер буфера, указанного в I<data> (т. е. I<sizeof(sigset_t)>).

source: B<PTRACE_SETSIGMASK> (since Linux 3.11)
ru: B<PTRACE_SETSIGMASK> (начиная с Linux 3.11)
