Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Note however that this file is not merely a symbolic link. It provides the same view of the filesystem (including namespaces and the set of per-process mounts) as the process itself. An example illustrates this point. In one terminal, we start a shell in new user and mount namespaces, and in that shell we create some new mount points:
ru: Однако заметим, что этот файл не просто символьная ссылка. Note however that this file is not merely a symbolic link. Она предоставляет тоже отражение файловой системы (включая пространства имён и набор попроцессного монтирования) как сам процесс. Покажем это на примере. В одном терминале мы запустим оболочку в новом пространстве имён пользователя и монтирования, и создадим несколько новых точек монтирования:

source: $ B<PS1='sh1# ' unshare -Urnm> sh1# B<mount -t tmpfs tmpfs /etc> # Mount empty tmpfs at /etc sh1# B<mount --bind /usr /dev> # Mount /usr at /dev sh1# B<echo $$> 27123
ru: $ B<PS1='sh1# ' unshare -Urnm> sh1# B<mount -t tmpfs tmpfs /etc> # монтирование пустой tmpfs в /etc sh1# B<mount --bind /usr /dev> # монтирование /usr в /dev sh1# B<echo $$> 27123

source: In a second terminal window, in the initial mount namespace, we look at the contents of the corresponding mounts in the initial and new namespaces:
ru: Во втором терминальном окне, в первоначальном пространстве имён монтирования, посмотрим содержимое соответствующего монтирования в первоначальном и новом пространстве имён:

source: $ B<PS1='sh2# ' sudo sh> sh2# B<ls /etc | wc -l> # In initial NS 309 sh2# B<ls /proc/27123/root/etc | wc -l> # /etc in other NS 0 # The empty tmpfs dir sh2# B<ls /dev | wc -l> # In initial NS 205 sh2# B<ls /proc/27123/root/dev | wc -l> # /dev in other NS 11 # Actually bind # mounted to /usr sh2# B<ls /usr | wc -l> # /usr in initial NS 11
ru: $ B<PS1='sh2# ' sudo sh> sh2# B<ls /etc | wc -l> # в первоначальном NS 309 sh2# B<ls /proc/27123/root/etc | wc -l> # /etc в другом NS 0 # пустой каталог tmpfs sh2# B<ls /dev | wc -l> # в первоначальном NS 205 sh2# B<ls /proc/27123/root/dev | wc -l> # /dev в другом NS 11 # в реальности привязано # к смонтированному /usr sh2# B<ls /usr | wc -l> # /usr в первоначальном NS 11

source: In a multithreaded process, the contents of the I</proc/[pid]/root> symbolic link are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
ru: В многонитевых процессах, содержимое символьной ссылки I</proc/[pid]/root> недоступно, если головная нить уже завершила работу (обычно с помощью вызова B<pthread_exit>(3)).

source: I</proc/[pid]/seccomp> (Linux 2.6.12 to 2.6.22)
ru: I</proc/[pid]/seccomp> (Linux 2.6.12 по 2.6.22)

source: This file can be used to read and change the process's secure computing (seccomp) mode setting. It contains the value 0 if the process is not in seccomp mode, and 1 if the process is in strict seccomp mode (see B<seccomp>(2)). Writing 1 to this file places the process irreversibly in strict seccomp mode. (Further attempts to write to the file fail with the B<EPERM> error.)
ru: Этот файл можно использовать для чтения и изменения настройки режима безопасных вычислений в процессе (seccomp). Он содержит значение 0, если процесс не в режиме seccomp, и 1, если процесс ограничен режимом seccomp (смотрите B<seccomp>(2)). Запись 1 в этот файл безвозвратно помещает процесс в ограниченный режим seccomp (последующие попытки записать в файл завершаются ошибкой B<EPERM>).

source: In Linux 2.6.23, this file went away, to be replaced by the B<prctl>(2) B<PR_GET_SECCOMP> and B<PR_SET_SECCOMP> operations (and later by B<seccomp>(2) and the I<Seccomp> field in I</proc/[pid]/status>).
ru: В Linux 2.6.23 этот файл был убран и заменён операциями B<PR_GET_SECCOMP> и B<PR_SET_SECCOMP> вызова B<prctl>(2) (а позднее B<seccomp>(2) и полем I<Seccomp> в I</proc/[pid]/status>).

source: I</proc/[pid]/setgroups> (since Linux 3.19)
ru: I</proc/[pid]/setgroups> (начиная с Linux 3.19)

source: I</proc/[pid]/smaps> (since Linux 2.6.14)
ru: I</proc/[pid]/smaps> (начиная с Linux 2.6.14)

source: This file shows memory consumption for each of the process's mappings. (The B<pmap>(1) command displays similar information, in a form that may be easier for parsing.) For each mapping there is a series of lines such as the following:
ru: Этот файл содержит значение потребления памяти каждого отображения процесса. (команда B<pmap>(1) выводит похожую информацию в пригодной для анализа форме). Для каждого отображения есть несколько строк в виде:

source: The first of these lines shows the same information as is displayed for the mapping in I</proc/[pid]/maps>. The following lines show the size of the mapping, the amount of the mapping that is currently resident in RAM ("Rss"), the process's proportional share of this mapping ("Pss"), the number of clean and dirty shared pages in the mapping, and the number of clean and dirty private pages in the mapping. "Referenced" indicates the amount of memory currently marked as referenced or accessed. "Anonymous" shows the amount of memory that does not belong to any file. "Swap" shows how much would-be-anonymous memory is also used, but out on swap.
ru: Первые строки содержат ту же информацию, что и для отображения в I</proc/[pid]/maps>. Следующие строки содержат размер отображения, размер отображения, которое сейчас находится в RAM («Rss»), вклад этого отображения в пропорцию общих страниц процесса («Pss»), количество чистых и грязных общих страниц в отображении и количеств количество чистых и грязных частных страниц в отображении. В «Referenced» указано количество памяти помеченной, в данный момент, как ссылочная или доступная. В «Anonymous» указано количество памяти, которая не принадлежит никакому файлу. В «Swap» указано как много также использовалось было бы анонимной памяти, но она в подкачке.

source: The "KernelPageSize" line (available since Linux 2.6.29) is the page size used by the kernel to back the virtual memory area. This matches the size used by the MMU in the majority of cases. However, one counter-example occurs on PPC64 kernels whereby a kernel using 64kB as a base page size may still use 4kB pages for the MMU on older processors. To distinguish the two attributes, the "MMUPageSize" line (also available since Linux 2.6.29) reports the page size used by the MMU.
ru: Значение «KernelPageSize» (доступно, начиная с Linux 2.6.29) — размер страницы, используемый ядром при делении области виртуальной памяти. В большинстве случаев, размер совпадает с используемым в MMU. Однако, есть один контрпример в ядрах на PPC64, где в качестве базового размера страницы используется 64КБ, но при этом по-прежнему могут использоваться 4КБ страницы для MMU на старых процессорах. Для различения двух атрибутов значением «MMUPageSize» (также доступно начиная с Linux 2.6.29) определяется размер страницы, используемой MMU.

source: The "Locked" indicates whether the mapping is locked in memory or not.
ru: Значение «Locked» указывает будет ли отображение заблокировано в памяти или нет.

source: The "ProtectionKey" line (available since Linux 4.9, on x86 only) contains the memory protection key (see B<pkeys>(7)) associated with the virtual memory area. This entry is present only if the kernel was built with the B<CONFIG_X86_INTEL_MEMORY_PROTECTION_KEYS> configuration option.
ru: Значение «ProtectionKey» (доступно, начиная с Linux 4.9 только на x86) содержит ключ защиты памяти (смотрите B<pkeys>(7)), связанный с областью виртуальной памяти. Этот элемент появляется, только если ядро было собрано с параметром настройки B<CONFIG_X86_INTEL_MEMORY_PROTECTION_KEYS>.

source: The "VmFlags" line (available since Linux 3.8) represents the kernel flags associated with the virtual memory area, encoded using the following two-letter codes:
ru: Значение «VmFlags» (доступно, начиная с Linux 3.8) представляет флаги ядра, связанные с виртуальной областью памяти, в виде двухбуквенного кода:

source: rd - readable wr - writable ex - executable sh - shared mr - may read mw - may write me - may execute ms - may share gd - stack segment grows down pf - pure PFN range dw - disabled write to the mapped file lo - pages are locked in memory io - memory mapped I/O area sr - sequential read advise provided rr - random read advise provided dc - do not copy area on fork de - do not expand area on remapping ac - area is accountable nr - swap space is not reserved for the area ht - area uses huge tlb pages nl - non-linear mapping ar - architecture specific flag dd - do not include area into core dump sd - soft-dirty flag mm - mixed map area hg - huge page advise flag nh - no-huge page advise flag mg - mergeable advise flag
ru: rd - доступна для чтения wr - доступна для записи ex - доступна для исполнения sh - общая mr - может читаться mw - может писаться me - может исполняться ms - может быть общей gd - сегмент стека растёт вниз pf - чистый диапазон PFN dw - отключена запись в отображаемый файл lo - страницы заблокированы в памяти io - память отображённой области ввода-вывода sr - предоставляет уведомление для последовательного чтения rr - предоставляет уведомление для чтения с произвольным доступом dc - область не копируется при fork de - область не расширяется при переотображении ac - область учитывается nr - для области не зарезервировано пространство подкачки ht - область использует огромные страницы tlb nl - нелинейное отображение ar - флаг, зависящий от архитектуры dd - область не включается в дамп памяти sd - флаг несильного загрязнения mm - область смешанной карты hg - уведомительный флаг огромной страницы nh - уведомительный флаг не огромной страницы mg - уведомительный флаг слияния

source: "ProtectionKey" field contains the memory protection key (see B<pkeys>(5)) associated with the virtual memory area. Present only if the kernel was built with the B<CONFIG_X86_INTEL_MEMORY_PROTECTION_KEYS> configuration option. (since Linux 4.6)
ru: Значение «ProtectionKey» содержит ключ защиты памяти (смотрите B<pkeys>(5)), связанный с областью виртуальной памяти. Этот элемент появляется, только если ядро было собрано с параметром настройки B<CONFIG_X86_INTEL_MEMORY_PROTECTION_KEYS> (начиная с Linux 4.6)

source: The I</proc/[pid]/smaps> file is present only if the B<CONFIG_PROC_PAGE_MONITOR> kernel configuration option is enabled.
ru: Файл I</proc/[pid]/smaps> существует только, если включён параметр настройки ядра B<CONFIG_PROC_PAGE_MONITOR>.

source: I</proc/[pid]/stack> (since Linux 2.6.29)
ru: I</proc/[pid]/stack> (начиная с Linux 2.6.29)

source: This file provides a symbolic trace of the function calls in this process's kernel stack. This file is provided only if the kernel was built with the B<CONFIG_STACKTRACE> configuration option.
ru: Этот файл предоставляет символическую трассировку вызовов функций в стеке ядра для этого процесса. Этот файл есть в системе только, если ядро было собрано с параметром настройки B<CONFIG_STACKTRACE>.

source: Status information about the process. This is used by B<ps>(1). It is defined in the kernel source file I<fs/proc/array.c>.
ru: Информация о состоянии процесса. Она используется командой B<ps>(1). Определяется в файле исходного кода ядра I<fs/proc/array.c>.

source: The fields, in order, with their proper B<scanf>(3) format specifiers, are listed below. Whether or not certain of these fields display valid information is governed by a ptrace access mode B<PTRACE_MODE_READ_FSCREDS>\ |\ B<PTRACE_MODE_NOAUDIT> check (refer to B<ptrace>(2)). If the check denies access, then the field value is displayed as 0. The affected fields are indicated with the marking [PT].
ru: Поля в соответствующем порядке с их надлежащими описателями формата B<scanf>(3) перечислены ниже. Корректность информации в этих полях управляется проверкой режима доступа ptrace B<PTRACE_MODE_READ_FSCREDS>\ |\ B<PTRACE_MODE_NOAUDIT> (описана в B<ptrace>(2)). Если проверкой доступ запрещён, то значение поля показывается как 0. Затронутые поля отмечены [PT].

source: The process ID.
ru: Идентификатор процесса.

source: The filename of the executable, in parentheses. This is visible whether or not the executable is swapped out.
ru: Имя исполняемого файла в круглых скобках. Его можно увидеть независимо от того, находится ли исполняемый файл в подкачке или нет.

source: One of the following characters, indicating process state:
ru: Один из следующих символов, описывающих состояние процесса:

source: Running
ru: Выполняется

source: Sleeping in an interruptible wait
ru: Спит, ожидая прерывания

source: Waiting in uninterruptible disk sleep
ru: Ожидает в сне, непрерываемом диском

source: Zombie
ru: Зомби

source: Stopped (on a signal) or (before Linux 2.6.33) trace stopped
ru: Остановлен (по сигналу) или остановлен из-за трассировки (до Linux 2.6.33)

source: Tracing stop (Linux 2.6.33 onward)
ru: Остановлен из-за трассировки (после Linux 2.6.33)

source: Paging (only before Linux 2.6.0)
ru: Происходит замещение страниц (только до Linux 2.6.0)

source: Dead (from Linux 2.6.0 onward)
ru: Мёртв (с Linux 2.6.0)

source: Dead (Linux 2.6.33 to 3.13 only)
ru: Мёртв (только в Linux 2.6.33 по 3.13)

source: Wakekill (Linux 2.6.33 to 3.13 only)
ru: Пробудился, чтобы умереть (только в Linux 2.6.33 по 3.13)

source: Waking (Linux 2.6.33 to 3.13 only)
ru: Пробуждается (только в Linux 2.6.33 по 3.13)

source: Parked (Linux 3.9 to 3.13 only)
ru: Припаркован (только в Linux 3.9 по 3.13)

source: The PID of the parent of this process.
ru: Идентификатор (PID) родителя данного процесса.

source: The process group ID of the process.
ru: Идентификатор группы процесса.

source: The session ID of the process.
ru: Идентификатор сеанса процесса.

source: The controlling terminal of the process. (The minor device number is contained in the combination of bits 31 to 20 and 7 to 0; the major device number is in bits 15 to 8.)
ru: Управляющий терминал процесса (младший номер устройства определяется сочетанием бит: c 31 по 20 и с 7 по 0; старший номер устройства расположен в битах с 15 по 8).

source: The ID of the foreground process group of the controlling terminal of the process.
ru: Идентификатор группы процесса, которая в настоящий момент владеет управляющим терминалом, к которому подключён данный процесс.

source: The kernel flags word of the process. For bit meanings, see the PF_* defines in the Linux kernel source file I<include/linux/sched.h>. Details depend on the kernel version.
ru: Слово флагов процесса в ядре. Назначение бит определено макросами PF_* в файле I<include/linux/sched.h> исходного ядра Linux. Смысл бит зависит от версии ядра.

source: The format for this field was %lu before Linux 2.6.
ru: Формат данного поля был %lu до Linux 2.6.

source: The number of minor faults the process has made which have not required loading a memory page from disk.
ru: Количество незначительных промахов процесса, которые не потребовали загрузки страницы памяти с диска.

source: The number of minor faults that the process's waited-for children have made.
ru: Количество незначительных промахов процесса, которые возникли при ожидании окончания работы процессов-потомков.

source: The number of major faults the process has made which have required loading a memory page from disk.
ru: Количество значительных промахов процесса, которые потребовали загрузки страницы памяти с диска.

source: The number of major faults that the process's waited-for children have made.
ru: Количество значительных промахов процесса, которые возникли при ожидании окончания работы процессов-потомков.

source: Amount of time that this process has been scheduled in user mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>). This includes guest time, I<guest_time> (time spent running a virtual CPU, see below), so that applications that are not aware of the guest time field do not lose that time from their calculations.
ru: Количество времени, которое было запланировано для работы процесса в пользовательском режиме, измеряется в тиках (поделённое на I<sysconf(_SC_CLK_TCK)>). Сюда включено гостевое время, I<guest_time> (время, потраченное на работу виртуального ЦП, см. далее), так что приложения, которые не учитывают гостевое поле, не потеряют его при вычислениях.

source: Amount of time that this process has been scheduled in kernel mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>).
ru: Количество времени, которое было запланировано для работы процесса в режиме ядра, измеряется в тиках (поделённое на I<sysconf(_SC_CLK_TCK)>).

source: Amount of time that this process's waited-for children have been scheduled in user mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>). (See also B<times>(2).) This includes guest time, I<cguest_time> (time spent running a virtual CPU, see below).
ru: Количество времени, которое было запланировано для работы процесса в пользовательском режиме для ожидания окончания работы процессов-потомков, измеряется в тиках (поделённое на I<sysconf(_SC_CLK_TCK)> (см). также B<times>(2)). Сюда включено гостевое время, I<cguest_time> (время, потраченное на работу виртуального ЦП, см. далее).

source: Amount of time that this process's waited-for children have been scheduled in kernel mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>).
ru: Количество времени, которое было запланировано для работы процесса в режиме ядра для ожидания окончания работы процессов-потомков, измеряется в тиках (поделённое на I<sysconf(_SC_CLK_TCK)>).

source: (Explanation for Linux 2.6) For processes running a real-time scheduling policy (I<policy> below; see B<sched_setscheduler>(2)), this is the negated scheduling priority, minus one; that is, a number in the range -2 to -100, corresponding to real-time priorities 1 to 99. For processes running under a non-real-time scheduling policy, this is the raw nice value (B<setpriority>(2)) as represented in the kernel. The kernel stores nice values as numbers in the range 0 (high) to 39 (low), corresponding to the user-visible nice range of -20 to 19.
ru: (Объяснение относится к Linux 2.6) Для процессов, работающих согласно политике планирования в реальном времени (I<policy> далее; см. B<sched_setscheduler>(2)), это значение задаёт приоритет при планировании за вычетом 1; то есть число в диапазоне от -2 до -100 соответствует приоритетам реального времени от 1 до 99. Для процессов, работающих без политики планирования в реальном времени, это не изменённое значение любезности (B<setpriority>(2)) в том же виде в каком оно представлено в ядре. Ядро хранит значения любезности в виде чисел в диапазоне от 0 (высокое) до 39 (низкое), что соответствует диапазону пользователя от -20 до 19.

source: Before Linux 2.6, this was a scaled value based on the scheduler weighting given to this process.
ru: До Linux 2.6 это была пересчитанная величина на основе весов планировщика для определённого процесса.

source: The nice value (see B<setpriority>(2)), a value in the range 19 (low priority) to -20 (high priority).
ru: Значение любезности (смотрите B<setpriority>(2)) задаётся числом в диапазоне от 19(низкий приоритет) до -20 (высокий приоритет).

source: Number of threads in this process (since Linux 2.6). Before kernel 2.6, this field was hard coded to 0 as a placeholder for an earlier removed field.
ru: Количество нитей в этом процессе (начиная с Linux 2.6). До ядер ветви 2.6 это поле всегда имело значение 0 в качестве заменителя ранее удалённых полей.

source: The time in jiffies before the next B<SIGALRM> is sent to the process due to an interval timer. Since kernel 2.6.17, this field is no longer maintained, and is hard coded as 0.
ru: Время в мигах (jiffies) перед следующей посылкой процессу сигнала B<SIGALRM> при срабатывании таймера интервала. Начиная с версии 2.6.17 это поле больше не обновляется и всегда имеет значение 0.

source: The time the process started after system boot. In kernels before Linux 2.6, this value was expressed in jiffies. Since Linux 2.6, the value is expressed in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>).
ru: Время до запуска процесса от момента начальной загрузки системы. В ядрах до Linux 2.6, это значение выражалось в мигах (jiffies). Начиная с Linux 2.6, значение выражается в тиках часов (clock ticks) (поделённое на I<sysconf(_SC_CLK_TCK)>).

source: Virtual memory size in bytes.
ru: Размер виртуальной памяти в байтах.

source: Resident Set Size: number of pages the process has in real memory. This is just the pages which count toward text, data, or stack space. This does not include pages which have not been demand-loaded in, or which are swapped out.
ru: Резидентный размер: количество страниц, которое занимает процесс в реальной памяти. Это только те страницы, которые заняты кодом, данными и пространством стека. Сюда не включаются страницы, которые не были загружены по требованию или которые находятся в пространстве подкачки.

source: Current soft limit in bytes on the rss of the process; see the description of B<RLIMIT_RSS> in B<getrlimit>(2).
ru: Текущее мягкое ограничение rss процесса в байтах; смотрите описание B<RLIMIT_RSS> в B<getrlimit>(2).

source: The address above which program text can run.
ru: Адрес начала сегмента исполняемого кода программы.

source: The address below which program text can run.
ru: Адрес конца сегмента исполняемого кода программы.

source: The address of the start (i.e., bottom) of the stack.
ru: Адрес начала (то есть низ) стека.

source: The current value of ESP (stack pointer), as found in the kernel stack page for the process.
ru: Текущее значение ESP (указателя стека) процесса, хранящееся в странице стека ядра.

source: The current EIP (instruction pointer).
ru: Текущее значение EIP (указатель инструкций).

source: The bitmap of pending signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
ru: Карта ожидающих сигналов, отображается как число в десятичной системе счисления. Устарело, так как не предоставляет информации о сигналах реального времени; вместо неё используйте I</proc/[pid]/status>.

source: The bitmap of blocked signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
ru: Карта блокированных сигналов, отображается как число в десятичной системе счисления. Устарело, так как не предоставляет информации о сигналах реального времени; вместо неё используйте I</proc/[pid]/status>.

source: The bitmap of ignored signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
ru: Карта игнорированных сигналов, отображается как число в десятичной системе счисления. Устарело, так как не предоставляет информации о сигналах реального времени; вместо неё используйте I</proc/[pid]/status>.

source: The bitmap of caught signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
ru: Карта перехваченных сигналов, отображается как число в десятичной системе счисления. Устарело, так как не предоставляет информации о сигналах реального времени; вместо неё используйте I</proc/[pid]/status>.

source: This is the "channel" in which the process is waiting. It is the address of a location in the kernel where the process is sleeping. The corresponding symbolic name can be found in I</proc/[pid]/wchan>.
ru: Это «канал», в котором ожидает процесс. Он является адресом расположения в ядре, где спит процесс. Соответствующее символическое имя можно найти в I</proc/[pid]/wchan>.

source: Number of pages swapped (not maintained).
ru: () Количество страниц в подкачке (не сопровождается).

source: Cumulative I<nswap> for child processes (not maintained).
ru: () Суммарное значение I<nswap> для процессов-потомков (не сопровождается).
