Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Setting a guard size of 0 may be useful to save memory in an application that creates many threads and knows that stack overflow can never occur.
ru: Установка размера защиты в нулевое значение полезно для экономии памяти в приложениях, которые создают много нитей и знают, что переполнение стека никогда не произойдёт.

source: Choosing a guard size larger than the default size may be necessary for detecting stack overflows if a thread allocates large data structures on the stack.
ru: Указание размера защиты больше чем размер по умолчанию может потребоваться для обнаружения переполнений стека при выделении в нити больших структур данных в стеке.

source: As at glibc 2.8, the NPTL threading implementation includes the guard area within the stack size allocation, rather than allocating extra space at the end of the stack, as POSIX.1 requires. (This can result in an B<EINVAL> error from B<pthread_create>(3) if the guard size value is too large, leaving no space for the actual stack.)
ru: В glibc 2.8 реализация нитей NPTL добавляет защитную область к размеру выделяемого стека, а не выделяет дополнительное пространство в конце стека как требуется POSIX.1 (это может приводить к ошибке B<EINVAL> в B<pthread_create>(3), если значение размера защиты слишком большое и не оставляет место именно под стек).

source: The obsolete LinuxThreads implementation did the right thing, allocating extra space at the end of the stack for the guard area.
ru: Устаревшая реализация LinuxThreads делает это правильно, выделяя дополнительное пространство в конце стека под защитную область.

source: See B<pthread_getattr_np>(3).
ru: См. B<pthread_getattr_np>(3).

source: popen, pclose - pipe stream to or from a process
ru: popen, pclose - конвейерный поток в или из процесса

source: _POSIX_C_SOURCE\ E<gt>=\ 2 || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _POSIX_C_SOURCE\ E<gt>=\ 2 || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<popen>() function opens a process by creating a pipe, forking, and invoking the shell. Since a pipe is by definition unidirectional, the I<type> argument may specify only reading or writing, not both; the resulting stream is correspondingly read-only or write-only.
ru: Функция B<popen>() открывает процесс следующим образом: создаёт канал, выполняет fork и вызывает командную оболочку. Так как канал задается однонаправленным, в аргументе I<type> может быть задан один режим: либо чтение либо запись.

source: The I<command> argument is a pointer to a null-terminated string containing a shell command line. This command is passed to I</bin/sh> using the B<-c> flag; interpretation, if any, is performed by the shell.
ru: Аргумент I<command> представляет собой указатель на строку с null в конце, которая содержит командную строку оболочки. Эта команда передаётся в I</bin/sh> с помощью флага B<-c>; все подстановке в ней выполняются оболочкой.

source: The I<type> argument is a pointer to a null-terminated string which must contain either the letter \(aqr\(aq for reading or the letter \(aqw\(aq for writing. Since glibc 2.9, this argument can additionally include the letter \(aqe\(aq, which causes the close-on-exec flag (B<FD_CLOEXEC>) to be set on the underlying file descriptor; see the description of the B<O_CLOEXEC> flag in B<open>(2) for reasons why this may be useful.
ru: Аргумент I<type> представляет собой указатель на строку с null в конце, которая содержит или букву \(aqr\(aq (чтение) или букву \(aqw\(aq (запись). Начиная с glibc 2.9 в этом аргументе также может быть буква \(aqe\(aq, которая указывает на необходимость установки флага закрытия при выполнении (B<FD_CLOEXEC>) в используемом файловом дескрипторе; про полезность флага B<O_CLOEXEC> смотрите в B<open>(2).

source: The return value from B<popen>() is a normal standard I/O stream in all respects save that it must be closed with B<pclose>() rather than B<fclose>(3). Writing to such a stream writes to the standard input of the command; the command's standard output is the same as that of the process that called B<popen>(), unless this is altered by the command itself. Conversely, reading from the stream reads the command's standard output, and the command's standard input is the same as that of the process that called B<popen>().
ru: Возвращаемое B<popen>() значение является стандартным потоком ввода-вывода, за исключением того, что его нужно закрывать с помощью B<pclose>(), а не B<fclose>(3). Запись в такой поток выполняет запись в стандартный поток ввода команды; стандартного потока вывода команды тот же, что и у процесса, вызвавшего B<popen>(), если он не был изменён самой командой. При чтении из потока выполняется чтение из стандартного потока вывода команды, а стандартный поток ввода тот же, что и у процесса, вызвавшего B<popen>(), если он не был изменён самой командой.

source: Note that output B<popen>() streams are block buffered by default.
ru: Заметим, что потоки вывода B<popen>() по умолчанию блокируемые и буферизированные.

source: The B<pclose>() function waits for the associated process to terminate and returns the exit status of the command as returned by B<wait4>(2).
ru: Функция B<pclose>() ожидает завершения ассоциированного процесса и возвращает код выхода команды, возвращаемый функцией B<wait4>(2).

source: B<popen>(): on success, returns a pointer to an open stream that can be used to read or write to the pipe; if the B<fork>(2) or B<pipe>(2) calls fail, or if the function cannot allocate memory, NULL is returned.
ru: B<popen>(): при успешном выполнении возвращается указатель на открытый поток, его можно использовать для чтения или записи в канал; если вызов B<fork>(2) или B<pipe>(2) завершается с ошибкой или если функция не может выделить память, то возвращается NULL.

source: B<pclose>(): on success, returns the exit status of the command; if B<wait4>(2) returns an error, or some other error is detected, -1 is returned.
ru: B<pclose>(): при успешном выполнении возвращает код завершения команды; если B<wait4>(2) возвращает ошибку или возникает какая-то другая ошибка, то возвращается -1.

source: Both functions set I<errno> to an appropriate value in the case of an error.
ru: Обе функции записывают в I<errno> соответствующее значение ошибки.

source: The B<popen>() function does not set I<errno> if memory allocation fails. If the underlying B<fork>(2) or B<pipe>(2) fails, I<errno> is set appropriately. If the I<type> argument is invalid, and this condition is detected, I<errno> is set to B<EINVAL>.
ru: Функция B<popen>() не изменяет I<errno>, если не удалось выделить память. Если завершаются с ошибкой вызовы B<fork>(2) или B<pipe>(2), то в I<errno> содержится номер ошибки. Если значение I<type> некорректно и это обнаружено, то I<errno> присваивается B<EINVAL>.

source: If B<pclose>() cannot obtain the child status, I<errno> is set to B<ECHILD>.
ru: Если B<pclose>() не удаётся получить код выхода потомка, то I<errno> присваивается B<ECHILD>.

source: The \(aqe\(aq value for I<type> is a Linux extension.
ru: Значение \(aqe\(aq для I<type> есть только в Linux.

source: B<Note>: carefully read Caveats in B<system>(3).
ru: B<Примечание>: внимательно прочитайте ЗАМЕЧАНИЯ в B<system>(3).

source: Since the standard input of a command opened for reading shares its seek offset with the process that called B<popen>(), if the original process has done a buffered read, the command's input position may not be as expected. Similarly, the output from a command opened for writing may become intermingled with that of the original process. The latter can be avoided by calling B<fflush>(3) before B<popen>().
ru: Так как смещение поиска у открытого для чтения стандартного ввода команды доступным процессу, вызвавшему B<popen>(), и исходный процесс выполнял буферное чтение, то позиция ввода команды может быть не той, что ожидается. Подобным образом, вывод из команды, открытой на запись, может будет спутан с выводом из исходного процесса. Последнего можно избежать, если вызывать B<fflush>(3) перед B<popen>().

source: Failure to execute the shell is indistinguishable from the shell's failure to execute command, or an immediate exit of the command. The only hint is an exit status of 127.
ru: Ошибка при попытке запуска оболочки неотличима от ошибки оболочки при попытке запуска программы или от ошибки при немедленном выходе команды. Единственное отличие это код выхода 127.

source: pthread_create - create a new thread
ru: pthread_create - создаёт новую нить

source: The B<pthread_create>() function starts a new thread in the calling process. The new thread starts execution by invoking I<start_routine>(); I<arg> is passed as the sole argument of I<start_routine>().
ru: Функция B<pthread_create>() запускает новую нить в вызвавшем процессе. Новая нить начинает выполнение вызовом I<start_routine>(); значение I<arg> является единственным аргументом I<start_routine>().

source: The new thread terminates in one of the following ways:
ru: Новая нить завершает работу в одном из следующих случаев:

source: It calls B<pthread_exit>(3), specifying an exit status value that is available to another thread in the same process that calls B<pthread_join>(3).
ru: Она вызывает B<pthread_exit>(3), указывая код выхода, доступное другой нити в том же процессе, вызвавшей B<pthread_join>(3).

source: It returns from I<start_routine>(). This is equivalent to calling B<pthread_exit>(3) with the value supplied in the I<return> statement.
ru: При возврате из I<start_routine>(). Это эквивалентно вызову B<pthread_exit>(3) со значением, переданным в операторе I<return>.

source: It is canceled (see B<pthread_cancel>(3)).
ru: При её отмене (смотрите B<pthread_cancel>(3)).

source: Any of the threads in the process calls B<exit>(3), or the main thread performs a return from I<main>(). This causes the termination of all threads in the process.
ru: При вызове из любой нити процесса функции B<exit>(3), или если главная нить выполняет возврат из I<main>(). Это вызывает завершение всех нитей процесса.

source: The I<attr> argument points to a I<pthread_attr_t> structure whose contents are used at thread creation time to determine attributes for the new thread; this structure is initialized using B<pthread_attr_init>(3) and related functions. If I<attr> is NULL, then the thread is created with default attributes.
ru: Аргумент I<attr> указывает на структуру I<pthread_attr_t>, чьё содержимое используется при создании нити для определения атрибутов новой нити; эта структура инициализируется с помощью B<pthread_attr_init>(3) и подобными функциями. Если значение I<attr> равно NULL, то нити создаётся с атрибутами по умолчанию.

source: Before returning, a successful call to B<pthread_create>() stores the ID of the new thread in the buffer pointed to by I<thread>; this identifier is used to refer to the thread in subsequent calls to other pthreads functions.
ru: Перед возвратом успешный вызов B<pthread_create>() сохраняет ID новой нити в буфер, на который указывает I<thread>; этот идентификатор используется для ссылки на нить в последующих вызовах других функций pthreads.

source: The new thread inherits a copy of the creating thread's signal mask (B<pthread_sigmask>(3)). The set of pending signals for the new thread is empty (B<sigpending>(2)). The new thread does not inherit the creating thread's alternate signal stack (B<sigaltstack>(2)).
ru: Новая нить наследует копию сигнальной маски создавшей нити (B<pthread_sigmask>(3)). Набор ожидающих сигналов новой нити пуст (B<sigpending>(2)). Новая нить не наследует альтернативный стек сигналов создавшей нити (B<sigaltstack>(2)).

source: The new thread inherits the calling thread's floating-point environment (B<fenv>(3)).
ru: Новая нить наследует окружение плавающей запятой вызвавшей нити (B<fenv>(3)).

source: The initial value of the new thread's CPU-time clock is 0 (see B<pthread_getcpuclockid>(3)).
ru: Начальное значение часов ЦП новой нити равно 0 (смотрите B<pthread_getcpuclockid>(3)).

source: Linux-specific details
ru: Информация, касающаяся только Linux

source: The new thread inherits copies of the calling thread's capability sets (see B<capabilities>(7)) and CPU affinity mask (see B<sched_setaffinity>(2)).
ru: Новая нить наследует копию набора мандатов вызвавшей нити (смотрите B<capabilities>(7)) и маску увязывания ЦП (смотрите B<sched_setaffinity>(2)).

source: On success, B<pthread_create>() returns 0; on error, it returns an error number, and the contents of I<*thread> are undefined.
ru: При успешном выполнении B<pthread_create>() возвращается 0; при ошибке возвращается номер ошибки, а содержимое I<*thread> не определено.

source: Insufficient resources to create another thread.
ru: Недостаточно ресурсов для создания другой нити.

source: A system-imposed limit on the number of threads was encountered. There are a number of limits that may trigger this error: the B<RLIMIT_NPROC> soft resource limit (set via B<setrlimit>(2)), which limits the number of processes and threads for a real user ID, was reached; the kernel's system-wide limit on the number of processes and threads, I</proc/sys/kernel/threads-max>, was reached (see B<proc>(5)); or the maximum number of PIDs, I</proc/sys/kernel/pid_max>, was reached (see B<proc>(5)).
ru: Возникло системного ограничение на количество нитей. Есть несколько ограничений, которые могут вызвать эту ошибку: был достигнут мягкий ограничитель B<RLIMIT_NPROC> (задаётся с помощью B<setrlimit>(2)), который ограничивает количество процессов и ните для реального ID пользователя; был достигнут ядерный системный ограничитель на количество процессов и нитей, I</proc/sys/kernel/threads-max> (смотрите B<proc>(5)); был достигнуто максимальное количество PID, I</proc/sys/kernel/pid_max> (смотрите B<proc>(5)).

source: Invalid settings in I<attr>.
ru: Некорректные значения в I<attr>.

source: No permission to set the scheduling policy and parameters specified in I<attr>.
ru: Нет прав на изменение алгоритма планирования и параметров, указанных в I<attr>.

source: See B<pthread_self>(3) for further information on the thread ID returned in I<*thread> by B<pthread_create>(). Unless real-time scheduling policies are being employed, after a call to B<pthread_create>(), it is indeterminate which thread\(emthe caller or the new thread\(emwill next execute.
ru: Дополнительную информацию об идентификаторе нити, возвращаемом B<pthread_create>() в I<*thread> смотрите в B<pthread_self>(3). Если не используются алгоритмы планирования реального времени после вызова B<pthread_create>() невозможно сказать какая нить — создавшая или новая — будет выполняться далее первой.

source: A thread may either be I<joinable> or I<detached>. If a thread is joinable, then another thread can call B<pthread_join>(3) to wait for the thread to terminate and fetch its exit status. Only when a terminated joinable thread has been joined are the last of its resources released back to the system. When a detached thread terminates, its resources are automatically released back to the system: it is not possible to join with the thread in order to obtain its exit status. Making a thread detached is useful for some types of daemon threads whose exit status the application does not need to care about. By default, a new thread is created in a joinable state, unless I<attr> was set to create the thread in a detached state (using B<pthread_attr_setdetachstate>(3)).
ru: Нить может быть I<присоединяема> (joinable) или I<отключённой> (detached). Если нить присоединяема, то другая нить может вызвать B<pthread_join>(3) для ожидания завершения нити и получения её кода выхода. Освобождение ресурсов обратно в систему у завершённой присоединяемой нити происходит только после её присоединения. При завершении отключённой нити, её ресурсы автоматически освобождаются обратно в систему: к ней невозможно присоединиться для получения её кода выхода. Создание отключённых нитей полезно в некоторых типах служебных нитей, чей код выхода не нужен приложению. По умолчанию новая нить создаётся в присоединяемом состоянии, если в I<attr> не указано создание нити в отключённом состоянии (с помощью B<pthread_attr_setdetachstate>(3)).

source: Under the NPTL threading implementation, if the B<RLIMIT_STACK> soft resource limit I<at the time the program started> has any value other than "unlimited", then it determines the default stack size of new threads. Using B<pthread_attr_setstacksize>(3), the stack size attribute can be explicitly set in the I<attr> argument used to create a thread, in order to obtain a stack size other than the default. If the B<RLIMIT_STACK> resource limit is set to "unlimited", a per-architecture value is used for the stack size. Here is the value for a few architectures:
ru: В реализации нитей NPTL, если мягкое ограничение ресурса B<RLIMIT_STACK> I<в момент запуска программы> не равно «unlimited», то им задаётся размер стека по умолчанию для новых нитей. Чтобы получить размер стека, отличный от умолчательного при создании новой нити, можно изменить атрибут размера стека в аргументе I<attr> с помощью B<pthread_attr_setstacksize>(3). Если ресурс B<RLIMIT_STACK> равен «unlimited», то для размера используется значение, определённое для архитектуры. Вот значения для некоторых архитектур:

source: Architecture
ru: Архитектура

source: Default stack size
ru: Размер стека умолчанию

source: 2 MB
ru: 2 МБ

source: 32 MB
ru: 32 МБ

source: 4 MB
ru: 4 МБ

source: In the obsolete LinuxThreads implementation, each of the threads in a process has a different process ID. This is in violation of the POSIX threads specification, and is the source of many other nonconformances to the standard; see B<pthreads>(7).
ru: В устаревшей реализации LinuxThreads каждая нить процесса имеет свой неодинаковый ID процесса. Это нарушает спецификацию нитей POSIX и является источником многих других несоответствий стандарту; смотрите B<pthreads>(7).

source: The program below demonstrates the use of B<pthread_create>(), as well as a number of other functions in the pthreads API.
ru: Представленная ниже программа показывает использование B<pthread_create>(), а также других функций программного интерфейса pthreads.

source: In the following run, on a system providing the NPTL threading implementation, the stack size defaults to the value given by the "stack size" resource limit:
ru: В этом сеансе в системе с реализацией нитей NPTL размер стека по умолчанию берётся из значения ограничения ресурса на «размер стека»:

source: $B< ulimit -s> 8192 # The stack size limit is 8 MB (0x800000 bytes) $B< ./a.out hola salut servus> Thread 1: top of stack near 0xb7dd03b8; argv_string=hola Thread 2: top of stack near 0xb75cf3b8; argv_string=salut Thread 3: top of stack near 0xb6dce3b8; argv_string=servus Joined with thread 1; returned value was HOLA Joined with thread 2; returned value was SALUT Joined with thread 3; returned value was SERVUS
ru: $B< ulimit -s> 8192 # ограничение на размер стека 8 МБ (0x800000 байт) $B< ./a.out hola salut servus> Нить 1: вершина стека около 0xb7dd03b8; argv_string=hola Нить 2: вершина стека около 0xb75cf3b8; argv_string=salut Нить 3: вершина стека около 0xb6dce3b8; argv_string=servus Присоединение нити 1; получено значение возврата HOLA Присоединение нити 2; получено значение возврата SALUT Присоединение нити 3; получено значение возврата SERVUS

source: In the next run, the program explicitly sets a stack size of 1\ MB (using B<pthread_attr_setstacksize>(3)) for the created threads:
ru: В этом сеансе программа явно устанавливает размер стека в 1\ МБ (с помощью B<pthread_attr_setstacksize>(3)) для создаваемых нитей:

source: $B< ./a.out -s 0x100000 hola salut servus> Thread 1: top of stack near 0xb7d723b8; argv_string=hola Thread 2: top of stack near 0xb7c713b8; argv_string=salut Thread 3: top of stack near 0xb7b703b8; argv_string=servus Joined with thread 1; returned value was HOLA Joined with thread 2; returned value was SALUT Joined with thread 3; returned value was SERVUS
ru: $B< ./a.out -s 0x100000 hola salut servus> Нить 1: вершина стека около 0xb7d723b8; argv_string=hola Нить 2: вершина стека около 0xb7c713b8; argv_string=salut Нить 3: вершина стека около 0xb7b703b8; argv_string=servus Присоединение нити 1; получено значение возврата HOLA Присоединение нити 2; получено значение возврата SALUT Присоединение нити 3; получено значение возврата SERVUS

source: struct thread_info { /* Used as argument to thread_start() */ pthread_t thread_id; /* ID returned by pthread_create() */ int thread_num; /* Application-defined thread # */ char *argv_string; /* From command-line argument */ };
ru: struct thread_info { /* используется как аргумент thread_start() */ pthread_t thread_id; /* ID, полученный от pthread_create() */ int thread_num; /* номер нити, определяемый приложением */ char *argv_string; /* аргумент из командой строки */ };

source: /* Thread start function: display address near top of our stack, and return upper-cased copy of argv_string */
ru: /* Начальная функция нити: показывает адрес около вершины нашего стека, и возвращает копию argv_string заглавными буквами */

source: printf("Thread %d: top of stack near %p; argv_string=%s\en", tinfo-E<gt>thread_num, &p, tinfo-E<gt>argv_string);
ru: printf("Нить %d: вершина стека около %p; argv_string=%s\en", tinfo-E<gt>thread_num, &p, tinfo-E<gt>argv_string);

source: /* The "-s" option specifies a stack size for our threads */
ru: /* Параметром «-s» определяется размер стека в наших нитях */

source: default: fprintf(stderr, "Usage: %s [-s stack-size] arg...\en", argv[0]); exit(EXIT_FAILURE); } }
ru: default: fprintf(stderr, "Исп.: %s [-s размер стека] арг...\en", argv[0]); exit(EXIT_FAILURE); } }

source: /* Initialize thread creation attributes */
ru: /* инициализация атрибутов создания нити */

source: /* Allocate memory for pthread_create() arguments */
ru: /* выделение памяти для аргументов pthread_create() */

source: /* Create one thread for each command-line argument */
ru: /* создание по одной нити на каждый аргумент командной строки */

source: /* The pthread_create() call stores the thread ID into corresponding element of tinfo[] */
ru: /* вызов pthread_create() сохраняет ID нити в соответствующий элемент tinfo[] */

source: /* Destroy the thread attributes object, since it is no longer needed */
ru: /* уничтожение объекта атрибутов нити, так как он больше не нужен */

source: /* Now join with each thread, and display its returned value */
ru: /* теперь присоединяем каждую нить и показываем значение, возвращённое ею */

source: printf("Joined with thread %d; returned value was %s\en", tinfo[tnum].thread_num, (char *) res); free(res); /* Free memory allocated by thread */ }
ru: printf("Присоединение нити %d; получено значение возврата %s\en", tinfo[tnum].thread_num, (char *) res); free(res); /* освобождаем память, выделенную нитью */ }

source: pthread_attr_setdetachstate, pthread_attr_getdetachstate - set/get detach state attribute in thread attributes object
ru: pthread_attr_setdetachstate, pthread_attr_getdetachstate - изменяет/возвращает из объекта атрибутов нити атрибут отключённости

source: The B<pthread_attr_setdetachstate>() function sets the detach state attribute of the thread attributes object referred to by I<attr> to the value specified in I<detachstate>. The detach state attribute determines whether a thread created using the thread attributes object I<attr> will be created in a joinable or a detached state.
ru: Функция B<pthread_attr_setdetachstate>() изменяет атрибут состояния отключённости у объекта атрибутов нити, на который указывает I<attr>, на значение, заданное в I<detachstate>. Атрибутом состояния отключённости определяется, будет ли нить, созданная с объектом атрибутов нити I<attr>, находиться в присоединяемом или отключённом состоянии.
