Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Permission to access this file is governed by a ptrace access mode B<PTRACE_MODE_ATTACH_FSCREDS> check; see B<ptrace>(2).
ru: Право доступа к этому файлу определяется проверкой режима доступа ptrace B<PTRACE_MODE_ATTACH_FSCREDS>; смотрите B<ptrace>(2).

source: I</proc/[pid]/mountinfo> (since Linux 2.6.26)
ru: I</proc/[pid]/mountinfo> (начиная с Linux 2.6.26)

source: This file contains information about mount points in the process's mount namespace (see B<mount_namespaces>(7)). It supplies various information (e.g., propagation state, root of mount for bind mounts, identifier for each mount and its parent) that is missing from the (older) I</proc/[pid]/mounts> file, and fixes various other problems with that file (e.g., nonextensibility, failure to distinguish per-mount versus per-superblock options).
ru: В этом файле содержится информация о точках монтирования в пространстве имён монтирования процесса (смотрите B<mount_namespaces>(7)). Здесь представлена различная информация (например, состояние распространения, корень монтирования для привязок монтирования, идентификатор каждого монтирования и его родитель), которой нет в (старом) файле I</proc/[pid]/mounts>, и исправлены различные проблемы этого файла (например, непродолжаемость, невозможность различить параметры конкретного монтирования и суперблока).

source: The file contains lines of the form:
ru: В этом файле содержатся строки в следующем формате:

source: The numbers in parentheses are labels for the descriptions below:
ru: Описания полей (номер представлен в скобках):

source: mount ID: a unique ID for the mount (may be reused after B<umount>(2)).
ru: ID монтирования: уникальный идентификатор монтирования (может использоваться повторно после B<umount>(2)).

source: parent ID: the ID of the parent mount (or of self for the root of this mount namespace's mount tree).
ru: родительский ID: ID родительского монтирования (или самого себя, для корня дерева монтирования).

source: If a new mount is stacked on top of a previous existing mount (so that it hides the existing mount) at pathname P, then the parent of the new mount is the previous mount at that location. Thus, when looking at all the mounts stacked at a particular location, the top-most mount is the one that is not the parent of any other mount at the same location. (Note, however, that this top-most mount will be accessible only if the longest path subprefix of P that is a mount point is not itself hidden by a stacked mount.)
ru: Если новая точка монтирования накладывается поверх существующей точки монтирования (таким образ скрывая её) hides the existing mount) с путём P, то родитель новой точки монтирования равен предыдущей точке монтирования в этом расположении. То есть, если смотреть все точки монтирования наложенные на определённое расположение, то самой верхней точкой монтирования будет та, которая не является родителем каких-либо других точек монтирования в том же расположении (однако заметим, что это верхняя точка монтирования будет доступна только, если самый длинный подпрефикс пути P, являющийся точкой монтирования, сам не будет скрыт наложенным монтированием).

source: If the parent mount point lies outside the process's root directory (see B<chroot>(2)), the ID shown here won't have a corresponding record in I<mountinfo> whose mount ID (field 1) matches this parent mount ID (because mount points that lie outside the process's root directory are not shown in I<mountinfo>). As a special case of this point, the process's root mount point may have a parent mount (for the initramfs filesystem) that lies outside the process's root directory, and an entry for that mount point will not appear in I<mountinfo>.
ru: Если родительская точка монтирования находится вне корневого каталога процесса (смотрите B<chroot>(2)), то ID, показываемый здесь, не имеет соответствующей записи в I<mountinfo>, ID монтирования которого (1 поле) совпадает с этим ID родительского монтирования (так как точки монтирования, находящиеся вне корневого каталога процесса не показываются в I<mountinfo>). Исключением является точка монтирования корня процесса, у неё родительское монтирование (для файловой системы initramfs) располагается вне корневого каталога процесса и запись об этой точке монтирования отсутствует в I<mountinfo>.

source: major:minor: the value of I<st_dev> for files on this filesystem (see B<stat>(2)).
ru: старший:младший: значение I<st_dev> для файлов в этой файловой системе (смотрите B<stat>(2)).

source: root: the pathname of the directory in the filesystem which forms the root of this mount.
ru: корень: путь к каталогу в файловой системе, с которого начинается корень данного монтирования.

source: mount point: the pathname of the mount point relative to the process's root directory.
ru: точка монтирования: путь точки монтирования относительно корневого каталога процесса.

source: mount options: per-mount options (see B<mount>(2)).
ru: параметры монтирования: параметры конкретного монтирования (смотрите B<mount>(2)).

source: optional fields: zero or more fields of the form "tag[:value]"; see below.
ru: необязательные поля: ноль или более полей в виде «метка[:значение]»; смотрите далее.

source: separator: the end of the optional fields is marked by a single hyphen.
ru: разделитель: конец необязательных полей отмечается одиночным символом переноса.

source: filesystem type: the filesystem type in the form "type[.subtype]".
ru: тип файловой системы: тип файловой системы в виде «тип[.подтип]».

source: mount source: filesystem-specific information or "none".
ru: источник монтирования: информация, специфичная для файловой системы или «none».

source: super options: per-superblock options (see B<mount>(2)).
ru: параметры суперблока: параметры конкретного суперблока (смотрите B<mount>(2)).

source: Currently, the possible optional fields are I<shared>, I<master>, I<propagate_from>, and I<unbindable>. See B<mount_namespaces>(7) for a description of these fields. Parsers should ignore all unrecognized optional fields.
ru: Возможные необязательные поля на данный момент: I<shared>, I<master>, I<propagate_from> и I<unbindable>. Описание этих полей смотрите в B<mount_namespaces>(7). Анализаторы должны игнорировать все неизвестные необязательные поля.

source: For more information on mount propagation see: I<Documentation/filesystems/sharedsubtree.txt> in the Linux kernel source tree.
ru: Подробней о концепции распространения монтирования смотрите в исходном коде ядра Linux в файле I<Documentation/filesystems/sharedsubtree.txt>.

source: I</proc/[pid]/mounts> (since Linux 2.4.19)
ru: I</proc/[pid]/mounts> (начиная с Linux 2.4.19)

source: This file lists all the filesystems currently mounted in the process's mount namespace (see B<mount_namespaces>(7)). The format of this file is documented in B<fstab>(5).
ru: Этот файл содержит список всех файловых систем, смонтированных в пространстве имён монтирования процесса в данный момент (смотрите B<mount_namespaces>(7)). Формат этого файл описан в B<fstab>(5).

source: Since kernel version 2.6.15, this file is pollable: after opening the file for reading, a change in this file (i.e., a filesystem mount or unmount) causes B<select>(2) to mark the file descriptor as having an exceptional condition, and B<poll>(2) and B<epoll_wait>(2) mark the file as having a priority event (B<POLLPRI>). (Before Linux 2.6.30, a change in this file was indicated by the file descriptor being marked as readable for B<select>(2), and being marked as having an error condition for B<poll>(2) and B<epoll_wait>(2).)
ru: Начиная с ядра версии 2.6.15 этот файл можно опрашивать: после открытия файла на чтение, изменение в этом файле (т. е., монтирование или размонтирование файловой системы) заставляют B<select>(2) помечать файловый дескриптор как имеющий исключительное условие, а B<poll>(2) и B<epoll_wait>(2) помечают файл как имеющий приоритетное событие (B<POLLPRI>) (до Linux 2.6.30, изменение этого файла отражались на файловом дескрипторе с помощью отметки как читаемого для B<select>(2) и имеющего условие ошибки для B<poll>(2) и B<epoll_wait>(2)).

source: I</proc/[pid]/mountstats> (since Linux 2.6.17)
ru: I</proc/[pid]/mountstats> (начиная с Linux 2.6.17)

source: This file exports information (statistics, configuration information) about the mount points in the process's mount namespace (see B<mount_namespaces>(7)). Lines in this file have the form:
ru: В этом файле содержится информация (статистика, информация о настройке) о точках монтирования в пространстве имён монтирования процесса (смотрите B<mount_namespaces>(7)). Формат строк в файле:

source: The fields in each line are:
ru: Поля каждой строки:

source: The name of the mounted device (or "nodevice" if there is no corresponding device).
ru: Имя смонтированного устройства (или "nodevice", если нет соответствующего устройства).

source: The mount point within the filesystem tree.
ru: Точка монтирования в дереве файловой системы.

source: The filesystem type.
ru: Тип файловой системы.

source: Optional statistics and configuration information. Currently (as at Linux 2.6.26), only NFS filesystems export information via this field.
ru: Необязательная статистика и информация о настройке. В настоящее время (Linux версии 2.6.26), в этом поле доступна только информация об экспортируемых файловых системах NFS.

source: This file is readable only by the owner of the process.
ru: Данный файл доступен на чтение только владельцу процесса.

source: I</proc/[pid]/net> (since Linux 2.6.25)
ru: I</proc/[pid]/net> (начиная с Linux 2.6.25)

source: See the description of I</proc/net>.
ru: Смотрите описание I</proc/net>.

source: I</proc/[pid]/ns/> (since Linux 3.0)
ru: I</proc/[pid]/ns/> (начиная с Linux 3.0)

source: This is a subdirectory containing one entry for each namespace that supports being manipulated by B<setns>(2). For more information, see B<namespaces>(7).
ru: В этом подкаталоге содержится по одной записи на каждое пространство имён, для которых в B<setns>(2) есть поддержка изменений. Дополнительную информацию смотрите в B<namespaces>(7).

source: I</proc/[pid]/numa_maps> (since Linux 2.6.14)
ru: I</proc/[pid]/numa_maps> (начиная с Linux 2.6.14)

source: See B<numa>(7).
ru: Смотрите B<numa>(7).

source: I</proc/[pid]/oom_adj> (since Linux 2.6.11)
ru: I</proc/[pid]/oom_adj> (начиная с Linux 2.6.11)

source: This file can be used to adjust the score used to select which process should be killed in an out-of-memory (OOM) situation. The kernel uses this value for a bit-shift operation of the process's I<oom_score> value: valid values are in the range -16 to +15, plus the special value -17, which disables OOM-killing altogether for this process. A positive score increases the likelihood of this process being killed by the OOM-killer; a negative score decreases the likelihood.
ru: Этот файл может использоваться для подгонки оценки, используемой при выборе процесса, который нужно завершить при нехватке памяти (OOM). Ядро использует это значение в операции побитового сдвига значения I<oom_score> у процесса: допустимые находятся в диапазоне от -16 до +15, плюс специальное значение -17, которое отключает OOM-завершение для этого процесса совсем. Положительная оценка увеличивает вероятность, что процесс будет завершён OOM-killer; отрицательная оценка уменьшает вероятность.

source: The default value for this file is 0; a new process inherits its parent's I<oom_adj> setting. A process must be privileged (B<CAP_SYS_RESOURCE>) to update this file.
ru: Значение по умолчанию в этом файле равно 0; новый процесс наследует его от родительского значения I<oom_adj>. Для изменения этого файла процесс должен иметь мандат B<CAP_SYS_RESOURCE>.

source: Since Linux 2.6.36, use of this file is deprecated in favor of I</proc/[pid]/oom_score_adj>.
ru: Начиная с Linux 2.6.36, вместо этого файла рекомендуется использовать I</proc/[pid]/oom_score_adj>.

source: I</proc/[pid]/oom_score> (since Linux 2.6.11)
ru: I</proc/[pid]/oom_score> (начиная с Linux 2.6.11)

source: This file displays the current score that the kernel gives to this process for the purpose of selecting a process for the OOM-killer. A higher score means that the process is more likely to be selected by the OOM-killer. The basis for this score is the amount of memory used by the process, with increases (+) or decreases (-) for factors including:
ru: Этот файл содержит текущую оценку, которую ядро назначило процессу, учитывающуюся при избрании процесса OOM-killer. Более высокая оценка означает, что у процесса есть больше шансов быть выбранным OOM-killer. Основой оценки является количество памяти используемой процессом и различные увеличивающие (+) и уменьшающие (-) факторы:

source: whether the process is privileged (-).
ru: считается ли процесс привилегированным (-).

source: Before kernel 2.6.36 the following factors were also used in the calculation of oom_score:
ru: До ядра 2.6.36 при вычислении oom_score также используются следующие факторы:

source: whether the process creates a lot of children using B<fork>(2) (+);
ru: создавал ли процесс много потомков с помощью B<fork>(2) (+);

source: whether the process has been running a long time, or has used a lot of CPU time (-);
ru: долго ли работал процесс, или использовал много процессорного времени (-);

source: whether the process has a low nice value (i.e., E<gt> 0) (+); and
ru: имеет ли процесс низкое значение уступчивости (nice) (т. е., E<gt> 0) (+); и

source: whether the process is making direct hardware access (-).
ru: обращается ли процесс к аппаратному обеспечению напрямую (-).

source: The I<oom_score> also reflects the adjustment specified by the I<oom_score_adj> or I<oom_adj> setting for the process.
ru: Значение I<oom_score> также отражает подгонку смещения, указанную в I<oom_score_adj> или I<oom_adj> процесса.

source: I</proc/[pid]/oom_score_adj> (since Linux 2.6.36)
ru: I</proc/[pid]/oom_score_adj> (начиная с Linux 2.6.36)

source: This file can be used to adjust the badness heuristic used to select which process gets killed in out-of-memory conditions.
ru: Этот файл может использоваться для подгонки оценки вредности для выбора процесса, который нужно завершить при нехватке памяти.

source: The badness heuristic assigns a value to each candidate task ranging from 0 (never kill) to 1000 (always kill) to determine which process is targeted. The units are roughly a proportion along that range of allowed memory the process may allocate from, based on an estimation of its current memory and swap use. For example, if a task is using all allowed memory, its badness score will be 1000. If it is using half of its allowed memory, its score will be 500.
ru: Значение оценки вредности назначается каждой задаче-кандидату от 0 (никогда не завершать) до 1000 (всегда завершать), которым определяется какой процесс будет выбран. Единицы примерно пропорциональны диапазону разрешённой памяти, которую может запросить процесс, на основе вычисления его текущей памяти и использованию подкачки.Например, если задача использует всю разрешённую память, то значение вредности будет равно 1000. Если процесс использует половину разрешённой памяти, то значение будет 500.

source: There is an additional factor included in the badness score: root processes are given 3% extra memory over other tasks.
ru: Есть дополнительный фактор, учитывающийся для вредности: процессам root даётся на 3% больше памяти, чем другим задачам.

source: The amount of "allowed" memory depends on the context in which the OOM-killer was called. If it is due to the memory assigned to the allocating task's cpuset being exhausted, the allowed memory represents the set of mems assigned to that cpuset (see B<cpuset>(7)). If it is due to a mempolicy's node(s) being exhausted, the allowed memory represents the set of mempolicy nodes. If it is due to a memory limit (or swap limit) being reached, the allowed memory is that configured limit. Finally, if it is due to the entire system being out of memory, the allowed memory represents all allocatable resources.
ru: Количество «разрешённой» памяти зависит от контекста, в котором был вызван OOM-killer. Если он вызван в момент, когда при назначении памяти для выделенного cpuset задачи происходит исчерпание, то разрешённая память представляет набор mem, назначенных этому cpuset (смотрите B<cpuset>(7)). Если это происходит при исчерпании узлов mempolicy, то разрешённая память представляет набор узлов mempolicy. Если это происходит при достижении лимита на память (или лимита подкачки), то разрешённой памятью считается настроенный лимит. Наконец, если это происходит при нехватке памяти во всей системе, то разрешённой памятью считаются все доступные для выделения ресурсы.

source: The value of I<oom_score_adj> is added to the badness score before it is used to determine which task to kill. Acceptable values range from -1000 (OOM_SCORE_ADJ_MIN) to +1000 (OOM_SCORE_ADJ_MAX). This allows user space to control the preference for OOM-killing, ranging from always preferring a certain task or completely disabling it from OOM killing. The lowest possible value, -1000, is equivalent to disabling OOM-killing entirely for that task, since it will always report a badness score of 0.
ru: Значение I<oom_score_adj> добавляется к значению вредности перед тем как оно будет использовано для определения завершаемой задачи. Диапазон разрешённых значений: от -1000 (OOM_SCORE_ADJ_MIN) до +1000 (OOM_SCORE_ADJ_MAX). Это позволяет осуществлять контроль за настройкой OOM-killing из пользовательского пространства, указывая самые ненужные задачи или полностью отключая OOM-killing для самых важных. Самое минимальное значение, -1000, эквивалентно полному отключению OOM-killing для определённой задачи, так как оно снижает значение вредности до 0.

source: Consequently, it is very simple for user space to define the amount of memory to consider for each task. Setting an I<oom_score_adj> value of +500, for example, is roughly equivalent to allowing the remainder of tasks sharing the same system, cpuset, mempolicy, or memory controller resources to use at least 50% more memory. A value of -500, on the other hand, would be roughly equivalent to discounting 50% of the task's allowed memory from being considered as scoring against the task.
ru: Следовательно, из пользовательского пространства очень просто определить количество памяти по каждой задаче. Например, установка значения I<oom_score_adj> равным +500, примерно эквивалентна разрешению оставшимся задачам использовать общим в системы ресурсам, cpuset, mempolicy, или контроллеру памяти не менее 50% памяти. С другой стороны, значение -500 было бы примерно эквивалентно отниманию 50% из разрешённой памяти задачи при подсчёте вредности задачи.

source: For backward compatibility with previous kernels, I</proc/[pid]/oom_adj> can still be used to tune the badness score. Its value is scaled linearly with I<oom_score_adj>.
ru: Для обратной совместимости с предыдущими версиями ядер значение в I</proc/[pid]/oom_adj> всё ещё может учитываться при подстройке значения вредности. Это значение линейно масштабируется с I<oom_score_adj>.

source: Writing to I</proc/[pid]/oom_score_adj> or I</proc/[pid]/oom_adj> will change the other with its scaled value.
ru: Запись в I</proc/[pid]/oom_score_adj> или I</proc/[pid]/oom_adj> изменит и значение в другом параметре с соответствующим масштабом.

source: The B<choom>(1) program provides a command-line interface for adjusting the I<oom_score_adj> value of a running process or a newly executed command.
ru: Программа B<choom>(1) предоставляет интерфейс командной строки для подбора значения I<oom_score_adj> в уже работающем процессе или новой запускаемой команде.

source: I</proc/[pid]/pagemap> (since Linux 2.6.25)
ru: I</proc/[pid]/pagemap> (начиная с Linux 2.6.25)

source: This file shows the mapping of each of the process's virtual pages into physical page frames or swap area. It contains one 64-bit value for each virtual page, with the bits set as follows:
ru: Через данный файл показываются отображения каждой виртуальной страницы процесса в физические страничный кадры и области подкачки. Каждой страницы соответствует одно 64-битное число, биты которого имеют следующее значение:

source: If set, the page is present in RAM.
ru: Если установлен, то страница находится в оперативной памяти.

source: If set, the page is in swap space
ru: Если установлен, то страница находится в пространстве подкачки.

source: 61 (since Linux 3.5)
ru: 61 (начиная с Linux 3.5)

source: The page is a file-mapped page or a shared anonymous page.
ru: Страница является отображённой файловой страницей или общей анонимной страницей.

source: 60\(en57 (since Linux 3.11)
ru: 60\(en57 (начиная с Linux 3.11)

source: Zero
ru: Ноль

source: 56 (since Linux 4.2)
ru: 56 (начиная с Linux 4.2)

source: The page is exclusively mapped.
ru: Страница отображена монопольно.

source: 55 (since Linux 3.11)
ru: 55 (начиная с Linux 3.11)

source: PTE is soft-dirty (see the kernel source file I<Documentation/admin-guide/mm/soft-dirty.rst>).
ru: PTE содержит бит soft-dirty (смотрите файл исходного кода ядра I<Documentation/admin-guide/mm/soft-dirty.rst>).

source: If the page is present in RAM (bit 63), then these bits provide the page frame number, which can be used to index I</proc/kpageflags> and I</proc/kpagecount>. If the page is present in swap (bit 62), then bits 4\(en0 give the swap type, and bits 54\(en5 encode the swap offset.
ru: Если страница находится в оперативной памяти (бит 63), то эти биты содержат номер кадра страницы, который можно использовать для индексации I</proc/kpageflags> и I</proc/kpagecount>. Если страница находится в пространстве подкачки (бит 62), то биты 4\(en0 содержат тип подкачки, а биты 54\(en5 — смещение в пространстве подкачки.

source: Before Linux 3.11, bits 60\(en55 were used to encode the base-2 log of the page size.
ru: До Linux 3.11, биты 60\(en55 использовались как кодирование размера страницы в виде логарифма по основанию 2.

source: To employ I</proc/[pid]/pagemap> efficiently, use I</proc/[pid]/maps> to determine which areas of memory are actually mapped and seek to skip over unmapped regions.
ru: Для эффективного использования I</proc/[pid]/pagemap> обратитесь к I</proc/[pid]/maps> для определения какие области памяти действительно отображены и отбросьте не отображённые области.

source: The I</proc/[pid]/pagemap> file is present only if the B<CONFIG_PROC_PAGE_MONITOR> kernel configuration option is enabled.
ru: Файл I</proc/[pid]/pagemap> существует только, если включён параметр настройки ядра B<CONFIG_PROC_PAGE_MONITOR>.

source: I</proc/[pid]/personality> (since Linux 2.6.28)
ru: I</proc/[pid]/personality> (начиная с Linux 2.6.28)

source: This read-only file exposes the process's execution domain, as set by B<personality>(2). The value is displayed in hexadecimal notation.
ru: В файле (только для чтения) содержится домен выполнения процесса, заданный B<personality>(2). Значение отображено в шестнадцатеричной системе счисления.

source: UNIX and Linux support the idea of a per-process root of the filesystem, set by the B<chroot>(2) system call. This file is a symbolic link that points to the process's root directory, and behaves in the same way as I<exe>, and I<fd/*>.
ru: UNIX и Linux поддерживают идею о попроцессном корневом каталоге файловой системы, который может быть установлен системным вызовом B<chroot>(2). Этот файл является символьной ссылкой, которая указывает на корневой каталог процесса и ведёт себя так же, как I<exe> и I<fd/*>.
