Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The B<CAP_DAC_OVERRIDE> capability overrides all permission checking, but grants execute permission only when at least one of the file's three execute permission bits is set.
ru: Мандат B<CAP_DAC_OVERRIDE> заменяет всех проверки прав, но позволяет право выполнения только, когда установлен хотя бы один из трёх битов выполнения файла.

source: The B<CAP_DAC_READ_SEARCH> capability grants read and search permission on directories, and read permission on ordinary files.
ru: Мандат B<CAP_DAC_READ_SEARCH> разрешает чтение и поиск в по каталогу, а также чтение обычных файлов.

source: pkeys - overview of Memory Protection Keys
ru: pkeys - обзор ключей защиты памяти

source: Memory Protection Keys (pkeys) are an extension to existing page-based memory permissions. Normal page permissions using page tables require expensive system calls and TLB invalidations when changing permissions. Memory Protection Keys provide a mechanism for changing protections without requiring modification of the page tables on every permission change.
ru: Ключи защиты памяти (pkeys) — это расширение существующих постраничных прав на память. Для обычных прав на страницу используются страничные таблицы, требующие для изменении прав затратных системных вызовов и аннулирования TLB. Ключи защиты памяти предоставляют механизм изменения защиты без необходимости изменять страничные таблицы при каждом изменении прав.

source: To use pkeys, software must first "tag" a page in the page tables with a pkey. After this tag is in place, an application only has to change the contents of a register in order to remove write access, or all access to a tagged page.
ru: Чтобы использовать pkeys, ПО сначала должно «пометить» (tag) страницу в страничных таблицах значением pkey. После размещения этой метки для удаления прав на запись или весь доступ к помеченной странице приложению нужно изменить только содержимое регистра.

source: Protection keys work in conjunction with the existing B<PROT_READ>/ B<PROT_WRITE>/ B<PROT_EXEC> permissions passed to system calls such as B<mprotect>(2) and B<mmap>(2), but always act to further restrict these traditional permission mechanisms.
ru: Ключи защиты вместе с существующими правами B<PROT_READ>/ B<PROT_WRITE>/ B<PROT_EXEC> передаются в системные вызовы, такие как B<mprotect>(2) и B<mmap>(2), но всегда считаются как дополнительное ограничение к существующим традиционным механизмам прав доступа.

source: If a process performs an access that violates pkey restrictions, it receives a B<SIGSEGV> signal. See B<sigaction>(2) for details of the information available with that signal.
ru: Если процесс осуществляет доступ, нарушающий ограничения pkey, то он получает сигнал B<SIGSEGV>. Подробную информацию об этом сигнале смотрите в B<sigaction>(2).

source: To use the pkeys feature, the processor must support it, and the kernel must contain support for the feature on a given processor. As of early 2016 only future Intel x86 processors are supported, and this hardware supports 16 protection keys in each process. However, pkey 0 is used as the default key, so a maximum of 15 are available for actual application use. The default key is assigned to any memory region for which a pkey has not been explicitly assigned via B<pkey_mprotect>(2).
ru: Чтобы использовать свойство pkeys, это должен поддерживать процессор, а ядро должно включать поддержку этого свойства для этого процессора. К началу 2016 года это относится только к будущим процессорам Intel x86, и данная аппаратура поддерживает 16 ключей защиты на каждый процесс. Однако pkey 0 используется как ключ по умолчанию, поэтому для приложения доступно только 15. Ключ по умолчанию назначается любой области памяти, для которой pkey не был назначен явным образом с помощью B<pkey_mprotect>(2).

source: Protection keys have the potential to add a layer of security and reliability to applications. But they have not been primarily designed as a security feature. For instance, WRPKRU is a completely unprivileged instruction, so pkeys are useless in any case that an attacker controls the PKRU register or can execute arbitrary instructions.
ru: Потенциально, ключи защиты могут добавить уровень безопасности и надежности приложений. Но, прежде всего, они не разрабатывались как средство защиты. Например, WRPKRU — это полностью непривилегированная инструкция, поэтому pkeys бесполезны, когда атакующий контролирует регистр PKRU или может выполнять любые инструкции.

source: Applications should be very careful to ensure that they do not "leak" protection keys. For instance, before calling B<pkey_free>(2), the application should be sure that no memory has that pkey assigned. If the application left the freed pkey assigned, a future user of that pkey might inadvertently change the permissions of an unrelated data structure, which could impact security or stability. The kernel currently allows in-use pkeys to have B<pkey_free>(2) called on them because it would have processor or memory performance implications to perform the additional checks needed to disallow it. Implementation of the necessary checks is left up to applications. Applications may implement these checks by searching the I</proc/[pid]/smaps> file for memory regions with the pkey assigned. Further details can be found in B<proc>(5).
ru: Приложения должны следить за тем, чтобы их ключи защиты не «не утекли». Например, перед вызовом B<pkey_free>(2) приложение должно проверить, что pkey не назначен памяти. Если приложение оставит назначенным освобождённый pkey, то будущий пользователь этого pkey может непреднамеренно изменить права на не относящуюся к делу структуру данных, что может привести к проблемам с безопасностью или стабильностью. В настоящее время ядро позволяет вызывать B<pkey_free>(2) для задействованных pkeys, так как выполнение дополнительных проверок повлияло бы на производительность процессора или памяти. Реализация необходимых проверок переложена на приложение. Приложения могут найти области памяти, которым назначен pkey, в файле I</proc/[pid]/smaps>. Дополнительная информация представлена в B<proc>(5).

source: Any application wanting to use protection keys needs to be able to function without them. They might be unavailable because the hardware that the application runs on does not support them, the kernel code does not contain support, the kernel support has been disabled, or because the keys have all been allocated, perhaps by a library the application is using. It is recommended that applications wanting to use protection keys should simply call B<pkey_alloc>(2) and test whether the call succeeds, instead of attempting to detect support for the feature in any other way.
ru: Приложение, которое хочет воспользоваться ключами защиты, может работать и без них. Ключи могут быть недоступны из-за отсутствия аппаратной поддержки системе, где запускается приложение, в коде ядра может не быть поддержки, поддержка в ядре может быть выключена или все ключи уже задействованы библиотекой, которую использует приложение. В приложениях рекомендуется просто вызывать B<pkey_alloc>(2) и проверять успешность выполнения, а не пытаться проверять наличие поддержки каким-то другим образом.

source: Although unnecessary, hardware support for protection keys may be enumerated with the I<cpuid> instruction. Details of how to do this can be found in the Intel Software Developers Manual. The kernel performs this enumeration and exposes the information in I</proc/cpuinfo> under the "flags" field. The string "pku" in this field indicates hardware support for protection keys and the string "ospke" indicates that the kernel contains and has enabled protection keys support.
ru: Хотя и необязательно, поддержку ключей защиты в аппаратуре можно определить помощью инструкции I<cpuid>. От том, как это сделать, смотрите в программном руководстве разработчика Intel. Ядро определяет наличие поддержки и выводит информацию в I</proc/cpuinfo> в поле «flags». Строка «pku» в этом поле означает, что аппаратура поддерживает ключи защиты, а строка «ospke» означает, что ядро содержит включённую поддержку защиты.

source: Applications using threads and protection keys should be especially careful. Threads inherit the protection key rights of the parent at the time of the B<clone>(2), system call. Applications should either ensure that their own permissions are appropriate for child threads at the time when B<clone>(2) is called, or ensure that each child thread can perform its own initialization of protection key rights.
ru: Если приложение использует нити и ключи защиты, то нужно быть особенно осторожным. Нити наследуют права ключей защиты родителя при выполнении системного вызова B<clone>(2). Приложения должны убедиться, что их собственные права подходят для дочерних нитей до вызова B<clone>(2) или выполнять инициализацию прав ключей защиты в самих нитях.

source: Signal Handler Behavior
ru: Поведение обработчика сигналов

source: Each time a signal handler is invoked (including nested signals), the thread is temporarily given a new, default set of protection key rights that override the rights from the interrupted context. This means that applications must re-establish their desired protection key rights upon entering a signal handler if the desired rights differ from the defaults. The rights of any interrupted context are restored when the signal handler returns.
ru: Каждый раз, когда вызывается обработчик сигнала (включая вложенные сигналы), нити временно даётся новый набор прав ключа защиты по умолчанию, который заменяет права прерванного контекста. Это означает, что приложения должны переустанавливать свои желаемые права ключа защиты при входе в обработчик сигнала, если желаемые права отличаются от значения по умолчанию. Права любого прерванного контекста восстанавливаются при завершении обработчика сигналов.

source: This signal behavior is unusual and is due to the fact that the x86 PKRU register (which stores protection key access rights) is managed with the same hardware mechanism (XSAVE) that manages floating-point registers. The signal behavior is the same as that of floating-point registers.
ru: Данное поведение сигнала необычно из-за того, что регистр x86 PKRU (который хранит права доступа ключа защиты) управляется тем же аппаратным механизмом (XSAVE) что и регистры плавающей запятой. Поведение сигнала такое же как у регистров плавающей запятой.

source: Protection Keys system calls
ru: Системные вызовы ключей защиты

source: The Linux kernel implements the following pkey-related system calls: B<pkey_mprotect>(2), B<pkey_alloc>(2), and B<pkey_free>(2).
ru: В ядре Linux реализованы следующие системные вызовы для работы с pkey: B<pkey_mprotect>(2), B<pkey_alloc>(2) и B<pkey_free>(2).

source: The Linux pkey system calls are available only if the kernel was configured and built with the B<CONFIG_X86_INTEL_MEMORY_PROTECTION_KEYS> option.
ru: Системные вызовы Linux pkey доступны только, если ядро было собрано с включённым параметром B<CONFIG_X86_INTEL_MEMORY_PROTECTION_KEYS>.

source: The program below allocates a page of memory with read and write permissions. It then writes some data to the memory and successfully reads it back. After that, it attempts to allocate a protection key and disallows access to the page by using the WRPKRU instruction. It then tries to access the page, which we now expect to cause a fatal signal to the application.
ru: Программа, представленная далее, выделяет страницу памяти с правами на чтение и запись. Затем она записывает кусок данных в памяти и читает его. После этого она пытается выделить ключ защиты и запретить доступ к странице с помощью инструкции WRPKRU. Далее она пытается получить доступ к странице, что, как мы ожидаем, вызовет сигнал завершения приложения.

source: $B< ./a.out> buffer contains: 73 about to read buffer again... Segmentation fault (core dumped)
ru: $B< ./a.out> буфер содержит: 73 читаем буфер снова... Segmentation fault (core dumped)

source: Program source
ru: Исходный код программы

source: /* *Allocate one page of memory */ buffer = mmap(NULL, getpagesize(), PROT_READ | PROT_WRITE, MAP_ANONYMOUS | MAP_PRIVATE, -1, 0); if (buffer == MAP_FAILED) errExit("mmap");
ru: /* * выделяем страницу памяти */ buffer = mmap(NULL, getpagesize(), PROT_READ | PROT_WRITE, MAP_ANONYMOUS | MAP_PRIVATE, -1, 0); if (buffer == MAP_FAILED) errExit("mmap");

source: /* * Put some random data into the page (still OK to touch) */ *buffer = __LINE__; printf("buffer contains: %d\en", *buffer);
ru: /* * пишем произвольные данные в страницу (чуть) */ *buffer = __LINE__; printf("буфер содержит: %d\en", *buffer);

source: /* * Allocate a protection key: */ pkey = pkey_alloc(); if (pkey == -1) errExit("pkey_alloc");
ru: /* * выделяем ключ защиты: */ pkey = pkey_alloc(); if (pkey == -1) errExit("pkey_alloc");

source: /* * Disable access to any memory with "pkey" set, * even though there is none right now */ status = pkey_set(pkey, PKEY_DISABLE_ACCESS, 0); if (status) errExit("pkey_set");
ru: /* * запрещаем доступ к памяти, на которой будет установлен «pkey», * хотя пока ничего не запрещено */ status = pkey_set(pkey, PKEY_DISABLE_ACCESS, 0); if (status) errExit("pkey_set");

source: /* * Set the protection key on "buffer". * Note that it is still read/write as far as mprotect() is * concerned and the previous pkey_set() overrides it. */ status = pkey_mprotect(buffer, getpagesize(), PROT_READ | PROT_WRITE, pkey); if (status == -1) errExit("pkey_mprotect");
ru: /* * установим ключ защиты на «буфер» * заметим, что он доступен пока не применён mprotect() * и ключ не заменен созданным ранее pkey_set() */ status = pkey_mprotect(buffer, getpagesize(), PROT_READ | PROT_WRITE, pkey); if (status == -1) errExit("pkey_mprotect");

source: printf("about to read buffer again...\en");
ru: printf("читаем буфер снова...\en");

source: /* * This will crash, because we have disallowed access */ printf("buffer contains: %d\en", *buffer);
ru: /* * приложение падает, так как мы запретили доступ */ printf("буфер содержит: %d\en", *buffer);

source: pty - pseudoterminal interfaces
ru: pty - интерфейсы псевдо-терминалов

source: A pseudoterminal (sometimes abbreviated "pty") is a pair of virtual character devices that provide a bidirectional communication channel. One end of the channel is called the I<master>; the other end is called the I<slave>. The slave end of the pseudoterminal provides an interface that behaves exactly like a classical terminal. A process that expects to be connected to a terminal, can open the slave end of a pseudoterminal and then be driven by a program that has opened the master end. Anything that is written on the master end is provided to the process on the slave end as though it was input typed on a terminal. For example, writing the interrupt character (usually control-C) to the master device would cause an interrupt signal (B<SIGINT>) to be generated for the foreground process group that is connected to the slave. Conversely, anything that is written to the slave end of the pseudoterminal can be read by the process that is connected to the master end. Pseudoterminals are used by applications such as network login services (B<ssh>(1), B<rlogin>(1), B<telnet>(1)), terminal emulators such as B<xterm>(1), B<script>(1), B<screen>(1), B<tmux>(1), B<unbuffer>(1), and B<expect>(1).
ru: Псевдо-терминал (иногда применяют сокращение «pty») — это пара виртуальных символьных устройств, которые предоставляют двунаправленный канал обмена. Один конец канала называется I<основным> (master); другой конец канала называется I<подчинённым> (slave). Подчинённый конец псевдо-терминала предоставляет интерфейс, который работает также как обычный классический терминал. Процесс, который управляется через терминал, может открыть подчинённый конец псевдо-терминала и затем управляться программой, которая открыла основной конец. Всё что пишется в основной конец поступает процессу на подчинённом конце так, как-будто данные вводились с терминала. Например, запись символа прерывания (обычно control-C) в основной конец приводит к генерации сигнала прерывания (B<SIGINT>) для группы активных процессов, которая подключена к подчинённому концу. И наоборот, всё что записывается в в подчинённый конец псевдо-терминала, может быть прочитано процессом, который подключён к основному концу. Псевдо-терминалы используются такими приложениями как службы сетевого входа (B<ssh>(1), B<rlogin>(1), B<telnet>(1)), эмуляторами терминалов B<xterm>(1), B<script>(1), B<screen>(1), B<tmux>(1), B<unbuffer>(1) и B<expect>(1).

source: Data flow between master and slave is handled asynchronously, much like data flow with a physical terminal. Data written to the slave will be available at the master promptly, but may not be available immediately. Similarly, there may be a small processing delay between a write to the master, and the effect being visible at the slave.
ru: Поток данных между основным и подчинённым концом обрабатывается асинхронно, почти как поток с физического терминала. Данные, записываемые в подчинённый конец, будут доступны без промедления, но могут быть недоступны немедленно. Схожим образом, есть маленькая задержка обработки между записью в основной конец и когда эти данные станут видимы на подчинённом конце.

source: Historically, two pseudoterminal APIs have evolved: BSD and System V. SUSv1 standardized a pseudoterminal API based on the System V API, and this API should be employed in all new programs that use pseudoterminals.
ru: Исторически существует два программных интерфейса для взаимодействия с псевдо-терминалами: BSD и System V. В SUSv1 стандартизирован программный интерфейс, основанный на программном интерфейсе System V, который должен применяться во всех новых программах, использующих псевдо-терминалы.

source: Linux provides both BSD-style and (standardized) System V-style pseudoterminals. System V-style terminals are commonly called UNIX 98 pseudoterminals on Linux systems. Since kernel 2.6.4, BSD-style pseudoterminals are considered deprecated (they can be disabled when configuring the kernel); UNIX 98 pseudoterminals should be used in new applications.
ru: В Linux есть оба типа псевдо-терминалов — BSD и (стандартизированный) System V. В системах Linux терминалы System V часто называют псевдо-терминалами UNIX 98. Начиная с ядра версии 2.6.4 псевдо-терминалы BSD признаны устаревшими (их можно отключить во время настройки ядра). В новых программах следует использовать псевдо-терминалы UNIX 98.

source: UNIX 98 pseudoterminals
ru: Псевдо-терминалы UNIX 98

source: An unused UNIX 98 pseudoterminal master is opened by calling B<posix_openpt>(3). (This function opens the master clone device, I</dev/ptmx>; see B<pts>(4).) After performing any program-specific initializations, changing the ownership and permissions of the slave device using B<grantpt>(3), and unlocking the slave using B<unlockpt>(3)), the corresponding slave device can be opened by passing the name returned by B<ptsname>(3) in a call to B<open>(2).
ru: Незадействованный основной псевдо-терминал UNIX 98 открывается вызовом B<posix_openpt>(3) (эта функция открывает основное клонирующее устройство, I</dev/ptmx>; смотрите B<pts>(4)). После выполнения специальной программной инициализации (с помощью B<grantpt>(3) изменяется владелец и права на подчинённое устройство и с помощью B<unlockpt>(3) разблокируется подчинённое устройство), соответствующее подчинённое устройство можно открыть, передав имя, полученное от B<ptsname>(3), в вызов B<open>(2).

source: The Linux kernel imposes a limit on the number of available UNIX 98 pseudoterminals. In kernels up to and including 2.6.3, this limit is configured at kernel compilation time (B<CONFIG_UNIX98_PTYS>), and the permitted number of pseudoterminals can be up to 2048, with a default setting of 256. Since kernel 2.6.4, the limit is dynamically adjustable via I</proc/sys/kernel/pty/max>, and a corresponding file, I</proc/sys/kernel/pty/nr>, indicates how many pseudoterminals are currently in use. For further details on these two files, see B<proc>(5).
ru: Ядро Linux задаёт ограничение на количество доступных псевдо-терминалов UNIX 98. В ядрах до версии 2.6.3 включительно, это ограничение настраивалось при компиляции ядра (B<CONFIG_UNIX98_PTYS>), и разрешалось 2048 псевдо-терминалов (по умолчанию 256). Начиная с версии 2.6.4, ограничение динамически настраивается через I</proc/sys/kernel/pty/max>, а в файле I</proc/sys/kernel/pty/nr> хранится количество уже используемых псевдо-терминалов. Подробности об этих двух файлах смотрите в B<proc>(5).

source: BSD pseudoterminals
ru: Псевдо-терминалы BSD

source: BSD-style pseudoterminals are provided as precreated pairs, with names of the form I</dev/ptyXY> (master) and I</dev/ttyXY> (slave), where X is a letter from the 16-character set [p-za-e], and Y is a letter from the 16-character set [0-9a-f]. (The precise range of letters in these two sets varies across UNIX implementations.) For example, I</dev/ptyp1> and I</dev/ttyp1> constitute a BSD pseudoterminal pair. A process finds an unused pseudoterminal pair by trying to B<open>(2) each pseudoterminal master until an open succeeds. The corresponding pseudoterminal slave (substitute "tty" for "pty" in the name of the master) can then be opened.
ru: Псевдо-терминалы в стиле BSD предоставляются в виде заранее созданных пар, с именами вида I</dev/ptyXY> (основной) и I</dev/ttyXY> (подчинённый), где X это буква из 16-символьного набора [p-za-e], а Y это буква из 16-символьного набора [0-9a-f] (точный диапазон символов этих наборов отличается в разных реализациях UNIX). Например, I</dev/ptyp1> и I</dev/ttyp1> составляют псевдо-терминальную пару BSD. Процесс находит неиспользуемую псевдо-терминальную пару пробуя вызывать B<open>(2) с каждым основным псевдо-терминалом, пока вызов не выполнится успешно. Затем может быть открыт соответствующий подчинённый псевдо-терминал (подставив «tty» вместо «pty» имени основного конца).

source: UNIX 98 master clone device
ru: основное клонирующее устройство UNIX 98

source: UNIX 98 slave devices
ru: подчинённые устройства UNIX 98

source: BSD master devices
ru: основные устройства BSD

source: BSD slave devices
ru: подчинённые устройства BSD

source: A description of the B<TIOCPKT> B<ioctl>(2), which controls packet mode operation, can be found in B<ioctl_tty>(2).
ru: Описание запроса B<TIOCPKT> B<ioctl>(2), который управляет пакетным режимом, можно найти в B<ioctl_tty>(2).

source: The BSD B<ioctl>(2) operations B<TIOCSTOP>, B<TIOCSTART>, B<TIOCUCNTL>, and B<TIOCREMOTE> have not been implemented under Linux.
ru: Вызовы B<ioctl>(2) для BSD B<TIOCSTOP>, B<TIOCSTART>, B<TIOCUCNTL> и B<TIOCREMOTE> не реализованы в Linux.

source: pid_namespaces - overview of Linux PID namespaces
ru: pid_namespaces - обзор пространств имён Linux PID

source: For an overview of namespaces, see B<namespaces>(7).
ru: Обзор пространств имён смотрите в B<namespaces>(7).

source: PID namespaces isolate the process ID number space, meaning that processes in different PID namespaces can have the same PID. PID namespaces allow containers to provide functionality such as suspending/resuming the set of processes in the container and migrating the container to a new host while the processes inside the container maintain the same PIDs.
ru: Пространства имён PID изолируют пространство номеров идентификаторов процессов, то есть процессы в разных пространствах имён PID могут иметь единый PID. Пространства имён PID позволяют предоставлять такие возможности в контейнерах как приостановку/возобновление работы набора процессов в контейнере и перенос контейнера на новый узел, при чём процессы внутри контейнера сохранят свои PID.
