Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: This indicates that the content of B<PERF_SAMPLE_IP> points to the actual instruction that triggered the event. See also I<perf_event_attr.precise_ip>.
ru: Показывает, что содержимое B<PERF_SAMPLE_IP> указывает на актуальную инструкцию, из-за которой произошло событие. Смотрите также I<perf_event_attr.precise_ip>.

source: B<PERF_RECORD_MISC_EXT_RESERVED> (since Linux 2.6.35)
ru: B<PERF_RECORD_MISC_EXT_RESERVED> (начиная с Linux 2.6.35)

source: This indicates there is extended data available (currently not used).
ru: Показывает, что доступны расширенные данные (пока не используется).

source: This bit is not set by the kernel. It is reserved for the user-space perf utility to indicate that I</proc/i[pid]/maps> parsing was taking too long and was stopped, and thus the mmap records may be truncated.
ru: Данный бит не устанавливается ядром. Он зарезервирован для утилиты пользовательского пространства perf и показывает, что разбор I</proc/i[pid]/maps> выполнялся слишком долго и был остановлен, и поэтому записи mmap могут быть обрезанными.

source: The I<type> value is one of the below. The values in the corresponding record (that follows the header) depend on the I<type> selected as shown.
ru: Значение I<type> — одно из представленных ниже. Значения в соответствующей записи (следующие за заголовком) зависят от выбранного I<type> как описано.

source: The MMAP events record the B<PROT_EXEC> mappings so that we can correlate user-space IPs to code. They have the following structure:
ru: События MMAP записывают отображения B<PROT_EXEC> так, чтобы можно было соотнести IP пользовательского пространства с кодом. Они имеют следующую структуру:

source: is the process ID.
ru: идентификатор процесса.

source: is the thread ID.
ru: идентификатор нити.

source: is the address of the allocated memory. I<len> is the length of the allocated memory. I<pgoff> is the page offset of the allocated memory. I<filename> is a string describing the backing of the allocated memory.
ru: адрес выделенной памяти. В I<len> указывается длина выделенной памяти. В I<pgoff> указывается смещение страницы выделенной памяти. В I<filename> указывается строка, описывающая выделенную память.

source: This record indicates when events are lost.
ru: Эта запись указывает на потерю событий.

source: is the unique event ID for the samples that were lost.
ru: уникальный ID события утерянных образцов.

source: is the number of events that were lost.
ru: количество потерянных событий.

source: This record indicates a change in the process name.
ru: Эта запись указывает на изменение имени процесса.

source: is a string containing the new name of the process.
ru: строка, содержащая новое имя процесса.

source: This record indicates a process exit event.
ru: Эта запись указывает на событие выхода процесса.

source: This record indicates a throttle/unthrottle event.
ru: Эта запись указывает на событие включения/выключения регулировки (throttle).

source: This record indicates a fork event.
ru: Эта запись указывает на событие порождения (fork) процесса.

source: This record indicates a read event.
ru: Эта запись указывает на событие чтения.

source: This record indicates a sample.
ru: Эта запись указывает на образец.

source: struct { struct perf_event_header header; u64 sample_id; /* if PERF_SAMPLE_IDENTIFIER */ u64 ip; /* if PERF_SAMPLE_IP */ u32 pid, tid; /* if PERF_SAMPLE_TID */ u64 time; /* if PERF_SAMPLE_TIME */ u64 addr; /* if PERF_SAMPLE_ADDR */ u64 id; /* if PERF_SAMPLE_ID */ u64 stream_id; /* if PERF_SAMPLE_STREAM_ID */ u32 cpu, res; /* if PERF_SAMPLE_CPU */ u64 period; /* if PERF_SAMPLE_PERIOD */ struct read_format v; /* if PERF_SAMPLE_READ */ u64 nr; /* if PERF_SAMPLE_CALLCHAIN */ u64 ips[nr]; /* if PERF_SAMPLE_CALLCHAIN */ u32 size; /* if PERF_SAMPLE_RAW */ char data[size]; /* if PERF_SAMPLE_RAW */ u64 bnr; /* if PERF_SAMPLE_BRANCH_STACK */ struct perf_branch_entry lbr[bnr]; /* if PERF_SAMPLE_BRANCH_STACK */ u64 abi; /* if PERF_SAMPLE_REGS_USER */ u64 regs[weight(mask)]; /* if PERF_SAMPLE_REGS_USER */ u64 size; /* if PERF_SAMPLE_STACK_USER */ char data[size]; /* if PERF_SAMPLE_STACK_USER */ u64 dyn_size; /* if PERF_SAMPLE_STACK_USER && size != 0 */ u64 weight; /* if PERF_SAMPLE_WEIGHT */ u64 data_src; /* if PERF_SAMPLE_DATA_SRC */ u64 transaction; /* if PERF_SAMPLE_TRANSACTION */ u64 abi; /* if PERF_SAMPLE_REGS_INTR */ u64 regs[weight(mask)]; /* if PERF_SAMPLE_REGS_INTR */ };
ru: struct { struct perf_event_header header; u64 sample_id; /* для PERF_SAMPLE_IDENTIFIER */ u64 ip; /* для PERF_SAMPLE_IP */ u32 pid, tid; /* для PERF_SAMPLE_TID */ u64 time; /* для PERF_SAMPLE_TIME */ u64 addr; /* для PERF_SAMPLE_ADDR */ u64 id; /* для PERF_SAMPLE_ID */ u64 stream_id; /* для PERF_SAMPLE_STREAM_ID */ u32 cpu, res; /* для PERF_SAMPLE_CPU */ u64 period; /* для PERF_SAMPLE_PERIOD */ struct read_format v; /* для PERF_SAMPLE_READ */ u64 nr; /* для PERF_SAMPLE_CALLCHAIN */ u64 ips[nr]; /* для PERF_SAMPLE_CALLCHAIN */ u32 size; /* для PERF_SAMPLE_RAW */ char data[size]; /* для PERF_SAMPLE_RAW */ u64 bnr; /* для PERF_SAMPLE_BRANCH_STACK */ struct perf_branch_entry lbr[bnr]; /* для PERF_SAMPLE_BRANCH_STACK */ u64 abi; /* для PERF_SAMPLE_REGS_USER */ u64 regs[weight(mask)]; /* для PERF_SAMPLE_REGS_USER */ u64 size; /* для PERF_SAMPLE_STACK_USER */ char data[size]; /* для PERF_SAMPLE_STACK_USER */ u64 dyn_size; /* для PERF_SAMPLE_STACK_USER && size != 0 */ u64 weight; /* для PERF_SAMPLE_WEIGHT */ u64 data_src; /* для PERF_SAMPLE_DATA_SRC */ u64 transaction; /* для PERF_SAMPLE_TRANSACTION */ u64 abi; /* для PERF_SAMPLE_REGS_INTR */ u64 regs[weight(mask)]; /* для PERF_SAMPLE_REGS_INTR */ };

source: If B<PERF_SAMPLE_IDENTIFIER> is enabled, a 64-bit unique ID is included. This is a duplication of the B<PERF_SAMPLE_ID> I<id> value, but included at the beginning of the sample so parsers can easily obtain the value.
ru: Если включён B<PERF_SAMPLE_IDENTIFIER>, то добавляется уникальный 64-битный идентификатор. Это дубль значения I<id> при B<PERF_SAMPLE_ID>, но добавляется в начало образца, для простоты получения значения анализаторами.

source: If B<PERF_SAMPLE_IP> is enabled, then a 64-bit instruction pointer value is included.
ru: Если включён B<PERF_SAMPLE_IP>, то добавляется значение 64-битного указателя инструкции.

source: If B<PERF_SAMPLE_TID> is enabled, then a 32-bit process ID and 32-bit thread ID are included.
ru: Если включён B<PERF_SAMPLE_TID>, то добавляется 32-битный идентификатор процесс и 32-битный идентификатор нити.

source: If B<PERF_SAMPLE_TIME> is enabled, then a 64-bit timestamp is included. This is obtained via local_clock() which is a hardware timestamp if available and the jiffies value if not.
ru: Если включён B<PERF_SAMPLE_TIME>, то добавляется 64-битная метка времени. Она получается из local_clock(), которая возвращает, если возможно, аппаратную метку времени или количество мигов, если нет.

source: If B<PERF_SAMPLE_ADDR> is enabled, then a 64-bit address is included. This is usually the address of a tracepoint, breakpoint, or software event; otherwise the value is 0.
ru: Если включён B<PERF_SAMPLE_ADDR>, то добавляется 64-битный адрес. Обычно, это адрес точки трассировки, останова или программного события; в противном случае 0.

source: If B<PERF_SAMPLE_ID> is enabled, a 64-bit unique ID is included. If the event is a member of an event group, the group leader ID is returned. This ID is the same as the one returned by B<PERF_FORMAT_ID>.
ru: Если включён B<PERF_SAMPLE_ID>, то добавляется 64-битный уникальный идентификатор. Если события является членом группы событий, то возвращается идентификатор лидера группы. Этот идентификатор одинаков со значением, возвращаемым при B<PERF_FORMAT_ID>.

source: If B<PERF_SAMPLE_STREAM_ID> is enabled, a 64-bit unique ID is included. Unlike B<PERF_SAMPLE_ID> the actual ID is returned, not the group leader. This ID is the same as the one returned by B<PERF_FORMAT_ID>.
ru: Если включён B<PERF_SAMPLE_STREAM_ID>, то добавляется 64-битный уникальный идентификатор. В отличии от B<PERF_SAMPLE_ID> возвращается реальный идентификатор, а не лидера группы. Этот же идентификатор возвращается при B<PERF_FORMAT_ID>.

source: If B<PERF_SAMPLE_CPU> is enabled, this is a 32-bit value indicating which CPU was being used, in addition to a reserved (unused) 32-bit value.
ru: Если включён B<PERF_SAMPLE_CPU>, здесь хранится 32-битное значение, показывающее, какой использовался ЦП, а также зарезервированное (неиспользуемое) 32-битное значение.

source: If B<PERF_SAMPLE_PERIOD> is enabled, a 64-bit value indicating the current sampling period is written.
ru: Если включён B<PERF_SAMPLE_PERIOD>, то записывается 64-битное значение, отражающее период выборки.

source: If B<PERF_SAMPLE_READ> is enabled, a structure of type read_format is included which has values for all events in the event group. The values included depend on the I<read_format> value used at B<perf_event_open>() time.
ru: Если включён B<PERF_SAMPLE_READ>, то добавляется структура read_format, которая содержит значения для всех событий группы событий. Добавляемые значения зависят от значения I<read_format>, использованного во время B<perf_event_open>().

source: If B<PERF_SAMPLE_CALLCHAIN> is enabled, then a 64-bit number is included which indicates how many following 64-bit instruction pointers will follow. This is the current callchain.
ru: Если включён B<PERF_SAMPLE_CALLCHAIN>, то добавляется 64-битный номер, показывающий сколько далее следует 64-битных указателей инструкций. Это относится к текущей цепочке вызовов.

source: If B<PERF_SAMPLE_RAW> is enabled, then a 32-bit value indicating size is included followed by an array of 8-bit values of length size. The values are padded with 0 to have 64-bit alignment.
ru: Если включён B<PERF_SAMPLE_RAW>, то добавляется 32-битное значение, показывающее размер размещённого далее массива 8-битных значений. Значения дополняются нулями до 64-битного.

source: This RAW record data is opaque with respect to the ABI. The ABI doesn't make any promises with respect to the stability of its content, it may vary depending on event, hardware, and kernel version.
ru: Это неструктурированные записи с данными, скрытыми программным интерфейсом. Не гарантируется неизменность их структуры в будущем, она может зависеть от события, аппаратного обеспечения и версии ядра.

source: If B<PERF_SAMPLE_BRANCH_STACK> is enabled, then a 64-bit value indicating the number of records is included, followed by I<bnr> I<perf_branch_entry> structures which each include the fields:
ru: Если включён B<PERF_SAMPLE_BRANCH_STACK>, то добавляется 64-битное значение, показывающее количество записей, следующих за структурами I<bnr> I<perf_branch_entry>, каждая из которых содержит следующие поля:

source: This indicates the source instruction (may not be a branch).
ru: Источник инструкции (может быть не ветвление).

source: The branch target.
ru: Цель ветвления.

source: The branch target was mispredicted.
ru: Цель ветвления предсказана ошибочно.

source: The branch target was predicted.
ru: Цель ветвления предсказана.

source: I<in_tx> (since Linux 3.11)
ru: I<in_tx> (начиная с Linux 3.11)

source: The branch was in a transactional memory transaction.
ru: Ветвление возникло в транзакции транзакционной памяти.

source: I<abort> (since Linux 3.11)
ru: I<abort> (начиная с Linux 3.11)

source: The branch was in an aborted transactional memory transaction.
ru: Ветвление возникло в аварийной транзакции транзакционной памяти.

source: I<cycles> (since Linux 4.3)
ru: I<cycles> (начиная с Linux 4.3)

source: This reports the number of cycles elapsed since the previous branch stack update.
ru: Количество циклов, прошедших с предыдущего обновления стека ветви.

source: The entries are from most to least recent, so the first entry has the most recent branch.
ru: Элементы располагаются от новых к старым, таким образом, первый указывает на самое новое ветвление.

source: Support for I<mispred>, I<predicted>, and I<cycles> is optional; if not supported, those values will be 0.
ru: Поддержка I<mispred>, I<predicted> и I<cycles> необязательна; если отсутствует, то значения будут равны 0.

source: The type of branches recorded is specified by the I<branch_sample_type> field.
ru: Тип сохранённых ветвлений указывается в поле I<branch_sample_type>.

source: If B<PERF_SAMPLE_REGS_USER> is enabled, then the user CPU registers are recorded.
ru: Если включён B<PERF_SAMPLE_REGS_USER>, то сохраняются пользовательские регистры ЦП.

source: The I<abi> field is one of B<PERF_SAMPLE_REGS_ABI_NONE>, B<PERF_SAMPLE_REGS_ABI_32> or B<PERF_SAMPLE_REGS_ABI_64>.
ru: Значением поля I<abi> может быть B<PERF_SAMPLE_REGS_ABI_NONE>, B<PERF_SAMPLE_REGS_ABI_32> или B<PERF_SAMPLE_REGS_ABI_64>.

source: The I<regs> field is an array of the CPU registers that were specified by the I<sample_regs_user> attr field. The number of values is the number of bits set in the I<sample_regs_user> bit mask.
ru: В I<regs> хранится массив регистров ЦП, которые были перечислены в поле I<sample_regs_user>. Количество значений определяется количеством бит, установленных в битовой маске I<sample_regs_user>.

source: If B<PERF_SAMPLE_STACK_USER> is enabled, then the user stack is recorded. This can be used to generate stack backtraces. I<size> is the size requested by the user in I<sample_stack_user> or else the maximum record size. I<data> is the stack data (a raw dump of the memory pointed to by the stack pointer at the time of sampling). I<dyn_size> is the amount of data actually dumped (can be less than I<size>). Note that I<dyn_size> is omitted if I<size> is 0.
ru: Если включён B<PERF_SAMPLE_STACK_USER>, то сохраняется пользовательский стек. Он может использоваться для генерации стека обратных вызовов. Значение I<size> — размер, запрашиваемый пользователем для I<sample_stack_user> или максимальное значение записи. Значение I<data> — данные стека (неструктурированная копия памяти, на которую указывает указатель стека во время взятия образца). Значение I<dyn_size> — количество данных, которые были записаны (может быть меньше I<size>). Заметим, что I<dyn_size> пропускается, если I<size> равно 0.

source: If B<PERF_SAMPLE_WEIGHT> is enabled, then a 64-bit value provided by the hardware is recorded that indicates how costly the event was. This allows expensive events to stand out more clearly in profiles.
ru: Если включён B<PERF_SAMPLE_WEIGHT>, то добавляется 64-битное аппаратное значение, показывающее стоимость события. Это позволяет выделить в профилях затратные события.

source: If B<PERF_SAMPLE_DATA_SRC> is enabled, then a 64-bit value is recorded that is made up of the following fields:
ru: Если включён B<PERF_SAMPLE_DATA_SRC>, то сохраняется 64-битное значение, состоящее из следующих полей:

source: Type of opcode, a bitwise combination of:
ru: Тип кода операции, битовая комбинация из следующих значений:

source: Not available
ru: Недоступен

source: Load instruction
ru: Инструкция загрузки

source: Store instruction
ru: Инструкция сохранения

source: Prefetch
ru: Предварительная выборка

source: Executable code
ru: Исполняемый код

source: Memory hierarchy level hit or miss, a bitwise combination of the following, shifted left by B<PERF_MEM_LVL_SHIFT>:
ru: Попадание или промах по уровням иерархии памяти, побитовая комбинация следующего, сдвинутого влево на B<PERF_MEM_LVL_SHIFT>:

source: Hit
ru: Попадание

source: Miss
ru: Промах

source: Level 1 cache
ru: Кэш 1 уровня

source: Line fill buffer
ru: Построчно заполняемый буфер

source: Level 2 cache
ru: Кэш 2 уровня

source: Level 3 cache
ru: Кэш 3 уровня

source: Local DRAM
ru: Локальная оперативная память

source: Remote DRAM 1 hop
ru: Удалённая на 1 скачок оперативная память

source: Remote DRAM 2 hops
ru: Удалённая на 2 скачка оперативная память

source: Remote cache 1 hop
ru: Удалённый на 1 скачок кэш

source: Remote cache 2 hops
ru: Удалённый на 2 скачка кэш

source: I/O memory
ru: Память ввода-вывода

source: Uncached memory
ru: Некэшируемая память

source: Snoop mode, a bitwise combination of the following, shifted left by B<PERF_MEM_SNOOP_SHIFT>:
ru: Режим подглядывания (snoop mode), побитовая комбинация следующего, сдвинутого влево на B<PERF_MEM_SNOOP_SHIFT>:

source: No snoop
ru: Нет подглядывания

source: Snoop hit
ru: Срабатывание подглядывания

source: Snoop miss
ru: Промах подглядывания

source: Snoop hit modified
ru: Срабатывание подглядывания изменено

source: Lock instruction, a bitwise combination of the following, shifted left by B<PERF_MEM_LOCK_SHIFT>:
ru: Инструкция блокировки, побитовая комбинация следующего, сдвинутого влево на B<PERF_MEM_LOCK_SHIFT>:

source: Locked transaction
ru: Заблокированная транзакция

source: TLB access hit or miss, a bitwise combination of the following, shifted left by B<PERF_MEM_TLB_SHIFT>:
ru: Попадание или промах доступа к TLB, побитовая комбинация следующего, сдвинутого влево на B<PERF_MEM_TLB_SHIFT>:

source: Level 1 TLB
ru: 1 уровень TLB

source: Level 2 TLB
ru: 2 уровень TLB

source: Hardware walker
ru: Обходчик оборудования

source: OS fault handler
ru: Обработчик ошибок ОС

source: If the B<PERF_SAMPLE_TRANSACTION> flag is set, then a 64-bit field is recorded describing the sources of any transactional memory aborts.
ru: Если установлен флаг B<PERF_SAMPLE_TRANSACTION>, то записывается 64-битное поле, описывающее источники аварий транзакционной памяти.

source: The field is a bitwise combination of the following values:
ru: Данное поле является побитовым объединением следующих значений:

source: Abort from an elision type transaction (Intel-CPU-specific).
ru: Авария из-за транзакции пропущенного типа (только для ЦП Intel).

source: Abort from a generic transaction.
ru: Авария из-за общей транзакции.

source: Synchronous abort (related to the reported instruction).
ru: Синхронная авария (относится к сообщению об инструкции).

source: Asynchronous abort (not related to the reported instruction).
ru: Асинхронная авария (не относится к сообщению об инструкции).

source: Retryable abort (retrying the transaction may have succeeded).
ru: Повторяемая авария (повтор транзакции может привести к успешному выполнению).

source: Abort due to memory conflicts with other threads.
ru: Авария из-за конфликта памяти между нитями.

source: Abort due to write capacity overflow.
ru: Авария из-за переполнения объёма при записи.

source: Abort due to read capacity overflow.
ru: Авария из-за переполнения объёма при чтении.

source: In addition, a user-specified abort code can be obtained from the high 32 bits of the field by shifting right by B<PERF_TXN_ABORT_SHIFT> and masking with the value B<PERF_TXN_ABORT_MASK>.
ru: Также, можно получить указанный пользователем код аварии, если сдвинуть 32 бита поля вправо на B<PERF_TXN_ABORT_SHIFT> и наложить маску B<PERF_TXN_ABORT_MASK>.

source: If B<PERF_SAMPLE_REGS_INTR> is enabled, then the user CPU registers are recorded.
ru: Если включён B<PERF_SAMPLE_REGS_INTR>, то сохраняются пользовательские регистры ЦП.

source: The I<abi> field is one of B<PERF_SAMPLE_REGS_ABI_NONE>, B<PERF_SAMPLE_REGS_ABI_32>, or B<PERF_SAMPLE_REGS_ABI_64>.
ru: Значением поля I<abi> может быть B<PERF_SAMPLE_REGS_ABI_NONE>, B<PERF_SAMPLE_REGS_ABI_32> или B<PERF_SAMPLE_REGS_ABI_64>.

source: The I<regs> field is an array of the CPU registers that were specified by the I<sample_regs_intr> attr field. The number of values is the number of bits set in the I<sample_regs_intr> bit mask.
ru: В I<regs> хранится массив регистров ЦП, которые были перечислены в поле I<sample_regs_intr>. Количество значений определяется количеством бит, установленных в битовой маске I<sample_regs_intr>.

source: This record includes extended information on B<mmap>(2) calls returning executable mappings. The format is similar to that of the B<PERF_RECORD_MMAP> record, but includes extra values that allow uniquely identifying shared mappings.
ru: В этой записи добавлена расширенная информация вызовов B<mmap>(2), возвращающих выполняемые отображения. Формат подобен записи B<PERF_RECORD_MMAP>, до добавлены дополнительные значения, позволяющие однозначно определить общие отображения.

source: is the address of the allocated memory.
ru: адрес выделенной памяти.

source: is the length of the allocated memory.
ru: длина выделенной памяти.

source: is the page offset of the allocated memory.
ru: смещение на странице выделенной памяти.

source: is the major ID of the underlying device.
ru: основной идентификатор подлежащего устройства.

source: is the minor ID of the underlying device.
ru: второстепенный идентификатор подлежащего устройства.

source: is the inode number.
ru: номер inode.

source: is the inode generation.
ru: поколение inode.

source: is the protection information.
ru: защитная информация.

source: is the flags information.
ru: информация о флагах.

source: is a string describing the backing of the allocated memory.
ru: строка, описывающая выделенную память.

source: B<PERF_RECORD_AUX> (since Linux 4.1)
ru: B<PERF_RECORD_AUX> (начиная с Linux 4.1)

source: This record reports that new data is available in the separate AUX buffer region.
ru: Эта запись сообщает о доступности новых данных в отдельной буферной области AUX.

source: offset in the AUX mmap region where the new data begins.
ru: смещение области AUX mmap, где начинаются новые данные.

source: size of the data made available.
ru: размер доступных данных.

source: describes the AUX update.
ru: описывает обновление AUX.

source: if set, then the data returned was truncated to fit the available buffer size.
ru: Если установлен, то возвращённые данные были обрезаны до размера доступного буфера.

source: if set, then the data returned has overwritten previous data.
ru: Если установлен, то возвращённые данные перезаписали имеющиеся данные.

source: B<PERF_RECORD_ITRACE_START> (since Linux 4.1)
ru: B<PERF_RECORD_ITRACE_START> (начиная с Linux 4.1)

source: This record indicates which process has initiated an instruction trace event, allowing tools to properly correlate the instruction addresses in the AUX buffer with the proper executable.
ru: Эта запись показывает, что процесс начал событие трассировки инструкции, который позволяет инструментам правильно соотносить адреса инструкций в буфере AUX с подходящим исполняемым файлом.

source: process ID of the thread starting an instruction trace.
ru: идентификатор процесса нити, начавшей трассировку инструкций.

source: thread ID of the thread starting an instruction trace.
ru: идентификатор нити для нити, начавшей трассировку инструкций.

source: B<PERF_RECORD_LOST_SAMPLES> (since Linux 4.2)
ru: B<PERF_RECORD_LOST_SAMPLES> (начиная с Linux 4.2)

source: When using hardware sampling (such as Intel PEBS) this record indicates some number of samples that may have been lost.
ru: Если используются аппаратное измерение (такое как Intel PEBS), то данная запись указывает, что несколько образцов могли потеряться.

source: the number of potentially lost samples.
ru: количество потенциально потерянных образцов.

source: B<PERF_RECORD_SWITCH> (since Linux 4.3)
ru: B<PERF_RECORD_SWITCH> (начиная с Linux 4.3)

source: This record indicates a context switch has happened. The B<PERF_RECORD_MISC_SWITCH_OUT> bit in the I<misc> field indicates whether it was a context switch into or away from the current process.
ru: Данная запись указывает на выполнение переключения контекста. Бит B<PERF_RECORD_MISC_SWITCH_OUT> в поле I<misc> показывает направление переключение контекста — из или в текущий процесс.

source: B<PERF_RECORD_SWITCH_CPU_WIDE> (since Linux 4.3)
ru: B<PERF_RECORD_SWITCH_CPU_WIDE> (начиная с Linux 4.3)
