Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: Sample output from I</proc/timer_stats>:
ru: Пример статистики из I</proc/timer_stats>:

source: The output columns are:
ru: Выводимые столбцы:

source: a count of the number of events, optionally (since Linux 2.6.23) followed by the letter \(aqD\(aq if this is a deferrable timer;
ru: счётчик событий, за которым следует (начиная с Linux 2.6.23) необязательная буква «D», если это отложенный таймер;

source: the PID of the process that initialized the timer;
ru: PID процесса, который инициализировал таймер;

source: the name of the process that initialized the timer;
ru: имя процесса, который инициализировал таймер;

source: the function where the timer was initialized; and
ru: функция, откуда был инициализирован таймер, и

source: (in parentheses) the callback function that is associated with the timer.
ru: (в скобках) функция обратного вызова, которая связана с таймером.

source: During the Linux 4.11 development cycle, this file was removed because of security concerns, as it exposes information across namespaces. Furthermore, it is possible to obtain the same information via in-kernel tracing facilities such as ftrace.
ru: В течении цикла разработки Linux 4.11 этот файл был удалён из-за проблем с безопасностью, так как выдавал информацию всем пространствам имён. Кроме этого, подобную информацию можно получить через встроенные в ядро возможности трассировки, например через ftrace.

source: Subdirectory containing the pseudo-files and subdirectories for tty drivers and line disciplines.
ru: Подкаталог, содержащий псевдо-файлы и подкаталоги драйверов tty и параметры линий.

source: This file contains two numbers (values in seconds): the uptime of the system (including time spent in suspend) and the amount of time spent in the idle process.
ru: Этот файл содержит два числа (значения в секундах): время работы системы с момента загрузки (включая время, проведённой режиме приостанова) и время, которое система провела в состоянии простоя.

source: This string identifies the kernel version that is currently running. It includes the contents of I</proc/sys/kernel/ostype>, I</proc/sys/kernel/osrelease> and I</proc/sys/kernel/version>. For example:
ru: Строка, идентифицирующая версию ядра, которое запущено в данный момент. Она включает содержимое I</proc/sys/kernel/ostype>, I</proc/sys/kernel/osrelease> и I</proc/sys/kernel/version>. Пример:

source: I</proc/vmstat> (since Linux 2.6.0)
ru: I</proc/vmstat> (начиная с Linux 2.6.0)

source: This file displays various virtual memory statistics. Each line of this file contains a single name-value pair, delimited by white space. Some lines are present only if the kernel was configured with suitable options. (In some cases, the options required for particular files have changed across kernel versions, so they are not listed here. Details can be found by consulting the kernel source code.) The following fields may be present:
ru: Этот файл отражает различную статистику виртуальной памяти. Каждая строка файла содержит одну пару имя-значение (через пробел). Некоторые строки присутствуют только, если ядро собрано с соответствующим параметром (в некоторых случаях требуемые параметры в различные в разных версиях ядер и не перечислены здесь. Подробности можно найти в исходном коде ядра). Существуют следующие поля:

source: I<nr_free_pages> (since Linux 2.6.31)
ru: I<nr_free_pages> (начиная с Linux 2.6.31)

source: I<nr_alloc_batch> (since Linux 3.12)
ru: I<nr_alloc_batch> (начиная с Linux 3.12)

source: I<nr_inactive_anon> (since Linux 2.6.28)
ru: I<nr_inactive_anon> (начиная с Linux 2.6.28)

source: I<nr_active_anon> (since Linux 2.6.28)
ru: I<nr_active_anon> (начиная с Linux 2.6.28)

source: I<nr_inactive_file> (since Linux 2.6.28)
ru: I<nr_inactive_file> (начиная с Linux 2.6.28)

source: I<nr_active_file> (since Linux 2.6.28)
ru: I<nr_active_file> (начиная с Linux 2.6.28)

source: I<nr_unevictable> (since Linux 2.6.28)
ru: I<nr_unevictable> (начиная с Linux 2.6.28)

source: I<nr_mlock> (since Linux 2.6.28)
ru: I<nr_mlock> (начиная с Linux 2.6.28)

source: I<nr_anon_pages> (since Linux 2.6.18)
ru: I<nr_anon_pages> (начиная с Linux 2.6.18)

source: I<nr_mapped> (since Linux 2.6.0)
ru: I<nr_mapped> (начиная с Linux 2.6.0)

source: I<nr_file_pages> (since Linux 2.6.18)
ru: I<nr_file_pages> (начиная с Linux 2.6.18)

source: I<nr_dirty> (since Linux 2.6.0)
ru: I<nr_dirty> (начиная с Linux 2.6.0)

source: I<nr_writeback> (since Linux 2.6.0)
ru: I<nr_writeback> (начиная с Linux 2.6.0)

source: I<nr_slab_reclaimable> (since Linux 2.6.19)
ru: I<nr_slab_reclaimable> (начиная с Linux 2.6.19)

source: I<nr_slab_unreclaimable> (since Linux 2.6.19)
ru: I<nr_slab_unreclaimable> (начиная с Linux 2.6.19)

source: I<nr_page_table_pages> (since Linux 2.6.0)
ru: I<nr_page_table_pages> (начиная с Linux 2.6.0)

source: I<nr_kernel_stack> (since Linux 2.6.32)
ru: I<nr_kernel_stack> (начиная с Linux 2.6.32)

source: I<nr_unstable> (since Linux 2.6.0)
ru: I<nr_unstable> (начиная с Linux 2.6.0)

source: I<nr_bounce> (since Linux 2.6.12)
ru: I<nr_bounce> (начиная с Linux 2.6.12)

source: I<nr_vmscan_write> (since Linux 2.6.19)
ru: I<nr_vmscan_write> (начиная с Linux 2.6.19)

source: I<nr_vmscan_immediate_reclaim> (since Linux 3.2)
ru: I<nr_vmscan_immediate_reclaim> (начиная с Linux 3.2)

source: I<nr_writeback_temp> (since Linux 2.6.26)
ru: I<nr_writeback_temp> (начиная с Linux 2.6.26)

source: I<nr_isolated_anon> (since Linux 2.6.32)
ru: I<nr_isolated_anon> (начиная с Linux 2.6.32)

source: I<nr_isolated_file> (since Linux 2.6.32)
ru: I<nr_isolated_file> (начиная с Linux 2.6.32)

source: I<nr_shmem> (since Linux 2.6.32)
ru: I<nr_shmem> (начиная с Linux 2.6.32)

source: Pages used by shmem and B<tmpfs>(5).
ru: Страницы, используемые shmem и B<tmpfs>(5).

source: I<nr_dirtied> (since Linux 2.6.37)
ru: I<nr_dirtied> (начиная с Linux 2.6.37)

source: I<nr_written> (since Linux 2.6.37)
ru: I<nr_written> (начиная с Linux 2.6.37)

source: I<nr_pages_scanned> (since Linux 3.17)
ru: I<nr_pages_scanned> (начиная с Linux 3.17)

source: I<numa_hit> (since Linux 2.6.18)
ru: I<numa_hit> (начиная с Linux 2.6.18)

source: I<numa_miss> (since Linux 2.6.18)
ru: I<numa_miss> (начиная с Linux 2.6.18)

source: I<numa_foreign> (since Linux 2.6.18)
ru: I<numa_foreign> (начиная с Linux 2.6.18)

source: I<numa_interleave> (since Linux 2.6.18)
ru: I<numa_interleave> (начиная с Linux 2.6.18)

source: I<numa_local> (since Linux 2.6.18)
ru: I<numa_local> (начиная с Linux 2.6.18)

source: I<numa_other> (since Linux 2.6.18)
ru: I<numa_other> (начиная с Linux 2.6.18)

source: I<workingset_refault> (since Linux 3.15)
ru: I<workingset_refault> (начиная с Linux 3.15)

source: I<workingset_activate> (since Linux 3.15)
ru: I<workingset_activate> (начиная с Linux 3.15)

source: I<workingset_nodereclaim> (since Linux 3.15)
ru: I<workingset_nodereclaim> (начиная с Linux 3.15)

source: I<nr_anon_transparent_hugepages> (since Linux 2.6.38)
ru: I<nr_anon_transparent_hugepages> (начиная с Linux 2.6.38)

source: I<nr_free_cma> (since Linux 3.7)
ru: I<nr_free_cma> (начиная с Linux 3.7)

source: Number of free CMA (Contiguous Memory Allocator) pages.
ru: Количество свободных страниц CMA (выделитель непрерывной памяти).

source: I<nr_dirty_threshold> (since Linux 2.6.37)
ru: I<nr_dirty_threshold> (начиная с Linux 2.6.37)

source: I<nr_dirty_background_threshold> (since Linux 2.6.37)
ru: I<nr_dirty_background_threshold> (начиная с Linux 2.6.37)

source: I<pgpgin> (since Linux 2.6.0)
ru: I<pgpgin> (начиная с Linux 2.6.0)

source: I<pgpgout> (since Linux 2.6.0)
ru: I<pgpgout> (начиная с Linux 2.6.0)

source: I<pswpin> (since Linux 2.6.0)
ru: I<pswpin> (начиная с Linux 2.6.0)

source: I<pswpout> (since Linux 2.6.0)
ru: I<pswpout> (начиная с Linux 2.6.0)

source: I<pgalloc_dma> (since Linux 2.6.5)
ru: I<pgalloc_dma> (начиная с Linux 2.6.5)

source: I<pgalloc_dma32> (since Linux 2.6.16)
ru: I<pgalloc_dma32> (начиная с Linux 2.6.16)

source: I<pgalloc_normal> (since Linux 2.6.5)
ru: I<pgalloc_normal> (начиная с Linux 2.6.5)

source: I<pgalloc_high> (since Linux 2.6.5)
ru: I<pgalloc_high> (начиная с Linux 2.6.5)

source: I<pgalloc_movable> (since Linux 2.6.23)
ru: I<pgalloc_movable> (начиная с Linux 2.6.23)

source: I<pgfree> (since Linux 2.6.0)
ru: I<pgfree> (начиная с Linux 2.6.0)

source: I<pgactivate> (since Linux 2.6.0)
ru: I<pgactivate> (начиная с Linux 2.6.0)

source: I<pgdeactivate> (since Linux 2.6.0)
ru: I<pgdeactivate> (начиная с Linux 2.6.0)

source: I<pgfault> (since Linux 2.6.0)
ru: I<pgfault> (начиная с Linux 2.6.0)

source: I<pgmajfault> (since Linux 2.6.0)
ru: I<pgmajfault> (начиная с Linux 2.6.0)

source: I<pgrefill_dma> (since Linux 2.6.5)
ru: I<pgrefill_dma> (начиная с Linux 2.6.5)

source: I<pgrefill_dma32> (since Linux 2.6.16)
ru: I<pgrefill_dma32> (начиная с Linux 2.6.16)

source: I<pgrefill_normal> (since Linux 2.6.5)
ru: I<pgrefill_normal> (начиная с Linux 2.6.5)

source: I<pgrefill_high> (since Linux 2.6.5)
ru: I<pgrefill_high> (начиная с Linux 2.6.5)

source: I<pgrefill_movable> (since Linux 2.6.23)
ru: I<pgrefill_movable> (начиная с Linux 2.6.23)

source: I<pgsteal_kswapd_dma> (since Linux 3.4)
ru: I<pgsteal_kswapd_dma> (начиная с Linux 3.4)

source: I<pgsteal_kswapd_dma32> (since Linux 3.4)
ru: I<pgsteal_kswapd_dma32> (начиная с Linux 3.4)

source: I<pgsteal_kswapd_normal> (since Linux 3.4)
ru: I<pgsteal_kswapd_normal> (начиная с Linux 3.4)

source: I<pgsteal_kswapd_high> (since Linux 3.4)
ru: I<pgsteal_kswapd_high> (начиная с Linux 3.4)

source: I<pgsteal_kswapd_movable> (since Linux 3.4)
ru: I<pgsteal_kswapd_movable> (начиная с Linux 3.4)

source: I<pgsteal_direct_dma32> (since Linux 3.4)
ru: I<pgsteal_direct_dma32> (начиная с Linux 3.4)

source: I<pgsteal_direct_normal> (since Linux 3.4)
ru: I<pgsteal_direct_normal> (начиная с Linux 3.4)

source: I<pgsteal_direct_high> (since Linux 3.4)
ru: I<pgsteal_direct_high> (начиная с Linux 3.4)

source: I<pgsteal_direct_movable> (since Linux 2.6.23)
ru: I<pgsteal_direct_movable> (начиная с Linux 2.6.23)

source: I<pgscan_kswapd_dma32> (since Linux 2.6.16)
ru: I<pgscan_kswapd_dma32> (начиная с Linux 2.6.16)

source: I<pgscan_kswapd_normal> (since Linux 2.6.5)
ru: I<pgscan_kswapd_normal> (начиная с Linux 2.6.5)

source: I<pgscan_kswapd_movable> (since Linux 2.6.23)
ru: I<pgscan_kswapd_movable> (начиная с Linux 2.6.23)

source: I<pgscan_direct_dma32> (since Linux 2.6.16)
ru: I<pgscan_direct_dma32> (начиная с Linux 2.6.16)

source: I<pgscan_direct_movable> (since Linux 2.6.23)
ru: I<pgscan_direct_movable> (начиная с Linux 2.6.23)

source: I<pgscan_direct_throttle> (since Linux 3.6)
ru: I<pgscan_direct_throttle> (начиная с Linux 3.6)

source: I<zone_reclaim_failed> (since linux 2.6.31)
ru: I<zone_reclaim_failed> (начиная с Linux 2.6.31)

source: I<pginodesteal> (since linux 2.6.0)
ru: I<pginodesteal> (начиная с Linux 2.6.0)

source: I<slabs_scanned> (since linux 2.6.5)
ru: I<slabs_scanned> (начиная с Linux 2.6.5)

source: I<kswapd_inodesteal> (since linux 2.6.0)
ru: I<kswapd_inodesteal> (начиная с Linux 2.6.0)

source: I<kswapd_low_wmark_hit_quickly> (since 2.6.33)
ru: I<kswapd_low_wmark_hit_quickly> (начиная с Linux 2.6.33)

source: I<kswapd_high_wmark_hit_quickly> (since 2.6.33)
ru: I<kswapd_high_wmark_hit_quickly> (начиная с Linux 2.6.33)

source: I<pageoutrun> (since Linux 2.6.0)
ru: I<pageoutrun> (начиная с Linux 2.6.0)

source: I<allocstall> (since Linux 2.6.0)
ru: I<allocstall> (начиная с Linux 2.6.0)

source: I<pgrotated> (since Linux 2.6.0)
ru: I<pgrotated> (начиная с Linux 2.6.0)

source: I<drop_pagecache> (since Linux 3.15)
ru: I<drop_pagecache> (начиная с Linux 3.15)

source: I<drop_slab> (since Linux 3.15)
ru: I<drop_slab> (начиная с Linux 3.15)

source: I<numa_pte_updates> (since Linux 3.8)
ru: I<numa_pte_updates> (начиная с Linux 3.8)

source: I<numa_huge_pte_updates> (since Linux 3.13)
ru: I<numa_huge_pte_updates> (начиная с Linux 3.13)

source: I<numa_hint_faults> (since Linux 3.8)
ru: I<numa_hint_faults> (начиная с Linux 3.8)

source: I<numa_hint_faults_local> (since Linux 3.8)
ru: I<numa_hint_faults_local> (начиная с Linux 3.8)

source: I<numa_pages_migrated> (since Linux 3.8)
ru: I<numa_pages_migrated> (начиная с Linux 3.8)

source: I<pgmigrate_success> (since Linux 3.8)
ru: I<pgmigrate_success> (начиная с Linux 3.8)

source: I<pgmigrate_fail> (since Linux 3.8)
ru: I<pgmigrate_fail> (начиная с Linux 3.8)

source: I<compact_migrate_scanned> (since Linux 3.8)
ru: I<compact_migrate_scanned> (начиная с Linux 3.8)

source: I<compact_free_scanned> (since Linux 3.8)
ru: I<compact_free_scanned> (начиная с Linux 3.8)

source: I<compact_isolated> (since Linux 3.8)
ru: I<compact_isolated> (начиная с Linux 3.8)

source: I<compact_stall> (since Linux 2.6.35)
ru: I<compact_stall> (начиная с Linux 2.6.35)

source: See the kernel source file I<Documentation/admin-guide/mm/transhuge.rst>.
ru: Смотрите файл исходного кода ядра I<Documentation/admin-guide/mm/transhuge.rst>.

source: I<compact_fail> (since Linux 2.6.35)
ru: I<compact_fail> (начиная с Linux 2.6.35)

source: I<compact_success> (since Linux 2.6.35)
ru: I<compact_success> (начиная с Linux 2.6.35)

source: I<htlb_buddy_alloc_success> (since Linux 2.6.26)
ru: I<htlb_buddy_alloc_success> (начиная с Linux 2.6.26)

source: I<htlb_buddy_alloc_fail> (since Linux 2.6.26)
ru: I<htlb_buddy_alloc_fail> (начиная с Linux 2.6.26)

source: I<unevictable_pgs_culled> (since Linux 2.6.28)
ru: I<unevictable_pgs_culled> (начиная с Linux 2.6.28)

source: I<unevictable_pgs_scanned> (since Linux 2.6.28)
ru: I<unevictable_pgs_scanned> (начиная с Linux 2.6.28)

source: I<unevictable_pgs_rescued> (since Linux 2.6.28)
ru: I<unevictable_pgs_rescued> (начиная с Linux 2.6.28)

source: I<unevictable_pgs_mlocked> (since Linux 2.6.28)
ru: I<unevictable_pgs_mlocked> (начиная с Linux 2.6.28)

source: I<unevictable_pgs_munlocked> (since Linux 2.6.28)
ru: I<unevictable_pgs_munlocked> (начиная с Linux 2.6.28)

source: I<unevictable_pgs_cleared> (since Linux 2.6.28)
ru: I<unevictable_pgs_cleared> (начиная с Linux 2.6.28)

source: I<unevictable_pgs_stranded> (since Linux 2.6.28)
ru: I<unevictable_pgs_stranded> (начиная с Linux 2.6.28)

source: I<thp_fault_alloc> (since Linux 2.6.39)
ru: I<thp_fault_alloc> (начиная с Linux 2.6.39)

source: I<thp_fault_fallback> (since Linux 2.6.39)
ru: I<thp_fault_fallback> (начиная с Linux 2.6.39)

source: I<thp_collapse_alloc> (since Linux 2.6.39)
ru: I<thp_collapse_alloc> (начиная с Linux 2.6.39)

source: I<thp_collapse_alloc_failed> (since Linux 2.6.39)
ru: I<thp_collapse_alloc_failed> (начиная с Linux 2.6.39)

source: I<thp_split> (since Linux 2.6.39)
ru: I<thp_split> (начиная с Linux 2.6.39)

source: I<thp_zero_page_alloc> (since Linux 3.8)
ru: I<thp_zero_page_alloc> (начиная с Linux 3.8)

source: I<thp_zero_page_alloc_failed> (since Linux 3.8)
ru: I<thp_zero_page_alloc_failed> (начиная с Linux 3.8)

source: I<balloon_inflate> (since Linux 3.18)
ru: I<balloon_inflate> (начиная с Linux 3.18)

source: I<balloon_deflate> (since Linux 3.18)
ru: I<balloon_deflate> (начиная с Linux 3.18)

source: I<balloon_migrate> (since Linux 3.18)
ru: I<balloon_migrate> (начиная с Linux 3.18)

source: I<nr_tlb_remote_flush> (since Linux 3.12)
ru: I<nr_tlb_remote_flush> (начиная с Linux 3.12)

source: I<nr_tlb_remote_flush_received> (since Linux 3.12)
ru: I<nr_tlb_remote_flush_received> (начиная с Linux 3.12)

source: I<nr_tlb_local_flush_all> (since Linux 3.12)
ru: I<nr_tlb_local_flush_all> (начиная с Linux 3.12)

source: I<nr_tlb_local_flush_one> (since Linux 3.12)
ru: I<nr_tlb_local_flush_one> (начиная с Linux 3.12)

source: I<vmacache_find_calls> (since Linux 3.16)
ru: I<vmacache_find_calls> (начиная с Linux 3.16)

source: I<vmacache_find_hits> (since Linux 3.16)
ru: I<vmacache_find_hits> (начиная с Linux 3.16)

source: I<vmacache_full_flushes> (since Linux 3.19)
ru: I<vmacache_full_flushes> (начиная с Linux 3.19)

source: I</proc/zoneinfo> (since Linux 2.6.13)
ru: I</proc/zoneinfo> (начиная с Linux 2.6.13)

source: This file display information about memory zones. This is useful for analyzing virtual memory behavior.
ru: Этот файл содержит информацию о зонах памяти. Он полезен при анализе поведения виртуальной памяти.

source: Many files contain strings (e.g., the environment and command line) that are in the internal format, with subfields terminated by null bytes (\(aq\e0\(aq). When inspecting such files, you may find that the results are more readable if you use a command of the following form to display them:
ru: Многие файлы со строками (например, окружение и командная строка), хранят данные во внутреннем формате с полями, завершающимися нулевыми байтами (\(aq\e0\(aq). При просмотре таких файлов данные будут более читаемыми, если воспользоваться следующей командой вывода.

source: This manual page is incomplete, possibly inaccurate, and is the kind of thing that needs to be updated very often.
ru: Данная справочная страница неполна, в ней могут быть неточности и является одной из страниц, которую требуется обновлять очень часто.

source: The Linux kernel source files: I<Documentation/filesystems/proc.txt>, I<Documentation/sysctl/fs.txt>, I<Documentation/sysctl/kernel.txt>, I<Documentation/sysctl/net.txt>, and I<Documentation/sysctl/vm.txt>.
ru: Файлы исходного кода ядра Linux: I<Documentation/filesystems/proc.txt>, I<Documentation/sysctl/fs.txt>, I<Documentation/sysctl/kernel.txt>, I<Documentation/sysctl/net.txt> и I<Documentation/sysctl/vm.txt>.

source: passwd - password file
ru: passwd - файл паролей

source: The I</etc/passwd> file is a text file that describes user login accounts for the system. It should have read permission allowed for all users (many utilities, like B<ls>(1) use it to map user IDs to usernames), but write access only for the superuser.
ru: В текстовом файле I</etc/passwd> содержится список учётных записей пользователей в системе. Файл должен быть доступен для чтения всем пользователям (многие утилиты, такие как B<ls>(1), используют его, чтобы преобразовывать идентификаторы пользователей в их имена), но доступ на запись должен предоставляться только суперпользователю.

source: In the good old days there was no great problem with this general read permission. Everybody could read the encrypted passwords, but the hardware was too slow to crack a well-chosen password, and moreover the basic assumption used to be that of a friendly user-community. These days many people run some version of the shadow password suite, where I</etc/passwd> has an \(aqx\(aq character in the password field, and the encrypted passwords are in I</etc/shadow>, which is readable by the superuser only.
ru: В старые добрые времена не существовало большой проблемы, связанной с доступностью этого файла на чтение для всех. Любой мог прочитать зашифрованные пароли, но мощности компьютеров не хватало для подбора грамотно выбранных паролей, а кроме того, наивно предполагалось, что сеть используется дружественным сообществом пользователей. В наши дни, многие пользователи стали использовать механизм теневых паролей, где файл I</etc/passwd> содержит \(aqx\(aq в поле пароля, а зашифрованные пароли хранятся в файле I</etc/shadow>, который доступен на чтение только суперпользователю.

source: If the encrypted password, whether in I</etc/passwd> or in I</etc/shadow>, is an empty string, login is allowed without even asking for a password. Note that this functionality may be intentionally disabled in applications, or configurable (for example using the "nullok" or "nonull" arguments to pam_unix.so).
ru: Если значение шифрованного пароля, в I</etc/passwd> или I</etc/shadow>, равно пустой строке, то вход будет разрешён без запроса пароля. Заметим, что данной свойство может быть специально отключено в приложениях или может настраиваться (например, с помощью аргументов «nullok» или «nonull»модуля pam_unix.so).

source: If the encrypted password in I</etc/passwd> is "I<*NP*>" (without the quotes), the shadow record should be obtained from an NIS+ server.
ru: Если значение шифрованного пароля в I</etc/passwd> равно «I<*NP*>» (без кавычек), то теневая запись запрашивается с сервера NIS+.

source: Regardless of whether shadow passwords are used, many system administrators use an asterisk (*) in the encrypted password field to make sure that this user can not authenticate themself using a password. (But see NOTES below.)
ru: Вне зависимости от того, применяется ли механизм теневых паролей или нет, многие системные администраторы ставят звёздочку (*) в поле зашифрованного пароля, чтобы быть уверенными, что данный пользователь не пройдёт аутентификацию, используя какой-либо пароль (но смотри раздел ЗАМЕЧАНИЯ далее).

source: If you create a new login, first put an asterisk (*) in the password field, then use B<passwd>(1) to set it.
ru: Если вы создаёте новую учётную запись, сперва в поле пароля помещается звёздочка (*), а затем с помощью команды B<passwd>(1) вы можете задать пароль.

source: Each line of the file describes a single user, and contains seven colon-separated fields:
ru: Каждая строка файла состоит из семи полей, разделённых двоеточием и описывает одного пользователя:

source: The field are as follows:
ru: Поля:

source: I<name>
ru: I<имя>

source: This is the user's login name. It should not contain capital letters.
ru: Имя пользователя в системе. Оно не должно содержать букв в верхнем регистре.

source: I<password>
ru: I<пароль>

source: This is either the encrypted user password, an asterisk (*), or the letter \(aqx\(aq. (See B<pwconv>(8) for an explanation of \(aqx\(aq.)
ru: Может содержать шифрованный пароль пользователя, звёздочку (*) или букву \(aqx\(aq (про \(aqx\(aq см. в B<pwconv>(8)).

source: The privileged I<root> login account (superuser) has the user ID 0.
ru: Привилегированная учётная запись I<root> (суперпользователь) имеет идентификатор пользователя равный 0.

source: This is the numeric primary group ID for this user. (Additional groups for the user are defined in the system group file; see B<group>(5)).
ru: Числовой идентификатор первичной группы (GID) пользователя. Дополнительные группы пользователя могут быть заданы в файле групп системы; смотрите B<group>(5).

source: This field (sometimes called the "comment field") is optional and used only for informational purposes. Usually, it contains the full username. Some programs (for example, B<finger>(1)) display information from this field.
ru: Данное поле является необязательным и используется только для информационных целей. Обычно, оно содержит полное имя пользователя. Некоторые программы (например, B<finger>(1)) показывают значение этого поля.

source: GECOS stands for "General Electric Comprehensive Operating System", which was renamed to GCOS when GE's large systems division was sold to Honeywell. Dennis Ritchie has reported: "Sometimes we sent printer output or batch jobs to the GCOS machine. The gcos field in the password file was a place to stash the information for the $IDENTcard. Not elegant."
ru: GECOS — это аббревиатура от General Electric Comprehensive Operating System, которая была переименована в GCOS, когда подразделение больших систем компании GE было продано компании Honeywell. Денис Ритчи писал: «Иногда мы направляем вывод печати или пачку заданий на GCOS машину. Поле gcos в файле паролей было местом, где хранилась информация для $IDENTcard. Не элегантно.»

source: I<directory>
ru: I<каталог>

source: This is the user's home directory: the initial directory where the user is placed after logging in. The value in this field is used to set the B<HOME> environment variable.
ru: Домашний каталог пользователя: начальный каталог, куда попадает пользователь после входа в систему. Значение данного поля используется для настройки переменной окружения B<HOME>.

source: I<shell>
ru: I<оболочка>
