Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The ID for this timer. This is not the same as the timer ID returned by B<timer_create>(2); rather, it is the same kernel-internal ID that is available via the I<si_timerid> field of the I<siginfo_t> structure (see B<sigaction>(2)).
ru: Идентификатор таймера. Это не тоже самое, что возвращает B<timer_create>(2); это внутренний идентификатор в ядре, который доступен в поле I<si_timerid> структуры I<siginfo_t> (смотрите B<sigaction>(2)).

source: This is the signal number that this timer uses to deliver notifications followed by a slash, and then the I<sigev_value> value supplied to the signal handler. Valid only for timers that notify via a signal.
ru: Номер сигнала, который данный таймер использует для доставки уведомлений, затем косая черта, а затем показано значение I<sigev_value>, передаваемое в обработчик сигнала. Актуален только для таймеров, которые выполняют уведомления посредством сигнала.

source: The part before the slash specifies the mechanism that this timer uses to deliver notifications, and is one of "thread", "signal", or "none". Immediately following the slash is either the string "tid" for timers with B<SIGEV_THREAD_ID> notification, or "pid" for timers that notify by other mechanisms. Following the "." is the PID of the process (or the kernel thread ID of the thread) that will be delivered a signal if the timer delivers notifications via a signal.
ru: Часть перед косой чертой определяет механизм, который данный таймер использует для доставки уведомлений, и может быть одним из «thread», «signal» или «none». Сразу за косой чертой может быть строка «tid» для таймеров с уведомлением B<SIGEV_THREAD_ID>, или «pid» для таймеров, которые уведомляют другими механизмами. Далее после «.» указан PID процесса (или ID ядерной нити для нити), которому будет доставлен сигнал, если таймер доставляет уведомления через сигнал.

source: This field identifies the clock that the timer uses for measuring time. For most clocks, this is a number that matches one of the user-space B<CLOCK_*> constants exposed via I<E<lt>time.hE<gt>>. B<CLOCK_PROCESS_CPUTIME_ID> timers display with a value of -6 in this field. B<CLOCK_THREAD_CPUTIME_ID> timers display with a value of -2 in this field.
ru: В этом поле задаются часы, которые таймер использует для измерения времени. Для большинства часов это номер, который совпадает с одной из констант пользовательского окружения B<CLOCK_*>, располагающихся в I<E<lt>time.hE<gt>>. Таймеры B<CLOCK_PROCESS_CPUTIME_ID> показываются со значением -6 в этом поле. Таймеры B<CLOCK_THREAD_CPUTIME_ID> показываются со значением -2 в этом поле.

source: This file is available only when the kernel was configured with B<CONFIG_CHECKPOINT_RESTORE>.
ru: Данный файл доступен только, если ядро было собрано с параметром B<CONFIG_CHECKPOINT_RESTORE>.

source: I</proc/[pid]/timerslack_ns> (since Linux 4.6)
ru: I</proc/[pid]/timerslack_ns> (начиная с Linux 4.6)

source: This file exposes the process's "current" timer slack value, expressed in nanoseconds. The file is writable, allowing the process's timer slack value to be changed. Writing 0 to this file resets the "current" timer slack to the "default" timer slack value. For further details, see the discussion of B<PR_SET_TIMERSLACK> in B<prctl>(2).
ru: Данный файл отражает значение (в наносекундах) «текущего» допуска таймера процесса. Файл доступен на запись, что позволяет изменить значение допуска таймера процесса. Запись 0 сбрасывает «текущий» допуск таймера в значение допуска таймера «по умолчанию». Дополнительную информацию смотрите в описании B<PR_SET_TIMERSLACK> из B<prctl>(2).

source: Initially, permission to access this file was governed by a ptrace access mode B<PTRACE_MODE_ATTACH_FSCREDS> check (see B<ptrace>(2)). However, this was subsequently deemed too strict a requirement (and had the side effect that requiring a process to have the B<CAP_SYS_PTRACE> capability would also allow it to view and change any process's memory). Therefore, since Linux 4.9, only the (weaker) B<CAP_SYS_NICE> capability is required to access this file.
ru: Первоначально, права доступа к этому файлу определялись проверкой режима доступа ptrace B<PTRACE_MODE_ATTACH_FSCREDS> (смотрите B<ptrace>(2)). Однако это впоследствии посчитали слишком строгим требованием (и имеющим побочный эффект, выражающимся в требовании от процесса иметь мандат B<CAP_SYS_PTRACE>, который также позволяет ему просматривать и изменять всю память процесса). Поэтому, начиная с Linux 4.9, для доступа к этому файлу требуется только мандат B<CAP_SYS_NICE> (маломощный).

source: I</proc/[pid]/uid_map>, I</proc/[pid]/gid_map> (since Linux 3.5)
ru: I</proc/[pid]/uid_map>, I</proc/[pid]/gid_map> (начиная с Linux 3.5)

source: I</proc/[pid]/wchan> (since Linux 2.6.0)
ru: I</proc/[pid]/wchan> (начиная с Linux 2.6.0)

source: The symbolic name corresponding to the location in the kernel where the process is sleeping.
ru: Символическое имя, соответствующее расположению, где процесс спит в ядре.

source: There is a numerical subdirectory for each running thread that is not a thread group leader (i.e., a thread whose thread ID is not the same as its process ID); the subdirectory is named by the thread ID. Each one of these subdirectories contains files and subdirectories exposing information about the thread with the thread ID I<tid>. The contents of these directories are the same as the corresponding I</proc/[pid]/task/[tid]> directories.
ru: Подкаталог с числовым названием для каждой выполняющейся нити, которая не является лидером группы нитей (т. е., нить, чей ID нити не совпадает с ID её процесса); подкаталог называется по ID нити. В подкаталоге содержатся файлы и подкаталоги с информацией о нити с ID нити I<tid>. Содержимое этих каталогов совпадает с соответствующими каталогами I</proc/[pid]/task/[tid]>.

source: The I</proc/[tid]> subdirectories are I<not> visible when iterating through I</proc> with B<getdents>(2) (and thus are I<not> visible when one uses B<ls>(1) to view the contents of I</proc>). However, the pathnames of these directories are visible to (i.e., usable as arguments in) system calls that operate on pathnames.
ru: Подкаталоги I</proc/[tid]> I<невидимы> при обходе I</proc> с помощью B<getdents>(2) (и поэтому I<невидимы> программам, подобным B<ls>(1), отображающим содержимое I</proc>). Однако пути к этим каталогам видимы (т. е., их можно использовать в качестве параметров) системным вызовам, работающими с этими путями.

source: Advanced power management version and battery information when B<CONFIG_APM> is defined at kernel compilation time.
ru: Версия системы расширенного управления питанием и информация о батарее, если ядро собрано с поддержкой B<CONFIG_APM>.

source: This file contains information which is used for diagnosing memory fragmentation issues. Each line starts with the identification of the node and the name of the zone which together identify a memory region This is then followed by the count of available chunks of a certain order in which these zones are split. The size in bytes of a certain order is given by the formula:
ru: В этом файле содержится информация, которую можно использовать при диагностике проблем с фрагментацией памяти. Каждая строка начинается с идентификатора узла и имени зоны, которые вместе определяют область памяти. Далее следует количество доступных блоков (chunks) определённого порядка, в котором разделялись зоны. Размер в байтах порядка задаётся формулой:

source: The binary buddy allocator algorithm inside the kernel will split one chunk into two chunks of a smaller order (thus with half the size) or combine two contiguous chunks into one larger chunk of a higher order (thus with double the size) to satisfy allocation requests and to counter memory fragmentation. The order matches the column number, when starting to count at zero.
ru: Алгоритм двоичных близнецов (binary buddy allocator) внутри ядра разделит один блок на несколько меньшего размера (например, пополам) или объединит два рядом стоящих блока в один большего размера (например удвоенного), чтобы выполнить запрос выделения и подсчёта фрагментации памяти. Порядок совпадает с номером столбца, при начале отсчёта от нуля.

source: For example on an x86-64 system:
ru: Пример для системы x86-64:

source: In this example, there is one node containing three zones and there are 11 different chunk sizes. If the page size is 4 kilobytes, then the first zone called I<DMA> (on x86 the first 16 megabyte of memory) has 1 chunk of 4 kilobytes (order 0) available and has 3 chunks of 4 megabytes (order 10) available.
ru: В этом примере показан один узел, содержащий три зоны и 11 блоков разного размера. Если размер страницы равен 4 КБ, то первая зона с именем I<DMA> (в x86 — первые 16 МБ памяти) содержит 1 блок по 4 КБ (порядок 0) и 3 блока по 4 МБ (порядок 10).

source: If the memory is heavily fragmented, the counters for higher order chunks will be zero and allocation of large contiguous areas will fail.
ru: Если памяти сильно фрагментирована, то счётчики блоков высшего порядка будут равны нулю и выделение больших непрерывных областей будет завершаться с ошибкой.

source: Further information about the zones can be found in I</proc/zoneinfo>.
ru: Дополнительную информацию о зонах смотрите I</proc/zoneinfo>.

source: Contains subdirectories for installed busses.
ru: Содержит подкаталоги для установленных шин.

source: Subdirectory for PCMCIA devices when B<CONFIG_PCMCIA> is set at kernel compilation time.
ru: Подкаталог для устройств PCMCIA, если ядро собрано с поддержкой B<CONFIG_PCMCIA>.

source: Contains various bus subdirectories and pseudo-files containing information about PCI busses, installed devices, and device drivers. Some of these files are not ASCII.
ru: Содержит различные подкаталоги шин и псевдо-файлы, содержащие информацию о шинах PCI, установленных устройствах и драйверах устройств. Некоторые из этих файлов не являются текстовыми.

source: Information about PCI devices. They may be accessed through B<lspci>(8) and B<setpci>(8).
ru: Информация о устройствах PCI. К ним можно получить доступ через B<lspci>(8) и B<setpci>(8).

source: I</proc/cgroups> (since Linux 2.6.24)
ru: I</proc/cgroups> (начиная с Linux 2.6.24)

source: Arguments passed to the Linux kernel at boot time. Often done via a boot manager such as B<lilo>(8) or B<grub>(8).
ru: Аргументы, переданные ядру Linux во время начальной загрузки. Часто это делается через менеджер начальной загрузки, такой как B<lilo>(8) или B<grub>(8).

source: I</proc/config.gz> (since Linux 2.6)
ru: I</proc/config.gz> (начиная с Linux 2.6)

source: This file exposes the configuration options that were used to build the currently running kernel, in the same format as they would be shown in the I<.config> file that resulted when configuring the kernel (using I<make xconfig>, I<make config>, or similar). The file contents are compressed; view or search them using B<zcat>(1) and B<zgrep>(1). As long as no changes have been made to the following file, the contents of I</proc/config.gz> are the same as those provided by:
ru: В этом файле представлены параметры настройки, которые использовались при сборке выполняющегося в данный момент ядра. Его формат одинаков с файлом I<.config>, который создаётся после настройки ядра (с помощью I<make xconfig>, I<make config> и подобных команд). Содержимое файла сжато; для просмотра и поиска используйте B<zcat>(1) и B<zgrep>(1). Пока не внесены изменения в настройку ядра, содержимое I</proc/config.gz> и показываемого по команде файла одинаково:

source: I</proc/config.gz> is provided only if the kernel is configured with B<CONFIG_IKCONFIG_PROC>.
ru: Файл I</proc/config.gz> доступен только, если ядро собрано с поддержкой B<CONFIG_IKCONFIG_PROC>.

source: A list of the ciphers provided by the kernel crypto API. For details, see the kernel I<Linux Kernel Crypto API> documentation available under the kernel source directory I<Documentation/crypto/> (or I<Documentation/DocBook> before 4.10; the documentation can be built using a command such as I<make htmldocs> in the root directory of the kernel source tree).
ru: Список алгоритмов шифрования, предоставляемых ядерным программным интерфейсом crypto. Подробности смотрите в документации ядра I<Linux Kernel Crypto API> из каталога исходного кода ядра I<Documentation/crypto/> (или в I<Documentation/DocBook> до версии 4.10; эта документация может быть создана по команде I<make htmldocs> в корневом каталоге дерева исходного кода ядра).

source: This is a collection of CPU and system architecture dependent items, for each supported architecture a different list. Two common entries are I<processor> which gives CPU number and I<bogomips>; a system constant that is calculated during kernel initialization. SMP machines have information for each CPU. The B<lscpu>(1) command gathers its information from this file.
ru: Это коллекция элементов, зависящих от процессора и системной архитектуры; для каждой поддерживаемой архитектуры список различен. Имеются только две общих записи: I<processor> \(em обозначает номер процессора и I<bogomips>\(em системная константа, которая высчитывается во время инициализации ядра. Для многопроцессорных машин информация предоставляется по каждому процессору. Команда B<lscpu>(1) берёт информацию из этого файла.

source: Text listing of major numbers and device groups. This can be used by MAKEDEV scripts for consistency with the kernel.
ru: Текстовый список старших (major) номеров устройств и групп устройств. Он может быть использован сценариями MAKEDEV для того, чтобы создать устройства, поддерживаемые ядром.

source: I</proc/diskstats> (since Linux 2.5.69)
ru: I</proc/diskstats> (начиная с Linux 2.5.69)

source: This file contains disk I/O statistics for each disk device. See the Linux kernel source file I<Documentation/iostats.txt> for further information.
ru: Файл со статистикой дискового ввода-вывода по каждому устройству. Дополнительная информация доступна в файле I<Documentation/iostats.txt> из исходного кода ядра Linux.

source: This is a list of the registered I<ISA> DMA (direct memory access) channels in use.
ru: Список рабочих зарегистрированных каналов DMA (прямого доступа в память) I<ISA>.

source: Empty subdirectory.
ru: Пустой подкаталог.

source: List of the execution domains (ABI personalities).
ru: Список доменов исполнения (индивидуально для ABI).

source: Frame buffer information when B<CONFIG_FB> is defined during kernel compilation.
ru: Информация о фрейм-буфере, если ядро собрано с поддержкой B<CONFIG_FB>.

source: A text listing of the filesystems which are supported by the kernel, namely filesystems which were compiled into the kernel or whose kernel modules are currently loaded. (See also B<filesystems>(5).) If a filesystem is marked with "nodev", this means that it does not require a block device to be mounted (e.g., virtual filesystem, network filesystem).
ru: Текстовый список файловых систем, которые поддерживаются ядром, а именно файловые системы, вкомпилированные в ядро или загруженные в данный момент модулями (смотрите также B<filesystems>(5)). Если файловая система помечена как «nodev», то это означает, что для неё не требуется монтировать блочное устройство (например, виртуальная и сетевая файловые системы).

source: Incidentally, this file may be used by B<mount>(8) when no filesystem is specified and it didn't manage to determine the filesystem type. Then filesystems contained in this file are tried (excepted those that are marked with "nodev").
ru: В частности, этот файл может использоваться программой B<mount>(8) для поиска нужной файловой системы, если она не указана при монтировании и её тип невозможно определить. При этом пробуются все файловые системы из этого файла (за исключением помеченных как «nodev»).

source: Contains subdirectories that in turn contain files with information about (certain) mounted filesystems.
ru: Содержит подкаталоги, которые, в свою очередь, содержат файлы с информацией о (некоторых) смонтированных файловых системах.

source: This directory exists on systems with the IDE bus. There are directories for each IDE channel and attached device. Files include:
ru: Данный подкаталог существует в системах с шиной IDE. Для каждого канала IDE и подключенных устройств имеется отдельный каталог. Файлы каталога:

source: cache buffer size in KB capacity number of sectors driver driver version geometry physical and logical geometry identify in hexadecimal media media type model manufacturer's model number settings drive settings smart_thresholds in hexadecimal smart_values in hexadecimal
ru: cache размер буфера в KБ capacity количество секторов driver версия драйвера geometry физическая и логическая геометрия identify в шестнадцатеричном виде media тип носителя model номер модели производителя settings настройки драйвера smart_thresholds в шестнадцатеричном виде smart_values в шестнадцатеричном виде

source: The B<hdparm>(8) utility provides access to this information in a friendly format.
ru: Утилита B<hdparm>(8) предоставляет доступ к этой информации в дружественном формате.

source: This is used to record the number of interrupts per CPU per IO device. Since Linux 2.6.24, for the i386 and x86-64 architectures, at least, this also includes interrupts internal to the system (that is, not associated with a device as such), such as NMI (nonmaskable interrupt), LOC (local timer interrupt), and for SMP systems, TLB (TLB flush interrupt), RES (rescheduling interrupt), CAL (remote function call interrupt), and possibly others. Very easy to read formatting, done in ASCII.
ru: Используется для записи количества прерываний по каждому процессору и по каждому устройству ввода-вывода. Начиная с Linux 2.6.24 для архитектур i386- и x86-64 (по крайней мере), также включены внутренние прерывания системы (то есть, не связанные с устройством как таковым), такими как NMI (немаскируемые прерывания), LOC (прерывание локального таймера) и для многопроцессорных систем: TLB (прерывание сброса TLB), RES (прерывание перепланирования), CAL (прерывание вызова удалённой функции), и, возможно другие. Очень легко понять, так как записи в ASCII.

source: I/O memory map in Linux 2.4.
ru: Карта памяти ввода/вывода в Linux 2.4.

source: This is a list of currently registered Input-Output port regions that are in use.
ru: Список зарегистрированных областей портов ввода-вывода, которые используются в данный момент.

source: I</proc/kallsyms> (since Linux 2.5.71)
ru: I</proc/kallsyms> (начиная с Linux 2.5.71)

source: This holds the kernel exported symbol definitions used by the B<modules>(X) tools to dynamically link and bind loadable modules. In Linux 2.5.47 and earlier, a similar file with slightly different syntax was named I<ksyms>.
ru: Содержит определения экспортируемых ядром символов, используемые инструментами B<modules>(X) для динамической компоновки и связывания загружаемых модулей. В Linux 2.5.47 и ранее был подобный файл I<ksyms>, но имел немного другой синтаксис.

source: This file represents the physical memory of the system and is stored in the ELF core file format. With this pseudo-file, and an unstripped kernel (I</usr/src/linux/vmlinux>) binary, GDB can be used to examine the current state of any kernel data structures.
ru: Этот файл отображает физическую память системы и хранится в формате ELF core. С помощью этого псевдо-файла и ядра, из которого не убраны таблицы символов (I</usr/src/linux/vmlinux>), можно использовать GDB для проверки текущего состояния любых структур данных ядра.

source: The total length of the file is the size of physical memory (RAM) plus 4\ KiB.
ru: Полная длина этого файла \(em это размер физической памяти (RAM) плюс 4\ КиБ.

source: I</proc/keys> (since Linux 2.6.10)
ru: I</proc/keys> (начиная с Linux 2.6.10)

source: See B<keyrings>(7).
ru: Смотрите B<keyrings>(7).

source: I</proc/key-users> (since Linux 2.6.10)
ru: I</proc/key-users> (начиная с Linux 2.6.10)

source: This file can be used instead of the B<syslog>(2) system call to read kernel messages. A process must have superuser privileges to read this file, and only one process should read this file. This file should not be read if a syslog process is running which uses the B<syslog>(2) system call facility to log kernel messages.
ru: Этот файл может быть использован вместо системного вызова B<syslog>(2) для чтения сообщений ядра. Процесс должен иметь привилегии суперпользователя, чтобы читать этот файл, причём делать это может только один процесс. Данный файл невозможно прочесть, если запущен процесс syslog, который использует системный вызов B<syslog>(2) для протоколирования сообщений ядра.

source: Information in this file is retrieved with the B<dmesg>(1) program.
ru: Информация из этого файла извлекается с помощью программы B<dmesg>(1).

source: I</proc/kpagecgroup> (since Linux 4.3)
ru: I</proc/kpagecgroup> (начиная с Linux 4.3)

source: This file contains a 64-bit inode number of the memory cgroup each page is charged to, indexed by page frame number (see the discussion of I</proc/[pid]/pagemap>).
ru: В этом файле содержится 64-битный номер иноды, относящийся к каждой странице памяти cgroup, проиндексированные по номеру страничного кадра (смотрите описание I</proc/[pid]/pagemap>).

source: The I</proc/kpagecgroup> file is present only if the B<CONFIG_MEMCG> kernel configuration option is enabled.
ru: Файл I</proc/kpagecgroup> существует только, если включён параметр настройки ядра B<CONFIG_MEMCG>.

source: I</proc/kpagecount> (since Linux 2.6.25)
ru: I</proc/kpagecount> (начиная с Linux 2.6.25)

source: This file contains a 64-bit count of the number of times each physical page frame is mapped, indexed by page frame number (see the discussion of I</proc/[pid]/pagemap>).
ru: В этом файле содержится 64-битный счётчик, который показывает сколько раз отображался каждый физический страничный кадр (physical page frame). Индексация счётчиков выполнена по номеру страничного кадра (смотрите описание I</proc/[pid]/pagemap>).

source: The I</proc/kpagecount> file is present only if the B<CONFIG_PROC_PAGE_MONITOR> kernel configuration option is enabled.
ru: Файл I</proc/kpagecount> существует только, если включён параметр настройки ядра B<CONFIG_PROC_PAGE_MONITOR>.

source: I</proc/kpageflags> (since Linux 2.6.25)
ru: I</proc/kpageflags> (начиная с Linux 2.6.25)

source: This file contains 64-bit masks corresponding to each physical page frame; it is indexed by page frame number (see the discussion of I</proc/[pid]/pagemap>). The bits are as follows:
ru: В этом файле содержится 64-битная маска каждого физического страничного кадра (physical page frame); Индексация масок выполнена по номеру страничного кадра (смотрите описание I</proc/[pid]/pagemap>). Биты маски:
