Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_p/*.po
Languages: ru

source: The returned attribute values may differ from the corresponding attribute values passed in the I<attr> object that was used to create the thread using B<pthread_create>(3). In particular, the following attributes may differ:
ru: Возвращаемые значения атрибутов могут отличаться от соответствующих значений атрибутов переданных в объекте I<attr>, который использовался при создании нити с помощью B<pthread_create>(3). В частности, могут отличаться следующие атрибуты:

source: the detach state, since a joinable thread may have detached itself after creation;
ru: состояние отсоединения, так как присоединяемая нить могла сама отсоединиться после создания;

source: the stack size, which the implementation may align to a suitable boundary.
ru: размер стека, так как реализация нитей могла выронить значение по уместной границе.

source: and the guard size, which the implementation may round upward to a multiple of the page size, or ignore (i.e., treat as 0), if the application is allocating its own stack.
ru: размер защиты, так как реализация нитей могла округлить значение в большую сторону до кратного размера страницы, или проигнорировать (т. е., посчитать за 0), если приложение само выделяет себе стек.

source: Furthermore, if the stack address attribute was not set in the thread attributes object used to create the thread, then the returned thread attributes object will report the actual stack address that the implementation selected for the thread.
ru: Кроме этого, если атрибут адреса стека не был указан в объекте атрибутов нити при создании нити, то возвращаемый объект атрибутов нити будет содержать актуальный адрес стека, который был выбран реализацией для нити.

source: When the thread attributes object returned by B<pthread_getattr_np>() is no longer required, it should be destroyed using B<pthread_attr_destroy>(3).
ru: Когда объект атрибутов нити, возвращаемый B<pthread_getattr_np>(), больше не требуется, то он должен быть удалён с помощью B<pthread_attr_destroy>(3).

source: On success, this function returns 0; on error, it returns a nonzero error number.
ru: При успешном выполнении функция возвращает 0; при ошибке возвращается ненулевой номер ошибки.

source: Insufficient memory.
ru: Недостаточно памяти.

source: In addition, if I<thread> refers to the main thread, then B<pthread_getattr_np>() can fail because of errors from various underlying calls: B<fopen>(3), if I</proc/self/maps> can't be opened; and B<getrlimit>(2), if the B<RLIMIT_STACK> resource limit is not supported.
ru: Также, если I<thread> указывает на главную нить, то B<pthread_getattr_np>() может завершиться с ошибкой из-за ошибок различных используемых вызовов: B<fopen>(3), если невозможно открыть I</proc/self/maps>; B<getrlimit>(2), если не поддерживается ограничение ресурса B<RLIMIT_STACK>.

source: This function is available in glibc since version 2.2.3.
ru: Эта функция доступна в glibc начиная с версии 2.2.3.

source: This function is a nonstandard GNU extension; hence the suffix "_np" (nonportable) in the name.
ru: Эта функция является нестандартным расширением GNU, о чём свидетельствует наличие суффикса «_np» (nonportable).

source: The program below demonstrates the use of B<pthread_getattr_np>(). The program creates a thread that then uses B<pthread_getattr_np>() to retrieve and display its guard size, stack address, and stack size attributes. Command-line arguments can be used to set these attributes to values other than the default when creating the thread. The shell sessions below demonstrate the use of the program.
ru: В программе, показанной далее, демонстрируется использование B<pthread_getattr_np>(). Программа создаёт нить, которая, затем, использует B<pthread_getattr_np>() для получения и показа своих атрибутов размера защиты, адреса стека и размера стека. Аргументами командной строки можно изменить эти атрибуты. Работа программы показана далее.

source: In the first run, on an x86-32 system, a thread is created using default attributes:
ru: В этом запуске на системе x86-32 нить создаётся со значениями атрибутов по умолчанию:

source: $B< ulimit -s> # No stack limit ==E<gt> default stack size is 2 MB unlimited $B< ./a.out> Attributes of created thread: Guard size = 4096 bytes Stack address = 0x40196000 (EOS = 0x40397000) Stack size = 0x201000 (2101248) bytes
ru: $B< ulimit -s> # Без ограничения стека ==E<gt> # размер стека по умолчанию 2 МБ unlimited $B< ./a.out> Атрибуты созданной нити: Размер защиты = 4096 байт Адрес стека = 0x40196000 (EOS = 0x40397000) Размер стека = 0x201000 (2101248) байт

source: In the following run, we see that if a guard size is specified, it is rounded up to the next multiple of the system page size (4096 bytes on x86-32):
ru: В этом запуске мы видим, что при задании размера защиты его значение округляется до значение следующего кратного размера системной страницы (4096 байт на x86-32):

source: $B< ./a.out -g 4097> Thread attributes object after initializations: Guard size = 4097 bytes Stack address = (nil) Stack size = 0x0 (0) bytes
ru: $B< ./a.out -g 4097> Объект атрибутов нити после инициализации: Размер защиты = 4097 байт Адрес стека = (nil) Размер стека = 0x0 (0) байт

source: Attributes of created thread: Guard size = 8192 bytes Stack address = 0x40196000 (EOS = 0x40397000) Stack size = 0x201000 (2101248) bytes
ru: Атрибуты созданной нити: Размер защиты = 8192 байт Адрес стека = 0x40196000 (EOS = 0x40397000) Размер стека = 0x201000 (2101248) байт

source: In the last run, the program manually allocates a stack for the thread. In this case, the guard size attribute is ignored.
ru: В этом запуске программа вручную выделяет стек для нити. В этом случае атрибут размера защиты игнорируется.

source: $B< ./a.out -g 4096 -s 0x8000 -a> Allocated thread stack at 0x804d000
ru: $B< ./a.out -g 4096 -s 0x8000 -a> Выделен стек нити по адресу 0x804d000

source: Thread attributes object after initializations: Guard size = 4096 bytes Stack address = 0x804d000 (EOS = 0x8055000) Stack size = 0x8000 (32768) bytes
ru: Объект атрибутов нити после инициализации: Размер защиты = 4096 байт Адрес стека = 0x804d000 (EOS = 0x8055000) Размер стека = 0x8000 (32768) байт

source: Attributes of created thread: Guard size = 0 bytes Stack address = 0x804d000 (EOS = 0x8055000) Stack size = 0x8000 (32768) bytes
ru: Атрибуты созданной нити: Размер защиты = 0 байт Адрес стека = 0x804d000 (EOS = 0x8055000) Размер стека = 0x8000 (32768) байт

source: #define _GNU_SOURCE /* To get pthread_getattr_np() declaration */ #include E<lt>pthread.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>errno.hE<gt>
ru: #define _GNU_SOURCE /* для объявления pthread_getattr_np() */ #include E<lt>pthread.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>errno.hE<gt>

source: s = pthread_attr_getguardsize(attr, &guard_size); if (s != 0) handle_error_en(s, "pthread_attr_getguardsize"); printf("%sGuard size = %d bytes\en", prefix, guard_size);
ru: s = pthread_attr_getguardsize(attr, &guard_size); if (s != 0) handle_error_en(s, "pthread_attr_getguardsize"); printf("%sРазмер защиты = %d байт\en", prefix, guard_size);

source: s = pthread_attr_getstack(attr, &stack_addr, &stack_size); if (s != 0) handle_error_en(s, "pthread_attr_getstack"); printf("%sStack address = %p", prefix, stack_addr); if (stack_size E<gt> 0) printf(" (EOS = %p)", (char *) stack_addr + stack_size); printf("\en"); printf("%sStack size = 0x%x (%d) bytes\en", prefix, stack_size, stack_size); }
ru: s = pthread_attr_getstack(attr, &stack_addr, &stack_size); if (s != 0) handle_error_en(s, "pthread_attr_getstack"); printf("%sАдрес стека = %p", prefix, stack_addr); if (stack_size E<gt> 0) printf(" (EOS = %p)", (char *) stack_addr + stack_size); printf("\en"); printf("%sРазмер стека = 0x%x (%d) байт\en", prefix, stack_size, stack_size); }

source: static void * /* Start function for thread we create */ thread_start(void *arg) { printf("Attributes of created thread:\en"); display_thread_attributes(pthread_self(), "\et");
ru: static void * /* Начальная функция создаваемой нити */ thread_start(void *arg) { printf("Атрибуты созданной нити:\en"); display_thread_attributes(pthread_self(), "\et");

source: exit(EXIT_SUCCESS); /* Terminate all threads */ }
ru: exit(EXIT_SUCCESS); /* Завершить все нити */ }

source: static void usage(char *pname, char *msg) { if (msg != NULL) fputs(msg, stderr); fprintf(stderr, "Usage: %s [-s stack-size [-a]]" " [-g guard-size]\en", pname); fprintf(stderr, "\et\et-a means program should allocate stack\en"); exit(EXIT_FAILURE); }
ru: static void usage(char *pname, char *msg) { if (msg != NULL) fputs(msg, stderr); fprintf(stderr, "Использование: %s [-s stack-size [-a]]" " [-g guard-size]\en", pname); fprintf(stderr, "\et\et-a означает, что программа выделяет стек\en"); exit(EXIT_FAILURE); }

source: static pthread_attr_t * /* Get thread attributes from command line */ get_thread_attributes_from_cl(int argc, char *argv[], pthread_attr_t *attrp) { int s, opt, allocate_stack; long stack_size, guard_size; void *stack_addr; pthread_attr_t *ret_attrp = NULL; /* Set to attrp if we initialize a thread attributes object */ allocate_stack = 0; stack_size = -1; guard_size = -1;
ru: static pthread_attr_t * /* получить атрибуты нити из ком. строки */ get_thread_attributes_from_cl(int argc, char *argv[], pthread_attr_t *attrp) { int s, opt, allocate_stack; long stack_size, guard_size; void *stack_addr; pthread_attr_t *ret_attrp = NULL; /* задаёт attrp, если мы инициализируем объект атрибутов нити */ allocate_stack = 0; stack_size = -1; guard_size = -1;

source: if (allocate_stack && stack_size == -1) usage(argv[0], "Specifying -a without -s makes no sense\en");
ru: if (allocate_stack && stack_size == -1) usage(argv[0], "Указывать -a без -s не имеет смысла\en");

source: if (argc E<gt> optind) usage(argv[0], "Extraneous command-line arguments\en");
ru: if (argc E<gt> optind) usage(argv[0], "Посторонние аргументы в командной строке\en");

source: if (stack_size E<gt>= 0) { if (!allocate_stack) { s = pthread_attr_setstacksize(attrp, stack_size); if (s != 0) handle_error_en(s, "pthread_attr_setstacksize"); } else { s = posix_memalign(&stack_addr, sysconf(_SC_PAGESIZE), stack_size); if (s != 0) handle_error_en(s, "posix_memalign"); printf("Allocated thread stack at %p\en\en", stack_addr);
ru: if (stack_size E<gt>= 0) { if (!allocate_stack) { s = pthread_attr_setstacksize(attrp, stack_size); if (s != 0) handle_error_en(s, "pthread_attr_setstacksize"); } else { s = posix_memalign(&stack_addr, sysconf(_SC_PAGESIZE), stack_size); if (s != 0) handle_error_en(s, "posix_memalign"); printf("Выделен стек нити по адресу %p\en\en", stack_addr);

source: int main(int argc, char *argv[]) { int s; pthread_t thr; pthread_attr_t attr; pthread_attr_t *attrp = NULL; /* Set to &attr if we initialize a thread attributes object */
ru: int main(int argc, char *argv[]) { int s; pthread_t thr; pthread_attr_t attr; pthread_attr_t *attrp = NULL; /* задаёт &attr, если мы инициализируем объект атрибутов нити */

source: if (attrp != NULL) { printf("Thread attributes object after initializations:\en"); display_stack_related_attributes(attrp, "\et"); printf("\en"); }
ru: if (attrp != NULL) { printf("Объект атрибутов нити после инициализации:\en"); display_stack_related_attributes(attrp, "\et"); printf("\en"); }

source: pause(); /* Terminates when other thread calls exit() */ }
ru: pause(); /* Завершается, когда другая нить вызывает exit() */ }

source: pthread_setaffinity_np, pthread_getaffinity_np - set/get CPU affinity of a thread
ru: pthread_setaffinity_np, pthread_getaffinity_np - получить/назначить увязываемый ЦП для нити

source: The B<pthread_setaffinity_np>() function sets the CPU affinity mask of the thread I<thread> to the CPU set pointed to by I<cpuset>. If the call is successful, and the thread is not currently running on one of the CPUs in I<cpuset>, then it is migrated to one of those CPUs.
ru: Функция B<pthread_setaffinity_np>() устанавливает маску увязывания ЦП для нити I<thread> равной набору ЦП, указанному в I<cpuset>. Если вызов выполняется без ошибок и нить не запущена ни на одном из ЦП в I<cpuset>, то она перемещается на один из этих ЦП.

source: The B<pthread_getaffinity_np>() function returns the CPU affinity mask of the thread I<thread> in the buffer pointed to by I<cpuset>.
ru: Функция B<pthread_getaffinity_np>() помещает маску увязывания ЦП для нити I<thread> в буфер, на который указывает I<cpuset>.

source: For more details on CPU affinity masks, see B<sched_setaffinity>(2). For a description of a set of macros that can be used to manipulate and inspect CPU sets, see B<CPU_SET>(3).
ru: Дополнительную информацию по маскам увязывания ЦП смотрите в B<sched_setaffinity>(2). Описание набора макросов, которые можно использовать для просмотра и изменения наборов ЦП, смотрите в B<CPU_SET>(3).

source: The argument I<cpusetsize> is the length (in bytes) of the buffer pointed to by I<cpuset>. Typically, this argument would be specified as I<sizeof(cpu_set_t)>. (It may be some other value, if using the macros described in B<CPU_SET>(3) for dynamically allocating a CPU set.)
ru: В аргументе I<cpusetsize> указывается длина буфера (в байтах), на который указывает I<cpuset>. Обычно, этот аргумент должен задаваться как I<sizeof(cpu_set_t)> (он может иметь и другое значение, если используются макросы динамического выделения набора ЦП, описанные в B<CPU_SET>(3)).

source: On success, these functions return 0; on error, they return a nonzero error number.
ru: При успешном выполнении эти функции возвращают 0; при ошибке возвращается ненулевой номер ошибки.

source: A supplied memory address was invalid.
ru: Указан некорректный адрес памяти.

source: (B<pthread_setaffinity_np>()) The affinity bit mask I<mask> contains no processors that are currently physically on the system and permitted to the thread according to any restrictions that may be imposed by the "cpuset" mechanism described in B<cpuset>(7).
ru: (B<pthread_setaffinity_np>()) В маске увязывания ЦП I<mask> указаны процессоры, которых физически нет в системе, и которые разрешены нити согласно любым ограничениям, которые могут налагаться механизмом «cpuset», описанном в B<cpuset>(7).

source: (B<pthread_setaffinity_np>()) I<cpuset> specified a CPU that was outside the set supported by the kernel. (The kernel configuration option B<CONFIG_NR_CPUS> defines the range of the set supported by the kernel data type used to represent CPU sets.)
ru: (B<pthread_setaffinity_np>()) В I<cpuset> указан ЦП, который находится вне набора поддерживаемых ядром (в параметре сборки ядра B<CONFIG_NR_CPUS> определён диапазон для набора, поддерживаемого типом данных ядра, который используется для представления наборов ЦП).

source: (B<pthread_getaffinity_np>()) I<cpusetsize> is smaller than the size of the affinity mask used by the kernel.
ru: (B<pthread_getaffinity_np>()) Значение I<cpusetsize> меньше размера маски увязывания, используемой в ядре.

source: These functions are provided by glibc since version 2.3.4.
ru: Эти функции определены в glibc начиная с версии 2.3.4.

source: These functions are nonstandard GNU extensions; hence the suffix "_np" (nonportable) in the names.
ru: Данные функции являются не стандартизированными расширениями GNU, о чём свидетельствует наличие суффикса «_np» (nonportable).

source: After a call to B<pthread_setaffinity_np>(), the set of CPUs on which the thread will actually run is the intersection of the set specified in the I<cpuset> argument and the set of CPUs actually present on the system. The system may further restrict the set of CPUs on which the thread runs if the "cpuset" mechanism described in B<cpuset>(7) is being used. These restrictions on the actual set of CPUs on which the thread will run are silently imposed by the kernel.
ru: После вызова B<pthread_setaffinity_np>() набор процессоров, на которых действительно будет выполняться нить, вычисляется пересечением набора из аргумента I<cpuset> и набором процессоров, присутствующих в системе. В дальнейшем, система может ограничить набор процессоров нити, если задействован механизм «cpuset», описанный в B<cpuset>(7). Эти ограничения на действительный набор процессоров, используемых для нити, без уведомления налагаются ядром.

source: These functions are implemented on top of the B<sched_setaffinity>(2) and B<sched_getaffinity>(2) system calls.
ru: Эти функции реализованы через системные вызовы B<sched_setaffinity>(2) и B<sched_getaffinity>(2).

source: In glibc 2.3.3 only, versions of these functions were provided that did not have a I<cpusetsize> argument. Instead the CPU set size given to the underlying system calls was always I<sizeof(cpu_set_t)>.
ru: В glibc 2.3.3 версии этих функций не имеют аргумента I<cpusetsize>. Вместо него размер набора ЦП, передаваемый используемым системным вызовам, всегда равен I<sizeof(cpu_set_t)>.

source: A new thread created by B<pthread_create>(3) inherits a copy of its creator's CPU affinity mask.
ru: Новая нить, созданная B<pthread_create>(3), наследует копию маски увязывания ЦП своего создателя.

source: In the following program, the main thread uses B<pthread_setaffinity_np>() to set its CPU affinity mask to include CPUs 0 to 7 (which may not all be available on the system), and then calls B<pthread_getaffinity_np>() to check the resulting CPU affinity mask of the thread.
ru: В этой программе главная нить использует B<pthread_setaffinity_np>() для включения в свою маску увязывания ЦП процессоры с 0 по 7 (которых может не быть в системе), а затем вызывает B<pthread_getaffinity_np>() для проверки получившейся маски увязывания ЦП у нити.

source: /* Set affinity mask to include CPUs 0 to 7 */
ru: /* включаем ЦП с 0 по 7 в маску увязывания */

source: /* Check the actual affinity mask assigned to the thread */
ru: /* проверяем маску увязывания, назначенную нити */

source: printf("Set returned by pthread_getaffinity_np() contained:\en"); for (j = 0; j E<lt> CPU_SETSIZE; j++) if (CPU_ISSET(j, &cpuset)) printf(" CPU %d\en", j);
ru: printf("Набор, возвращённый pthread_getaffinity_np(), содержит:\en"); for (j = 0; j E<lt> CPU_SETSIZE; j++) if (CPU_ISSET(j, &cpuset)) printf(" ЦП %d\en", j);

source: pthread_cleanup_push, pthread_cleanup_pop - push and pop thread cancellation clean-up handlers
ru: pthread_cleanup_push, pthread_cleanup_pop - помещает и выталкивает очищающие обработчики при отмене нити

source: These functions manipulate the calling thread's stack of thread-cancellation clean-up handlers. A clean-up handler is a function that is automatically executed when a thread is canceled (or in various other circumstances described below); it might, for example, unlock a mutex so that it becomes available to other threads in the process.
ru: Данные функции управляют стеком нити, вызывающим очищающие обработчики при отмене нити. Очищающий обработчик — это функция, которая автоматически вызывается при отмене нити (или в при других обстоятельствах, описанных ниже); это может быть, например, отмена блокировки мьютекса, при которой он становится доступным другим нитям процесса.

source: The B<pthread_cleanup_push>() function pushes I<routine> onto the top of the stack of clean-up handlers. When I<routine> is later invoked, it will be given I<arg> as its argument.
ru: Функция B<pthread_cleanup_push>() помещает обработчик I<routine> наверх стека очищающих обработчиков. Позднее, при вызове I<routine>, ему будет передан I<arg> в качестве аргумента.

source: The B<pthread_cleanup_pop>() function removes the routine at the top of the stack of clean-up handlers, and optionally executes it if I<execute> is nonzero.
ru: Функция B<pthread_cleanup_pop>() удаляет обработчик с вершины стека очищающих обработчиков, и, возможно, выполняет его, если I<execute> не равно нулю.

source: A cancellation clean-up handler is popped from the stack and executed in the following circumstances:
ru: Очищающий обработчик при отмене выталкивается из стека и выполняется при следующих условиях:

source: When a thread is canceled, all of the stacked clean-up handlers are popped and executed in the reverse of the order in which they were pushed onto the stack.
ru: Когда нить отменяется, все очищающие обработчики из стека выталкиваются и вызываются в обратном порядке их помещения в стек.

source: When a thread terminates by calling B<pthread_exit>(3), all clean-up handlers are executed as described in the preceding point. (Clean-up handlers are I<not> called if the thread terminates by performing a I<return> from the thread start function.)
ru: Когда нить завершается вызовом B<pthread_exit>(3), все очищающие обработчики выполняются как описано в предыдущем пункте (очищающие обработчики I<не> вызываются, если нить завершается I<возвратом> из начальной функции нити).

source: When a thread calls B<pthread_cleanup_pop>() with a nonzero I<execute> argument, the top-most clean-up handler is popped and executed.
ru: Когда нить вызывает B<pthread_cleanup_pop>() с ненулевым значением аргумента I<execute>, самый верхний очищающий обработчик выталкивается и выполняется.

source: POSIX.1 permits B<pthread_cleanup_push>() and B<pthread_cleanup_pop>() to be implemented as macros that expand to text containing \(aqB<{>\(aq and \(aqB<}>\(aq, respectively. For this reason, the caller must ensure that calls to these functions are paired within the same function, and at the same lexical nesting level. (In other words, a clean-up handler is established only during the execution of a specified section of code.)
ru: В POSIX.1 допускается реализация B<pthread_cleanup_push>() и B<pthread_cleanup_pop>() в виде макросов, которые раскрывают текст, содержащий \(aqB<{>\(aq и \(aqB<}>\(aq, соответственно. По этой причине, вызывающий должен убедиться, что вызовы этих функций используются парно в одной функции и на одном лексическом уровне вложенности (другими словами, очищающий обработчик устанавливается только во время выполнения определённой секции кода).

source: Calling B<longjmp>(3) (B<siglongjmp>(3)) produces undefined results if any call has been made to B<pthread_cleanup_push>() or B<pthread_cleanup_pop>() without the matching call of the pair since the jump buffer was filled by B<setjmp>(3) (B<sigsetjmp>(3)). Likewise, calling B<longjmp>(3) (B<siglongjmp>(3)) from inside a clean-up handler produces undefined results unless the jump buffer was also filled by B<setjmp>(3) (B<sigsetjmp>(3)) inside the handler.
ru: Вызов B<longjmp>(3) (B<siglongjmp>(3)) приводит к непредсказуемым результатам, если был сделан любой вызов в B<pthread_cleanup_push>() или B<pthread_cleanup_pop>() без соответствующего вызову пары, так как буфер перехода (jump buffer) был заполнен B<setjmp>(3) (B<sigsetjmp>(3)). Подобным образом, вызов B<longjmp>(3) (B<siglongjmp>(3)) изнутри очищающего обработчика приводит к непредсказуемым результатам, если буфер перехода также не был заполнен B<setjmp>(3) (B<sigsetjmp>(3)) внутри обработчика.

source: These functions do not return a value.
ru: Данные функции не возвращают никаких значений.

source: There are no errors.
ru: Эти функции не вызывают ошибок.

source: On Linux, the B<pthread_cleanup_push>() and B<pthread_cleanup_pop>() functions I<are> implemented as macros that expand to text containing \(aqB<{>\(aq and \(aqB<}>\(aq, respectively. This means that variables declared within the scope of paired calls to these functions will be visible within only that scope.
ru: В Linux, функции B<pthread_cleanup_push>() и B<pthread_cleanup_pop>() реализованы в виде макросов, которые расширяются до текста, содержащего \(aqB<{>\(aq и \(aqB<}>\(aq, соответственно. Это означает, что переменные, объявленные внутри области парных вызовов этих функций, будут видимы внутри только этой области.
