Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The receive buffer pointer(s) point outside the process's address space.
ru: Указатель на приёмный буфер указывает вне адресного пространства процесса.

source: The receive was interrupted by delivery of a signal before any data was available; see B<signal>(7).
ru: Приём данных был прерван сигналом, а данные ещё не были доступны; смотрите B<signal>(7).

source: Invalid argument passed.
ru: Передан неверный аргумент.

source: Could not allocate memory for B<recvmsg>().
ru: Не удалось выделить память для B<recvmsg>().

source: The socket is associated with a connection-oriented protocol and has not been connected (see B<connect>(2) and B<accept>(2)).
ru: Сокет, связанный с протоколом, ориентированным на соединение, не был соединён (см. B<connect>(2) и B<accept>(2)).

source: The file descriptor I<sockfd> does not refer to a socket.
ru: Файловый дескриптор I<sockfd> указывает не на каталог.

source: POSIX.1-2001, POSIX.1-2008, 4.4BSD (these interfaces first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, 4.4BSD (эти интерфейсы впервые появились в 4.2BSD).

source: POSIX.1 describes only the B<MSG_OOB>, B<MSG_PEEK>, and B<MSG_WAITALL> flags.
ru: В POSIX.1 описаны только флаги B<MSG_OOB>, B<MSG_PEEK> и B<MSG_WAITALL>.

source: If a zero-length datagram is pending, B<read>(2) and B<recv>() with a I<flags> argument of zero provide different behavior. In this circumstance, B<read>(2) has no effect (the datagram remains pending), while B<recv>() consumes the pending datagram.
ru: Если ожидает дейтаграмма нулевой длины, то B<read>(2) и B<recv>() с нулевым аргументом I<flags> работают по-разному. В этом случае B<read>(2) ничего не делает (дейтаграмма продолжает ждать), а B<recv>() обрабатывает ожидающую дейтаграмму.

source: The I<socklen_t> type was invented by POSIX. See also B<accept>(2).
ru: Тип I<socklen_t> появился из POSIX. Также смотрите B<accept>(2).

source: According to POSIX.1, the I<msg_controllen> field of the I<msghdr> structure should be typed as I<socklen_t>, but glibc currently types it as I<size_t>.
ru: В соответствие с POSIX.1 поле I<msg_controllen> структуры I<msghdr> должно иметь тип I<socklen_t>, но в настоящее время в glibc оно имеет тип I<size_t>.

source: See B<recvmmsg>(2) for information about a Linux-specific system call that can be used to receive multiple datagrams in a single call.
ru: В B<recvmmsg>(2) можно найти информацию о специальном системном вызове Linux, который можно использовать для приёма нескольких датаграмм за один вызов.

source: An example of the use of B<recvfrom>() is shown in B<getaddrinfo>(3).
ru: Пример использования B<recvfrom>() показан в B<getaddrinfo>(3).

source: removexattr, lremovexattr, fremovexattr - remove an extended attribute
ru: removexattr, lremovexattr, fremovexattr - удаление расширенных атрибутов

source: Extended attributes are I<name>:I<value> pairs associated with inodes (files, directories, symbolic links, etc.). They are extensions to the normal attributes which are associated with all inodes in the system (i.e., the B<stat>(2) data). A complete overview of extended attributes concepts can be found in B<xattr>(7).
ru: Расширенные атрибуты представляют собой пару I<имя>:I<значение> и связываются с записями inode (файлы, каталоги, символьные ссылки и т.п.). Они являются расширениями к обычным атрибутам, связанным со всеми записями inode в системе (например, данные B<stat>(2)). Полное описание модели расширенных атрибутов можно найти в B<xattr>(7).

source: B<removexattr>() removes the extended attribute identified by I<name> and associated with the given I<path> in the filesystem.
ru: Вызов B<removexattr>() удаляет расширенный атрибут с именем, заданным в I<name> и связанный с заданным I<path> в файловой системе.

source: B<lremovexattr>() is identical to B<removexattr>(), except in the case of a symbolic link, where the extended attribute is removed from the link itself, not the file that it refers to.
ru: Вызов B<lremovexattr>() идентичен B<removexattr>(), за исключением случая работы с символьными ссылками; он удаляет расширенный атрибут на ссылке, а не на файле, на который она указывает.

source: B<fremovexattr>() is identical to B<removexattr>(), only the extended attribute is removed from the open file referred to by I<fd> (as returned by B<open>(2)) in place of I<path>.
ru: Вызов B<fremovexattr>() идентичен B<removexattr>(), отличием является то, что расширенный атрибут удаляется у открытого файла, на который указывает I<fd> (возвращаемый B<open>(2)), а не на указанном в I<path>.

source: An extended attribute name is a null-terminated string. The I<name> includes a namespace prefix; there may be several, disjoint namespaces associated with an individual inode.
ru: Имя расширенного атрибута представляет собой строку, заканчивающуюся NULL. Имя I<name> включает префикс пространства имён; их может быть несколько, разрозненные пространства ассоциируются с разными inode.

source: On success, zero is returned. On failure, -1 is returned and I<errno> is set appropriately.
ru: При успешном выполнении возвращается ноль. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The named attribute does not exist.
ru: Указанный атрибут не существует.

source: Extended attributes are not supported by the filesystem, or are disabled.
ru: Расширенные атрибуты не поддерживаются файловой системой или отключены.

source: In addition, the errors documented in B<stat>(2) can also occur.
ru: Также могут возникать ошибки, описанные в B<stat>(2).

source: These system calls have been available on Linux since kernel 2.4; glibc support is provided since version 2.3.
ru: Данные системные вызовы доступны в Linux начиная с ядра версии 2.4; поддержка в glibc появилась в версии 2.3.

source: readdir - read directory entry
ru: readdir - читает элемент каталога

source: This is not the function you are interested in. Look at B<readdir>(3) for the POSIX conforming C library interface. This page documents the bare kernel system call interface, which is superseded by B<getdents>(2).
ru: Эта не та функция, которая должна представлять для вас интерес. Смотрите описание функции B<readdir>(3), которая является интерфейсом библиотеки языка C, соответствующим стандарту POSIX. В этой странице описан минимальный интерфейс системного вызова ядра, который заменён на B<getdents>(2).

source: B<readdir>() reads one I<old_linux_dirent> structure from the directory referred to by the file descriptor I<fd> into the buffer pointed to by I<dirp>. The argument I<count> is ignored; at most one I<old_linux_dirent> structure is read.
ru: Вызов B<readdir>() читает структуру I<old_linux_dirent> из каталога, заданного файловым дескриптором I<fd>, в буфер, указываемый в I<dirp>. Аргумент I<count> игнорируется; всегда считывается только одна структура I<old_linux_dirent>.

source: The I<old_linux_dirent> structure is declared (privately in Linux kernel file B<fs/readdir.c>) as follows:
ru: Структура I<old_linux_dirent> определена (в файле ядра Linux B<fs/readdir.c>, недоступна извне) следующим образом:

source: struct old_linux_dirent { unsigned long d_ino; /* inode number */ unsigned long d_offset; /* offset to this I<old_linux_dirent> */ unsigned short d_namlen; /* length of this I<d_name> */ char d_name[1]; /* filename (null-terminated) */ }
ru: struct old_linux_dirent { unsigned long d_ino; /* номер иноды */ unsigned long d_offset; /* смещение на данную I<old_linux_dirent> */ unsigned short d_namlen; /* длина данной I<d_name> */ char d_name[1]; /* имя файла (с null в конце) */ }

source: I<d_ino> is an inode number. I<d_offset> is the distance from the start of the directory to this I<old_linux_dirent>. I<d_reclen> is the size of I<d_name>, not counting the terminating null byte (\(aq\e0\(aq). I<d_name> is a null-terminated filename.
ru: Значением I<d_ino> является номер иноды. В I<d_offset> задаётся смещение данной I<old_linux_dirent> от начала каталога. В I<d_reclen> задаётся размер I<d_name> без учета завершающего байта null (\(aq\e0\(aq). В I<d_name> указывается имя файла, завершающееся null.

source: On success, 1 is returned. On end of directory, 0 is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 1. Если каталог закончился возвращается 0. При ошибке возвращается -1, а переменной I<errno> присваивается номер ошибки.

source: Invalid file descriptor I<fd>.
ru: Неверный файловый дескриптор I<fd>.

source: Argument points outside the calling process's address space.
ru: Аргумент указывает за пределы адресного пространства вызывающего процесса.

source: Result buffer is too small.
ru: Буфер результата слишком мал.

source: No such directory.
ru: Заданный каталог не существует.

source: File descriptor does not refer to a directory.
ru: Файловый дескриптор указывает не на каталог.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2). You will need to define the I<old_linux_dirent> structure yourself. However, probably you should use B<readdir>(3) instead.
ru: В glibc нет обёртки для данного системного вызова; запускайте его с помощью B<syscall>(2). Структуру I<old_linux_dirent> нужно определить самостоятельно. Однако лучше использовать B<readdir>(3).

source: This system call does not exist on x86-64.
ru: Этот системный вызов отсутствует на x86-64.

source: reboot - reboot or enable/disable Ctrl-Alt-Del
ru: reboot - перезагружает систему и разрешает/запрещает использование комбинации Ctrl-Alt-Del

source: /* Since kernel version 2.1.30 there are symbolic names LINUX_REBOOT_* for the constants and a fourth argument to the call: */
ru: /* Начиная с версии ядра 2.1.30 появились символьные имена LINUX_REBOOT_* для констант и четвёртый аргумент вызова: */

source: /* Under glibc and most alternative libc's (including uclibc, dietlibc, musl and a few others), some of the constants involved have gotten symbolic names RB_*, and the library call is a 1-argument wrapper around the system call: */
ru: /* В glibc и в большинстве альтернативных libc (включая uclibc, deitlibc, musl и других) некоторым константам присвоены символьные имена RB_*, а библиотечная функция является обёрткой с одним аргументом вокруг системного вызова: */

source: The B<reboot>() call reboots the system, or enables/disables the reboot keystroke (abbreviated CAD, since the default is Ctrl-Alt-Delete; it can be changed using B<loadkeys>(1)).
ru: Вызов B<reboot>() перезагружает систему или разрешает/запрещает использование для перезагрузки специального сочетания клавиш (сокращённо CAD, от комбинации по умолчанию \(em Ctrl-Alt-Delete; может быть изменена с помощью B<loadkeys>(1)).

source: This system call fails (with the error B<EINVAL>) unless I<magic> equals B<LINUX_REBOOT_MAGIC1> (that is, 0xfee1dead) and I<magic2> equals B<LINUX_REBOOT_MAGIC2> (that is, 672274793). However, since 2.1.17 also B<LINUX_REBOOT_MAGIC2A> (that is, 85072278) and since 2.1.97 also B<LINUX_REBOOT_MAGIC2B> (that is, 369367448) and since 2.5.71 also B<LINUX_REBOOT_MAGIC2C> (that is, 537993216) are permitted as values for I<magic2>. (The hexadecimal values of these constants are meaningful.)
ru: Данный системный вызов завершается ошибкой (B<EINVAL>), если I<magic> не равен B<LINUX_REBOOT_MAGIC1> (0xfee1dead) и I<magic2> не равен B<LINUX_REBOOT_MAGIC2> (672274793). Однако, начиная с 2.1.17 в I<magic2> также можно использовать B<LINUX_REBOOT_MAGIC2A> (85072278) и начиная с 2.1.97 — B<LINUX_REBOOT_MAGIC2B> (369367448) и начиная с 2.5.71 — B<LINUX_REBOOT_MAGIC2C> (537993216) (шестнадцатеричные значения этих констант говорят сами за себя).

source: The I<cmd> argument can have the following values:
ru: Аргумент I<cmd> может принимать следующие значения:

source: (B<RB_DISABLE_CAD>, 0). CAD is disabled. This means that the CAD keystroke will cause a B<SIGINT> signal to be sent to init (process 1), whereupon this process may decide upon a proper action (maybe: kill all processes, sync, reboot).
ru: (B<RB_DISABLE_CAD>, 0). Запретить использование сочетания клавиш для перезагрузки системы (CAD). Это означает, что нажатие комбинации клавиш CAD приведёт к тому, что процессу init (с идентификатором 1) будет послан сигнал B<SIGINT>, после чего этот процесс может сам решить какие действия выполнять (возможно, послать сигналы процессам, выполнить команду sync, reboot).

source: (B<RB_ENABLE_CAD>, 0x89abcdef). CAD is enabled. This means that the CAD keystroke will immediately cause the action associated with B<LINUX_REBOOT_CMD_RESTART>.
ru: (B<RB_ENABLE_CAD>, 0x89abcdef). Разрешить использование сочетания клавиш для перезагрузки (CAD). Это означает, что нажатие комбинации клавиш CAD приведёт к немедленному выполнению действия, связанного с B<LINUX_REBOOT_CMD_RESTART>.

source: (B<RB_HALT_SYSTEM>, 0xcdef0123; since Linux 1.1.76). The message "System halted." is printed, and the system is halted. Control is given to the ROM monitor, if there is one. If not preceded by a B<sync>(2), data will be lost.
ru: (B<RB_HALT_SYSTEM>, 0xcdef0123; начиная с Linux 1.1.76) Выводится сообщение «System halted.» и система останавливается. Управление передается монитору в ПЗУ, если таковой имеется. Если вызову этой функции не предшествует B<sync>(2), то данные будут потеряны.

source: (B<RB_KEXEC>, 0x45584543, since Linux 2.6.13). Execute a kernel that has been loaded earlier with B<kexec_load>(2). This option is available only if the kernel was configured with B<CONFIG_KEXEC>.
ru: (B<RB_KEXEC>, 0x45584543, начиная с Linux 2.6.13) Выполняет ядро, которое было загружено ранее с помощью B<kexec_load>(2). Этот параметр доступен только, если ядро собрано с параметром B<CONFIG_KEXEC>.

source: (B<RB_POWER_OFF>, 0x4321fedc; since Linux 2.1.30). The message "Power down." is printed, the system is stopped, and all power is removed from the system, if possible. If not preceded by a B<sync>(2), data will be lost.
ru: (B<RB_POWER_OFF>, 0x4321fedc; начиная с Linux 2.1.30) Выводится сообщение «Power down.», система останавливается, и у системы отключаются все источники питания, если это возможно. Если вызову этой функции не предшествует B<sync>(2), то данные будут потеряны.

source: (B<RB_AUTOBOOT>, 0x1234567). The message "Restarting system." is printed, and a default restart is performed immediately. If not preceded by a B<sync>(2), data will be lost.
ru: (B<RB_AUTOBOOT>, 0x1234567) Выводится сообщение «Restarting system.», и по умолчанию сразу выполняется перезагрузка системы. Если вызову этой функции не предшествует команда B<sync>(2), то данные будут потеряны.

source: (0xa1b2c3d4; since Linux 2.1.30). The message "Restarting system with command \(aq%s\(aq" is printed, and a restart (using the command string given in I<arg>) is performed immediately. If not preceded by a B<sync>(2), data will be lost.
ru: (0xa1b2c3d4; начиная с Linux 2.1.30) Выводится сообщение «Restarting system with command \(aq%s\(aq» и немедленно выполняется перезагрузка системы (с использованием командной строки, заданной в I<arg>). Если вызову этой функции не предшествует B<sync>(2), то данные будут потеряны.

source: (B<RB_SW_SUSPEND>, 0xd000fce1; since Linux 2.5.18). The system is suspended (hibernated) to disk. This option is available only if the kernel was configured with B<CONFIG_HIBERNATION>.
ru: (B<RB_SW_SUSPEND>, 0xd000fce1; начиная с Linux 2.5.18) Система переводится в режим ожидания (suspended, hibernated) на диск. Этот параметр доступен только, если ядро собрано с параметром B<CONFIG_HIBERNATION>.

source: Only the superuser may call B<reboot>().
ru: Только суперпользователь может вызывать B<reboot>().

source: The precise effect of the above actions depends on the architecture. For the i386 architecture, the additional argument does not do anything at present (2.1.122), but the type of reboot can be determined by kernel command-line arguments ("reboot=...") to be either warm or cold, and either hard or through the BIOS.
ru: Конкретное действие описанных выше команд зависит от архитектуры системы. Что касается i386, то дополнительный аргумент в данное время ничего не даёт (2.1.122), а тип перезагрузки можно задать в командной строке ядра ("reboot=..."), определив, будет ли перезагрузка "тёплой" или "холодной", а также аппаратной или посредством BIOS.

source: Behavior inside PID namespaces
ru: Поведение внутри пространств имён PID

source: Since Linux 3.4, if B<reboot>() is called from a PID namespace other than the initial PID namespace with one of the I<cmd> values listed below, it performs a "reboot" of that namespace: the "init" process of the PID namespace is immediately terminated, with the effects described in B<pid_namespaces>(7).
ru: Начиная с Linux 3.4, если B<reboot>() вызывается из пространства имён PID, отличающегося от начального пространства имён PID, и и значение I<cmd> равно одному из перечисленных ниже, то выполняется «перезагрузка» в этом пространстве имён: процесс «init» пространства имён PID завершается немедленно, что приводит к результатам, описанным в B<pid_namespaces>(7).

source: The values that can be supplied in I<cmd> when calling B<reboot>() in this case are as follows:
ru: Возможные значения в этом случае, передаваемые в I<cmd> при вызове B<reboot>(), следующие:

source: The "init" process is terminated, and B<wait>(2) in the parent process reports that the child was killed with a B<SIGHUP> signal.
ru: Процесс «init» завершается и B<wait>(2) в родительском процессе возвращает, что поток завершился по сигналу B<SIGHUP>.

source: The "init" process is terminated, and B<wait>(2) in the parent process reports that the child was killed with a B<SIGINT> signal.
ru: Процесс «init» завершается и B<wait>(2) в родительском процессе возвращает, что поток завершился по сигналу B<SIGINT>.

source: For the other I<cmd> values, B<reboot>() returns -1 and I<errno> is set to B<EINVAL>.
ru: При других значениях I<cmd> вызов B<reboot>() возвращает -1 и I<errno> присваивается значение B<EINVAL>.

source: For the values of I<cmd> that stop or restart the system, a successful call to B<reboot>() does not return. For the other I<cmd> values, zero is returned on success. In all cases, -1 is returned on failure, and I<errno> is set appropriately.
ru: При значениях I<cmd>, по которым система останавливается или перезагружается, в случае успешной работы B<reboot>() ничего не возвращается. При других значений I<cmd> в случае успешной работы возвращается ноль. При ошибке всегда возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Problem with getting user-space data under B<LINUX_REBOOT_CMD_RESTART2>.
ru: Проблема получения данных пользовательского пространства при B<LINUX_REBOOT_CMD_RESTART2>.

source: Bad magic numbers or I<cmd>.
ru: Неправильные идентификационные числа или I<cmd>.

source: The calling process has insufficient privilege to call B<reboot>(); the caller must have the B<CAP_SYS_BOOT> inside its user namespace.
ru: Вызывающий процесс не имеет достаточно прав для вызова B<reboot>(); вызывающий должен иметь мандат B<CAP_SETGID> в своём пользовательском пространстве имён.

source: B<reboot>() is Linux-specific, and should not be used in programs intended to be portable.
ru: Вызов B<reboot>() есть только в Linux, и он не должен использоваться в переносимых программах.

source: readv, writev, preadv, pwritev, preadv2, pwritev2 - read or write data into multiple buffers
ru: readv, writev, preadv, pwritev, preadv2, pwritev2 - читает или пишет данные в несколько буферов

source: B<preadv>(), B<pwritev>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<preadv>(), B<pwritev>(): начиная с glibc 2.19: _DEFAULT_SOURCE glibc 2.19 и старее: _BSD_SOURCE

source: The B<readv>() system call reads I<iovcnt> buffers from the file associated with the file descriptor I<fd> into the buffers described by I<iov> ("scatter input").
ru: Системный вызов B<readv>() считывает I<iovcnt> буферов из файла, связанного с файловым дескриптором I<fd>, в буферы, описываемые I<iov> («разнесённый ввод»).

source: The B<writev>() system call writes I<iovcnt> buffers of data described by I<iov> to the file associated with the file descriptor I<fd> ("gather output").
ru: Системный вызов B<writev>() записывает I<iovcnt> буферов, описанных I<iov>, в файл, связанный с файловым дескриптором I<fd> («сборный вывод»).

source: The pointer I<iov> points to an array of I<iovec> structures, defined in I<E<lt>sys/uio.hE<gt>> as:
ru: Указатель I<iov> указывает на массив структур I<iovec> (определён в I<E<lt>sys/uio.hE<gt>>:

source: struct iovec { void *iov_base; /* Starting address */ size_t iov_len; /* Number of bytes to transfer */ };
ru: struct iovec { void *iov_base; /* начальный адрес */ size_t iov_len; /* количество передаваемых байт */ };

source: The B<readv>() system call works just like B<read>(2) except that multiple buffers are filled.
ru: Системный вызов B<readv>() работает также как B<read>(2), но считывает несколько буферов.

source: The B<writev>() system call works just like B<write>(2) except that multiple buffers are written out.
ru: Системный вызов B<writev>() работает также как B<write>(2), но записывает несколько буферов.

source: Buffers are processed in array order. This means that B<readv>() completely fills I<iov>[0] before proceeding to I<iov>[1], and so on. (If there is insufficient data, then not all buffers pointed to by I<iov> may be filled.) Similarly, B<writev>() writes out the entire contents of I<iov>[0] before proceeding to I<iov>[1], and so on.
ru: Буферы выбираются в порядке, в каком они указаны в массиве. Это означает, что B<readv>() сначала полностью заполнит I<iov>[0], и только потом перейдёт к I<iov>[1], и так далее. (Если данных недостаточно, то могут быть заполнены не все буферы, на которые указывает I<iov>.) Подобным образом B<writev>() запишет сначала всё содержимое I<iov>[0], затем I<iov>[1], и так далее.

source: The data transfers performed by B<readv>() and B<writev>() are atomic: the data written by B<writev>() is written as a single block that is not intermingled with output from writes in other processes (but see B<pipe>(7) for an exception); analogously, B<readv>() is guaranteed to read a contiguous block of data from the file, regardless of read operations performed in other threads or processes that have file descriptors referring to the same open file description (see B<open>(2)).
ru: Выполняемые вызовами B<readv>() и B<writev>() пересылки данных атомарны: данные записываются B<writev>() единичным блоком, который не перемешивается с выводом других процессов (см. исключения в B<pipe>(7)); аналогично, B<readv>() гарантированно считывает непрерывный блок данных из файла, независимо от операций чтения из других нитей или процессов, которые имеют файловые дескрипторы, ссылающиеся на это же открытое файловое описание (см. B<open>(2)).

source: preadv() and pwritev()
ru: preadv() и pwritev()

source: The B<preadv>() system call combines the functionality of B<readv>() and B<pread>(2). It performs the same task as B<readv>(), but adds a fourth argument, I<offset>, which specifies the file offset at which the input operation is to be performed.
ru: В системном вызове B<preadv>() объединены возможности B<readv>() и B<pread>(2). Он выполняет ту же задачу что и B<readv>(), но имеет четвёртый аргумент I<offset>, задающий файловое смещение, по которому нужно выполнить операцию чтения.
