Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: I<pathname> is currently in use by the system or some process that prevents its removal. On Linux, this means I<pathname> is currently used as a mount point or is the root directory of the calling process.
ru: В данный момент I<pathname> используется системой или одним из процессов, что предотвращает удаление. В Linux это означает, что I<pathname> используется в качестве точки монтирования или является корневым каталогом вызвавшего процесса.

source: I<pathname> points outside your accessible address space.
ru: Аргумент I<pathname> указывает за пределы доступного адресного пространства.

source: I<pathname> has I<.> as last component.
ru: I<pathname> содержит I<.> в качестве последнего компонента.

source: Too many symbolic links were encountered in resolving I<pathname>.
ru: Во время определения I<pathname> встретилось слишком много символьных ссылок.

source: I<pathname> was too long.
ru: I<pathname> слишком длинен.

source: A directory component in I<pathname> does not exist or is a dangling symbolic link.
ru: Один из каталогов в I<pathname> не существует или является повисшей символьной ссылкой.

source: I<pathname>, or a component used as a directory in I<pathname>, is not, in fact, a directory.
ru: I<pathname>, или его компонент, используемый в качестве каталога в I<pathname>, фактически, не является каталогом.

source: I<pathname> contains entries other than I<.> and I<..> ; or, I<pathname> has I<..> as its final component. POSIX.1 also allows B<EEXIST> for this condition.
ru: I<pathname> содержит элементы, отличные от I<.> и I<..> ; или последним компонентом I<pathname> является I<..>. POSIX.1 также позволяет возвращать B<EEXIST> в такой ситуации.

source: The directory containing I<pathname> has the sticky bit (B<S_ISVTX>) set and the process's effective user ID is neither the user ID of the file to be deleted nor that of the directory containing it, and the process is not privileged (Linux: does not have the B<CAP_FOWNER> capability).
ru: На каталоге, содержащемся в I<pathname>, установлен закрепляющий (sticky) бит (B<S_ISVTX>) и эффективный идентификатор пользователя не совпадает с пользовательским ID файла или каталога, его содержащего, что требуется для удаления, и процесс не имеет прав (Linux: не имеет мандата B<CAP_FOWNER>).

source: The filesystem containing I<pathname> does not support the removal of directories.
ru: Файловая система, содержащая I<pathname>, не поддерживает удаление каталогов.

source: I<pathname> refers to a directory on a read-only filesystem.
ru: I<pathname> указывает на файл в файловой системе, доступной только для чтения.

source: Infelicities in the protocol underlying NFS can cause the unexpected disappearance of directories which are still being used.
ru: Неточности в протоколе NFS могут приводить к неожиданному исчезновению каталогов, которые всё ещё используются.

source: recv, recvfrom, recvmsg - receive a message from a socket
ru: recv, recvfrom, recvmsg - принимает сообщение из сокета

source: The B<recv>(), B<recvfrom>(), and B<recvmsg>() calls are used to receive messages from a socket. They may be used to receive data on both connectionless and connection-oriented sockets. This page first describes common features of all three system calls, and then describes the differences between the calls.
ru: Системные вызовы B<recv>(), B<recvfrom>() и B<recvmsg>() используются для получения сообщений из сокета. Они могут использоваться для получения данных, независимо от того, является ли сокет ориентированным на соединения или нет. В этой странице сперва описаны общие свойства всех трёх системных вызовов, а затем описываются различия между ними.

source: The only difference between B<recv>() and B<read>(2) is the presence of I<flags>. With a zero I<flags> argument, B<recv>() is generally equivalent to B<read>(2) (but see NOTES). Also, the following call
ru: Вызов B<recv>() отличается от B<read>(2) только наличием аргумента I<flags>. Если значение I<flags> равно нулю, то вызов B<recv>() эквивалентен B<read>(2) (но смотрите ЗАМЕЧАНИЯ). Также, вызов

source: is equivalent to
ru: эквивалентен

source: All three calls return the length of the message on successful completion. If a message is too long to fit in the supplied buffer, excess bytes may be discarded depending on the type of socket the message is received from.
ru: При успешном выполнении все три вызова возвращают длину сообщения. Если сообщение слишком длинное и не поместилось в предоставленный буфер, лишние байты могут быть отброшены, в зависимости от типа сокета, на котором принимаются сообщения.

source: If no messages are available at the socket, the receive calls wait for a message to arrive, unless the socket is nonblocking (see B<fcntl>(2)), in which case the value -1 is returned and the external variable I<errno> is set to B<EAGAIN> or B<EWOULDBLOCK>. The receive calls normally return any data available, up to the requested amount, rather than waiting for receipt of the full amount requested.
ru: Если на сокете не доступно ни одного сообщения, то обсуждаемые вызовы ожидают их прибытия, если сокет не помечен как неблокирующий (см. B<fcntl>(2)), в противном случае возвращается значение -1, а внешняя переменная I<errno> устанавливается в значение B<EAGAIN> или B<EWOULDBLOCK>. Все эти вызовы обычно сразу возвращают все доступные данные вплоть до запрошенного объема, а не ждут, пока появятся данные полной запрошенной длины.

source: An application can use B<select>(2), B<poll>(2), or B<epoll>(7) to determine when more data arrives on a socket.
ru: Для определения появления новых данных в сокете приложение может использовать B<select>(2), B<poll>(2) или B<epoll>(7).

source: The flags argument
ru: Аргумент флагов

source: The I<flags> argument is formed by ORing one or more of the following values:
ru: Аргумент I<flags> формируется с помощью объединения логической операцией ИЛИ одного или более следующих значений:

source: B<MSG_CMSG_CLOEXEC> (B<recvmsg>() only; since Linux 2.6.23)
ru: B<MSG_CMSG_CLOEXEC> (только для B<recvmsg>(); начиная с Linux 2.6.23)

source: Set the close-on-exec flag for the file descriptor received via a UNIX domain file descriptor using the B<SCM_RIGHTS> operation (described in B<unix>(7)). This flag is useful for the same reasons as the B<O_CLOEXEC> flag of B<open>(2).
ru: Установить флаг close-on-exec для файлового дескриптора, полученного через доменный файловый дескриптор UNIX, с помощью операции B<SCM_RIGHTS> (описана в B<unix>(7)). Этот флаг полезен по тем же причинам что и флаг B<O_CLOEXEC> у B<open>(2).

source: B<MSG_DONTWAIT> (since Linux 2.2)
ru: B<MSG_DONTWAIT> (начиная с Linux 2.2)

source: Enables nonblocking operation; if the operation would block, the call fails with the error B<EAGAIN> or B<EWOULDBLOCK>. This provides similar behavior to setting the B<O_NONBLOCK> flag (via the B<fcntl>(2) B<F_SETFL> operation), but differs in that B<MSG_DONTWAIT> is a per-call option, whereas B<O_NONBLOCK> is a setting on the open file description (see B<open>(2)), which will affect all threads in the calling process and as well as other processes that hold file descriptors referring to the same open file description.
ru: Включить неблокирующий режим. Если операция могла бы привести к блокировке, возвращается B<EAGAIN> или B<EWOULDBLOCK>. Такое поведение подобно заданию флага B<O_NONBLOCK> (в B<fcntl>(2) операцией B<F_SETFL>), но отличие в том, что B<MSG_DONTWAIT> указывается в вызове, а B<O_NONBLOCK> задаётся в описании открытого файла (смотрите B<open>(2)), что влияет на все нити вызывающего процесса, а также на другие процессы, у которых есть файловые дескрипторы, ссылающиеся на это описание открытого файла.

source: B<MSG_ERRQUEUE> (since Linux 2.2)
ru: B<MSG_ERRQUEUE> (начиная с Linux 2.2)

source: This flag specifies that queued errors should be received from the socket error queue. The error is passed in an ancillary message with a type dependent on the protocol (for IPv4 B<IP_RECVERR>). The user should supply a buffer of sufficient size. See B<cmsg>(3) and B<ip>(7) for more information. The payload of the original packet that caused the error is passed as normal data via I<msg_iovec>. The original destination address of the datagram that caused the error is supplied via I<msg_name>.
ru: Указание этого флага позволяет получить из очереди ошибок сокета накопившиеся ошибки. Ошибка передаётся в вспомогательном сообщении тип которого зависит от протокола (для IPv4 это B<IP_RECVERR>). Вызывающий должен предоставить буфер достаточного размера. Дополнительная информация приведена в B<cmsg>(3) и B<ip>(7). Содержимое исходного пакета, который привёл к ошибке, передаётся в виде обычных данных через I<msg_iovec>. Исходный адрес назначения датаграммы, которая привела к ошибке, передаётся через I<msg_name>.

source: The error is supplied in a I<sock_extended_err> structure:
ru: Ошибка передаётся в виде структуры I<sock_extended_err>:

source: struct sock_extended_err { uint32_t ee_errno; /* Error number */ uint8_t ee_origin; /* Where the error originated */ uint8_t ee_type; /* Type */ uint8_t ee_code; /* Code */ uint8_t ee_pad; /* Padding */ uint32_t ee_info; /* Additional information */ uint32_t ee_data; /* Other data */ /* More data may follow */ };
ru: struct sock_extended_err { uint32_t ee_errno; /* номер ошибки */ uint8_t ee_origin; /* источник её происхождения */ uint8_t ee_type; /* тип */ uint8_t ee_code; /* код */ uint8_t ee_pad; /* заполнение для выравнивания */ uint32_t ee_info; /* дополнительная информация */ uint32_t ee_data; /* прочие данные */ /* далее могут содержаться ещё данные */ };

source: I<ee_errno> contains the I<errno> number of the queued error. I<ee_origin> is the origin code of where the error originated. The other fields are protocol-specific. The macro B<SOCK_EE_OFFENDER> returns a pointer to the address of the network object where the error originated from given a pointer to the ancillary message. If this address is not known, the I<sa_family> member of the I<sockaddr> contains B<AF_UNSPEC> and the other fields of the I<sockaddr> are undefined. The payload of the packet that caused the error is passed as normal data.
ru: В I<ee_errno> содержится значение I<errno> для ожидающей ошибки. В I<ee_origin> содержится источник происхождения ошибки. Смысл остальных полей зависит от протокола. Макрос B<SOCK_EE_OFFENDER> возвращает указатель на адрес сетевого объекта, породившего ошибку. Если этот адрес неизвестен, то поле I<sa_family> структуры I<sockaddr> содержит значение B<AF_UNSPEC>, а прочие поля структуры I<sockaddr> не определены. Содержимое пакета, вызвавшего ошибку, передаётся в виде обычных данных.

source: For local errors, no address is passed (this can be checked with the I<cmsg_len> member of the I<cmsghdr>). For error receives, the B<MSG_ERRQUEUE> flag is set in the I<msghdr>. After an error has been passed, the pending socket error is regenerated based on the next queued error and will be passed on the next socket operation.
ru: Для локальных ошибок адрес не передаётся (это можно выяснить, проверив поле I<cmsg_len> структуры I<cmsghdr>). Для ошибок при приёме устанавливается флаг B<MSG_ERRQUEUE> в I<msghdr>. После того, как ошибка передана программе, следующая ошибка в очереди ошибок становится ожидающей ошибкой и передается программе при следующей операции на сокете.

source: This flag requests receipt of out-of-band data that would not be received in the normal data stream. Some protocols place expedited data at the head of the normal data queue, and thus this flag cannot be used with such protocols.
ru: Этот флаг запрашивает приём внеполосных данных, которые в противном случае не были бы получены в обычном потоке данных. Некоторые протоколы помещают данные повышенной срочности в начало очереди с обычными данными, и поэтому этот флаг не может использоваться с такими протоколами.

source: This flag causes the receive operation to return data from the beginning of the receive queue without removing that data from the queue. Thus, a subsequent receive call will return the same data.
ru: Этот флаг заставляет выбрать данные из начала очереди приёма, но не удалять их оттуда. Таким образом, последующий вызов вернёт те же самые данные.

source: B<MSG_TRUNC> (since Linux 2.2)
ru: B<MSG_TRUNC> (начиная с Linux 2.2)

source: For raw (B<AF_PACKET>), Internet datagram (since Linux 2.4.27/2.6.8), netlink (since Linux 2.6.22), and UNIX datagram (since Linux 3.4) sockets: return the real length of the packet or datagram, even when it was longer than the passed buffer.
ru: Для «сырых» данных (B<AF_PACKET>), дейтаграмм Интернета (начиная с Linux 2.4.27/2.6.8), netlink (начиная с Linux 2.6.22) и дейтаграмм UNIX (начиная с Linux 3.4) возвращает реальную длину пакета или дейтаграммы, даже если она была больше, чем предоставленный буфер.

source: For use with Internet stream sockets, see B<tcp>(7).
ru: Описание использования с потоковым сокетами Интернета смотрите в B<tcp>(7).

source: B<MSG_WAITALL> (since Linux 2.2)
ru: B<MSG_WAITALL> (начиная с Linux 2.2)

source: This flag requests that the operation block until the full request is satisfied. However, the call may still return less data than requested if a signal is caught, an error or disconnect occurs, or the next data to be received is of a different type than that returned. This flag has no effect for datagram sockets.
ru: Этим флагом включается блокирование операции до полной обработки запроса. Однако, этот вызов всё равно может вернуть меньше данных, чем было запрошено, если был пойман сигнал, произошла ошибка или разрыв соединения, или если начали поступать данные другого типа, не того, который был сначала. Этот флаг не влияет на датаграммные сокеты.

source: B<recvfrom>() places the received message into the buffer I<buf>. The caller must specify the size of the buffer in I<len>.
ru: Вызов B<recvfrom>() помещает принятое сообщение в буфер I<buf>. Вызывающий должен указать размер буфера в I<len>.

source: If I<src_addr> is not NULL, and the underlying protocol provides the source address of the message, that source address is placed in the buffer pointed to by I<src_addr>. In this case, I<addrlen> is a value-result argument. Before the call, it should be initialized to the size of the buffer associated with I<src_addr>. Upon return, I<addrlen> is updated to contain the actual size of the source address. The returned address is truncated if the buffer provided is too small; in this case, I<addrlen> will return a value greater than was supplied to the call.
ru: Если значение I<src_addr> не равно NULL, и в нижележащем протоколе используется адрес источника сообщения, то адрес источника помещается в буфер, указанный в I<src_addr>. В этом случае I<addrlen> является аргументом-результатом. Перед вызовом ему должно быть присвоено значение длины буфера, связанного с I<src_addr>. При возврате I<addrlen> обновляется и содержит действительный размер адреса источника. Возвращаемый адрес обрезается, если предоставленный буфер слишком мал; в этом случае I<addrlen> будет содержать значение большее, чем указывалось в вызове.

source: If the caller is not interested in the source address, I<src_addr> and I<addrlen> should be specified as NULL.
ru: Если вызывающему адрес источника не нужен, то значение I<src_addr> и I<addrlen> должно быть равно NULL.

source: The B<recv>() call is normally used only on a I<connected> socket (see B<connect>(2)). It is equivalent to the call:
ru: Вызов B<recv>(), обычно, используется только на I<соединённом> сокете (смотрите B<connect>(2)). Он идентичен вызову:

source: The B<recvmsg>() call uses a I<msghdr> structure to minimize the number of directly supplied arguments. This structure is defined as follows in I<E<lt>sys/socket.hE<gt>>:
ru: Для минимизации количества передаваемых аргументов в вызов B<recvmsg>() используется структура I<msghdr>. Она определена в I<E<lt>sys/socket.hE<gt>> следующим образом:

source: struct iovec { /* Scatter/gather array items */ void *iov_base; /* Starting address */ size_t iov_len; /* Number of bytes to transfer */ };
ru: struct iovec { /* массив элементов приёма/передачи */ void *iov_base; /* начальный адрес */ size_t iov_len; /* количество передаваемых байт */ };

source: struct msghdr { void *msg_name; /* Optional address */ socklen_t msg_namelen; /* Size of address */ struct iovec *msg_iov; /* Scatter/gather array */ size_t msg_iovlen; /* # elements in msg_iov */ void *msg_control; /* Ancillary data, see below */ size_t msg_controllen; /* Ancillary data buffer len */ int msg_flags; /* Flags on received message */ };
ru: struct msghdr { void *msg_name; /* необязательный адрес */ socklen_t msg_namelen; /* размер адреса */ struct iovec *msg_iov; /* массив приёма/передачи */ size_t msg_iovlen; /* количество элементов в msg_iov */ void *msg_control; /* вспомогательные данные, см. ниже */ size_t msg_controllen; /* размер буфера вспомогательных данных */ int msg_flags; /* флаги принятого сообщения */ };

source: The I<msg_name> field points to a caller-allocated buffer that is used to return the source address if the socket is unconnected. The caller should set I<msg_namelen> to the size of this buffer before this call; upon return from a successful call, I<msg_namelen> will contain the length of the returned address. If the application does not need to know the source address, I<msg_name> can be specified as NULL.
ru: Поле I<msg_name> указывает на выделенный вызывающим буфер, который используется для возврата адреса источника, если сокет не соединён. Вызывающий должен указать в I<msg_namelen> размер этого буфера перед вызовом; при успешном выполнении вызова в I<msg_namelen> будет содержаться длина возвращаемого адреса. Если приложению не нужно знать адрес источника, то в I<msg_name> можно указать NULL.

source: The fields I<msg_iov> and I<msg_iovlen> describe scatter-gather locations, as discussed in B<readv>(2).
ru: В полях I<msg_iov> и I<msg_iovlen> описываются место приёма/передачи, обсуждаемые в B<readv>(2).

source: The field I<msg_control>, which has length I<msg_controllen>, points to a buffer for other protocol control-related messages or miscellaneous ancillary data. When B<recvmsg>() is called, I<msg_controllen> should contain the length of the available buffer in I<msg_control>; upon return from a successful call it will contain the length of the control message sequence.
ru: Поле I<msg_control> длиной I<msg_controllen> указывает на буфер для других сообщений, связанных с управлением протоколом или на буфер для разнообразных вспомогательных данных. При вызове B<recvmsg>() в поле I<msg_controllen> должен указываться размер доступного буфера, чей адрес передан в I<msg_control>; при успешном выполнении вызова в этом параметре будет находиться длина последовательности контрольных сообщений.

source: The messages are of the form:
ru: Сообщения имеют следующий вид:

source: struct cmsghdr { size_t cmsg_len; /* Data byte count, including header (type is socklen_t in POSIX) */ int cmsg_level; /* Originating protocol */ int cmsg_type; /* Protocol-specific type */ /* followed by unsigned char cmsg_data[]; */ };
ru: struct cmsghdr { size_t cmsg_len; /* счетчик байтов данных с заголовком (тип — socklen_t в POSIX) */ int cmsg_level; /* начальный протокол */ int cmsg_type; /* тип, зависящий от протокола */ /* после unsigned char cmsg_data[]; */ };

source: Ancillary data should be accessed only by the macros defined in B<cmsg>(3).
ru: К вспомогательным данным нужно обращаться только с помощью макросов, определённых в B<cmsg>(3).

source: As an example, Linux uses this ancillary data mechanism to pass extended errors, IP options, or file descriptors over UNIX domain sockets.
ru: Например, этот механизм вспомогательных данных используется в Linux для передачи расширенных ошибок, флагов IP и файловых дескрипторов через доменные сокеты Unix.

source: The I<msg_flags> field in the I<msghdr> is set on return of B<recvmsg>(). It can contain several flags:
ru: При возврате из B<recvmsg>() устанавливается значение поля I<msg_flags> в I<msghdr>. Оно может содержать несколько флагов:

source: indicates end-of-record; the data returned completed a record (generally used with sockets of type B<SOCK_SEQPACKET>).
ru: означает конец записи: возвращённые данные заканчивают запись (обычно используется вместе с сокетами типа B<SOCK_SEQPACKET>).

source: indicates that the trailing portion of a datagram was discarded because the datagram was larger than the buffer supplied.
ru: означает, что хвостовая часть датаграммы была отброшена, потому что датаграмма была больше, чем предоставленный буфер.

source: indicates that some control data was discarded due to lack of space in the buffer for ancillary data.
ru: означает, что часть управляющих данных была отброшена из-за недостатка места в буфере вспомогательных данных.

source: is returned to indicate that expedited or out-of-band data was received.
ru: возвращается для индикации, что получены курируемые или внеполосные данные.

source: indicates that no data was received but an extended error from the socket error queue.
ru: означает, что были получены не данные, а расширенное сообщение об ошибке из очереди ошибок сокета.

source: These calls return the number of bytes received, or -1 if an error occurred. In the event of an error, I<errno> is set to indicate the error.
ru: Эти вызовы возвращают количество принятых байт или -1, если произошла ошибка. В случае ошибки в I<errno> записывается код ошибки.

source: When a stream socket peer has performed an orderly shutdown, the return value will be 0 (the traditional "end-of-file" return).
ru: Когда ответная сторона потока выполняет корректное отключение (shutdown), то возвращается 0 (обычный возврат «конец файла»).

source: Datagram sockets in various domains (e.g., the UNIX and Internet domains) permit zero-length datagrams. When such a datagram is received, the return value is 0.
ru: В датаграмных сокетах некоторых доменов (например, доменах UNIX и Internet) разрешены датаграммы нулевой длины. При получении такой датаграммы возвращается значение 0.

source: The value 0 may also be returned if the requested number of bytes to receive from a stream socket was 0.
ru: Также значение 0 может возвращаться, если запрошенное количество принимаемых байт из потокового сокета равно 0.

source: These are some standard errors generated by the socket layer. Additional errors may be generated and returned from the underlying protocol modules; see their manual pages.
ru: Здесь представлено несколько стандартных ошибок, возвращаемых с уровня сокетов. Могут также появиться другие ошибки, возвращаемые из соответствующих протокольных модулей; их описание находится в соответствующих справочных страницах.

source: The socket is marked nonblocking and the receive operation would block, or a receive timeout had been set and the timeout expired before data was received. POSIX.1 allows either error to be returned for this case, and does not require these constants to have the same value, so a portable application should check for both possibilities.
ru: Сокет помечен как неблокируемый, а операция приёма привела бы к блокировке, или установлено время ожидания данных и это время истекло до получения данных. Согласно POSIX.1 в этом случае может возвращаться любая ошибка и не требуется, чтобы эти константы имели одинаковое значение, поэтому переносимое приложение должно проверить оба случая.

source: The argument I<sockfd> is an invalid file descriptor.
ru: Аргумент I<sockfd> содержит неверный файловый дескриптор.

source: A remote host refused to allow the network connection (typically because it is not running the requested service).
ru: Удалённый узел отказался устанавливать сетевое соединение (обычно потому, что там не работает запрошенная служба).
