Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: the default table
ru: таблица по умолчанию

source: the main table
ru: главная таблица

source: the local table
ru: локальная таблица

source: The user may assign arbitrary values between B<RT_TABLE_UNSPEC> and B<RT_TABLE_DEFAULT>.
ru: Пользователь может назначать произвольные значения от B<RT_TABLE_UNSPEC> и до B<RT_TABLE_DEFAULT>.

source: ignored.
ru: игнорируется

source: protocol address
ru: адрес протокола

source: Route destination address.
ru: адрес маршрута назначения

source: Route source address.
ru: адрес маршрута источника

source: Input interface index.
ru: индекс входного интерфейса

source: Output interface index.
ru: индекс выходного интерфейса

source: The gateway of the route
ru: шлюз маршрута

source: Priority of route.
ru: приоритет маршрута

source: Route metric
ru: метрика маршрута

source: B<Fill these values in!>
ru: B<Заполнить эти значения!>

source: Add, remove or receive information about a neighbor table entry (e.g., an ARP entry). The message contains an I<ndmsg> structure.
ru: Добавление, удаление или получение информации о записи соседей по таблице (например, запись ARP). В сообщении содержится структура I<ndmsg>:

source: struct ndmsg { unsigned char ndm_family; int ndm_ifindex; /* Interface index */ __u16 ndm_state; /* State */ __u8 ndm_flags; /* Flags */ __u8 ndm_type; };
ru: struct ndmsg { unsigned char ndm_family; int ndm_ifindex; /* индекс интерфейса */ __u16 ndm_state; /* состояние */ __u8 ndm_flags; /* флаги */ __u8 ndm_type; };

source: I<ndm_state> is a bit mask of the following states:
ru: В I<ndm_state> содержится битовая маска следующих состояний:

source: a currently resolving cache entry
ru: запись кэша в данный момент определяется

source: a confirmed working cache entry
ru: подтверждённая рабочая запись кэша

source: an expired cache entry
ru: устаревшая запись кэша

source: an entry waiting for a timer
ru: запись ожидает срабатывания таймера

source: a cache entry that is currently reprobed
ru: запись кэша в данный момент проверяется повторно

source: an invalid cache entry
ru: некорректная запись кэша

source: a device with no destination cache
ru: устройство без кэша назначений

source: a static entry
ru: статическая запись

source: Valid I<ndm_flags> are:
ru: Допустимые значения I<ndm_flags>:

source: a proxy arp entry
ru: запись прокси arp

source: an IPv6 router
ru: маршрутизатор IPv6

source: The I<rtattr> struct has the following meanings for the I<rta_type> field:
ru: Структура I<rtattr> имеет следующие значения для поля I<rta_type>:

source: unknown type
ru: неизвестный тип

source: a neighbor cache n/w layer destination address
ru: кэш адресов назначения соседей на сетевом уровне

source: a neighbor cache link layer address
ru: кэш адресов соседей на уровне связей

source: cache statistics.
ru: статистика кэша

source: If the I<rta_type> field is B<NDA_CACHEINFO>, then a I<struct nda_cacheinfo> header follows
ru: Если значение поля I<rta_type> равно B<NDA_CACHEINFO>, то присутствует заголовок I<struct nda_cacheinfo>.

source: Add, delete or retrieve a routing rule. Carries a I<struct rtmsg>
ru: Добавление, удаление или получение правила маршрутизации. Содержит I<struct rtmsg>.

source: Add, remove or get a queueing discipline. The message contains a I<struct tcmsg> and may be followed by a series of attributes.
ru: Добавление, удаление или получение планирования очереди. В сообщении содержится I<struct tcmsg>, а также может быть серия атрибутов.

source: struct tcmsg { unsigned char tcm_family; int tcm_ifindex; /* interface index */ __u32 tcm_handle; /* Qdisc handle */ __u32 tcm_parent; /* Parent qdisc */ __u32 tcm_info; };
ru: struct tcmsg { unsigned char tcm_family; int tcm_ifindex; /* индекс интерфейса */ __u32 tcm_handle; /* описатель qdisc */ __u32 tcm_parent; /* предок qdisc */ __u32 tcm_info; };

source: Description
ru: Описание

source: unspecified
ru: не определено

source: Name of queueing discipline
ru: имя план-ания очереди

source: byte sequence
ru: байтовая последовательность

source: Qdisc-specific options follow
ru: есть параметры qdisc

source: Qdisc statistics.
ru: статистика qdisc

source: qdisc-specific
ru: относится к qdisc

source: Module-specific statistics.
ru: стат-ка по опр. модулю

source: Rate limit.
ru: ограничение по скорости

source: In addition, various other qdisc-module-specific attributes are allowed. For more information see the appropriate include files.
ru: Также, разрешены дополнительные атрибуты модуля qdisc. Дополнительную информацию можно получить из соответствующих заголовочных файлов.

source: Add, remove or get a traffic class. These messages contain a I<struct tcmsg> as described above.
ru: Добавление, удаление или получение класса трафика. В этих сообщениях содержится структура I<struct tcmsg>, описанная ранее.

source: Add, remove or receive information about a traffic filter. These messages contain a I<struct tcmsg> as described above.
ru: Добавление, удаление или получение информации о фильтре трафика. В этих сообщениях содержится структура I<struct tcmsg>, описанная ранее.

source: VERSIONS
ru: ВЕРСИИ

source: B<rtnetlink> is a new feature of Linux 2.2.
ru: Свойство B<rtnetlink> появилось в Linux 2.2.

source: This manual page is incomplete.
ru: Данная справочная страница не полна.

source: regex - POSIX.2 regular expressions
ru: regex - регулярные выражения POSIX.2

source: Regular expressions ("RE"s), as defined in POSIX.2, come in two forms: modern REs (roughly those of I<egrep>; POSIX.2 calls these "extended" REs) and obsolete REs (roughly those of B<ed>(1); POSIX.2 "basic" REs). Obsolete REs mostly exist for backward compatibility in some old programs; they will be discussed at the end. POSIX.2 leaves some aspects of RE syntax and semantics open; "\*(dg" marks decisions on these aspects that may not be fully portable to other POSIX.2 implementations.
ru: Регулярные выражения (РВ) стандарта POSIX.2 могут быть двух видов: новые РВ (по сути, использующиеся в I<egrep>; в POSIX.2 их называют ещё «расширенными» РВ) и устаревшие РВ (по сути, использующиеся в B<ed>(1); в POSIX.2 их называют ещё «основными» РВ). Устаревшие РВ существуют, в основном, для совместимости с некоторыми старыми программами (они будут подробнее рассмотрены в конце этого документа). В POSIX.2 не разъяснены некоторые вопросы синтаксиса РВ; знаком \*(dg отмечаются описания, которые могут быть не полностью совместимы с другими реализациями POSIX.2.

source: A (modern) RE is one\*(dg or more nonempty\*(dg I<branches>, separated by \(aq|\(aq. It matches anything that matches one of the branches.
ru: Новое РВ — одна\*(dg или более непустых\*(dg I<ветвей>, разделённых \(aq|\(aq. Соответствием считается, если есть совпадение для любой из её ветвей.

source: A branch is one\*(dg or more I<pieces>, concatenated. It matches a match for the first, followed by a match for the second, and so on.
ru: Ветвь состоит из одной\*(dg или более I<частей>. Ветвь сначала ведёт поиск соответствий с первой, затем с второй (и т. п.) её частями.

source: A piece is an I<atom> possibly followed by a single\*(dg \(aq*\(aq, \(aq+\(aq, \(aq?\(aq, or I<bound>. An atom followed by \(aq*\(aq matches a sequence of 0 or more matches of the atom. An atom followed by \(aq+\(aq matches a sequence of 1 or more matches of the atom. An atom followed by \(aq?\(aq matches a sequence of 0 or 1 matches of the atom.
ru: Часть — это I<атом>, за которым может следовать одиночный\*(dg символ \(aq*\(aq, \(aq+\(aq, \(aq?\(aq или I<интервал>. Если за атомом следует символ \(aq*\(aq, это означает, что совпадающая с атомом последовательность может встречаться 0 или более раз. Если за атомом следует символ \(aq+\(aq, это означает, что совпадающая с атомом последовательность может встречаться 1 или более раз. Если за атомом следует символ \(aq?\(aq, это означает, что совпадающая с атомом последовательность может встречаться 0 или 1 раз.

source: A I<bound> is \(aq{\(aq followed by an unsigned decimal integer, possibly followed by \(aq,\(aq possibly followed by another unsigned decimal integer, always followed by \(aq}\(aq. The integers must lie between 0 and B<RE_DUP_MAX> (255\*(dg) inclusive, and if there are two of them, the first may not exceed the second. An atom followed by a bound containing one integer I<i> and no comma matches a sequence of exactly I<i> matches of the atom. An atom followed by a bound containing one integer I<i> and a comma matches a sequence of I<i> or more matches of the atom. An atom followed by a bound containing two integers I<i> and I<j> matches a sequence of I<i> through I<j> (inclusive) matches of the atom.
ru: I<Интервал> — это символ \(aq{\(aq, после которого стоит беззнаковое целое десятичное число, за которым может следовать символ \(aq,\(aq, далее, возможно, находится ещё одно беззнаковое целое десятичное число, и в конце интервала обязательно стоит символ \(aq}\(aq. Числа должны находиться в промежутке от 0 до B<RE_DUP_MAX> (255\*(dg) включительно, а если указано два числа, то первое не должно превышать второе. Атом с интервалом, в котором есть одно число I<i> и нет запятой, соответствует последовательности, повторяющейся точно I<i> раз. Атом с интервалом, содержащим число I<i> и запятую, соответствует последовательности, повторяющейся I<i> и более раз. Атом с интервалом, содержащим два числа I<i> и I<j>, соответствует последовательности, повторяющейся от I<i> до I<j> раз включительно.

source: An atom is a regular expression enclosed in "I<()>" (matching a match for the regular expression), an empty set of "I<()>" (matching the null string)\*(dg, a I<bracket expression> (see below), \(aq.\(aq (matching any single character), \(aq^\(aq (matching the null string at the beginning of a line), \(aq$\(aq (matching the null string at the end of a line), a \(aq\e\(aq followed by one of the characters "I<^.[$()|*+?{\e>" (matching that character taken as an ordinary character), a \(aq\e\(aq followed by any other character\*(dg (matching that character taken as an ordinary character, as if the \(aq\e\(aq had not been present\*(dg), or a single character with no other significance (matching that character). A \(aq{\(aq followed by a character other than a digit is an ordinary character, not the beginning of a bound\*(dg. It is illegal to end an RE with \(aq\e\(aq.
ru: Атом — это регулярное выражение, заключённое в «I<()>» (соответствующее регулярному выражению), пустые скобки «I<()>» (соответствуют строке null)\*(dg, I<выражение в квадратных скобках> (см. ниже), \(aq.\(aq (соответствует любому одному символу), \(aq^\(aq (соответствует строке null в начале строки), \(aq$\(aq (соответствует строке null в конце строки), \(aq\e\(aq со следующим после него одним из символов «I<^.[$()|*+?{\e>» (соответствует этому символу, как он есть), символ \(aq\e\(aq с последующим символом, отличным от предыдущего\*(dg (соответствует этому символу, как он есть, как если бы \(aq\e\(aq отсутствовал\*(dg), или одиночный символ без специального назначения (соответствует этому символу). Символ \(aq{\(aq с последующим символом, не являющимся цифрой, соответствует символу, а не началу интервала\*(dg. Нельзя заканчивать РВ символом \(aq\e\(aq.

source: A I<bracket expression> is a list of characters enclosed in "I<[]>". It normally matches any single character from the list (but see below). If the list begins with \(aq^\(aq, it matches any single character (but see below) I<not> from the rest of the list. If two characters in the list are separated by \(aq-\(aq, this is shorthand for the full I<range> of characters between those two (inclusive) in the collating sequence, for example, "I<[0-9]>" in ASCII matches any decimal digit. It is illegal\*(dg for two ranges to share an endpoint, for example, "I<a-c-e>". Ranges are very collating-sequence-dependent, and portable programs should avoid relying on them.
ru: I<Выражение в квадратных скобках> — список символов, заключенный в «I<[]>». Обычно, оно соответствует любому отдельному символу из списка (но см. ниже). Если список начинается с \(aq^\(aq, то он соответствует любому отдельному символу (но см. ниже) I<не> из приведённого списка. Если два символа в списке разделены \(aq-\(aq, то это считается сокращением полного I<диапазона> символов, заключённого между этими двумя символами (включая и их) объединяющей последовательности, например, «I<[0-9]>» в кодах ASCII соответствует любой десятичной цифре. Нельзя\*(dg в двух диапазонах указывать один и тот же символ, например, «a-c-e». Диапазоны сильно зависят от объединяющей последовательности, и в переносимых программах их лучше не использовать.

source: To include a literal \(aq]\(aq in the list, make it the first character (following a possible \(aq^\(aq). To include a literal \(aq-\(aq, make it the first or last character, or the second endpoint of a range. To use a literal \(aq-\(aq as the first endpoint of a range, enclose it in "I<[.>" and "I<.]>" to make it a collating element (see below). With the exception of these and some combinations using \(aq[\(aq (see next paragraphs), all other special characters, including \(aq\e\(aq, lose their special significance within a bracket expression.
ru: Для того, чтобы включить в список символ \(aq]\(aq, вам следует поставить его в начало списка (после символа \(aq^\(aq, если он присутствует). Для того, чтобы включить в список символ \(aq-\(aq, поставьте его первым или последним символом или вторым символом конца диапазона. Для того, чтобы обозначить символом \(aq-\(aq начало диапазона, заключите его в «I<[.>» и «I<.]>», сделав его объединяющим элементом (смотрите далее). За исключением этих и некоторых других комбинаций, использующих \(aq[\(aq (см. следующие параграфы), все остальные специальные символы, включая \(aq\e\(aq, теряют своё особое назначение в квадратных скобках.

source: Within a bracket expression, a collating element (a character, a multicharacter sequence that collates as if it were a single character, or a collating-sequence name for either) enclosed in "I<[.>" and "I<.]>" stands for the sequence of characters of that collating element. The sequence is a single element of the bracket expression's list. A bracket expression containing a multicharacter collating element can thus match more than one character, for example, if the collating sequence includes a "ch" collating element, then the RE "I<[[.ch.]]*c>" matches the first five characters of "chchcc".
ru: Если внутри квадратных скобок объединяющий элемент (одиночный символ, многосимвольная последовательность, которая действует как одиночный символ или имя объединяющей последовательности) заключен в «I<[.>» и «I<.]>», то он обозначает последовательность символов как один объединяющий элемент. Последовательность выражается одиночным элементом списка внутри квадратных скобок. Таким образом, выражение в скобках, содержащее многосимвольный объединяющий элемент, может соответствовать более чем одному символу; например, если последовательность содержит объединяющий элемент «ch», то РВ «I<[[.ch.]]*c>» соответствует первым пяти символам «chchcc».

source: Within a bracket expression, a collating element enclosed in "I<[=>" and "I<=]>" is an equivalence class, standing for the sequences of characters of all collating elements equivalent to that one, including itself. (If there are no other equivalent collating elements, the treatment is as if the enclosing delimiters were "I<[.>" and "I<.]>".) For example, if o and \o'o^' are the members of an equivalence class, then "I<[[=o=]]>", "I<[[=\o'o^'=]]>", and "I<[o\o'o^']>" are all synonymous. An equivalence class may not\*(dg be an endpoint of a range.
ru: Объединяющий элемент в квадратных скобках, заключенный в «I<[=>» и «I<=]>» — это класс-эквивалент, делающий последовательности символов всех объединяющих элементов эквивалентными одной, включая её саму (если нет больше эквивалентных объединяющих элементов, то это аналогично выражению, заключенному в «I<[.>» и «I<.]>»). Например, если o и \o'o^' являются членами класса-эквивалента, то «I<[[=o=]]>», «I<[[=\o'o^'=]]>» и «I<[o\o'o^']>» являются синонимами. Класс-эквивалент не\*(dg может служить границей диапазона.

source: Within a bracket expression, the name of a I<character class> enclosed in "I<[:>" and "I<:]>" stands for the list of all characters belonging to that class. Standard character class names are:
ru: В выражении в квадратных скобках, имя I<символьного класса>, заключенное в «I<[:>» и «I<:]>», соответствует списку всех символов, принадлежащих этому классу. Существуют стандартные символьные классы:

source: These stand for the character classes defined in B<wctype>(3). A locale may provide others. A character class may not be used as an endpoint of a range.
ru: Эти символьные классы определены в B<wctype>(3). В локали могут быть определены свои классы. Символьный класс не может использоваться в качестве границы диапазона.

source: In the event that an RE could match more than one substring of a given string, the RE matches the one starting earliest in the string. If the RE could match more than one substring starting at that point, it matches the longest. Subexpressions also match the longest possible substrings, subject to the constraint that the whole match be as long as possible, with subexpressions starting earlier in the RE taking priority over ones starting later. Note that higher-level subexpressions thus take priority over their lower-level component subexpressions.
ru: В случае, если РВ совпадает более чем с одной подстрокой заданной строки, то оно считается совпадающим с первой подстрокой строки. Если РВ совпадает более чем с одной подстрокой начинающейся в этой точке, то оно совпадет с самой длинной подстрокой. Подвыражения также соответствуют самой длинной совпадающей подстроке, полное соответствие должно быть наиболее длинным, и подвыражения, стоящие в РВ первыми, имеют приоритет над остальными, находящимися далее. Заметим, что высокоуровневые подвыражения имеют приоритет над низкоуровневыми компонентами подвыражений.

source: Match lengths are measured in characters, not collating elements. A null string is considered longer than no match at all. For example, "I<bb*>" matches the three middle characters of "abbbc", "I<(wee|week)(knights|nights)>" matches all ten characters of "weeknights", when "I<(.*).*>" is matched against "abc" the parenthesized subexpression matches all three characters, and when "I<(a*)*>" is matched against "bc" both the whole RE and the parenthesized subexpression match the null string.
ru: Длина совпадений измеряется в символах, а не в объединяющих элементах. Строка null считается длиннее чем не имеющая совпадений. Например, «I<bb*>» совпадает с тремя средними символами «abbbc», «I<(wee|week)(knights|nights)>» совпадает со всеми десятью символами «weeknights», а когда «I<(.*).*>» сравнивается с «abc», подвыражение в скобках совпадает со всеми тремя символами; при сравнении «I<(a*)*>» с «bc» получается, что РВ и подвыражение в скобках соответствуют строке null.

source: If case-independent matching is specified, the effect is much as if all case distinctions had vanished from the alphabet. When an alphabetic that exists in multiple cases appears as an ordinary character outside a bracket expression, it is effectively transformed into a bracket expression containing both cases, for example, \(aqx\(aq becomes "I<[xX]>". When it appears inside a bracket expression, all case counterparts of it are added to the bracket expression, so that, for example, "I<[x]>" becomes "I<[xX]>" and "I<[^x]>" becomes "I<[^xX]>".
ru: Если указано учитывать совпадение независимо от регистра, то все различия по регистру удаляются из алфавита. Когда буква присутствует в различных регистрах вне квадратных скобок, то она трансформируется в выражение в квадратных скобках, содержащее оба регистра, например, \(aqx\(aq становится «I<[xX]>». Если буква уже заключена в скобки, то к ней добавляется и другой регистр, например, «I<[x]>» становится «I<[xX]>» , а «I<[^x]>» превращается в «I<[^xX]>».

source: No particular limit is imposed on the length of REs\*(dg. Programs intended to be portable should not employ REs longer than 256 bytes, as an implementation can refuse to accept such REs and remain POSIX-compliant.
ru: Конкретного ограничения длины РВ\*(dg не существует. Однако, в переносимых программах не следует использовать РВ более 256 байтов, так как реализация может не принимать таких РВ, но оставаться соответствующей POSIX.

source: Obsolete ("basic") regular expressions differ in several respects. \(aq|\(aq, \(aq+\(aq, and \(aq?\(aq are ordinary characters and there is no equivalent for their functionality. The delimiters for bounds are "I<\e{>" and "I<\e}>", with \(aq{\(aq and \(aq}\(aq by themselves ordinary characters. The parentheses for nested subexpressions are "I<\e(>" and "I<\e)>", with \(aq(\(aq and \(aq)\(aq by themselves ordinary characters. \(aq^\(aq is an ordinary character except at the beginning of the RE or\*(dg the beginning of a parenthesized subexpression, \(aq$\(aq is an ordinary character except at the end of the RE or\*(dg the end of a parenthesized subexpression, and \(aq*\(aq is an ordinary character if it appears at the beginning of the RE or the beginning of a parenthesized subexpression (after a possible leading \(aq^\(aq).
ru: Устаревшие («основные») РВ отличаются по нескольким аспектам. Символы \(aq|\(aq, \(aq+\(aq и \(aq?\(aq считаются обычными символами. Для обозначения границ интервалов используются «I<\e{>» и «I<\e}>», а \(aq{\(aq и \(aq}\(aq сами по себе являются обычными символами. Для обособления подвыражений используются «I<\e(>» и «I<\e)>», а \(aq(\(aq и \(aq)\(aq сами по себе являются обычными символами. Символ \(aq^\(aq является обычным символом за исключением того случая, когда он стоит в начале РВ или\*(dg в начале подвыражения в круглых скобках; символ \(aq$\(aq является обычным символом, кроме того случая, когда он стоит в конце РВ или\*(dg в конце подвыражения в круглых скобках; символ \(aq*\(aq является обычным, если он стоит в начале РВ или в начале подвыражения в круглых скобках (возможно, после символа \(aq^\(aq в самом начале).

source: Finally, there is one new type of atom, a I<back reference>: \(aq\e\(aq followed by a nonzero decimal digit I<d> matches the same sequence of characters matched by the I<d>th parenthesized subexpression (numbering subexpressions by the positions of their opening parentheses, left to right), so that, for example, "I<\e([bc]\e)\e1>" matches "bb" or "cc" but not "bc".
ru: Кроме этого, существует ещё один тип атома — I<обратная ссылка>: \(aq\e\(aq с последующей за ней ненулевой десятичной цифрой I<d> соответствует той самой последовательности, что и I<d>-е подвыражение в скобках (нумерация подвыражений считается по их открывающим круглым скобкам, слева направо). Пример: «I<\e([bc]\e)\e1>» соответствует «bb» или «cc», но не «bc».

source: Having two kinds of REs is a botch.
ru: Наличие двух видов РВ — вынужденная мера.

source: The current POSIX.2 spec says that \(aq)\(aq is an ordinary character in the absence of an unmatched \(aq(\(aq; this was an unintentional result of a wording error, and change is likely. Avoid relying on it.
ru: В имеющейся на данный момент документации POSIX.2 указано, что символ \(aq)\(aq при отсутствии \(aq(\(aq; считается обычным; это непреднамеренная опечатка, которая будет исправлена. Не полагайтесь на это.

source: Back references are a dreadful botch, posing major problems for efficient implementations. They are also somewhat vaguely defined (does "I<a\e(\e(b\e)*\e2\e)*d>" match "abbbd"?). Avoid using them.
ru: Обратные ссылки — также вынужденная мера, вызывают серьёзные проблемы эффективности в реализациях. Также они не имеют подробного определения (например, «I<a\e(\e(b\e)*\e2\e)*d>» соответствует «abbbd»?).
