Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The value returned in I<d_off> is the same as would be returned by calling B<telldir>(3) at the current position in the directory stream. Be aware that despite its type and name, the I<d_off> field is seldom any kind of directory offset on modern filesystems. Applications should treat this field as an opaque value, making no assumptions about its contents; see also B<telldir>(3).
ru: Значение, возвращаемое в I<d_off>, тоже самое что и после вызова B<telldir>(3) в текущем положении курсора в потоке каталога. Учтите, что не смотря на тип и имя, в современных файловых системах поле I<d_off> мало похоже на смещение в каталоге. Приложения должны считать, что это поле неизвестного типа(чёрным ящиком) и не делать предположений о его содержимом; смотрите также B<telldir>(3).

source: This is the size (in bytes) of the returned record. This may not match the size of the structure definition shown above; see NOTES.
ru: Размер (в байтах) возвращаемой записи. Может не совпадать с размером структуры, показанной выше; смотрите ЗАМЕЧАНИЯ.

source: This field contains a value indicating the file type, making it possible to avoid the expense of calling B<lstat>(2) if further actions depend on the type of the file.
ru: Это поле содержит значение типа файла, что позволяет не делать дополнительный вызов B<lstat>(2), если дальнейшие действия зависят от типа файла.

source: When a suitable feature test macro is defined (B<_DEFAULT_SOURCE> on glibc versions since 2.19, or B<_BSD_SOURCE> on glibc versions 2.19 and earlier), glibc defines the following macro constants for the value returned in I<d_type>:
ru: Если определён подходящий макрос тестирования свойств (B<_DEFAULT_SOURCE> в версиях glibc начиная с 2.19 или B<_BSD_SOURCE> в версиях glibc 2.19 и старее), то для значения, возвращаемого в I<d_type>, glibc определяет следующие макросы-константы:

source: This is a block device.
ru: блочное устройство

source: This is a character device.
ru: символьное устройство

source: This is a directory.
ru: каталог

source: This is a named pipe (FIFO).
ru: именованный канал (FIFO)

source: This is a symbolic link.
ru: символическая ссылка

source: This is a regular file.
ru: обычный файл

source: This is a UNIX domain socket.
ru: доменный сокет UNIX

source: The file type could not be determined.
ru: Тип файла невозможно определить.

source: Currently, only some filesystems (among them: Btrfs, ext2, ext3, and ext4) have full support for returning the file type in I<d_type>. All applications must properly handle a return of B<DT_UNKNOWN>.
ru: В настоящее время, только файловые системы (среди которых: Btrfs, ext2, ext3 и ext4) поддерживают возврат типа файла в I<d_type>. Все приложения должны правильно обрабатывать возвращаемое значение B<DT_UNKNOWN>.

source: This field contains the null terminated filename. I<See NOTES>.
ru: Это поле содержит имя файла с завершающим null. I<Смотрите ЗАМЕЧАНИЯ>.

source: The data returned by B<readdir>() may be overwritten by subsequent calls to B<readdir>() for the same directory stream.
ru: Данные, возвращаемые B<readdir>(), могут быть переписаны последующими вызовами B<readdir>() для того же потока каталога.

source: On success, B<readdir>() returns a pointer to a I<dirent> structure. (This structure may be statically allocated; do not attempt to B<free>(3) it.)
ru: При успешном выполнении B<readdir>() возвращает указатель на структуру I<dirent> (эта структура может выделяться статически; не пытайтесь освободить её с помощью B<free>(3)).

source: If the end of the directory stream is reached, NULL is returned and I<errno> is not changed. If an error occurs, NULL is returned and I<errno> is set appropriately. To distinguish end of stream and from an error, set I<errno> to zero before calling B<readdir>() and then check the value of I<errno> if NULL is returned.
ru: При достижении конца потока каталога возвращается NULL и I<errno> не изменяется. При возникновении ошибки возвращается NULL, а I<errno> изменяется соответствующим образом. Чтобы отличить конец потока от ошибки присваивайте I<errno> значение нуля перед вызовом B<readdir>(), а после проверяйте значение I<errno>, если возвращается NULL.

source: In the current POSIX.1 specification (POSIX.1-2008), B<readdir>() is not required to be thread-safe. However, in modern implementations (including the glibc implementation), concurrent calls to B<readdir>() that specify different directory streams are thread-safe. In cases where multiple threads must read from the same directory stream, using B<readdir>() with external synchronization is still preferable to the use of the deprecated B<readdir_r>(3) function. It is expected that a future version of POSIX.1 will require that B<readdir>() be thread-safe when concurrently employed on different directory streams.
ru: В текущей спецификации POSIX.1 (POSIX.1-2008), от B<readdir>() не требуется быть нитебезопасной. Однако в современных реализациях (включая glibc) параллельные вызовы B<readdir>() для различных потоков каталога являются нитебезопасными. В случаях, когда несколько нитей должны читать один поток каталога, всё равно предпочтительней использовать B<readdir>() с внешней синхронизацией, а не устаревшей B<readdir_r>(3). Ожидается, что в будущей версии POSIX.1 для B<readdir>() будет требоваться нитебезопасность при одновременной работе с разными потоками каталога.

source: A directory stream is opened using B<opendir>(3).
ru: Поток каталога открывается с помощью B<opendir>(3).

source: The order in which filenames are read by successive calls to B<readdir>() depends on the filesystem implementation; it is unlikely that the names will be sorted in any fashion.
ru: Порядок последовательно читаемых имён файлов вызовом B<readdir>() зависит от реализации файловой системы; не очень здорово, что имена будут отсортированы в непредсказуемом порядке.

source: Only the fields I<d_name> and (as an XSI extension) I<d_ino> are specified in POSIX.1. Other than Linux, the I<d_type> field is available mainly only on BSD systems. The remaining fields are available on many, but not all systems. Under glibc, programs can check for the availability of the fields not defined in POSIX.1 by testing whether the macros B<_DIRENT_HAVE_D_NAMLEN>, B<_DIRENT_HAVE_D_RECLEN>, B<_DIRENT_HAVE_D_OFF>, or B<_DIRENT_HAVE_D_TYPE> are defined.
ru: В POSIX.1 определены только поля I<d_name> и I<d_ino> (расширение XSI). Кроме Linux, поле I<d_type> доступно, преимущественно только в системах BSD. Остальные поля доступны во многих, но не во всех системах. В glibc программы могут определить доступность полей, не определённых в POSIX.1, по наличию макросов B<_DIRENT_HAVE_D_NAMLEN>, B<_DIRENT_HAVE_D_RECLEN>, B<_DIRENT_HAVE_D_OFF> или B<_DIRENT_HAVE_D_TYPE>.

source: The d_name field
ru: Поле d_name

source: The I<dirent> structure definition shown above is taken from the glibc headers, and shows the I<d_name> field with a fixed size.
ru: Определение структуры I<dirent>, показанное выше, взято из заголовочных файлов glibc и отражает поле I<d_name> с постоянным размером.

source: I<Warning>: applications should avoid any dependence on the size of the I<d_name> field. POSIX defines it as I<char\ d_name[]>, a character array of unspecified size, with at most B<NAME_MAX> characters preceding the terminating null byte (\(aq\e0\(aq).
ru: I<Предупреждение>: приложения не должны зависеть от размера поля I<d_name>. В POSIX оно определено как I<char\ d_name[]>, массив символов неопределённого размера, не более B<NAME_MAX> символов с конечным байтом null (\(aq\e0\(aq).

source: POSIX.1 explicitly notes that this field should not be used as an lvalue. The standard also notes that the use of I<sizeof(d_name)> is incorrect; use I<strlen(d_name)> instead. (On some systems, this field is defined as I<char\ d_name[1]>!) By implication, the use I<sizeof(struct dirent)> to capture the size of the record including the size of I<d_name> is also incorrect.
ru: В POSIX.1 явно сказано, что это поле не должно использоваться как lvalue. В стандарте также отмечено, что использование I<sizeof(d_name)> некорректно; вместо него используйте I<strlen(d_name)> (в некоторых системах это поле определено как I<char\ d_name[1]>!). Как следствие, использовать I<sizeof(struct dirent)> для получения размера записи, включающей размер I<d_name> также неправильно.

source: Note that while the call
ru: Заметим, что хотя вызов

source: returns the value 255 for most filesystems, on some filesystems (e.g., CIFS, Windows SMB servers), the null-terminated filename that is (correctly) returned in I<d_name> can actually exceed this size. In such cases, the I<d_reclen> field will contain a value that exceeds the size of the glibc I<dirent> structure shown above.
ru: и возвращает значение 255 в большинстве файловых систем, но в некоторых файловых системах (например, CIFS, серверы Windows SMB) имя файла с null конце, возвращаемое (правильно) в I<d_name>, может превышать этот размер. В таких случаях поле I<d_reclen> будет содержать значение, превышающее размер структуры glibc I<dirent>, показанной выше.

source: nearbyint, nearbyintf, nearbyintl, rint, rintf, rintl - round to nearest integer
ru: nearbyint, nearbyintf, nearbyintl, rint, rintf, rintl - округление до ближайшего целого

source: The B<nearbyint>(), B<nearbyintf>(), and B<nearbyintl>() functions round their argument to an integer value in floating-point format, using the current rounding direction (see B<fesetround>(3)) and without raising the I<inexact> exception. When the current rounding direction is to nearest, these functions round halfway cases to the even integer in accordance with IEEE-754.
ru: Функции B<nearbyint>(), B<nearbyintf>() и B<nearbyintl>() округляют переданный аргумент до целого значения в формате с плавающей запятой в соответствии с текущим направлением округления (смотрите B<fesetround>(3)) и не генерируют исключение о I<неточности>. Когда текущее округление направлено к ближайшему целому, то в случае нахождения посереди между значениями эти функции округляют до чётного целого, в соответствии с IEEE-754.

source: The B<rint>(), B<rintf>(), and B<rintl>() functions do the same, but will raise the I<inexact> exception (B<FE_INEXACT>, checkable via B<fetestexcept>(3)) when the result differs in value from the argument.
ru: Функции B<rint>(), B<rintf>() и B<rintl>() делают то же самое, но генерируют исключение о I<неточности> (B<FE_INEXACT>, проверяется с помощью B<fetestexcept>(3)), если результат отличается в значении от аргумента.

source: SUSv2 and POSIX.1-2001 contain text about overflow (which might set I<errno> to B<ERANGE>, or raise an B<FE_OVERFLOW> exception). In practice, the result cannot overflow on any current machine, so this error-handling stuff is just nonsense. (More precisely, overflow can happen only when the maximum value of the exponent is smaller than the number of mantissa bits. For the IEEE-754 standard 32-bit and 64-bit floating-point numbers the maximum value of the exponent is 128 (respectively, 1024), and the number of mantissa bits is 24 (respectively, 53).)
ru: В SUSv2 и POSIX.1-2001 есть текст о переполнении (которое может установить I<errno> в B<ERANGE> или вызвать исключение B<FE_OVERFLOW>). На практике, результат не может выйти за диапазон ни на каком компьютере, поэтому обработка этой ошибки не имеет смысла (точнее говоря, переполнение возможно только в том случае, когда максимальное значение экспоненты меньше числа бит мантиссы. В стандарте IEEE-754 для 32- и 64-битных чисел с плавающей точкой максимальное значение экспоненты равно 128 и 1024 соответственно, а число бит мантиссы \(em 24 и 53 соответственно).

source: If you want to store the rounded value in an integer type, you probably want to use one of the functions described in B<lrint>(3) instead.
ru: Если вы хотите сохранить округлённое значение в целочисленном типе, то лучше использовать одну из функций, описанных в B<lrint>(3).

source: recno - record number database access method
ru: recno - метод доступа к базам нумерованных данных

source: I<Note well>: This page documents interfaces provided in glibc up until version 2.1. Since version 2.2, glibc no longer provides these interfaces. Probably, you are looking for the APIs provided by the I<libdb> library instead.
ru: I<Примечание>: В этой странице описаны интерфейсы, предоставляемые glibc до версии 2.1. Начиная с версии 2.2, glibc больше не поддерживает эти интерфейсы. Вероятно, вы ищите API, предоставляемое библиотекой I<libdb>.

source: The routine B<dbopen>(3) is the library interface to database files. One of the supported file formats is record number files. The general description of the database access methods is in B<dbopen>(3), this manual page describes only the recno-specific information.
ru: Функция B<dbopen>(3) — это библиотечный интерфейс к файлам баз данных. Один из поддерживаемых форматов файлов — нумерованные данные. Общее описание методов доступа к базам данных находится в B<dbopen>(3). Эта справочная страница содержит только информацию, относящуюся к нумерованным данным.

source: The record number data structure is either variable or fixed-length records stored in a flat-file format, accessed by the logical record number. The existence of record number five implies the existence of records one through four, and the deletion of record number one causes record number five to be renumbered to record number four, as well as the cursor, if positioned after record number one, to shift down one record.
ru: Структура нумерованных данных может описывать записи переменной или фиксированной длины, хранящиеся в файле в «плоском» формате, и доступные по логическому номеру записи. Существование записи с номером пять подразумевает существование записей от одного до четырёх и удаление записи с номером один вызывает перенумеровывание записи с номером пять в запись с номером четыре, а также сдвиг курсора вниз на одну запись, если он указывает на запись после номера один.

source: The recno access-method-specific data structure provided to B<dbopen>(3) is defined in the I<E<lt>db.hE<gt>> include file as follows:
ru: Специальная структура метода доступа к данным recno, предоставляемая B<dbopen>(3), определена в I<E<lt>db.hE<gt>> следующим образом:

source: The elements of this structure are defined as follows:
ru: Элементы этой структуры определены так:

source: The flag value is specified by ORing any of the following values:
ru: Значение флага определяется логическим ИЛИ следующих значений:

source: The records are fixed-length, not byte delimited. The structure element I<reclen> specifies the length of the record, and the structure element I<bval> is used as the pad character. Any records, inserted into the database, that are less than I<reclen> bytes long are automatically padded.
ru: Записи фиксированной длины без разделительного байта. Полем I<reclen> определяется длина записи, а поле I<bval> используется как дополняющий символ. Все вставляемые в базу данных записи, размер которых меньше I<reclen> байт, автоматически дополняются.

source: In the interface specified by B<dbopen>(3), the sequential record retrieval fills in both the caller's key and data structures. If the B<R_NOKEY> flag is specified, the I<cursor> routines are not required to fill in the key structure. This permits applications to retrieve records at the end of files without reading all of the intervening records.
ru: В интерфейсе, определённом B<dbopen>(3), последовательная выборка записей заполняет структуры данных и ключа вызывающего. Если указан флаг B<R_NOKEY>, то процедурам I<cursor> не обязательно заполнять структуру ключа. Это позволяет приложениям извлекать записи из конца файлов без чтения всех промежуточных записей.

source: This flag requires that a snapshot of the file be taken when B<dbopen>(3) is called, instead of permitting any unmodified records to be read from the original file.
ru: Этим флагом указывается, чтобы в момент вызова B<dbopen>(3) был сделан снимок (snapshot) файла, а не выполнялось чтение каких-либо не изменённых записей из оригинального файла.

source: A suggested maximum size, in bytes, of the memory cache. This value is B<only> advisory, and the access method will allocate more memory rather than fail. If I<cachesize> is 0 (no size is specified), a default cache is used.
ru: Предполагаемый максимальный размер кэша памяти в байтах. Эта величина I<только рекомендация>, метод доступа скорее выделит больше памяти, чем завершится с ошибкой. Если значение I<cachesize> равно 0 (размер не указан), то используется кэш по умолчанию.

source: The recno access method stores the in-memory copies of its records in a btree. This value is the size (in bytes) of the pages used for nodes in that tree. If I<psize> is 0 (no page size is specified), a page size is chosen based on the underlying filesystem I/O block size. See B<btree>(3) for more information.
ru: Метод доступа recno хранит копии своих записей в памяти в виде дерева btree. Это значение задаёт размер страниц (в байтах), используемых для узлов в этом дереве. Если значение I<psize> равно 0 (размер страницы не указан), то размер выбирается на основе размера блока ввода-вывода нижележащей файловой системы. Подробней смотрите B<btree>(3).

source: The byte order for integers in the stored database metadata. The number should represent the order as an integer; for example, big endian order would be the number 4,321. If I<lorder> is 0 (no order is specified), the current host order is used.
ru: Порядок расположения байтов, используемый при хранении целых чисел в метаданных базы данных. Число должно отражать порядок размещения в виде целого значения; например, порядок «big endian» должен обозначаться числом 4321. Если I<lorder> равно 0 (порядок не определён), то используется значение по умолчанию, принятое на машине.

source: The length of a fixed-length record.
ru: Длина записи фиксированной длины.

source: The delimiting byte to be used to mark the end of a record for variable-length records, and the pad character for fixed-length records. If no value is specified, newlines ("\en") are used to mark the end of variable-length records and fixed-length records are padded with spaces.
ru: Разделительный байт, для использования в качестве отметки конца записи с переменной длиной и как заполняющий символ для записи с фиксированной длиной. Если значение не указано, то для отметки конца записи с переменной длиной используется символ новой строки («\en»), а записи с фиксированной длиной дополняются пробелом.

source: The recno access method stores the in-memory copies of its records in a btree. If I<bfname> is non-NULL, it specifies the name of the btree file, as if specified as the filename for a B<dbopen>(3) of a btree file.
ru: Метод доступа recno хранит в памяти копии своих записей в дереве btree. Если значение I<bfname> не равно NULL, то им задаётся имя btree-файла в том же виде, что и при доступе B<dbopen>(3) для доступа к btree-файлу.

source: The data part of the key/data pair used by the I<recno> access method is the same as other access methods. The key is different. The I<data> field of the key should be a pointer to a memory location of type I<recno_t>, as defined in the I<E<lt>db.hE<gt>> include file. This type is normally the largest unsigned integral type available to the implementation. The I<size> field of the key should be the size of that type.
ru: Часть «данные» из пары ключ/данные, используемая методом доступа I<recno>, является такой же, как в других методах доступа. Ключ используется иначе. Как следует из определения заголовочного файла I<E<lt>db.hE<gt>>, поле ключа I<data> должно быть указателем на расположение памяти типа I<recno_t>. Этот тип, обычно, является наибольшим беззнаковым целочисленным типом данных, применяемым в реализации. Значение поля ключа I<size> должен задавать размер этого типа.

source: Because there can be no metadata associated with the underlying recno access method files, any changes made to the default values (e.g., fixed record length or byte separator value) must be explicitly specified each time the file is opened.
ru: Так как в файлах с данными в формате recno могут отсутствовать метаданные, то любые изменения значений по умолчанию (например, длина фиксированной записи или разделяющий байт) должны явно указываться каждый раз при открытии файла.

source: In the interface specified by B<dbopen>(3), using the I<put> interface to create a new record will cause the creation of multiple, empty records if the record number is more than one greater than the largest record currently in the database.
ru: В интерфейсе, определённым B<dbopen>(3), использование интерфейса I<put> для создания новой записи повлечёт за собой создание множества пустых записей, если номер записи больше, чем номер наибольшей записи, имеющейся в базе данных.

source: The I<recno> access method routines may fail and set I<errno> for any of the errors specified for the library routine B<dbopen>(3) or the following:
ru: Функции метода доступа I<recno> могут завершиться с ошибкой и присвоить I<errno> любое значение из определённых для библиотеки функций B<dbopen>(3), а также:

source: An attempt was made to add a record to a fixed-length database that was too large to fit.
ru: Попытка добавить слишком большую запись в базу данных фиксированной длины.

source: Only big and little endian byte order is supported.
ru: Поддерживаются значения только с прямым и обратным порядком байт.

source: re_comp, re_exec - BSD regex functions
ru: re_comp, re_exec - функции BSD для регулярных выражений

source: B<re_comp>() is used to compile the null-terminated regular expression pointed to by I<regex>. The compiled pattern occupies a static area, the pattern buffer, which is overwritten by subsequent use of B<re_comp>(). If I<regex> is NULL, no operation is performed and the pattern buffer's contents are not altered.
ru: Функция B<re_comp>() используется для компиляции регулярного выражения (завершающегося null), указанного I<regex>. Скомпилированный шаблон располагается в статической области (буфере шаблонов), которая перезаписывается заново каждый раз при вызове B<re_comp>(). Если значение I<regex> равно NULL, то действие не выполняется и содержимое буфера шаблонов остаётся неизменным.

source: B<re_exec>() is used to assess whether the null-terminated string pointed to by I<string> matches the previously compiled I<regex>.
ru: Функция B<re_exec>() используется для проверки совпадения строки (завершается null), на которую указывает I<string>, с предварительно скомпилированным I<regex>.

source: B<re_comp>() returns NULL on successful compilation of I<regex> otherwise it returns a pointer to an appropriate error message.
ru: Функция B<re_comp>() возвращает NULL при успешной компиляции I<regex> или указатель на соответствующее сообщение об ошибке.

source: B<re_exec>() returns 1 for a successful match, zero for failure.
ru: Функция B<re_exec>() возвращает 1 при совпадении или 0, если совпадения не было.

source: These functions are obsolete; the functions documented in B<regcomp>(3) should be used instead.
ru: Эти функции устарели; вместо них следует использовать функции, описанные в B<regcomp>(3).

source: B<regcomp>(3), B<regex>(7), GNU regex manual
ru: B<regcomp>(3), B<regex>(7), руководство по регулярным выражениям GNU

source: rexec, rexec_af - return stream to a remote command
ru: rexec, rexec_af - возвращает поток удалённой команде

source: Since glibc 2.19: _DEFAULT_SOURCE In glibc up to and including 2.19: _BSD_SOURCE
ru: начиная с glibc 2.19: _DEFAULT_SOURCE в glibc до версии 2.19 включительно: _BSD_SOURCE

source: This interface is obsoleted by B<rcmd>(3).
ru: Этот интерфейс устарел, используйте B<rcmd>(3).
