Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: random, urandom - kernel random number source devices
ru: random, urandom - ядерные устройства-источники случайных чисел

source: SYNOPSIS
ru: ОБЗОР

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The character special files I</dev/random> and I</dev/urandom> (present since Linux 1.3.30) provide an interface to the kernel's random number generator. The file I</dev/random> has major device number 1 and minor device number 8. The file I</dev/urandom> has major device number 1 and minor device number 9.
ru: Специальные символьные файлы I</dev/random> и I</dev/urandom> (появились в Linux 1.3.30) предоставляют интерфейс к генератору случайных чисел, встроенному в ядро. Файл I</dev/random> имеет старший номер устройства 1 и младший номер устройства 8. Файл I</dev/urandom> имеет старший номер устройства 1 и младший номер устройства 9.

source: The random number generator gathers environmental noise from device drivers and other sources into an entropy pool. The generator also keeps an estimate of the number of bits of noise in the entropy pool. From this entropy pool, random numbers are created.
ru: Генератор случайных чисел собирает окружающий шум от работы драйверов устройств и из других источников в пул энтропии. Генератор также постоянно оценивает количество битов шума в пуле энтропии. Именно с помощью этого пула создаются случайные числа.

source: Linux 3.17 and later provides the simpler and safer B<getrandom>(2) interface which requires no special files; see the B<getrandom>(2) manual page for details.
ru: В Linux 3.17 и новее предоставляется более простой и безопасный интерфейс B<getrandom>(2), который не требует специальных файлов; смотрите справочную страницу B<getrandom>(2).

source: When read, the I</dev/urandom> device returns random bytes using a pseudorandom number generator seeded from the entropy pool. Reads from this device do not block (i.e., the CPU is not yielded), but can incur an appreciable delay when requesting large amounts of data.
ru: При чтении из устройства I</dev/urandom> возвращаются произвольные байты, полученные из генератора псевдослучайных чисел, инициализированного из пула энтропии. Чтение из этого устройства не приводит к блокировке (то есть, ЦП не отдаёт управление), но может вызвать заметную задержку при запросе большого количества данных.

source: When read during early boot time, I</dev/urandom> may return data prior to the entropy pool being initialized. If this is of concern in your application, use B<getrandom>(2) or I</dev/random> instead.
ru: При чтении во время начальной загрузки ОС I</dev/urandom> может возвращать данные до инициализации пула энтропии. Если это неприемлемо для приложения, используйте B<getrandom>(2) или I</dev/random>.

source: The I</dev/random> device is a legacy interface which dates back to a time where the cryptographic primitives used in the implementation of I</dev/urandom> were not widely trusted. It will return random bytes only within the estimated number of bits of fresh noise in the entropy pool, blocking if necessary. I</dev/random> is suitable for applications that need high quality randomness, and can afford indeterminate delays.
ru: Устройство I</dev/random> является устаревшим интерфейсом, который относится ко времени времени, когда криптографическим примитивам, используемым в реализации I</dev/urandom>, не очень не доверяли. Интерфейс возвращает произвольные байты только с подсчитанным количеством бит свежего шума в пуле энтропии, блокируя работу при необходимости. Устройство I</dev/random> подходит для приложений, которым нужна произвольность высокого качества и без проблем относятся к задержкам на неопределённое время.

source: When the entropy pool is empty, reads from I</dev/random> will block until additional environmental noise is gathered. If B<open>(2) is called for I</dev/random> with the B<O_NONBLOCK> flag, a subsequent B<read>(2) will not block if the requested number of bytes is not available. Instead, the available bytes are returned. If no byte is available, B<read>(2) will return -1 and I<errno> will be set to B<EAGAIN>.
ru: Если пул энтропии пуст, попытка чтения I</dev/random> приведёт к блокировке, пока не будет собран дополнительный окружающий шум. Если вызов B<open>(2) для I</dev/random> запускается с флагом B<O_NONBLOCK>, то последующий B<read>(2) не будет заблокируется, если количество запрашиваемых байт недостаточно. Вместо этого будут возвращены имеющиеся байты. Если ни одного байта нет, то B<read>(2) вернёт -1 и значение I<errno> станет равно B<EAGAIN>.

source: The B<O_NONBLOCK> flag has no effect when opening I</dev/urandom>. When calling B<read>(2) for the device I</dev/urandom>, reads of up to 256 bytes will return as many bytes as are requested and will not be interrupted by a signal handler. Reads with a buffer over this limit may return less than the requested number of bytes or fail with the error B<EINTR>, if interrupted by a signal handler.
ru: При открытии I</dev/urandom> флаг B<O_NONBLOCK> не учитывается. При вызове B<read>(2) для устройства I</dev/urandom> чтение до 256 байт вернёт запрошенное количество байт и не будет прервано обработчиком сигнала. Чтение с буфером больше ограничения может вернуть количество байт меньше запрошенного или завершиться ошибкой B<EINTR> при прерывании обработчиком сигнала.

source: Since Linux 3.16, a B<read>(2) from I</dev/urandom> will return at most 32\ MB. A B<read>(2) from I</dev/random> will return at most 512 bytes (340 bytes on Linux kernels before version 2.6.12).
ru: Начиная с Linux 3.16, вызов B<read>(2) может прочитать из I</dev/urandom> почти 32\ МБ. Из I</dev/random> будет прочитано не более 512 байт (340 байт для ядер Linux до версии 2.6.12).

source: Writing to I</dev/random> or I</dev/urandom> will update the entropy pool with the data written, but this will not result in a higher entropy count. This means that it will impact the contents read from both files, but it will not make reads from I</dev/random> faster.
ru: При записи в I</dev/random> или I</dev/urandom> выполняется обновление пула энтропии записываемыми данными, но при этом не увеличивается счётчик энтропии. Это означает, что изменения отразятся в обоих файлах, но это не ускорит процесс чтения из I</dev/random>.

source: Usage
ru: Использование

source: The I</dev/random> interface is considered a legacy interface, and I</dev/urandom> is preferred and sufficient in all use cases, with the exception of applications which require randomness during early boot time; for these applications, B<getrandom>(2) must be used instead, because it will block until the entropy pool is initialized.
ru: Интерфейс I</dev/random> считается устаревшим, во всех случаях предпочтительно использовать I</dev/urandom>; исключением являются приложения, которым нужны произвольные байты во время загрузки системы; в таких приложениях нужно использовать B<getrandom>(2), так как этот вызов выполняет блокировку для ожидания наполнения пула энтропии.

source: If a seed file is saved across reboots as recommended below (all major Linux distributions have done this since 2000 at least), the output is cryptographically secure against attackers without local root access as soon as it is reloaded in the boot sequence, and perfectly adequate for network encryption session keys. Since reads from I</dev/random> may block, users will usually want to open it in nonblocking mode (or perform a read with timeout), and provide some sort of user notification if the desired entropy is not immediately available.
ru: Если файл начальных чисел (seed file) сохраняется между перезагрузками как рекомендуется далее (во всех основных дистрибутивах Linux это делается начиная с 2000 года), то результат шифрования стоек от атакующего, не имеющего локально привилегированного доступа, до перезагрузки машины, и вполне подходит для ключей шифрования сетевых сеансов. Так как чтение из I</dev/random> может привести к блокировке, пользователи хотели бы открывать его в неблокирующем режиме (или выполнять чтение с задержкой), и иметь механизм оповещения, если желаемый уровень энтропии в данный момент недоступен.

source: Configuration
ru: Настройка

source: If your system does not have I</dev/random> and I</dev/urandom> created already, they can be created with the following commands:
ru: Если в системе нет I</dev/random> и I</dev/urandom>, то их можно создать следующими командами:

source: When a Linux system starts up without much operator interaction, the entropy pool may be in a fairly predictable state. This reduces the actual amount of noise in the entropy pool below the estimate. In order to counteract this effect, it helps to carry entropy pool information across shut-downs and start-ups. To do this, add the lines to an appropriate script which is run during the Linux system start-up sequence:
ru: Когда Linux-система запускается без участия человека, пул энтропии может оказаться в довольно предсказуемом состоянии. Это снижает значимый объём шума в пуле энтропии ниже оцениваемого. Для преодоления этого эффекта можно сохранять информацию пула энтропии во время выключения и восстанавливать во время запуска системы. Для этого добавьте строки в сценарий, который выполняется при запуске Linux-системы:

source: echo "Initializing random number generator..." random_seed=/var/run/random-seed # Carry a random seed from start-up to start-up # Load and then save the whole entropy pool if [ -f $random_seed ]; then cat $random_seed E<gt>/dev/urandom else touch $random_seed fi chmod 600 $random_seed poolfile=/proc/sys/kernel/random/poolsize [ -r $poolfile ] && bits=$(cat $poolfile) || bits=4096 bytes=$(expr $bits / 8) dd if=/dev/urandom of=$random_seed count=1 bs=$bytes
ru: echo "Инициализация генератора случайных чисел…" random_seed=/var/run/random-seed # перенос случайного начального числа от запуска к запуску # загрузка и сохранение всего пула энтропии if [ -f $random_seed ]; then cat $random_seed E<gt>/dev/urandom else touch $random_seed fi chmod 600 $random_seed poolfile=/proc/sys/kernel/random/poolsize [ -r $poolfile ] && bits=$(cat $poolfile) || bits=4096 bytes=$(expr $bits / 8) dd if=/dev/urandom of=$random_seed count=1 bs=$bytes

source: Also, add the following lines in an appropriate script which is run during the Linux system shutdown:
ru: Также добавьте следующие строки в сценарий, который выполняется при завершении работы Linux-системы:

source: # Carry a random seed from shut-down to start-up # Save the whole entropy pool echo "Saving random seed..." random_seed=/var/run/random-seed touch $random_seed chmod 600 $random_seed poolfile=/proc/sys/kernel/random/poolsize [ -r $poolfile ] && bits=$(cat $poolfile) || bits=4096 bytes=$(expr $bits / 8) dd if=/dev/urandom of=$random_seed count=1 bs=$bytes
ru: # перенос случайного начального числа от выключения до запуска # сохранение всего пула энтропии echo "Сохранение случайного начального числа…" random_seed=/var/run/random-seed touch $random_seed chmod 600 $random_seed poolfile=/proc/sys/kernel/random/poolsize [ -r $poolfile ] && bits=$(cat $poolfile) || bits=4096 bytes=$(expr $bits / 8) dd if=/dev/urandom of=$random_seed count=1 bs=$bytes

source: In the above examples, we assume Linux 2.6.0 or later, where I</proc/sys/kernel/random/poolsize> returns the size of the entropy pool in bits (see below).
ru: В примерах выше мы предполагаем, что используется ядро Linux 2.6.0 или новее, в котором I</proc/sys/kernel/random/poolsize> содержит размер пула энтропии в битах (смотрите ниже).

source: /proc interfaces
ru: Интерфейсы /proc

source: The files in the directory I</proc/sys/kernel/random> (present since 2.3.16) provide additional information about the I</dev/random> device:
ru: Файлы в каталоге I</proc/sys/kernel/random> (начиная с 2.3.16) предоставляют дополнительную информацию об устройстве I</dev/random>:

source: This read-only file gives the available entropy, in bits. This will be a number in the range 0 to 4096.
ru: Файл доступен только для чтения и показывает количество бит доступной энтропии. Данное число находится в диапазоне от 0 до 4096.

source: This file gives the size of the entropy pool. The semantics of this file vary across kernel versions:
ru: Файл содержит размер пула энтропии. Формат файла зависит от версии ядра:

source: This file gives the size of the entropy pool in I<bytes>. Normally, this file will have the value 512, but it is writable, and can be changed to any value for which an algorithm is available. The choices are 32, 64, 128, 256, 512, 1024, or 2048.
ru: В файле содержится размер пула энтропии в I<байтах>. Обычно это число 512, но так как файл доступен на запись, значение можно изменить, подстроив его под доступный алгоритм. Возможные значения \(em 32, 64, 128, 256, 512, 1024 или 2048.

source: Linux 2.6 and later:
ru: Linux 2.6 и новее:

source: This file is read-only, and gives the size of the entropy pool in I<bits>. It contains the value 4096.
ru: Файл доступен только на чтение и содержит размер пула энтропии в I<битах>. Значение равно 4096.

source: This file contains the number of bits of entropy required for waking up processes that sleep waiting for entropy from I</dev/random>. The default is 64.
ru: В файле содержится количество бит энтропии, требуемое для пробуждения процессов, которые спят в ожидании энтропии из I</dev/random>. Значение по умолчанию равно 64.

source: This file contains the number of bits of entropy below which we wake up processes that do a B<select>(2) or B<poll>(2) for write access to I</dev/random>. These values can be changed by writing to the files.
ru: В файле содержится количество бит энтропии, менее которого мы пробуждаем процессы, которые выполнили вызовы B<select>(2) или B<poll>(2) для ожидания записи в I</dev/random>. Эти значения можно изменить, записав новые числа в эти файлы.

source: I<uuid> and I<boot_id>
ru: I<uuid> и I<boot_id>

source: These read-only files contain random strings like 6fd5a44b-35f4-4ad4-a9b9-6b9be13e1fe9. The former is generated afresh for each read, the latter was generated once.
ru: Эти файлы, доступные только для чтения, содержат произвольные строки вида 6fd5a44b-35f4-4ad4-a9b9-6b9be13e1fe9. Значение первого генерируется заново при каждом чтении, а значение второго генерируется только один раз.

source: ioctl(2) interface
ru: Интерфейс ioctl(2)

source: The following B<ioctl>(2) requests are defined on file descriptors connected to either I</dev/random> or I</dev/urandom>. All requests performed will interact with the input entropy pool impacting both I</dev/random> and I</dev/urandom>. The B<CAP_SYS_ADMIN> capability is required for all requests except B<RNDGETENTCNT>.
ru: Для файловых дескрипторов, соединённых с файлами I</dev/random> и I</dev/urandom>, определены запросы B<ioctl>(2), перечисленные ниже. Все выполняемые запросы обращаются к входному пулу энтропии, который относится к и к I</dev/random>, и к I</dev/urandom>. Для выполнения всех запросов (кроме B<RNDGETENTCNT>) требуется мандат B<CAP_SYS_ADMIN>.

source: Retrieve the entropy count of the input pool, the contents will be the same as the I<entropy_avail> file under proc. The result will be stored in the int pointed to by the argument.
ru: Возвращает счётчик энтропии входного пула, возвращается содержимое из файла I<entropy_avail> в proc. Результат сохраняется в int, указанный в параметре.

source: Increment or decrement the entropy count of the input pool by the value pointed to by the argument.
ru: Увеличивает или уменьшает счётчик энтропии входного пула на значение аргумента.

source: Removed in Linux 2.6.9.
ru: Удалён из Linux 2.6.9.

source: Add some additional entropy to the input pool, incrementing the entropy count. This differs from writing to I</dev/random> or I</dev/urandom>, which only adds some data but does not increment the entropy count. The following structure is used:
ru: Вносит дополнительную энтропию во входной пул, увеличивая счётчик энтропии. Запись в I</dev/random> или I</dev/urandom> добавляет только данные, но не увеличивает счётчик энтропии (в этом отличие). Используется следующая структура:

source: Here I<entropy_count> is the value added to (or subtracted from) the entropy count, and I<buf> is the buffer of size I<buf_size> which gets added to the entropy pool.
ru: Здесь I<entropy_count> — добавляемое (или вычитаемое) значение к счётчику энтропии, а I<buf> — буфер с размером I<buf_size>, из которого в пул энтропии добавляются данные.

source: Zero the entropy count of all pools and add some system data (such as wall clock) to the pools.
ru: Обнуляет счётчики всех пулов и добавляет в них некоторые системные данные (такие как время).

source: FILES
ru: ФАЙЛЫ

source: NOTES
ru: ЗАМЕЧАНИЯ

source: For an overview and comparison of the various interfaces that can be used to obtain randomness, see B<random>(7).
ru: Обзор и сравнение возможных интерфейсов, через которые можно получать случайные данные, смотрите в B<random>(7).

source: BUGS
ru: ДЕФЕКТЫ

source: During early boot time, reads from I</dev/urandom> may return data prior to the entropy pool being initialized.
ru: Во время начальной загрузки ОС чтение из I</dev/urandom> может возвращать данные до инициализации пула энтропии.

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: rtc - real-time clock
ru: rtc - часы реального времени

source: This is the interface to drivers for real-time clocks (RTCs).
ru: Данное устройство представляет собой интерфейс к драйверам часов реального времени (RTC).

source: Most computers have one or more hardware clocks which record the current "wall clock" time. These are called "Real Time Clocks" (RTCs). One of these usually has battery backup power so that it tracks the time even while the computer is turned off. RTCs often provide alarms and other interrupts.
ru: В большинстве компьютеров есть одни и более аппаратных часов, ведущих отчёт "обычного" времени. Они называются "часами реального времени" (Real Time Clock, RTC). Некоторые из них имеют батарею резервного питания для продолжения работы в периоды, когда компьютер выключен. В RTC часто встроены будильники и другие прерывания.

source: All i386 PCs, and ACPI-based systems, have an RTC that is compatible with the Motorola MC146818 chip on the original PC/AT. Today such an RTC is usually integrated into the mainboard's chipset (south bridge), and uses a replaceable coin-sized backup battery.
ru: Все ПК i386 и системы с ACPI содержат RTC, которые совместимы с микросхемой Motorola MC146818 из первоначальной модели PC/AT. Сегодня такие RTC обычно встраивают в чипсет материнской платы (в южный мост), и они используют заменяемую резервную батарею (типа «таблетки»).

source: Non-PC systems, such as embedded systems built around system-on-chip processors, use other implementations. They usually won't offer the same functionality as the RTC from a PC/AT.
ru: В системах, несовместимых с PC (например, встраиваемые системы, собираемые на процессоре "всё в одном"), используются другие варианты. Обычно, они не предоставляют таких возможностей, как RTC в PC/AT.

source: RTC vs system clock
ru: RTC и системные часы

source: RTCs should not be confused with the system clock, which is a software clock maintained by the kernel and used to implement B<gettimeofday>(2) and B<time>(2), as well as setting timestamps on files, and so on. The system clock reports seconds and microseconds since a start point, defined to be the POSIX Epoch: 1970-01-01 00:00:00 +0000 (UTC). (One common implementation counts timer interrupts, once per "jiffy", at a frequency of 100, 250, or 1000 Hz.) That is, it is supposed to report wall clock time, which RTCs also do.
ru: Не нужно путать RTC с системными часами, которые представляют собой часы, реализованные в ядре программно и используемые для работы B<gettimeofday>(2) и B<time>(2), а также при указании временных меток файлов и т. п. Системные часы выдают секунды и микросекунды, начиная отсчёт от эпохи POSIX: 1970-01-01 00:00:00 +0000 (UTC) (в основном, реализуется на основе таймера прерываний ведя подсчёт «мигов» (jiffy) c частотой 100, 250 или 1000 Гц). То есть, предполагается, что они показывают обычное время как и RTC.

source: A key difference between an RTC and the system clock is that RTCs run even when the system is in a low power state (including "off"), and the system clock can't. Until it is initialized, the system clock can only report time since system boot ... not since the POSIX Epoch. So at boot time, and after resuming from a system low power state, the system clock will often be set to the current wall clock time using an RTC. Systems without an RTC need to set the system clock using another clock, maybe across the network or by entering that data manually.
ru: Ключевым отличием RTC от системных часов, является то, что RTC работают даже когда система находится в состоянии пониженного энергопотребления (даже в выключенном), а для системных часов такое недоступно. До своей инициализации системные часы показывают время, прошедшее с момента запуска системы, а не с начала эпохи POSIX. Поэтому при загрузке и после восстановления из состояния пониженного энергопотребления в системных часах часто подстраивают текущее время с помощью RTC. Системам без RTC требуется установить свои системные часы с помощью других часов, возможно через сеть или ручного ввода данных.

source: RTC functionality
ru: Назначение RTC

source: RTCs can be read and written with B<hwclock>(8), or directly with the ioctl requests listed below.
ru: Из RTC можно читать или писать с помощью B<hwclock>(8) или через вызовы ioctl, перечисленные ниже.

source: Besides tracking the date and time, many RTCs can also generate interrupts
ru: Помимо контроля даты и времени многие RTC также позволяют генерировать прерывания

source: on every clock update (i.e., once per second);
ru: при каждом обновлении часов (т.е. раз в секунду);

source: at periodic intervals with a frequency that can be set to any power-of-2 multiple in the range 2 Hz to 8192 Hz;
ru: через периодические интервалы с частотой, значение которой может быть любой степенью 2 в диапазоне от 2 Гц до 8192 Гц;

source: on reaching a previously specified alarm time.
ru: по достижению указанного времени будильника.

source: Each of those interrupt sources can be enabled or disabled separately. On many systems, the alarm interrupt can be configured as a system wakeup event, which can resume the system from a low power state such as Suspend-to-RAM (STR, called S3 in ACPI systems), Hibernation (called S4 in ACPI systems), or even "off" (called S5 in ACPI systems). On some systems, the battery backed RTC can't issue interrupts, but another one can.
ru: Каждый из этих источников прерываний можно включать или выключать независимо друг от друга. Во многих системах прерывание будильника можно настроить как событие пробуждения системы, для вывода системы из состояний пониженного энергопотребления таких как: ждущего режима (Suspend-to-RAM (STR), S3 в терминологии ACPI), спящего режима (hibernation, S4 в терминологии ACPI) или даже из "выключенного" состояния (S5 в терминологии ACPI). Но в некоторых системах RTC с резервной батареей не могут генерировать прерывания.
