Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: A user interface to the B<portmap> service, which establishes a mapping between the triple [I<prognum>,I<versnum>,I<protocol>] and I<port> on the machine's B<portmap> service. The value of I<protocol> is most likely B<IPPROTO_UDP> or B<IPPROTO_TCP>. This routine returns one if it succeeds, zero otherwise. Automatically done by B<svc_register>().
ru: Пользовательский интерфейс службы B<portmap>, который устанавливает соответствие между [I<prognum>,I<versnum>,I<protocol>] и I<port> на машине с службой B<portmap>. Обычно, значение I<protocol> равно B<IPPROTO_UDP> или B<IPPROTO_TCP>. При успешном выполнении эта функция возвращает 1 и 0 в противном случае. Автоматически выполняется из B<svc_register>().

source: A user interface to the B<portmap> service, which destroys all mapping between the triple [I<prognum>,I<versnum>,I<*>] and B<ports> on the machine's B<portmap> service. This routine returns one if it succeeds, zero otherwise.
ru: Пользовательский интерфейс службы B<portmap>, который уничтожает все соответствия между [I<prognum>,I<versnum>,I<*>] и B<ports> на машине с службой B<portmap>. При успешном выполнении эта функция возвращает 1 и 0 в противном случае.

source: Register procedure I<procname> with the RPC service package. If a request arrives for program I<prognum>, version I<versnum>, and procedure I<procnum>, I<procname> is called with a pointer to its parameter(s); I<procname> should return a pointer to its static result(s); I<inproc> is used to decode the parameters while I<outproc> is used to encode the results. This routine returns zero if the registration succeeded, -1 otherwise.
ru: Регистрирует процедуру I<procname> в пакете служб RPC. Если запрос приходит программе I<prognum> версии I<versnum> и процедуре I<procnum>, то I<procname> вызывается с указателем на эти параметры; I<procname> должна возвращать указатель на эти статические результаты; I<inproc> используется для декодирования параметров, а I<outproc> — для кодирования результатов. При успешной регистрации эта функция возвращает 0 и -1 в противном случае.

source: Warning: remote procedures registered in this form are accessed using the UDP/IP transport; see B<svcudp_create>() for restrictions.
ru: Предупреждение: удалённые процедуры, зарегистрированные таким способом, доступны по протоколу UDP/IP; информацию об ограничениях смотрите в B<svcudp_create>().

source: A global variable whose value is set by any RPC client creation routine that does not succeed. Use the routine B<clnt_pcreateerror>() to print the reason why.
ru: Глобальная переменная, значение которой устанавливается любой функцией создания клиента RPC при ошибке. Используйте функцию B<clnt_pcreateerror>() для вывода сообщения о причине ошибки.

source: A macro that destroys the RPC service transport handle, I<xprt>. Destruction usually involves deallocation of private data structures, including I<xprt> itself. Use of I<xprt> is undefined after calling this routine.
ru: Макрос, который уничтожает описатель протокола службы RPC I<xprt>. Уничтожение, обычно, освобождает скрытые структуры данных, включая сам I<xprt>. Работа с I<xprt> после вызова этой функции не описана.

source: A global variable reflecting the RPC service side's read file descriptor bit mask; it is suitable as a parameter to the B<select>(2) system call. This is of interest only if a service implementor does their own asynchronous event processing, instead of calling B<svc_run>(). This variable is read-only (do not pass its address to B<select>(2)!), yet it may change after calls to B<svc_getreqset>() or any creation routines.
ru: Глобальная переменная, отражающая битовую маску читаемого файлового дескриптора службы RPC; она подходит в качестве параметра для системного вызова B<select>(2). Полезна только, если реализация службы использует собственный обработчик асинхронных событий, а не вызова B<svc_run>(). Эта переменная доступна только для чтения (не передавайте её адрес в B<select>(2)!), также она может измениться после вызова B<svc_getreqset>() или функций создания.

source: Similar to B<svc_fdset>, but limited to 32 file descriptors. This interface is obsoleted by B<svc_fdset>.
ru: Подобна B<svc_fdset>, но ограничена 32 файловыми дескрипторами. Устарела, используйте B<svc_fdset>.

source: A macro that frees any data allocated by the RPC/XDR system when it decoded the arguments to a service procedure using B<svc_getargs>(). This routine returns 1 if the results were successfully freed, and zero otherwise.
ru: Макрос, который освобождает любые данные, выделенные системой RPC/XDR при декодировании аргументов процедуры службы с помощью B<svc_getargs>(). Эта функция возвращает 1, если результаты были успешно освобождены, и 0 в противном случае.

source: A macro that decodes the arguments of an RPC request associated with the RPC service transport handle, I<xprt>. The parameter I<in> is the address where the arguments will be placed; I<inproc> is the XDR routine used to decode the arguments. This routine returns one if decoding succeeds, and zero otherwise.
ru: Макрос, декодирующий параметры запроса RPC, связанного с описателем протокола службы RPC I<xprt>. Параметр I<in> — адрес, по которому будут размещены аргументы; I<inproc> — функция XDR, использующаяся для декодирования аргументов. При успешном декодировании функция возвращает 1 и 0 в противном случае.

source: The approved way of getting the network address of the caller of a procedure associated with the RPC service transport handle, I<xprt>.
ru: Правильный способ получения сетевого адреса вызвавшего процедуру, связанную с описателем протокола службы RPC I<xprt>.

source: This routine is of interest only if a service implementor does not call B<svc_run>(), but instead implements custom asynchronous event processing. It is called when the B<select>(2) system call has determined that an RPC request has arrived on some RPC socket(s); I<rdfds> is the resultant read file descriptor bit mask. The routine returns when all sockets associated with the value of I<rdfds> have been serviced.
ru: Функция представляет интерес, только если реализация службы не вызывает функцию B<svc_run>(), а реализует собственную асинхронную обработку событий. Вызывается, когда системный вызов B<select>(2) определил, что поступил запрос RPC в какой-либо сокет RPC; I<rdfds> — битовая маска читаемого файлового дескриптора. Функция завершается после обработки всех сокетов, связанных со значением I<rdfds>.

source: Similar to B<svc_getreqset>(), but limited to 32 file descriptors. This interface is obsoleted by B<svc_getreqset>().
ru: Подобна B<svc_getreqset>(), но ограничена 32 файловыми дескрипторами. Устарела, используйте B<svc_getreqset>().

source: Associates I<prognum> and I<versnum> with the service dispatch procedure, I<dispatch>. If I<protocol> is zero, the service is not registered with the B<portmap> service. If I<protocol> is nonzero, then a mapping of the triple [I<prognum>,I<versnum>,I<protocol>] to I<xprt-E<gt>xp_port> is established with the local B<portmap> service (generally I<protocol> is zero, B<IPPROTO_UDP> or B<IPPROTO_TCP>). The procedure I<dispatch> has the following form:
ru: Связывает I<prognum> и I<versnum> с функцией распределения служб I<dispatch>. Если значение I<protocol> равно 0, то служба не регистрируется службой I<portmap>. Если значение I<protocol> не равно 0, тогда соответствие [I<prognum>,I<versnum>,I<protocol>] и I<xprt-E<gt>xp_port> устанавливается локальной службой I<portmap> (обычно, значение I<protocol> равно 0, B<IPPROTO_UDP> или B<IPPROTO_TCP>). Функция I<dispatch> имеет следующий вид:

source: The B<svc_register>() routine returns one if it succeeds, and zero otherwise.
ru: При успешном выполнении функция B<svc_register>() возвращает 1 и 0 в противном случае.

source: This routine never returns. It waits for RPC requests to arrive, and calls the appropriate service procedure using B<svc_getreq>() when one arrives. This procedure is usually waiting for a B<select>(2) system call to return.
ru: Эта функция не возвращает управление. Она ждёт поступления запросов RPC и при их появлении вызывает соответствующую процедуру службы с помощью B<svc_getreq>(). Обычно, эта функция ждёт возврата из системного вызова B<select>(2).

source: Called by an RPC service's dispatch routine to send the results of a remote procedure call. The parameter I<xprt> is the request's associated transport handle; I<outproc> is the XDR routine which is used to encode the results; and I<out> is the address of the results. This routine returns one if it succeeds, zero otherwise.
ru: Вызывается функцией распределения служб RPC для отправки результатов вызову удалённой процедуры. Параметр I<xprt> — описатель протокола связанного запроса; I<outproc> — функция XDR, которая используется для кодирования результатов; I<out> — адрес, по которому находятся результаты. При успешном выполнении эта функция возвращает 1 и 0 в противном случае.

source: Remove all mapping of the double [I<prognum>,I<versnum>] to dispatch routines, and of the triple [I<prognum>,I<versnum>,I<*>] to port number.
ru: Удаляет все сопоставления [I<prognum>,I<versnum>] функциям распределения и [I<prognum>,I<versnum>,I<*>] номеру порта.

source: Called by a service dispatch routine that refuses to perform a remote procedure call due to an authentication error.
ru: Вызывается функцией распределения служб, которая отклоняет выполнение вызова удалённой процедуры из ошибки аутентификации.

source: Called by a service dispatch routine that cannot successfully decode its parameters. See also B<svc_getargs>().
ru: Вызывается функцией распределения служб, если невозможно декодировать её параметры. Смотрите также B<svc_getargs>().

source: Called by a service dispatch routine that does not implement the procedure number that the caller requests.
ru: Вызывается функцией распределения служб, если не реализован номер процедуры, указанный в полученном запросе.

source: Called when the desired program is not registered with the RPC package. Service implementors usually do not need this routine.
ru: Вызывается, когда желаемая программа не зарегистрирована в пакете RPC. Обычно, для реализации службы эта функция не требуется.

source: Called when the desired version of a program is not registered with the RPC package. Service implementors usually do not need this routine.
ru: Вызывается, когда желаемая версия программы не зарегистрирована в пакете RPC. Обычно, для реализации службы эта функция не требуется.

source: Called by a service dispatch routine when it detects a system error not covered by any particular protocol. For example, if a service can no longer allocate storage, it may call this routine.
ru: Вызывается функцией распределения служб при обнаружении системной ошибки, не относящейся к какому-то конкретному протоколу. Например, служба может вызвать эту функцию, если не удалось выделить память.

source: Called by a service dispatch routine that refuses to perform a remote procedure call due to insufficient authentication parameters. The routine calls B<svcerr_auth(xprt, AUTH_TOOWEAK)>.
ru: Вызывается функцией распределения служб для отклонения вызова удалённой процедуры из недостатка параметров аутентификации. Функция вызывает B<svcerr_auth(xprt, AUTH_TOOWEAK)>.

source: Create a service on top of any open file descriptor. Typically, this file descriptor is a connected socket for a stream protocol such as TCP. I<sendsize> and I<recvsize> indicate sizes for the send and receive buffers. If they are zero, a reasonable default is chosen.
ru: Создаёт службу поверх любого открытого файлового дескриптора. Обычно, этот файловый дескриптор является подключённым сокетом для поточного протокола, например TCP. В I<sendsize> и I<recvsize> указываются размеры буферов отправки и приёма. Если эти значения равны нулю, то выбирается приемлемое значение по умолчанию.

source: This routine creates a toy RPC service transport, to which it returns a pointer. The transport is really a buffer within the process's address space, so the corresponding RPC client should live in the same address space; see B<clntraw_create>(). This routine allows simulation of RPC and acquisition of RPC overheads (such as round trip times), without any kernel interference. This routine returns NULL if it fails.
ru: Эта функция создаёт игрушечный протокол службы RPC и возвращает указатель на него. В действительности протокол представляет собой буфер внутри адресного пространства процесса, поэтому соответствующие клиенты RPC должны находиться в том же адресном пространстве; смотрите B<clntraw_create>(). Эта функция позволяет имитировать RPC и создавать дополнительные нагрузки на RPC (как, например, время пересылки туда и обратно) без какого-либо вмешательства ядра. При ошибке функция возвращает NULL.

source: This routine creates a TCP/IP-based RPC service transport, to which it returns a pointer. The transport is associated with the socket I<sock>, which may be B<RPC_ANYSOCK>, in which case a new socket is created. If the socket is not bound to a local TCP port, then this routine binds it to an arbitrary port. Upon completion, I<xprt-E<gt>xp_sock> is the transport's socket descriptor, and I<xprt-E<gt>xp_port> is the transport's port number. This routine returns NULL if it fails. Since TCP-based RPC uses buffered I/O, users may specify the size of buffers; values of zero choose suitable defaults.
ru: Эта функция создаёт протокол службы RPC на основе TCP/IP и возвращает указатель на него. Протокол связывается с сокетом I<sock>, значение которого может быть равно B<RPC_ANYSOCK>; в этом случае создаётся новый сокет. Если сокет не привязан к локальному порту TCP, то эта функция привязывает его к произвольному порту. При завершении I<xprt-E<gt>xp_sock> содержит дескриптор сокета протокола, а I<xprt-E<gt>xp_port> — номер порта протокола. При ошибке эта функция возвращает NULL. Так как в RPC на основе TCP используется буферизация ввода-вывода, пользователи могут задавать размер буферов; при нулевом значении выбирается подходящий размер по умолчанию.

source: This routine creates a UDP/IP-based RPC service transport, to which it returns a pointer. The transport is associated with the socket I<sock>, which may be B<RPC_ANYSOCK>, in which case a new socket is created. If the socket is not bound to a local UDP port, then this routine binds it to an arbitrary port. Upon completion, I<xprt-E<gt>xp_sock> is the transport's socket descriptor, and I<xprt-E<gt>xp_port> is the transport's port number. This routine returns NULL if it fails.
ru: Эта функция создаёт протокол службы RPC на основе UDP/IP и возвращает указатель на него. Протокол связывается с сокетом I<sock>, значение которого может быть равно B<RPC_ANYSOCK>; в этом случае создаётся новый сокет. Если сокет не привязан к локальному порту UDP, то эта функция привязывает его к произвольному порту. При завершении I<xprt-E<gt>xp_sock> содержит дескриптор сокета протокола, а I<xprt-E<gt>xp_port> — номер порта протокола. При ошибке эта функция возвращает NULL.

source: This call is equivalent to I<svcudp_bufcreate(sock,SZ,SZ)> for some default size I<SZ>.
ru: Этот вызов аналогичен I<svcudp_bufcreate(sock,SZ,SZ)> для некоторого размера B<SZ> по умолчанию.

source: Used for encoding RPC reply messages. This routine is useful for users who wish to generate RPC-style messages without using the RPC package.
ru: Используется для кодирования ответных сообщений RPC. Эта функция полезна для пользователей, которые хотят генерировать RPC-подобные сообщения без использования пакета RPC.

source: Used for describing UNIX credentials. This routine is useful for users who wish to generate these credentials without using the RPC authentication package.
ru: Используется для описания информации (credentials) UNIX. Эта функция полезна для пользователей, которые хотят генерировать такую информацию без использования пакета аутентификации RPC.

source: Used for describing RPC call header messages. This routine is useful for users who wish to generate RPC-style messages without using the RPC package.
ru: Используется для описания заголовка сообщений вызовов RPC. Эта функция полезна для пользователей, которые хотят генерировать RPC-подобные сообщения без использования пакета RPC.

source: Used for describing RPC call messages. This routine is useful for users who wish to generate RPC-style messages without using the RPC package.
ru: Используется для описания сообщений вызовов RPC. Эта функция полезна для пользователей, которые хотят генерировать RPC-подобные сообщения без использования пакета RPC.

source: Used for describing RPC authentication information messages. This routine is useful for users who wish to generate RPC-style messages without using the RPC package.
ru: Используется для описания информационных сообщений аутентификации RPC. Эта функция полезна для пользователей, которые хотят генерировать RPC-подобные сообщения без использования пакета RPC.

source: Used for describing parameters to various B<portmap> procedures, externally. This routine is useful for users who wish to generate these parameters without using the B<pmap> interface.
ru: Используется для описания параметров различных функций B<portmap> извне. Эта функция полезна для пользователей, которые хотят генерировать такие параметры без использования интерфейса B<pmap>.

source: Used for describing a list of port mappings, externally. This routine is useful for users who wish to generate these parameters without using the B<pmap> interface.
ru: Используется для описания списка соответствия портов извне. Эта функция полезна для пользователей, которые хотят генерировать такие параметры без использования интерфейса B<pmap>.

source: Used for describing RPC reply messages. This routine is useful for users who wish to generate RPC-style messages without using the RPC package.
ru: Используется для описания ответных сообщений RPC. Эта функция полезна для пользователей, которые хотят генерировать RPC-подобные сообщения без использования пакета RPC.

source: Used for describing RPC reply messages. This routine is useful for users who wish to generate RPC style messages without using the RPC package.
ru: Используется для описания ответных сообщений RPC. Эта функция полезна для пользователей, которые хотят генерировать RPC-подобные сообщения без использования пакета RPC.

source: After RPC service transport handles are created, they should register themselves with the RPC service package. This routine modifies the global variable I<svc_fds>. Service implementors usually do not need this routine.
ru: После создания описателей протокола службы RPC они должны самостоятельно зарегистрироваться в пакетом служб RPC. Эта функция изменяет глобальную переменную I<svc_fds>. Обычно, для реализации служб эта функция не требуется.

source: Before an RPC service transport handle is destroyed, it should unregister itself with the RPC service package. This routine modifies the global variable I<svc_fds>. Service implementors usually do not need this routine.
ru: Перед уничтожением описателя протокола службы RPC он должен самостоятельно отменить регистрацию в пакете службы RPC. Эта функция изменяет глобальную переменную I<svc_fds>. Обычно, для реализации служб эта функция не требуется.

source: The following manuals:
ru: Руководства:

source: remove - remove a file or directory
ru: remove - удаляет файл или каталог

source: B<remove>() deletes a name from the filesystem. It calls B<unlink>(2) for files, and B<rmdir>(2) for directories.
ru: Функция B<remove>() удаляет имя из файловой системы. Она вызывает B<unlink>(2) для файлов и B<rmdir>(2) для каталогов.

source: If the removed name was the last link to a file and no processes have the file open, the file is deleted and the space it was using is made available for reuse.
ru: Если удалённое имя было последней ссылкой на файл и больше нет процессов, которые держат этот файл открытым, то данный файл удаляется и место, которое он занимает, освобождается для дальнейшего использования.

source: If the name was the last link to a file, but any processes still have the file open, the file will remain in existence until the last file descriptor referring to it is closed.
ru: Если имя было последней ссылкой на файл, но какие-либо процессы всё ещё держат этот файл открытым, файл будет существовать, пока последний файловый дескриптор, указывающий на него, не будет закрыт.

source: If the name referred to a symbolic link, the link is removed.
ru: Если имя указывает на символьную ссылку, то будет удалена ссылка.

source: If the name referred to a socket, FIFO, or device, the name is removed, but processes which have the object open may continue to use it.
ru: Если имя указывает на сокет, FIFO или устройство, то имя будет удалено, но процессы, которые открыли объект, могут продолжать его использовать.

source: The errors that occur are those for B<unlink>(2) and B<rmdir>(2).
ru: Ошибки, которые возникают у B<unlink>(2) и B<rmdir>(2).

source: Infelicities in the protocol underlying NFS can cause the unexpected disappearance of files which are still being used.
ru: Неточности в протоколе NFS могут приводить к неожиданному исчезновению файлов, которые всё ещё используются.

source: readdir - read a directory
ru: readdir - чтение содержимого каталога

source: The B<readdir>() function returns a pointer to a I<dirent> structure representing the next directory entry in the directory stream pointed to by I<dirp>. It returns NULL on reaching the end of the directory stream or if an error occurred.
ru: Функция B<readdir>() возвращает указатель на структуру I<dirent>, представляющую следующую запись каталога в потоке каталога, указанного в I<dirp>. Функция возвращает NULL по достижении последней записи в потоке каталога или если произошла ошибка.

source: In the glibc implementation, the I<dirent> structure is defined as follows:
ru: В реализации glibc структура I<dirent> определена следующим образом:

source: struct dirent { ino_t d_ino; /* Inode number */ off_t d_off; /* Not an offset; see below */ unsigned short d_reclen; /* Length of this record */ unsigned char d_type; /* Type of file; not supported by all filesystem types */ char d_name[256]; /* Null-terminated filename */ };
ru: struct dirent { ino_t d_ino; /* номер иноды */ off_t d_off; /* не смещение, смотрите ниже */ unsigned short d_reclen; /* длина этой записи */ unsigned char d_type; /* тип файла; поддерживается не во всех файловых системах */ char d_name[256]; /* имя файла с null в конце */ };

source: The only fields in the I<dirent> structure that are mandated by POSIX.1 are I<d_name> and I<d_ino>. The other fields are unstandardized, and not present on all systems; see NOTES below for some further details.
ru: В соответствие с POSIX.1, структура I<dirent> обязательно должна содержать поле I<d_name>[] и I<d_ino>. Другие поля не стандартизованы и имеются не во всех системах; подробней смотрите ЗАМЕЧАНИЯ далее.

source: The fields of the I<dirent> structure are as follows:
ru: Поля структуры I<dirent>:

source: This is the inode number of the file.
ru: Номер иноды файла.
