Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The I</dev/rtc> (or I</dev/rtc0>, I</dev/rtc1>, etc.) device can be opened only once (until it is closed) and it is read-only. On B<read>(2) and B<select>(2) the calling process is blocked until the next interrupt from that RTC is received. Following the interrupt, the process can read a long integer, of which the least significant byte contains a bit mask encoding the types of interrupt that occurred, while the remaining 3 bytes contain the number of interrupts since the last B<read>(2).
ru: Устройство I</dev/rtc> (или I</dev/rtc0>, I</dev/rtc1> и т.д.) можно открыть только один раз (до тех пор, пока не будет закрыто) и только для чтения. При вызове B<read>(2) и B<select>(2) вызывающий процесс блокируется до следующего приёма прерывания от RTC. После прерывания процесс может прочитать длинное целое, в котором наименее значимый байт содержит битовую маску типа произошедшего прерывания, а остальные 3 байта содержат количество прерываний, произошедших с последнего вызова B<read>(2).

source: The following B<ioctl>(2) requests are defined on file descriptors connected to RTC devices:
ru: Для файловых дескрипторов, указывающих на открытые устройства RTC, доступны следующие запросы B<ioctl>(2):

source: Returns this RTC's time in the following structure:
ru: Получить время RTC в виде следующей структуры:

source: struct rtc_time { int tm_sec; int tm_min; int tm_hour; int tm_mday; int tm_mon; int tm_year; int tm_wday; /* unused */ int tm_yday; /* unused */ int tm_isdst; /* unused */ };
ru: struct rtc_time { int tm_sec; int tm_min; int tm_hour; int tm_mday; int tm_mon; int tm_year; int tm_wday; /* не используется */ int tm_yday; /* не используется */ int tm_isdst; /* не используется */ };

source: The fields in this structure have the same meaning and ranges as for the I<tm> structure described in B<gmtime>(3). A pointer to this structure should be passed as the third B<ioctl>(2) argument.
ru: Поля структуры имеют те же значения и диапазоны что и у структуры I<tm>, описанной в B<gmtime>(3). Указатель на эту структуру должен передаваться в третьем аргументе B<ioctl>(2).

source: Sets this RTC's time to the time specified by the I<rtc_time> structure pointed to by the third B<ioctl>(2) argument. To set the RTC's time the process must be privileged (i.e., have the B<CAP_SYS_TIME> capability).
ru: Установить время RTC в значение, заданное в структуре I<rtc_time>, на которую указывает третий аргумент B<ioctl>(2). Для установки времени RTC процесс должен иметь права (т.е., мандат B<CAP_SYS_TIME>).

source: Read and set the alarm time, for RTCs that support alarms. The alarm interrupt must be separately enabled or disabled using the B<RTC_AIE_ON>, B<RTC_AIE_OFF> requests. The third B<ioctl>(2) argument is a pointer to an I<rtc_time> structure. Only the I<tm_sec>, I<tm_min>, and I<tm_hour> fields of this structure are used.
ru: Получить и установить время будильника, если он поддерживается RTC. Прерывание будильника должно быть включено или выключено отдельно с помощью запросов B<RTC_AIE_ON>, B<RTC_AIE_OFF>. Третий аргумент B<ioctl>(2) является указателем на структуру I<rtc_time>. В структуре используются только поля I<tm_sec>, I<tm_min> и I<tm_hour>.

source: Read and set the frequency for periodic interrupts, for RTCs that support periodic interrupts. The periodic interrupt must be separately enabled or disabled using the B<RTC_PIE_ON>, B<RTC_PIE_OFF> requests. The third B<ioctl>(2) argument is an I<unsigned long\ *> or an I<unsigned long>, respectively. The value is the frequency in interrupts per second. The set of allowable frequencies is the multiples of two in the range 2 to 8192. Only a privileged process (i.e., one having the B<CAP_SYS_RESOURCE> capability) can set frequencies above the value specified in I</proc/sys/dev/rtc/max-user-freq>. (This file contains the value 64 by default.)
ru: Получить и установить частоту периодических прерываний, если они поддерживаются RTC. Периодическое прерывание должно быть включено или выключено отдельно с помощью запросов B<RTC_PIE_ON>, B<RTC_PIE_OFF>. Третий аргумент B<ioctl>(2) имеет тип I<unsigned long\ *> или I<unsigned long>, соответственно. Значение задаёт частоту прерываний в секунду. Можно указывать частоты кратны степени 2 в диапазоне от 2 до 8192. Только привилегированный процесс (т.е., имеющий мандат B<CAP_SYS_RESOURCE>) может устанавливать частоты выше значения, указанного в I</proc/sys/dev/rtc/max-user-freq>. (По умолчанию в этом файле содержится значение 64.)

source: Enable or disable the alarm interrupt, for RTCs that support alarms. The third B<ioctl>(2) argument is ignored.
ru: Включить или выключить прерывание от будильника, если RTC поддерживает будильники. Третий аргумент B<ioctl>(2) игнорируется.

source: Enable or disable the interrupt on every clock update, for RTCs that support this once-per-second interrupt. The third B<ioctl>(2) argument is ignored.
ru: Включить или выключить прерывание при каждом обновлении часов, если RTC поддерживает создание прерываний один раз в секунду. Третий аргумент B<ioctl>(2) игнорируется.

source: Enable or disable the periodic interrupt, for RTCs that support these periodic interrupts. The third B<ioctl>(2) argument is ignored. Only a privileged process (i.e., one having the B<CAP_SYS_RESOURCE> capability) can enable the periodic interrupt if the frequency is currently set above the value specified in I</proc/sys/dev/rtc/max-user-freq>.
ru: Включить или выключить периодическое прерывание, если RTC поддерживает периодические прерывания. Третий аргумент B<ioctl>(2) игнорируется. Только привилегированный процесс (т.е., имеющий мандат B<CAP_SYS_RESOURCE>) может устанавливать частоты выше значения, указанного в I</proc/sys/dev/rtc/max-user-freq>.

source: Many RTCs encode the year in an 8-bit register which is either interpreted as an 8-bit binary number or as a BCD number. In both cases, the number is interpreted relative to this RTC's Epoch. The RTC's Epoch is initialized to 1900 on most systems but on Alpha and MIPS it might also be initialized to 1952, 1980, or 2000, depending on the value of an RTC register for the year. With some RTCs, these operations can be used to read or to set the RTC's Epoch, respectively. The third B<ioctl>(2) argument is an I<unsigned long\ *> or an I<unsigned long>, respectively, and the value returned (or assigned) is the Epoch. To set the RTC's Epoch the process must be privileged (i.e., have the B<CAP_SYS_TIME> capability).
ru: В многих RTC год кодируется в 8-битном регистре, значение которого может учитываться как 8-битное двоичное число или как число в двоично-десятичном коде (BCD). В обоих случаях, число учитывается относительно начала эпохи RTC. Эпоха RTC на большинстве систем начинается с 1900 года, но на Alpha и MIPS также она может начинаться с 1952, 1980 или 2000 года, в зависимости от значения годового регистра RTC. С некоторыми RTC эти операции можно использовать для чтения или установки эпохи RTC, соответственно. Третий аргумент B<ioctl>(2) имеет тип I<unsigned long\ *> или I<unsigned long>, соответственно, а возвращаемое значение (или назначаемое) является эпохой. Чтобы установить эпоху RTC процесс должен быть привилегированным (т.е., иметь мандат B<CAP_SYS_TIME>).

source: Some RTCs support a more powerful alarm interface, using these ioctls to read or write the RTC's alarm time (respectively) with this structure:
ru: Некоторые RTC поддерживают более универсальный интерфейс будильника, в котором эти ioctl используются для чтения и записи времени будильника RTC (соответственно) с помощью структуры:

source: The I<enabled> flag is used to enable or disable the alarm interrupt, or to read its current status; when using these calls, B<RTC_AIE_ON> and B<RTC_AIE_OFF> are not used. The I<pending> flag is used by B<RTC_WKALM_RD> to report a pending interrupt (so it's mostly useless on Linux, except when talking to the RTC managed by EFI firmware). The I<time> field is as used with B<RTC_ALM_READ> and B<RTC_ALM_SET> except that the I<tm_mday>, I<tm_mon>, and I<tm_year> fields are also valid. A pointer to this structure should be passed as the third B<ioctl>(2) argument.
ru: Флаг I<enabled> используется для включения или отключения прерывания будильника, или для чтения его текущего состояния; когда совершаются данные вызовы B<RTC_AIE_ON> и B<RTC_AIE_OFF> не используются. Флаг I<pending> используется B<RTC_WKALM_RD> для сообщения об ожидающем прерывании (хотя это практически бесполезно в Linux, за исключением RTC, управляемого микропрограммой EFI). Поле I<time> используется B<RTC_ALM_READ> и B<RTC_ALM_SET>, но поля I<tm_mday>, I<tm_mon> и I<tm_year> также учитываются. Указатель на эту структуру должен передаваться в третьем аргументе B<ioctl>(2).

source: I</dev/rtc>, I</dev/rtc0>, I</dev/rtc1>, etc.
ru: I</dev/rtc>, I</dev/rtc0>, I</dev/rtc1>, и тд.

source: RTC special character device files.
ru: Файлы специального символьного устройства RTC.

source: status of the (first) RTC.
ru: состояние (первого) RTC.

source: When the kernel's system time is synchronized with an external reference using B<adjtimex>(2) it will update a designated RTC periodically every 11 minutes. To do so, the kernel has to briefly turn off periodic interrupts; this might affect programs using that RTC.
ru: Когда системное время ядра синхронизируется с внешним источником с помощью B<adjtimex>(2), оно будет обновляться назначенным RTC с периодичностью каждые 11 минут. Для этого ядро на время отключает периодические прерывания; это может повлиять на программы, использующие RTC.

source: An RTC's Epoch has nothing to do with the POSIX Epoch which is used only for the system clock.
ru: Эпоха RTC не имеет ничего общего с эпохой POSIX, которая используется только в системных часах.

source: If the year according to the RTC's Epoch and the year register is less than 1970 it is assumed to be 100 years later, that is, between 2000 and 2069.
ru: Если год, согласно эпохи RTC и регистр года меньше чем 1970, то предполагается, что время на 100 лет позже, то есть, между 2000 и 2069 годами.

source: Some RTCs support "wildcard" values in alarm fields, to support scenarios like periodic alarms at fifteen minutes after every hour, or on the first day of each month. Such usage is nonportable; portable user-space code expects only a single alarm interrupt, and will either disable or reinitialize the alarm after receiving it.
ru: Некоторые RTC поддерживают значения «шаблона» в полях будильника, чтобы обеспечить поддержку сценариев, например периодические будильники, через первые 15 минут в начале каждого часа, или первый день каждого месяца. Но это непереносимо; переносимый код пользовательского пространства только ожидает единичное прерывание от будильника, и будет или отключать, или реинициализировать будильник после приёма.

source: Some RTCs support periodic interrupts with periods that are multiples of a second rather than fractions of a second; multiple alarms; programmable output clock signals; nonvolatile memory; and other hardware capabilities that are not currently exposed by this API.
ru: Некоторые RTC поддерживают периодические прерывания с периодами кратными степени 2, а не дробной секунде; несколько будильников; программируемые выходные сигналы часов; энергонезависимую память; другие аппаратные свойства, для которых пока ещё не предусмотрено программного интерфейса.

source: I<Documentation/rtc.txt> in the Linux kernel source tree
ru: Файл I<Documentation/rtc.txt> в дереве исходного кода ядра Linux

source: ram - ram disk device
ru: ram - устройство для диска в памяти

source: The I<ram> device is a block device to access the ram disk in raw mode.
ru: Устройство I<ram> представляет собой блочное устройство, предоставляющее прямой доступ к диску в памяти (ram disk).

source: It is typically created by:
ru: Обычно, этот файл создается так:

source: rtnetlink - Linux IPv4 routing socket
ru: rtnetlink - сокет маршрутизации IPv4 в Linux

source: Rtnetlink allows the kernel's routing tables to be read and altered. It is used within the kernel to communicate between various subsystems, though this usage is not documented here, and for communication with user-space programs. Network routes, IP addresses, link parameters, neighbor setups, queueing disciplines, traffic classes and packet classifiers may all be controlled through B<NETLINK_ROUTE> sockets. It is based on netlink messages; see B<netlink>(7) for more information.
ru: Rtnetlink позволяет читать и изменять таблицы маршрутизации ядра. Он используется для взаимодействия различных подсистем внутри ядра (это здесь не описано), а также для взаимодействия пользовательских программ. Сетевыми маршрутами, IP-адресами, параметрами связи (link parameters), настройками соседства (neighbor setups), алгоритмами планирования очереди (queueing disciplines), классификацией трафика и и пакетными классификаторами можно управлять через сокеты B<NETLINK_ROUTE>. Они основываются на сообщениях netlink; подробности смотрите в B<netlink>(7).

source: Routing attributes
ru: Атрибуты маршрутизации

source: Some rtnetlink messages have optional attributes after the initial header:
ru: Некоторые сообщения rtnetlink содержат необязательные атрибуты после начального заголовка:

source: struct rtattr { unsigned short rta_len; /* Length of option */ unsigned short rta_type; /* Type of option */ /* Data follows */ };
ru: struct rtattr { unsigned short rta_len; /* длина параметра */ unsigned short rta_type; /* тип параметра */ /* данные … */ };

source: These attributes should be manipulated using only the RTA_* macros or libnetlink, see B<rtnetlink>(3).
ru: Этими атрибутами нужно управлять только с помощью макросов RTA_* или libnetlink, смотрите B<rtnetlink>(3).

source: Messages
ru: Сообщения

source: Rtnetlink consists of these message types (in addition to standard netlink messages):
ru: Rtnetlink поддерживает следующие типы сообщений (в дополнении к стандартным сообщениям netlink):

source: Create, remove or get information about a specific network interface. These messages contain an I<ifinfomsg> structure followed by a series of I<rtattr> structures.
ru: Создание, удаление и получение информации об определённом сетевом интерфейсе. Эти сообщения содержат структуру I<ifinfomsg>, за которой следует ряд структур I<rtattr>.

source: struct ifinfomsg { unsigned char ifi_family; /* AF_UNSPEC */ unsigned short ifi_type; /* Device type */ int ifi_index; /* Interface index */ unsigned int ifi_flags; /* Device flags */ unsigned int ifi_change; /* change mask */ };
ru: struct ifinfomsg { unsigned char ifi_family; /* AF_UNSPEC */ unsigned short ifi_type; /* тип устройства */ int ifi_index; /* индекс интерфейса */ unsigned int ifi_flags; /* флаги устройства */ unsigned int ifi_change; /* маска изменения */ };

source: I<ifi_flags> contains the device flags, see B<netdevice>(7); I<ifi_index> is the unique interface index (since Linux 3.7, it is possible to feed a nonzero value with the B<RTM_NEWLINK> message, thus creating a link with the given I<ifindex>); I<ifi_change> is reserved for future use and should be always set to 0xFFFFFFFF.
ru: В I<ifi_flags> содержатся флаги устройства, смотрите B<netdevice>(7); в I<ifi_index> — уникальный индекс интерфейса (начиная с Linux 3.7 возможно передать ненулевое значение в сообщении B<RTM_NEWLINK>; в этом случае создаётся связь (link) с заданным I<ifindex>); элемент I<ifi_change> зарезервирован на будущее и его значение всегда должно быть равно 0xFFFFFFFF.

source: value type
ru: тип значения

source: description
ru: описание

source: unspecified.
ru: не определено

source: hardware address
ru: аппаратный адрес

source: interface L2 address
ru: адрес интерфейса L2

source: L2 broadcast address.
ru: широковещательный адрес L2

source: asciiz string
ru: строка asciiz

source: Device name.
ru: имя устройства

source: MTU of the device.
ru: MTU устройства

source: Link type.
ru: тип связи

source: Queueing discipline.
ru: алгоритм очереди

source: see below
ru: смотрите ниже

source: Interface Statistics.
ru: статистика интерфейса

source: The value type for B<IFLA_STATS> is I<struct rtnl_link_stats> (I<struct net_device_stats> in Linux 2.4 and earlier).
ru: Тип значения для B<IFLA_STATS> — I<struct rtnl_link_stats> (в Linux 2.4 и старее — I<struct net_device_stats>).

source: Add, remove or receive information about an IP address associated with an interface. In Linux 2.2, an interface can carry multiple IP addresses, this replaces the alias device concept in 2.0. In Linux 2.2, these messages support IPv4 and IPv6 addresses. They contain an I<ifaddrmsg> structure, optionally followed by I<rtattr> routing attributes.
ru: Добавление, удаление или получение информации об IP-адресе, назначенном интерфейсу. В Linux 2.2 интерфейс может иметь несколько IP-адресов; эта концепция пришла на смену псевдонимам устройства, использовавшимся в версии 2.0. В Linux 2.2 эти сообщения поддерживают адреса IPv4 и IPv6. В них содержится структура I<ifaddrmsg>, которая может быть указана после атрибутов маршрутизации I<rtattr>.

source: struct ifaddrmsg { unsigned char ifa_family; /* Address type */ unsigned char ifa_prefixlen; /* Prefixlength of address */ unsigned char ifa_flags; /* Address flags */ unsigned char ifa_scope; /* Address scope */ int ifa_index; /* Interface index */ };
ru: struct ifaddrmsg { unsigned char ifa_family; /* тип адреса */ unsigned char ifa_prefixlen; /* длина префикса адреса */ unsigned char ifa_flags; /* флаги адреса */ unsigned char ifa_scope; /* область адреса */ int ifa_index; /* индекс интерфейса */ };

source: I<ifa_family> is the address family type (currently B<AF_INET> or B<AF_INET6>), I<ifa_prefixlen> is the length of the address mask of the address if defined for the family (like for IPv4), I<ifa_scope> is the address scope, I<ifa_index> is the interface index of the interface the address is associated with. I<ifa_flags> is a flag word of B<IFA_F_SECONDARY> for secondary address (old alias interface), B<IFA_F_PERMANENT> for a permanent address set by the user and other undocumented flags.
ru: Поле I<ifa_family> представляет тип адресного семейства (B<AF_INET> или B<AF_INET6>), I<ifa_prefixlen> — длину адресной маски адреса, если это применимо для семейства (в IPv4), I<ifa_scope> — область адреса, I<ifa_index> — индекс интерфейса, которому назначен адрес. Поле I<ifa_flags> — слово флагов: B<IFA_F_SECONDARY> — вторичный адрес (старый псевдоним интерфейса), B<IFA_F_PERMANENT> — постоянный адрес, назначенный пользователем и другие недокументированные флаги.

source: Attributes
ru: Атрибуты

source: raw protocol address
ru: адрес неструктурированного протокола

source: interface address
ru: адрес интерфейса

source: local address
ru: локальный адрес

source: name of the interface
ru: название интерфейса

source: broadcast address.
ru: широковещательный адрес

source: anycast address
ru: адрес anycast

source: Address information.
ru: информация об адресе

source: Create, remove or receive information about a network route. These messages contain an I<rtmsg> structure with an optional sequence of I<rtattr> structures following. For B<RTM_GETROUTE>, setting I<rtm_dst_len> and I<rtm_src_len> to 0 means you get all entries for the specified routing table. For the other fields, except I<rtm_table> and I<rtm_protocol>, 0 is the wildcard.
ru: Создание, удаление или получение информации о сетевом маршруте. Эти сообщения содержат структуру I<rtmsg> с необязательными дополнительными структурами I<rtattr>. Для B<RTM_GETROUTE>, если I<rtm_dst_len> и I<rtm_src_len> задать значение 0, то вы получите все записи определённой таблицы маршрутизации. В других полях, кроме I<rtm_table> и I<rtm_protocol>, 0 считается шаблоном (wildcard).

source: struct rtmsg { unsigned char rtm_family; /* Address family of route */ unsigned char rtm_dst_len; /* Length of destination */ unsigned char rtm_src_len; /* Length of source */ unsigned char rtm_tos; /* TOS filter */
ru: struct rtmsg { unsigned char rtm_family; /* адресное семейство маршрута */ unsigned char rtm_dst_len; /* длина назначения */ unsigned char rtm_src_len; /* длина источника */ unsigned char rtm_tos; /* фильтр TOS */

source: unsigned char rtm_table; /* Routing table ID */ unsigned char rtm_protocol; /* Routing protocol; see below */ unsigned char rtm_scope; /* See below */ unsigned char rtm_type; /* See below */
ru: unsigned char rtm_table; /* ID таблицы маршрутизации */ unsigned char rtm_protocol; /* протокол марш-ции; см. ниже */ unsigned char rtm_scope; /* см. ниже */ unsigned char rtm_type; /* см. ниже */

source: Route type
ru: Тип маршрута

source: unknown route
ru: неизвестный маршрут

source: a gateway or direct route
ru: шлюз или прямой маршрут

source: a local interface route
ru: маршрут локального интерфейса

source: a local broadcast route (sent as a broadcast)
ru: локальный широковещательный маршрут (широковещательная отправка)

source: a local broadcast route (sent as a unicast)
ru: локальный широковещательный маршрут (однонаправленная отправка)

source: a multicast route
ru: многоадресный маршрут

source: a packet dropping route
ru: маршрут для отброса пакетов

source: an unreachable destination
ru: недостижимый пункт назначения

source: a packet rejection route
ru: маршрут для отклонения пакетов

source: continue routing lookup in another table
ru: продолжение поиска маршрута в другой таблице

source: a network address translation rule
ru: правило трансляции сетевого адреса

source: refer to an external resolver (not implemented)
ru: ссылка на внешний определитель (не реализовано)

source: Route origin.
ru: Происхождение маршрута

source: unknown
ru: неизвестно

source: by an ICMP redirect (currently unused)
ru: из-за перенаправления полученном по ICMP (не используется)

source: by the kernel
ru: посылается ядром

source: during boot
ru: при загрузке машины

source: by the administrator
ru: указан администратором

source: Values larger than B<RTPROT_STATIC> are not interpreted by the kernel, they are just for user information. They may be used to tag the source of a routing information or to distinguish between multiple routing daemons. See I<E<lt>linux/rtnetlink.hE<gt>> for the routing daemon identifiers which are already assigned.
ru: Значения больше B<RTPROT_STATIC> не учитываются ядром, они предназначены только для пользовательской информации. Они могут использоваться для пометки источника информации о маршрутизации или для отличения различных служб маршрутизации друг от друга. Уже назначенные идентификаторы для служб маршрутизации можно найти в I<E<lt>linux/rtnetlink.hE<gt>>.

source: I<rtm_scope> is the distance to the destination:
ru: I<rtm_scope> — расстояние до назначения:

source: global route
ru: глобальный маршрут

source: interior route in the local autonomous system
ru: внутренний маршрут в локальной автономной системе

source: route on this link
ru: маршрут на эту связь

source: route on the local host
ru: маршрут на локальный узел

source: destination doesn't exist
ru: назначение не существует

source: The values between B<RT_SCOPE_UNIVERSE> and B<RT_SCOPE_SITE> are available to the user.
ru: Значения от B<RT_SCOPE_UNIVERSE> и до B<RT_SCOPE_SITE> доступны пользователю.

source: The I<rtm_flags> have the following meanings:
ru: Поле I<rtm_flags> может иметь следующие значения:

source: if the route changes, notify the user via rtnetlink
ru: если маршрут изменился — уведомить пользователя через rtnetlink

source: route is cloned from another route
ru: маршрут склонирован из другого маршрута

source: a multipath equalizer (not yet implemented)
ru: многопутевой уравниватель (не реализовано)

source: I<rtm_table> specifies the routing table
ru: В I<rtm_table> задаётся таблица маршрутизации:

source: an unspecified routing table
ru: таблица маршрутизации не задана
