Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: A protocol of B<IPPROTO_RAW> implies enabled B<IP_HDRINCL> and is able to send any IP protocol that is specified in the passed header. Receiving of all IP protocols via B<IPPROTO_RAW> is not possible using raw sockets.
ru: Протокол B<IPPROTO_RAW> подразумевает включённый параметр B<IP_HDRINCL> и позволяет отправлять любой протокол IP, который указан в передаваемом заголовке. Приём любых протоколов IP посредством B<IPPROTO_RAW> через неструктурированные сокеты невозможен.

source: IP Header fields modified on sending by B<IP_HDRINCL>
ru: Поля заголовка IP, изменяемые B<IP_HDRINCL> при передаче

source: IP Checksum
ru: контрольная сумма IP

source: Always filled in
ru: всегда заполняется

source: Source Address
ru: адрес источника

source: Filled in when zero
ru: заполняется, если значение равно нулю

source: Packet ID
ru: ID пакета

source: Total Length
ru: общая длина

source: If B<IP_HDRINCL> is specified and the IP header has a nonzero destination address, then the destination address of the socket is used to route the packet. When B<MSG_DONTROUTE> is specified, the destination address should refer to a local interface, otherwise a routing table lookup is done anyway but gatewayed routes are ignored.
ru: Если указан B<IP_HDRINCL> и заголовок IP имеет ненулевой адрес назначения, то для маршрутизации пакета используется адрес назначения сокета. Если указан B<MSG_DONTROUTE>, то адрес назначения должен ссылаться на локальный интерфейс, иначе в любом случае будет производиться поиск в таблице маршрутизации, но маршруты со шлюзами будут игнорироваться.

source: If B<IP_HDRINCL> isn't set, then IP header options can be set on raw sockets with B<setsockopt>(2); see B<ip>(7) for more information.
ru: Если B<IP_HDRINCL> не указан, то параметры заголовка IP в неструктурированных сокетах могут быть установлены с помощью B<setsockopt>(2); более подробная информация приведена в B<ip>(7).

source: Starting with Linux 2.2, all IP header fields and options can be set using IP socket options. This means raw sockets are usually needed only for new protocols or protocols with no user interface (like ICMP).
ru: Начиная с Linux 2.2 все поля заголовка IP и параметры могут быть заданы с помощью параметров сокета IP. Это означает, что неструктурированные сокеты, как правило, необходимы лишь для новых протоколов или протоколов без интерфейса пользователя (например, ICMP).

source: When a packet is received, it is passed to any raw sockets which have been bound to its protocol before it is passed to other protocol handlers (e.g., kernel protocol modules).
ru: Принятый пакет передаётся всем подключенным (bound) к этому протоколу неструктурированным сокетам до того, как он будет передан другим обработчикам протоколов (например, протокольным модулям ядра).

source: Address format
ru: Формат адреса

source: For sending and receiving datagrams (B<sendto>(2), B<recvfrom>(2), and similar), raw sockets use the standard I<sockaddr_in> address structure defined in B<ip>(7). The I<sin_port> field could be used to specify the IP protocol number, but it is ignored for sending in Linux 2.2 and later, and should be always set to 0 (see BUGS). For incoming packets, I<sin_port> is set to zero.
ru: При отправке и приёме дейтаграмм (B<sendto>(2), B<recvfrom>(2) и similar) через неструктурированные сокеты используется стандартная адресная структура I<sockaddr_in>, определённая в B<ip>(7). Поле I<sin_port> можно использовать для указания номера протокола IP, но в Linux 2.2 и новее оно игнорируется при отправке, и должно всегда равняться 0 (смотрите ДЕФЕКТЫ). У входящих пакетов I<sin_port> равен нулю.

source: Socket options
ru: Параметры сокета

source: Raw socket options can be set with B<setsockopt>(2) and read with B<getsockopt>(2) by passing the B<IPPROTO_RAW> family flag.
ru: Параметры неструктурированных сокетов могут быть установлены с помощью B<setsockopt>(2) и прочитаны с помощью B<getsockopt>(2) с указанием флага семейства B<IPPROTO_RAW>.

source: Enable a special filter for raw sockets bound to the B<IPPROTO_ICMP> protocol. The value has a bit set for each ICMP message type which should be filtered out. The default is to filter no ICMP messages.
ru: Запускает специальный фильтр для неструктурированных сокетов, подключенных к протоколу B<IPPROTO_ICMP>. Значение представляет собой набор бит — по установленному биту для каждого типа сообщений ICMP, который должен быть отфильтрован. По умолчанию сообщения ICMP не фильтруются.

source: In addition, all B<ip>(7) B<IPPROTO_IP> socket options valid for datagram sockets are supported.
ru: Кроме этого, поддерживаются все датаграммные параметры сокетов B<ip>(7) для B<IPPROTO_IP>.

source: Error handling
ru: Обработка ошибок

source: Errors originating from the network are passed to the user only when the socket is connected or the B<IP_RECVERR> flag is enabled. For connected sockets, only B<EMSGSIZE> and B<EPROTO> are passed for compatibility. With B<IP_RECVERR>, all network errors are saved in the error queue.
ru: Ошибки, возникающие в сети, передаются пользователю только, если сокет подключён или установлен флаг B<IP_RECVERR>. В целях совместимости в подключенные сокеты передаются только B<EMSGSIZE> и B<EPROTO>. При указании B<IP_RECVERR> в очереди ошибок сохраняются все сетевые ошибки.

source: ERRORS
ru: ОШИБКИ

source: User tried to send to a broadcast address without having the broadcast flag set on the socket.
ru: Пользователь попытался передать пакет по широковещательному адресу без указания на сокете флага широковещательной передачи.

source: An invalid memory address was supplied.
ru: Указан неправильный адрес памяти.

source: Invalid argument.
ru: Неверный аргумент.

source: Packet too big. Either Path MTU Discovery is enabled (the B<IP_MTU_DISCOVER> socket flag) or the packet size exceeds the maximum allowed IPv4 packet size of 64\ kB.
ru: Размер пакета слишком велик, либо включён Path MTU Discovery (флаг сокета B<IP_PMTU_DISCOVER>), либо размер пакета превышает максимально разрешенный для IPv4 размер, равный 64\ КБ.

source: Invalid flag has been passed to a socket call (like B<MSG_OOB>).
ru: Сокетному вызову был передан неверный флаг (например, B<MSG_OOB>).

source: The user doesn't have permission to open raw sockets. Only processes with an effective user ID of 0 or the B<CAP_NET_RAW> attribute may do that.
ru: Пользователь не имеет прав на открытие неструктурированных сокетов. Это могут делать только процессы с идентификатором эффективного пользователя равным 0, или имеющие мандат B<CAP_NET_RAW>.

source: An ICMP error has arrived reporting a parameter problem.
ru: Получена ошибка ICMP, сообщающая о проблеме с параметром.

source: B<IP_RECVERR> and B<ICMP_FILTER> are new in Linux 2.2. They are Linux extensions and should not be used in portable programs.
ru: Значения B<IP_RECVERR> и B<ICMP_FILTER> появились в Linux 2.2. Они являются расширениями Linux и не должны использоваться в переносимых программах.

source: Linux 2.0 enabled some bug-to-bug compatibility with BSD in the raw socket code when the B<SO_BSDCOMPAT> socket option was set; since Linux 2.2, this option no longer has that effect.
ru: Код неструктурированных сокетов в версии Linux 2.0 при установленном параметре B<SO_BSDCOMPAT> был специально сделан совместимым с BSD «вплоть до ошибок». Из Linux 2.2 это было удалено.

source: By default, raw sockets do path MTU (Maximum Transmission Unit) discovery. This means the kernel will keep track of the MTU to a specific target IP address and return B<EMSGSIZE> when a raw packet write exceeds it. When this happens, the application should decrease the packet size. Path MTU discovery can be also turned off using the B<IP_MTU_DISCOVER> socket option or the I</proc/sys/net/ipv4/ip_no_pmtu_disc> file, see B<ip>(7) for details. When turned off, raw sockets will fragment outgoing packets that exceed the interface MTU. However, disabling it is not recommended for performance and reliability reasons.
ru: По умолчанию, для неструктурированных сокетов выполняется обнаружение MTU (Maximum Transmission Unit) пути. Это означает, что ядро будет следить за MTU до IP-адреса назначения и возвращать B<EMSGSIZE>, если запись неструктурированного пакета превысит это значение. Когда это происходит, приложение должно уменьшить размер пакета. Также обнаружение MTU пути можно выключить с помощью параметра сокета B<IP_MTU_DISCOVER> или в файле I</proc/sys/net/ipv4/ip_no_pmtu_disc>; подробней смотрите в B<ip>(7). При отключении обнаружения неструктурированные сокеты фрагментируют исходящие пакеты, размер которых превышает MTU интерфейса. Однако по соображениям производительности и надёжности отключение не рекомендуется.

source: A raw socket can be bound to a specific local address using the B<bind>(2) call. If it isn't bound, all packets with the specified IP protocol are received. In addition, a raw socket can be bound to a specific network device using B<SO_BINDTODEVICE>; see B<socket>(7).
ru: Неструктурированный сокет может быть подключён к определённому локальному адресу с помощью вызова B<bind>(2). Если он не подключён, то принимаются все пакеты указанного протокола IP. Кроме того, неструктурированный сокет может быть подключён к определённому сетевому устройству с помощью B<SO_BINDTODEVICE>; смотрите B<socket>(7).

source: An B<IPPROTO_RAW> socket is send only. If you really want to receive all IP packets, use a B<packet>(7) socket with the B<ETH_P_IP> protocol. Note that packet sockets don't reassemble IP fragments, unlike raw sockets.
ru: Сокет B<IPPROTO_RAW> предназначен только для отправки. Если вы хотите получать все пакеты IP, используйте сокет B<packet>(7) с протоколом B<ETH_P_IP>. Заметим, что пакетные сокеты, в отличие от неструктурированных сокетов, не собирают пакеты из фрагментов IP.

source: If you want to receive all ICMP packets for a datagram socket, it is often better to use B<IP_RECVERR> on that particular socket; see B<ip>(7).
ru: Если вы хотите получать все пакеты ICMP для датаграммного сокета, то лучше использовать B<IP_RECVERR> на определённом сокете; смотрите B<ip>(7).

source: Raw sockets may tap all IP protocols in Linux, even protocols like ICMP or TCP which have a protocol module in the kernel. In this case, the packets are passed to both the kernel module and the raw socket(s). This should not be relied upon in portable programs, many other BSD socket implementation have limitations here.
ru: Неструктурированные сокеты могут перехватывать в Linux все протоколы IP, даже имеющие протокольный модуль в ядре (такие, как ICMP или TCP). В этом случае пакеты передаются как модулю ядра, так и неструктурированным сокетам. На это нельзя закладываться в переносимых программах, так как многие другие реализации сокетов BSD так не делают.

source: Linux never changes headers passed from the user (except for filling in some zeroed fields as described for B<IP_HDRINCL>). This differs from many other implementations of raw sockets.
ru: Linux никогда не изменяет заголовки, полученные от пользователя (за исключением обнуления некоторых полей, как описано в случае с B<IP_HDRINCL>). Такое поведение отличается от поведения многих других реализаций неструктурированных сокетов.

source: Raw sockets are generally rather unportable and should be avoided in programs intended to be portable.
ru: Неструктурированные сокеты, в общем случае, не являются переносимыми, поэтому следует избегать их использования в переносимых программах.

source: Sending on raw sockets should take the IP protocol from I<sin_port>; this ability was lost in Linux 2.2. The workaround is to use B<IP_HDRINCL>.
ru: Передача через неструктурированный сокет должна осуществляться с помощью протокола IP из I<sin_port>; эта возможность исчезла в Linux 2.2. Метод обхода — использовать B<IP_HDRINCL>.

source: Transparent proxy extensions are not described.
ru: Не описаны расширения прозрачного прокси.

source: When the B<IP_HDRINCL> option is set, datagrams will not be fragmented and are limited to the interface MTU.
ru: Если установлен параметр B<IP_HDRINCL>, датаграммы не будут фрагментированы и их размер будет ограничен MTU интерфейса.

source: Setting the IP protocol for sending in I<sin_port> got lost in Linux 2.2. The protocol that the socket was bound to or that was specified in the initial B<socket>(2) call is always used.
ru: В Linux 2.2 отсутствует настройка протокола IP для отправки I<sin_port> — всегда используется тот протокол, к которому был подключён сокет или который был указан при первом вызове B<socket>(2).

source: B<RFC\ 1191> for path MTU discovery. B<RFC\ 791> and the I<E<lt>linux/ip.hE<gt>> header file for the IP protocol.
ru: В B<RFC\ 1191> описан процесс обнаружения маршрута MTU. В B<RFC\ 791> и заголовочном файле I<E<lt>linux/ip.hE<gt>> описан протокол IP.

source: random - overview of interfaces for obtaining randomness
ru: random - обзор интерфейсов получения случайных чисел

source: The kernel random-number generator relies on entropy gathered from device drivers and other sources of environmental noise to seed a cryptographically secure pseudorandom number generator (CSPRNG). It is designed for security, rather than speed.
ru: Генератор случайных чисел ядра полагается на энтропию, собранную с драйверов устройств и других источников окружающего шума, чтобы задать начальное значение криптографически безопасный генератор псевдослучайных чисел (CSPRNG). При разработке главным параметром была безопасность, а не скорость.

source: The following interfaces provide access to output from the kernel CSPRNG:
ru: Следующие интерфейсы предоставляют доступ к данным ядерного CSPRNG:

source: The I</dev/urandom> and I</dev/random> devices, both described in B<random>(4). These devices have been present on Linux since early times, and are also available on many other systems.
ru: Устройства I</dev/urandom> и I</dev/random>, описаны в B<random>(4). Данные устройства доступны с первых версий Linux, а также они есть и во многих других системах.

source: The Linux-specific B<getrandom>(2) system call, available since Linux 3.17. This system call provides access either to the same source as I</dev/urandom> (called the I<urandom> source in this page) or to the same source as I</dev/random> (called the I<random> source in this page). The default is the I<urandom> source; the I<random> source is selected by specifying the B<GRND_RANDOM> flag to the system call. (The B<getentropy>(3) function provides a slightly more portable interface on top of B<getrandom>(2).)
ru: Системный вызов, который есть только в Linux — B<getrandom>(2), доступен начиная с Linux 3.17. Данный вызов предоставляет доступ к источнику как у I</dev/urandom> (в этой странице упоминается как источник I<urandom>) так и к источнику как у I</dev/random> (в этой странице упоминается как I<random>). По умолчанию используется источник I<urandom>; источник I<random> выбирается при указании системному вызову флага B<GRND_RANDOM> (функция B<getentropy>(3) предоставляет схожий, более переносимый интерфейс, основанный на B<getrandom>(2)).

source: Initialization of the entropy pool
ru: Инициализация пула энтропии

source: The kernel collects bits of entropy from the environment. When a sufficient number of random bits has been collected, the entropy pool is considered to be initialized.
ru: Ядро собирает биты энтропии из окружения. Когда собрано достаточное количество произвольных бит, пул энтропии считается инициализированным.

source: Choice of random source
ru: Выбор источника случайных чисел

source: Unless you are doing long-term key generation (and most likely not even then), you probably shouldn't be reading from the I</dev/random> device or employing B<getrandom>(2) with the B<GRND_RANDOM> flag. Instead, either read from the I</dev/urandom> device or employ B<getrandom>(2) without the B<GRND_RANDOM> flag. The cryptographic algorithms used for the I<urandom> source are quite conservative, and so should be sufficient for all purposes.
ru: Если вы не генерируете долгосрочные ключи (и, скорее всего, и в этом случае), то, вероятно, не должны читать из устройства I</dev/random> или запускать B<getrandom>(2) с флагом B<GRND_RANDOM>. Вместо этого читайте устройство I</dev/urandom> и запускайте B<getrandom>(2) без флага B<GRND_RANDOM>. Алгоритмы шифрования, используемые для источника I<urandom>, довольно консервативны, и поэтому их должно быть достаточно для любых нужд.

source: The disadvantage of B<GRND_RANDOM> and reads from I</dev/random> is that the operation can block for an indefinite period of time. Furthermore, dealing with the partially fulfilled requests that can occur when using B<GRND_RANDOM> or when reading from I</dev/random> increases code complexity.
ru: Недостаток B<GRND_RANDOM> и чтения из I</dev/random> в том, что эта операция может заблокировать выполнение на неопределённый период времени. Более того, работа с частично выполненными запросами, которые могут вернуться при использовании B<GRND_RANDOM> или чтении I</dev/random>, увеличивает сложность кода.

source: Monte Carlo and other probabilistic sampling applications
ru: Монте-Карло и другие вероятностные приложения выборки

source: Using these interfaces to provide large quantities of data for Monte Carlo simulations or other programs/algorithms which are doing probabilistic sampling will be slow. Furthermore, it is unnecessary, because such applications do not need cryptographically secure random numbers. Instead, use the interfaces described in this page to obtain a small amount of data to seed a user-space pseudorandom number generator for use by such applications.
ru: Использование этих интерфейсов для предоставления большого количества данных при моделировании Монте-Карло или другим программам/алгоритмам, выполняющим вероятностную выборку, будет медленным. Кроме того, это излишне, так как таким приложениям не нужны криптографически безопасные случайные числа. Вместо этого используйте интерфейсы, описанные на этой странице, чтобы получить небольшое количество данных для запуска генератора псевдослучайных чисел в пространстве пользователя, который будет задействован для таких приложений.

source: Comparison between getrandom, /dev/urandom, and /dev/random
ru: Сравнение getrandom, /dev/urandom и /dev/random

source: The following table summarizes the behavior of the various interfaces that can be used to obtain randomness. B<GRND_NONBLOCK> is a flag that can be used to control the blocking behavior of B<getrandom>(2). The final column of the table considers the case that can occur in early boot time when the entropy pool is not yet initialized.
ru: В следующую таблицу сведено поведение различных интерфейсов получения случайных чисел. Флаг B<GRND_NONBLOCK> можно использовать для управления поведением блокирования B<getrandom>(2). В последней колонке таблицы показано, что может произойти на ранней стадии загрузки ОС, когда пул энтропии ещё не инициализирован.

source: Interface
ru: Интерфейс

source: Pool
ru: Пул

source: Blocking \%behavior
ru: Возникновение \%блокировки

source: Behavior when pool is not yet ready
ru: Поведение, когда пул ещё не готов

source: Blocking pool
ru: Блокирующий пул

source: If entropy too low, blocks until there is enough entropy again
ru: Если энтропии недостаточно, то блокирует до тех пор, пока не наберётся нужно количество энтропии

source: Blocks until enough entropy gathered
ru: Блокирует, пока не наберётся нужно количество энтропии

source: CSPRNG output
ru: Данные CSPRNG

source: Never blocks
ru: Никогда не блокируется

source: Returns output from uninitialized CSPRNG (may be low entropy and unsuitable for cryptography)
ru: Возвращает данные из неинициализированного CSPRNG (может быть низкая энтропия и не подходить для шифрования)

source: Same as I</dev/urandom>
ru: Тоже, что и I</dev/urandom>

source: Does not block once is pool ready
ru: Не блокирует в ожидании пула

source: Blocks until pool ready
ru: Блокирует до готовности пула

source: Same as I</dev/random>
ru: Тоже, что и I</dev/random>

source: B<EAGAIN> if not enough entropy available
ru: B<EAGAIN>, если недостаточно энтропии

source: Generating cryptographic keys
ru: Генерация ключей шифрования

source: The amount of seed material required to generate a cryptographic key equals the effective key size of the key. For example, a 3072-bit RSA or Diffie-Hellman private key has an effective key size of 128 bits (it requires about 2^128 operations to break) so a key generator needs only 128 bits (16 bytes) of seed material from I</dev/random>.
ru: Количество начального материала, требуемое для генерации ключей шифрования, равно эффективному размеру ключа. Например, 307 2-битный закрытый ключ RSA или Diffie-Hellman имеет эффективный размер ключа бит (для его подбора требуется просмотреть 2^128 значений), поэтому генератору ключа нужно только 128 бит (16 байт) начального материала из I</dev/random>.

source: While some safety margin above that minimum is reasonable, as a guard against flaws in the CSPRNG algorithm, no cryptographic primitive available today can hope to promise more than 256 bits of security, so if any program reads more than 256 bits (32 bytes) from the kernel random pool per invocation, or per reasonable reseed interval (not less than one minute), that should be taken as a sign that its cryptography is I<not> skillfully implemented.
ru: Так как разумно добавить некоторый запас прочности к выше указанному минимуму как защиту против недостатков в алгоритме CSPRNG, никакой доступный криптографический примитив сегодня не может обещать больше чем 256 бит безопасности, поэтому если какая-то программа читает больше чем 256 бит (32 байта) из пула случайных чисел ядра за вызов, или за разумный интервал повторного посева (не менее одной минуты), то это нужно считать признаком того, что шифрование в ней реализовано I<НЕДОСТАТОЧНО> продуманно.

source: Linux Key Management Calls
ru: Вызовы системы управления ключами Linux

source: request_key - request a key from the kernel's key management facility
ru: request_key - запрашивает ключ из системы управления ключами ядра

source: No glibc wrapper is provided for this system call; see NOTES.
ru: В glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: B<request_key>() attempts to find a key of the given I<type> with a description (name) that matches the specified I<description>. If such a key could not be found, then the key is optionally created. If the key is found or created, B<request_key>() attaches it to the keyring whose ID is specified in I<dest_keyring> and returns the key's serial number.
ru: Системный вызов B<request_key>() пытается найти ключ заданного I<type> с описанием (именем), совпадающим с I<description>. Если ключ найти невозможно, то ключ может быть создан. Если ключ найден или создан, то B<request_key>() присоединяет его к связке ключей, чей идентификатор указан I<keyring>, и возвращает серийный номер ключа.

source: B<request_key>() first recursively searches for a matching key in all of the keyrings attached to the calling process. The keyrings are searched in the order: thread-specific keyring, process-specific keyring, and then session keyring.
ru: Сначала B<request_key>() выполняет рекурсивный поиск совпадающего ключа во всех связках ключей, присоединённых к вызвавшему процессу. Связки ключей просматриваются в следующем порядке: связки каждой нити, связки вызвавшего процесса и связки ключей сеанса.
