Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The B<pwritev>() system call combines the functionality of B<writev>() and B<pwrite>(2). It performs the same task as B<writev>(), but adds a fourth argument, I<offset>, which specifies the file offset at which the output operation is to be performed.
ru: В системном вызове B<pwritev>() объединены возможности B<readv>() и B<pwrite>(2). Он выполняет ту же задачу что и B<writev>(), но имеет четвёртый аргумент I<offset>, задающий файловое смещение, по которому нужно выполнить операцию записи.

source: The file offset is not changed by these system calls. The file referred to by I<fd> must be capable of seeking.
ru: Файловое смещение не изменяется данными вызовами. Файл, заданный в I<fd>, должен позволять изменение смещения.

source: preadv2() and pwritev2()
ru: preadv2() и pwritev2()

source: These system calls are similar to B<preadv>() and B<pwritev>() calls, but add a fifth argument, I<flags>, which modifies the behavior on a per-call basis.
ru: Данные системные вызовы подобны B<preadv>() и B<pwritev>(), но имеют дополнительный пятый аргумент I<flags>, который изменяет поведение в зависимости от вызова.

source: Unlike B<preadv>() and B<pwritev>(), if the I<offset> argument is -1, then the current file offset is used and updated.
ru: В отличие от B<preadv>() и B<pwritev>(), если аргумент I<offset> равен -1, то текущее файловое смещение используется и обновляется.

source: The I<flags> argument contains a bitwise OR of zero or more of the following flags:
ru: Аргумент I<flags> содержит побитовое ИЛИ нуля и более следующих флагов:

source: B<RWF_DSYNC> (since Linux 4.7)
ru: B<RWF_DSYNC> (начиная с Linux 4.7)

source: Provide a per-write equivalent of the B<O_DSYNC> B<open>(2) flag. This flag is meaningful only for B<pwritev2>(), and its effect applies only to the data range written by the system call.
ru: Эквивалентен флагу B<O_DSYNC> для B<open>(2), но действующий в конкретной операции записи. Этот флаг имеет смысл только для B<pwritev2>(), и его действие распространяется только на диапазон данных, записываемым системным вызовом.

source: B<RWF_HIPRI> (since Linux 4.6)
ru: B<RWF_HIPRI> (начиная с Linux 4.6)

source: High priority read/write. Allows block-based filesystems to use polling of the device, which provides lower latency, but may use additional resources. (Currently, this feature is usable only on a file descriptor opened using the B<O_DIRECT> flag.)
ru: Высокоприоритетное чтение/запись. Позволяет в файловых системах на основе блоков использовать опрос устройства с низкой задержкой, но с возможностью использовать дополнительные ресурсы (в настоящий момент это свойство работает только для файлового дескриптора, открытого с флагом B<O_DIRECT>).

source: B<RWF_SYNC> (since Linux 4.7)
ru: B<RWF_SYNC> (начиная с Linux 4.7)

source: Provide a per-write equivalent of the B<O_SYNC> B<open>(2) flag. This flag is meaningful only for B<pwritev2>(), and its effect applies only to the data range written by the system call.
ru: Эквивалентен флагу B<O_SYNC> для B<open>(2), но действующий в конкретной операции записи. Этот флаг имеет смысл только для B<pwritev2>(), и его действие распространяется только на диапазон данных, записываемым системным вызовом.

source: B<RWF_NOWAIT> (since Linux 4.14)
ru: B<RWF_NOWAIT> (начиная с Linux 4.14)

source: Do not wait for data which is not immediately available. If this flag is specified, the B<preadv2>() system call will return instantly if it would have to read data from the backing storage or wait for a lock. If some data was successfully read, it will return the number of bytes read. If no bytes were read, it will return -1 and set I<errno> to B<EAGAIN>. Currently, this flag is meaningful only for B<preadv2>().
ru: Не ждать данные, если пока нет. Если указан этот флаг, то системный вызов B<preadv2>() сразу завершает работу, если бы ему пришлось читать данные из хранилища (backing storage) или ждать блокировку. Если данные прочитаны, то возвращается количество прочитанных байт. Если байты не прочитаны, то возвращается -1 и I<errno> присваивается B<EAGAIN>. В настоящее время, этот флаг учитывается только в B<preadv2>().

source: B<RWF_APPEND> (since Linux 4.16)
ru: B<RWF_APPEND> (начиная с Linux 4.16)

source: Provide a per-write equivalent of the B<O_APPEND> B<open>(2) flag. This flag is meaningful only for B<pwritev2>(), and its effect applies only to the data range written by the system call. The I<offset> argument does not affect the write operation; the data is always appended to the end of the file. However, if the I<offset> argument is -1, the current file offset is updated.
ru: Предоставляет эквивалент флага B<O_APPEND> для B<open>(2) для каждой записи. Данный флаг значим только для B<pwritev2>(), и его действие проявляется только для диапазона данных, записанных системным вызовом. Аргумент I<offset> не учитывается при операции записи; данные всегда добавляются в конец файла. Однако, если аргумент I<offset> равен -1, то обновляется текущее смещение файла.

source: On success, B<readv>(), B<preadv>() and B<preadv2>() return the number of bytes read; B<writev>(), B<pwritev>() and B<pwritev2>() return the number of bytes written.
ru: При успешном выполнении B<readv>(), B<preadv>() и B<preadv2>() возвращается количество считанных байт; вызовы B<writev>(), B<pwritev>() and B<pwritev2>() возвращают количество записанных байт.

source: Note that it is not an error for a successful call to transfer fewer bytes than requested (see B<read>(2) and B<write>(2)).
ru: Заметим, что для успешного выполнения не считается ошибкой передача меньшего количества байт чем запрошено (смотрите B<read>(2) и B<write>(2)).

source: On error, -1 is returned, and I<errno> is set appropriately.
ru: В случае ошибки возвращается -1 и значение I<errno> устанавливается соответствующим образом.

source: The errors are as given for B<read>(2) and B<write>(2). Furthermore, B<preadv>(), B<preadv2>(), B<pwritev>(), and B<pwritev2>() can also fail for the same reasons as B<lseek>(2). Additionally, the following errors are defined:
ru: Вызовы могут возвращать те же ошибки что и B<read>(2) и B<write>(2). Кроме этого, B<preadv>(), B<preadv2>(), B<pwritev>() и B<pwritev2>() также могут завершаться с ошибками как у B<lseek>(2). Дополнительно определены следующие ошибки:

source: The sum of the I<iov_len> values overflows an I<ssize_t> value.
ru: Сумма значений I<iov_len> превышает значение I<ssize_t>.

source: The vector count, I<iovcnt>, is less than zero or greater than the permitted maximum.
ru: Количество векторов I<iovcnt> меньше нуля или больше разрешённого максимума.

source: An unknown flag is specified in I<flags>.
ru: В I<flags> указан неизвестный флаг.

source: B<preadv>() and B<pwritev>() first appeared in Linux 2.6.30; library support was added in glibc 2.10.
ru: Вызовы B<preadv>() и B<pwritev>() впервые появились в Linux 2.6.30; поддержка в библиотеке добавлена в glibc 2.10.

source: B<preadv2>() and B<pwritev2>() first appeared in Linux 4.6. Library support was added in glibc 2.26.
ru: Вызовы B<preadv2>() и B<pwritev2>() впервые появились в Linux 4.6. Поддержка в библиотеке glibc добавлена в версии 2.26.

source: B<readv>(), B<writev>(): POSIX.1-2001, POSIX.1-2008, 4.4BSD (these system calls first appeared in 4.2BSD).
ru: B<readv>(), B<writev>(): POSIX.1-2001, POSIX.1-2008, 4.4BSD (данные системные вызовы впервые появились в 4.2BSD).

source: B<preadv>(), B<pwritev>(): nonstandard, but present also on the modern BSDs.
ru: B<preadv>(), B<pwritev>(): нет в стандарте, но есть в современных BSD.

source: B<preadv2>(), B<pwritev2>(): nonstandard Linux extension.
ru: B<preadv2>(), B<pwritev2>(): нестандартные расширения Linux.

source: POSIX.1 allows an implementation to place a limit on the number of items that can be passed in I<iov>. An implementation can advertise its limit by defining B<IOV_MAX> in I<E<lt>limits.hE<gt>> or at run time via the return value from I<sysconf(_SC_IOV_MAX)>. On modern Linux systems, the limit is 1024. Back in Linux 2.0 days, this limit was 16.
ru: Согласно POSIX1, в реализации можно устанавливать ограничение на количество элементов, которые можно передать в I<iov>. Реализация может объявить это ограничение в B<IOV_MAX> (в файле I<E<lt>limits.hE<gt>>) или во время выполнения в виде возвращаемого значения I<sysconf(_SC_IOV_MAX)>. В современных Linux данное ограничение равно 1024. В времена Linux 2.0 оно было равно 16.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: The raw B<preadv>() and B<pwritev>() system calls have call signatures that differ slightly from that of the corresponding GNU C library wrapper functions shown in the SYNOPSIS. The final argument, I<offset>, is unpacked by the wrapper functions into two arguments in the system calls:
ru: Объявления системных вызовов B<preadv>() и B<pwritev>() немного отличаются от им соответствующих обёрточных функций библиотеки GNU C; они показаны в ОБЗОРЕ. Последний аргумент, I<offset>, раскладывается обёрточными функциями на два для системных вызовов:

source: These arguments contain, respectively, the low order and high order 32 bits of I<offset>.
ru: В этих аргументах содержатся старшая и младшая 32-битная часть I<offset>, соответственно.

source: Historical C library/kernel differences
ru: Исторические отличия между библиотекой C и ядром

source: To deal with the fact that B<IOV_MAX> was so low on early versions of Linux, the glibc wrapper functions for B<readv>() and B<writev>() did some extra work if they detected that the underlying kernel system call failed because this limit was exceeded. In the case of B<readv>(), the wrapper function allocated a temporary buffer large enough for all of the items specified by I<iov>, passed that buffer in a call to B<read>(2), copied data from the buffer to the locations specified by the I<iov_base> fields of the elements of I<iov>, and then freed the buffer. The wrapper function for B<writev>() performed the analogous task using a temporary buffer and a call to B<write>(2).
ru: Для учёта того, что значение B<IOV_MAX> было мало в старых версиях Linux, обёрточные функции glibc B<readv>() и B<writev>() выполняют дополнительные действия, если обнаруживается, что используемый системный вызов ядра завершился неудачно из-за превышения этого ограничения. В случае B<readv>(), обёрточная функция выделяет временный буфер, достаточный для всех элементов, указанных в I<iov>, передаёт этот буфер в вызов B<read>(2), копирует данные из буфера в места, указанные в полях I<iov_base> элемента I<iov>, а затем освобождает буфер. Обёрточная функция B<writev>() выполняет аналогичную задачу с помощью временного буфера и вызова B<write>(2).

source: The need for this extra effort in the glibc wrapper functions went away with Linux 2.2 and later. However, glibc continued to provide this behavior until version 2.10. Starting with glibc version 2.9, the wrapper functions provide this behavior only if the library detects that the system is running a Linux kernel older than version 2.6.18 (an arbitrarily selected kernel version). And since glibc 2.20 (which requires a minimum Linux kernel version of 2.6.32), the glibc wrapper functions always just directly invoke the system calls.
ru: Потребность в дополнительных действиях в обёрточных функциях glibc пропала в Linux 2.2 и новее. Однако glibc продолжала так работать до версии 2.10. начиная с glibc 2.9, обёрточные функции так работают только, если библиотека обнаруживает, что система работает с ядром Linux меньше 2.6.18 (произвольно выбранная версия ядра). И начиная с glibc 2.20 (для которой требуется минимальная версия ядра Linux 2.6.32) обёрточные функции glibc всегда просто вызывают системные вызовы.

source: The following code sample demonstrates the use of B<writev>():
ru: Следующий пример кода демонстрирует использование B<writev>():

source: Linux User Manual
ru: Руководство пользователя Linux

source: repertoiremap - map symbolic character names to Unicode code points
ru: repertoiremap - отображает символические имена символов в кодовые точки Юникода

source: A repertoire map defines mappings between symbolic character names (mnemonics) and Unicode code points when compiling a locale with B<localedef>(1). Using a repertoire map is optional, it is needed only when symbolic names are used instead of now preferred Unicode code points.
ru: Карта набора (repertoire map) определяет отображение между символическими именами (мнемониками) символов и кодовыми точками Юникода (Unicode code points) при компиляции локали с помощью B<localedef>(1). Использование карты набора необязательно, она требуется только при использовании символических имён вместо предпочтительных теперь кодовых точек Юникода.

source: Syntax
ru: Синтаксис

source: The repertoiremap file starts with a header that may consist of the following keywords:
ru: Файл repertoiremap начинается с заголовка, который может содержать следующие ключевые слова:

source: is followed by a character that will be used as the comment character for the rest of the file. It defaults to the number sign (#).
ru: за которым указывается символ, использующийся в оставшихся строках файла как символ комментария. По умолчанию это символ решётки (#).

source: is followed by a character that should be used as the escape character for the rest of the file to mark characters that should be interpreted in a special way. It defaults to the backslash (\e).
ru: за которым указывается символ, использующийся в оставшихся строках файла как символ экранирования для пометки символов, которые должны обрабатываться особым образом. По умолчанию это символ обратной косой черты (\e).

source: The mapping section starts with the keyword I<CHARIDS> in the first column.
ru: Раздел отображения начинается с ключевого слова I<CHARIDS> в первом столбце.

source: The mapping lines have the following form:
ru: Строки отображения имеют следующий вид:

source: I<E<lt>symbolic-nameE<gt> E<lt>code-pointE<gt> comment>
ru: I<E<lt>символическое-имяE<gt> E<lt>кодовая-точкаE<gt> комментарий>

source: This defines exactly one mapping, I<comment> being optional.
ru: Одной строкой определяется одно отображение, I<комментарий> не обязателен.

source: The mapping section ends with the string I<END CHARIDS>.
ru: Раздел отображения заканчивается строкой I<END CHARIDS>.

source: Usual default repertoire map path.
ru: Обычный путь по умолчанию для файла карты набора.

source: Repertoire maps are deprecated in favor of Unicode code points.
ru: Вместо карт набора следует использовать кодовые точки Юникода.

source: A mnemonic for the Euro sign can be defined as follows:
ru: Знак евро можно определить следующим образом:

source: rpc - RPC program number data base
ru: rpc - база данных программных номеров RPC

source: The I<rpc> file contains user readable names that can be used in place of RPC program numbers. Each line has the following information:
ru: В файле I<rpc> содержатся в понятном для человека виде имена, которые можно использовать вместо программных номеров RPC. Каждая строка содержит следующую информацию:

source: name of server for the RPC program
ru: имя сервера RPC

source: RPC program number
ru: программный номер RPC

source: aliases
ru: псевдонимы

source: Items are separated by any number of blanks and/or tab characters. A \(aq#\(aq indicates the beginning of a comment; characters from the \(aq#\(aq to the end of the line are not interpreted by routines which search the file.
ru: Поля в файле отделяются друг от друга пробелами и/или символами табуляции. Символом \(aq#\(aq отмечается начало комментария; символы начиная с \(aq#\(aq до конца строки не интерпретируются процедурами, которые производят поиск в данном файле.

source: Here is an example of the I</etc/rpc> file from the Sun RPC Source distribution.
ru: Вот пример файла I</etc/rpc>, взятый из дистрибутива Sun RPC Source.

source: RPC program number data base
ru: база данных программных номеров RPC

source: resolv.conf - resolver configuration file
ru: resolv.conf - файл настройки для процедур определения имён (resolver)

source: The I<resolver> is a set of routines in the C library that provide access to the Internet Domain Name System (DNS). The resolver configuration file contains information that is read by the resolver routines the first time they are invoked by a process. The file is designed to be human readable and contains a list of keywords with values that provide various types of resolver information. The configuration file is considered a trusted source of DNS information (e.g., DNSSEC AD-bit information will be returned unmodified from this source).
ru: I<resolver> — это набор функций из библиотеки Си, который предоставляет доступ к системе доменных имён интернет (DNS). Файл настройки определителя (resolver) содержит информацию, которая читается функциями разрешения имён при первом их вызове процессом. Файл разрабатывался в понятном человеку формате, и содержит список ключевых слов со значениями, которые предоставляют различного рода информацию для функций разрешения имён. Файл настройки считается надёжным источником информации DNS (например, информация об AD-бите DNSSEC будет возвращаться в неизменном виде из этого источника).

source: If this file does not exist, only the name server on the local machine will be queried; the domain name is determined from the hostname and the domain search path is constructed from the domain name.
ru: Если этот файл не существует, то будет опрашиваться только служба имён на локальной машине; доменное имя определяется из имени узла, а домен поиска создаётся из имени домена.

source: The different configuration options are:
ru: Поддерживаются следующие параметры настройки:

source: B<nameserver> Name server IP address
ru: B<nameserver> IP-адрес сервера имён

source: Internet address of a name server that the resolver should query, either an IPv4 address (in dot notation), or an IPv6 address in colon (and possibly dot) notation as per RFC 2373. Up to B<MAXNS> (currently 3, see I<E<lt>resolv.hE<gt>>) name servers may be listed, one per keyword. If there are multiple servers, the resolver library queries them in the order listed. If no B<nameserver> entries are present, the default is to use the name server on the local machine. (The algorithm used is to try a name server, and if the query times out, try the next, until out of name servers, then repeat trying all the name servers until a maximum number of retries are made.)
ru: Задает интернет-адрес сервера имён, на который надо переправлять все запросы, или в виде адреса IPv4 (в точечном формате), или в виде адреса IPv6 в формате с двоеточиями (и, возможно, точками), определённом в RFC 2373. Может быть указано до B<MAXNS> (в настоящее время 3, см. I<E<lt>resolv.hE<gt>>) серверов имён, повторяя каждый раз ключевое слово. Если указано несколько серверов, функции разрешения имён будут обращаться к серверам имен в порядке перечисления. Если в файле нет строк B<nameserver>, то функции разрешения имён используют сервер имён на локальной машине. (Функции разрешения имён работают по следующему алгоритму: попробовать обратиться к первому указанному серверу имён. Если нет ответа в отведённое время, попробовать обратиться к следующему серверу, и т.д. пока не будет исчерпан список серверов.)

source: B<domain> Local domain name.
ru: B<domain> локальное доменное имя

source: Most queries for names within this domain can use short names relative to the local domain. If set to \(aq.\(aq, the root domain is considered. If no B<domain> entry is present, the domain is determined from the local hostname returned by B<gethostname>(2); the domain part is taken to be everything after the first \(aq.\(aq. Finally, if the hostname does not contain a domain part, the root domain is assumed.
ru: Для большинства запросов имён с доменом можно использовать короткие имена относительно локального домена. Если значение равно \(aq.\(aq, то это считается корневым доменом. Если строки B<domain> в файле настройки нет, домен определяется из локального имени узла, возвращаемого B<gethostname>(2); доменной частью считается всё после первой точки \(aq.\(aq. Наконец, если имя узла не содержит доменной части, то предполагается корневой домен.

source: B<search> Search list for host-name lookup.
ru: B<search> список поиска

source: The search list is normally determined from the local domain name; by default, it contains only the local domain name. This may be changed by listing the desired domain search path following the I<search> keyword with spaces or tabs separating the names. Resolver queries having fewer than I<ndots> dots (default is 1) in them will be attempted using each component of the search path in turn until a match is found. For environments with multiple subdomains please read B<options ndots:>I<n> below to avoid man-in-the-middle attacks and unnecessary traffic for the root-dns-servers. Note that this process may be slow and will generate a lot of network traffic if the servers for the listed domains are not local, and that queries will time out if no server is available for one of the domains.
ru: Список поиска обычно определяется по имени локального домена; по умолчанию он содержит только имя локального домена. Это можно изменить, перечислив имена доменов, в которых нужно вести поиск, с ключевым полем I<search> через пробел или символ табуляции. При разрешении запросов имён, в которых меньше точек чем указано в I<ndots> (по умолчанию 1), будет использован каждый компонент пути поиска пока не будет найдено соответствующее имя.

source: The search list is currently limited to six domains with a total of 256 characters.
ru: Список поиска сейчас может содержать не более шести доменов и не может быть длиннее 256 символов.

source: This option allows addresses returned by B<gethostbyname>(3) to be sorted. A sortlist is specified by IP-address-netmask pairs. The netmask is optional and defaults to the natural netmask of the net. The IP address and optional network pairs are separated by slashes. Up to 10 pairs may be specified. Here is an example:
ru: Вызывает сортировку адресов, возвращаемых функцией B<gethostbyname>(3). Список сортировки задается в виде пар IP-адрес/маска сети. Маску сети указывать не обязательно \(em по умолчанию используется естественная маска сети. IP-адрес и необязательная маска сети разделяются косой чертой. В списке можно указывать до 10 пар. Пример:

source: Options allows certain internal resolver variables to be modified. The syntax is
ru: С помощью параметров изменяются некоторые внутренние переменные функций определения имён. Синтаксис

source: B<options> I<option> I<...>
ru: B<options> I<параметр> I<...>

source: where I<option> is one of the following:
ru: где I<параметр> может иметь следующие значения:

source: Sets B<RES_DEBUG> in I<_res.options> (effective only if glibc was built with debug support; see B<resolver>(3)).
ru: Задаёт B<RES_DEBUG> в I<_res.options> (только, если glibc собрана с поддержкой отладки; смотрите B<resolver>(3)).

source: Sets a threshold for the number of dots which must appear in a name given to B<res_query>(3) (see B<resolver>(3)) before an I<initial absolute query> will be made. The default for I<n> is 1, meaning that if there are any dots in a name, the name will be tried first as an absolute name before any I<search list> elements are appended to it. The value for this option is silently capped to 15.
ru: Задаёт минимальное количество точек, которые должны обязательно присутствовать в имени, переданном функции B<res_query>(3) (см. B<resolver>(3)) прежде чем будет выполнен I<начальный абсолютный запрос>. По умолчанию I<n> равно 1, поэтому если в имени есть точки, сначала имя пытаются разрешить как абсолютное, прежде чем добавлять к нему элементы из I<списка поиска>. Значение этого параметра внутренне доходит до 15.
