Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The B<rexec>() function looks up the host I<*ahost> using B<gethostbyname>(3), returning -1 if the host does not exist. Otherwise, I<*ahost> is set to the standard name of the host. If a username and password are both specified, then these are used to authenticate to the foreign host; otherwise the environment and then the I<.netrc> file in user's home directory are searched for appropriate information. If all this fails, the user is prompted for the information.
ru: Функция B<rexec>() ищет узел I<*ahost>, используя B<gethostbyname>(3), и возвращает -1, если узел не существует. В противном случае, I<*ahost> присваивается стандартное имя узла. Если указаны имя пользователя и пароль, то они используются для аутентификации на другом узле; иначе происходит поиск соответствующей информации в окружении и затем в файле I<.netrc>, находящемся в домашнем каталоге пользователя. Если всё это заканчивается с ошибкой, пользователь извещается об этом.

source: The port I<inport> specifies which well-known DARPA Internet port to use for the connection; the call I<getservbyname("exec", "tcp")> (see B<getservent>(3)) will return a pointer to a structure that contains the necessary port. The protocol for connection is described in detail in B<rexecd>(8).
ru: В I<inport> указывается, какой хорошо известный (well-known) порт DARPA Internet нужно использовать для подключения; вызов I<getservbyname("exec", "tcp")> (смотрите B<getservent>(3)) вернёт указатель на структуру, которая содержит необходимый порт. Протокол подключения подробно описан в B<rexecd>(8).

source: If the connection succeeds, a socket in the Internet domain of type B<SOCK_STREAM> is returned to the caller, and given to the remote command as I<stdin> and I<stdout>. If I<fd2p> is nonzero, then an auxiliary channel to a control process will be setup, and a file descriptor for it will be placed in I<*fd2p>. The control process will return diagnostic output from the command (unit 2) on this channel, and will also accept bytes on this channel as being UNIX signal numbers, to be forwarded to the process group of the command. The diagnostic information returned does not include remote authorization failure, as the secondary connection is set up after authorization has been verified. If I<fd2p> is 0, then the I<stderr> (unit 2 of the remote command) will be made the same as the I<stdout> and no provision is made for sending arbitrary signals to the remote process, although you may be able to get its attention by using out-of-band data.
ru: Если соединение успешно установлено, то вызывающему возвращается сокет в Интернет-домене типа B<SOCK_STREAM>, который для удалённой команды считается I<stdin> и I<stdout>. Если I<fd2p> не равно нулю, то устанавливается вспомогательный канал до управляющего процесса, а его файловый дескриптор будет помещён в I<*fd2p>. Управляющий процесс возвращает диагностический вывод из команды (устройства 2) в этот канал, а также принимает байты из этого канала, считая их номерами сигналов UNIX, для их пересылки группе процессов команды. Возвращаемая диагностическая информация не содержит ошибки удалённой авторизации, так как второе подключение устанавливается после прохождения авторизации. Если I<fd2p> равно 0, то I<stderr> (устройство 2 удалённой команды) будет работать аналогично I<stdout> и для отправки произвольных сигналов в удалённый процесс ничего не будет сделано, хотя вы сможете привлечь к себе внимание, используя внеполосную передачу данных.

source: The B<rexec>() function works over IPv4 (B<AF_INET>). By contrast, the B<rexec_af>() function provides an extra argument, I<af>, that allows the caller to select the protocol. This argument can be specified as B<AF_INET>, B<AF_INET6>, or B<AF_UNSPEC> (to allow the implementation to select the protocol).
ru: Функция B<rexec>() работает по протоколу IPv4 (B<AF_INET>). В отличие от неё, B<rexec_af>() предоставляет ещё один аргумент, I<af>, который позволяет вызывающему выбрать протокол. В этом аргументе можно указать значения B<AF_INET>, B<AF_INET6> или B<AF_UNSPEC> (чтобы позволить реализации выбирать протокол).

source: The B<rexec_af>() function was added to glibc in version 2.2.
ru: Функция B<rexec_af>() впервые появилась в glibc 2.2.

source: These functions are not in POSIX.1. The B<rexec>() function first appeared in 4.2BSD, and is present on the BSDs, Solaris, and many other systems. The B<rexec_af>() function is more recent, and less widespread.
ru: Данные функции отсутствуют в POSIX.1. Функция B<rexec>() впервые появилась в 4.2BSD, и есть в разных BSD, Solaris и других системах. Функция B<rexec_af>() более новая и распространена гораздо меньше.

source: The B<rexec>() function sends the unencrypted password across the network.
ru: Функция B<rexec>() посылает пароль через сеть в нешифрованном виде.

source: The underlying service is considered a big security hole and therefore not enabled on many sites; see B<rexecd>(8) for explanations.
ru: Считается, что лежащая в основе служба является большой дырой в безопасности, и поэтому не включена на большинстве сайтов; смотрите объяснение в B<rexecd>(8).

source: rtime - get time from a remote machine
ru: rtime - получение времени с удалённого узла

source: This function uses the Time Server Protocol as described in RFC\ 868 to obtain the time from a remote machine.
ru: Для получения времени с удалённого компьютера функция использует протокол Time Server Protocol, описанный в RFC\ 868.

source: The Time Server Protocol gives the time in seconds since 00:00:00 UTC, 1 Jan 1900, and this function subtracts the appropriate constant in order to convert the result to seconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
ru: Time Server Protocol возвращает время в секундах начиная с 1 января 1900 года 00:00:00 UTC. Данная функция самостоятельно вычитает подходящую константу для того, чтобы преобразовать результат в секундах от начала Эпохи \(em 1970-01-01 00:00:00 +0000 (UTC).

source: When I<timeout> is non-NULL, the udp/time socket (port 37) is used. Otherwise, the tcp/time socket (port 37) is used.
ru: Если I<timeout> не равно NULL, то будет использоваться сокет udp/time (порт 37), иначе \(em сокет tcp/time (порт 37).

source: On success, 0 is returned, and the obtained 32-bit time value is stored in I<timep-E<gt>tv_sec>. In case of error -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0, а полученное 32-битное значение времени сохраняется в I<timep-E<gt>tv_sec>. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: All errors for underlying functions (B<sendto>(2), B<poll>(2), B<recvfrom>(2), B<connect>(2), B<read>(2)) can occur. Moreover:
ru: Могут возникнуть все ошибки задействованных в работе функций (B<sendto>(2), B<poll>(2), B<recvfrom>(2), B<connect>(2), B<read>(2)), а также:

source: The number of returned bytes is not 4.
ru: Количество возвращённых байт не равно 4.

source: The waiting time as defined in timeout has expired.
ru: Время ожидания, указанное в таймауте, превышено.

source: Only IPv4 is supported.
ru: Поддерживается только IPv4.

source: Some I<in.timed> versions support only TCP. Try the example program with I<use_tcp> set to 1.
ru: Некоторые версии I<in.timed> поддерживают только TCP. Попробуйте пример программы с установленной в 1 значением I<use_tcp>.

source: Libc5 uses the prototype
ru: В libc5 используется прототип

source: and requires I<E<lt>sys/time.hE<gt>> instead of I<E<lt>rpc/auth_des.hE<gt>>.
ru: для которого требуется I<E<lt>sys/time.hE<gt>> вместо I<E<lt>rpc/auth_des.hE<gt>>.

source: B<rtime>() in glibc 2.2.5 and earlier does not work properly on 64-bit machines.
ru: B<rtime>() в glibc 2.2.5 и ниже на 64-битных компьютерах работает некорректно.

source: This example requires that port 37 is up and open. You may check that the time entry within I</etc/inetd.conf> is not commented out.
ru: Для этого примера требуется поднятие и открытие порта 37. Вы можете проверить это, убедившись в том, что в файле I</etc/inetd.conf> запись time раскомментирована.

source: The program connects to a computer called "linux". Using "localhost" does not work. The result is the localtime of the computer "linux".
ru: Программа подключается к компьютеру с именем «linux». Использование «localhost» не сработает. В качестве результата будет возвращено локальное время компьютера «linux».

source: ret = rtime(&name, &time1, use_tcp ? NULL : &timeout); if (ret E<lt> 0) perror("rtime error"); else { time_t t = time1.tv_sec; printf("%s\en", ctime(&t)); }
ru: ret = rtime(&name, &time1, use_tcp ? NULL : &timeout); if (ret E<lt> 0) perror("ошибка rtime"); else { time_t t = time1.tv_sec; printf("%s\en", ctime(&t)); }

source: raise - send a signal to the caller
ru: raise - посылает сигнал вызывающему

source: The B<raise>() function sends a signal to the calling process or thread. In a single-threaded program it is equivalent to
ru: Функция B<raise>() посылает сигнал вызвавшему процессу или нити. В однонитевых программах это эквивалентно

source: In a multithreaded program it is equivalent to
ru: В многонитевых программах это эквивалентно

source: If the signal causes a handler to be called, B<raise>() will return only after the signal handler has returned.
ru: Если из-за сигнала вызвался обработчик, то B<raise>() вернёт управление только после завершения обработчика сигнала.

source: B<raise>() returns 0 on success, and nonzero for failure.
ru: При успешном выполнении функция B<raise>() возвращает 0 или иное значение при ошибке.

source: Since version 2.3.3, glibc implements B<raise>() by calling B<tgkill>(2), if the kernel supports that system call. Older glibc versions implemented B<raise>() using B<kill>(2).
ru: Начиная с версии 2.3.3 glibc реализует B<raise>() с помощью B<tgkill>(2), если ядро поддерживает этот системный вызов. Предыдущие версии glibc реализовали B<raise>() с помощью B<kill>(2).

source: realpath - return the canonicalized absolute pathname
ru: realpath - возвращает канонизированный абсолютный путь

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || /* в glibc начиная с 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE

source: B<realpath>() expands all symbolic links and resolves references to I</./>, I</../> and extra \(aq/\(aq characters in the null-terminated string named by I<path> to produce a canonicalized absolute pathname. The resulting pathname is stored as a null-terminated string, up to a maximum of B<PATH_MAX> bytes, in the buffer pointed to by I<resolved_path>. The resulting path will have no symbolic link, I</./> or I</../> components.
ru: Функция B<realpath>() раскрывает все символьные ссылки, конструкции I</./>, I</../> и дополнительные символы «/» в строке I<path> (завершается null) для создания канонического абсолютного пути. Получившееся имя сохраняется в виде строки (с null на конце) не длиннее чем B<PATH_MAX> байт в буфере, указанном в I<resolved_path>. Конечный путь не содержит символьных ссылок и компонентов I</./> или I</../>.

source: If I<resolved_path> is specified as NULL, then B<realpath>() uses B<malloc>(3) to allocate a buffer of up to B<PATH_MAX> bytes to hold the resolved pathname, and returns a pointer to this buffer. The caller should deallocate this buffer using B<free>(3).
ru: Если значение I<resolved_path> равно NULL, то B<realpath>() выделяет буфер размером B<PATH_MAX> байт с помощью B<malloc>(3) для хранения полного пути и возвращает указатель на этот буфер. Вызывающий должен освободить буфер с помощью B<free>(3).

source: If there is no error, B<realpath>() returns a pointer to the I<resolved_path>.
ru: При успешном выполнении B<realpath>() возвращает указатель на I<resolved_path>.

source: Otherwise, it returns NULL, the contents of the array I<resolved_path> are undefined, and I<errno> is set to indicate the error.
ru: При ошибках возвращается NULL, содержимое массива I<resolved_path> не определено и в I<errno> указывается код ошибки.

source: Read or search permission was denied for a component of the path prefix.
ru: Запрещено чтение или поиск для компонента, содержащегося в пути.

source: I<path> is NULL. (In glibc versions before 2.3, this error is also returned if I<resolved_path> is NULL.)
ru: Значение I<path> равно NULL (в glibc до версии 2.3 эта ошибка также возвращалась и при I<resolved_path> равном NULL).

source: A component of a pathname exceeded B<NAME_MAX> characters, or an entire pathname exceeded B<PATH_MAX> characters.
ru: Компонент имени пути более B<NAME_MAX> символов, или весь путь более B<PATH_MAX> символов.

source: Out of memory.
ru: Не хватает памяти.

source: POSIX.1-2001 says that the behavior if I<resolved_path> is NULL is implementation-defined. POSIX.1-2008 specifies the behavior described in this page.
ru: В POSIX.1-2001 сказано, что поведение при значении I<resolved_path> равном NULL, зависит от реализации. В POSIX.1-2008 определено поведение, аналогичное описанию на этой странице.

source: In 4.4BSD and Solaris, the limit on the pathname length is B<MAXPATHLEN> (found in I<E<lt>sys/param.hE<gt>>). SUSv2 prescribes B<PATH_MAX> and B<NAME_MAX>, as found in I<E<lt>limits.hE<gt>> or provided by the B<pathconf>(3) function. A typical source fragment would be
ru: В 4.4BSD и Solaris максимальная длина пути равна B<MAXPATHLEN> (находится в I<E<lt>sys/param.hE<gt>>). В SUSv2 величины B<PATH_MAX> и B<NAME_MAX> представлены в I<E<lt>limits.hE<gt>> или предоставляются функцией B<pathconf>(3). Вот типичный фрагмент кода:

source: (But see the BUGS section.)
ru: (Но смотрите раздел ДЕФЕКТЫ)

source: GNU extensions
ru: Расширения GNU

source: If the call fails with either B<EACCES> or B<ENOENT> and I<resolved_path> is not NULL, then the prefix of I<path> that is not readable or does not exist is returned in I<resolved_path>.
ru: Если вызов завершается с ошибкой B<EACCES> или B<ENOENT> и значение I<resolved_path> не равно NULL, то в I<resolved_path> возвращается начало не читаемой или не существующей части I<path>.

source: The POSIX.1-2001 standard version of this function is broken by design, since it is impossible to determine a suitable size for the output buffer, I<resolved_path>. According to POSIX.1-2001 a buffer of size B<PATH_MAX> suffices, but B<PATH_MAX> need not be a defined constant, and may have to be obtained using B<pathconf>(3). And asking B<pathconf>(3) does not really help, since, on the one hand POSIX warns that the result of B<pathconf>(3) may be huge and unsuitable for mallocing memory, and on the other hand B<pathconf>(3) may return -1 to signify that B<PATH_MAX> is not bounded. The I<resolved_path\ ==\ NULL> feature, not standardized in POSIX.1-2001, but standardized in POSIX.1-2008, allows this design problem to be avoided.
ru: Стандартная версия этой функции POSIX.1-2001 некорректна изначально, так как невозможно определить подходящий размер для буфера результата. В соответствии с POSIX.1-2001 буфера размером B<PATH_MAX> должно хватить, но B<PATH_MAX> может не задаваться константой, а получаться через функцию B<pathconf>(3). И запрос B<pathconf>(3) особо не поможет, так как с одной стороны POSIX предупреждает, что результат B<pathconf>(3) может быть слишком велик и не пригоден для выделения памяти. С другой стороны, B<pathconf>(3) может возвратить -1 для обозначения того, что B<PATH_MAX> неограничен. Свойство I<resolved_path\ ==\ NULL>, не стандартизованное в POSIX.1-2001, но стандартизованное в POSIX.1-2008, позволяет избежать этой проблемы проектирования.
