Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: POSIX.2's specification of case-independent matching is vague. The "one case implies all cases" definition given above is current consensus among implementors as to the right interpretation.
ru: Определение в POSIX.2 совпадения при отключении учёта регистра тоже очень туманное. Определение типа «один регистр замещает все остальные», по мнению некоторых специалистов, не является правильным.

source: AUTHOR
ru: АВТОР

source: This page was taken from Henry Spencer's regex package.
ru: Эта страница взята из пакета regex, написанного Генри Спенсером (Henry Spencer).

source: POSIX.2, section 2.8 (Regular Expression Notation).
ru: POSIX.2, раздел 2.8 (запись регулярных выражений).

source: rtld-audit - auditing API for the dynamic linker
ru: rtld-audit - программный интерфейс слежения за динамическим компоновщиком

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>link.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>link.hE<gt>>

source: The GNU dynamic linker (run-time linker) provides an auditing API that allows an application to be notified when various dynamic linking events occur. This API is very similar to the auditing interface provided by the Solaris run-time linker. The necessary constants and prototypes are defined by including I<E<lt>link.hE<gt>>.
ru: Динамический компоновщик GNU (компоновщик времени выполнения) предоставляет API слежения, который позволяет приложению получать уведомления о различных событиях динамической компоновки. Данный API очень похож на интерфейс слежения, предоставляемый компоновщиком времени выполнения из Solaris. Необходимые константы и прототипы определены в I<E<lt>link.hE<gt>>.

source: To use this interface, the programmer creates a shared library that implements a standard set of function names. Not all of the functions need to be implemented: in most cases, if the programmer is not interested in a particular class of auditing event, then no implementation needs to be provided for the corresponding auditing function.
ru: Чтобы использовать этот интерфейс, программист создаёт общую библиотеку функций со стандартизованными именами. Не все функции нужно реализовывать: в большинстве случаев, если программист не заинтересован в конкретном классе отслеживаемых событий, то нет нужды в создании соответствующей отслеживающей функции.

source: To employ the auditing interface, the environment variable B<LD_AUDIT> must be defined to contain a colon-separated list of shared libraries, each of which can implement (parts of) the auditing API. When an auditable event occurs, the corresponding function is invoked in each library, in the order that the libraries are listed.
ru: Для применения интерфейса слежения переменная окружения B<LD_AUDIT> должна содержать разделённый двоеточиями список общих библиотек, каждая из которых может реализовывать (частично) API слежения. Когда возникает отслеживаемое событие, из каждой библиотеки вызывается соответствующая функция в том порядке, в котором эти библиотеки были перечислены.

source: This is the only function that I<must> be defined by an auditing library: it performs the initial handshake between the dynamic linker and the auditing library. When invoking this function, the dynamic linker passes, in I<version>, the highest version of the auditing interface that the linker supports. If necessary, the auditing library can check that this version is sufficient for its requirements.
ru: Это единственная функция, которая I<должна> быть определена в отслеживающей библиотеке: она осуществляет первичную связь между динамическим компоновщиком и отслеживающей библиотекой. При вызове этой функции динамический компоновщик передаёт в I<version> максимальную версию интерфейса слежения, которую поддерживает сам компоновщик. При необходимости, отслеживающая библиотека может проверить, что эта версия удовлетворяет её требованиям.

source: As its function result, this function should return the version of the auditing interface that this auditing library expects to use (returning I<version> is acceptable). If the returned value is 0, or a version that is greater than that supported by the dynamic linker, then the audit library is ignored.
ru: Данная функция должна возвращать версию интерфейса слежения, которую отслеживающая библиотека собирается использовать (возврат I<version> приемлем). Если возвращаемое значение равно 0 или больше чем максимальная версия, поддерживаемая динамическим компоновщиком, то отслеживающая библиотека игнорируется.

source: The dynamic linker invokes this function to inform the auditing library that it is about to search for a shared object. The I<name> argument is the filename or pathname that is to be searched for. I<cookie> identifies the shared object that initiated the search. I<flag> is set to one of the following values:
ru: Динамический компоновщик вызывает эту функцию для информирования отслеживающей библиотеки при поиске общего объекта. Аргумент I<name> содержит имя файла или путь, который будет разыскиваться. В I<cookie> указывается общий объект, который начал поиск. Аргумент I<flag> устанавливается в одно из следующих значений:

source: This is the original name that is being searched for. Typically, this name comes from an ELF B<DT_NEEDED> entry, or is the I<filename> argument given to B<dlopen>(3).
ru: Это оригинальное имя, которое будет разыскиваться. Как правило, это имя хранится в записи ELF B<DT_NEEDED> или был передан в аргументе I<filename> при вызове B<dlopen>(3).

source: I<name> was created using a directory specified in B<LD_LIBRARY_PATH>.
ru: Значение I<name> было создано с использованием каталога из B<LD_LIBRARY_PATH>.

source: I<name> was created using a directory specified in an ELF B<DT_RPATH> or B<DT_RUNPATH> list.
ru: Значение I<name> было создано с использованием каталога из списка ELF B<DT_RPATH> или B<DT_RUNPATH>.

source: I<name> was found via the B<ldconfig>(8) cache (I</etc/ld.so.cache>).
ru: Значение I<name> было найдено в кэше B<ldconfig>(8) (I</etc/ld.so.cache>).

source: I<name> was found via a search of one of the default directories.
ru: Значение I<name> было найдено при поиске в одном из каталогов по умолчанию.

source: I<name> is specific to a secure object (unused on Linux).
ru: Значение I<name> относится к объекту безопасности (не используется в Linux).

source: As its function result, B<la_objsearch>() returns the pathname that the dynamic linker should use for further processing. If NULL is returned, then this pathname is ignored for further processing. If this audit library simply intends to monitor search paths, then I<name> should be returned.
ru: Функция B<la_objsearch>() возвращает путь, который динамический компоновщик должен использовать в дальнейшей работе. Если возвращается NULL, то путь игнорируется в дальнейшей работе. Если данная отслеживающая библиотека создана для простого слежения за путями поиска, то должно возвращаться I<name>.

source: The dynamic linker calls this function to inform the auditing library that link-map activity is occurring. I<cookie> identifies the object at the head of the link map. When the dynamic linker invokes this function, I<flag> is set to one of the following values:
ru: Динамический компоновщик вызывает эту функцию для информирования библиотеки слежения о выполнении действия с картой ссылок (link-map). В I<cookie> задаётся объект, находящийся в начале карты ссылок. Когда динамический компоновщик вызывает эту функцию, аргумент I<flag> устанавливается в одно из следующих значений:

source: New objects are being added to the link map.
ru: В карту ссылок добавляется новый объект.

source: Objects are being removed from the link map.
ru: Из карты ссылок удаляется объект.

source: Link-map activity has been completed: the map is once again consistent.
ru: Действие с картой ссылок завершено: карта снова корректна (consistent).

source: The dynamic linker calls this function when a new shared object is loaded. The I<map> argument is a pointer to a link-map structure that describes the object. The I<lmid> field has one of the following values
ru: Динамический компоновщик вызывает эту функцию при загрузке нового общего объекта. Аргумент I<map> является указателем на структуру карты ссылок (link-map), которая описывает объект. Поле I<lmid> устанавливается в одно из следующих значений:

source: Link map is part of the initial namespace.
ru: Карта ссылок является частью начального пространства имён (namespace).

source: Link map is part of a new namespace requested via B<dlmopen>(3).
ru: Карта ссылок является частью нового пространства имён, запрошенного через B<dlmopen>(3).

source: I<cookie> is a pointer to an identifier for this object. The identifier is provided to later calls to functions in the auditing library in order to identify this object. This identifier is initialized to point to object's link map, but the audit library can change the identifier to some other value that it may prefer to use to identify the object.
ru: Аргумент I<cookie> — указатель на идентификатор этого объекта. Идентификатор используется при последующих вызовах функций отслеживающей библиотеки для идентификации этого объекта. Данный идентификатор инициализируется указателем на карту ссылок объекта, но отслеживающая библиотека может изменить идентификатор на другое значение, которое ей удобней использовать для обращения к объекту.

source: As its return value, B<la_objopen>() returns a bit mask created by ORing zero or more of the following constants, which allow the auditing library to select the objects to be monitored by B<la_symbind*>():
ru: Функция B<la_objopen>() возвращает битовую маску, созданное с помощью сложения (OR) нуля или более следующих констант, которые позволяют отслеживающей библиотеке выбирать наблюдаемые объекты через B<la_symbind*>():

source: Audit symbol bindings to this object.
ru: Следить за символьными привязками этого объекта.

source: Audit symbol bindings from this object.
ru: Следить за символьными привязками из этого объекта.

source: A return value of 0 from B<la_objopen>() indicates that no symbol bindings should be audited for this object.
ru: Возвращаемое значение 0 из B<la_objopen>() указывает на то, что не нужно отслеживать символьные привязки этого объекта.

source: The dynamic linker invokes this function after any finalization code for the object has been executed, before the object is unloaded. The I<cookie> argument is the identifier obtained from a previous invocation of B<la_objopen>().
ru: Динамический компоновщик вызывает эту функцию после выполнения конечного кода (finalization code), но до выгрузки объекта. В I<cookie> задаётся идентификатор, полученный ранее из вызова B<la_objopen>().

source: In the current implementation, the value returned by B<la_objclose>() is ignored.
ru: В текущей реализации значение, возвращаемое B<la_objclose>(), игнорируется.

source: The dynamic linker invokes this function after all shared objects have been loaded, before control is passed to the application (i.e., before calling I<main>()). Note that I<main>() may still later dynamically load objects using B<dlopen>(3).
ru: Динамический компоновщик вызывает эту функцию после загрузки всех общих объектов, но до передачи управления приложению (то есть, до вызова I<main>()). Заметим, что I<main>() позднее всё ещё может динамически загрузить объекты с помощью B<dlopen>(3).

source: The dynamic linker invokes one of these functions when a symbol binding occurs between two shared objects that have been marked for auditing notification by B<la_objopen>(). The B<la_symbind32>() function is employed on 32-bit platforms; the B<la_symbind64>() function is employed on 64-bit platforms.
ru: Динамический компоновщик вызывает одну из этих функций при выполнении символьной привязки между двумя общими объектами, которые были помечены для уведомления функцией B<la_objopen>(). Функция B<la_symbind32>() применяется на 32-битных платформах; B<la_symbind64>() применяется на 64-битных платформах.

source: The I<sym> argument is a pointer to a structure that provides information about the symbol being bound. The structure definition is shown in I<E<lt>elf.hE<gt>>. Among the fields of this structure, I<st_value> indicates the address to which the symbol is bound.
ru: Аргумент I<sym> является указателем на структуру, которая содержит информацию о привязываемом символе. Определение структуры находится в I<E<lt>elf.hE<gt>>. Среди полей структуры есть поле I<st_value>, которое содержит адрес привязываемого символа.

source: The I<ndx> argument gives the index of the symbol in the symbol table of the bound shared object.
ru: В аргументе I<ndx> указывается индекс символа в таблице символов привязываемого общего объекта.

source: The I<refcook> argument identifies the shared object that is making the symbol reference; this is the same identifier that is provided to the B<la_objopen>() function that returned B<LA_FLG_BINDFROM>. The I<defcook> argument identifies the shared object that defines the referenced symbol; this is the same identifier that is provided to the B<la_objopen>() function that returned B<LA_FLG_BINDTO>.
ru: В аргументе I<refcook> указывается общий объект, который ссылается на символ; это тот же идентификатор, который указывается в функции B<la_objopen>(), возвращающей B<LA_FLG_BINDFROM>. В аргументе I<defcook> указывается общий объект, который определяет символ, на который производится ссылка; это тот же идентификатор, который указывается в функции B<la_objopen>(), возвращающей B<LA_FLG_BINDTO>.

source: The I<symname> argument points a string containing the name of the symbol.
ru: В аргументе I<symname> задаётся строка, содержащая имя символа.

source: The I<flags> argument is a bit mask that both provides information about the symbol and can be used to modify further auditing of this PLT (Procedure Linkage Table) entry. The dynamic linker may supply the following bit values in this argument:
ru: Аргумент I<flags> представляет собой битовую маску, которая содержит информацию о символе и может использоваться для изменения дальнейшего отслеживания этой записи PLT (Procedure Linkage Table). Динамический компоновщик может передавать следующие битовые значения в этом аргументе:

source: The binding resulted from a call to B<dlsym>(3).
ru: Привязка возникла из-за вызова B<dlsym>(3).

source: A previous B<la_symbind*>() call returned an alternate value for this symbol.
ru: Предыдущий вызов B<la_symbind*>() вернул альтернативное значение для этого символа.

source: By default, if the auditing library implements B<la_pltenter>() and B<la_pltexit>() functions (see below), then these functions are invoked, after B<la_symbind>(), for PLT entries, each time the symbol is referenced. The following flags can be ORed into I<*flags> to change this default behavior:
ru: По умолчанию, если в отслеживающей библиотеке реализованы функции B<la_pltenter>() и B<la_pltexit>() (смотрите ниже), то эти функции вызываются после B<la_symbind>() для записей PLT каждый раз при ссылке на символ. Следующие флаги могут объединяться с помощью OR в I<*flags> для изменения данного поведения по умолчанию:

source: Don't call B<la_pltenter>() for this symbol.
ru: Не вызывать B<la_pltenter>() для этого символа.

source: Don't call B<la_pltexit>() for this symbol.
ru: Не вызывать B<la_pltexit>() для этого символа.

source: The return value of B<la_symbind32>() and B<la_symbind64>() is the address to which control should be passed after the function returns. If the auditing library is simply monitoring symbol bindings, then it should return I<sym-E<gt>st_value>. A different value may be returned if the library wishes to direct control to an alternate location.
ru: Возвращаемое значение B<la_symbind32>() и B<la_symbind64>() представляет собой адрес, по которому нужно передать управление после возврата функций. Если отслеживающая библиотека просто наблюдает за привязкой символов, то должно возвращаться I<sym-E<gt>st_value>. Может возвращаться другое значение, если библиотека хочет передать управление в другое место.

source: The precise name and argument types for this function depend on the hardware platform. (The appropriate definition is supplied by I<E<lt>link.hE<gt>>.) Here is the definition for x86-32:
ru: Точное имя и типы аргументов данной функции зависят от аппаратной платформы (подходящее определение приведено в I<E<lt>link.hE<gt>>). Ниже показано определение для x86-32:

source: This function is invoked just before a PLT entry is called, between two shared objects that have been marked for binding notification.
ru: Эта функция вызывается до вызова записи PLT между двумя общими объектами, которые помечены для уведомления о привязке.

source: The I<sym>, I<ndx>, I<refcook>, I<defcook>, and I<symname> are as for B<la_symbind*>().
ru: Значение аргументов I<sym>, I<ndx>, I<refcook>, I<defcook> и I<symname> такое же как у B<la_symbind*>().

source: The I<regs> argument points to a structure (defined in I<E<lt>link.hE<gt>>) containing the values of registers to be used for the call to this PLT entry.
ru: Аргумент I<regs> указывает на структуру (определена в I<E<lt>link.hE<gt>>), содержащую значения регистров, которые будут использованы для вызова этой записи PLT.

source: The I<flags> argument points to a bit mask that conveys information about, and can be used to modify subsequent auditing of, this PLT entry, as for B<la_symbind*>().
ru: Аргумент I<flags> указывает на битовую маску, которая сообщает информацию и может использоваться для изменения последующего слежения за этой записью PLT; значения как у B<la_symbind*>().

source: The I<framesizep> argument points to a I<long\ int> buffer that can be used to explicitly set the frame size used for the call to this PLT entry. If different B<la_pltenter>() invocations for this symbol return different values, then the maximum returned value is used. The B<la_pltexit>() function is called only if this buffer is explicitly set to a suitable value.
ru: Аргумент I<framesizep> указывает на буфер I<long\ int>, который можно использовать для явного определения размера фрейма, используемого для вызова этой записи PLT. Если другие вызовы B<la_pltenter>() для этого символа возвращают другие значения, то используется максимальное полученное значение. Функция B<la_pltexit>() вызывается только, если этот буфер явно устанавливает подходящее значение.

source: The return value of B<la_pltenter>() is as for B<la_symbind*>().
ru: Возвращаемое B<la_pltenter>() значение подобно B<la_symbind*>().

source: This function is called when a PLT entry, made between two shared objects that have been marked for binding notification, returns. The function is called just before control returns to the caller of the PLT entry.
ru: Эта функция вызывается после завершения вызова записи PLT, выполняемой между двумя общими объектами, которые были помечены для уведомления при привязке. Функция вызывается перед передачей управления из записи PLT вызывающему.

source: The I<inregs> argument points to a structure (defined in I<E<lt>link.hE<gt>>) containing the values of registers used for the call to this PLT entry. The I<outregs> argument points to a structure (defined in I<E<lt>link.hE<gt>>) containing return values for the call to this PLT entry. These values can be modified by the caller, and the changes will be visible to the caller of the PLT entry.
ru: Аргумент I<inregs> указывает на структуру (определена в I<E<lt>link.hE<gt>>), содержащую значения регистров, используемых для вызова этой записи PLT. Аргумент I<outregs> указывает на структуру (определена в I<E<lt>link.hE<gt>>), содержащую значения для вызова в эту запись PLT. Эти значения могут изменяться вызывающим и изменения будут видимы вызывающему запись PLT.

source: In the current GNU implementation, the return value of B<la_pltexit>() is ignored.
ru: В текущей реализации GNU возвращаемое значение B<la_pltexit>() игнорируется.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: This API is nonstandard, but very similar to the Solaris API, described in the Solaris I<Linker and Libraries Guide>, in the chapter I<Runtime Linker Auditing Interface>.
ru: Данный API не стандартен, но очень похож на Solaris API, описанный в Solaris I<Linker and Libraries Guide> в главе I<Runtime Linker Auditing Interface>.

source: Note the following differences from the Solaris dynamic linker auditing API:
ru: Отметим следующие отличия API динамического компоновщика в Solaris:

source: The Solaris B<la_objfilter>() interface is not supported by the GNU implementation.
ru: Интерфейс Solaris B<la_objfilter>() не поддерживается в реализации GNU.

source: The Solaris B<la_symbind32>() and B<la_pltexit>() functions do not provide a I<symname> argument.
ru: В функциях Solaris B<la_symbind32>() и B<la_pltexit>() нет аргумента I<symname>.

source: The Solaris B<la_pltexit>() function does not provide I<inregs> and I<outregs> arguments (but does provide a I<retval> argument with the function return value).
ru: В функции Solaris B<la_pltexit>() нет аргументов I<inregs> и I<outregs> (но есть аргумент I<retval> со значением, возвращаемым функцией).

source: In glibc versions up to and include 2.9, specifying more than one audit library in B<LD_AUDIT> results in a run-time crash. This is reportedly fixed in glibc 2.10.
ru: В glibc до версии 2.9 включительно, указание более одной отслеживающей библиотеки в B<LD_AUDIT> приводит к падению во время выполнения. Это исправлено в glibc 2.10.

source: EXAMPLE
ru: ПРИМЕР

source: raw - Linux IPv4 raw sockets
ru: raw - неструктурированные сокеты IPv4 в Linux

source: Raw sockets allow new IPv4 protocols to be implemented in user space. A raw socket receives or sends the raw datagram not including link level headers.
ru: Неструктурированные (raw) сокеты позволяют реализовать новые протоколы IPv4 в пространстве пользователя. Через неструктурированный сокет получают или посылают необработанные датаграммы, не включающие в себя заголовки уровня соединения (link level).

source: The IPv4 layer generates an IP header when sending a packet unless the B<IP_HDRINCL> socket option is enabled on the socket. When it is enabled, the packet must contain an IP header. For receiving, the IP header is always included in the packet.
ru: Уровень IPv4 генерирует заголовок IP при посылке пакета, если только для сокета не включён параметр B<IP_HDRINCL>. Если он включён, то пакет должен содержать заголовок IP. Принимаемые пакеты всегда содержат заголовок IP.

source: In order to create a raw socket, a process must have the B<CAP_NET_RAW> capability in the user namespace that governs its network namespace.
ru: Для создания неструктурированного сокета процесс должен иметь мандат B<CAP_NET_RAW> в пользовательском пространстве имён, определяемом по его сетевому пространству имён.

source: All packets or errors matching the I<protocol> number specified for the raw socket are passed to this socket. For a list of the allowed protocols, see the IANA list of assigned protocol numbers at E<.UR http://www.iana.org/assignments/protocol-numbers/> E<.UE> and B<getprotobyname>(3).
ru: Все пакеты или ошибки, совпадающие с номером протокола I<protocol>, указанным неструктурированному сокету, передаются этому сокету. Список допустимых протоколов назначается списком IANA E<.UR http://www.iana.org/assignments/protocol-numbers/> E<.UE>и содержится в B<getprotobyname>(3).
