Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: Each I<rm_so> element that is not -1 indicates the start offset of the next largest substring match within the string. The relative I<rm_eo> element indicates the end offset of the match, which is the offset of the first character after the matching text.
ru: Каждый элемент I<rm_so>, не равный -1, показывает начальное смещение следующего совпадения наибольшей подстроки внутри заданной строки. Относительный элемент I<rm_eo> указывает на смещение конца совпадения, которое является первым символом после совпавшего текста.

source: POSIX error reporting
ru: Сообщение об ошибках POSIX

source: B<regerror>() is used to turn the error codes that can be returned by both B<regcomp>() and B<regexec>() into error message strings.
ru: Функция B<regerror> используется для преобразования кодов ошибок, которые могут быть получены от B<regcomp>() и B<regexec>(), в строки сообщений об ошибках.

source: B<regerror>() is passed the error code, I<errcode>, the pattern buffer, I<preg>, a pointer to a character string buffer, I<errbuf>, and the size of the string buffer, I<errbuf_size>. It returns the size of the I<errbuf> required to contain the null-terminated error message string. If both I<errbuf> and I<errbuf_size> are nonzero, I<errbuf> is filled in with the first I<errbuf_size - 1> characters of the error message and a terminating null byte (\(aq\e0\(aq).
ru: В B<regerror> передаются: код ошибки I<errcode>, буферный шаблон I<preg>, указатель на символьный буфер строки I<errbuf> и размер буфера строки I<errbuf_size>. Функция возвращает размер I<errbuf>, который требуется для сохранения сообщения об ошибке в виде строки, оканчивающейся null. Если и I<errbuf>, и I<errbuf_size> не равны нулю, то I<errbuf> заполняется первыми I<errbuf_size - 1> символами сообщения об ошибке и завершается байтом null (\(aq\e0\(aq).

source: POSIX pattern buffer freeing
ru: Освобождение буфера шаблона POSIX

source: Supplying B<regfree>() with a precompiled pattern buffer, I<preg> will free the memory allocated to the pattern buffer by the compiling process, B<regcomp>().
ru: Функция B<regfree>() освобождает память, отведённую буферному шаблону I<preg> во время процесса компиляции с помощью B<regcomp>().

source: B<regcomp>() returns zero for a successful compilation or an error code for failure.
ru: Функция B<regcomp>() возвращает ноль при успешной компиляции или в противном случае код ошибки.

source: B<regexec>() returns zero for a successful match or B<REG_NOMATCH> for failure.
ru: Функция B<regexec>() возвращает ноль при совпадении или B<REG_NOMATCH>, если совпадений не было.

source: The following errors can be returned by B<regcomp>():
ru: Функция B<regcomp>() может возвращать следующие ошибки:

source: Invalid use of back reference operator.
ru: Неправильное использование оператора обратных ссылок.

source: Invalid use of pattern operators such as group or list.
ru: Неправильное использование операторов шаблона, таких, как операторы группы или списка.

source: Invalid use of repetition operators such as using \(aq*\(aq as the first character.
ru: Неправильное использование операторов повторения, например, использование «*» в качестве первого символа.

source: Un-matched brace interval operators.
ru: Непарные скобки в операторах интервала.

source: Un-matched bracket list operators.
ru: Непарные квадратные скобки в операторах списка.

source: Invalid collating element.
ru: Неправильный элемент сортировки.

source: Unknown character class name.
ru: Неизвестное имя класса символов.

source: Nonspecific error. This is not defined by POSIX.2.
ru: Потенциальная ошибка. Не определена в POSIX.2.

source: Trailing backslash.
ru: Конечная обратная косая черта.

source: Un-matched parenthesis group operators.
ru: Непарные круглые скобки в операторах группировки.

source: Invalid use of the range operator; for example, the ending point of the range occurs prior to the starting point.
ru: Неправильное использование оператора области: например, конец области появляется прежде её начала.

source: Compiled regular expression requires a pattern buffer larger than 64\ kB. This is not defined by POSIX.2.
ru: Скомпилированное регулярное выражение требует буферный шаблон размером, большим 64\ Кб. Это не определено в POSIX.2.

source: The regex routines ran out of memory.
ru: Для процедур регулярных выражений закончилась память.

source: Invalid back reference to a subexpression.
ru: Неправильная обратная ссылка на подвыражение.

source: The glibc manual section, I<Regular Expressions>
ru: Раздел руководства glibc I<Regular Expressions>

source: res_ninit, res_nclose, res_nquery, res_nsearch, res_nquerydomain, res_nmkquery, res_nsend, res_init, res_query, res_search, res_querydomain, res_mkquery, res_send, dn_comp, dn_expand - resolver routines
ru: res_ninit, res_nclose, res_nquery, res_nsearch, res_nquerydomain, res_nmkquery, res_nsend, res_init, res_query, res_search, res_querydomain, res_mkquery, res_send, dn_comp, dn_expand - процедуры определителя имён

source: Deprecated
ru: Устаревшие

source: Link with I<-lresolv>.
ru: Компонуется при указании параметра I<-lresolv>.

source: B<Note:> This page is incomplete (various resolver functions provided by glibc are not described) and likely out of date.
ru: B<Замечание:> Данная страница не полна (не описаны различные функции определителя, предоставляемые glibc) и, вероятно, содержит устаревшую информацию.

source: The functions described below make queries to and interpret the responses from Internet domain name servers.
ru: Описываемые далее функции выполняют запросы и обрабатывают ответы, полученные от серверов доменных имён Интернет.

source: The API consists of a set of more modern, reentrant functions and an older set of nonreentrant functions that have been superseded. The traditional resolver interfaces such as B<res_init>() and B<res_query>() use some static (global) state stored in the I<_res> structure, rendering these functions non-thread-safe. BIND 8.2 introduced a set of new interfaces B<res_ninit>(), B<res_nquery>(), and so on, which take a I<res_state> as their first argument, so you can use a per-thread resolver state.
ru: В программный интерфейс входят как современные, реентерабельные функции, так и устаревшие не реентерабельные. Функции B<res_init>() и B<res_query>() из обычного интерфейса определителя использует статическое (глобальное) состояние, хранимое в структуре I<_res>, что делает эти функции небезопасным при использовании в нитях. В BIND 8.2 появился набор новых интерфейсов B<res_ninit>(), B<res_nquery>() и т. п., в котором I<res_state> указывается в третьем аргументе, что позволяет использовать отдельное состояние определителя в каждой нити.

source: The B<res_ninit>() and B<res_init>() functions read the configuration files (see B<resolv.conf>(5)) to get the default domain name and name server address(es). If no server is given, the local host is tried. If no domain is given, that associated with the local host is used. It can be overridden with the environment variable B<LOCALDOMAIN>. B<res_ninit>() or B<res_init>() is normally executed by the first call to one of the other functions. Every call to B<res_ninit>() requires a corresponding call to B<res_nclose>() to free memory allocated by B<res_ninit>() and subsequent calls to B<res_nquery>().
ru: Функции B<res_ninit>() и B<res_init>() читают файлы настройки (смотрите B<resolv.conf>(5)) для получения имени домена по умолчанию и адреса(-ов) сервера имён. Если серверы не заданы, то используется локальный узел. Если не задан домен, то используется домен локального узла. Это может быть изменено через переменную окружения B<LOCALDOMAIN>. Обычно, функция B<res_ninit>() или B<res_init>() выполняется первой из других функций. Каждый вызов B<res_nquery>() требует соответствующего вызова B<res_nclose>() для освобождения памяти, выделенной B<res_ninit>() и последующими вызовами B<res_nquery>().

source: The B<res_nquery>() and B<res_query>() functions query the name server for the fully qualified domain name I<name> of specified I<type> and I<class>. The reply is left in the buffer I<answer> of length I<anslen> supplied by the caller.
ru: Функции B<res_nquery>() и B<res_query>() запрашивают у сервера имён полное доменное имя I<name> заданного типа I<type> и класса I<class>. Ответ помещается в буфер I<answer> длиной I<anslen>, указанный вызывающим.

source: The B<res_nsearch>() and B<res_search>() functions make a query and waits for the response like B<res_nquery>() and B<res_query>(), but in addition they implement the default and search rules controlled by B<RES_DEFNAMES> and B<RES_DNSRCH> (see description of I<_res> options below).
ru: Функции B<res_nsearch>() и B<res_search>() отправляют запрос и ждут ответа, подобно B<res_nquery>() и B<res_query>(), но при этом ещё учитывают правила работы и поиска по умолчанию, настраиваемые через B<RES_DEFNAMES> и B<RES_DNSRCH> (смотрите ниже описание параметров I<_res>).

source: The B<res_nquerydomain>() and B<res_querydomain>() functions make a query using B<res_nquery>()/B<res_query>() on the concatenation of I<name> and I<domain>.
ru: Функции B<res_nquerydomain>() и B<res_querydomain>() отправляют запрос с помощью B<res_nquery>()/B<res_query>() с объединённым I<name> и I<domain>.

source: The following functions are lower-level routines used by B<res_query>()/B<res_query>().
ru: Следующие функции являются процедурами низкого уровня, которые используются B<res_nquery>()/B<res_query>().

source: The B<res_nmkquery>() and B<res_mkquery>() functions construct a query message in I<buf> of length I<buflen> for the domain name I<dname>. The query type I<op> is one of the following (typically B<QUERY>):
ru: Функции B<res_nmkquery>() и B<res_mkquery>() создают сообщение-запрос в I<buf> длиной I<buflen> для имени домена I<dname>. Типом запроса I<op> может быть:

source: Standard query.
ru: Стандартный запрос.

source: Inverse query. This option was removed in glibc 2.26, since it has not been supported by DNS servers for a very long time.
ru: Обратный запрос. Это значение было удалено в glibc 2.26, так как давно не поддерживалось серверами DNS.

source: Notify secondary of SOA (Start of Authority) change.
ru: Уведомить об изменении SOA (Start of Authority) вторичный сервер.

source: I<newrr> is currently unused.
ru: Параметр I<newrr> в настоящее время не используется.

source: The B<res_nsend>() and B<res_send>() function send a preformatted query given in I<msg> of length I<msglen> and returns the answer in I<answer> which is of length I<anslen>. They will call B<res_ninit>()/B<res_init>() if it has not already been called.
ru: Функции B<res_nsend>() и B<res_send>() посылают заранее созданный запрос, указанный в I<msg> длиной I<msglen>, и возвращают ответ в I<answer> длиной I<anslen>. Вызывают функцию B<res_ninit>()/B<res_init>(), если этого ещё не было.

source: The B<dn_comp>() function compresses the domain name I<exp_dn> and stores it in the buffer I<comp_dn> of length I<length>. The compression uses an array of pointers I<dnptrs> to previously compressed names in the current message. The first pointer points to the beginning of the message and the list ends with NULL. The limit of the array is specified by I<lastdnptr>. If I<dnptr> is NULL, domain names are not compressed. If I<lastdnptr> is NULL, the list of labels is not updated.
ru: Функция B<dn_comp>() сжимает имя домена I<exp_dn> и сохраняет его в буфере I<comp_dn> длиной I<length>. Сжатие использует массив указателей I<dnptrs> на предварительно сжатые имена в текущем сообщении. Первый указатель обозначает начало сообщения, а весь список оканчивается NULL. Предел массива определяется в I<lastdnptr>. Если I<dnptr> равно NULL, то имя домена не является сжатым. Если I<lastdnptr> равно NULL, то список меток не обновляется.

source: The B<dn_expand>() function expands the compressed domain name I<comp_dn> to a full domain name, which is placed in the buffer I<exp_dn> of size I<length>. The compressed name is contained in a query or reply message, and I<msg> points to the beginning of the message.
ru: Функция B<dn_expand>() раскрывает сжатое имя домена I<comp_dn> до полного доменного имени, которое затем сохраняется в буфере I<exp_dn> длиной I<length>. Сжатое имя содержится в запросе или ответном сообщении, а I<msg> указывает на начало сообщения.

source: The resolver routines use configuration and state information contained in a I<__res_state> structure (either passed as the I<statep> argument, or in the global variable I<_res>, in the case of the older nonreentrant functions). The only field of this structure that is normally manipulated by the user is the I<options> field. This field can contain the bitwise "OR" of the following options:
ru: Процедуры определителя используют настройки и информацию о состоянии из структуры I<__res_state> (переданной в аргументе I<statep> или в глобальной переменной I<_res>, если используются старые не реентерабельные функции). Обычно, пользователь изменяет в этой структуре только поле I<options>. Данное поле может содержать следующие значения, объединённые с помощью «OR»:

source: True if B<res_ninit>() or B<res_init>() has been called.
ru: Истинно, если уже вызывалась функция B<res_ninit>() или B<res_init>().

source: Print debugging messages. This option is available only if glibc was built with debugging enabled, which is not the default.
ru: Печатать отладочные сообщения. Этот параметр доступен только, если glibc собрана с включённой отладкой, которая по умолчанию выключена.

source: B<RES_AAONLY> (unimplemented; deprecated in glibc 2.25)
ru: B<RES_AAONLY> (не реализован; устарел в glibc 2.25)

source: Accept authoritative answers only. B<res_send>() continues until it finds an authoritative answer or returns an error. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
ru: Принимать только достоверные ответы. Функция B<res_send>() продолжает работать, пока не найдёт достоверный ответ или возвращает ошибку. Данный параметр имелся, но не был реализован в glibc до версии 2.24; начиная с glibc 2.25 он устарел и его при его использовании выдаётся предупреждение.

source: Use TCP connections for queries rather than UDP datagrams.
ru: использовать TCP-соединение для запросов вместо датаграмм UDP.

source: B<RES_PRIMARY> (unimplemented; deprecated in glibc 2.25)
ru: B<RES_PRIMARY> (не реализован; устарел в glibc 2.25)

source: Query primary domain name server only. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
ru: Запрашивать только первичный сервер имён. Данный параметр имелся, но не был реализован в glibc до версии 2.24; начиная с glibc 2.25 он устарел и его при его использовании выдаётся предупреждение.

source: Ignore truncation errors. Don't retry with TCP.
ru: Игнорировать ошибки обрезания. Не пытаться повторить запрос с помощью TCP.

source: Set the recursion desired bit in queries. Recursion is carried out by the domain name server, not by B<res_send>(). [Enabled by default].
ru: Установить в запросах бит рекурсии. Рекурсия выполняется сервером доменных имён, а не функцией B<res_send>() (включено по умолчанию).

source: If set, B<res_search>() will append the default domain name to single component names\(emthat is, those that do not contain a dot. [Enabled by default].
ru: Если указан, то B<res_search>() будет добавлять имя домена по умолчанию к именам с одним компонентом в имени (не содержащим точек) (включено по умолчанию).

source: Used with B<RES_USEVC> to keep the TCP connection open between queries.
ru: Используется вместе с B<RES_USEVC> для поддержания TCP-соединения запросов между ответами.

source: If set, B<res_search>() will search for hostnames in the current domain and in parent domains. This option is used by B<gethostbyname>(3). [Enabled by default].
ru: Если указан, то B<res_search>() будет искать имена узлов в текущем и родительском домене. Этот параметр используется B<gethostbyname>(3) (включено по умолчанию).

source: Accept a response from a wrong server. This can be used to detect potential security hazards, but you need to compile glibc with debugging enabled and use B<RES_DEBUG> option (for debug purpose only).
ru: Принимать ответ от ошибочного сервера. Может использоваться для обнаружения потенциальных угроза безопасности, но требует перекомпиляции glibc с включённой отладкой и параметром B<RES_DEBUG> (только для отладки).

source: Accept a response which contains a wrong query. This can be used to detect potential security hazards, but you need to compile glibc with debugging enabled and use B<RES_DEBUG> option (for debug purpose only).
ru: Принимать ответ, который содержит некорректный запрос. Может использоваться для обнаружения потенциальных угроза безопасности, но требует перекомпиляции glibc с включённой отладкой и параметром B<RES_DEBUG> (только для отладки).

source: Disable usage of B<HOSTALIASES> environment variable.
ru: Отключить использование переменной окружения B<HOSTALIASES>.

source: Try an AAAA query before an A query inside the B<gethostbyname>(3) function, and map IPv4 responses in IPv6 "tunneled form" if no AAAA records are found but an A record set exists. Since glibc 2.25, this option is deprecated, and its usage produces a warning; applications should use B<getaddrinfo>(3), rather than B<gethostbyname>(3).
ru: Пытаться выполнить запрос AAAA раньше запроса A внутри функции B<gethostbyname>(3), и отображать ответы IPv4 в «туннелированной форме» IPv6, если записи AAAA не были обнаружены, но есть запись типа A. Начиная с glibc 2.25 этот параметр считается устаревшим и при его использовании выдаётся предупреждение; приложения должны использовать B<getaddrinfo>(3), а не B<gethostbyname>(3).

source: Causes round-robin selection of name servers from among those listed. This has the effect of spreading the query load among all listed servers, rather than having all clients try the first listed server first every time.
ru: Включить циклический выбор среди имеющихся серверов имён. Это приводит к распределению нагрузки среди серверов и использование каждый раз только первого сервера всеми клиентами не происходит.

source: B<RES_NOCHECKNAME> (unimplemented; deprecated in glibc 2.25)
ru: B<RES_NOCHECKNAME> (не реализован; устарел в glibc 2.25)

source: Disable the modern BIND checking of incoming hostnames and mail names for invalid characters such as underscore (_), non-ASCII, or control characters. This option was present in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
ru: Выключить в современном BIND проверку недопустимых символов в поступающих именах узлов и почтовых именах, таких как символы подчёркивания (_), не-ASCII или управляющие символы. Данный параметр имелся в glibc до версии 2.24; начиная с glibc 2.25 он устарел и его при его использовании выдаётся предупреждение.

source: B<RES_KEEPTSIG> (unimplemented; deprecated in glibc 2.25)
ru: B<RES_KEEPTSIG> (не реализован; устарел в glibc 2.25)

source: Do not strip TSIG records. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
ru: Не обрезать записи TSIG. Данный параметр имелся, но не был реализован в glibc до версии 2.24; начиная с glibc 2.25 он устарел и его при его использовании выдаётся предупреждение.

source: B<RES_BLAST (unimplemented; deprecated in glibc 2.25)>
ru: B<RES_BLAST> (не реализован; устарел в glibc 2.25)

source: Send each query simultaneously and recursively to all servers. This option was present but unimplemented in glibc until version 2.24; since glibc 2.25, it is deprecated, and its usage produces a warning.
ru: Посылать каждый запрос одновременно и рекурсивно всем серверам. Данный параметр имелся, но не был реализован в glibc до версии 2.24; начиная с glibc 2.25 он устарел и его при его использовании выдаётся предупреждение.

source: B<RES_USEBSTRING> (glibc 2.3.4 to 2.24)
ru: B<RES_USEBSTRING> (glibc 2.3.4 по 2.24)

source: Make reverse IPv6 lookups using the bit-label format described in RFC 2673; if this option is not set (which is the default), then nibble format is used. This option was removed in glibc 2.25, since it relied on a backward-incompatible DNS extension that was never deployed on the Internet.
ru: Выполнить поиск обратной записи IPv6 с помощью формата значимых битов, описанного в RFC\ 2673; если этот параметр не задан (по умолчанию), то используется полубайтовый формат. Данный параметр был удалён в glibc 2.25, так как он полагается на обратно несовместимое расширение DNS, которое никогда не разворачивалось в Интернете.

source: B<RES_NOIP6DOTINT> (glibc 2.24 and earlier)
ru: B<RES_NOIP6DOTINT> (glibc 2.24 и старее)

source: Use I<ip6.arpa> zone in IPv6 reverse lookup instead of I<ip6.int>, which is deprecated since glibc 2.3.4. This option is present in glibc up to and including version 2.24, where it is enabled by default. In glibc 2.25, this option was removed.
ru: Использовать зону I<ip6.arpa> при поиске обратной записи IPv6 вместо I<ip6.int>, которая устарела начиная с glibc 2.3.4. Данный параметр существует в glibc по версию 2.24 включительно (и включён по умолчанию). Из glibc 2.25 этот параметр был удалён.

source: B<RES_USE_EDNS0> (since glibc 2.6)
ru: B<RES_USE_EDNS0> (начиная с glibc 2.6)

source: Enables support for the DNS extensions (EDNS0) described in RFC 2671.
ru: Включить поддержку расширений DNS (EDNS0), описанных в RFC\ 2671.

source: B<RES_SNGLKUP> (since glibc 2.10)
ru: B<RES_SNGLKUP> (начиная с glibc 2.10)

source: By default, glibc performs IPv4 and IPv6 lookups in parallel since version 2.9. Some appliance DNS servers cannot handle these queries properly and make the requests time out. This option disables the behavior and makes glibc perform the IPv6 and IPv4 requests sequentially (at the cost of some slowdown of the resolving process).
ru: По умолчанию, glibc начиная с версии 2.9 выполняет поиск по IPv4 и IPv6 параллельно. Некоторые приложения DNS-серверов не могут обработать такие запросы должным образом и делают паузу между ответами на запрос. Этот параметр отключает данное поведение, что заставляет glibc делать запросы IPv6 и IPv4 последовательно (что замедляет процесс определения имени).

source: When B<RES_SNGLKUP> option is enabled, opens a new socket for the each request.
ru: Открывать для каждого запроса новый сокет, если указано значение B<RES_SNGLKUP>.

source: Use DNSSEC with OK bit in OPT record. This option implies B<RES_USE_EDNS0>.
ru: Использовать DNSSEC с битом OK в записи OPT. Это значение подразумевает B<RES_USE_EDNS0>.

source: Do not look up unqualified name as a top-level domain (TLD).
ru: Не искать неполное имя как домен верхнего уровня (TLD).

source: Default option which implies: B<RES_RECURSE>, B<RES_DEFNAMES>, B<RES_DNSRCH> and B<RES_NOIP6DOTINT>.
ru: Значение по умолчанию подразумевает: B<RES_RECURSE>, B<RES_DEFNAMES>, B<RES_DNSRCH> and B<RES_NOIP6DOTINT>.

source: The B<res_ninit>() and B<res_init>() functions return 0 on success, or -1 if an error occurs.
ru: При успешном выполнении функции B<res_ninit>() и B<res_init>() возвращают 0, и -1 при ошибке.

source: The B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>(), B<res_querydomain>(), B<res_nmkquery>(), B<res_mkquery>(), B<res_nsend>(), and B<res_send>() functions return the length of the response, or -1 if an error occurs.
ru: Функции B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>(), B<res_querydomain>(), B<res_nmkquery>(), B<res_mkquery>(), B<res_nsend>() и B<res_send>() возвращают длину ответа или -1 при ошибке.
