Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The values specified in I<addr> and I<size> should be multiples of the system page size. If they are not, then the kernel rounds I<both> values I<down> to the nearest multiple of the page size.
ru: Значения, указанные в I<addr> и I<size>, должны быть кратны размеру системной страницы. Если это не так, то ядро округляет I<оба> значения I<в меньшую сторону> до ближайшего числа, кратного размеру страницы.

source: The I<prot> argument must be specified as 0.
ru: Значение аргумента I<prot> должно быть 0.

source: The I<flags> argument has the same meaning as for B<mmap>(2), but all flags other than B<MAP_NONBLOCK> are ignored.
ru: Аргумент I<flags> предназначен для того же, что и в B<mmap>(2), но все флаги, кроме B<MAP_NONBLOCK>, игнорируются.

source: On success, B<remap_file_pages>() returns 0. On error, -1 is returned, and I<errno> is set appropriately.
ru: При удачном выполнении B<remap_file_pages>() возвращается 0. При ошибке возвращается -1, а значение I<errno> устанавливается соответствующим образом.

source: I<addr> does not refer to a valid mapping created with the B<MAP_SHARED> flag.
ru: Значение I<addr> не ссылается на допустимое отображение, созданное с флагом B<MAP_SHARED>.

source: I<addr>, I<size>, I<prot>, or I<pgoff> is invalid.
ru: Некорректное значение в I<addr>, I<size>, I<prot> или I<pgoff>.

source: The B<remap_file_pages>() system call appeared in Linux 2.5.46; glibc support was added in version 2.3.3.
ru: Системный вызов B<remap_file_pages>() появился в Linux 2.5.46; поддержка в glibc началась с версии 2.3.3.

source: The B<remap_file_pages>() system call is Linux-specific.
ru: Системный вызов B<remap_file_pages>() есть только в Linux.

source: Since Linux 2.6.23, B<remap_file_pages>() creates non-linear mappings only on in-memory filesystems such as B<tmpfs>(5), hugetlbfs or ramfs. On filesystems with a backing store, B<remap_file_pages>() is not much more efficient than using B<mmap>(2) to adjust which parts of the file are mapped to which addresses.
ru: Начиная с Linux 2.6.23, B<remap_file_pages>() создаёт нелинейные отображения только для файловых систем в оперативной памяти, таких как B<tmpfs>(5), hugetlbfs или ramfs. Для файловых систем с хранилищем B<remap_file_pages>() не намного эффективнее чем B<mmap>(2), так как рассчитывает адреса для частей файла.

source: rename, renameat, renameat2 - change the name or location of a file
ru: rename, renameat, renameat2 - изменяет имя или расположение файла

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>stdio.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> >/* определения констант AT_* */ B<#include E<lt>stdio.hE<gt>>

source: B<rename>() renames a file, moving it between directories if required. Any other hard links to the file (as created using B<link>(2)) are unaffected. Open file descriptors for I<oldpath> are also unaffected.
ru: Вызов B<rename>() переименовывает файл и, если требуется, перемещает его из одного каталога в другой. Все прочие жёсткие ссылки на файл (созданные с помощью B<link>(2)), не изменяются. Открытые файловые дескрипторы на I<oldpath> также не изменяются.

source: Various restrictions determine whether or not the rename operation succeeds: see ERRORS below.
ru: На успешность выполнения операции переименования влияют различные ограничения: смотрите ОШИБКИ далее.

source: If I<newpath> already exists, it will be atomically replaced, so that there is no point at which another process attempting to access I<newpath> will find it missing. However, there will probably be a window in which both I<oldpath> and I<newpath> refer to the file being renamed.
ru: Если I<newpath> уже существует, то он будет атомарно перезаписан так, что другой процесс, пытающийся в этот момент обратиться к I<newpath>, не сможет определить его временное отсутствие. Однако будет промежуток времени, когда I<oldpath> и I<newpath> указывают на один файл.

source: If I<oldpath> and I<newpath> are existing hard links referring to the same file, then B<rename>() does nothing, and returns a success status.
ru: Если I<oldpath> и I<newpath> являются жёсткими ссылками на один и тот же файл, то B<rename>() ничего не делает и возвращает код успешного выполнения.

source: If I<newpath> exists but the operation fails for some reason, B<rename>() guarantees to leave an instance of I<newpath> in place.
ru: Если I<newpath> существует, но операция завершается ошибкой, то B<rename>() гарантирует, что I<newpath> останется нетронутым.

source: I<oldpath> can specify a directory. In this case, I<newpath> must either not exist, or it must specify an empty directory.
ru: В I<oldpath> может быть указан каталог. В этом случае каталог в I<newpath> должен или не существовать, или должен быть пуст.

source: If I<oldpath> refers to a symbolic link, the link is renamed; if I<newpath> refers to a symbolic link, the link will be overwritten.
ru: Если I<oldpath> является символьной ссылкой, то она переименовывается; если I<newpath> является символьной ссылкой, то будет вновь записан файл, на который она указывает.

source: The B<renameat>() system call operates in exactly the same way as B<rename>(), except for the differences described here.
ru: Системный вызов B<renameat>() работает также как системный вызов B<rename>(), за исключением случаев, описанных далее.

source: If the pathname given in I<oldpath> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<olddirfd> (rather than relative to the current working directory of the calling process, as is done by B<rename>() for a relative pathname).
ru: Если в I<oldpath> указан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<olddirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<rename>()).

source: If I<oldpath> is relative and I<olddirfd> is the special value B<AT_FDCWD>, then I<oldpath> is interpreted relative to the current working directory of the calling process (like B<rename>()).
ru: Если в I<oldpath> указан относительный путь и I<olddirfd> равно специальному значению B<AT_FDCWD>, то I<oldpath> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<rename>()).

source: If I<oldpath> is absolute, then I<olddirfd> is ignored.
ru: Если в I<oldpath> указан абсолютный путь, то I<olddirfd> игнорируется.

source: The interpretation of I<newpath> is as for I<oldpath>, except that a relative pathname is interpreted relative to the directory referred to by the file descriptor I<newdirfd>.
ru: Значение I<newpath> интерпретируется как I<oldpath>, за исключением того, что относительный путь интерпретируется относительно каталога, на который ссылается файловый дескриптор I<newdirfd>.

source: See B<openat>(2) for an explanation of the need for B<renameat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<renameat>().

source: B<renameat2>() has an additional I<flags> argument. A B<renameat2>() call with a zero I<flags> argument is equivalent to B<renameat>().
ru: Вызов B<renameat2>() имеет дополнительный аргумент I<flags>. Если значение I<flags> равно нулю, то B<renameat2>() эквивалентен B<renameat>().

source: The I<flags> argument is a bit mask consisting of zero or more of the following flags:
ru: Аргумент I<flags> является битовой маской, состоящей из нуля или более следующих флагов:

source: Atomically exchange I<oldpath> and I<newpath>. Both pathnames must exist but may be of different types (e.g., one could be a non-empty directory and the other a symbolic link).
ru: Атомарно обменять I<oldpath> и I<newpath>. Оба пути должны существовать, но могут быть различных типов (например, один может быть непустым каталогом, а другой символической ссылкой).

source: Don't overwrite I<newpath> of the rename. Return an error if I<newpath> already exists.
ru: Не перезаписывать I<newpath>. Возвращать ошибку, если I<newpath> уже существует.

source: B<RENAME_NOREPLACE> can't be employed together with B<RENAME_EXCHANGE>.
ru: B<RENAME_NOREPLACE> не может быть применен вместе с B<RENAME_EXCHANGE>.

source: B<RENAME_NOREPLACE> requires support from the underlying filesystem. Support for various filesystems was added as follows:
ru: Для B<RENAME_NOREPLACE> требуется поддержка в файловой системе; она есть только у нескольких файловых систем:

source: ext4 (Linux 3.15);
ru: ext4 (начиная с Linux 3.15);

source: btrfs, shmem, and cifs (Linux 3.17);
ru: btrfs, shmem, и cifs (начиная с Linux 3.17);

source: xfs (Linux 4.0);
ru: xfs (начиная с Linux 4.0);

source: Support for many other filesystems was added in Linux 4.9, including etx2, minix, reiserfs, jfs, vfat, and bpf.
ru: Поддержка для других файловых систем была добавлена в Linux 4.9: etx2, minix, reiserfs, jfs, vfat и bpf.

source: B<RENAME_WHITEOUT> (since Linux 3.18)
ru: B<RENAME_WHITEOUT> (начиная с Linux 3.18)

source: This operation makes sense only for overlay/union filesystem implementations.
ru: Эта операция применима только для реализаций оверлейных/объединённых файловых систем.

source: Specifying B<RENAME_WHITEOUT> creates a "whiteout" object at the source of the rename at the same time as performing the rename. The whole operation is atomic, so that if the rename succeeds then the whiteout will also have been created.
ru: При указании B<RENAME_WHITEOUT> для источника переименования одновременно с выполнением переименования создаётся «замазанный» объект (whiteout object). Вся операция атомарна, и при успешном выполнении переименования создаётся и замазка.

source: A "whiteout" is an object that has special meaning in union/overlay filesystem constructs. In these constructs, multiple layers exist and only the top one is ever modified. A whiteout on an upper layer will effectively hide a matching file in the lower layer, making it appear as if the file didn't exist.
ru: «Замазка» — это объект, имеющий специальное предназначение в оверлейных/объединённых файловых системах. В них существует несколько слоёв, и для изменения доступен только верхний. Замазка на верхнем слое эффективно скрывает файл из нижнего слоя, и кажется, что файл не существует.

source: When a file that exists on the lower layer is renamed, the file is first copied up (if not already on the upper layer) and then renamed on the upper, read-write layer. At the same time, the source file needs to be "whiteouted" (so that the version of the source file in the lower layer is rendered invisible). The whole operation needs to be done atomically.
ru: Когда переименовывается файл, существующий в нижнем слое, то первым действием он переписывается (если его уже нет в верхнем слое) и переименовывается в верхнем, доступном на чтение-запись слое. Одновременно с этим, исходный файл требуется «замазать» (что исходный файл в нижнем слое отражался невидимым). Вся операция должна выполняться атомарно.

source: When not part of a union/overlay, the whiteout appears as a character device with a {0,0} device number. (Note that other union/overlay implementations may employ different methods for storing whiteout entries; specifically, BSD union mount employs a separate inode type, B<DT_WHT>, which, while supported by some filesystems available in Linux, such as CODA and XFS, is ignored by the kernel's whiteout support code, as of Linux 4.19, at least.)
ru: При отсутствии объединения/оверлея замазка появляется в виде символьного устройства с номером устройства {0,0} (заметим, что в других реализациях объединения/оверлея могут использоваться другие методы хранения элементов замазки; в частности, в BSD для объединения монтирования используется специальный тип иноды, B<DT_WHT>, который, хотя и поддерживается некоторыми файловыми системами, доступными в Linux, например CODA и XFS, но игнорируется кодом поддержки замазки в ядре, по крайней мере, в Linux 4.19).

source: B<RENAME_WHITEOUT> requires the same privileges as creating a device node (i.e., the B<CAP_MKNOD> capability).
ru: Для B<RENAME_WHITEOUT> требуются те же права, что и для создания узла устройства (т. е., мандата B<CAP_MKNOD>).

source: B<RENAME_WHITEOUT> can't be employed together with B<RENAME_EXCHANGE>.
ru: B<RENAME_WHITEOUT> не может быть применён вместе с B<RENAME_EXCHANGE>.

source: B<RENAME_WHITEOUT> requires support from the underlying filesystem. Among the filesystems that provide that support are tmpfs (since Linux 3.18), ext4 (since Linux 3.18), XFS (since Linux 4.1), f2fs (since Linux 4.2). btrfs (since Linux 4.7), and ubifs (since Linux 4.9).
ru: Для B<RENAME_WHITEOUT> требуется поддержка в файловой системе. Такая поддержка имеется в tmpfs (начиная с Linux 3.18), ext4 (начиная с Linux 3.18), XFS (начиная с Linux 4.1), f2fs (начиная с Linux 4.2), btrfs (начиная с Linux 4.7) и ubifs (начиная с Linux 4.9).

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Write permission is denied for the directory containing I<oldpath> or I<newpath>, or, search permission is denied for one of the directories in the path prefix of I<oldpath> or I<newpath>, or I<oldpath> is a directory and does not allow write permission (needed to update the I<..> entry). (See also B<path_resolution>(7).)
ru: Запись в каталог, содержащий I<oldpath> или I<newpath>, запрещена, или в одном из каталогов пути I<oldpath> или I<newpath> нельзя производить поиск, или I<oldpath> является каталогом, в который запрещена запись (требует обновления элемента I<..>); смотрите также B<path_resolution>(7)).

source: The rename fails because I<oldpath> or I<newpath> is a directory that is in use by some process (perhaps as current working directory, or as root directory, or because it was open for reading) or is in use by the system (for example as mount point), while the system considers this an error. (Note that there is no requirement to return B<EBUSY> in such cases\(emthere is nothing wrong with doing the rename anyway\(embut it is allowed to return B<EBUSY> if the system cannot otherwise handle such situations.)
ru: Переименование завершилось неудачно, так как I<oldpath> или I<newpath> является каталогом, который используется другим процессом (возможно в качестве текущего рабочего каталога или в качестве корневого каталога, или он открыт на чтение), или используется системой (например, в качестве точки монтирования), и система считает это ошибкой (заметим, что нет требования возвращать B<EBUSY> в таких случаях — нет ничего неправильного в таком переименовании — но разрешается возвращать B<EBUSY>, если система не может иначе обработать такие ситуации).

source: The user's quota of disk blocks on the filesystem has been exhausted.
ru: Исчерпана пользовательская квота на дисковые блоки файловой системы.

source: I<oldpath> or I<newpath> points outside your accessible address space.
ru: Значения I<oldpath> и I<newpath> указывают за пределы доступного адресного пространства.

source: The new pathname contained a path prefix of the old, or, more generally, an attempt was made to make a directory a subdirectory of itself.
ru: Новый путь содержит префикс старого пути или, в более общем смысле, выполняется попытка сделать каталог подкаталогом самого себя.

source: I<newpath> is an existing directory, but I<oldpath> is not a directory.
ru: Каталог I<newpath> уже существует, но I<oldpath> не является каталогом.

source: Too many symbolic links were encountered in resolving I<oldpath> or I<newpath>.
ru: Во время определения I<oldpath> или I<newpath> встретилось слишком много символьных ссылок.

source: I<oldpath> already has the maximum number of links to it, or it was a directory and the directory containing I<newpath> has the maximum number of links.
ru: В I<oldpath> уже имеется максимальное количество ссылок, или каталог, содержащий I<newpath>, уже имеет максимальное количество ссылок.

source: I<oldpath> or I<newpath> was too long.
ru: Слишком длинное значение аргумента I<oldpath> или I<newpath>.

source: The link named by I<oldpath> does not exist; or, a directory component in I<newpath> does not exist; or, I<oldpath> or I<newpath> is an empty string.
ru: Ссылка, на которую ссылается I<oldpath>, не существует; компонент каталога в I<newpath> не существует; в I<oldpath> или I<newpath> указана пустая строка.

source: The device containing the file has no room for the new directory entry.
ru: На устройстве, содержащем файл, нет места для создания нового элемента каталога.

source: A component used as a directory in I<oldpath> or I<newpath> is not, in fact, a directory. Or, I<oldpath> is a directory, and I<newpath> exists but is not a directory.
ru: Компонент, используемый как каталог в I<oldpath> или I<newpath>, в действительности не является каталогом. Или I<oldpath> является каталогом и существует I<newpath>, который не является каталогом.

source: B<ENOTEMPTY> or B<EEXIST>
ru: B<ENOTEMPTY> или B<EEXIST>

source: I<newpath> is a nonempty directory, that is, contains entries other than "." and "..".
ru: Значение I<newpath> является непустым каталогом, то есть содержит элементы, отличные от «.» и «..».

source: B<EPERM> or B<EACCES>
ru: B<EPERM> или B<EACCES>

source: The directory containing I<oldpath> has the sticky bit (B<S_ISVTX>) set and the process's effective user ID is neither the user ID of the file to be deleted nor that of the directory containing it, and the process is not privileged (Linux: does not have the B<CAP_FOWNER> capability); or I<newpath> is an existing file and the directory containing it has the sticky bit set and the process's effective user ID is neither the user ID of the file to be replaced nor that of the directory containing it, and the process is not privileged (Linux: does not have the B<CAP_FOWNER> capability); or the filesystem containing I<pathname> does not support renaming of the type requested.
ru: Каталог, содержащийся в I<oldpath>, имеет закрепляющий бит (B<S_ISVTX>) и эффективный идентификатор процесса не совпадает с идентификатором пользователя удаляемого файла или каталога, его содержащего, и процесс не имеет прав (Linux: нет мандата B<CAP_FOWNER>); или I<newpath> является существующим файлом и каталог, содержащий его, имеет закрепляющий бит и эффективный идентификатор процесса не совпадает с идентификатором пользователя замещаемого файла или каталога, его содержащего, и процесс не имеет прав (Linux: нет мандата B<CAP_FOWNER>); или файловая система, содержащая I<pathname>, не поддерживает переименования запрашиваемого типа.

source: The file is on a read-only filesystem.
ru: Файл расположен в файловой системе, доступной только для чтения.

source: I<oldpath> and I<newpath> are not on the same mounted filesystem. (Linux permits a filesystem to be mounted at multiple points, but B<rename>() does not work across different mount points, even if the same filesystem is mounted on both.)
ru: Элементы I<oldpath> и I<newpath> находятся не в одной смонтированной файловой системе (Linux позволяет монтировать файловую систему в несколько точек, но B<rename>() не работает с различающимися точками монтирования, даже если в них смонтирована идентичная файловая система).

source: The following additional errors can occur for B<renameat>() and B<renameat2>():
ru: В B<renameat>() и B<renameat2>() дополнительно могут возникнуть следующие ошибки:

source: I<olddirfd> or I<newdirfd> is not a valid file descriptor.
ru: Значение I<olddirfd> или I<newdirfd> не является правильным файловым дескриптором.

source: I<oldpath> is relative and I<olddirfd> is a file descriptor referring to a file other than a directory; or similar for I<newpath> and I<newdirfd>
ru: Значение I<oldpath> содержит относительный путь и I<olddirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог; или произошло тоже самое с I<newpath> и I<newdirfd>.

source: The following additional errors can occur for B<renameat2>():
ru: В B<renameat2>() дополнительно могут возникнуть следующие ошибки:

source: I<flags> contains B<RENAME_NOREPLACE> and I<newpath> already exists.
ru: Значение I<flags> содержит B<RENAME_NOREPLACE>, а I<newpath> уже существует.

source: An invalid flag was specified in I<flags>.
ru: В I<flags> указан неверный флаг.

source: Both B<RENAME_NOREPLACE> and B<RENAME_EXCHANGE> were specified in I<flags>.
ru: В I<flags> указаны оба флага, B<RENAME_NOREPLACE> и B<RENAME_EXCHANGE>.

source: Both B<RENAME_WHITEOUT> and B<RENAME_EXCHANGE> were specified in I<flags>.
ru: В I<flags> указаны оба флага, B<RENAME_WHITEOUT> и B<RENAME_EXCHANGE>.

source: The filesystem does not support one of the flags in I<flags>.
ru: Файловая система не поддерживает один из флагов в I<flags>.

source: I<flags> contains B<RENAME_EXCHANGE> and I<newpath> does not exist.
ru: В I<flags> содержится B<RENAME_EXCHANGE>, но I<newpath> не существует.

source: B<RENAME_WHITEOUT> was specified in I<flags>, but the caller does not have the B<CAP_MKNOD> capability.
ru: В I<flags> указан флаг B<RENAME_WHITEOUT> , но вызывающий не имеет мандата B<CAP_MKNOD>.

source: B<renameat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Системный вызов B<renameat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: B<renameat2>() was added to Linux in kernel 3.15; library support was added in glibc 2.28.
ru: Вызов B<renameat2>() был добавлен в Linux 3.15; поддержка в glibc доступна с версии 2.28.

source: B<renameat2>() is Linux-specific.
ru: Вызов B<renameat2>() есть только в Linux.

source: On older kernels where B<renameat>() is unavailable, the glibc wrapper function falls back to the use of B<rename>(). When I<oldpath> and I<newpath> are relative pathnames, glibc constructs pathnames based on the symbolic links in I</proc/self/fd> that correspond to the I<olddirfd> and I<newdirfd> arguments.
ru: В старых ядрах, где B<renameat>() отсутствует, обёрточная функция glibc использует B<rename>(). Если I<oldpath> и I<newpath> являются относительными путями, то glibc собирает пути относительно символической ссылки в I</proc/self/fd>, которая соответствует аргументам I<olddirfd> и I<newdirfd>.

source: On NFS filesystems, you can not assume that if the operation failed, the file was not renamed. If the server does the rename operation and then crashes, the retransmitted RPC which will be processed when the server is up again causes a failure. The application is expected to deal with this. See B<link>(2) for a similar problem.
ru: При работе с файловыми системами NFS нельзя считать, что если операция завершилась неудачно, то имя файла не изменилось. Если сервер производит операцию переименования, а затем аварийно останавливает свою работу, то перепосланный пакет RPC будет вновь обработан при восстановлении работы сервера, что вызовет сообщение об ошибке. Приложение в этой ситуации должно работать корректно. Смотрите B<link>(2), где описывается подобная проблема.

source: rmdir - delete a directory
ru: rmdir - удалить каталог

source: B<rmdir>() deletes a directory, which must be empty.
ru: B<rmdir>() удаляет каталог, который должен быть пуст.

source: Write access to the directory containing I<pathname> was not allowed, or one of the directories in the path prefix of I<pathname> did not allow search permission. (See also B<path_resolution>(7).
ru: Нет прав на запись в каталог, содержащийся в I<pathname>, или в одном из каталогов в I<pathname> не разрешён поиск (см. также B<path_resolution>(7)).
