Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: Turns on B<MSG_DONTWAIT> after the first message has been received.
ru: Включить B<MSG_DONTWAIT> после получения первого сообщения.

source: The I<timeout> argument points to a I<struct timespec> (see B<clock_gettime>(2)) defining a timeout (seconds plus nanoseconds) for the receive operation (I<but see BUGS!>). (This interval will be rounded up to the system clock granularity, and kernel scheduling delays mean that the blocking interval may overrun by a small amount.) If I<timeout> is NULL, then the operation blocks indefinitely.
ru: Аргумент I<timeout> указывает на I<struct timespec> (смотрите B<clock_gettime>(2)), задающую время ожидания (в секундах и наносекундах) операции приёма (I<но смотрите ДЕФЕКТЫ!>; (этот интервал будет округлён до точности системных часов, и из-за задержек планировщика ядра интервал блокировки может быть немного больше). Если I<timeout> равно NULL, то операция блокируется на неопределённое время.

source: A blocking B<recvmmsg>() call blocks until I<vlen> messages have been received or until the timeout expires. A nonblocking call reads as many messages as are available (up to the limit specified by I<vlen>) and returns immediately.
ru: Блокирование вызова B<recvmmsg>() происходит до тех пор, пока не будет получено I<vlen> сообщений или не истечёт интервал блокировки. Неблокирующий вызов читает все доступные сообщения (максимальное количество указано в I<vlen>) и сразу завершает работу.

source: On return from B<recvmmsg>(), successive elements of I<msgvec> are updated to contain information about each received message: I<msg_len> contains the size of the received message; the subfields of I<msg_hdr> are updated as described in B<recvmsg>(2). The return value of the call indicates the number of elements of I<msgvec> that have been updated.
ru: При выходе из B<recvmmsg>() последующие элементы I<msgvec> обновляются информацией о каждом полученном сообщении: в I<msg_len> содержится размер принятого сообщения; подполя I<msg_hdr> обновляются согласно описанию в B<recvmsg>(2). Возвращаемое значение вызова означает количество обновлённых элементов I<msgvec>.

source: On success, B<recvmmsg>() returns the number of messages received in I<msgvec>; on error, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<recvmmsg>() возвращает количество принятых в I<msgvec> сообщений; при ошибке возвращается -1 и в I<errno> устанавливается код ошибки.

source: Errors are as for B<recvmsg>(2). In addition, the following error can occur:
ru: Возникают те же ошибки что и для B<recvmsg>(2). Кроме этого, случается следующая ошибка:

source: I<timeout> is invalid.
ru: Значение I<timeout> неверно.

source: See also BUGS.
ru: Также смотрите ДЕФЕКТЫ.

source: The B<recvmmsg>() system call was added in Linux 2.6.33. Support in glibc was added in version 2.12.
ru: Системный вызов B<recvmmsg>() был добавлен в Linux 2.6.33. Поддержка в glibc появилась в версии 2.12.

source: B<recvmmsg>() is Linux-specific.
ru: Вызов B<recvmmsg>() есть только в Linux.

source: The I<timeout> argument does not work as intended. The timeout is checked only after the receipt of each datagram, so that if up to I<vlen-1> datagrams are received before the timeout expires, but then no further datagrams are received, the call will block forever.
ru: Аргумент I<timeout> работает не так, как планировалось. Время ожидания проверяется только после приёма каждой дейтаграммы, поэтому, если до истечения срока будет получено до I<vlen-1> дейтаграмм, но затем дейтаграммы не поступят, то вызов заблокируется навсегда.

source: If an error occurs after at least one message has been received, the call succeeds, and returns the number of messages received. The error code is expected to be returned on a subsequent call to B<recvmmsg>(). In the current implementation, however, the error code can be overwritten in the meantime by an unrelated network event on a socket, for example an incoming ICMP packet.
ru: Если ошибка возникает после получения хотя бы одного сообщения, то вызов выполняется успешно и возвращается количество полученных сообщений. Код ошибки будет возвращён следующим вызовом B<recvmmsg>(). Однако в текущей реализации код ошибки может перезаписаться при возникновении в тоже время события, не связанного с сетью, например, из-за поступившего пакета ICMP.

source: The following program uses B<recvmmsg>() to receive multiple messages on a socket and stores them in multiple buffers. The call returns if all buffers are filled or if the timeout specified has expired.
ru: Следующая программа использует B<recvmmsg>() для получения нескольких сообщений через сокет и сохранения их в несколько буферов. Вызов завершается при заполнении всех буферов, либо по окончании заданного временного интервала.

source: The following snippet periodically generates UDP datagrams containing a random number:
ru: Следующий отрывок периодически генерирует датаграммы UDP с произвольным номером внутри:

source: These datagrams are read by the example application, which can give the following output:
ru: Эти датаграммы читаются примером приложения, который выдаёт:

source: $B< ./a.out> 5 messages received 1 11782 2 11345 3 304 4 13514 5 28421
ru: $B< ./a.out> 5 сообщений получено 1 11782 2 11345 3 304 4 13514 5 28421

source: printf("%d messages received\en", retval); for (i = 0; i E<lt> retval; i++) { bufs[i][msgs[i].msg_len] = 0; printf("%d %s", i+1, bufs[i]); } exit(EXIT_SUCCESS); }
ru: printf("%d сообщений получено\en", retval); for (i = 0; i E<lt> retval; i++) { bufs[i][msgs[i].msg_len] = 0; printf("%d %s", i+1, bufs[i]); } exit(EXIT_SUCCESS); }

source: rt_sigqueueinfo, rt_tgsigqueueinfo - queue a signal and data
ru: rt_sigqueueinfo, rt_tgsigqueueinfo - ставит сигнал и данные в очередь

source: I<Note>: There are no glibc wrappers for these system calls; see NOTES.
ru: I<Замечание>: В glibc нет обёрточных функций для этих системных вызовов; смотрите ЗАМЕЧАНИЯ.

source: The B<rt_sigqueueinfo>() and B<rt_tgsigqueueinfo>() system calls are the low-level interfaces used to send a signal plus data to a process or thread. The receiver of the signal can obtain the accompanying data by establishing a signal handler with the B<sigaction>(2) B<SA_SIGINFO> flag.
ru: Системные вызовы B<rt_sigqueueinfo>() и B<rt_tgsigqueueinfo>() предоставляют низкоуровневый интерфейс для отправки сигнала с данными процессу или нити. Приёмник сигнала может получить сопутствующие данные, установив обработчик сигнала с помощью B<sigaction>(2) с флагом B<SA_SIGINFO>.

source: These system calls are not intended for direct application use; they are provided to allow the implementation of B<sigqueue>(3) and B<pthread_sigqueue>(3).
ru: Данные системные вызовы не предназначены для использования непосредственно из приложения; они нужны для реализации библиотечных функций B<sigqueue>(3) и B<pthread_sigqueue>(3).

source: The B<rt_sigqueueinfo>() system call sends the signal I<sig> to the thread group with the ID I<tgid>. (The term "thread group" is synonymous with "process", and I<tid> corresponds to the traditional UNIX process ID.) The signal will be delivered to an arbitrary member of the thread group (i.e., one of the threads that is not currently blocking the signal).
ru: Системный вызов B<rt_sigqueueinfo>() отправляет сигнал I<sig> группе нитей с идентификатором I<tgid> (термин «группа нитей» является синонимом «процесс», а I<tid> соответствует обычному идентификатору процесса UNIX). Сигнал будет доставлен произвольному члену группы нитей (т. е., одной из нитей, которая в этот момент не блокирует сигнал).

source: The I<uinfo> argument specifies the data to accompany the signal. This argument is a pointer to a structure of type I<siginfo_t>, described in B<sigaction>(2) (and defined by including I<E<lt>sigaction.hE<gt>>). The caller should set the following fields in this structure:
ru: В аргументе I<uinfo> задаются сопутствующие сигналу данные. Этот аргумент является указателем на структуру типа I<siginfo_t>, описанную в B<sigaction>(2) (и определённую в I<E<lt>sigaction.hE<gt>>). Вызывающий должен заполнить следующие поля структуры:

source: This must be one of the B<SI_*> codes in the Linux kernel source file I<include/asm-generic/siginfo.h>, with the restriction that the code must be negative (i.e., cannot be B<SI_USER>, which is used by the kernel to indicate a signal sent by B<kill>(2)) and cannot (since Linux 2.6.39) be B<SI_TKILL> (which is used by the kernel to indicate a signal sent using B<tgkill>(2)).
ru: Значением должен быть один из кодов B<SI_*>, перечисленных в файле исходного кода ядра Linux I<include/asm-generic/siginfo.h>, имеющих отрицательное значение (т. е., нельзя указать B<SI_USER>, используемый ядром для обозначения того, что сигнал послан B<kill>(2)) и нельзя указать (начиная с Linux 2.6.39) B<SI_TKILL> (используется ядром для обозначения того, что сигнал послан B<tgkill>(2)).

source: This should be set to a process ID, typically the process ID of the sender.
ru: Должно хранить идентификатор процесса, обычно PID отправителя.

source: This should be set to a user ID, typically the real user ID of the sender.
ru: Должно хранить идентификатор пользователя, обычно UID реального пользователя отправителя.

source: This field contains the user data to accompany the signal. For more information, see the description of the last (I<union sigval>) argument of B<sigqueue>(3).
ru: Это поле хранит пользовательские данные, сопровождающие сигнал. Подробности смотрите в описании последнего аргумента (I<union sigval>) функции B<sigqueue>(3).

source: Internally, the kernel sets the I<si_signo> field to the value specified in I<sig>, so that the receiver of the signal can also obtain the signal number via that field.
ru: Внутри ядра полю I<si_signo> устанавливается значение, переданное в I<sig>, так что получатель сигнала может также получить его номер через это поле.

source: The B<rt_tgsigqueueinfo>() system call is like B<rt_sigqueueinfo>(), but sends the signal and data to the single thread specified by the combination of I<tgid>, a thread group ID, and I<tid>, a thread in that thread group.
ru: Системный вызов B<rt_tgsigqueueinfo>() похож на B<rt_sigqueueinfo>(), но посылает сигнал и данные одной нити, указываемой комбинацией I<tgid> — идентификатором группы нитей — и I<tid> — нити из этой группы.

source: On success, these system calls return 0. On error, they return -1 and I<errno> is set to indicate the error.
ru: При успешном выполнении эти системные вызовы возвращают 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение ошибки.

source: The limit of signals which may be queued has been reached. (See B<signal>(7) for further information.)
ru: Достигнуто ограничение на количество сигналов в очереди (подробней об этом смотрите в B<signal>(7)).

source: I<sig>, I<tgid>, or I<tid> was invalid.
ru: Некорректное значение I<sig>, I<tgid> или I<tid>.

source: The caller does not have permission to send the signal to the target. For the required permissions, see B<kill>(2). Or: I<uinfo-E<gt>si_code> is invalid.
ru: Вызывающий не имеет прав для отправки сигнала по назначению. Требуемые права смотрите в B<kill>(2). Или некорректное значение I<uinfo-E<gt>si_code>.

source: B<rt_sigqueueinfo>(): No thread group matching I<tgid> was found.
ru: B<rt_sigqueueinfo>(): Группа нитей I<tgid> не найдена.

source: B<rt_tgsigqueinfo>(): No thread matching I<tgid> and I<tid> was found.
ru: B<rt_tgsigqueinfo>(): Нить I<tid> из I<tgid> не найдена.

source: The B<rt_sigqueueinfo>() system call was added to Linux in version 2.2. The B<rt_tgsigqueueinfo>() system call was added to Linux in version 2.6.31.
ru: Системный вызов B<rt_sigqueueinfo>() был добавлен в Linux версии 2.2. Системный вызов B<rt_tgsigqueueinfo>() был добавлен в Linux версии 2.6.31.

source: These system calls are Linux-specific.
ru: Данные системные вызовы есть только в Linux.

source: Since these system calls are not intended for application use, there are no glibc wrapper functions; use B<syscall>(2) in the unlikely case that you want to call them directly.
ru: Поскольку системные вызовы не предназначены для приложений, в glibc для них нет обёрточных функций. Используйте B<syscall>(2) в том маловероятном случае, если вы хотите вызывать их напрямую.

source: As with B<kill>(2), the null signal (0) can be used to check if the specified process or thread exists.
ru: Как и в случае с B<kill>(2), может быть использован сигнал null (0), чтобы проверить, существует ли указанный процесс или нить.

source: restart_syscall - restart a system call after interruption by a stop signal
ru: restart_syscall - перезапускает системный вызов после прерывания сигналом останова

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
ru: I<Замечание>: В glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: The B<restart_syscall>() system call is used to restart certain system calls after a process that was stopped by a signal (e.g., B<SIGSTOP> or B<SIGTSTP>) is later resumed after receiving a B<SIGCONT> signal. This system call is designed only for internal use by the kernel.
ru: Системный вызов B<restart_syscall>() предназначен для перезапуска некоторых системных вызовов после того, как процесс, остановленный сигналом (например, B<SIGSTOP> или B<SIGTSTP>), продолжил выполнение после получения сигнала B<SIGCONT>. Этот системный вызов создан только для внутреннего использования ядром.

source: B<restart_syscall>() is used for restarting only those system calls that, when restarted, should adjust their time-related parameters\(emnamely B<poll>(2) (since Linux 2.6.24), B<nanosleep>(2) (since Linux 2.6), B<clock_nanosleep>(2) (since Linux 2.6), and B<futex>(2), when employed with the B<FUTEX_WAIT> (since Linux 2.6.22) and B<FUTEX_WAIT_BITSET> (since Linux 2.6.31) operations. B<restart_syscall>() restarts the interrupted system call with a time argument that is suitably adjusted to account for the time that has already elapsed (including the time where the process was stopped by a signal). Without the B<restart_syscall>() mechanism, restarting these system calls would not correctly deduct the already elapsed time when the process continued execution.
ru: Вызов B<restart_syscall>() используется только для тех системных вызовов, которые при перезапуске должны обновить свои параметры, относящиеся к времени, а именно — B<poll>(2) (начиная с Linux 2.6.24), B<nanosleep>(2) (начиная с Linux 2.6), B<clock_nanosleep>(2) (начиная с Linux 2.6), B<futex>(2) при использовании с B<FUTEX_WAIT> (начиная с Linux 2.6.22) и B<FUTEX_WAIT_BITSET> (начиная с Linux 2.6.31). Вызов B<restart_syscall>() перезапускает прерванный системный вызов с аргументом времени, который позволят рассчитать прошедшее время (включая время, когда процесс был остановлен сигналом). Без механизма B<restart_syscall>() при перезапуске этих системных вызовов было бы невозможно вычесть правильное время, прошедшее на момент продолжения выполнение процесса.

source: The return value of B<restart_syscall>() is the return value of whatever system call is being restarted.
ru: Возвращаемым значением B<restart_syscall>() является возвращаемое значение перезапущенного системного вызова.

source: I<errno> is set as per the errors for whatever system call is being restarted by B<restart_syscall>().
ru: Значение I<errno> устанавливается в соответствии с ошибками системного вызова, перезапущенного B<restart_systemcall>().

source: The B<restart_syscall>() system call is present since Linux 2.6.
ru: Системный вызов B<restart_systemcall>() появился в Linux 2.6.

source: This system call is Linux-specific.
ru: Данный вызов есть только в Linux.

source: There is no glibc wrapper for this system call, because it is intended for use only by the kernel and should never be called by applications.
ru: Для этого системного вызова в glibc нет обёрточной функции, потому что он используется только ядром и не должен вызываться приложениями.

source: The kernel uses B<restart_syscall>() to ensure that when a system call is restarted after a process has been stopped by a signal and then resumed by B<SIGCONT>, then the time that the process spent in the stopped state is counted against the timeout interval specified in the original system call. In the case of system calls that take a timeout argument and automatically restart after a stop signal plus B<SIGCONT>, but which do not have the B<restart_syscall>() mechanism built in, then, after the process resumes execution, the time that the process spent in the stop state is I<not> counted against the timeout value. Notable examples of system calls that suffer this problem are B<ppoll>(2), B<select>(2), and B<pselect>(2).
ru: Ядро использует B<restart_syscall>() для гарантии того, что когда системный вызов перезапускается после остановки процесса по сигналу и затем возобновляется по B<SIGCONT>, время, которое процесс пробыл в остановленном состоянии будет учтено в интервале ожидания, заданного в первоначальном системном вызове. У системных вызовов, у которых есть аргумент интервала ожидания и которые автоматически перезапускаются после сигнала останова плюс B<SIGCONT>, но которые не имеют встроенного механизма B<restart_syscall>(2), после возобновления работы процесса время, которое процесс пробыл в остановленном состоянии, I<не> учитывается в значении интервала ожидания. Весомыми примерам системных вызовов, которые подвержены этой проблеме, являются B<ppoll>(2), B<select>(2) и B<pselect>(2).

source: From user space, the operation of B<restart_syscall>() is largely invisible: to the process that made the system call that is restarted, it appears as though that system call executed and returned in the usual fashion.
ru: Из пользовательского пространства работа B<restart_syscall>(), в большинстве случаев, невидима: процессу, выполняющему системный вызов, который перезапускался, кажется, что системный вызов выполнился как обычно.

source: read - read from a file descriptor
ru: read - читает из файлового дескриптора

source: B<read>() attempts to read up to I<count> bytes from file descriptor I<fd> into the buffer starting at I<buf>.
ru: Вызов B<read>() пытается прочитать I<count> байт из файлового дескриптора I<fd> в буфер, начинающийся по адресу I<buf>.

source: On files that support seeking, the read operation commences at the file offset, and the file offset is incremented by the number of bytes read. If the file offset is at or past the end of file, no bytes are read, and B<read>() returns zero.
ru: Для файлов, поддерживающих смещения, операция чтения начинается с файлового смещения, и файловое смещение увеличивается на количество прочитанных байт. Если файловое смещение находится за концом файла, то ничего не читается и B<read>() возвращает ноль.

source: If I<count> is zero, B<read>() I<may> detect the errors described below. In the absence of any errors, or if B<read>() does not check for errors, a B<read>() with a I<count> of 0 returns zero and has no other effects.
ru: Если значение I<count> равно 0, то B<read>() I<может> обнаружить ошибки, описанные далее. При отсутствии ошибок, или если B<read>() не выполняет проверки, то B<read>() с I<count> равным 0 возвращает 0 и ничего не меняет.

source: According to POSIX.1, if I<count> is greater than B<SSIZE_MAX>, the result is implementation-defined; see NOTES for the upper limit on Linux.
ru: В соответствие с POSIX.1, если I<count> больше B<SSIZE_MAX>, то результат зависит от реализации; смотрите ЗАМЕЧАНИЯ по верхнему пределу в Linux.

source: On success, the number of bytes read is returned (zero indicates end of file), and the file position is advanced by this number. It is not an error if this number is smaller than the number of bytes requested; this may happen for example because fewer bytes are actually available right now (maybe because we were close to end-of-file, or because we are reading from a pipe, or from a terminal), or because B<read>() was interrupted by a signal. See also NOTES.
ru: При успешном выполнении возвращается количество прочитанных байт (ноль означает конец файла), а позиция в файле увеличивается на это значение. Если количество прочитанных байт меньше, чем количество запрошенных, то это не считается ошибкой: например, это могло произойти из-за того, что прямо сейчас доступно меньшее количество байт (может быть из-за того, что позиция ближе к концу файла, или потому что выполняется чтение из канала или терминала), или потому что работа B<read>() была прервана сигналом. См. также ЗАМЕЧАНИЯ.

source: On error, -1 is returned, and I<errno> is set appropriately. In this case, it is left unspecified whether the file position (if any) changes.
ru: В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение. В этом случае изменение позиции файла остаётся неопределённым (если это вообще происходило).

source: The file descriptor I<fd> refers to a file other than a socket and has been marked nonblocking (B<O_NONBLOCK>), and the read would block. See B<open>(2) for further details on the B<O_NONBLOCK> flag.
ru: Файловый дескриптор I<fd> указывает на файл, не являющийся сокетом и помеченный как неблокирующий ввод/вывод (B<O_NONBLOCK>), а чтение вызовет блокировку. См. B<open>(2) для дальнейшей информации по флагу B<O_NONBLOCK>.

source: B<EAGAIN> or B<EWOULDBLOCK>
ru: B<EAGAIN> или B<EWOULDBLOCK>

source: The file descriptor I<fd> refers to a socket and has been marked nonblocking (B<O_NONBLOCK>), and the read would block. POSIX.1-2001 allows either error to be returned for this case, and does not require these constants to have the same value, so a portable application should check for both possibilities.
ru: Файловый дескриптор I<fd> указывает на сокет и он помечен как неблокирующий (B<O_NONBLOCK>), а чтение вызвало бы блокировку. POSIX.1-2001 позволяет вернуть любую ошибку в этом случае и не требует, чтобы эти константы имели одинаковое значение, поэтому переносимое приложение должно проверять обе эти возможности.

source: I<fd> is not a valid file descriptor or is not open for reading.
ru: I<fd> не является допустимым файловым дескриптором или не открыт на чтение.

source: I<buf> is outside your accessible address space.
ru: I<buf> находится за пределами доступного вам адресного пространства.

source: The call was interrupted by a signal before any data was read; see B<signal>(7).
ru: Вызов был прерван сигналом до того как были прочитаны данные; см. B<signal>(7).

source: I<fd> is attached to an object which is unsuitable for reading; or the file was opened with the B<O_DIRECT> flag, and either the address specified in I<buf>, the value specified in I<count>, or the file offset is not suitably aligned.
ru: I<fd> присоединён к объекту, который не подходит для чтения; или файл был открыт с указанием флага B<O_DIRECT>, или неправильно выравнены адрес в I<buf>, значение I<count> или файловое смещение.

source: I<fd> was created via a call to B<timerfd_create>(2) and the wrong size buffer was given to B<read>(); see B<timerfd_create>(2) for further information.
ru: I<fd> был создан вызовом B<timerfd_create>(2), а в B<read>() был передан неверный размер буфера; подробней см. в B<timerfd_create>(2).
