Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The B<dn_comp>() and B<dn_expand>() functions return the length of the compressed name, or -1 if an error occurs.
ru: Функции B<dn_comp>() и B<dn_expand>() возвращают длину сжатого имени, или -1 при ошибках.

source: In the case of an error return from B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>(), or B<res_querydomain>(), the global variable I<h_errno> (see B<gethostbyname>(3)) can be consulted to determine the cause of the error.
ru: В случае завершения B<res_nquery>(), B<res_query>(), B<res_nsearch>(), B<res_search>(), B<res_nquerydomain>() или B<res_querydomain>() с ошибкой, по глобальной переменной I<h_errno> (смотрите B<gethostbyname>(3)) можно определить причину.

source: resolver configuration file
ru: файл с настройками резолвера

source: The GNU C library source file I<resolv/README>.
ru: Файл I<resolv/README> из библиотеки GNU C.

source: rpmatch - determine if the answer to a question is affirmative or negative
ru: rpmatch - определяет, является ли ответ на вопрос утвердительным или отрицательным

source: B<rpmatch>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _SVID_SOURCE
ru: B<rpmatch>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _SVID_SOURCE

source: B<rpmatch>() handles a user response to yes or no questions, with support for internationalization.
ru: Функция B<rpmatch>() обрабатывает ответ пользователя «да» или «нет» на вопросы, учитывая интернационализацию.

source: I<response> should be a null-terminated string containing a user-supplied response, perhaps obtained with B<fgets>(3) or B<getline>(3).
ru: В аргументе I<response> должен указываться ответ пользователя в виде строки, заканчивающейся null, полученной, например, с помощью B<fgets>(3) или B<getline>(3).

source: The user's language preference is taken into account per the environment variables B<LANG>, B<LC_MESSAGES>, and B<LC_ALL>, if the program has called B<setlocale>(3) to effect their changes.
ru: Пользовательские языковые настройки определяются с помощью переменных окружения B<LANG>, B<LC_MESSAGES> и B<LC_ALL>, если для их учёта программа вызывала B<setlocale>(3).

source: Regardless of the locale, responses matching B<^[Yy]> are always accepted as affirmative, and those matching B<^[Nn]> are always accepted as negative.
ru: Вне зависимости от локали, ответы, соответствующие B<^[Yy]>, всегда считаются утвердительными, а соответствующие B<^[Nn]>, всегда принимаются за отрицательные.

source: After examining I<response>, B<rpmatch>() returns 0 for a recognized negative response ("no"), 1 for a recognized positive response ("yes"), and -1 when the value of I<response> is unrecognized.
ru: После проверки I<response>, функция B<rpmatch>() возвращает 0 при найденном отрицательном ответе («нет»), 1 при положительном ответе («да») и -1, когда значение I<response> не распознано.

source: A return value of -1 may indicate either an invalid input, or some other error. It is incorrect to only test if the return value is nonzero.
ru: Возвращаемое значение -1 может указывать на неправильные входные данные, либо какую-то другую ошибку. Не стоит проверять является ли возвращаемое значение лишь отличным от нуля.

source: B<rpmatch>() can fail for any of the reasons that B<regcomp>(3) or B<regexec>(3) can fail; the cause of the error is not available from I<errno> or anywhere else, but indicates a failure of the regex engine (but this case is indistinguishable from that of an unrecognized value of I<response>).
ru: Функция B<rpmatch>() может завершиться с ошибкой по любой из причин, по которым могут не выполниться B<regcomp>(3) или B<regexec>(3); причина ошибки не указывается в I<errno> или где-то ещё — это указывает на ошибку в самом механизме regex (но этот случай не отличается от нераспознанных значений I<response>).

source: B<rpmatch>() is not required by any standard, but is available on a few other systems.
ru: Функция B<rpmatch>() не является стандартной, но доступна в некоторых других системах.

source: The B<rpmatch>() implementation looks at only the first character of I<response>. As a consequence, "nyes" returns 0, and "ynever; not in a million years" returns 1. It would be preferable to accept input strings much more strictly, for example (using the extended regular expression notation described in B<regex>(7)): B<^([yY]|yes|YES)$> and B<^([nN]|no|NO)$>.
ru: Реализация B<rpmatch>() учитывает лишь первый символ I<response>. Так что, «ну, да.» вернёт 0, а «да нет же, ни за что!» вернёт 1. Правильнее было бы использовать расширенные правила для обработки входных строк (использования дополненных регулярных выражений описано в B<regex>(7)): B<^([yY]|yes|YES)$> и B<^([nN]|no|NO)$>.

source: The following program displays the results when B<rpmatch>() is applied to the string given in the program's command-line argument.
ru: Следующая программа показывает результаты, когда в B<rpmatch>() передана строка, полученная программой из командной строки.

source: remquo, remquof, remquol - remainder and part of quotient
ru: remquo, remquof, remquol - остаток и неполное частное

source: These functions compute the remainder and part of the quotient upon division of I<x> by I<y>. A few bits of the quotient are stored via the I<quo> pointer. The remainder is returned as the function result.
ru: Эти функции вычисляют остаток и неполное частное при делении I<x> на I<y>. Неполное частное сохраняется через указатель I<quo>. Остаток возвращается как результат функции.

source: The value of the remainder is the same as that computed by the B<remainder>(3) function.
ru: Значение остатка тоже, что и при вычислении функцией B<remainder>(3).

source: The value stored via the I<quo> pointer has the sign of I<x\ /\ y> and agrees with the quotient in at least the low order 3 bits.
ru: Значение, сохраняемое по указателю I<quo>, имеет знак I<x\ /\ y> и сохраняет от частного не менее 3 младших бит.

source: For example, I<remquo(29.0,\ 3.0)> returns -1.0 and might store 2. Note that the actual quotient might not fit in an integer.
ru: Например, I<remquo(29.0,\ 3.0)> возвращает -1.0 и может сохранить 2. Заметим, что реальный остаток может не поместиться в integer.

source: On success, these functions return the same value as the analogous functions described in B<remainder>(3).
ru: При успешном выполнении данные функции возвращают тоже значение, что и аналогичные функции, описанные в B<remainder>(3).

source: If I<x> or I<y> is a NaN, a NaN is returned.
ru: Если значение I<x> или I<y> равно NaN, будет возвращено NaN.

source: If I<x> is an infinity, and I<y> is not a NaN, a domain error occurs, and a NaN is returned.
ru: Если I<x> стремится к бесконечности и I<y> не равно NaN, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If I<y> is zero, and I<x> is not a NaN, a domain error occurs, and a NaN is returned.
ru: Если I<y> равно 0 и I<x> не равно NaN, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: See B<math_error>(7) for information on how to determine whether an error has occurred when calling these functions.
ru: Смотрите B<math_error>(7), чтобы определить возникшую ошибку при вызове этих функций.

source: The following errors can occur:
ru: Могут возникать следующие ошибки:

source: Domain error: I<x> is an infinity or I<y> is 0, and the other argument is not a NaN
ru: Ошибка области: I<x> стремится к бесконечности или I<y> равно 0, и другой аргумент не равен NaN.

source: An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: Возникает исключение неправильной плавающей запятой (B<FE_INVALID>).

source: These functions do not set I<errno>.
ru: Эти функции не изменяют I<errno>.

source: drem, dremf, dreml, remainder, remainderf, remainderl - floating-point remainder function
ru: drem, dremf, dreml, remainder, remainderf, remainderl - функция получения остатка от деления числа с плавающей запятой

source: /* The C99 versions */ B<double remainder(double >I<x>B<, double >I<y>B<);> B<float remainderf(float >I<x>B<, float >I<y>B<);> B<long double remainderl(long double >I<x>B<, long double >I<y>B<);>
ru: /* Версии C99 */ B<double remainder(double >I<x>B<, double >I<y>B<);> B<float remainderf(float >I<x>B<, float >I<y>B<);> B<long double remainderl(long double >I<x>B<, long double >I<y>B<);>

source: /* Obsolete synonyms */ B<double drem(double >I<x>B<, double >I<y>B<);> B<float dremf(float >I<x>B<, float >I<y>B<);> B<long double dreml(long double >I<x>B<, long double >I<y>B<);>
ru: /* Устаревшие синонимы */ B<double drem(double >I<x>B<, double >I<y>B<);> B<float dremf(float >I<x>B<, float >I<y>B<);> B<long double dreml(long double >I<x>B<, long double >I<y>B<);>

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions compute the remainder of dividing I<x> by I<y>. The return value is I<x>-I<n>*I<y>, where I<n> is the value I<x\ /\ y>, rounded to the nearest integer. If the absolute value of I<x>-I<n>*I<y> is 0.5, I<n> is chosen to be even.
ru: Данные функции вычисляют остаток от деления I<x> на I<y>. Возвращаемое значение равно I<x>-I<n>*I<y>, где I<n> равно значению I<x\ /\ y>, округлённому до ближайшего целого. Если абсолютное значение I<x>-I<n>*I<y> равно 0.5, то I<n> выбирается целым.

source: These functions are unaffected by the current rounding mode (see B<fenv>(3)).
ru: Эти функции не подвержены действующему режиму округления (смотрите B<fenv>(3)).

source: The B<drem>() function does precisely the same thing.
ru: Функция B<drem>() выполняет тоже самое.

source: On success, these functions return the floating-point remainder, I<x>-I<n>*I<y>. If the return value is 0, it has the sign of I<x>.
ru: При успешном выполнении данные функции возвращают остаток I<x>-I<n>*I<y> в виде значения с плавающей запятой. Если возвращаемое значение равно 0, то оно имеет знак I<x>.

source: Domain error: I<x> is an infinity and I<y> is not a NaN
ru: Ошибка области: I<x> стремится к бесконечности, а I<y> не равно NaN

source: I<errno> is set to B<EDOM> (but see BUGS). An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: I<errno> устанавливается в B<EDOM> (но см. ДЕФЕКТЫ). Возникает исключение неправильной плавающей точки (B<FE_INVALID>).

source: These functions do not set I<errno> for this case.
ru: В этом случае функции не изменяют I<errno>.

source: Domain error: I<y> is zero
ru: Ошибка области: I<y> равно 0

source: I<errno> is set to B<EDOM>. An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: Значение I<errno> устанавливается в B<EDOM>. Возникает исключение неправильной плавающей точки (B<FE_INVALID>).

source: The functions B<remainder>(), B<remainderf>(), and B<remainderl>() are specified in C99, POSIX.1-2001, and POSIX.1-2008.
ru: Функции B<remainder>(), B<remainderf>() и B<remainderl>() определены в C99 и POSIX.1-2001 и POSIX.1-2008.

source: The function B<drem>() is from 4.3BSD. The I<float> and I<long double> variants B<dremf>() and B<dreml>() exist on some systems, such as Tru64 and glibc2. Avoid the use of these functions in favor of B<remainder>() etc.
ru: Функция B<drem>() появилась из 4.3BSD. Варианты функций B<dremf>() и B<dreml>() с типами I<float> и I<long double> есть в некоторых системах, таких как Tru64 и glibc2. Не используйте эти функции вместо B<remainder>() и ей подобным.

source: Before glibc 2.15, the call
ru: До glibc 2.15 вызов

source: returned a NaN, as expected, but wrongly caused a domain error. Since glibc 2.15, a silent NaN (i.e., no domain error) is returned.
ru: возвращал NaN, как и ожидается, но некорректно приводит к ошибке области; Начиная с glibc 2.15, просто возвращается NaN (т. е., без ошибки области).

source: Before glibc 2.15, I<errno> was not set to B<EDOM> for the domain error that occurs when I<x> is an infinity and I<y> is not a NaN.
ru: До glibc 2.15, I<errno> не присваивалось B<EDOM> пр ошибке области, возникающей когда I<x> — бесконечность, а I<y> не равно NaN.

source: The call "remainder(29.0, 3.0)" returns -1.
ru: Вызов «remainder(29.0, 3.0)» возвращает -1.

source: random_r, srandom_r, initstate_r, setstate_r - reentrant random number generator
ru: random_r, srandom_r, initstate_r, setstate_r - реентерабельный генератор случайных чисел

source: /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: /* в glibc начиная с 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: These functions are the reentrant equivalents of the functions described in B<random>(3). They are suitable for use in multithreaded programs where each thread needs to obtain an independent, reproducible sequence of random numbers.
ru: Эти функции являются реентерабельными эквивалентами функций, которые описаны в B<random>(3). Они подходят для использования в многонитевых программах, где каждой нити необходимо получить независимую, воспроизводимую последовательность случайных чисел.

source: The B<random_r>() function is like B<random>(3), except that instead of using state information maintained in a global variable, it uses the state information in the argument pointed to by I<buf>, which must have been previously initialized by B<initstate_r>(). The generated random number is returned in the argument I<result>.
ru: Функция B<random_r>() подобна B<random>(3), но вместо использования информации о состоянии, хранящейся в глобальный переменной, в ней используется информация о состоянии в аргументе, указанном в I<buf>, который должен быть проинициализирован ранее с помощью B<initstate_r>(). Сгенерированное случайное число возвращается в аргументе I<result>.

source: The B<srandom_r>() function is like B<srandom>(3), except that it initializes the seed for the random number generator whose state is maintained in the object pointed to by I<buf>, which must have been previously initialized by B<initstate_r>(), instead of the seed associated with the global state variable.
ru: Функция B<srandom_r>() подобна B<srandom>(3), но инициализирует семя для генератора случайных чисел, чьё состояние хранится в объекте, на который указывает I<buf> который должен быть проинициализирован ранее с помощью B<initstate_r>(), а не связывает семя с глобальной переменной состояния.

source: The B<initstate_r>() function is like B<initstate>(3) except that it initializes the state in the object pointed to by I<buf>, rather than initializing the global state variable. Before calling this function, the I<buf.state> field must be initialized to NULL. The B<initstate_r>() function records a pointer to the I<statebuf> argument inside the structure pointed to by I<buf>. Thus, I<statebuf> should not be deallocated so long as I<buf> is still in use. (So, I<statebuf> should typically be allocated as a static variable, or allocated on the heap using B<malloc>(3) or similar.)
ru: Функция B<initstate_r>() подобна B<initstate>(3), но инициализирует состояние в объекте, на который указывает I<buf>, а не в глобальной переменной состояния. Перед вызовом этой функции в поле I<buf.state> нужно записать NULL. Функция B<initstate_r>() сохраняет указатель на аргумент I<statebuf> внутри структуры, указанной в I<buf>. Таким образом, I<statebuf> не должна освобождаться пока используется I<buf> (и I<statebuf> обычно должна быть статической переменной или выделяться из кучи с помощью B<malloc>(3) и подобных ей).

source: The B<setstate_r>() function is like B<setstate>(3) except that it modifies the state in the object pointed to by I<buf>, rather than modifying the global state variable. I<state> must first have been initialized using B<initstate_r>() or be the result of a previous call of B<setstate_r>().
ru: Функция B<setstate_r>() подобна B<setstate>(3), но изменяет состояние в объекте, на который указывает I<buf>, а не в глобальной переменной состояния. Переменная I<state> сначала должна инициализироваться с помощью B<initstate_r>() или быть результатом предшествующего вызова B<setstate_r>().

source: All of these functions return 0 on success. On error, -1 is returned, with I<errno> set to indicate the cause of the error.
ru: При успешном выполнении все функции возвращают 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: A state array of less than 8 bytes was specified to B<initstate_r>().
ru: Функции B<initstate_r>() передан массив состояния меньше 8 байт.

source: The I<statebuf> or I<buf> argument to B<setstate_r>() was NULL.
ru: Аргумент I<statebuf> или I<buf> функции B<setstate_r>() равнялся NULL.

source: The I<buf> or I<result> argument to B<random_r>() was NULL.
ru: Аргумент I<buf> или I<result> функции B<random_r>() равнялся NULL.

source: These functions are nonstandard glibc extensions.
ru: Это функции являются расширениями glibc.

source: The B<initstate_r>() interface is confusing. It appears that the I<random_data> type is intended to be opaque, but the implementation requires the user to either initialize the I<buf.state> field to NULL or zero out the entire structure before the call.
ru: Интерфейс B<initstate_r>() запутывает. Он появился для того, чтобы сделать тип I<random_data> скрытым, но реализация требует от пользователя перед вызовом, или инициализировать поле I<buf.state> значением NULL, или обнулить всю структуру.

source: readdir_r - read a directory
ru: readdir_r - чтение содержимого каталога

source: _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _POSIX_C_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: This function is deprecated; use B<readdir>(3) instead.
ru: Эта функция устарела; вместо неё используйте B<readdir>(3).

source: The B<readdir_r>() function was invented as a reentrant version of B<readdir>(3). It reads the next directory entry from the directory stream I<dirp>, and returns it in the caller-allocated buffer pointed to by I<entry>. For details of the I<dirent> structure, see B<readdir>(3).
ru: Функция B<readdir_r>() является реентерабельной версией B<readdir>(3). Она читает следующий элемент каталога из потока каталога I<dirp> и возвращает его в выделенный вызывающим буфер, на который указывает I<entry>. Описание структуры I<dirent> смотрите в B<readdir>(3).

source: A pointer to the returned buffer is placed in I<*result>; if the end of the directory stream was encountered, then NULL is instead returned in I<*result>.
ru: Указатель на возвращаемый буфер помещается в I<*result>; если достигнут конец потока каталога, то в I<*result> возвращается NULL..

source: It is recommended that applications use B<readdir>(3) instead of B<readdir_r>(). Furthermore, since version 2.24, glibc deprecates B<readdir_r>(). The reasons are as follows:
ru: В приложениях рекомендуется использовать B<readdir>(3) вместо B<readdir_r>(). Также, начиная с версии 2.24, в glibc B<readdir_r>() считается устаревшей. Причины:

source: On systems where B<NAME_MAX> is undefined, calling B<readdir_r>() may be unsafe because the interface does not allow the caller to specify the length of the buffer used for the returned directory entry.
ru: В системах, у которых значение B<NAME_MAX> не определено, вызов B<readdir_r>() может быть небезопасным, так как интерфейс не позволяет вызывающему задать длину буфера, который используется для возврата элемента каталога.

source: On some systems, B<readdir_r>() can't read directory entries with very long names. When the glibc implementation encounters such a name, B<readdir_r>() fails with the error B<ENAMETOOLONG> I<after the final directory entry has been read>. On some other systems, B<readdir_r>() may return a success status, but the returned I<d_name> field may not be null terminated or may be truncated.
ru: В некоторых системах B<readdir_r>() не может прочитать элементы каталога с очень длинными именами. Когда реализации glibc встречается такое имя, вызов B<readdir_r>() завершается с ошибкой B<ENAMETOOLONG> I<только после чтения последнего элемента каталога>. В других системах B<readdir_r>() может выполняться без ошибок, но возвращаемое поле I<d_name> может не завершаться null или может быть обрезанным.

source: In the current POSIX.1 specification (POSIX.1-2008), B<readdir>(3) is not required to be thread-safe. However, in modern implementations (including the glibc implementation), concurrent calls to B<readdir>(3) that specify different directory streams are thread-safe. Therefore, the use of B<readdir_r>() is generally unnecessary in multithreaded programs. In cases where multiple threads must read from the same directory stream, using B<readdir>(3) with external synchronization is still preferable to the use of B<readdir_r>(), for the reasons given in the points above.
ru: В текущей спецификации POSIX.1 (POSIX.1-2008), от B<readdir>(3) не требуется быть нитебезопасной. Однако в современных реализациях (включая glibc) параллельные вызовы B<readdir>(3) для различных потоков каталога являются нитебезопасными. Поэтому использовать B<readdir_r>() в многонитевых программах, обычно, не требуется. В случаях, когда несколько нитей должны читать один поток каталога, всё равно предпочтительней использовать B<readdir>(3) с внешней синхронизацией, а не B<readdir_r>(), по причинам, описанным выше.

source: It is expected that a future version of POSIX.1 will make B<readdir_r>() obsolete, and require that B<readdir>(3) be thread-safe when concurrently employed on different directory streams.
ru: Ожидается, что в будущей версии POSIX.1 функция B<readdir_r>() будет помечена как устаревшая, а для B<readdir>(3) будет требоваться нитебезопасность при одновременной работе с разными потоками каталога.

source: The B<readdir_r>() function returns 0 on success. On error, it returns a positive error number (listed under ERRORS). If the end of the directory stream is reached, B<readdir_r>() returns 0, and returns NULL in I<*result>.
ru: При успешном выполнении функция B<readdir_r>() возвращает 0. При ошибке она возвращает положительный номер ошибки (перечислены в ОШИБКАХ). Если достигнут конец потока каталога, то B<readdir_r>() возвращает 0 и NULL в I<*result>.

source: Invalid directory stream descriptor I<dirp>.
ru: Неверный дескриптор потока каталога I<dirp>.

source: A directory entry whose name was too long to be read was encountered.
ru: Обнаружено слишком длинное имя элемента каталога для чтения.

source: rpc - library routines for remote procedure calls
ru: rpc - библиотечные функции для вызова удалённых процедур

source: SYNOPSIS AND DESCRIPTION
ru: СИНТАКСИС И ОПИСАНИЕ
