Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: I/O error. This will happen for example when the process is in a background process group, tries to read from its controlling terminal, and either it is ignoring or blocking B<SIGTTIN> or its process group is orphaned. It may also occur when there is a low-level I/O error while reading from a disk or tape. A further possible cause of B<EIO> on networked filesystems is when an advisory lock had been taken out on the file descriptor and this lock has been lost. See the I<Lost locks> section of B<fcntl>(2) for further details.
ru: Ошибка ввода/вывода. Например, это происходит когда процесс, находящийся в фоновой группе процессов, пытается выполнить чтение из своего управляющего терминала, и игнорирует или блокирует сигнал B<SIGTTIN>, или же его группа процессов осталась без родителя. Это также может случиться, если произошла низкоуровневая ошибка ввода-вывода при чтении с диска или ленты. Также B<EIO> может возникать у сетевых файловых систем, когда консультативная блокировка была убрана у дескриптора файла и потеряна. Подробности смотрите в абзаце I<Потерянные блокировки> в B<fcntl>(2).

source: I<fd> refers to a directory.
ru: I<fd> указывает на каталог.

source: Other errors may occur, depending on the object connected to I<fd>.
ru: В зависимости от объекта, на который указывает I<fd>, могут происходить и другие ошибки.

source: The types I<size_t> and I<ssize_t> are, respectively, unsigned and signed integer data types specified by POSIX.1.
ru: Типы данных I<size_t> и I<ssize_t> представляющие собой, соответственно, беззнаковый и знаковый целочисленные типы, определены в POSIX.1.

source: On Linux, B<read>() (and similar system calls) will transfer at most 0x7ffff000 (2,147,479,552) bytes, returning the number of bytes actually transferred. (This is true on both 32-bit and 64-bit systems.)
ru: В Linux B<read>() (и похожие системные вызовы) передаст не больше 0x7ffff000 (2 147 479 552) байт, возвращая число байт, переданных на самом деле (это утверждение справедливо как к 32-битным, так и к 64-битным системам).

source: On NFS filesystems, reading small amounts of data will update the timestamp only the first time, subsequent calls may not do so. This is caused by client side attribute caching, because most if not all NFS clients leave I<st_atime> (last file access time) updates to the server, and client side reads satisfied from the client's cache will not cause I<st_atime> updates on the server as there are no server-side reads. UNIX semantics can be obtained by disabling client-side attribute caching, but in most situations this will substantially increase server load and decrease performance.
ru: На файловых системах NFS чтение небольших порций данных обновляет отметки времени только в первый раз, последующие вызовы не делают этого. Это вызвано кэшированием атрибутов с клиентской стороны, потому что большинство (если не все) клиентов NFS предоставляют серверу обновлять I<st_atime> (время последнего доступа), а запросы на чтение, которые удовлетворяются из клиентского кэша, не вызывают обновления I<st_atime>, потому что данные не читаются с сервера. Семантика UNIX может быть достигнута запретом кэширования атрибутов на стороне клиента, но в большинстве случаев это увеличит нагрузку на сервер и снизит производительность.

source: According to POSIX.1-2008/SUSv4 Section XSI 2.9.7 ("Thread Interactions with Regular File Operations"):
ru: Согласно POSIX.1-2008/SUSv4 раздел XSI 2.9.7 («Thread Interactions with Regular File Operations»):

source: All of the following functions shall be atomic with respect to each other in the effects specified in POSIX.1-2008 when they operate on regular files or symbolic links: ...
ru: Следующие функции должны выполняться атомарно по отношению друг к другу, чтобы работать с обычными файлами или символическими ссылками так, как указано в POSIX.1-2008: …

source: Among the APIs subsequently listed are B<read>() and B<readv>(2). And among the effects that should be atomic across threads (and processes) are updates of the file offset. However, on Linux before version 3.14, this was not the case: if two processes that share an open file description (see B<open>(2)) perform a B<read>() (or B<readv>(2)) at the same time, then the I/O operations were not atomic with respect updating the file offset, with the result that the reads in the two processes might (incorrectly) overlap in the blocks of data that they obtained. This problem was fixed in Linux 3.14.
ru: Среди перечисленных в программном интерфейсе есть B<read>() и B<readv>(2). И среди действий, которые должны выполняться атомарно между нитями (и процессами), если обновление файлового смещения. Однако в Linux до версии 3.14 это было не так: если два процесса с общим открытым файловым описанием (смотрите B<open>(2)) выполняют B<read>() (или B<readv>(2)) одновременно, то операции ввода-вывода не атомарны при обновлении файлового смещения; в результате прочитанные двумя процессами блоки данных могут (некорректно) перекрываться. Эта ошибка исправлена в Linux 3.14.

source: readahead - initiate file readahead into page cache
ru: readahead - включает упреждающее чтение файла в кэш страниц

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>

source: B<readahead>() initiates readahead on a file so that subsequent reads from that file will be satisfied from the cache, and not block on disk I/O (assuming the readahead was initiated early enough and that other activity on the system did not in the meantime flush pages from the cache).
ru: Вызов B<readahead>() включает упреждающее чтение (initiates readahead) из файла таким образом, что последующие операции чтения этого файла будут брать данные их кэша и не блокировать дисковый ввод-вывод (предполагается, что упреждающее чтение началось раньше и что другие действия в системе не выбросили страницы из кэша).

source: The I<fd> argument is a file descriptor identifying the file which is to be read. The I<offset> argument specifies the starting point from which data is to be read and I<count> specifies the number of bytes to be read. I/O is performed in whole pages, so that I<offset> is effectively rounded down to a page boundary and bytes are read up to the next page boundary greater than or equal to I<(offset+count)>. B<readahead>() does not read beyond the end of the file. The file offset of the open file description referred to by the file descriptor I<fd> is left unchanged.
ru: Аргумент I<fd> — это файловый дескриптор файла для чтения. В аргументе I<offset> указывает начальная точка, от которой нужно читать данные и в I<count> задаётся количество читаемых байт. Ввод-вывод выполняется во все страницы, так что I<offset> эффективно округляется в меньшую сторону к границе страницы и байты читаются до границы следующей страницы, большей или равной I<(offset+count)>. Вызов B<readahead>() не выполняет чтения за концом файла. Файловое смещение открытого файлового описания, на который указывает файловый дескриптор I<fd>, остаётся неизменным.

source: On success, B<readahead>() returns 0; on failure, -1 is returned, with I<errno> set to indicate the cause of the error.
ru: При успешном выполнении B<readahead>() возвращает 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: I<fd> does not refer to a file type to which B<readahead>() can be applied.
ru: I<fd> указывает на файл с типом, который нельзя использовать в B<readahead>().

source: The B<readahead>() system call appeared in Linux 2.4.13; glibc support has been provided since version 2.3.
ru: Системный вызов B<readahead>() появился в Linux 2.4.13; поддержка в glibc началась с версии 2.3.

source: The B<readahead>() system call is Linux-specific, and its use should be avoided in portable applications.
ru: Системный вызов B<readahead>() есть только в Linux, и не должен использоваться в переносимых приложениях.

source: On some 32-bit architectures, the calling signature for this system call differs, for the reasons described in B<syscall>(2).
ru: На некоторых 32-битных архитектурах интерфейс системного вызова отличается от описанного выше, по причинам указанным в B<syscall>(2).

source: B<readahead>() attempts to schedule the reads in the background and return immediately. However, it may block while it reads the filesystem metadata needed to locate the requested blocks. This occurs frequently with ext[234] on large files using indirect blocks instead of extents, giving the appearance that the call blocks until the requested data has been read.
ru: Вызов B<readahead>() пытается запланировать чтение в фоновом режиме и сразу завершается. Однако, он может заблокироваться на время чтения метаданных файловой системы, необходимых для обнаружения запрашиваемых блоков. Это часто происходит ext[234] для больших файлов, у которых используются косвенные (indirect) блоки вместо непрерывных (extents), что приводит к блокировке вызова на время прочтения нужных данных.

source: readlink, readlinkat - read value of a symbolic link
ru: readlink, readlinkat - считывает значение символьной ссылки

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>unistd.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> >/* определения констант of AT_* */ B<#include E<lt>unistd.hE<gt>>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: _XOPEN_SOURCE\ E<gt>=\ 500 || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* в версиях glibc E<lt>= 2.19: */ _BSD_SOURCE

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: B<readlink>() places the contents of the symbolic link I<pathname> in the buffer I<buf>, which has size I<bufsiz>. B<readlink>() does not append a null byte to I<buf>. It will (silently) truncate the contents (to a length of I<bufsiz> characters), in case the buffer is too small to hold all of the contents.
ru: Вызов B<readlink>() помещает содержимое символьной ссылки I<pathname> в буфер I<buf> размером I<bufsiz>. B<readlink>() не добавляет в I<buf> байт null. Если буфер слишком мал для хранения всего содержимого, то содержимое будет урезано (без выдачи ошибки, до длины в I<bufsiz> символов).

source: The B<readlinkat>() system call operates in exactly the same way as B<readlink>(), except for the differences described here.
ru: Системный вызов B<readlinkat>() работает также как системный вызов B<readlink>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<readlink>() for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<readlink>()).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<readlink>()).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<readlink>()).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то I<dirfd> игнорируется.

source: Since Linux 2.6.39, I<pathname> can be an empty string, in which case the call operates on the symbolic link referred to by I<dirfd> (which should have been obtained using B<open>(2) with the B<O_PATH> and B<O_NOFOLLOW> flags).
ru: Начиная с Linux .6.39, I<pathname> может быть пустой строкой; при этом вызов выполняет действие с символьной ссылкой, на которую ссылается I<dirfd> (должна получаться с помощью вызова B<open>(2) с флагами B<O_PATH> и B<O_NOFOLLOW>).

source: See B<openat>(2) for an explanation of the need for B<readlinkat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<readlinkat>().

source: On success, these calls return the number of bytes placed in I<buf>. (If the returned value equals I<bufsiz>, then truncation may have occurred.) On error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении эти вызовы возвращают количество байт, помещённых в I<buf> (если возвращаемое значение равно I<bufsiz>, то возможно произошло обрезание). В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Search permission is denied for a component of the path prefix. (See also B<path_resolution>(7).)
ru: В одном из каталогов префикса пути не разрешён поиск (см. также B<path_resolution>(7).

source: I<buf> extends outside the process's allocated address space.
ru: I<buf> выходит за пределы адресного пространства, выделенного процессу.

source: I<bufsiz> is not positive.
ru: Аргумент I<bufsiz> содержит отрицательное значение.

source: The named file (i.e., the final filename component of I<pathname>) is not a symbolic link.
ru: Указанный файл (т. е., последний компонент имени файла I<pathname>) не является символьной ссылкой.

source: An I/O error occurred while reading from the filesystem.
ru: При чтении файловой системы произошла ошибка ввода-вывода.

source: Too many symbolic links were encountered in translating the pathname.
ru: Во время определения pathname встретилось слишком много символьных ссылок.

source: A pathname, or a component of a pathname, was too long.
ru: Слишком длинное значение аргумента pathname или его части.

source: The named file does not exist.
ru: Указанный файл не существует.

source: Insufficient kernel memory was available.
ru: Недостаточное количество памяти ядра.

source: A component of the path prefix is not a directory.
ru: Компонент в префиксе пути не является каталогом.

source: The following additional errors can occur for B<readlinkat>():
ru: В B<readlinkat>() дополнительно могут возникнуть следующие ошибки:

source: I<dirfd> is not a valid file descriptor.
ru: I<dirfd> не является правильным файловым дескриптором.

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
ru: Значение I<pathname> содержит относительный путь и I<dirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог.

source: B<readlinkat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Системный вызов B<readlinkat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: B<readlink>(): 4.4BSD (B<readlink>() first appeared in 4.2BSD), POSIX.1-2001, POSIX.1-2008.
ru: B<readlink>(): 4.4BSD (B<readlink>() появился в 4.2BSD), POSIX.1-2001, POSIX.1-2008.

source: In versions of glibc up to and including glibc 2.4, the return type of B<readlink>() was declared as I<int>. Nowadays, the return type is declared as I<ssize_t>, as (newly) required in POSIX.1-2001.
ru: В версиях glibc до glibc 2.4 включительно, тип результата B<readlink>() был объявлен как I<int>. В настоящее время типом возвращаемого результата является I<ssize_t>, как (теперь) это требуется по POSIX.1-2001.

source: Using a statically sized buffer might not provide enough room for the symbolic link contents. The required size for the buffer can be obtained from the I<stat.st_size> value returned by a call to B<lstat>(2) on the link. However, the number of bytes written by B<readlink>() and B<readlinkat>() should be checked to make sure that the size of the symbolic link did not increase between the calls. Dynamically allocating the buffer for B<readlink>() and B<readlinkat>() also addresses a common portability problem when using I<PATH_MAX> for the buffer size, as this constant is not guaranteed to be defined per POSIX if the system does not have such limit.
ru: Буфера с фиксированным размером может не хватить для хранения содержимого символьной ссылки. Требуемый размер буфера можно получить как значение I<stat.st_size>, возвращаемое на ссылку вызовом B<lstat>(2). Однако, количество байт, записанное B<readlink>() и B<readlinkat>(), должно быть проверено, так как требуется убедиться, что размер символьной ссылки не увеличился между вызовами. Динамическое выделение буфера для B<readlink>() и B<readlinkat>() также поможет решить проблему с переносимостью, которая возникает, когда для размера буфера используется I<PATH_MAX>, но согласно POSIX для этой константы не гарантируется, что она определена , если система не имеет такого ограничения.

source: Glibc notes
ru: Замечания по glibc

source: On older kernels where B<readlinkat>() is unavailable, the glibc wrapper function falls back to the use of B<readlink>(). When I<pathname> is a relative pathname, glibc constructs a pathname based on the symbolic link in I</proc/self/fd> that corresponds to the I<dirfd> argument.
ru: В старых ядрах, где B<readlinkat>() отсутствует, обёрточная функция glibc использует B<readlink>(). Если I<pathname> является относительным путём, то glibc собирает путь относительно символической ссылки в I</proc/self/fd>, которая соответствует аргументу I<dirfd>.

source: The following program allocates the buffer needed by B<readlink>() dynamically from the information provided by B<lstat>(2), falling back to a buffer of size B<PATH_MAX> in cases where B<lstat>(2) reports a size of zero.
ru: Следующая программа динамически выделяет буфер, необходимый B<readlink>(), из информации, предоставленной B<lstat>(2), или использует буфер размером B<PATH_MAX>, если B<lstat>(2) вернул нулевой размер.

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>pathnameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s E<lt>путьE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Add one to the link size, so that we can determine whether the buffer returned by readlink() was truncated. */
ru: /* Добавляем единицу к размеру ссылки, так чтобы можно было определить обрезанность буфера, возвращаемого readlink(). */

source: /* Some magic symlinks under (for example) /proc and /sys report \(aqst_size\(aq as zero. In that case, take PATH_MAX as a "good enough" estimate. */
ru: /* У некоторых символьных ссылок в (например) /proc и /sys значение \(aqst_size\(aq равно нулю. В этом случае используется PATH_MAX как «достаточный» размер. */

source: printf("\(aq%s\(aq points to \(aq%.*s\(aq\en", argv[1], (int) nbytes, buf);
ru: printf("\(aq%s\(aq указывает на \(aq%.*s\(aq\en", argv[1], (int) nbytes, buf);

source: /* If the return value was equal to the buffer size, then the the link target was larger than expected (perhaps because the target was changed between the call to lstat() and the call to readlink()). Warn the user that the returned target may have been truncated. */
ru: /* Если возвращаемое значение равно размеру буфера, то ссылка назначения больше чем ожидалось (возможно, из-за того, что цель изменилась между вызовом lstat() и readlink()). Предупреждаем пользователя о том, что цель может быть обрезана. */

source: if (nbytes == bufsiz) printf("(Returned buffer may have been truncated)\en");
ru: if (nbytes == bufsiz) printf("(Возвращённый буфер мог быть обрезан)\en");

source: remap_file_pages - create a nonlinear file mapping
ru: remap_file_pages - создаёт нелинейное файловое отображение

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>

source: B<Note>: this system call was marked as deprecated starting with Linux 3.16. In Linux 4.0, the implementation was replaced by a slower in-kernel emulation. Those few applications that use this system call should consider migrating to alternatives. This change was made because the kernel code for this system call was complex, and it is believed to be little used or perhaps even completely unused. While it had some use cases in database applications on 32-bit systems, those use cases don't exist on 64-bit systems.
ru: B<Замечание>: данный системный вызов, начиная с Linux 3.16, устарел. В Linux 4.0 реализация была заменена на более медленную эмуляцию ядром. В приложениях, где он используется, нужно применять альтернативные вызовы. Данное изменение было сделано из-за сложности кода ядра этого системного вызова, и считается, что им почти никто или вообще никто не пользуется. Какое-то время он использовался в приложениях баз данных на 32-разрядных системах, но этих вариантов использования на 64-разрядных системах замечено не было.

source: The B<remap_file_pages>() system call is used to create a nonlinear mapping, that is, a mapping in which the pages of the file are mapped into a nonsequential order in memory. The advantage of using B<remap_file_pages>() over using repeated calls to B<mmap>(2) is that the former approach does not require the kernel to create additional VMA (Virtual Memory Area) data structures.
ru: Системный вызов B<remap_file_pages>() используется для создания нелинейного отображения, то есть отображения, в котором страницы файла отображаются в память непоследовательно. Преимущество использования B<remap_file_pages>() по сравнению с повторением вызовов B<mmap>(2) в том, что первый не требует от ядра создания дополнительных структур данных VMA (областей виртуальной памяти).

source: To create a nonlinear mapping we perform the following steps:
ru: Для создания нелинейного отображения выполните следующее:

source: Use B<mmap>(2) to create a mapping (which is initially linear). This mapping must be created with the B<MAP_SHARED> flag.
ru: Создайте отображение (пока линейное) с помощью B<mmap>(2). Данное отображение должно создаваться с флагом B<MAP_SHARED>.

source: Use one or more calls to B<remap_file_pages>() to rearrange the correspondence between the pages of the mapping and the pages of the file. It is possible to map the same page of a file into multiple locations within the mapped region.
ru: Выполните переупорядочивание соответствия между страницами отображения и страницами файла с помощью одного или нескольких вызовов B<remap_file_pages>(). Возможно отображать одну страницу файла в несколько мест отображаемой области.

source: The I<pgoff> and I<size> arguments specify the region of the file that is to be relocated within the mapping: I<pgoff> is a file offset in units of the system page size; I<size> is the length of the region in bytes.
ru: В аргументах I<pgoff> и I<size> указывается область файла, которая будет перенесёна в отображение: в I<pgoff> задаётся смещение в файле, измеряемое в размерах системных страниц; в I<size> задаётся длина области в байтах.

source: The I<addr> argument serves two purposes. First, it identifies the mapping whose pages we want to rearrange. Thus, I<addr> must be an address that falls within a region previously mapped by a call to B<mmap>(2). Second, I<addr> specifies the address at which the file pages identified by I<pgoff> and I<size> will be placed.
ru: Аргумент I<addr> предназначен для двух целей. Во-первых, им определяется отображение, чьи страницы мы хотим перенести. То есть в I<addr> должен быть указан адрес в области, которая была ранее отображена с помощью вызова B<mmap>(2). Во-вторых, в I<addr> указывается адрес, по которому должны быть помещены файловые страницы, заданные I<pgoff> и I<size>.
