Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: If B<request_key>() is called from a program invoked by B<request_key>() on behalf of some other process to generate a key, then the keyrings of that other process will be searched next, using that other process's user ID, group ID, supplementary group IDs, and security context to determine access.
ru: Если B<request_key>() вызван из программы, вызванной B<request_key>() от имени какого-то другого процесс для генерации ключа, то в дальнейшем будет осуществлён поиск по связкам ключей этого другого процесса, используя для определения доступа его идентификатор пользователя, группы и дополнительных групп и контекста безопасности.

source: The search of the keyring tree is breadth-first: the keys in each keyring searched are checked for a match before any child keyrings are recursed into. Only keys for which the caller has I<search> permission be found, and only keyrings for which the caller has I<search> permission may be searched.
ru: Поиск в дереве связок ключей выполняется сначала в ширину: искомые ключи в каждой связке проверяются на совпадение до рекурсивного перехода в дочерние связки ключей. Найдены могут быть только те ключи, которые разрешены вызывающему для B<поиска>, и поиск может осуществляться только в разрешённых для B<поиска> связках ключей.

source: If the key is not found and I<callout> is NULL, then the call fails with the error B<ENOKEY>.
ru: Если ключ не найден и I<callout> равно NULL, то вызов завершается ошибкой B<ENOKEY>.

source: If the key is not found and I<callout> is not NULL, then the kernel attempts to invoke a user-space program to instantiate the key. The details are given below.
ru: Если ключ не найден и I<callout> не равно NULL, то ядро пытается вызвать пользовательскую программу для создания ключа. Подробности приведены ниже.

source: The I<dest_keyring> serial number may be that of a valid keyring for which the caller has I<write> permission, or it may be one of the following special keyring IDs:
ru: Серийный номер I<dest_keyring> может задаваться серийным номером допустимой связки ключей, на которую у вызывающего есть права на I<запись>, или же это может быть один из следующих специальных идентификаторов связок ключей:

source: This specifies the caller's thread-specific keyring (see B<thread-keyring>(7)).
ru: Связка ключей вызывающей нити (смотрите B<thread-keyring>(7)).

source: This specifies the caller's process-specific keyring (see B<process-keyring>(7)).
ru: Связка ключей вызывающего процесса (смотрите B<process-keyring>(7)).

source: This specifies the caller's session-specific keyring (see B<session-keyring>(7)).
ru: Связка ключей сеанса вызывающего (смотрите B<session-keyring>(7)).

source: This specifies the caller's UID-specific keyring (see B<user-keyring>(7)).
ru: Связка ключей по UID вызывающего (смотрите B<user-keyring>(7)).

source: This specifies the caller's UID-session keyring (see B<user-session-keyring>(7)).
ru: Связка ключей по UID сеанса вызывающего (смотрите B<user-session-keyring>(7)).

source: When the I<dest_keyring> is specified as 0 and no key construction has been performed, then no additional linking is done.
ru: Если I<dest_keyring> равно 0 и создание ключа не выполнено, то дополнительных связей не появляется.

source: Otherwise, if I<dest_keyring> is 0 and a new key is constructed, the new key will be linked to the "default" keyring. More precisely, when the kernel tries to determine to which keyring the newly constructed key should be linked, it tries the following keyrings, beginning with the keyring set via the B<keyctl>(2) B<KEYCTL_SET_REQKEY_KEYRING> operation and continuing in the order shown below until it finds the first keyring that exists:
ru: В противном случае, если I<dest_keyring> равно 0 и создан новый ключ, то новый ключ будет прицеплен в связку ключей «по умолчанию». Более точно, когда ядро пытается определить в какую связку ключей должен быть прицеплен то только что созданный ключ, оно перебирает связки ключей начиная с со связки, установленной через B<keyctl>(2) с операцией B<KEYCTL_SET_REQKEY_KEYRING> и продолжает в порядке, показанном далее, пока не найдёт существующую связку ключей:

source: The requestor keyring (B<KEY_REQKEY_DEFL_REQUESTOR_KEYRING>, since Linux 2.6.29).
ru: Связка ключей запрашивающего (B<KEY_REQKEY_DEFL_REQUESTOR_KEYRING>, начиная с Linux 2.6.29).

source: The thread-specific keyring (B<KEY_REQKEY_DEFL_THREAD_KEYRING>; see B<thread-keyring>(7)).
ru: Связка ключей нити (B<KEY_REQKEY_DEFL_THREAD_KEYRING>; смотрите B<thread-keyring>(7)).

source: The process-specific keyring (B<KEY_REQKEY_DEFL_PROCESS_KEYRING>; see B<process-keyring>(7)).
ru: Связка ключей процесса (B<KEY_REQKEY_DEFL_PROCESS_KEYRING>; смотрите B<process-keyring>(7)).

source: The session-specific keyring (B<KEY_REQKEY_DEFL_SESSION_KEYRING>; see B<session-keyring>(7)).
ru: Связка ключей сеанса (B<KEY_REQKEY_DEFL_SESSION_KEYRING>; смотрите B<session-keyring>(7)).

source: The session keyring for the process's user ID (B<KEY_REQKEY_DEFL_USER_SESSION_KEYRING>; see B<user-session-keyring>(7)). This keyring is expected to always exist.
ru: Связка ключей сеанса для идентификатора пользователя процесса (B<KEY_REQKEY_DEFL_USER_SESSION_KEYRING>; смотрите B<user-session-keyring>(7)). Ожидается, что эта связка ключей всегда существует.

source: The UID-specific keyring (B<KEY_REQKEY_DEFL_USER_KEYRING>; see B<user-keyring>(7)). This keyring is also expected to always exist.
ru: Связка ключей для идентификатора пользователя процесса (B<KEY_REQKEY_DEFL_USER_KEYRING>; смотрите B<user-keyring>(7)). Ожидается, что эта связка ключей также всегда существует.

source: If the B<keyctl>(2) B<KEYCTL_SET_REQKEY_KEYRING> operation specifies B<KEY_REQKEY_DEFL_DEFAULT> (or no B<KEYCTL_SET_REQKEY_KEYRING> operation is performed), then the kernel looks for a keyring starting from the beginning of the list.
ru: Если вызов B<keyctl>(2) с операцией B<KEYCTL_SET_REQKEY_KEYRING> установил B<KEY_REQKEY_DEFL_DEFAULT> (или операция B<KEYCTL_SET_REQKEY_KEYRING> не выполнялась), то ядро ищет связку ключей начиная с начала списка.

source: Requesting user-space instantiation of a key
ru: Запрос на создание ключа из пользовательского пространства

source: If the kernel cannot find a key matching I<type> and I<description>, and I<callout> is not NULL, then the kernel attempts to invoke a user-space program to instantiate a key with the given I<type> and I<description>. In this case, the following steps are performed:
ru: Если ядро не может найти ключ с соответствующим I<type> и I<description>, и I<callout> не равно NULL, то ядро пытается вызвать программу из пользовательского пространства для создания ключа с заданными I<type> и I<description>. В этом случае выполняются следующие шаги:

source: a)
ru: а)

source: The kernel creates an uninstantiated key, U, with the requested I<type> and I<description>.
ru: Ядро создаёт неинициализированный ключ U с запрошенными I<type> и I<description>.

source: b)
ru: б)

source: The kernel creates an authorization key, V, that refers to the key U and records the facts that the caller of B<request_key>() is:
ru: Ядро создаёт ключ авторизации V, который ссылается на ключ U и сохраняются данные вызывающего B<request_key>():

source: the context in which the key U should be instantiated and secured, and
ru: контекст, в котором ключ U должен быть создан и защищён и

source: the context from which associated key requests may be satisfied.
ru: контекст, из которого запросы связанного ключа могут быть проведены.

source: The authorization key is constructed as follows:
ru: Ключ авторизации создаётся со следующими свойствами:

source: The key type is I<".request_key_auth">.
ru: Тип ключа — I<".request_key_auth">.

source: The key's UID and GID are the same as the corresponding filesystem IDs of the requesting process.
ru: UID и GID ключа совпадают с ID в файловой системе для запрашивающего процесса.

source: The key grants I<view>, I<read>, and I<search> permissions to the key possessor as well as I<view> permission for the key user.
ru: Ключ даёт права на I<просмотр>, I<чтение> и I<поиск> на ключ-владелец, а также право I<просмотра> для ключа пользователя.

source: The description (name) of the key is the hexadecimal string representing the ID of the key that is to be instantiated in the requesting program.
ru: Описание (имя) ключа представляет собой Шестнадцатеричную строку идентификатора ключа, который будет создан в запрашивающей программе.

source: The payload of the key is taken from the data specified in I<callout_info>.
ru: Полезные данные ключа берутся из данных I<callout_info>.

source: Internally, the kernel also records the PID of the process that called B<request_key>().
ru: Внутри ядра также сохраняется PID процесса, который был вызван B<request_key>().

source: c)
ru: в)

source: The kernel creates a process that executes a user-space service such as B<request-key>(8) with a new session keyring that contains a link to the authorization key, V.
ru: Ядро создаёт процесс, который запускает службу пользовательского пространства, такую как B<request-key>(8), с новой связкой ключей сеанса с прицепленным ключом авторизации V.

source: This program is supplied with the following command-line arguments:
ru: Данной программе передаются следующие аргументы командной строки:

source: The string I<"/sbin/request-key">.
ru: Строка I<"/sbin/request-key">.

source: The string I<"create"> (indicating that a key is to be created).
ru: Строка I<"create"> (показывающая, что ключ будет создан).

source: The ID of the key that is to be instantiated.
ru: Идентификатор ключа, который будет создан.

source: The filesystem UID of the caller of B<request_key>().
ru: UID (в файловой системе) вызывающего B<request_key>().

source: The filesystem GID of the caller of B<request_key>().
ru: GID (в файловой системе) вызывающего B<request_key>().

source: The ID of the thread keyring of the caller of B<request_key>(). This may be zero if that keyring hasn't been created.
ru: Идентификатор связки ключей нити вызывающего B<request_key>(). Может быть ноль, если связка ключей не создана.

source: The ID of the process keyring of the caller of B<request_key>(). This may be zero if that keyring hasn't been created.
ru: Идентификатор связки ключей процесса вызывающего B<request_key>(). Может быть ноль, если связка ключей не создана.

source: The ID of the session keyring of the caller of B<request_key>().
ru: Идентификатор связки ключей сеанса вызывающего B<request_key>().

source: I<Note>: each of the command-line arguments that is a key ID is encoded in I<decimal> (unlike the key IDs shown in I</proc/keys>, which are shown as hexadecimal values).
ru: I<Замечание>: каждый аргумент командной строки, обозначающий идентификатор ключа, кодируется I<десятичным> числом (в отличие от идентификаторов ключе, показанных в I</proc/keys>, которые выдаются в виде шестнадцатеричных значений).

source: d)
ru: г)

source: The program spawned in the previous step:
ru: Программа, порождённая на предыдущем шаге:

source: Assumes the authority to instantiate the key U using the B<keyctl>(2) B<KEYCTL_ASSUME_AUTHORITY> operation (typically via the B<keyctl_assume_authority>(3) function).
ru: Принимает полномочия на создание ключа U с помощью B<keyctl>(2) с операцией B<KEYCTL_ASSUME_AUTHORITY> (обычно, с помощью функции B<keyctl_assume_authority>(3)).

source: Obtains the callout data from the payload of the authorization key V (using the B<keyctl>(2) B<KEYCTL_READ> operation (or, more commonly, the B<keyctl_read>(3) function) with a key ID value of B<KEY_SPEC_REQKEY_AUTH_KEY>).
ru: Получает исходящие данные (callout data) из полезной нагрузки ключа авторизации V (с помощью B<keyctl>(2) с операцией B<KEYCTL_READ> (или, чаще всего, с помощью функции B<keyctl_read>(3)) с значением идентификатора ключа B<KEY_SPEC_REQKEY_AUTH_KEY>.

source: Instantiates the key (or execs another program that performs that task), specifying the payload and destination keyring. (The destination keyring that the requestor specified when calling B<request_key>() can be accessed using the special key ID B<KEY_SPEC_REQUESTOR_KEYRING>.) Instantiation is performed using the B<keyctl>(2) B<KEYCTL_INSTANTIATE> operation (or, more commonly, the B<keyctl_instantiate>(3) function). At this point, the B<request_key>() call completes, and the requesting program can continue execution.
ru: Создаёт ключ (или выполняет другую программу, которая делает эту работу), с заданной полезной нагрузкой и связкой ключей назначения (связка ключей назначения та, которую запрашивающий указал при вызове B<request_key>(), и которая быть доступна через специальный идентификатор ключа B<KEY_SPEC_REQUESTOR_KEYRING>). Создание выполняется с помощью B<keyctl>() с операцией B<KEYCTL_INSTANTIATE> (или, чаще всего, с помощью функции B<keyctl_instantiate>(3)). На этот момент вызов B<request_key>() завершается и запрашивающая программа может продолжать выполнение.

source: If these steps are unsuccessful, then an B<ENOKEY> error will be returned to the caller of B<request_key>() and a temporary, negatively instantiated key will be installed in the keyring specified by I<dest_keyring>. This will expire after a few seconds, but will cause subsequent calls to B<request_key>() to fail until it does. The purpose of this negatively instantiated key is to prevent (possibly different) processes making repeated requests (that require expensive B<request-key>(8) upcalls) for a key that can't (at the moment) be positively instantiated.
ru: Если какой-то из этих шагов завершается ошибкой, то вызвавшему B<request_key>() возвращается B<ENOKEY> и временно в связку ключей I<dest_keyring> будет установлен отрицательно инициализированный ключ. Он устареет через несколько секунд, но пока этого не произойдёт все последующие вызовы B<request_key>() будут завершаться ошибкой. Целью данного отрицательно инициализированного ключа является предотвращение повторяющихся запросов (возможно разными) процессами (они требуют затратных восходящих вызовов B<request-key>(8)) для ключа, который невозможно (в данный момент) положительно инициализировать.

source: Once the key has been instantiated, the authorization key (B<KEY_SPEC_REQKEY_AUTH_KEY>) is revoked, and the destination keyring (B<KEY_SPEC_REQUESTOR_KEYRING>) is no longer accessible from the B<request-key>(8) program.
ru: После инициализации ключа, ключ авторизации (B<KEY_SPEC_REQKEY_AUTH_KEY>) отзывается и связка ключей назначения (B<KEY_SPEC_REQUESTOR_KEYRING>) становится недоступной программе B<request-key>(8).

source: If a key is created, then\(emregardless of whether it is a valid key or a negatively instantiated key\(emit will displace any other key with the same type and description from the keyring specified in I<dest_keyring>.
ru: Если ключ создан, то независимо от какой он — корректный или отрицательно инициализированный — вытеснит любой другой ключ с тем же типом и описанием из связки ключей I<dest_keyring>.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On success, B<request_key>() returns the serial number of the key it found or caused to be created. On error, -1 is returned and I<errno> is set to indicate the cause of the error.
ru: При успешном выполнении B<request_key>() возвращается серийный номер найденного или созданного ключа. При ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: The keyring wasn't available for modification by the user.
ru: Изменение связки ключей пользователю недоступно.

source: The key quota for this user would be exceeded by creating this key or linking it to the keyring.
ru: Квота на ключи для данного пользователя была бы превышена, если бы этот ключ создался или был бы прицеплен в связку ключей.

source: One of I<type>, I<description>, or I<callout_info> points outside the process's accessible address space.
ru: Значение I<type>, I<description> или I<callout_info> указывают вне доступного адресного пространства процесса.

source: The request was interrupted by a signal; see B<signal>(7).
ru: Запрос был прерван сигналом; смотрите B<signal>(7).

source: The size of the string (including the terminating null byte) specified in I<type> or I<description> exceeded the limit (32 bytes and 4096 bytes respectively).
ru: Размер строки (включая конечный байт null), заданной в I<type> или I<description>, превышает ограничение (32 байта и 4096 байт, соответственно).

source: The size of the string (including the terminating null byte) specified in I<callout_info> exceeded the system page size.
ru: Размер строки (включая конечный байт null), заданной в I<callout_info>, превышает размер системной страницы.

source: An expired key was found, but no replacement could be obtained.
ru: Найден просроченный ключ, и замена не может быть получена.

source: The attempt to generate a new key was rejected.
ru: Попытка генерации нового ключа была отвергнута.

source: A revoked key was found, but no replacement could be obtained.
ru: Найден отозванный ключ, и замена не может быть получена.

source: No matching key was found.
ru: Искомый ключ не найден.

source: Insufficient memory to create a key.
ru: Недостаточно памяти для создания ключа.

source: The I<type> argument started with a period (\(aq.\(aq).
ru: Аргумент I<type> начинается с точки (\(aq.\(aq).

source: This system call first appeared in Linux 2.6.10. The ability to instantiate keys upon request was added in Linux 2.6.13.
ru: Данный системный вызов впервые появился в Linux 2.6.10. Возможность инициализации ключей по запросу была добавлена в Linux 2.6.13.

source: This system call is a nonstandard Linux extension.
ru: Этот системный вызов является нестандартным расширением Linux.

source: No wrapper for this system call is provided in glibc. A wrapper is provided in the I<libkeyutils> package. When employing the wrapper in that library, link with I<-lkeyutils>.
ru: В glibc нет обёрточной функции для этого системного вызова. Такая функция предоставляется пакетом I<libkeyutils>. Для работы с функцией подключите библиотеку с помощью I<-lkeyutils>.

source: The program below demonstrates the use of B<request_key>(). The I<type>, I<description>, and I<callout_info> arguments for the system call are taken from the values supplied in the command-line arguments. The call specifies the session keyring as the target keyring.
ru: В программе, представленной ниже, показано использование B<request_key>(). Аргументы I<type>, I<description> и I<callout_info> для системного вызова берутся из значений, переданных в аргументах командной строки. В качестве связки ключей назначения вызов использует связку ключей сеанса.

source: In order to demonstrate this program, we first create a suitable entry in the file I</etc/request-key.conf>.
ru: Чтобы показать работу программы сначала нужно создать подходящую запись в файле I</etc/request-key.conf>.

source: This entry specifies that when a new "user" key with the prefix "mtk:" must be instantiated, that task should be performed via the B<keyctl>(1) command's B<instantiate> operation. The arguments supplied to the B<instantiate> operation are: the ID of the uninstantiated key (I<%k>); the callout data supplied to the B<request_key>() call (I<%c>); and the session keyring (I<%S>) of the requestor (i.e., the caller of B<request_key>()). See B<request-key.conf>(5) for details of these I<%> specifiers.
ru: Эта запись говорит о том, что когда должен быть создан новый ключ «user» с префиксом «mtk:», задача должна выполняться посредством команды B<keyctl>(1) с операцией B<instantiate>. Аргументы, передаваемые операции B<instantiate>: идентификатор неинициализированного ключа (I<%k>); исходящие данные, переданные в вызов B<request_key>() (I<%c>); связка ключей сеанса (I<%S>) запрашивающего (т. е., вызывающий B<request_key>()). Описание значений I<%> смотрите в B<request-key.conf>(5).

source: Then we run the program and check the contents of I</proc/keys> to verify that the requested key has been instantiated:
ru: Теперь запускаем программу и проверяем содержимое I</proc/keys>, чтобы удостовериться, что запрашиваемый ключ создан:

source: For another example of the use of this program, see B<keyctl>(2).
ru: Другой пример смотрите использования этой программы смотрите в B<keyctl>(2).

source: Program source
ru: Исходный код программы

source: if (argc != 4) { fprintf(stderr, "Usage: %s type description callout-data\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 4) { fprintf(stderr, "Использование: %s тип описание callout-data\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("Key ID is %lx\en", (long) key);
ru: printf("ID ключа = %lx\en", (long) key);

source: The kernel source files I<Documentation/security/keys/core.rst> and I<Documentation/keys/request-key.rst> (or, before Linux 4.13, in the files I<Documentation/security/keys.txt> and I<Documentation/security/keys-request-key.txt>).
ru: Файлы исходного кода ядра I<Documentation/security/keys/core.rst> и I<Documentation/keys/request-key.rst> (или, до Linux 4.13, файлы I<Documentation/security/keys.txt> и I<Documentation/security/keys-request-key.txt>).

source: recvmmsg - receive multiple messages on a socket
ru: recvmmsg - получает несколько сообщений из сокета

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sys/socket.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>sys/socket.hE<gt>>

source: The B<recvmmsg>() system call is an extension of B<recvmsg>(2) that allows the caller to receive multiple messages from a socket using a single system call. (This has performance benefits for some applications.) A further extension over B<recvmsg>(2) is support for a timeout on the receive operation.
ru: Системный вызов B<recvmmsg>() является расширенной версией B<recvmsg>(2), позволяя вызывающему получать несколько сообщений из сокета, используя только один системный вызов (в некоторых приложениях это позволяет получить выигрыш в производительности). Ещё одно улучшение B<recvmsg>(2) — настройка времени ожидания для операции получения.

source: The I<sockfd> argument is the file descriptor of the socket to receive data from.
ru: Аргумент I<sockfd> представляет собой файловый дескриптор сокета приёма данных.

source: The I<msgvec> argument is a pointer to an array of I<mmsghdr> structures. The size of this array is specified in I<vlen>.
ru: Аргумент I<msgvec> является указателем на массив структур I<mmsghdr>. Размер этого массива указывается в I<vlen>.

source: The I<mmsghdr> structure is defined in I<E<lt>sys/socket.hE<gt>> as:
ru: Структура I<mmsghdr> определена в I<E<lt>sys/socket.hE<gt>> следующим образом:

source: struct mmsghdr { struct msghdr msg_hdr; /* Message header */ unsigned int msg_len; /* Number of received bytes for header */ };
ru: struct mmsghdr { struct msghdr msg_hdr; /* Заголовок сообщения */ unsigned int msg_len; /* Количество полученных байт для заголовка */ };

source: The I<msg_hdr> field is a I<msghdr> structure, as described in B<recvmsg>(2). The I<msg_len> field is the number of bytes returned for the message in the entry. This field has the same value as the return value of a single B<recvmsg>(2) on the header.
ru: Поле I<msg_hdr> представляет собой структуру I<msghdr>, которая описана в B<recvmsg>(2). В поле I<msg_len> содержится количество байт возвращаемого сообщения в записи. Это поле имеет такое же значение, что и возвращаемое значение одиночного вызова B<recvmsg>(2) в заголовке.

source: The I<flags> argument contains flags ORed together. The flags are the same as documented for B<recvmsg>(2), with the following addition:
ru: Аргумент I<flags> содержит объединённые с помощью OR флаги. Флаги те же, что и у B<recvmsg>(2), но со следующим дополнением:

source: B<MSG_WAITFORONE> (since Linux 2.6.34)
ru: B<MSG_WAITFORONE> (начиная с Linux 2.6.34)
