Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: The B<iruserok>() and B<ruserok>() functions take a remote host's IP address or name, respectively, two usernames and a flag indicating whether the local user's name is that of the superuser. Then, if the user is I<not> the superuser, it checks the I</etc/hosts.equiv> file. If that lookup is not done, or is unsuccessful, the I<.rhosts> in the local user's home directory is checked to see if the request for service is allowed.
ru: Параметрами функций B<iruserok>() и B<ruserok>() являются, соответственно, IP-адрес или имя удалённого узла, два имени пользователя и флаг, указывающий, является ли имя локального пользователя именем суперпользователя. Далее, если пользователь I<не> является суперпользователем, они проверяют файл I</etc/hosts.equiv>. Если ничего не находится или завершается с ошибкой, то проверяется I<.rhosts> в домашнем каталоге пользователя (для получения информации о том, разрешены ли запросы к службе).

source: If this file does not exist, is not a regular file, is owned by anyone other than the user or the superuser, is writable by anyone other than the owner, or is hardlinked anywhere, the check automatically fails. Zero is returned if the machine name is listed in the I<hosts.equiv> file, or the host and remote username are found in the I<.rhosts> file; otherwise B<iruserok>() and B<ruserok>() return -1. If the local domain (as obtained from B<gethostname>(2)) is the same as the remote domain, only the machine name need be specified.
ru: Если этот файл не существует, не является обычным файлом, если его владельцем является не текущий пользователь или не суперпользователь, если он доступен для записи кому-то помимо владельца или на него есть жёсткая ссылка, то проверка завершается с ошибкой. Если имя машины указано в файле I<hosts.equiv>, или если узел и имя пользователя для удалённого доступа найдены в файле I<.rhosts>, то возвращается 0; иначе B<iruserok>() и B<ruserok>() возвращают -1. Если имя локального домена (полученное вызовом B<gethostname>(2)) совпадает с именем удалённого домена, то может указываться только имя машины.

source: If the IP address of the remote host is known, B<iruserok>() should be used in preference to B<ruserok>(), as it does not require trusting the DNS server for the remote host's domain.
ru: Если IP-адрес удалённого узла известен, то должна использоваться B<iruserok>() вместо B<ruserok>(), так как при этом не требуется доверия к DNS-серверу для домена удалённого узла.

source: *_af() variants
ru: Варианты *_af()

source: All of the functions described above work with IPv4 (B<AF_INET>) sockets. The "_af" variants take an extra argument that allows the socket address family to be specified. For these functions, the I<af> argument can be specified as B<AF_INET> or B<AF_INET6>. In addition, B<rcmd_af>() supports the use of B<AF_UNSPEC>.
ru: Все описанные ранее функции работают с сокетами IPv4 (B<AF_INET>). Варианты «_af» имеют дополнительный аргумент, который позволяет указать адресное семейство сокета. Для этих функций значением аргумента I<af> может быть B<AF_INET> или B<AF_INET6>. Также B<rcmd_af>() поддерживает использование B<AF_UNSPEC>.

source: The B<rcmd>() function returns a valid socket descriptor on success. It returns -1 on error and prints a diagnostic message on the standard error.
ru: Функция B<rcmd>() при успешном выполнении возвращает корректный номер дескриптора сокета. При ошибках возвращается -1 и в стандартный поток ошибок выводится диагностическое сообщение.

source: The B<rresvport>() function returns a valid, bound socket descriptor on success. It returns -1 on error with the global value I<errno> set according to the reason for failure. The error code B<EAGAIN> is overloaded to mean "All network ports in use."
ru: Функция B<rresvport>() при успешном выполнении возвращает корректный привязанный дескриптор сокета. При ошибках возвращается -1 и в глобальную переменную I<errno> записывается код ошибки. Код ошибки B<EAGAIN> означает «Все сетевые порты заняты».

source: For information on the return from B<ruserok>() and B<iruserok>(), see above.
ru: Информацию о результатах B<ruserok>() и B<iruserok>() смотрите выше.

source: The functions B<iruserok_af>(), B<rcmd_af>(), B<rresvport_af>(), and B<ruserok_af>() functions are provide in glibc since version 2.2.
ru: Функции B<iruserok_af>(), B<rcmd_af>(), B<rresvport_af>() и B<ruserok_af>() появились в glibc начиная с версии 2.2.

source: Not in POSIX.1. Present on the BSDs, Solaris, and many other systems. These functions appeared in 4.2BSD. The "_af" variants are more recent additions, and are not present on as wide a range of systems.
ru: Отсутствуют в POSIX.1. Есть в BSD, Solaris и многих других системах. Данные функции впервые появились в 4.2BSD. Варианты «_af» были добавлены позднее и распространены не так широко.

source: B<iruserok>() and B<iruserok_af>() are declared in glibc headers only since version 2.12.
ru: Функции B<iruserok>() и B<iruserok_af>() объявляются в заголовках glibc только начиная с версии 2.12.

source: round, roundf, roundl - round to nearest integer, away from zero
ru: round, roundf, roundl - округление до ближайшего целого в направлении от нуля

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: These functions round I<x> to the nearest integer, but round halfway cases away from zero (regardless of the current rounding direction, see B<fenv>(3)), instead of to the nearest even integer like B<rint>(3).
ru: Эти функции округляют аргумент I<x> до ближайшего целого значения, но при округлении в половине случаев используют направление округления от нуля (независимо от текущего направления округления, смотрите B<fenv>(3)), вместо округления до ближайшего чётного целого, как это делает функция B<rint>(3).

source: For example, I<round(0.5)> is 1.0, and I<round(-0.5)> is -1.0.
ru: Например, результат I<round(0.5)> будет равен 1.0, а I<round(-0.5)> будет равен -1.0.

source: These functions return the rounded integer value.
ru: Данные функции возвращают округлённое целое число.

source: If I<x> is integral, +0, -0, NaN, or infinite, I<x> itself is returned.
ru: Если I<x> целое, +0, -0, NaN или стремится к бесконечности, то будет возвращено значение I<x>.

source: No errors occur. POSIX.1-2001 documents a range error for overflows, but see NOTES.
ru: Ошибки не возникают. В документах POSIX.1-2001 описывается ошибка диапазона при переполнениях, однако смотрите ЗАМЕЧАНИЯ.

source: These functions first appeared in glibc in version 2.1.
ru: Эти функции впервые появились в glibc 2.1.

source: POSIX.1-2001 contains text about overflow (which might set I<errno> to B<ERANGE>, or raise an B<FE_OVERFLOW> exception). In practice, the result cannot overflow on any current machine, so this error-handling stuff is just nonsense. (More precisely, overflow can happen only when the maximum value of the exponent is smaller than the number of mantissa bits. For the IEEE-754 standard 32-bit and 64-bit floating-point numbers the maximum value of the exponent is 128 (respectively, 1024), and the number of mantissa bits is 24 (respectively, 53).)
ru: В POSIX.1-2001 есть текст о переполнении (которое может установить I<errno> в B<ERANGE> или вызвать исключение B<FE_OVERFLOW>). На практике, результат не может выйти за диапазон ни на каком компьютере, поэтому обработка этой ошибки не имеет смысла (точнее говоря, переполнение возможно только в том случае, когда максимальное значение экспоненты меньше числа бит мантиссы. В стандарте IEEE-754 для 32- и 64-битных чисел с плавающей точкой максимальное значение экспоненты равно 128 и 1024 соответственно, а число бит мантиссы — 24 и 53 соответственно).

source: If you want to store the rounded value in an integer type, you probably want to use one of the functions described in B<lround>(3) instead.
ru: Если вы хотите сохранить округлённое значение в целочисленном типе, то лучше использовать одну из функций, описанных в B<lround>(3).

source: rand, rand_r, srand - pseudo-random number generator
ru: rand, rand_r, srand - генератор псевдослучайных чисел

source: Since glibc 2.24: _POSIX_C_SOURCE E<gt>= 199506L
ru: начиная с glibc 2.24: _POSIX_C_SOURCE E<gt>= 199506L

source: Glibc 2.23 and earlier _POSIX_C_SOURCE
ru: в glibc 2.23 и старее _POSIX_C_SOURCE

source: The B<rand>() function returns a pseudo-random integer in the range 0 to B<RAND_MAX> inclusive (i.e., the mathematical range [0,\ B<RAND_MAX>]).
ru: Функция B<rand>() возвращает псевдослучайное целое число в диапазоне от нуля до B<RAND_MAX> включительно (т. е., из математического диапазона [0,\ B<RAND_MAX>]).

source: The B<srand>() function sets its argument as the seed for a new sequence of pseudo-random integers to be returned by B<rand>(). These sequences are repeatable by calling B<srand>() with the same seed value.
ru: Функция B<srand>() устанавливает свой аргумент как основу (seed) для новой последовательности псевдослучайных целых чисел, возвращаемых функцией B<rand>(). Эту последовательность можно воспроизвести. Для этого необходимо вызвать B<srand>() с той же величиной основы.

source: If no seed value is provided, the B<rand>() function is automatically seeded with a value of 1.
ru: Если основа не задана, то функция B<rand>() автоматически устанавливает её равной 1.

source: The function B<rand>() is not reentrant, since it uses hidden state that is modified on each call. This might just be the seed value to be used by the next call, or it might be something more elaborate. In order to get reproducible behavior in a threaded application, this state must be made explicit; this can be done using the reentrant function B<rand_r>().
ru: Функция B<rand>() не реентерабельная, так как она использует скрытое состояние, которое изменяется с каждым вызовом. Это может быть как просто значение основы, так и что-то более сложное. Чтобы получить воспроизводимое поведение в многонитевом приложении такое состояние нужно создать явным образом; это можно сделать с помощью реентерабельной функции B<rand_r>().

source: Like B<rand>(), B<rand_r>() returns a pseudo-random integer in the range [0,\ B<RAND_MAX>]. The I<seedp> argument is a pointer to an I<unsigned int> that is used to store state between calls. If B<rand_r>() is called with the same initial value for the integer pointed to by I<seedp>, and that value is not modified between calls, then the same pseudo-random sequence will result.
ru: Как и B<rand>(), B<rand_r>() возвращает псевдослучайное целое число из диапазона [0,\ B<RAND_MAX>]. Аргумент I<seedp> является указателем на число I<unsigned int>, которое используется для хранения состояния между вызовами. Если B<rand_r>() вызывается с одинаковым начальным значением целого, на которое указывает I<seedp>, и это значение не изменяется между вызовами, то результатом будет одинаковая псевдослучайная последовательность.

source: The value pointed to by the I<seedp> argument of B<rand_r>() provides only a very small amount of state, so this function will be a weak pseudo-random generator. Try B<drand48_r>(3) instead.
ru: Значение, на которое указывает аргумент I<seedp> для B<rand_r>(), предоставляет только очень малую часть состояния, поэтому данная функция будет очень не случайным псевдослучайным генератором. Используйте вместо неё B<drand48_r>(3).

source: The B<rand>() and B<rand_r>() functions return a value between 0 and B<RAND_MAX> (inclusive). The B<srand>() function returns no value.
ru: Функции B<rand>() и B<rand_r>() возвращают значение в промежутке от 0 до B<RAND_MAX> (включительно). Функция B<srand>() не возвращает результат.

source: The functions B<rand>() and B<srand>() conform to SVr4, 4.3BSD, C89, C99, POSIX.1-2001. The function B<rand_r>() is from POSIX.1-2001. POSIX.1-2008 marks B<rand_r>() as obsolete.
ru: Функции B<rand>() и B<srand>() описаны в SVr4, 4.3BSD, C89, C99, POSIX.1-2001. Функция B<rand_r>() описана в POSIX.1-2001. В POSIX.1-2008 функция B<rand_r>() помечена как устаревшая.

source: The versions of B<rand>() and B<srand>() in the Linux C Library use the same random number generator as B<random>(3) and B<srandom>(3), so the lower-order bits should be as random as the higher-order bits. However, on older B<rand>() implementations, and on current implementations on different systems, the lower-order bits are much less random than the higher-order bits. Do not use this function in applications intended to be portable when good randomness is needed. (Use B<random>(3) instead.)
ru: Версия функций B<rand>() и B<srand>() в библиотеке Си для Linux использует тот же генератор чисел, что и в функциях B<random>(3) и B<srandom>(3), так что младшие биты в числе случайны настолько, насколько и старшие. В то же время, в старых реализациях B<rand>() и в текущих реализациях на других системах младшие биты являются гораздо менее случайными, чем старшие. Не используйте эту функцию в переносимых приложениях, для которых требуется большая случайность (вместо неё используйте B<random>(3)).

source: POSIX.1-2001 gives the following example of an implementation of B<rand>() and B<srand>(), possibly useful when one needs the same sequence on two different machines.
ru: В POSIX.1-2001 приведён следующий пример реализации B<rand>() и B<srand>(), возможно полезный, если требуется одинаковая последовательность на двух разных машинах.

source: /* RAND_MAX assumed to be 32767 */ int myrand(void) { next = next * 1103515245 + 12345; return((unsigned)(next/65536) % 32768); }
ru: /* предполагается, что RAND_MAX равно 32767 */ int myrand(void) { next = next * 1103515245 + 12345; return((unsigned)(next/65536) % 32768); }

source: The following program can be used to display the pseudo-random sequence produced by B<rand>() when given a particular seed.
ru: Следующая программа может использоваться для отображения псевдослучайной последовательности, созданной B<rand>() при указании определённой основы.

source: if (argc != 3) { fprintf(stderr, "Usage: %s E<lt>seedE<gt> E<lt>nloopsE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 3) { fprintf(stderr, "Использование: %s E<lt>seedE<gt> E<lt>nloopsE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: rewinddir - reset directory stream
ru: rewinddir - сброс потока каталога

source: The B<rewinddir>() function resets the position of the directory stream I<dirp> to the beginning of the directory.
ru: Функция B<rewinddir>() сбрасывает текущее положение потока каталога I<dirp> в начало каталога.

source: The B<rewinddir>() function returns no value.
ru: Функция B<rewinddir>() ничего не возвращает.

source: rtnetlink - macros to manipulate rtnetlink messages
ru: rtnetlink - макросы для обработки сообщений rtnetlink

source: All B<rtnetlink>(7) messages consist of a B<netlink>(7) message header and appended attributes. The attributes should be manipulated only using the macros provided here.
ru: Все сообщения B<rtnetlink>(7) состоят из заголовка сообщений B<netlink>(7) и дополнительных атрибутов. Атрибуты могут быть обработаны только описанными здесь макросами.

source: B<RTA_OK(>I<rta>B<, >I<attrlen>B<)> returns true if I<rta> points to a valid routing attribute; I<attrlen> is the running length of the attribute buffer. When not true then you must assume there are no more attributes in the message, even if I<attrlen> is nonzero.
ru: B<RTA_OK(>I<rta>B<, >I<attrlen>B<)> возвращает истинное значение в случае, если I<rta> указывает на правильный атрибут маршрутизации; I<attrlen> — рабочая длина буфера атрибутов. Если возвращаемое значение ложно, то в сообщении больше нет атрибутов, даже если I<attrlen> не равно нулю.

source: B<RTA_DATA(>I<rta>B<)> returns a pointer to the start of this attribute's data.
ru: B<RTA_DATA(>I<rta>B<)> возвращает указатель на начало данных атрибута.

source: B<RTA_PAYLOAD(>I<rta>B<)> returns the length of this attribute's data.
ru: B<RTA_PAYLOAD(>I<rta>B<)> возвращает длину данных атрибута.

source: B<RTA_NEXT(>I<rta>B<, >I<attrlen>B<)> gets the next attribute after I<rta>. Calling this macro will update I<attrlen>. You should use B<RTA_OK> to check the validity of the returned pointer.
ru: B<RTA_NEXT(>I<rta>B<, >I<attrlen>B<)> считывает следующий за I<rta> атрибут. Вызов этого макроса обновит I<attrlen>. Для проверки правильности полученного указателя используйте B<RTA_OK>.

source: B<RTA_LENGTH(>I<len>B<)> returns the length which is required for I<len> bytes of data plus the header.
ru: B<RTA_LENGTH(>I<len>B<)> возвращает длину, которая требуется для I<len> байтов данных плюс заголовок.

source: B<RTA_SPACE(>I<len>B<)> returns the amount of space which will be needed in a message with I<len> bytes of data.
ru: B<RTA_SPACE(>I<len>B<)> возвращает количество места, которое требуется для сообщения с данными длиной I<len> байт.

source: These macros are nonstandard Linux extensions.
ru: Данные макросы являются нестандартными расширениями Linux.

source: Creating a rtnetlink message to set the MTU of a device:
ru: Создание сообщения rtnetlink для установки MTU устройства:

source: regcomp, regexec, regerror, regfree - POSIX regex functions
ru: regcomp, regexec, regerror, regfree - функции регулярных выражений POSIX

source: POSIX regex compiling
ru: Компилирование регулярных выражений POSIX

source: B<regcomp>() is used to compile a regular expression into a form that is suitable for subsequent B<regexec>() searches.
ru: Функция B<regcomp>() используется для компиляции регулярного выражения в формат, который подходит для последующих поисков с помощью B<regexec>().

source: B<regcomp>() is supplied with I<preg>, a pointer to a pattern buffer storage area; I<regex>, a pointer to the null-terminated string and I<cflags>, flags used to determine the type of compilation.
ru: B<regcomp>() передаётся указатель на область хранения буферного шаблона I<preg>, указатель на заканчивающуюся null строку I<regex> и флаги I<cflags>, используемые для определения типа компиляции.

source: All regular expression searching must be done via a compiled pattern buffer, thus B<regexec>() must always be supplied with the address of a B<regcomp>() initialized pattern buffer.
ru: Все поиски регулярных выражений должны выполняться с помощью скомпилированного буферного шаблона, поэтому B<regexec>() должна всегда вызываться с адресом буферного шаблона, инициализированного функцией B<regcomp>().

source: I<cflags> may be the bitwise-B<or> of zero or more of the following:
ru: Значение I<cflags> может состоять из поразрядного B<or> нуля или нескольких следующих значений:

source: Use B<POSIX> Extended Regular Expression syntax when interpreting I<regex>. If not set, B<POSIX> Basic Regular Expression syntax is used.
ru: Использовать синтаксис расширенных регулярных выражений POSIX во время интерпретации I<regex>. Если не включён этот флаг, то используется синтаксис простых регулярных выражений POSIX.

source: Do not differentiate case. Subsequent B<regexec>() searches using this pattern buffer will be case insensitive.
ru: Не учитывать регистр. Последующие поиски B<regexec>() с использованием данного буферного шаблона не будут зависеть от регистра.

source: Do not report position of matches. The I<nmatch> and I<pmatch> arguments to B<regexec>() are ignored if the pattern buffer supplied was compiled with this flag set.
ru: Не сообщать положение совпадений. Параметры I<nmatch> и I<pmatch> для B<regexec>() игнорируются, если данный буферный шаблон был скомпилирован с этим включённым флагом.

source: Match-any-character operators don't match a newline.
ru: Операторы совпадения с любым символом не совпадают с символом новой строки.

source: A nonmatching list (B<[^...]>) not containing a newline does not match a newline.
ru: Список несовпадающих символов (B<[^...]>) без символа новой строки не совпадает с новой строкой.

source: Match-beginning-of-line operator (B<^>) matches the empty string immediately after a newline, regardless of whether I<eflags>, the execution flags of B<regexec>(), contains B<REG_NOTBOL>.
ru: Оператор сравнения по началу строки (B<^>) совпадает с пустой строкой сразу после новой строки независимо от того, что I<eflags>, флаги выполнения B<regexec>(), содержат B<REG_NOTBOL>.

source: Match-end-of-line operator (B<$>) matches the empty string immediately before a newline, regardless of whether I<eflags> contains B<REG_NOTEOL>.
ru: Оператор сравнения по концу строки ($) совпадает с пустой строкой до символа начала строки независимо от того, что I<eflags> содержит B<REG_NOTEOL>.

source: POSIX regex matching
ru: Сравнение с регулярным выражением POSIX

source: B<regexec>() is used to match a null-terminated string against the precompiled pattern buffer, I<preg>. I<nmatch> and I<pmatch> are used to provide information regarding the location of any matches. I<eflags> may be the bitwise-B<or> of one or both of B<REG_NOTBOL> and B<REG_NOTEOL> which cause changes in matching behavior described below.
ru: Функция B<regexec>() используется для сравнения строки, завершающейся null, с предварительно обработанным буферным шаблоном I<preg>. Аргументы I<nmatch> и I<pmatch> используются для предоставления информации о местонахождении любых совпадений. Значение I<eflags> может быть поразрядным B<ИЛИ> одного или обоих значений B<REG_NOTBOL> и B<REG_NOTEOL>. Данные значения определяют поведение процесса сравнения так, как описано ниже.

source: The match-beginning-of-line operator always fails to match (but see the compilation flag B<REG_NEWLINE> above). This flag may be used when different portions of a string are passed to B<regexec>() and the beginning of the string should not be interpreted as the beginning of the line.
ru: Оператор сравнения по началу строки всегда завершается с ошибкой (но смотрите описанный выше флаг компиляции B<REG_NEWLINE>). Этот флаг может использоваться, когда в B<regexec>() передаются отдельные части строки, и начало такой строки в данном случае не должно интерпретироваться как начало новой строки.

source: The match-end-of-line operator always fails to match (but see the compilation flag B<REG_NEWLINE> above).
ru: Оператор сравнения по концу строки всегда завершается с ошибкой (но смотрите описанный выше флаг компиляции B<REG_NEWLINE>).

source: Byte offsets
ru: Байтовые смещения

source: Unless B<REG_NOSUB> was set for the compilation of the pattern buffer, it is possible to obtain match addressing information. I<pmatch> must be dimensioned to have at least I<nmatch> elements. These are filled in by B<regexec>() with substring match addresses. The offsets of the subexpression starting at the I<i>th open parenthesis are stored in I<pmatch[i]>. The entire regular expression's match addresses are stored in I<pmatch[0]>. (Note that to return the offsets of I<N> subexpression matches, I<nmatch> must be at least I<N+1>.) Any unused structure elements will contain the value -1.
ru: Если B<REG_NOSUB> не установлен при компиляции буферного шаблона, то возможно получать информацию о положении совпадений. Значение I<pmatch> должно быть определено так, чтобы иметь, по крайней мере, I<nmatch> элементов. Они заполняются B<regexec>() адресами внутристрочных совпадений. Смещения подвыражения, начинающегося с I<i>-й открытой скобки, сохраняется в I<pmatch[i]>. Адрес совпадения всего регулярного выражения сохраняется в I<pmatch[0]> (заметим, что чтобы вернуть смещения совпадений I<N> подвыражений, значение I<nmatch> должно быть не менее I<N+1>). Любые неиспользованные элементы структуры будут содержать значение -1.

source: The I<regmatch_t> structure which is the type of I<pmatch> is defined in I<E<lt>regex.hE<gt>>.
ru: Структура I<regmatch_t>, являющаяся типом I<pmatch>, определена в I<E<lt>regex.hE<gt>>:
