Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: Sets the amount of time the resolver will wait for a response from a remote name server before retrying the query via a different name server. This may B<not> be the total time taken by any resolver API call and there is no guarantee that a single resolver API call maps to a single timeout. Measured in seconds, the default is B<RES_TIMEOUT> (currently 5, see I<E<lt>resolv.hE<gt>>). The value for this option is silently capped to 30.
ru: Задаёт промежуток времени, который функции определения имён будут ждать ответа от удалённого сервера имён перед тем как повторить запрос другому серверу имён. Он I<не> может быть равным общему времени, затрачиваемым вызовом программного интерфейса определителя, и не гарантируется, что один вызов программного интерфейса определителя соответствует одному промежутку. Измеряется в секундах, по умолчанию B<RES_TIMEOUT> (в настоящее время равно 5, смотрите I<E<lt>resolv.hE<gt>>). Значение этого параметра внутренне доходит до 30.

source: Sets the number of times the resolver will send a query to its name servers before giving up and returning an error to the calling application. The default is B<RES_DFLRETRY> (currently 2, see I<E<lt>resolv.hE<gt>>). The value for this option is silently capped to 5.
ru: Задаёт количество раз, которое функции определения имён будут посылать запрос серверам имён перед тем как закончить работу и вернуть ошибку вызывавшему их приложению. По умолчанию равно B<RES_DFLRETRY> (в настоящее время 2, см. I<E<lt>resolv.hE<gt>>). Значение этого параметра внутренне доходит до 5.

source: Sets B<RES_ROTATE> in I<_res.options>, which causes round-robin selection of name servers from among those listed. This has the effect of spreading the query load among all listed servers, rather than having all clients try the first listed server first every time.
ru: Задаёт значение B<RES_ROTATE> в I<_res.options>, что приводит к циклическому выбору указанных серверов имён. Это приводит к распределению нагрузки среди серверов, чтобы исключить использование каждый раз только первого сервера всеми клиентами.

source: Sets B<RES_NOCHECKNAME> in I<_res.options>, which disables the modern BIND checking of incoming hostnames and mail names for invalid characters such as underscore (_), non-ASCII, or control characters.
ru: Задаёт значение B<RES_NOCHECKNAME> в I<_res.options>, что приводит к выключению в современном BIND проверки в поступающих именах узлов и почтовых именах недопустимых символов, таких как символы подчёркивания (_), не-ASCII или управляющие символы.

source: Sets B<RES_USE_INET6> in I<_res.options>. This has the effect of trying an AAAA query before an A query inside the B<gethostbyname>(3) function, and of mapping IPv4 responses in IPv6 "tunneled form" if no AAAA records are found but an A record set exists. Since glibc 2.25, this option is deprecated; applications should use B<getaddrinfo>(3), rather than B<gethostbyname>(3).
ru: Задаёт значение B<RES_USE_INET6> в I<_res.options>. Это приводит к выполнению запроса AAAA раньше запроса A внутри функции B<gethostbyname>(3), и отображению ответов IPv4 в «туннелированную форму» IPv6, если записи AAAA не были обнаружены, но есть запись типа A. Начиная с glibc 2.25 этот параметр считается устаревшим; приложения должны использовать B<getaddrinfo>(3), а не B<gethostbyname>(3).

source: B<ip6-bytestring> (since glibc 2.3.4)
ru: B<ip6-bytestring> (начиная с glibc 2.3.4)

source: Sets B<RES_USEBSTRING> in I<_res.options>. This causes reverse IPv6 lookups to be made using the bit-label format described in RFC\ 2673; if this option is not set (which is the default), then nibble format is used. This option was removed in glibc 2.25, since it relied on a backward-incompatible DNS extension that was never deployed on the Internet.
ru: Задаёт значение B<RES_USE_BSTRING> в I<_res.options>. Это приводит к поиску обратной записи IPv6 с помощью формата значимых битов, описанного в RFC\ 2673; если этот параметр не задан (по умолчанию), то используется полубайтовый формат. Данный параметр был удалён в glibc 2.25, так как он полагается на обратно несовместимое расширение DNS, которое никогда не разворачивалось в Интернете.

source: B<ip6-dotint>/B<no-ip6-dotint> (glibc 2.3.4 to 2.24)
ru: B<ip6-dotint>/B<no-ip6-dotint> (glibc 2.3.4 по 2.24)

source: Clear/set B<RES_NOIP6DOTINT> in I<_res.options>. When this option is clear (B<ip6-dotint>), reverse IPv6 lookups are made in the (deprecated) I<ip6.int> zone; when this option is set (B<no-ip6-dotint>), reverse IPv6 lookups are made in the I<ip6.arpa> zone by default. These options are available in glibc versions up to 2.24, where B<no-ip6-dotint> is the default. Since B<ip6-dotint> support long ago ceased to be available on the Internet, these options were removed in glibc 2.25.
ru: Устанавливает/сбрасывает значение B<RES_NOIP6DOTINT> в I<_res.options>. Если указан сброс (B<ip6-dotint>), то выполняется поиск обратной записи IPv6 (устарел) в зоне I<ip6.int>; если задана установка (B<no-ip6-dotint>), то по умолчанию выполняется поиск обратной записи IPv6 в зоне I<ip6.arpa>. Данные параметры доступны в glibc до версии 2.24, где B<no-ip6-dotint> используется по умолчанию. Так как поддержка B<ip6-dotint> давно приостановлена в Интернете, то эти параметры удалены в glibc 2.25.

source: B<edns0> (since glibc 2.6)
ru: B<edns0> (начиная с glibc 2.6)

source: Sets B<RES_USE_EDNSO> in I<_res.options>. This enables support for the DNS extensions described in RFC\ 2671.
ru: Задаёт значение B<RES_USE_EDNSO> в I<_res.options>. Включает поддержку расширений DNS, описанных в RFC\ 2671.

source: B<single-request> (since glibc 2.10)
ru: B<single-request> (начиная с glibc 2.10)

source: Sets B<RES_SNGLKUP> in I<_res.options>. By default, glibc performs IPv4 and IPv6 lookups in parallel since version 2.9. Some appliance DNS servers cannot handle these queries properly and make the requests time out. This option disables the behavior and makes glibc perform the IPv6 and IPv4 requests sequentially (at the cost of some slowdown of the resolving process).
ru: Задаёт значение B<RES_SNGLKUP> в I<_res.options>. По умолчанию, glibc начиная с версии 2.9 выполняет поиск по IPv4 и IPv6 параллельно. Некоторые приложения DNS-серверов не могут обработать такие запросы должным образом и делают паузу между ответами на запрос. Этот параметр отключает данное поведение, что заставляет glibc делать запросы IPv6 и IPv4 последовательно (что замедляет процесс определения имени).

source: B<single-request-reopen> (since glibc 2.9)
ru: B<single-request-reopen> (начиная с glibc 2.9)

source: Sets B<RES_SNGLKUPREOP> in I<_res.options>. The resolver uses the same socket for the A and AAAA requests. Some hardware mistakenly sends back only one reply. When that happens the client system will sit and wait for the second reply. Turning this option on changes this behavior so that if two requests from the same port are not handled correctly it will close the socket and open a new one before sending the second request.
ru: Задаёт B<RES_SNGLKUPREOP> в I<_res.options>. Для разрешения имён используется единый сокет для запросов A а AAAA. Некоторая аппаратура ошибочно посылает обратно только один ответ. Когда это происходит, клиент остаётся ждать второго ответа. Указание этого параметра изменяет такое поведение так, что если два запроса с одного порта не обрабатываются правильно, то сокет будет закрыт и открыт новый перед посылкой второго запроса.

source: B<no-tld-query> (since glibc 2.14)
ru: B<no-tld-query> (начиная с glibc 2.14)

source: Sets B<RES_NOTLDQUERY> in I<_res.options>. This option causes B<res_nsearch>() to not attempt to resolve an unqualified name as if it were a top level domain (TLD). This option can cause problems if the site has ``localhost'' as a TLD rather than having localhost on one or more elements of the search list. This option has no effect if neither RES_DEFNAMES or RES_DNSRCH is set.
ru: Задаёт значение RES_NOTLDQUERY в I<_res.options>. Этот параметр указывает B<res_nsearch>() не пытаться определить неполное имя как если бы это домен верхнего уровня. Данный параметр может привести к проблемам, если сайт указал «localhost» как TLD, но содержит localhost в одном или более элементах списка поиска. Данный параметр не действует, если не установлен RES_DEFNAMES или RES_DNSRCH.

source: B<use-vc> (since glibc 2.14)
ru: B<use-vc> (начиная с glibc 2.14)

source: Sets B<RES_USEVC> in I<_res.options>. This option forces the use of TCP for DNS resolutions.
ru: Задаёт B<RES_USEVC> в I<_res.options>. Данный параметр включает принудительное использование TCP для запросов DNS.

source: B<no-reload> (since glibc 2.26)
ru: B<no-reload> (начиная с glibc 2.26)

source: Sets B<RES_NORELOAD> in I<_res.options>. This option disables automatic reloading of a changed configuration file.
ru: Устанавливает B<RES_NORELOAD> в I<_res.options>. Этот параметр выключает автоматическую перезагрузку изменённого файла настройки.

source: The I<domain> and I<search> keywords are mutually exclusive. If more than one instance of these keywords is present, the last instance wins.
ru: Ключевые слова I<domain> и I<search> являются взаимоисключающими. Если они указаны более одного раза, то используется значение последнего.

source: The I<search> keyword of a system's I<resolv.conf> file can be overridden on a per-process basis by setting the environment variable B<LOCALDOMAIN> to a space-separated list of search domains.
ru: Значение ключевого слова I<search> в системном файле I<resolv.conf> может быть изменено назначением переменной окружения для определённого процесса B<LOCALDOMAIN> списка доменов, разделённых пробелами.

source: The I<options> keyword of a system's I<resolv.conf> file can be amended on a per-process basis by setting the environment variable B<RES_OPTIONS> to a space-separated list of resolver options as explained above under B<options>.
ru: Значение ключевого слова I<options> в системном файле I<resolv.conf> может быть дополнено назначением переменной окружения для определённого процесса B<RES_OPTIONS> списка вышеописанных в B<options> параметров настройки функций определения имён.

source: The keyword and value must appear on a single line, and the keyword (e.g., B<nameserver>) must start the line. The value follows the keyword, separated by white space.
ru: Ключевое слово и значение должны быть в одной строке, и кроме того, ключевое слово(например, B<nameserver>), должно быть в начале строки. Значение должно отделяться от ключевого слова пробельным символом.

source: Lines that contain a semicolon (;) or hash character (#) in the first column are treated as comments.
ru: Строки, в которых в первой колонке содержится точка с запятой (;) или символ решётки (#), считаются комментариями.

source: Name Server Operations Guide for BIND
ru: Руководство по работе с сервером имён BIND

source: random, srandom, initstate, setstate - random number generator
ru: random, srandom, initstate, setstate - генератор случайных чисел

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версиях glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: The B<random>() function uses a nonlinear additive feedback random number generator employing a default table of size 31 long integers to return successive pseudo-random numbers in the range from 0 to B<RAND_MAX>. The period of this random number generator is very large, approximately I<16\ *\ ((2^31)\ -\ 1)>.
ru: Функция B<random>() использует нелинейный возвратно-аддитивный генератор случайных чисел, используя по умолчанию таблицу из 31-ого длинного целого числа и возвращает очередное псевдослучайное число в промежутке от 0 до B<RAND_MAX>. Период этого генератора очень велик, приблизительно I<16\ *\ ((2^31)\ -\ 1)>.

source: The B<srandom>() function sets its argument as the seed for a new sequence of pseudo-random integers to be returned by B<random>(). These sequences are repeatable by calling B<srandom>() with the same seed value. If no seed value is provided, the B<random>() function is automatically seeded with a value of 1.
ru: Функция B<srandom>() устанавливает свой аргумент в качестве семени для новой последовательности псевдослучайных чисел, которые будут возвращаться функцией B<random>(). Эти последовательности повторяются, если вызывать B<srandom>() с тем же значением семени. Если значение семени не указано, то функция B<random>() автоматически устанавливает его равным 1.

source: The B<initstate>() function allows a state array I<state> to be initialized for use by B<random>(). The size of the state array I<n> is used by B<initstate>() to decide how sophisticated a random number generator it should use\(emthe larger the state array, the better the random numbers will be. Current "optimal" values for the size of the state array I<n> are 8, 32, 64, 128, and 256 bytes; other amounts will be rounded down to the nearest known amount. Using less than 8 bytes results in an error. I<seed> is the seed for the initialization, which specifies a starting point for the random number sequence, and provides for restarting at the same point.
ru: Функция B<initstate>() позволяет инициализировать массив состояния I<state> для использования в функции B<random>(). Размер массива состояния I<n> используется B<initstate>() для определения, какой сложности генератор случайных чисел необходимо использовать — чем больше массив, тем полученные числа будут более случайными. Текущие «оптимальные» значения размера массива состояния I<n>: 8, 32, 64, 128 и 256 байт; другие значения будут округлены до ближайшей нижней границы. Если значения меньше 8 байт, то возвращается ошибка. Значение I<seed> — это семя последовательности для инициализации, которое определяет стартовую точку последовательности псевдослучайных чисел и позволяет перезапустить последовательность с той же точки.

source: The B<setstate>() function changes the state array used by the B<random>() function. The state array I<state> is used for random number generation until the next call to B<initstate>() or B<setstate>(). I<state> must first have been initialized using B<initstate>() or be the result of a previous call of B<setstate>().
ru: Функция B<setstate>() изменяет состояние массива состояния, используемого в B<random>(). Массив состояния I<state> используется для генерации случайных чисел до следующего вызова B<initstate>() или B<setstate>(). Значение I<state> должно быть инициализировано с помощью функции B<initstate>() или результатом предыдущего вызова B<setstate>().

source: The B<random>() function returns a value between 0 and B<RAND_MAX>. The B<srandom>() function returns no value.
ru: Функция B<random>() возвращает значение в промежутке от 0 до B<RAND_MAX>. Функция B<srandom>() не возвращает значение.

source: The B<initstate>() function returns a pointer to the previous state array. On error, I<errno> is set to indicate the cause.
ru: Функция B<initstate>() возвращает указатель на предыдущий массив состояния. При ошибке в I<errno> записывается соответствующий код.

source: On success, B<setstate>() returns a pointer to the previous state array. On error, it returns NULL, with I<errno> set to indicate the cause of the error.
ru: При успешном выполнении функция B<setstate>() возвращает указатель на предыдущий массив состояния. При ошибке она возвращает NULL и в I<errno> записывает соответствующий код.

source: The I<state> argument given to B<setstate>() was NULL.
ru: Аргумент I<state>, указанный B<setstate>(), равен NULL.

source: A state array of less than 8 bytes was specified to B<initstate>().
ru: Функции B<initstate>() передан массив состояния меньше 8 байт.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: The B<random>() function should not be used in multithreaded programs where reproducible behavior is required. Use B<random_r>(3) for that purpose.
ru: Функция B<random>() не должна использоваться в многонитевых программах, где требуется повторение поведения. Для этих целей используйте B<random_r>(3).

source: Random-number generation is a complex topic. I<Numerical Recipes in C: The Art of Scientific Computing> (William H.\& Press, Brian P.\& Flannery, Saul A.\& Teukolsky, William T.\& Vetterling; New York: Cambridge University Press, 2007, 3rd ed.) provides an excellent discussion of practical random-number generation issues in Chapter 7 (Random Numbers).
ru: Генерация случайных чисел является сложной проблемой. В главе 7 (Random Numbers) I<Numerical Recipes in C: The Art of Scientific Computing> (William H.\& Press, Brian P.\& Flannery, Saul A.\& Teukolsky, William T.\& Vetterling; New York: Cambridge University Press, 2007, 3rd ed.) приведено великолепное обсуждение проблем практического применения генерации случайных чисел.

source: For a more theoretical discussion which also covers many practical issues in depth, see Chapter 3 (Random Numbers) in Donald E.\& Knuth's I<The Art of Computer Programming>, volume 2 (Seminumerical Algorithms), 2nd ed.; Reading, Massachusetts: Addison-Wesley Publishing Company, 1981.
ru: Также вы можете обратиться к теоретическому обсуждению, которое также объясняет многие практические проблемы, приведенному в главе 3 (Random Numbers) второго тома I<Искусства программирования> Дональда Кнута (The Art of Computer Programming, volume 2 (Seminumerical Algorithms), 2nd ed.; Reading, Massachusetts: Addison-Wesley Publishing Company, 1981).

source: According to POSIX, B<initstate>() should return NULL on error. In the glibc implementation, I<errno> is (as specified) set on error, but the function does not return NULL.
ru: Согласно POSIX, B<initstate>() должна возвращать NULL при ошибке. Реализация glibc в I<errno> записывает код ошибки (как по стандарту), но не возвращает NULL.

source: rcmd, rresvport, iruserok, ruserok, rcmd_af, rresvport_af, iruserok_af, ruserok_af - routines for returning a stream to a remote command
ru: rcmd, rresvport, iruserok, ruserok, rcmd_af, rresvport_af, iruserok_af, ruserok_af - процедуры возврата потока в удалённую команду

source: B<#include E<lt>netdb.hE<gt> \ \ >/* Or E<lt>unistd.hE<gt> on some systems */
ru: B<#include E<lt>netdb.hE<gt> \ \ >/* или E<lt>unistd.hE<gt> в некоторых системах */

source: B<rcmd>(), B<rcmd_af>(), B<rresvport>(), B<rresvport_af>(), B<iruserok>(), B<iruserok_af>(), B<ruserok>(), B<ruserok_af>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<rcmd>(), B<rcmd_af>(), B<rresvport>(), B<rresvport_af>(), B<iruserok>(), B<iruserok_af>(), B<ruserok>(), B<ruserok_af>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE

source: The B<rcmd>() function is used by the superuser to execute a command on a remote machine using an authentication scheme based on privileged port numbers. The B<rresvport>() function returns a file descriptor to a socket with an address in the privileged port space. The B<iruserok>() and B<ruserok>() functions are used by servers to authenticate clients requesting service with B<rcmd>(). All four functions are used by the B<rshd>(8) server (among others).
ru: Функция B<rcmd>() применяется суперпользователем для исполнения команды на удалённой машине при помощи схемы аутентификации, основанной на зарезервированных номерах портов. Функция B<rresvport>() возвращает файловый дескриптор сокета с адресом в привилегированном пространстве портов. Функции B<iruserok>() и B<ruserok>() используются серверами для аутентификации клиентов, запрашивающих сервис B<rcmd>(). Все четыре функции используются сервером B<rshd>(8) (среди прочих).

source: The B<rcmd>() function looks up the host I<*ahost> using B<gethostbyname>(3), returning -1 if the host does not exist. Otherwise, I<*ahost> is set to the standard name of the host and a connection is established to a server residing at the well-known Internet port I<inport>.
ru: Функция B<rcmd>() ищет узел I<*ahost>, используя B<gethostbyname>(3) и возвращает -1, если узел не существует. Иначе I<*ahost> устанавливается равным стандартному имени узла, при этом создаётся соединение с сервером на хорошо известном порту Интернет I<inport>.

source: If the connection succeeds, a socket in the Internet domain of type B<SOCK_STREAM> is returned to the caller, and given to the remote command as I<stdin> and I<stdout>. If I<fd2p> is nonzero, then an auxiliary channel to a control process will be set up, and a file descriptor for it will be placed in I<*fd2p>. The control process will return diagnostic output from the command (unit 2) on this channel, and will also accept bytes on this channel as being UNIX signal numbers, to be forwarded to the process group of the command. If I<fd2p> is 0, then the I<stderr> (unit 2 of the remote command) will be made the same as the I<stdout> and no provision is made for sending arbitrary signals to the remote process, although you may be able to get its attention by using out-of-band data.
ru: Если соединение успешно установлено, то вызывающему возвращается сокет в домене Интернет типа B<SOCK_STREAM>, который для удалённой команды считается I<stdin> и I<stdout>. Если I<fd2p> не равно нулю, то устанавливается вспомогательный канал до управляющего процесса, а его файловый дескриптор будет помещён в I<*fd2p>. Управляющий процесс возвращает диагностический вывод из команды (устройства 2) в этот канал, а также принимает байты из этого канала, считая их номерами сигналов UNIX, для их пересылки группе процессов команды. Если I<fd2p> равно 0, то I<stderr> (устройство 2 удалённой команды) будет работать аналогично I<stdout> и для отправки произвольных сигналов в удалённый процесс не будет создано никаких ходов, хотя вы сможете привлечь к себе внимание, используя внеполосную передачу данных.

source: The protocol is described in detail in B<rshd>(8).
ru: Протокол подробно описан в B<rshd>(8).

source: The B<rresvport>() function is used to obtain a socket with a privileged port bound to it. This socket is suitable for use by B<rcmd>() and several other functions. Privileged ports are those in the range 0 to 1023. Only a privileged process (on Linux: a process that has the B<CAP_NET_BIND_SERVICE> capability in the user namespace governing its network namespace). is allowed to bind to a privileged port. In the glibc implementation, this function restricts its search to the ports from 512 to 1023. The I<port> argument is value-result: the value it supplies to the call is used as the starting point for a circular search of the port range; on (successful) return, it contains the port number that was bound to.
ru: Функция B<rresvport>() используется для получения сокета с привязанным привилегированным портом. Этот сокет подходит для использования функцией B<rcmd>() и некоторыми другими. Привилегированные порты Интернет — это порты с номерами от 0 до 1023. Только привилегированный процесс (в Linux это процесс с мандатом B<CAP_NET_BIND_SERVICE> в пользовательском пространстве имён, управляющим своим сетевым пространством имён) может привязаться к привилегированному порту. В реализации glibc эта функция ограничена в использовании портов номерами с 512 по 1023. Аргумент I<port> является значением-результатом: передаваемое в вызов значение используется в качестве начальной точки кругового поиска в диапазоне портов; при (успешном) возврате, он содержит номер порта, к которому была осуществлена привязка.

source: iruserok() and ruserok()
ru: iruserok() и ruserok()
