Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_r/*.po
Languages: ru

source: These routines allow C programs to make procedure calls on other machines across the network. First, the client calls a procedure to send a data packet to the server. Upon receipt of the packet, the server calls a dispatch routine to perform the requested service, and then sends back a reply. Finally, the procedure call returns to the client.
ru: Эти функции позволяют программам, созданным на Си, вызывать удалённые процедуры на других машинах в сети. Сначала, клиент вызывает процедуру путём отправки пакета с данными на сервер. После принятия пакета сервер вызывает функцию распределения (dispatch) для выполнения запрошенной службы и отсылает ответ обратно. Последним действием результат выполнения процедуры возвращается клиенту.

source: To take use of these routines, include the header file I<E<lt>rpc/rpc.hE<gt>>.
ru: Чтобы использовать эти функции, включите заголовочный файл I<E<lt>rpc/rpc.hE<gt>>.

source: The prototypes below make use of the following types:
ru: Представленные ниже прототипы позволяют использовать следующие типы:

source: See the header files for the declarations of the I<AUTH>, I<CLIENT>, I<SVCXPRT>, and I<XDR> types.
ru: Объявления типов I<AUTH>, I<CLIENT>, I<SVCXPRT> и I<XDR> смотрите в заголовочных файлах.

source: A macro that destroys the authentication information associated with I<auth>. Destruction usually involves deallocation of private data structures. The use of I<auth> is undefined after calling B<auth_destroy>().
ru: Макрос, который уничтожает аутентификационную информацию, связанную с I<auth>. Уничтожение, обычно, вызывает высвобождение скрытых структур данных. Работа с I<auth> после вызова B<auth_destroy>() не описана.

source: Create and return an RPC authentication handle that passes nonusable authentication information with each remote procedure call. This is the default authentication used by RPC.
ru: Создаёт и возвращает аутентификационный описатель RPC, который передаёт непригодную аутентификационную информацию с каждым вызовом удалённой процедуры. Данная аутентификация используется в RPC по умолчанию.

source: Create and return an RPC authentication handle that contains authentication information. The parameter I<host> is the name of the machine on which the information was created; I<uid> is the user's user ID; I<gid> is the user's current group ID; I<len> and I<aup_gids> refer to a counted array of groups to which the user belongs. It is easy to impersonate a user.
ru: Создаёт и возвращает аутентификационный описатель RPC, который содержит аутентификационную информацию. В параметре I<host> содержится имя машины, на которой была создана информация; в I<uid> содержится пользовательский идентификатор; в I<gid> содержится идентификатор текущей группы пользователя; значения I<len> и I<aup_gids> описывают обновляемый (counted) массив групп, к которым принадлежит пользователь. Это упрощает персонализацию пользователя.

source: Calls B<authunix_create>() with the appropriate parameters.
ru: Вызывает B<authunix_create>() с соответствующими параметрами.

source: Call the remote procedure associated with I<prognum>, I<versnum>, and I<procnum> on the machine, I<host>. The parameter I<in> is the address of the procedure's argument(s), and I<out> is the address of where to place the result(s); I<inproc> is used to encode the procedure's parameters, and I<outproc> is used to decode the procedure's results. This routine returns zero if it succeeds, or the value of B<enum clnt_stat> cast to an integer if it fails. The routine B<clnt_perrno>() is handy for translating failure statuses into messages.
ru: Вызывает удалённую процедуру, связанную с I<prognum>, I<versnum> и I<procnum> на машине I<host>. В параметре I<in> передаётся адрес параметров процедуры, в I<out> — адрес, по которому должен помещаться результат; I<inproc> используется для кодирования параметров процедуры, а I<outproc> — для декодирования результатов. При успешном выполнении эта функция возвращает 0 или целое значение в B<enum clnt_stat> при ошибке. Для перевода номера ошибки в сообщение об ошибке можно использовать функцию B<clnt_perrno>().

source: Warning: calling remote procedures with this routine uses UDP/IP as a transport; see B<clntudp_create>() for restrictions. You do not have control of timeouts or authentication using this routine.
ru: Предупреждение: при вызове удалённой процедуры с помощью данной функции для передачи используется протокол UDP/IP; ограничения смотрите в описании B<clntudp_create>(). При использовании данной функции вы не можете управлять задержкой или аутентификацией.

source: Like B<callrpc>(), except the call message is broadcast to all locally connected broadcast nets. Each time it receives a response, this routine calls B<eachresult>(), whose form is:
ru: Подобна B<callrpc>(), только сообщение посылается как широковещательное во все локально подключённые сети. Каждый раз при получении ответа эта функция вызывает B<eachresult>() следующего вида:

source: where I<out> is the same as I<out> passed to B<clnt_broadcast>(), except that the remote procedure's output is decoded there; I<addr> points to the address of the machine that sent the results. If B<eachresult>() returns zero, B<clnt_broadcast>() waits for more replies; otherwise it returns with appropriate status.
ru: где I<out> — тот же самый параметр I<out>, переданный в B<clnt_broadcast>(), за исключением того, что результат удалённой процедуры сразу же декодируется; I<addr> указывает на адрес машины, которая послала результат. Если B<eachresult>() возвращает 0, то B<clnt_broadcast>() продолжит ждать ответы; в противном случае она возвращает соответствующий статус.

source: Warning: broadcast sockets are limited in size to the maximum transfer unit of the data link. For ethernet, this value is 1500 bytes.
ru: Предупреждение: размер широковещательных сокетов ограничен максимальной единицей передачи данных подключения. Для ethernet это значение равно 1500 байтам.

source: A macro that calls the remote procedure I<procnum> associated with the client handle, I<clnt>, which is obtained with an RPC client creation routine such as B<clnt_create>(). The parameter I<in> is the address of the procedure's argument(s), and I<out> is the address of where to place the result(s); I<inproc> is used to encode the procedure's parameters, and I<outproc> is used to decode the procedure's results; I<tout> is the time allowed for results to come back.
ru: Макрос, который вызывает удалённую процедуру I<procnum>, связанную с клиентским описателем I<clnt>, полученным от функции создания клиента RPC, такой как B<clnt_create>(). Параметр I<in> — адрес аргументов процедуры, а I<out> — адрес, по которому размещается результат; I<inproc> используется для кодирования параметров процедуры, а I<outproc> используется для декодирования её результатов; I<tout> — допустимое время ожидания результатов.

source: A macro that destroys the client's RPC handle. Destruction usually involves deallocation of private data structures, including I<clnt> itself. Use of I<clnt> is undefined after calling B<clnt_destroy>(). If the RPC library opened the associated socket, it will close it also. Otherwise, the socket remains open.
ru: Макрос, который уничтожает клиентский описатель RPC. Уничтожение, обычно, затрагивает скрытые структуры данных, включая сам I<clnt>. Работа с I<clnt> после вызова B<clnt_destroy>() не описана. Если библиотека RPC открывала связанный сокет, он также будет закрыт. В противном случае сокет останется открытым.

source: Generic client creation routine. I<host> identifies the name of the remote host where the server is located. I<proto> indicates which kind of transport protocol to use. The currently supported values for this field are \(lqudp\(rq and \(lqtcp\(rq. Default timeouts are set, but can be modified using B<clnt_control>().
ru: Основная функция для создания клиента. В I<host> указывается имя удалённой машины, где где расположен сервер. В I<proto> указывается тип протокола передачи, который будет использован. Поддерживаемые значения этого поля: «udp» и «tcp». Время задержки задаётся значением по умолчанию, но может быть изменено с помощью B<clnt_control>().

source: Warning: using UDP has its shortcomings. Since UDP-based RPC messages can hold only up to 8 Kbytes of encoded data, this transport cannot be used for procedures that take large arguments or return huge results.
ru: Предупреждение: использование UDP имеет недостатки. Так как в сообщениях RPC на основе UDP может быть только 8 КБ закодированных данных, этот протокол не может быть использован для процедур с большим количеством параметров или которые возвращают результат большого размера.

source: A macro used to change or retrieve various information about a client object. I<req> indicates the type of operation, and I<info> is a pointer to the information. For both UDP and TCP, the supported values of I<req> and their argument types and what they do are:
ru: Макрос, используемый для изменения или получения различной информации о клиентском объекте. В I<req> указывается тип операции, а в I<info> — указатель на информацию. Для UDP и TCP поддерживаются следующие значения I<req> и их типы параметров:

source: B<CLSET_TIMEOUT> I<struct timeval> // set total timeout B<CLGET_TIMEOUT> I<struct timeval> // get total timeout
ru: // назначить общее время ожидания B<CLSET_TIMEOUT> I<struct timeval> // получить общее время ожидания B<CLGET_TIMEOUT> I<struct timeval>

source: Note: if you set the timeout using B<clnt_control>(), the timeout parameter passed to B<clnt_call>() will be ignored in all future calls.
ru: Замечание: если вы установили время ожидания с помощью B<clnt_control>(), то параметр времени ожидания, передаваемый B<clnt_call>(), будет игнорироваться во всех будущих вызовах.

source: B<CLGET_SERVER_ADDR> I<struct sockaddr_in > // get server's address
ru: // получить адрес сервера B<CLGET_SERVER_ADDR> I<struct sockaddr_in >

source: The following operations are valid for UDP only:
ru: Следующие операции действительны только для UDP:

source: B<CLSET_RETRY_TIMEOUT> I<struct timeval> // set the retry timeout B<CLGET_RETRY_TIMEOUT> I<struct timeval> // get the retry timeout
ru: // назначить повторное время ожидания B<CLSET_RETRY_TIMEOUT> I<struct timeval> // получить повторное время ожидания B<CLGET_RETRY_TIMEOUT> I<struct timeval>

source: The retry timeout is the time that "UDP RPC" waits for the server to reply before retransmitting the request.
ru: Повторное время — это время, в течение которого «UDP RPC» ждёт ответа от сервера перед повторной отправкой запроса.

source: A macro that frees any data allocated by the RPC/XDR system when it decoded the results of an RPC call. The parameter I<out> is the address of the results, and I<outproc> is the XDR routine describing the results. This routine returns one if the results were successfully freed, and zero otherwise.
ru: Макрос, который освобождает любые данные, размещаемые системой RPC/XDR, когда она декодирует результаты вызова RPC. Параметр I<out> — адрес результатов, а I<outproc> — функция XDR, описывающая результаты. Эта функция возвращает 1, если результаты были успешно освобождены и 0 в противном случае.

source: A macro that copies the error structure out of the client handle to the structure at address I<errp>.
ru: Макрос, который копирует структуру ошибки клиентского описателя в структуру по адресу I<errp>.

source: Print a message to standard error indicating why a client RPC handle could not be created. The message is prepended with string I<s> and a colon. Used when a B<clnt_create>(), B<clntraw_create>(), B<clnttcp_create>(), or B<clntudp_create>() call fails.
ru: Выводит в стандартный поток ошибок сообщение, описывающее почему клиентский описатель RPC не удалось создать. В начало сообщения добавляется строка I<s> и знак двоеточия. Используется при ошибках в функциях B<clnt_create>(), B<clntraw_create>(), B<clnttcp_create>() или B<clntudp_create>().

source: Print a message to standard error corresponding to the condition indicated by I<stat>. Used after B<callrpc>().
ru: Выводит в стандартный поток ошибок сообщение согласно условию, указанному в I<stat>. Используется после B<callrpc>().

source: Print a message to standard error indicating why an RPC call failed; I<clnt> is the handle used to do the call. The message is prepended with string I<s> and a colon. Used after B<clnt_call>().
ru: Выводит в стандартный поток ошибок сообщение, описывающее почему вызов RPC завершился с ошибкой. Значение I<clnt> — описатель, использовавшийся при вызове. В начало сообщения добавляется строка I<s> и знак двоеточия. Используется после B<clnt_call>().

source: Like B<clnt_pcreateerror>(), except that it returns a string instead of printing to the standard error.
ru: Похожа на B<clnt_pcreateerror>(), но возвращает строку вместо вывода в стандартный поток ошибок.

source: Bugs: returns pointer to static data that is overwritten on each call.
ru: Дефекты: возвращается указатель на статические данные, которые переписываются при каждом вызове.

source: Take the same arguments as B<clnt_perrno>(), but instead of sending a message to the standard error indicating why an RPC call failed, return a pointer to a string which contains the message. The string ends with a NEWLINE.
ru: Получает те же аргументы, что и B<clnt_perrno>(), но вместо отправки в стандартный поток ошибок сообщения, которое показывает почему вызов RPC завершился с ошибкой, возвращает указатель на строку с сообщением. Строка заканчивается символом NEWLINE.

source: B<clnt_sperrno>() is used instead of B<clnt_perrno>() if the program does not have a standard error (as a program running as a server quite likely does not), or if the programmer does not want the message to be output with B<printf>(3), or if a message format different than that supported by B<clnt_perrno>() is to be used. Note: unlike B<clnt_sperror>() and B<clnt_spcreateerror>(), B<clnt_sperrno>() returns pointer to static data, but the result will not get overwritten on each call.
ru: Функция B<clnt_sperrno>() используется вместо B<clnt_perrno>(), если программа не имеет стандартного потока ошибок (для программ, запущенных как сервер), или если программист не хочет выводить сообщения с помощью B<printf>(3), или если формат сообщения отличается от формата, поддерживаемого B<clnt_perrno>(). Замечание: в отличие от B<clnt_sperror>() и B<clnt_spcreateerror>(), B<clnt_sperrno>() возвращает указатель на статические данные, но результат не будет переписан при каждом вызове.

source: Like B<clnt_perror>(), except that (like B<clnt_sperrno>()) it returns a string instead of printing to standard error.
ru: Похожа на B<clnt_perror>(), но (подобно B<clnt_sperrno>()) возвращает строку вместо вывода сообщения в стандартный поток ошибок.

source: This routine creates a toy RPC client for the remote program I<prognum>, version I<versnum>. The transport used to pass messages to the service is actually a buffer within the process's address space, so the corresponding RPC server should live in the same address space; see B<svcraw_create>(). This allows simulation of RPC and acquisition of RPC overheads, such as round trip times, without any kernel interference. This routine returns NULL if it fails.
ru: Эта функция создаёт игрушечного клиента RPC для удалённой программы I<prognum> версии I<versnum>. Протокол, используемый для пересылки сообщения службе, на самом деле является буфером внутри адресного пространства процесса, поэтому соответствующий сервер RPC должен находиться в том же адресном пространстве; смотрите B<svcraw_create>(). Он позволяет имитировать RPC и временные задержки без какого-либо участия ядра. При ошибке эта функция возвращает NULL..

source: This routine creates an RPC client for the remote program I<prognum>, version I<versnum>; the client uses TCP/IP as a transport. The remote program is located at Internet address I<*addr>. If I<addr-E<gt>sin_port> is zero, then it is set to the actual port that the remote program is listening on (the remote B<portmap> service is consulted for this information). The parameter I<sockp> is a socket; if it is B<RPC_ANYSOCK>, then this routine opens a new one and sets I<sockp>. Since TCP-based RPC uses buffered I/O, the user may specify the size of the send and receive buffers with the parameters I<sendsz> and I<recvsz>; values of zero choose suitable defaults. This routine returns NULL if it fails.
ru: Эта функция создаёт клиента RPC для удалённой программы I<prognum>, версии I<versnum>; для передачи клиент использует протокол TCP/IP. Удалённая программа расположена по интернет-адресу I<*addr>. Если значение I<addr-E<gt>sin_port> равно 0, тогда ему назначается реальный порт, который прослушивается удалённой программой (эта информация запрашивается у удалённой службы I<portmap>). Параметр I<sockp> — сокет; если его значение равно B<RPC_ANYSOCK>, тогда эта функция открывает новый сокет и изменяет I<sockp>. Так как в RPC на основе TCP используется буферизация ввода-вывода, пользователь может задать размер посылаемых и получаемых буферов с помощью параметров I<sendsz> и I<recvsz>; при значении 0 выбираются подходящие величины по умолчанию. При ошибке эта функция возвращает NULL.

source: This routine creates an RPC client for the remote program I<prognum>, version I<versnum>; the client uses use UDP/IP as a transport. The remote program is located at Internet address I<addr>. If I<addr-E<gt>sin_port> is zero, then it is set to actual port that the remote program is listening on (the remote B<portmap> service is consulted for this information). The parameter I<sockp> is a socket; if it is B<RPC_ANYSOCK>, then this routine opens a new one and sets I<sockp>. The UDP transport resends the call message in intervals of I<wait> time until a response is received or until the call times out. The total time for the call to time out is specified by B<clnt_call>().
ru: Эта функция создаёт клиента RPC для удалённой программы I<prognum> версии I<versnum>; для передачи клиент использует протокол UDP/IP. Удалённая программа расположена по интернет-адресу I<*addr>. Если I<addr-E<gt>sin_port> равно 0, тогда ему назначается реальный порт, который прослушивается удалённой программой (эта информация запрашивается у удалённой службы I<portmap>). Параметр I<sockp> — сокет; если его значение равно B<RPC_ANYSOCK>, тогда эта функция открывает новый сокет и изменяет I<sockp>. Протокол UDP повторяет отправку сообщения через интервал, указанный в параметре I<wait>, пока не будет получен ответ или не истечёт время ожидания. Полное время ожидания вызова определяется B<clnt_call>().

source: Warning: since UDP-based RPC messages can hold only up to 8 Kbytes of encoded data, this transport cannot be used for procedures that take large arguments or return huge results.
ru: Предупреждение: так как в сообщениях RPC на основе UDP может быть только 8 КБ закодированных данных, этот протокол не может быть использован для процедур с большим количеством параметров или которые возвращают результат большого размера.

source: This routine creates an RPC client for the remote program I<prognum>, on I<versnum>; the client uses use UDP/IP as a transport. The remote program is located at Internet address I<addr>. If I<addr-E<gt>sin_port> is zero, then it is set to actual port that the remote program is listening on (the remote B<portmap> service is consulted for this information). The parameter I<sockp> is a socket; if it is B<RPC_ANYSOCK>, then this routine opens a new one and sets I<sockp>. The UDP transport resends the call message in intervals of I<wait> time until a response is received or until the call times out. The total time for the call to time out is specified by B<clnt_call>().
ru: Эта функция создаёт клиента RPC для удалённой программы I<prognum> версии I<versnum>; для передачи клиент использует протокол UDP/IP. Удалённая программа расположена по интернет-адресу I<*addr>. Если I<addr-E<gt>sin_port> равно 0, тогда ему назначается реальный порт, который прослушивается удалённой программой (эта информация запрашивается у удалённой службы I<portmap>). Параметр I<sockp> — сокет; если его значение равно B<RPC_ANYSOCK>, тогда эта функция открывает новый сокет и изменяет I<sockp>. Протокол UDP повторяет отправку через интервал, указанный в параметре I<wait>, пока не будет получен ответ или не истечёт время ожидания. Полное время ожидания вызова определяется B<clnt_call>().

source: This allows the user to specify the maximum packet size for sending and receiving UDP-based RPC messages.
ru: Эта функция позволяет пользователям задать максимальный размер пакета для отправки и принятия сообщений RPC через UDP.

source: Stuff the machine's IP address into I<*addr>, without consulting the library routines that deal with I</etc/hosts>. The port number is always set to B<htons(PMAPPORT)>.
ru: Заполнить IP-адрес машины в I<*addr>, не используя библиотечные функции, которые работают с I</etc/hosts>. Номер порта всегда устанавливается равным B<htons(PMAPPORT)>.

source: A user interface to the B<portmap> service, which returns a list of the current RPC program-to-port mappings on the host located at IP address I<*addr>. This routine can return NULL. The command I<rpcinfo\ -p> uses this routine.
ru: Пользовательский интерфейс службы B<portmap>, который возвращает текущий список соответствий RPC-программа — порт, находящихся на машине с определённым IP-адресом I<*addr>. Эта функция может возвратить NULL. Эту функцию использует команда I<rpcinfo\ -p>.

source: A user interface to the B<portmap> service, which returns the port number on which waits a service that supports program number I<prognum>, version I<versnum>, and speaks the transport protocol associated with I<protocol>. The value of I<protocol> is most likely B<IPPROTO_UDP> or B<IPPROTO_TCP>. A return value of zero means that the mapping does not exist or that the RPC system failed to contact the remote B<portmap> service. In the latter case, the global variable I<rpc_createerr> contains the RPC status.
ru: Пользовательский интерфейс службы B<portmap>, который возвращает номер порта, на котором ожидает подключения служба, поддерживающая программный номер I<prognum> версии I<versnum>, и отвечает по протоколу передачи, связанному с I<protocol>. Обычно, значение I<protocol> равно B<IPPROTO_UDP> или B<IPPROTO_TCP>. Возвращаемое значение 0 означает, что соответствия не существует или что RPC системы не может соединиться с удалённой службой I<portmap>. В последнем случае глобальная переменная I<rpc_createerr> содержит состояние RPC.

source: A user interface to the B<portmap> service, which instructs B<portmap> on the host at IP address I<*addr> to make an RPC call on your behalf to a procedure on that host. The parameter I<*portp> will be modified to the program's port number if the procedure succeeds. The definitions of other parameters are discussed in B<callrpc>() and B<clnt_call>(). This procedure should be used for a \(lqping\(rq and nothing else. See also B<clnt_broadcast>().
ru: Пользовательский интерфейс службы B<portmap>, который указывает B<portmap> на машине с IP-адресом I<*addr> выполнить вызов RPC от вашего имени к процедуре на этой машине. При успешном выполнении процедуры параметр I<*portp> заменяется на номер программного порта. Предназначение других параметров описано в B<callrpc>() и B<clnt_call>(). Эта функция может быть использована только для «ping». Смотрите также B<clnt_broadcast>().
