Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: The B<SO_SNDBUF> socket option does have an effect for UNIX domain sockets, but the B<SO_RCVBUF> option does not. For datagram sockets, the B<SO_SNDBUF> value imposes an upper limit on the size of outgoing datagrams. This limit is calculated as the doubled (see B<socket>(7)) option value less 32 bytes used for overhead.
ru: Параметр сокета B<SO_SNDBUF> учитывается в доменных сокетах UNIX, а параметр B<SO_RCVBUF> \(em нет. Для датаграмных сокетов значение B<SO_SNDBUF> считается максимальным размером для исходящих датаграмм. Это ограничение, вычисляемое как удвоенное значение (см. B<socket>(7)) параметра, содержит меньше 32 байт накладных расходов.

source: Ancillary messages
ru: Вспомогательные сообщения

source: Ancillary data is sent and received using B<sendmsg>(2) and B<recvmsg>(2). For historical reasons, the ancillary message types listed below are specified with a B<SOL_SOCKET> type even though they are B<AF_UNIX> specific. To send them, set the I<cmsg_level> field of the struct I<cmsghdr> to B<SOL_SOCKET> and the I<cmsg_type> field to the type. For more information, see B<cmsg>(3).
ru: Вспомогательные данные отправляются и принимаются с помощью B<sendmsg>(2) и B<recvmsg>(2). В силу исторических причин перечисленные типы вспомогательных сообщений относятся к типу B<SOL_SOCKET>, даже если они относятся к B<AF_UNIX>. Для того, чтобы отправить их, установите значение поля I<cmsg_level> структуры I<cmsghdr> равным B<SOL_SOCKET>, а в значении поля I<cmsg_type> укажите его тип. Дополнительная информация приведена в B<cmsg>(3).

source: Send or receive a set of open file descriptors from another process. The data portion contains an integer array of the file descriptors.
ru: Передать или принять набор открытых файловых дескрипторов из другого процесса. Часть с данными содержит целочисленный массив файловых дескрипторов.

source: Commonly, this operation is referred to as "passing a file descriptor" to another process. However, more accurately, what is being passed is a reference to an open file description (see B<open>(2)), and in the receiving process it is likely that a different file descriptor number will be used. Semantically, this operation is equivalent to duplicating (B<dup>(2)) a file descriptor into the file descriptor table of another process.
ru: Обычно, эта операция упоминается как «передача дескриптора файла» другому процессу. Но если точнее, то передается ссылка на открытое файловое описание (смотрите B<open>(2)) и в принимающем процессе будет использоваться, вероятно, файловый дескриптор с другим номером. Семантически, эта операция эквивалентна дублированию (B<dup>(2)) файлового дескриптора в таблицу файловых дескрипторов другого процесса.

source: If the buffer used to receive the ancillary data containing file descriptors is too small (or is absent), then the ancillary data is truncated (or discarded) and the excess file descriptors are automatically closed in the receiving process.
ru: Если используемый для приёма вспомогательных данных с файловыми дескрипторами буфер слишком мал (или отсутствует), то вспомогательные данные обрезаются (или отбрасываются), а избыточные файловые дескрипторы автоматически закрываются в принимающем процессе.

source: If the number of file descriptors received in the ancillary data would cause the process to exceed its B<RLIMIT_NOFILE> resource limit (see B<getrlimit>(2)), the excess file descriptors are automatically closed in the receiving process.
ru: Если количество файловых дескрипторов, полученных во вспомогательных данных, превышает ограничение ресурса процесса B<RLIMIT_NOFILE> (смотрите B<getrlimit>(2)), то превысившие файловые дескрипторы автоматически закрываются в принимающем процессе.

source: The kernel constant B<SCM_MAX_FD> defines a limit on the number of file descriptors in the array. Attempting to send an array larger than this limit causes B<sendmsg>(2) to fail with the error B<EINVAL>. B<SCM_MAX_FD> has the value 253 (or 255 in kernels before 2.6.38).
ru: Константой ядра B<SCM_MAX_FD> задаётся ограничение на количество файловых дескрипторов в массиве. Попытка послать с помощью B<sendmsg>(2) массив превышающий ограничение завершается ошибкой B<EINVAL>. Значение B<SCM_MAX_FD> равно 253 (или 255 в ядрах до версии 2.6.38).

source: Send or receive UNIX credentials. This can be used for authentication. The credentials are passed as a I<struct ucred> ancillary message. Thus structure is defined in I<E<lt>sys/socket.hE<gt>> as follows:
ru: Передать или принять учётные данные UNIX. Может быть использована для аутентификации. Учётные данные передаются в виде структуры I<struct ucred> вспомогательного сообщения. Эта структура определена в I<E<lt>sys/socket.hE<gt>> следующим образом:

source: struct ucred { pid_t pid; /* Process ID of the sending process */ uid_t uid; /* User ID of the sending process */ gid_t gid; /* Group ID of the sending process */ };
ru: struct ucred { pid_t pid; /* идентификатор посылающего процесса */ uid_t uid; /* идентификатор пользователя посылающего процесса */ gid_t gid; /* идентификатор группы посылающего процесса */ };

source: Since glibc 2.8, the B<_GNU_SOURCE> feature test macro must be defined (before including I<any> header files) in order to obtain the definition of this structure.
ru: Начиная с glibc 2.8, чтобы получить определение данной структуры должен быть определён макрос тестирования свойств B<_GNU_SOURCE> (до включения I<каких-либо> заголовочных файлов).

source: The credentials which the sender specifies are checked by the kernel. A privileged process is allowed to specify values that do not match its own. The sender must specify its own process ID (unless it has the capability B<CAP_SYS_ADMIN>), its real user ID, effective user ID, or saved set-user-ID (unless it has B<CAP_SETUID>), and its real group ID, effective group ID, or saved set-group-ID (unless it has B<CAP_SETGID>).
ru: Учётные данные (credentials), указываемые отправителем, проверяются ядром. Привилегированный процесс может указывать значения, отличные от его собственных. Отправитель должен указать идентификатор своего процесса (если только он не имеет мандата B<CAP_SYS_ADMIN>), свой реальный идентификатор пользователя, действующий идентификатор или сохранённый set-user-ID (если только он не имеет B<CAP_SETUID>) и реальный идентификатор своей группы, действующий идентификатор группы или сохранённый set-group-ID (если только он не имеет B<CAP_SETGID>).

source: To receive a I<struct ucred> message, the B<SO_PASSCRED> option must be enabled on the socket.
ru: Для получения сообщения со структурой I<struct ucred> у сокета должен быть включён параметр B<SO_PASSCRED>.

source: Receive the SELinux security context (the security label) of the peer socket. The received ancillary data is a null-terminated string containing the security context. The receiver should allocate at least B<NAME_MAX> bytes in the data portion of the ancillary message for this data.
ru: Получить контекст безопасности SELinux (метку безопасности) однорангового сокета. Полученные вспомогательные данные представляют собой строку (с null в конце) с контекстом безопасности. Получатель должен выделить не менее B<NAME_MAX> байт под эти данные в в части данных вспомогательного сообщения.

source: To receive the security context, the B<SO_PASSSEC> option must be enabled on the socket (see above).
ru: Для получения контекста безопасности у сокета должен быть включён параметр B<SO_PASSSEC> (смотрите выше).

source: When sending ancillary data with B<sendmsg>(2), only one item of each of the above types may be included in the sent message.
ru: При отправке вспомогательных данных с помощью B<sendmsg>(2) посылаемое сообщение может содержать только по одному элементу каждого типа, из представленных выше.

source: At least one byte of real data should be sent when sending ancillary data. On Linux, this is required to successfully send ancillary data over a UNIX domain stream socket. When sending ancillary data over a UNIX domain datagram socket, it is not necessary on Linux to send any accompanying real data. However, portable applications should also include at least one byte of real data when sending ancillary data over a datagram socket.
ru: По крайней мере один байт реальных данных должен быть отправлен при отправке вспомогательных данных. В Linux это требуется для успешной отправки вспомогательных данных через потоковый доменный сокет UNIX. При отправке вспомогательных данных через дейтаграммный доменный сокет UNIX в Linux необязательно отправлять какие-либо реальные сопровождающие данные. Однако переносимые приложения должны также включать, по крайней мере, один байт реальных данных при отправке вспомогательных данных через дейтаграммный сокет.

source: When receiving from a stream socket, ancillary data forms a kind of barrier for the received data. For example, suppose that the sender transmits as follows:
ru: При получении из потокового сокета вспомогательные данные формируют своего рода барьер для полученных данных. Например, предположим, что отправитель передает так:

source: B<sendmsg>(2) of four bytes, with no ancillary data.
ru: B<sendmsg>(2) отправляет четыре байта без вспомогательных данных.

source: B<sendmsg>(2) of one byte, with ancillary data.
ru: B<sendmsg>(2) отправляет один байт вспомогательных данных.

source: Suppose that the receiver now performs B<recvmsg>(2) calls each with a buffer size of 20 bytes. The first call will receive five bytes of data, along with the ancillary data sent by the second B<sendmsg>(2) call. The next call will receive the remaining five bytes of data.
ru: Предположим, что получатель теперь выполняет каждый вызов B<recvmsg>(2) с буфером размером 20 байтов. Первый вызов получит пять байтов данных вместе с вспомогательными данными, отправленными вторым вызовом B<sendmsg>(2). Следующий вызов получит оставшиеся пять байтов данных.

source: If the space allocated for receiving incoming ancillary data is too small then the ancillary data is truncated to the number of headers that will fit in the supplied buffer (or, in the case of an B<SCM_RIGHTS> file descriptor list, the list of file descriptors may be truncated). If no buffer is provided for incoming ancillary data (i.e., the I<msg_control> field of the I<msghdr> structure supplied to B<recvmsg>(2) is NULL), then the incoming ancillary data is discarded. In both of these cases, the B<MSG_CTRUNC> flag will be set in the I<msg.msg_flags> value returned by B<recvmsg>(2).
ru: Если место, выделенное для получения входящих вспомогательных данных, слишком маленькое, то вспомогательные данные обрезаются по количеству заголовков, которые влезут в предоставленной буфер (или, в случае списка файловых дескрипторов B<SCM_RIGHTS>, может быть обрезан список файловых дескрипторов). Если для входящих вспомогательных данных буфер не был предусмотрен (т. е., поле I<msg_control> в структуре I<msghdr>, указанное B<recvmsg>(2), равно NULL), то входящие вспомогательные данные отбрасываются. В обоих случаях, в возвращаемом значении B<recvmsg>(2) в I<msg.msg_flags> будет установлен флаг B<MSG_CTRUNC>.

source: Ioctls
ru: Вызовы ioctl

source: The following B<ioctl>(2) calls return information in I<value>. The correct syntax is:
ru: Следующие вызовы B<ioctl>(2) возвращают информацию в аргументе I<value>. Корректный синтаксис:

source: I<ioctl_type> can be:
ru: Значением I<ioctl_type> может быть:

source: For B<SOCK_STREAM> sockets, this call returns the number of unread bytes in the receive buffer. The socket must not be in LISTEN state, otherwise an error (B<EINVAL>) is returned. B<SIOCINQ> is defined in I<E<lt>linux/sockios.hE<gt>>. Alternatively, you can use the synonymous B<FIONREAD>, defined in I<E<lt>sys/ioctl.hE<gt>>. For B<SOCK_DGRAM> sockets, the returned value is the same as for Internet domain datagram sockets; see B<udp>(7).
ru: Для сокетов B<SOCK_STREAM> этот вызов возвращает количество непрочитанных данных в приёмном буфере. Сокет не должен быть в состоянии LISTEN, иначе возвращается ошибка (B<EINVAL>). Значение B<SIOCINQ> определено в I<E<lt>linux/sockios.hE<gt>>. В качестве альтернативы можно использовать синоним B<FIONREAD>, определённый в I<E<lt>sys/ioctl.hE<gt>>. Для сокетов B<SOCK_DGRAM> возвращаемое значение совпадает с дейтаграммными доменными сокетами Интернета; смотрите B<udp>(7).

source: ERRORS
ru: ОШИБКИ

source: The specified local address is already in use or the filesystem socket object already exists.
ru: Заданный локальный адрес уже используется, или сокетный объект файловой системы уже существует.

source: This error can occur for B<sendmsg>(2) when sending a file descriptor as ancillary data over a UNIX domain socket (see the description of B<SCM_RIGHTS>, above), and indicates that the file descriptor number that is being sent is not valid (e.g., it is not an open file descriptor).
ru: Эта ошибка может возникать в B<sendmsg>(2) при отправке файлового дескриптора в вспомогательных данных через доменный сокет UNIX (смотрите описание B<SCM_RIGHTS> выше), и указывает на то, что отправляемый номер файлового дескриптора некорректен (например, не является открытым файловым дескриптором).

source: The remote address specified by B<connect>(2) was not a listening socket. This error can also occur if the target pathname is not a socket.
ru: Удалённый адрес, указанный B<connect>(2) не является слушающим сокетом. Эта ошибка также может возникнуть, если путь назначения не является сокетом.

source: Remote socket was unexpectedly closed.
ru: Удалённый сокет был неожиданно закрыт.

source: User memory address was not valid.
ru: Некорректный адрес пользовательской памяти.

source: Invalid argument passed. A common cause is that the value B<AF_UNIX> was not specified in the I<sun_type> field of passed addresses, or the socket was in an invalid state for the applied operation.
ru: Передан неправильный аргумент. Основная причина \(em не задано значение B<AF_UNIX> в поле I<sun_type> передаваемых адресов или сокет находится в некорректном состоянии для производимой операции.

source: B<connect>(2) called on an already connected socket or a target address was specified on a connected socket.
ru: Вызов B<connect>(2) запущен для уже соединённого сокета, или адрес назначения указывает на соединённый сокет.

source: The pathname in the remote address specified to B<connect>(2) did not exist.
ru: Путь, указанный в удалённом адресе для B<connect>(2), не существует.

source: Out of memory.
ru: Не хватает памяти.

source: Socket operation needs a target address, but the socket is not connected.
ru: Для операции над сокетом требуется адрес назначения, а сокет не соединён.

source: Stream operation called on non-stream oriented socket or tried to use the out-of-band data option.
ru: Вызвана потоковая операция для не потокового сокета, или произведена попытка использования параметра для внеполосных данных.

source: The sender passed invalid credentials in the I<struct ucred>.
ru: Отправитель указал неправильную информацию (credentials) в структуре I<struct ucred>.

source: Remote socket was closed on a stream socket. If enabled, a B<SIGPIPE> is sent as well. This can be avoided by passing the B<MSG_NOSIGNAL> flag to B<send>(2) or B<sendmsg>(2).
ru: Удалённый сокет был закрыт в потоковом сокете. Если разрешено, также будет послан сигнал B<SIGPIPE>. Этого можно избежать, передав флаг B<MSG_NOSIGNAL> при вызове B<send>(2) или B<sendmsg>(2).

source: Passed protocol is not B<AF_UNIX>.
ru: Указанный протокол не является B<AF_UNIX>.

source: Remote socket does not match the local socket type (B<SOCK_DGRAM> versus B<SOCK_STREAM>).
ru: Удалённый сокет не совпадает с типом локального сокета (B<SOCK_DGRAM> против B<SOCK_STREAM>).

source: Unknown socket type.
ru: Неизвестный тип сокета.

source: This error can occur for B<sendmsg>(2) when sending a file descriptor as ancillary data over a UNIX domain socket (see the description of B<SCM_RIGHTS>, above). It occurs if the number of "in-flight" file descriptors exceeds the B<RLIMIT_NOFILE> resource limit and the caller does not have the B<CAP_SYS_RESOURCE> capability. An in-flight file descriptor is one that has been sent using B<sendmsg>(2) but has not yet been accepted in the recipient process using B<recvmsg>(2).
ru: Эта ошибка может возникнуть в B<sendmsg>(2) при передаче через доменный сокет UNIX в качестве вспомогательных данных файлового дескриптора (смотрите описание B<SCM_RIGHTS> выше). Это происходит, если количество файловых дескрипторов «в полёте» превышает ограничитель ресурса B<RLIMIT_NOFILE> и вызывающий не имеет мандата B<CAP_SYS_RESOURCE>. Файловым дескриптором в полёте считается посланный с помощью B<sendmsg>(2), но ещё не принятый процессом-получателем с помощью B<recvmsg>(2).

source: This error is diagnosed since mainline Linux 4.5 (and in some earlier kernel versions where the fix has been backported). In earlier kernel versions, it was possible to place an unlimited number of file descriptors in flight, by sending each file descriptor with B<sendmsg>(2) and then closing the file descriptor so that it was not accounted against the B<RLIMIT_NOFILE> resource limit.
ru: Данная ошибка выявляется начиная с Linux 4.5 (и в некоторых старых версиях, в которые перенесено исправление). В ранних версиях ядра было возможно получить неограниченное количество файловых дескрипторов в полёте, посылая каждый файловый дескриптор с помощью B<sendmsg>(2) и затем закрывая файловый дескриптор, и таким образом он не учитывался в ограничителе ресурса B<RLIMIT_NOFILE>.

source: Other errors can be generated by the generic socket layer or by the filesystem while generating a filesystem socket object. See the appropriate manual pages for more information.
ru: При создании сокетного объекта на уровне сокетов или файловой системы могут генерироваться другие ошибки. За дополнительной информацией обращайтесь к соответствующей справочной странице.

source: VERSIONS
ru: ВЕРСИИ

source: B<SCM_CREDENTIALS> and the abstract namespace were introduced with Linux 2.2 and should not be used in portable programs. (Some BSD-derived systems also support credential passing, but the implementation details differ.)
ru: B<SCM_CREDENTIALS> и абстрактное пространство имён появились в Linux 2.2 и не должны использоваться в переносимых программах. Некоторые клоны BSD также поддерживают передачу дополнительной информации (credential), но методы реализации передачи могут серьезно отличаться на разных системах.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: Binding to a socket with a filename creates a socket in the filesystem that must be deleted by the caller when it is no longer needed (using B<unlink>(2)). The usual UNIX close-behind semantics apply; the socket can be unlinked at any time and will be finally removed from the filesystem when the last reference to it is closed.
ru: Привязка сокета к имени файла создаёт сокет в файловой системе, который должен быть удалён создателем, когда необходимость в нём отпадёт (с помощью B<unlink>(2)). Обычная система ссылок UNIX также подходит для работы с сокетами; сокет может быть удалён в любое время, а реальное удаление из файловой системы будет произведено при закрытии последней на него ссылки.

source: To pass file descriptors or credentials over a B<SOCK_STREAM> socket, you must to send or receive at least one byte of nonancillary data in the same B<sendmsg>(2) or B<recvmsg>(2) call.
ru: Для передачи файловых дескрипторов или учётных данных (credentials) через сокет B<SOCK_STREAM> необходимо передать или принять, по меньшей мере, один байт не вспомогательных данных в том же вызове B<sendmsg>(2) или B<recvmsg>(2).

source: UNIX domain stream sockets do not support the notion of out-of-band data.
ru: В потоковых доменных сокетах UNIX отсутствует такое понятие как внеполосные данные.

source: BUGS
ru: ДЕФЕКТЫ

source: When binding a socket to an address, Linux is one of the implementations that appends a null terminator if none is supplied in I<sun_path>. In most cases this is unproblematic: when the socket address is retrieved, it will be one byte longer than that supplied when the socket was bound. However, there is one case where confusing behavior can result: if 108 non-null bytes are supplied when a socket is bound, then the addition of the null terminator takes the length of the pathname beyond I<sizeof(sun_path)>. Consequently, when retrieving the socket address (for example, via B<accept>(2)), if the input I<addrlen> argument for the retrieving call is specified as I<sizeof(struct sockaddr_un)>, then the returned address structure I<won't> have a null terminator in I<sun_path>.
ru: При привязке сокета к адресу Linux является одной из реализаций, которые добавляют конечный null, если он отсутствует в I<sun_path>. В большинстве случаев в этом нет проблемы: когда адрес сокета возвращается, он будет на один байт длиннее чем был перед привязкой сокета. Однако такое неожиданное поведение может привести к следующему: если передаётся 108 не-null байтов при привязке сокета, то с дополнительным конечным null пути превышает длину I<sizeof(sun_path)>. В последствии при возврате адреса сокета (например, из B<accept>(2)), если входной аргумент I<addrlen> перед вызовом был равен I<sizeof(struct sockaddr_un)>, то в I<sun_path> возвращаемой структуры адреса I<будет отсутствовать> конечный null.

source: In addition, some implementations don't require a null terminator when binding a socket (the I<addrlen> argument is used to determine the length of I<sun_path>) and when the socket address is retrieved on these implementations, there is no null terminator in I<sun_path>.
ru: Также, некоторые реализации не требуют наличия конечного null при привязке сокета (для определения длины I<sun_path> используется аргумент I<addrlen>) и когда в этих реализациях возвращается адрес сокета, то в I<sun_path> также отсутствует конечный null.

source: Applications that retrieve socket addresses can (portably) code to handle the possibility that there is no null terminator in I<sun_path> by respecting the fact that the number of valid bytes in the pathname is:
ru: Приложения, которые получают адрес сокета могут содержать код (переносимый) для обработки случая, когда нет конечного null в I<sun_path>, учитывая фактическое количество пригодных байт в пути:

source: Alternatively, an application can retrieve the socket address by allocating a buffer of size I<sizeof(struct sockaddr_un)+1> that is zeroed out before the retrieval. The retrieving call can specify I<addrlen> as I<sizeof(struct sockaddr_un)>, and the extra zero byte ensures that there will be a null terminator for the string returned in I<sun_path>:
ru: Или же приложение может перед получением адреса сокета выделить буфер размера I<sizeof(struct sockaddr_un)+1>, который будет обнулён перед возвращением. Возвращающий вызов может задать в I<addrlen> значение I<sizeof(struct sockaddr_un)>, и дополнительный нулевой байт здесь будет конечным null в строке, возвращаемой в I<sun_path>:

source: addrlen = sizeof(struct sockaddr_un); addrp = malloc(addrlen + 1); if (addrp == NULL) /* Handle error */ ; memset(addrp, 0, addrlen + 1);
ru: addrlen = sizeof(struct sockaddr_un); addrp = malloc(addrlen + 1); if (addrp == NULL) /* обработка ошибки */ ; memset(addrp, 0, addrlen + 1);

source: if (getsockname(sfd, (struct sockaddr *) addrp, &addrlen)) == -1) /* handle error */ ;
ru: if (getsockname(sfd, (struct sockaddr *) addrp, &addrlen)) == -1) /* обработка ошибки */ ;

source: This sort of messiness can be avoided if it is guaranteed that the applications that I<create> pathname sockets follow the rules outlined above under I<Pathname sockets>.
ru: Данного беспорядка можно избежать, если гарантировать, что приложения, I<создающие> путевые сокеты, следуют правилам, описанным в общих чертах выше в I<Путевые сокеты>.

source: EXAMPLE
ru: ПРИМЕР
