Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: struct utsname { char sysname[]; /* Operating system name (e.g., "Linux") */ char nodename[]; /* Name within "some implementation-defined network" */ char release[]; /* Operating system release (e.g., "2.6.28") */ char version[]; /* Operating system version */ char machine[]; /* Hardware identifier */ #ifdef _GNU_SOURCE char domainname[]; /* NIS or YP domain name */ #endif };
ru: struct utsname { char sysname[]; /* название операционной системы (например, «Linux») */ char nodename[]; /* имя в сети, зависящее от реализации */ char release[]; /* идентификатор выпуска ОС (например, «2.6.28») */ char version[]; /* версия ОС */ char machine[]; /* идентификатор аппаратного обеспечения */ #ifdef _GNU_SOURCE char domainname[]; /* доменное имя NIS или YP */ #endif };

source: The length of the arrays in a I<struct utsname> is unspecified (see NOTES); the fields are terminated by a null byte (\(aq\e0\(aq).
ru: Размеры массивов в I<struct utsname> не определены (см. ЗАМЕЧАНИЯ); поля завершаются байтом с null (\(aq\e0\(aq).

source: I<buf> is not valid.
ru: Значение I<buf> не определено.

source: POSIX.1-2001, POSIX.1-2008, SVr4. There is no B<uname>() call in 4.3BSD.
ru: POSIX.1-2001, POSIX.1-2008, SVr4. Вызов B<uname>() отсутствует в 4.3BSD.

source: The I<domainname> member (the NIS or YP domain name) is a GNU extension.
ru: Поле I<domainname> (доменное имя NIS или YP) является расширением GNU.

source: This is a system call, and the operating system presumably knows its name, release and version. It also knows what hardware it runs on. So, four of the fields of the struct are meaningful. On the other hand, the field I<nodename> is meaningless: it gives the name of the present machine in some undefined network, but typically machines are in more than one network and have several names. Moreover, the kernel has no way of knowing about such things, so it has to be told what to answer here. The same holds for the additional I<domainname> field.
ru: Это системный вызов, и операционная система, предположительно, знает своё имя, номер выпуска и версию. Она также знает, на каком аппаратном обеспечении она работает. Таким образом, четыре поля структуры несут полезную информацию. С другой стороны, поле I<nodename> её не несет: оно указывает имя машины в некой неопределённой сети, но обычно машины находятся в более чем одной сети и имеют несколько имён. Более того, ядро не может каким-либо образом получить информацию о таких вещах, поэтому ему необходимо сообщить что же возвращать в этом поле. То же относится и к дополнительному полю I<domainname>.

source: To this end, Linux uses the system calls B<sethostname>(2) and B<setdomainname>(2). Note that there is no standard that says that the hostname set by B<sethostname>(2) is the same string as the I<nodename> field of the struct returned by B<uname>() (indeed, some systems allow a 256-byte hostname and an 8-byte nodename), but this is true on Linux. The same holds for B<setdomainname>(2) and the I<domainname> field.
ru: С этой целью в Linux используются системные вызовы B<sethostname>(2) и B<setdomainname>(2). Обратите внимание, что хотя не существует стандарта, который бы указывал, что имя машины, установленное B<sethostname>(2), является той же строкой, что возвращается в поле I<nodename> при вызове B<uname>(), для Linux это именно так (в действительности некоторые системы позволяют 256-символьное имя машины и 8-символьное имя узла). То же относится и к B<setdomainname>(2) и полю I<domainname>.

source: The length of the fields in the struct varies. Some operating systems or libraries use a hardcoded 9 or 33 or 65 or 257. Other systems use B<SYS_NMLN> or B<_SYS_NMLN> or B<UTSLEN> or B<_UTSNAME_LENGTH>. Clearly, it is a bad idea to use any of these constants; just use sizeof(...). Often 257 is chosen in order to have room for an internet hostname.
ru: Длина полей в структуре может быть различна. Некоторые операционные системы или библиотеки используют жёстко заданные значения 9, 33, 65 или 257. Другие используют константы B<SYS_NMLN>, B<_SYS_NMLN>, B<UTSLEN> и B<_UTSNAME_LENGTH>. Несомненно, идея использовать эти константы не очень хороша \(em можно просто использовать sizeof(...). Часто выбирается 257 для того, чтобы имелось достаточно места для хранения имени машины в сети интернет.

source: Part of the utsname information is also accessible via I</proc/sys/kernel/>{I<ostype>, I<hostname>, I<osrelease>, I<version>, I<domainname>}.
ru: Часть информации из структуры utsname может быть получена также через I</proc/sys/kernel/> {I<ostype>, I<hostname>, I<osrelease>, I<version>, I<domainname>}.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: Over time, increases in the size of the I<utsname> structure have led to three successive versions of B<uname>(): I<sys_olduname>() (slot I<__NR_oldolduname>), I<sys_uname>() (slot I<__NR_olduname>), and I<sys_newuname>() (slot I<__NR_uname)>. The first one used length 9 for all fields; the second used 65; the third also uses 65 but adds the I<domainname> field. The glibc B<uname>() wrapper function hides these details from applications, invoking the most recent version of the system call provided by the kernel.
ru: Со временем, увеличение размера структуры I<utsname> последовательно привело к трём версиям B<uname>(): I<sys_olduname>() (слот I<__NR_oldolduname>), I<sys_uname>() (слот I<__NR_olduname>) и I<sys_newuname>() (слот I<__NR_uname)>. В первой длина каждого поля равна 9; во второй 65; в третьей также 65, но добавилось поле I<domainname>. Обёрточная функция B<uname>() в glibc скрывает эти подробности от приложений, вызывая самую новую версию системного вызова, предоставляемого ядром.

source: uselib - load shared library
ru: uselib - загрузить динамическую библиотеку

source: I<Note>: No declaration of this system call is provided in glibc headers; see NOTES.
ru: I<Замечание>: В заголовочных файлах glibc этой системный вызов отсутствует; смотрите ЗАМЕЧАНИЯ.

source: The system call B<uselib>() serves to load a shared library to be used by the calling process. It is given a pathname. The address where to load is found in the library itself. The library can have any recognized binary format.
ru: Системный вызов B<uselib>() выполняет загрузку динамической библиотеки для использования в вызывающем процессе. Она задаётся именем файла. Адрес загрузки находится в ней самой. Библиотека может быть в любом распознаваемом формате.

source: In addition to all of the error codes returned by B<open>(2) and B<mmap>(2), the following may also be returned:
ru: В дополнении к тем кодам ошибок, которые возвращаются вызовами B<open>(2) и B<mmap>(2), также могут быть следующие коды ошибок:

source: The library specified by I<library> does not have read or execute permission, or the caller does not have search permission for one of the directories in the path prefix. (See also B<path_resolution>(7).)
ru: На библиотеку, заданную I<library>, нет прав на чтение или исполнение, или вызывающий не имеет прав на поиск в одном из каталогов, указанных в пути. (Смотрите также B<path_resolution>(7).)

source: The system-wide limit on the total number of open files has been reached.
ru: Достигнуто максимальное количество открытых файлов в системе.

source: The file specified by I<library> is not an executable of a known type; for example, it does not have the correct magic numbers.
ru: Библиотека, заданная I<library>, имеет неизвестный исполняемый тип; например, в ней нет корректных идентификационных чисел (magic numbers).

source: B<uselib>() is Linux-specific, and should not be used in programs intended to be portable.
ru: Вызов B<uselib>() применяется только в Linux и поэтому не должен использоваться в программах, предназначенных для переноса на другие платформы.

source: This obsolete system call is not supported by glibc. No declaration is provided in glibc headers, but, through a quirk of history, glibc versions before 2.23 did export an ABI for this system call. Therefore, in order to employ this system call, it was sufficient to manually declare the interface in your code; alternatively, you could invoke the system call using B<syscall>(2).
ru: Устаревший системный вызов, не поддерживается glibc. В заголовочных файлах glibc он не объявлен, но в недавнем прошлом версии glibc до 2.23 экспортировали ABI для этого системного вызова. Поэтому, чтобы получить данный системный вызов достаточно вручную объявить интерфейс в своём коде; или же можно вызвать его через B<syscall>(2).

source: In ancient libc versions, B<uselib>() was used to load the shared libraries with names found in an array of names in the binary.
ru: В очень старых версиях libc вызов B<uselib>() использовался для загрузки динамических библиотек по именам из массива имён, находящегося в исполняемом файле.

source: Since libc 4.3.2, startup code tries to prefix these names with "/usr/lib", "/lib" and "" before giving up. In libc 4.3.4 and later these names are looked for in the directories found in B<LD_LIBRARY_PATH>, and if not found there, prefixes "/usr/lib", "/lib" and "/" are tried.
ru: Начиная с libc 4.3.2, код запуска дополняется эти имена "/usr/lib", "/lib" и "" перед тем как отказаться от загрузки. В libc 4.3.4 и более поздних эти имена ищутся в каталогах, содержащихся в переменной окружения B<LD_LIBRARY_PATH>, и если они не находятся, то выполняется попытка поиска с добавлением "/usr/lib", "/lib" и "/".

source: From libc 4.4.4 on only the library "/lib/ld.so" is loaded, so that this dynamic library can load the remaining libraries needed (again using this call). This is also the state of affairs in libc5.
ru: Начиная libc 4.4.4 загружается только библиотека "/lib/ld.so" для того, чтобы она смогла загрузить оставшиеся необходимые библиотеки (используя этот системный вызов). То же происходит и в libc5.

source: glibc2 does not use this call.
ru: В glibc2 не используется этот вызов.

source: Since Linux 3.15, this system call is available only when the kernel is configured with the B<CONFIG_USELIB> option.
ru: Начиная с Linux 3.15 данный системный вызов доступен только, если ядро собрано с параметром B<CONFIG_USELIB>.

source: userfaultfd - create a file descriptor for handling page faults in user space
ru: userfaultfd - создаёт файловый дескриптор для обработки страничных ошибок в пользовательском пространстве

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
ru: I<Замечание>: В glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: B<userfaultfd>() creates a new userfaultfd object that can be used for delegation of page-fault handling to a user-space application, and returns a file descriptor that refers to the new object. The new userfaultfd object is configured using B<ioctl>(2).
ru: Вызов B<userfaultfd>() создаёт новый объект userfaultfd, который можно использовать для передачи обработки страничных ошибок приложению пользовательского пространства, и возвращает файловый дескриптор, ссылающийся на новый объект. Новый объект userfaultfd настраивается с помощью B<ioctl>(2).

source: Once the userfaultfd object is configured, the application can use B<read>(2) to receive userfaultfd notifications. The reads from userfaultfd may be blocking or non-blocking, depending on the value of I<flags> used for the creation of the userfaultfd or subsequent calls to B<fcntl>(2).
ru: После настройки объекта userfaultfd приложение может использовать вызов B<read>(2) для получения уведомлений userfaultfd. Чтение из userfaultfd может быть блокирующим и не блокирующим, в зависимости от использованного при создании userfaultfd значения I<flags> или последующих вызовов B<fcntl>(2).

source: The following values may be bitwise ORed in I<flags> to change the behavior of B<userfaultfd>():
ru: Для изменения поведения B<userfaultfd>() можно использовать следующие значения I<flags> (через OR):

source: Enable the close-on-exec flag for the new userfaultfd file descriptor. See the description of the B<O_CLOEXEC> flag in B<open>(2).
ru: Включить флаг close-on-exec для нового открытого файлового дескриптора userfaultfd. Смотрите описание флага B<O_CLOEXEC> в B<open>(2).

source: Enables non-blocking operation for the userfaultfd object. See the description of the B<O_NONBLOCK> flag in B<open>(2).
ru: Включить не блокирующую работу с объектом userfaultfd. Смотрите описание флага B<O_NONBLOCK> в B<open>(2).

source: When the last file descriptor referring to a userfaultfd object is closed, all memory ranges that were registered with the object are unregistered and unread events are flushed.
ru: Когда закрывается последний ссылающийся на объект userfaultfd файловый дескриптор, для всех диапазонов памяти, зарегистрированных в этом объекте, снимается регистрация, а все непрочитанные события очищаются.

source: The userfaultfd mechanism is designed to allow a thread in a multithreaded program to perform user-space paging for the other threads in the process. When a page fault occurs for one of the regions registered to the userfaultfd object, the faulting thread is put to sleep and an event is generated that can be read via the userfaultfd file descriptor. The fault-handling thread reads events from this file descriptor and services them using the operations described in B<ioctl_userfaultfd>(2). When servicing the page fault events, the fault-handling thread can trigger a wake-up for the sleeping thread.
ru: Механизм userfaultfd разработан для того, чтобы позволить нити в многонитевой программе выполнять деление на страницы пользовательского пространства других нитей процесса. При возникновении страничной ошибки в одной из зарегистрированных в объекте userfaultfd областей нить с ошибкой засыпает и генерируется событие, которое можно прочитать через файловый дескриптор userfaultfd. Нить обработки страничных ошибок читает сообщения из этого файлового дескриптора и обслуживает из с помощью операций, описанных в B<ioctl_userfaultfd>(2). В время этого нить обработки страничных ошибок может привести в действие механизм пробуждения спящей нити.

source: It is possible for the faulting threads and the fault-handling threads to run in the context of different processes. In this case, these threads may belong to different programs, and the program that executes the faulting threads will not necessarily cooperate with the program that handles the page faults. In such non-cooperative mode, the process that monitors userfaultfd and handles page faults needs to be aware of the changes in the virtual memory layout of the faulting process to avoid memory corruption.
ru: Нити с ошибкой и нити обработки страничных ошибок могут быть запущены в контексте различных процессов. В этом случае данные нити могут принадлежать разным программам, а программам, выполняющим нити с ошибкой, не обязательно взаимодействовать с программой, обрабатывающей страничные ошибки. В таком разобщённом режиме процессу, следящему за userfaultfd и обрабатывающему страничные ошибки, необходимо знать об изменениях в раскладке виртуальной памяти процесса с ошибкой, чтобы не допустить повреждение памяти.

source: Starting from Linux 4.11, userfaultfd can also notify the fault-handling threads about changes in the virtual memory layout of the faulting process. In addition, if the faulting process invokes B<fork>(2), the userfaultfd objects associated with the parent may be duplicated into the child process and the userfaultfd monitor will be notified (via the B<UFFD_EVENT_FORK> described below) about the file descriptor associated with the userfault objects created for the child process, which allows the userfaultfd monitor to perform user-space paging for the child process. Unlike page faults which have to be synchronous and require an explicit or implicit wakeup, all other events are delivered asynchronously and the non-cooperative process resumes execution as soon as the userfaultfd manager executes B<read>(2). The userfaultfd manager should carefully synchronize calls to B<UFFDIO_COPY> with the processing of events.
ru: Начиная с Linux 4.11, userfaultfd также уведомляет нити обработки страничных ошибок об изменениях в раскладке виртуальной памяти процесса с ошибкой. Также, если процесс с ошибкой вызывает B<fork>(2), то для объекта userfaultfd, связанного с родителем, в дочернем процессе может быть создать дубликат, и отслеживающий userfaultfd также будет уведомлён (смотрите описание B<UFFD_EVENT_FORK> ниже) о файловом дескрипторе, связанном с объектом userfault, который был создан для дочернего процесса, что позволяет отслеживающему userfaultfd выполнять деление на страницы пользовательское пространство дочернего процесса. В отличие от страничных ошибок, которые происходят синхронно и требуют явного или неявного пробуждения, все остальные события доставляются асинхронно и не взаимодействующий процесс возобновляет выполнение сразу же после того как отслеживающий userfaultfd выполняет B<read>(2). Отслеживающий userfaultfd должен корректно синхронизировать вызовы B<UFFDIO_COPY> при обработке событий.

source: The current asynchronous model of the event delivery is optimal for single threaded non-cooperative userfaultfd manager implementations.
ru: Имеющаяся асинхронная модель доставки событий оптимальна для реализации однонитевой не взаимодействующей отслеживающей userfaultfd программы.

source: Userfaultfd operation
ru: Работа с userfaultfd

source: After the userfaultfd object is created with B<userfaultfd>(), the application must enable it using the B<UFFDIO_API> B<ioctl>(2) operation. This operation allows a handshake between the kernel and user space to determine the API version and supported features. This operation must be performed before any of the other B<ioctl>(2) operations described below (or those operations fail with the B<EINVAL> error).
ru: После создания объекта userfaultfd с помощью B<userfaultfd>() приложение должно включить его с помощью операции B<UFFDIO_API> вызова B<ioctl>(2). Данная операция позволяет согласовать между ядром и пользовательским пространством версию программного интерфейса поддерживаемых свойств. Эта операция должна быть выполнено самой первой среди других операций B<ioctl>(2), описываемых ниже (в противном случае эти операции завершаются ошибкой B<EINVAL>).

source: After a successful B<UFFDIO_API> operation, the application then registers memory address ranges using the B<UFFDIO_REGISTER> B<ioctl>(2) operation. After successful completion of a B<UFFDIO_REGISTER> operation, a page fault occurring in the requested memory range, and satisfying the mode defined at the registration time, will be forwarded by the kernel to the user-space application. The application can then use the B<UFFDIO_COPY> or B<UFFDIO_ZEROPAGE> B<ioctl>(2) operations to resolve the page fault.
ru: После успешного выполнения B<UFFDIO_API> приложение должно зарегистрировать диапазоны адресов памяти с помощью операции B<UFFDIO_REGISTER> вызова B<ioctl>(2). После успешного выполнения B<UFFDIO_REGISTER> страничная ошибка, возникающая в запрошенном диапазоне и удовлетворяющая режиму, определённому в момент регистрации, будет переслана ядром приложению в пользовательском пространстве. Для решения страничной ошибки приложение может использовать операцию B<UFFDIO_COPY> или B<UFFDIO_ZEROPAGE> вызова B<ioctl>(2).

source: Starting from Linux 4.14, if the application sets the B<UFFD_FEATURE_SIGBUS> feature bit using the B<UFFDIO_API> B<ioctl>(2), no page-fault notification will be forwarded to user space. Instead a B<SIGBUS> signal is delivered to the faulting process. With this feature, userfaultfd can be used for robustness purposes to simply catch any access to areas within the registered address range that do not have pages allocated, without having to listen to userfaultfd events. No userfaultfd monitor will be required for dealing with such memory accesses. For example, this feature can be useful for applications that want to prevent the kernel from automatically allocating pages and filling holes in sparse files when the hole is accessed through a memory mapping.
ru: Начиная с Linux 4.14, если приложение устанавливает бит свойства B<UFFD_FEATURE_SIGBUS> с помощью B<UFFDIO_API> B<ioctl>(2), то уведомления о страничных ошибках не пересылаются в пользовательское пространство. Вместо этого в ошибшийся процесс посылается сигнал B<SIGBUS>. С данным свойством userfaultfd можно использовать в целях надёжности, просто ловя все попытки доступа к областях внутри зарегистрированного адресного диапазона, в котором нет выделенных страниц, не слушая при этом события userfaultfd. При таком доступе к памяти не потребуется процесс слежения за userfaultfd. Например, данное свойство может оказаться полезным приложениям, которые хотят не давать ядру выполнять автоматическое выделение страниц и заполнение дыр в разреженных файлах при обращении к дыре через отображение в памяти.

source: The B<UFFD_FEATURE_SIGBUS> feature is implicitly inherited through B<fork>(2) if used in combination with B<UFFD_FEATURE_FORK>.
ru: Свойство B<UFFD_FEATURE_SIGBUS> неявно наследуется при B<fork>(2), если используется вместе с B<UFFD_FEATURE_FORK>.

source: Details of the various B<ioctl>(2) operations can be found in B<ioctl_userfaultfd>(2).
ru: Подробности о различных операциях B<ioctl>(2) можно найти в B<ioctl_userfaultfd>(2).

source: Since Linux 4.11, events other than page-fault may enabled during B<UFFDIO_API> operation.
ru: Начиная с Linux 4.11 при операции B<UFFDIO_API> можно включить не только события страничной ошибки.

source: Up to Linux 4.11, userfaultfd can be used only with anonymous private memory mappings. Since Linux 4.11, userfaultfd can be also used with hugetlbfs and shared memory mappings.
ru: До Linux 4.11 объект userfaultfd мог быть использован только с анонимными частными отображениями памяти. Начиная с Linux 4.11 объект userfaultfd может также использоваться с отображениями общей памяти и hugetlbfs.

source: Reading from the userfaultfd structure
ru: Чтение из структуры userfaultfd

source: Each B<read>(2) from the userfaultfd file descriptor returns one or more I<uffd_msg> structures, each of which describes a page-fault event or an event required for the non-cooperative userfaultfd usage:
ru: Каждый вызов B<read>(2) из файлового дескриптора userfaultfd возвращает одну или более структур I<uffd_msg>, каждая из которых описывает событие страничной ошибки или событие, требуемое для использования userfaultfd в разобщённом режиме:

source: struct uffd_msg { __u8 event; /* Type of event */ ... union { struct { __u64 flags; /* Flags describing fault */ __u64 address; /* Faulting address */ } pagefault;
ru: struct uffd_msg { __u8 event; /* тип события */ ... union { struct { __u64 flags; /* флаги, описывающие ошибку */ __u64 address; /* ошибочный адрес */ } pagefault;

source: struct { /* Since Linux 4.11 */ __u32 ufd; /* Userfault file descriptor of the child process */ } fork;
ru: struct { /* начиная с Linux 4.11 */ __u32 ufd; /* файловый дескриптор userfault дочернего процесса */ } fork;

source: struct { /* Since Linux 4.11 */ __u64 from; /* Old address of remapped area */ __u64 to; /* New address of remapped area */ __u64 len; /* Original mapping length */ } remap;
ru: struct { /* начиная с Linux 4.11 */ __u64 from; /* старый адрес переотображаемой области */ __u64 to; /* новый адрес переотображаемой области */ __u64 len; /* начальный размер отображения */ } remap;

source: struct { /* Since Linux 4.11 */ __u64 start; /* Start address of removed area */ __u64 end; /* End address of removed area */ } remove; ... } arg;
ru: struct { /* начиная с Linux 4.11 */ __u64 start; /* начальный адрес удаляемой области */ __u64 end; /* конечный адрес удаляемой области */ } remove; ... } arg;

source: /* Padding fields omitted */ } __packed;
ru: /* поля-заполнители не показаны */ } __packed;
