Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: When the B<MSG_DONTROUTE> flag is set on sending, the destination address must refer to a local interface address and the packet is sent only to that interface.
ru: Если при отсылке установлен флаг B<MSG_DONTROUTE>, то адрес назначения должен указывать на адрес локального интерфейса, и пакеты посылаются только на этот интерфейс.

source: By default, Linux UDP does path MTU (Maximum Transmission Unit) discovery. This means the kernel will keep track of the MTU to a specific target IP address and return B<EMSGSIZE> when a UDP packet write exceeds it. When this happens, the application should decrease the packet size. Path MTU discovery can be also turned off using the B<IP_MTU_DISCOVER> socket option or the I</proc/sys/net/ipv4/ip_no_pmtu_disc> file; see B<ip>(7) for details. When turned off, UDP will fragment outgoing UDP packets that exceed the interface MTU. However, disabling it is not recommended for performance and reliability reasons.
ru: По умолчанию, Linux UDP выполняет обнаружение MTU (Maximum Transmission Unit) пути. Это означает, что ядро будет следить за MTU до IP-адреса назначения и возвращать B<EMSGSIZE>, если запись пакета UDP превысит это значение. Когда это происходит, приложение должно уменьшить размер пакета. Также обнаружение MTU пути можно выключить с помощью параметра сокета B<IP_MTU_DISCOVER> или в файле I</proc/sys/net/ipv4/ip_no_pmtu_disc>; подробней смотрите в B<ip>(7). При отключении обнаружения UDP фрагментирует исходящий пакет, если его общий размер превышает MTU интерфейса. Однако по соображениям производительности и надёжности отключение не рекомендуется.

source: UDP uses the IPv4 I<sockaddr_in> address format described in B<ip>(7).
ru: В UDP используется формат адреса IPv4 I<sockaddr_in>, который описан в B<ip>(7).

source: Error handling
ru: Обработка ошибок

source: All fatal errors will be passed to the user as an error return even when the socket is not connected. This includes asynchronous errors received from the network. You may get an error for an earlier packet that was sent on the same socket. This behavior differs from many other BSD socket implementations which don't pass any errors unless the socket is connected. Linux's behavior is mandated by B<RFC\ 1122>.
ru: Все критические ошибки передаются пользователю в виде кода ошибки, который возвращается, даже если сокет не был соединен. Это относится также и к асинхронным ошибкам, при работе с сетью. Вы можете получить ошибку, относящуюся к предыдущим пакетам, посланным на том же сокете. Такое поведение отличается от поведения многих других реализаций BSD-сокетов, которые никогда не передают коды ошибок, если на сокете не установлено соединение. Поведение Linux в этом случае соответствует B<RFC\ 1122>.

source: For compatibility with legacy code, in Linux 2.0 and 2.2 it was possible to set the B<SO_BSDCOMPAT> B<SOL_SOCKET> option to receive remote errors only when the socket has been connected (except for B<EPROTO> and B<EMSGSIZE>). Locally generated errors are always passed. Support for this socket option was removed in later kernels; see B<socket>(7) for further information.
ru: Для совместимости со старым кодом в Linux 2.0 и 2.2 можно установить параметр B<SOL_SOCKET> равным B<SO_BSDCOMPAT>, чтобы получать ошибки при работе с сетью, только если сокет был соединён (кроме ошибок B<EPROTO> и B<EMSGSIZE>). Ошибки, возникшие локально, передаются всегда. Поддержка данного параметра сокета была удалена в более новых ядрах; подробней смотрите в B<socket>(7).

source: When the B<IP_RECVERR> option is enabled, all errors are stored in the socket error queue, and can be received by B<recvmsg>(2) with the B<MSG_ERRQUEUE> flag set.
ru: Если включён параметр B<IP_RECVERR>, то все ошибки хранятся в очереди ошибок сокета и могут быть получены с помощью вызова B<recvmsg>(2) с установленным флагом B<MSG_ERRQUEUE>.

source: /proc interfaces
ru: Интерфейс /proc

source: System-wide UDP parameter settings can be accessed by files in the directory I</proc/sys/net/ipv4/>.
ru: Системные настройки параметров UDP доступны через файлы в каталоге I</proc/sys/net/ipv4/>.

source: I<udp_mem> (since Linux 2.6.25)
ru: I<udp_mem> (начиная с Linux 2.6.25)

source: This is a vector of three integers governing the number of pages allowed for queueing by all UDP sockets.
ru: Вектор из трёх значений, управляющий количеством страниц, выделенных для очереди под все сокеты UDP.

source: Below this number of pages, UDP is not bothered about its memory appetite. When the amount of memory allocated by UDP exceeds this number, UDP starts to moderate memory usage.
ru: При значении ниже этого количества страниц UDP не беспокоится о том, как потребляется память. Когда количество памяти, выделенной для UDP, превышает это значение, UDP начинает регулировать расход памяти.

source: This value was introduced to follow the format of I<tcp_mem> (see B<tcp>(7)).
ru: Формат этого значения совпадает с I<tcp_mem> (смотрите B<tcp>(7)).

source: Number of pages allowed for queueing by all UDP sockets.
ru: Количество страниц, выделенных для очереди под все сокеты UDP.

source: Defaults values for these three items are calculated at boot time from the amount of available memory.
ru: Значения по умолчанию этих трёх параметров вычисляются при запуске ОС исходя из количества имеющейся памяти.

source: I<udp_rmem_min> (integer; default value: PAGE_SIZE; since Linux 2.6.25)
ru: I<udp_rmem_min> (integer; значение по умолчанию: PAGE_SIZE; начиная с Linux 2.6.25)

source: Minimal size, in bytes, of receive buffers used by UDP sockets in moderation. Each UDP socket is able to use the size for receiving data, even if total pages of UDP sockets exceed I<udp_mem> pressure.
ru: Минимальный размер (в байтах) буферов приёма, используемых сокетами UDP в режиме регулирования. Каждый сокет UDP может использовать этот объём принимаемых данных, даже если общее количество страниц сокетов UDP превышает ограничение I<udp_mem>.

source: I<udp_wmem_min> (integer; default value: PAGE_SIZE; since Linux 2.6.25)
ru: I<udp_wmem_min> (integer; значение по умолчанию: PAGE_SIZE; начиная с Linux 2.6.25)

source: Minimal size, in bytes, of send buffer used by UDP sockets in moderation. Each UDP socket is able to use the size for sending data, even if total pages of UDP sockets exceed I<udp_mem> pressure.
ru: Минимальный размер (в байтах) буферов отправки, используемых сокетами UDP в режиме регулирования. Каждый сокет UDP может использовать этот объём отправляемых данных, даже если общее количество страниц сокетов UDP превышает ограничение I<udp_mem>.

source: To set or get a UDP socket option, call B<getsockopt>(2) to read or B<setsockopt>(2) to write the option with the option level argument set to B<IPPROTO_UDP>. Unless otherwise noted, I<optval> is a pointer to an I<int>.
ru: Для получения и задания параметров сокетов UDP используйте вызовы B<getsockopt>(2) и B<setsockopt>(2), соответственно. Значение аргумента уровня параметров должно быть равно B<IPPROTO_UDP>. Если не указано обратного, значение I<optval> является указателем на I<int>.

source: Following is a list of UDP-specific socket options. For details of some other socket options that are also applicable for UDP sockets, see B<socket>(7).
ru: В следующем списке представлены параметры только для сокетов UDP. О других параметрах, применимых к сокетам UDP, читайте в B<socket>(7).

source: B<UDP_CORK> (since Linux 2.5.44)
ru: B<UDP_CORK> (начиная с Linux 2.5.44)

source: If this option is enabled, then all data output on this socket is accumulated into a single datagram that is transmitted when the option is disabled. This option should not be used in code intended to be portable.
ru: Если этот параметр установлен, то все выходные данные сокета накапливаются в одной датаграмме, которая отправляется после того, как параметр сбрасывается. Данный параметр не должен использоваться в переносимом коде.

source: These ioctls can be accessed using B<ioctl>(2). The correct syntax is:
ru: Данные ioctl доступны через вызов B<ioctl>(2). Синтаксис:

source: Gets a pointer to an integer as argument. Returns the size of the next pending datagram in the integer in bytes, or 0 when no datagram is pending. B<Warning:> Using B<FIONREAD>, it is impossible to distinguish the case where no datagram is pending from the case where the next pending datagram contains zero bytes of data. It is safer to use B<select>(2), B<poll>(2), or B<epoll>(7) to distinguish these cases.
ru: В качестве параметра ожидается указатель на integer. Возвращает размер (в байтах) следующей ожидающей датаграммы, помещая его по указанному адресу, или 0, если нет ожидающей датаграммы. B<Предупреждение:> при использовании B<FIONREAD> невозможно понять, есть ли ожидающие датаграммы или просто следующая датаграмма не содержит данных. В этих случаях безопасней использовать B<select>(2), B<poll>(2), или B<epoll>(7).

source: Returns the number of data bytes in the local send queue. Supported only with Linux 2.4 and above.
ru: Возвращает количество байт данных в локальной очереди отправки. Поддерживается только в Linux 2.4 и выше.

source: In addition, all ioctls documented in B<ip>(7) and B<socket>(7) are supported.
ru: Дополнительно поддерживаются все ioctl, описанные в B<ip>(7) и B<socket>(7).

source: All errors documented for B<socket>(7) or B<ip>(7) may be returned by a send or receive on a UDP socket.
ru: При отправке или приёме на сокете UDP могут быть получены все коды ошибок, описанные в B<socket>(7) или B<ip>(7).

source: No receiver was associated with the destination address. This might be caused by a previous packet sent over the socket.
ru: С адресом назначения не связан ни один получатель. Эта ошибка может быть вызвана предыдущим пакетом, посланным через этот сокет.

source: B<IP_RECVERR> is a new feature in Linux 2.2.
ru: Параметр B<IP_RECVERR> появился в Linux 2.2.

source: RFC\ 768 for the User Datagram Protocol.
ru: Протокол пользовательских датаграмм описан в RFC\ 768.

source: RFC\ 1122 for the host requirements.
ru: В RFC\ 1122 описаны требования к узлу.

source: RFC\ 1191 for a description of path MTU discovery.
ru: В RFC\ 1191 описан процесс обнаружения MTU маршрута.

source: user-session-keyring - per-user default session keyring
ru: user-session-keyring - пользовательская сеансовая связка ключей по умолчанию

source: The user session keyring is a keyring used to anchor keys on behalf of a user. Each UID the kernel deals with has its own user session keyring that is shared by all processes with that UID. The user session keyring has a name (description) of the form I<_uid_ses.E<lt>UIDE<gt>> where I<E<lt>UIDE<gt>> is the user ID of the corresponding user.
ru: Пользовательская сеансовая связка ключей используется для хранения ключей пользователя. Для каждого UID у ядра есть своя пользовательская сеансовая связка ключей, которая доступна из всех процессов с этим UID. Пользовательская сеансовая связка ключей имеет имя (описание) в виде I<_uid_ses.E<lt>UIDE<gt>>, где I<E<lt>UIDE<gt>> идентификатор пользователя соответствующего пользователя.

source: The user session keyring is associated with the record that the kernel maintains for the UID. It comes into existence upon the first attempt to access either the user session keyring, the B<user-keyring>(7), or the B<session-keyring>(7). The keyring remains pinned in existence so long as there are processes running with that real UID or files opened by those processes remain open. (The keyring can also be pinned indefinitely by linking it into another keyring.)
ru: Пользовательская сеансовая связка ключей связана с записью, которая обслуживается ядром для UID. Она начинает существовать при попытке первого обращения к пользовательской сеансовой связке ключей, к B<user-keyring>(7) или к B<session-keyring>(7). Связка ключей существует привязанной всё время пока выполняются процессы с этим реальным UID или остаются открытыми файлы, открытые этими процессами (связка ключей также может быть привязана бесконечно, если её прицепить к другой связке ключей).

source: The user session keyring is created on demand when a thread requests it or when a thread asks for its B<session-keyring>(7) and that keyring doesn't exist. In the latter case, a user session keyring will be created and, if the session keyring wasn't to be created, the user session keyring will be set as the process's actual session keyring.
ru: Пользовательская сеансовая связка ключей создаётся когда этого запросит нить или когда нить запросит свою B<session-keyring>(7) и эта связка ключей не существует. В последнем случае, пользовательская сеансовая связка ключей будет создана и, если сеансовая связка ключей не была создана, то пользовательская сеансовая связка ключей будет использована как действующая сеансовая связка ключей процесса.

source: The user session keyring is searched by B<request_key>(2) if the actual session keyring does not exist and is ignored otherwise.
ru: В пользовательской сеансовой связке ключей выполняется поиск B<request_key>(2), если не существует реальная связка ключей сеанса и не выполняется в противном случае.

source: A special serial number value, B<KEY_SPEC_USER_SESSION_KEYRING>, is defined that can be used in lieu of the actual serial number of the calling process's user session keyring.
ru: Существует специальный серийный номер, B<KEY_SPEC_USER_SESSION_KEYRING>, который можно указывать вместо реального серийного номера пользовательской связки ключей сеанса вызывающего процесса.

source: From the B<keyctl>(1) utility, 'B<@us>' can be used instead of a numeric key ID in much the same way.
ru: В утилите B<keyctl>(1) подобным образом можно использовать «B<@us>» вместо числового идентификатора ключа.

source: User session keyrings are independent of B<clone>(2), B<fork>(2), B<vfork>(2), B<execve>(2), and B<_exit>(2) excepting that the keyring is destroyed when the UID record is destroyed when the last process pinning it exits.
ru: Пользовательские сеансовые связки ключей не зависят от B<clone>(2), B<fork>(2), B<vfork>(2), B<execve>(2) и B<_exit>(2) за исключением того, что эта связка ключей уничтожается когда запись UID уничтожается при завершении последнего привязанного процесса.

source: If a user session keyring does not exist when it is accessed, it will be created.
ru: Если сеансовая связка ключей пользователя не существует на момент доступа, то она создаётся.

source: Rather than relying on the user session keyring, it is strongly recommended\(emespecially if the process is running as root\(emthat a B<session-keyring>(7) be set explicitly, for example by B<pam_keyinit>(8).
ru: Лучше не полагаться на пользовательскую сеансовую связку ключей; настоятельно рекомендуется, особенно если процесс выполняется с правами суперпользователя, задавать B<session-keyring>(7) явным образом, например с помощью B<pam_keyinit>(8).

source: The user session keyring was added to support situations where a process doesn't have a session keyring, perhaps because it was created via a pathway that didn't involve PAM (e.g., perhaps it was a daemon started by B<inetd>(8)). In such a scenario, the user session keyring acts as a substitute for the B<session-keyring>(7).
ru: Поддержка пользовательской сеансовой связки ключей была добавлена для ситуаций, когда процесс не имеет сеансовой связки ключей, возможно из-за того, что был создан способом, не включающим PAM (например, служба, запущенная B<inetd>(8)). В этом случае, пользовательская сеансовая связка ключей подставляется вместо B<session-keyring>(7).

source: umask - set file mode creation mask
ru: umask - устанавливает маску создания режима доступа к файлу

source: B<umask>() sets the calling process's file mode creation mask (umask) to I<mask> & 0777 (i.e., only the file permission bits of I<mask> are used), and returns the previous value of the mask.
ru: B<umask>() устанавливает в вызывающем процессе значение маски (umask) создания режима доступа к файлу равным I<mask> & 0777 (т.е. из I<mask> используются только биты прав доступа к файлу) и возвращает предыдущее значение маски.

source: The umask is used by B<open>(2), B<mkdir>(2), and other system calls that create files to modify the permissions placed on newly created files or directories. Specifically, permissions in the umask are turned off from the I<mode> argument to B<open>(2) and B<mkdir>(2).
ru: Значение umask используется в B<open>(2), B<mkdir>(2) и других системных вызовах, которые создают файлы, для изменения прав, назначаемых на создаваемые файлы или каталоги. В частности, права в umask исключаются из аргумента I<mode> у вызовов B<open>(2) и B<mkdir>(2).

source: Alternatively, if the parent directory has a default ACL (see B<acl>(5)), the umask is ignored, the default ACL is inherited, the permission bits are set based on the inherited ACL, and permission bits absent in the I<mode> argument are turned off. For example, the following default ACL is equivalent to a umask of 022:
ru: Также, если у родительского каталога указан ACL по умолчанию (смотрите B<acl>(5)), то umask игнорируется, выполняется наследование ACL по умолчанию, бита прав назначаются согласно унаследованному ACL, а биты прав, отсутствующие в аргументе I<mode>, выключаются. Например, следующий ACL по умолчанию эквивалентен umask 022:

source: Combining the effect of this default ACL with a I<mode> argument of 0666 (rw-rw-rw-), the resulting file permissions would be 0644 (rw-r--r--).
ru: Объединение эффекта этого ACL по умолчанию с аргументом I<mode> 0666 (rw-rw-rw-) приводит установке прав на файл 0644 (rw-r--r--).

source: The constants that should be used to specify I<mask> are described in B<inode>(7).
ru: Константы, которые нужно использовать в I<mask>, описаны в B<inode>(7).

source: The typical default value for the process umask is I<S_IWGRP\ |\ S_IWOTH> (octal 022). In the usual case where the I<mode> argument to B<open>(2) is specified as:
ru: Типичным значением umask в процессе является I<S_IWGRP\ |\ S_IWOTH> (восьмеричное 022). Обычно, когда аргумент I<mode> у B<open>(2) задаётся как:

source: (octal 0666) when creating a new file, the permissions on the resulting file will be:
ru: (восьмеричное 0666) при создании файла, права получившегося файла будут:

source: (because 0666 & ~022 = 0644; i.e., rw-r--r--).
ru: (так как 0666 & ~022 = 0644; т.е., rw-r--r--).

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: This system call always succeeds and the previous value of the mask is returned.
ru: Данный системный вызов всегда выполняется успешно и возвращает предыдущее значение маски.

source: A child process created via B<fork>(2) inherits its parent's umask. The umask is left unchanged by B<execve>(2).
ru: Дочерний процесс, созданный с помощью B<fork>(2), наследует umask родителя. Значение umask не изменяется при вызове B<execve>(2).

source: It is impossible to use B<umask>() to fetch a process's umask without at the same time changing it. A second call to B<umask>() would then be needed to restore the umask. The nonatomicity of these two steps provides the potential for races in multithreaded programs.
ru: Невозможно использовать B<umask>() для получения umask процесса без её изменения. Для восстановления umask требуется второй вызов B<umask>(). Неатомарность этих двух шагов приводит к появлению состязательности в многонитевых программах.

source: Since Linux 4.7, the umask of any process can be viewed via the I<Umask> field of I</proc/[pid]/status>. Inspecting this field in I</proc/self/status> allows a process to retrieve its umask without at the same time changing it.
ru: Начиная с Linux 4.7 значение umask любого процесса доступно в поле I<Umask> файла I</proc/[pid]/status>. Просмотр этого поля в I</proc/self/status> позволяет процессу узнать свою umask без её изменения.

source: The umask setting also affects the permissions assigned to POSIX IPC objects (B<mq_open>(3), B<sem_open>(3), B<shm_open>(3)), FIFOs (B<mkfifo>(3)), and UNIX domain sockets (B<unix>(7)) created by the process. The umask does not affect the permissions assigned to System\ V IPC objects created by the process (using B<msgget>(2), B<semget>(2), B<shmget>(2)).
ru: Настройка umask также влияет на права, назначаемые IPC-объектам POSIX (B<mq_open>(3), B<sem_open>(3), B<shm_open>(3)), FIFO (B<mkfifo>(3)) и доменным сокетам UNIX (B<unix>(7)), создаваемых процессом. Значение umask не влияет на права, назначаемые IPC-объектам System\ V, создаваемых процессом (с помощью B<msgget>(2), B<semget>(2), B<shmget>(2)).

source: unshare - disassociate parts of the process execution context
ru: unshare - отделяет части процесса контекста выполнения

source: B<unshare>() allows a process (or thread) to disassociate parts of its execution context that are currently being shared with other processes (or threads). Part of the execution context, such as the mount namespace, is shared implicitly when a new process is created using B<fork>(2) or B<vfork>(2), while other parts, such as virtual memory, may be shared by explicit request when creating a process or thread using B<clone>(2).
ru: Вызов B<unshare>() позволяет процессу (или потоку) отделить части своего контекста выполнения, которые используются совместно с другими процессами (или потоками). Часть контекста выполнения, например пространство имён монтирования, неявно делается общей при создании нового процесса с помощью B<fork>(2) или B<vfork>(2), в то время как другие части, такие как виртуальная память, могут стать общими по явному запросу при создании процесса или потока с помощью B<clone>(2).

source: The main use of B<unshare>() is to allow a process to control its shared execution context without creating a new process.
ru: Основное предназначение B<unshare>() \(em позволить процессу контролировать свой общий контекст выполнения без создания нового процесса.

source: The I<flags> argument is a bit mask that specifies which parts of the execution context should be unshared. This argument is specified by ORing together zero or more of the following constants:
ru: Значение аргумента I<flags> представляет собой битовую маску, в которой указывается какие части контекста выполнения должны перестать быть общими. Значение составляется из нескольких следующих констант (через OR):

source: Reverse the effect of the B<clone>(2) B<CLONE_FILES> flag. Unshare the file descriptor table, so that the calling process no longer shares its file descriptors with any other process.
ru: Обратный эффект флагу B<CLONE_FILES> для B<clone>(2). Отделяет таблицу файловых дескрипторов таким образом, что вызывающий процесс больше не имеет общих файловых дескрипторов с другими процессами.

source: Reverse the effect of the B<clone>(2) B<CLONE_FS> flag. Unshare filesystem attributes, so that the calling process no longer shares its root directory (B<chroot>(2)), current directory (B<chdir>(2)), or umask (B<umask>(2)) attributes with any other process.
ru: Обратный эффект флагу B<CLONE_FS> для B<clone>(2). Отделяет атрибуты файловой системы таким образом, что вызывающий процесс больше не имеет общих атрибутов корневого каталога (B<chroot>(2)), текущего каталога (B<chdir>(2)) и umask (B<umask>(2)) с другими процессами.

source: B<CLONE_NEWCGROUP> (since Linux 4.6)
ru: B<CLONE_NEWCGROUP> (начиная с Linux 4.6)

source: This flag has the same effect as the B<clone>(2) B<CLONE_NEWCGROUP> flag. Unshare the cgroup namespace. Use of B<CLONE_NEWCGROUP> requires the B<CAP_SYS_ADMIN> capability.
ru: Этот флаг имеет действие подобное флагу B<CLONE_NEWCGROUP> для B<clone>(2). Отделяет пространство имён cgroup. Для использования B<CLONE_NEWCGROUP> требуется мандат B<CAP_SYS_ADMIN>.

source: B<CLONE_NEWIPC> (since Linux 2.6.19)
ru: B<CLONE_NEWIPC> (начиная с Linux 2.6.19)
