Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: I<times>[0] specifies the new access time, and I<times>[1] specifies the new modification time. If I<times> is NULL, then analogously to B<utime>(), the access and modification times of the file are set to the current time.
ru: В I<times>[0] задаётся новое время доступа, а в I<times>[1] новое время изменения. Если значение I<times> равно NULL, то аналогично B<utime>(), время доступа и изменения файла устанавливаются в текущее время.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Search permission is denied for one of the directories in the path prefix of I<path> (see also B<path_resolution>(7)).
ru: Запрещён поиск в одном из каталогов пути I<path> (см. также B<path_resolution>(7)).

source: I<times> is NULL, the caller's effective user ID does not match the owner of the file, the caller does not have write access to the file, and the caller is not privileged (Linux: does not have either the B<CAP_DAC_OVERRIDE> or the B<CAP_FOWNER> capability).
ru: Значение I<times> равно NULL, эффективный пользовательский идентификатор вызывающего процесса не совпадает с владельцем файла, вызывающий не имеет права на запись в файл, и у вызывающего нет привилегий (Linux: не имеет мандата B<CAP_DAC_OVERRIDE> или B<CAP_FOWNER>).

source: I<filename> does not exist.
ru: Файл I<filename> не существует.

source: I<times> is not NULL, the caller's effective UID does not match the owner of the file, and the caller is not privileged (Linux: does not have the B<CAP_FOWNER> capability).
ru: Значение I<times> не равно NULL, эффективный пользовательский идентификатор вызывающего процесса не совпадает с владельцем файла и у вызывающего нет привилегий (Linux: не имеет мандата B<CAP_FOWNER>).

source: I<path> resides on a read-only filesystem.
ru: I<path> располагается на файловой системе, доступной только для чтения.

source: B<utime>(): SVr4, POSIX.1-2001. POSIX.1-2008 marks B<utime>() as obsolete.
ru: B<utime>(): SVr4, POSIX.1-2001. В POSIX.1-2008 вызов B<utime>() помечен как устаревший.

source: Linux does not allow changing the timestamps on an immutable file, or setting the timestamps to something other than the current time on an append-only file.
ru: В Linux нельзя изменять временные метки у недосягаемых (immutable) файлов или задавать временные метки, отличные от текущего времени для файлов, в которые можно только дописывать.

source: utimensat, futimens - change file timestamps with nanosecond precision
ru: utimensat, futimens - изменение временных меток файла с наносекундной точностью

source: B<#include E<lt>fcntl.hE<gt> /* Definition of AT_* constants */> B<#include E<lt>sys/stat.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> /* определения констант AT_* */> B<#include E<lt>sys/stat.hE<gt>>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: B<utimensat>() and B<futimens>() update the timestamps of a file with nanosecond precision. This contrasts with the historical B<utime>(2) and B<utimes>(2), which permit only second and microsecond precision, respectively, when setting file timestamps.
ru: Вызовы B<utimensat>() и B<futimens>() обновляют временные метки файла с наносекундной точностью. Этим они отличаются от B<utime>(2) и B<utimes>(2), которые имеют секундную и микросекундную точность, соответственно.

source: With B<utimensat>() the file is specified via the pathname given in I<pathname>. With B<futimens>() the file whose timestamps are to be updated is specified via an open file descriptor, I<fd>.
ru: В вызове B<utimensat>() файл задаётся в I<pathname> по имени. В вызове B<futimens>() файл указывается в виде открытого файлового дескриптора в I<fd>.

source: For both calls, the new file timestamps are specified in the array I<times>: I<times>[0] specifies the new "last access time" (I<atime>); I<times>[1] specifies the new "last modification time" (I<mtime>). Each of the elements of I<times> specifies a time as the number of seconds and nanoseconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC). This information is conveyed in a structure of the following form:
ru: У обоих вызовов новые временные метки файла указываются в массиве I<times>: в I<times>[0] задаётся новое «время последнего доступа» (I<atime>); в I<times>[1] задаётся новое «время последнего изменения» (I<mtime>). В каждом элементе I<times> указывается время в виде количества секунд и наносекунд, прошедших с начала эпохи (1970-01-01 00:00:00 +0000 (UTC)). Эта информация представляет собой структуру следующего формата:

source: struct timespec { time_t tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
ru: struct timespec { time_t tv_sec; /* секунды */ long tv_nsec; /* наносекунды */ };

source: Updated file timestamps are set to the greatest value supported by the filesystem that is not greater than the specified time.
ru: Обновлённые временные метки файла устанавливаются в самое большое значение, поддерживаемое файловой системой, но не больше чем указанное время.

source: If the I<tv_nsec> field of one of the I<timespec> structures has the special value B<UTIME_NOW>, then the corresponding file timestamp is set to the current time. If the I<tv_nsec> field of one of the I<timespec> structures has the special value B<UTIME_OMIT>, then the corresponding file timestamp is left unchanged. In both of these cases, the value of the corresponding I<tv_sec> field is ignored.
ru: Если в поле I<tv_nsec> одной из структур I<timespec> указано специальное значение B<UTIME_NOW>, то соответствующая временная метка файла устанавливается в значение текущего времени. Если в поле I<tv_nsec> одной из структур I<timespec> указано специальное значение B<UTIME_OMIT>, то соответствующая временная метка файла не изменяется. В обоих случаях значение поля I<tv_sec> игнорируется.

source: If I<times> is NULL, then both timestamps are set to the current time.
ru: Если значение I<times> равно NULL, то значение обеих временных меток становится равным текущему времени.

source: Permissions requirements
ru: Права доступа

source: To set both file timestamps to the current time (i.e., I<times> is NULL, or both I<tv_nsec> fields specify B<UTIME_NOW>), either:
ru: Чтобы установить временные метки файла равными текущему времени (т.е., значение I<times> равно NULL, или оба значения поля I<tv_nsec> равно B<UTIME_NOW>) требуется одно из:

source: the caller must have write access to the file;
ru: вызывающий должен иметь право на запись в файл;

source: the caller's effective user ID must match the owner of the file; or
ru: эффективный пользовательский идентификатор вызывающего должен совпадать с идентификатором владельца файла;

source: the caller must have appropriate privileges.
ru: вызывающий должен иметь соответствующие права.

source: To make any change other than setting both timestamps to the current time (i.e., I<times> is not NULL, and neither I<tv_nsec> field is B<UTIME_NOW> and neither I<tv_nsec> field is B<UTIME_OMIT>), either condition 2 or 3 above must apply.
ru: Чтобы установить временные метки файла равными не текущему времени (т. е., значение I<times> не равно NULL, или оба значения поля I<tv_nsec> не равны B<UTIME_NOW> или B<UTIME_OMIT>) требуется выполнение условия 2 или 3.

source: If both I<tv_nsec> fields are specified as B<UTIME_OMIT>, then no file ownership or permission checks are performed, and the file timestamps are not modified, but other error conditions may still be detected.
ru: Если в обоих значениях поле I<tv_nsec> равно B<UTIME_OMIT>, то проверки владения файлом и права доступа к нему не выполняются, и временные метки файла не изменяются, но всё равно могут проверяться другие условия возникновения ошибок.

source: utimensat() specifics
ru: Особенности utimensat()

source: If I<pathname> is relative, then by default it is interpreted relative to the directory referred to by the open file descriptor, I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<utimes>(2) for a relative pathname). See B<openat>(2) for an explanation of why this can be useful.
ru: Если в I<pathname> указано относительное значение имени, то по умолчанию оно отсчитывается от каталога, на который ссылается открытый файловый дескриптор, I<dirfd> (а не от текущего рабочего каталога вызывающего процесса, как это делается в B<utimes>(2) для относительных имён). В B<openat>(2) объяснено почему это может быть полезно.

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<utimes>(2)).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<utimes>(2)).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то I<dirfd> игнорируется.

source: The I<flags> field is a bit mask that may be 0, or include the following constant, defined in I<E<lt>fcntl.hE<gt>>:
ru: Значение поля I<flags> представляет собой битовую маску и может равняться 0 или содержать следующую константу (определена в I<E<lt>fcntl.hE<gt>>):

source: If I<pathname> specifies a symbolic link, then update the timestamps of the link, rather than the file to which it refers.
ru: Если I<pathname> указывает на символьную ссылку, то обновляются временные метки ссылки, а не файла, на который она ссылается.

source: On success, B<utimensat>() and B<futimens>() return 0. On error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<utimensat>() и B<futimens>() возвращается 0. При ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: I<times> is NULL, or both I<tv_nsec> values are B<UTIME_NOW>, and either:
ru: Значение I<times> равно NULL, или в обоих значениях поле I<tv_nsec> равно B<UTIME_NOW> или:

source: the effective user ID of the caller does not match the owner of the file, the caller does not have write access to the file, and the caller is not privileged (Linux: does not have either the B<CAP_FOWNER> or the B<CAP_DAC_OVERRIDE> capability); or,
ru: эффективный пользовательский идентификатор вызывающего процесса не совпадает с идентификатором владельца файла, вызывающий не имеет права на запись в файл, и у вызывающего нет привилегий (Linux: не имеет мандата B<CAP_FOWNER> или B<CAP_DAC_OVERRIDE>);

source: the file is marked immutable (see B<chattr>(1)).
ru: файл помечен как неизменяемый (immutable) (см. B<chattr>(1)).

source: (B<futimens>()) I<fd> is not a valid file descriptor.
ru: (B<futimens>()) Значение I<fd> не является правильным файловым дескриптором.

source: (B<utimensat>()) I<pathname> is a relative pathname, but I<dirfd> is neither B<AT_FDCWD> nor a valid file descriptor.
ru: (B<utimensat>()) В I<pathname> содержится относительный путь, но значение I<dirfd> не равно B<AT_FDCWD> и не является правильным файловым дескриптором.

source: I<times> pointed to an invalid address; or, I<dirfd> was B<AT_FDCWD>, and I<pathname> is NULL or an invalid address.
ru: Значение I<times> указывает на некорректный адрес; или I<dirfd> равно B<AT_FDCWD> и I<pathname> равно NULL или содержит некорректный адрес.

source: Invalid value in I<flags>.
ru: Некорректное значение I<flags>.

source: Invalid value in one of the I<tv_nsec> fields (value outside range 0 to 999,999,999, and not B<UTIME_NOW> or B<UTIME_OMIT>); or an invalid value in one of the I<tv_sec> fields.
ru: Некорректное значение в одном из полей I<tv_nsec> (значение вне диапазона от 0 до 999999999 и не равно B<UTIME_NOW> или B<UTIME_OMIT>) или некорректное значение в одном из полей I<tv_sec>.

source: I<pathname> is NULL, I<dirfd> is not B<AT_FDCWD>, and I<flags> contains B<AT_SYMLINK_NOFOLLOW>.
ru: Значение I<pathname> равно NULL, I<dirfd> не равно B<AT_FDCWD> и I<flags> содержит B<AT_SYMLINK_NOFOLLOW>.

source: (B<utimensat>()) Too many symbolic links were encountered in resolving I<pathname>.
ru: (B<utimensat>()) Во время определения I<pathname> встретилось слишком много символьных ссылок.

source: (B<utimensat>()) I<pathname> is too long.
ru: (B<utimensat>()) Слишком длинное значение аргумента I<pathname>.

source: (B<utimensat>()) A component of I<pathname> does not refer to an existing directory or file, or I<pathname> is an empty string.
ru: (B<utimensat>()) Компонент пути I<pathname> не ссылается на существующий каталог или файл, или в I<pathname> указана пустая строка.

source: (B<utimensat>()) I<pathname> is a relative pathname, but I<dirfd> is neither B<AT_FDCWD> nor a file descriptor referring to a directory; or, one of the prefix components of I<pathname> is not a directory.
ru: (B<utimensat>()) В I<pathname> содержится относительный путь, но значение I<dirfd> не равно B<AT_FDCWD> или не является файловым дескриптором, ссылающимся на каталог; или один из компонентов I<pathname> не является каталогом.

source: The caller attempted to change one or both timestamps to a value other than the current time, or to change one of the timestamps to the current time while leaving the other timestamp unchanged, (i.e., I<times> is not NULL, neither I<tv_nsec> field is B<UTIME_NOW>, and neither I<tv_nsec> field is B<UTIME_OMIT>) and either:
ru: Вызывающий пытается изменить одну или обе временные метки на значение, отличное от текущего времени, или изменить одну из временных меток на текущее время, а другую оставить неизменной (т. е., значение I<times> не равно NULL, у обоих значений поле I<tv_nsec> не равно B<UTIME_NOW>, и у обоих значений поле I<tv_nsec> не равно B<UTIME_OMIT>) и:

source: the caller's effective user ID does not match the owner of file, and the caller is not privileged (Linux: does not have the B<CAP_FOWNER> capability); or,
ru: эффективный пользовательский идентификатор не совпадает с идентификатором владельца файла, а вызывающий не имеет привилегий (Linux: не имеет мандата B<CAP_FOWNER>);

source: the file is marked append-only or immutable (see B<chattr>(1)).
ru: файл помечен как только для добавления или как неизменяемый (см. B<chattr>(1)).

source: The file is on a read-only filesystem.
ru: Файл расположен в файловой системе, доступной только для чтения.

source: (B<utimensat>()) Search permission is denied for one of the prefix components of I<pathname>.
ru: (B<utimensat>()) В одном из каталогов префикса I<pathname> не разрешён поиск.

source: B<utimensat>() was added to Linux in kernel 2.6.22; glibc support was added with version 2.6.
ru: Вызов B<utimensat>() был добавлен в ядро Linux версии 2.6.22; поддержка в glibc доступна с версии 2.6.

source: Support for B<futimens>() first appeared in glibc 2.6.
ru: Поддержка B<futimens>() появилась в glibc 2.6.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Thread safety
ru: Безвредность в нитях

source: B<futimens>() and B<utimensat>() are specified in POSIX.1-2008.
ru: Вызовы B<futimens>() и B<utimensat>() определены в POSIX.1-2008.

source: B<utimensat>() obsoletes B<futimesat>(2).
ru: Вызов B<utimensat>() заменяет устаревший B<futimesat>(2).

source: On Linux, timestamps cannot be changed for a file marked immutable, and the only change permitted for files marked append-only is to set the timestamps to the current time. (This is consistent with the historical behavior of B<utime>(2) and B<utimes>(2) on Linux.)
ru: В Linux, временные метки нельзя изменять у файлов, помеченных как неизменяемые (immutable), а у файлов, помеченных как только для добавления, можно изменить метку только на значение текущего времени (это соответствует сложившемуся исторически поведению в Linux вызовов B<utime>(2) и B<utimes>(2)).

source: If both I<tv_nsec> fields are specified as B<UTIME_OMIT>, then the Linux implementation of B<utimensat>() succeeds even if the file referred to by I<dirfd> and I<pathname> does not exist.
ru: Если оба поля I<tv_nsec> равны B<UTIME_OMIT>, то вызов B<utimensat>() реализации Linux завершается без ошибки, даже, если файл, на который ссылается I<dirfd> и I<pathname>, не существует.

source: C library/kernel ABI differences
ru: Отличия между библиотекой C и ABI ядра

source: On Linux, B<futimens>() is a library function implemented on top of the B<utimensat>() system call. To support this, the Linux B<utimensat>() system call implements a nonstandard feature: if I<pathname> is NULL, then the call modifies the timestamps of the file referred to by the file descriptor I<dirfd> (which may refer to any type of file). Using this feature, the call I<futimens(fd,\ times)> is implemented as:
ru: В Linux, B<futimens>() представляет собой библиотечную функцию на основе системного вызова B<utimensat>(). Для этого в Linux-версии системного вызова B<utimensat>() реализовано нестандартное свойство: если значение I<pathname> равно NULL, то вызов изменяет временные метки файла на который ссылается файловый дескриптор I<dirfd> (который может указывать на файл любого типа). С помощью этого свойства вызов I<futimens(fd,\ times)> реализован как:

source: Note, however, that the glibc wrapper for B<utimensat>() disallows passing NULL as the value for I<pathname>: the wrapper function returns the error I<EINVAL> in this case.
ru: Однако заметим, что обёрточная функция glibc для B<utimensat>() не позволяет передачу NULL в качестве значения I<pathname> — в этом случае возвращается ошибка I<EINVAL>.

source: Several bugs afflict B<utimensat>() and B<futimens>() on kernels before 2.6.26. These bugs are either nonconformances with the POSIX.1 draft specification or inconsistencies with historical Linux behavior.
ru: В ядрах до версии 2.6.26 в B<utimensat>() и B<futimens>() есть несколько дефектов. Эти дефекты приводят к несоответствию с черновиком спецификации POSIX.1 или к рассогласованию со старым поведением в Linux.

source: POSIX.1 specifies that if one of the I<tv_nsec> fields has the value B<UTIME_NOW> or B<UTIME_OMIT>, then the value of the corresponding I<tv_sec> field should be ignored. Instead, the value of the I<tv_sec> field is required to be 0 (or the error B<EINVAL> results).
ru: В POSIX.1 определено, что если в одном из значений времени поле I<tv_nsec> содержит значение B<UTIME_NOW> или B<UTIME_OMIT>, то значение соответствующего поля I<tv_sec> должно игнорироваться. Вместо этого требуется, чтобы значение поля I<tv_sec> равнялось 0 (иначе выдаётся ошибка B<EINVAL>).

source: Various bugs mean that for the purposes of permission checking, the case where both I<tv_nsec> fields are set to B<UTIME_NOW> isn't always treated the same as specifying I<times> as NULL, and the case where one I<tv_nsec> value is B<UTIME_NOW> and the other is B<UTIME_OMIT> isn't treated the same as specifying I<times> as a pointer to an array of structures containing arbitrary time values. As a result, in some cases: a) file timestamps can be updated by a process that shouldn't have permission to perform updates; b) file timestamps can't be updated by a process that should have permission to perform updates; and c) the wrong I<errno> value is returned in case of an error.
ru: Различные дефекты возникают при рассмотрении имеющихся прав и значений: случай, когда у обоих значений поле I<tv_nsec> равно B<UTIME_NOW>, не всегда рассматривается равным указанию в I<times> значения NULL, и случай, когда одно значение I<tv_nsec> равно B<UTIME_NOW>, а другое — B<UTIME_OMIT>, не рассматривается равным указанию в I<times> указателя на массив структур, содержащий произвольные значения времени. В результате в некоторых случаях: а) временные метки файлов могут быть обновлены процессом, который не имеет прав на это; б) временные метки файлов не могут быть обновлены процессом, хотя он имеет на это право; в) в случае ошибки возвращается неправильное значение в I<errno>.

source: POSIX.1 says that a process that has I<write access to the file> can make a call with I<times> as NULL, or with I<times> pointing to an array of structures in which both I<tv_nsec> fields are B<UTIME_NOW>, in order to update both timestamps to the current time. However, B<futimens>() instead checks whether the I<access mode of the file descriptor allows writing>.
ru: В POSIX.1 сказано, что процесс имеющий I<права на запись в файл>, для установки временных меток в текущее время может выполнить вызов со значением I<times> равным NULL, или с I<times>, указывающим на массив структур, в котором у обоих значений времени поле I<tv_nsec> равно B<UTIME_NOW>. Однако B<futimens>() вместо этого проверяет I<права на запись у файлового дескриптора>.

source: afs_syscall, break, fattach, fdetach, ftime, getmsg, getpmsg, gtty, isastream, lock, madvise1, mpx, prof, profil, putmsg, putpmsg, security, stty, tuxcall, ulimit, vserver - unimplemented system calls
ru: afs_syscall, break, fattach, fdetach, ftime, getmsg, getpmsg, gtty, isastream, lock, madvise1, mpx, prof, profil, putmsg, putpmsg, security, stty, tuxcall, ulimit, vserver - нереализованные системные вызовы

source: Unimplemented system calls.
ru: Нереализованные системные вызовы.

source: These system calls are not implemented in the Linux kernel.
ru: Данные системные вызовы не реализованы в ядре Linux.

source: These system calls always return -1 and set I<errno> to B<ENOSYS>.
ru: Эти системные вызовы всегда возвращают -1 и устанавливают для I<errno> значение B<ENOSYS>.

source: Note that B<ftime>(3), B<profil>(3), and B<ulimit>(3) are implemented as library functions.
ru: Заметим, что B<ftime>(3), B<profil>(3) и B<ulimit>(3) реализованы в виде библиотечных функций.

source: Some system calls, like B<alloc_hugepages>(2), B<free_hugepages>(2), B<ioperm>(2), B<iopl>(2), and B<vm86>(2) exist only on certain architectures.
ru: Некоторые системные вызовы, такие как B<alloc_hugepages>(2), B<free_hugepages>(2), B<ioperm>(2), B<iopl>(2) и B<vm86>(2), существуют только для некоторых архитектур.

source: Some system calls, like B<ipc>(2), B<create_module>(2), B<init_module>(2), and B<delete_module>(2) exist only when the Linux kernel was built with support for them.
ru: Некоторые системные вызовы, такие как B<ipc>(2), B<create_module>(2), B<init_module>(2) и B<delete_module>(2), существуют в ядре Linux только, если при сборке ядра включена их поддержка.

source: uname - get name and information about current kernel
ru: uname - получает название и информацию о текущем ядре

source: B<uname>() returns system information in the structure pointed to by I<buf>. The I<utsname> struct is defined in I<E<lt>sys/utsname.hE<gt>>:
ru: B<uname>() возвращает информацию о системе в структуру с адресом I<buf>. Структура I<utsname> определена в I<E<lt>sys/utsname.hE<gt>>:
