Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: units - decimal and binary prefixes
ru: units - десятичные и двоичные приставки

source: DESCRIPTION
ru: ОПИСАНИЕ

source: Decimal prefixes
ru: Десятичные приставки

source: The SI system of units uses prefixes that indicate powers of ten. A kilometer is 1000 meter, and a megawatt is 1000000 watt. Below the standard prefixes.
ru: В системе единиц СИ используются приставки, значения которых является степенью числа. В километре 1000 метров, а в мегаватте — 1000000 ватт. Далее показаны стандартные приставки.

source: Prefix
ru: Приставка

source: Name
ru: Имя

source: Value
ru: Значение

source: y
ru: и

source: yocto
ru: иокто

source: z
ru: з

source: zepto
ru: зепто

source: a
ru: а

source: atto
ru: атто

source: f
ru: ф

source: femto
ru: фемто

source: p
ru: п

source: pico
ru: пико

source: n
ru: н

source: nano
ru: нано

source: \(mc
ru: мк

source: micro
ru: микро

source: m
ru: м

source: milli
ru: милли

source: c
ru: с

source: centi
ru: санти

source: d
ru: д

source: deci
ru: деци

source: da
ru: да

source: deka
ru: дека

source: h
ru: г

source: hecto
ru: гекто

source: k
ru: к

source: kilo
ru: кило

source: M
ru: М

source: mega
ru: мега

source: G
ru: Г

source: giga
ru: гига

source: T
ru: Т

source: tera
ru: тера

source: P
ru: П

source: peta
ru: пета

source: E
ru: Э

source: exa
ru: экса

source: Z
ru: З

source: zetta
ru: зетта

source: Y
ru: И

source: yotta
ru: иотта

source: The symbol for micro is the Greek letter mu, often written u in an ASCII context where this Greek letter is not available. See also
ru: Для обозначения micro используется греческая буква мю. В кодировке ASCII, где она отсутствует, вместо неё часто используют латинскую u. Смотрите также

source: Binary prefixes
ru: Двоичные префиксы

source: The binary prefixes resemble the decimal ones, but have an additional \(aqi\(aq (and "Ki" starts with a capital \(aqK\(aq). The names are formed by taking the first syllable of the names of the decimal prefix with roughly the same size, followed by "bi" for "binary".
ru: Двоичные префиксы походят на десятичные, но имеют дополнительную \(aqi\(aq (и «Ki» начинается с заглавной \(aqK\(aq). Имена формируются из первого звука имени десятичных префиксов примерно того же размера, за которым следует «bi» (от «binary» — «двоичный»).

source: Ki
ru: КиБ

source: kibi
ru: киби

source: Mi
ru: МиБ

source: mebi
ru: меби

source: Gi
ru: ГиБ

source: gibi
ru: гиби

source: Ti
ru: ТиБ

source: tebi
ru: теби

source: Pi
ru: ПиБ

source: pebi
ru: пеби

source: Ei
ru: ЭиБ

source: exbi
ru: эксби

source: See also
ru: Смотрите также

source: Discussion
ru: Обсуждение

source: Before these binary prefixes were introduced, it was fairly common to use k=1000 and K=1024, just like b=bit, B=byte. Unfortunately, the M is capital already, and cannot be capitalized to indicate binary-ness.
ru: До введения двоичных префиксов довольно часто использовалось k=1000 и K=1024, также как и b=bit (бит), B=byte (байт). К сожалению, заглавная M уже занята, и не может быть использована как признак двоичности.

source: At first that didn't matter too much, since memory modules and disks came in sizes that were powers of two, so everyone knew that in such contexts "kilobyte" and "megabyte" meant 1024 and 1048576 bytes, respectively. What originally was a sloppy use of the prefixes "kilo" and "mega" started to become regarded as the "real true meaning" when computers were involved. But then disk technology changed, and disk sizes became arbitrary numbers. After a period of uncertainty all disk manufacturers settled on the standard, namely k=1000, M=1000\ k, G=1000\ M.
ru: Поначалу это не имело большого значения, модули памяти и диски имели размер, равный степеням двойки, и все знали, что в таких случаях «килобайт» означает 1024, а «мегабайт» — 1048576 байтов. Впрочем, некоторая путаница связанная с этим всё же была. После некоторых колебаний все производители дисков установили стандарт, по которому k=1000, M=1000\ к, G=1000\ М.

source: The situation was messy: in the 14k4 modems, k=1000; in the 1.44\ MB diskettes, M=1024000; and so on. In 1998 the IEC approved the standard that defines the binary prefixes given above, enabling people to be precise and unambiguous.
ru: Ситуация получилась запутанной: в модемах со скоростью 14k4 k=1000; в дискетах 1.44\ МБ M=1024000 и т. п. В 1998 году IEC принял стандарт, который определяет двоичные префиксы как указано выше, что позволяет людям быть точными и однозначными.

source: Thus, today, MB = 1000000\ B and MiB = 1048576\ B.
ru: Таким образом, сегодня МБ = 1000000 \Б, а МиБ = 1048576 \Б.

source: In the free software world programs are slowly being changed to conform. When the Linux kernel boots and says
ru: В мире свободного программного обеспечения программы медленно переходят к таким обозначениям. Когда ядро Linux при загрузке выводит

source: the MB are megabytes and the KiB are kibibytes.
ru: то MB — это мегабайты, а KiB — кибибайты.

source: unix - sockets for local interprocess communication
ru: unix - сокеты для локального межпроцессного взаимодействия

source: SYNOPSIS
ru: ОБЗОР

source: The B<AF_UNIX> (also known as B<AF_LOCAL>) socket family is used to communicate between processes on the same machine efficiently. Traditionally, UNIX domain sockets can be either unnamed, or bound to a filesystem pathname (marked as being of type socket). Linux also supports an abstract namespace which is independent of the filesystem.
ru: Семейство сокетов B<AF_UNIX> (также известное, как B<AF_LOCAL>) используется для эффективного взаимодействия между процессами на одной машине. Доменные сокеты UNIX могут быть как безымянными, так и иметь имя файла в файловой системе (типизированный сокет). В Linux также поддерживается абстрактное пространство имён, которое не зависит от файловой системы.

source: Valid socket types in the UNIX domain are: B<SOCK_STREAM>, for a stream-oriented socket; B<SOCK_DGRAM>, for a datagram-oriented socket that preserves message boundaries (as on most UNIX implementations, UNIX domain datagram sockets are always reliable and don't reorder datagrams); and (since Linux 2.6.4) B<SOCK_SEQPACKET>, for a sequenced-packet socket that is connection-oriented, preserves message boundaries, and delivers messages in the order that they were sent.
ru: Допустимые типы сокета для домена UNIX: потоковый сокет B<SOCK_STREAM>, датаграмный сокет B<SOCK_DGRAM>, сохраняющий границы сообщений (в большинстве реализаций UNIX, доменные датаграмные сокеты UNIX всегда надёжны и не меняют порядок датаграмм); и (начиная с Linux 2.6.4) ориентированный на соединение задающий последовательность пакетам сокет B<SOCK_SEQPACKET>, сохраняющий границы сообщений и доставляющий сообщения в том же порядке, в каком они были отправлены.

source: UNIX domain sockets support passing file descriptors or process credentials to other processes using ancillary data.
ru: Доменные сокеты UNIX поддерживают передачу файловых дескрипторов или учётных данных (credentials) о процессе другим процессам, используя вспомогательные (ancillary) данные.

source: Address format
ru: Формат адреса

source: A UNIX domain socket address is represented in the following structure:
ru: Адрес доменного сокета UNIX представляет собой следующую структуру:

source: struct sockaddr_un { sa_family_t sun_family; /* AF_UNIX */ char sun_path[108]; /* Pathname */ };
ru: struct sockaddr_un { sa_family_t sun_family; /* AF_UNIX */ char sun_path[108]; /* имя пути */ };

source: The I<sun_family> field always contains B<AF_UNIX>. On Linux, I<sun_path> is 108 bytes in size; see also NOTES, below.
ru: Поле I<sun_family> всегда содержит B<AF_UNIX>. В Linux размер I<sun_path> равен 108 байтам; также смотрите ЗАМЕЧАНИЯ ниже.

source: Various systems calls (for example, B<bind>(2), B<connect>(2), and B<sendto>(2)) take a I<sockaddr_un> argument as input. Some other system calls (for example, B<getsockname>(2), B<getpeername>(2), B<recvfrom>(2), and B<accept>(2)) return an argument of this type.
ru: В различных системных вызовах (например, B<bind>(2), B<connect>(2) и B<sendto>(2)) в качестве входных данных используется параметр I<sockaddr_un>. Другие системные вызовы (например, B<getsockname>(2), B<getpeername>(2), B<recvfrom>(2) и B<accept>(2)) возвращают результат в параметре этого типа.

source: Three types of address are distinguished in the I<sockaddr_un> structure:
ru: В I<sockaddr_un> структуре различают три типа адресов:

source: I<pathname>: a UNIX domain socket can be bound to a null-terminated filesystem pathname using B<bind>(2). When the address of a pathname socket is returned (by one of the system calls noted above), its length is
ru: I<с именем пути>: доменный сокет UNIX может быть привязан к имени пути (с завершающимся null) в файловой системе с помощью B<bind>(2). При возврате адреса имени пути сокета (одним и системных вызовов, упомянутых выше), его длина равна

source: and I<sun_path> contains the null-terminated pathname. (On Linux, the above B<offsetof>() expression equates to the same value as I<sizeof(sa_family_t)>, but some other implementations include other fields before I<sun_path>, so the B<offsetof>() expression more portably describes the size of the address structure.)
ru: и I<sun_path> содержит путь, оканчивающийся null (в Linux, указанное выше выражение B<offsetof>() равно I<sizeof(sa_family_t)>, но в некоторых реализациях включаются другие поля перед I<sun_path>, поэтому выражение B<offsetof>() описывает размер адресной структуры более переносимым способом).

source: For further details of pathname sockets, see below.
ru: Дополнительную информацию о путях сокета смотрите далее.

source: I<unnamed>: A stream socket that has not been bound to a pathname using B<bind>(2) has no name. Likewise, the two sockets created by B<socketpair>(2) are unnamed. When the address of an unnamed socket is returned, its length is I<sizeof(sa_family_t)>, and I<sun_path> should not be inspected.
ru: I<безымянный>: Потоковый сокет, который не привязан к имени пути с помощью B<bind>(), не имеет имени. Аналогично, два сокета, создаваемые B<socketpair>(), также не имеют имён. При возврате адреса сокета его длина равна I<sizeof(sa_family_t)>, а значение I<sun_path> не используется.

source: I<abstract>: an abstract socket address is distinguished (from a pathname socket) by the fact that I<sun_path[0]> is a null byte (\(aq\e0\(aq). The socket's address in this namespace is given by the additional bytes in I<sun_path> that are covered by the specified length of the address structure. (Null bytes in the name have no special significance.) The name has no connection with filesystem pathnames. When the address of an abstract socket is returned, the returned I<addrlen> is greater than I<sizeof(sa_family_t)> (i.e., greater than 2), and the name of the socket is contained in the first I<(addrlen - sizeof(sa_family_t))> bytes of I<sun_path>.
ru: I<абстрактный>: абстрактный адрес сокета отличается (от имени пути сокета) тем, что значением I<sun_path[0]> является байт null (\(aq\e0\(aq). Адрес сокета в этом пространстве имён определяется дополнительными байтами в I<sun_path>, количество которых определяется длиной указанной структуры адреса. Байты null в имени не имеют специального значения. Имя не связано с именем пути в файловой системе. При возврате адреса абстрактного сокета возвращаемое значение I<addrlen> больше чем I<sizeof(sa_family_t)> (т.е. больше 2), а имя сокета содержится в первых I<(addrlen - sizeof(sa_family_t))> байтах I<sun_path>.

source: Pathname sockets
ru: Путевые сокеты

source: When binding a socket to a pathname, a few rules should be observed for maximum portability and ease of coding:
ru: При привязке сокета к пути для максимальной переносимости и простоте кодирования нужно учесть несколько правил:

source: The pathname in I<sun_path> should be null-terminated.
ru: Имя пути в I<sun_path> должно завершаться null.

source: The length of the pathname, including the terminating null byte, should not exceed the size of I<sun_path>.
ru: Длина имени пути, включая завершающий байт null, не должна превышать размер I<sun_path>.

source: The I<addrlen> argument that describes the enclosing I<sockaddr_un> structure should have a value of at least:
ru: Аргумент I<addrlen>, описывающий включаемую структуру I<sockaddr_un>, должен содержать значение, как минимум:

source: or, more simply, I<addrlen> can be specified as I<sizeof(struct sockaddr_un)>.
ru: или, проще говоря, для I<addrlen> можно использовать I<sizeof(struct sockaddr_un)>.

source: There is some variation in how implementations handle UNIX domain socket addresses that do not follow the above rules. For example, some (but not all) implementations append a null terminator if none is present in the supplied I<sun_path>.
ru: Есть несколько реализаций по работе с адресами доменных сокетов UNIX, которые не следуют данным правилам. Например, в некоторых реализациях (но не во всех) добавляется конечный null, если если его нет в I<sun_path>.

source: When coding portable applications, keep in mind that some implementations have I<sun_path> as short as 92 bytes.
ru: При написании переносимых приложений учтите, что в некоторых реализациях размер I<sun_path>равен 92 байтам.

source: Various system calls (B<accept>(2), B<recvfrom>(2), B<getsockname>(2), B<getpeername>(2)) return socket address structures. When applied to UNIX domain sockets, the value-result I<addrlen> argument supplied to the call should be initialized as above. Upon return, the argument is set to indicate the I<actual> size of the address structure. The caller should check the value returned in this argument: if the output value exceeds the input value, then there is no guarantee that a null terminator is present in I<sun_path>. (See BUGS.)
ru: Различные системные вызовы (например, B<accept>(2), B<recvfrom>(2), B<getsockname>(2), B<getpeername>(2)) возвращают адресные структуры сокета. В случае с доменными сокетами UNIX аргумент значение-результат I<addrlen>, передаваемый вызову, должен быть инициализирован как описано выше. При возврате в аргументе содержится I<реальный> размер адресной структуры. Вызывающий должен проверить полученное значение этого аргумента: если оно превышает значение до вызова, то не гарантируется наличие конечного null в I<sun_path> (смотрите ДЕФЕКТЫ).

source: Pathname socket ownership and permissions
ru: Пути к сокетам и права

source: In the Linux implementation, pathname sockets honor the permissions of the directory they are in. Creation of a new socket fails if the process does not have write and search (execute) permission on the directory in which the socket is created.
ru: В реализации Linux учитываются права на каталоги, в которых располагаются сокеты. Создание нового сокета завершается ошибкой, если процесс не имеет права писать или искать (выполнять) в каталог, в котором создаётся сокет.

source: On Linux, connecting to a stream socket object requires write permission on that socket; sending a datagram to a datagram socket likewise requires write permission on that socket. POSIX does not make any statement about the effect of the permissions on a socket file, and on some systems (e.g., older BSDs), the socket permissions are ignored. Portable programs should not rely on this feature for security.
ru: В Linux для подключения к объекту потокового сокета требуются права на запись в этот сокет; схожим образом, для отправки дейтаграммы в дейтаграммный сокет требуются права на запись в этот сокет. В POSIX ничего не сказано о влиянии прав файла сокета и в некоторых системах (например, в старых BSD) права на сокет игнорируются. Переносимые программы не должны полагаться на это свойство для обеспечения безопасности.

source: When creating a new socket, the owner and group of the socket file are set according to the usual rules. The socket file has all permissions enabled, other than those that are turned off by the process B<umask>(2).
ru: При создании нового сокета владелец и группа файла сокета назначаются согласно обычных правил. К файлу сокета разрешается любой доступ кроме выключенного процессом с помощью B<umask>(2).

source: The owner, group, and permissions of a pathname socket can be changed (using B<chown>(2) and B<chmod>(2)).
ru: Владелец, группа и права доступа пути сокета можно изменять (с помощью B<chown>(2) и B<chmod>(2)).

source: Abstract sockets
ru: Абстрактные сокеты

source: Socket permissions have no meaning for abstract sockets: the process B<umask>(2) has no effect when binding an abstract socket, and changing the ownership and permissions of the object (via B<fchown>(2) and B<fchmod>(2)) has no effect on the accessibility of the socket.
ru: Права на сокеты не учитываются у абстрактных сокетов: B<umask>(2) процесса не учитывается при подключении к абстрактному сокету как и изменение владельца и прав доступа к объекту (посредством B<fchown>(2) и B<fchmod>(2)) не влияют на доступность сокета.

source: Abstract sockets automatically disappear when all open references to the socket are closed.
ru: Абстрактные сокеты автоматически исчезают при закрытии всех открытых ссылок на них.

source: The abstract socket namespace is a nonportable Linux extension.
ru: Пространство имён абстрактных сокетов является непереносимым расширением Linux.

source: Socket options
ru: Параметры сокета

source: For historical reasons, these socket options are specified with a B<SOL_SOCKET> type even though they are B<AF_UNIX> specific. They can be set with B<setsockopt>(2) and read with B<getsockopt>(2) by specifying B<SOL_SOCKET> as the socket family.
ru: В силу исторических причин эти параметры сокетов относятся к типу B<SOL_SOCKET>, даже если они относятся к B<AF_UNIX>. Они могут быть установлены с помощью B<setsockopt>(2) и прочитаны с помощью B<getsockopt>(2); тип B<SOL_SOCKET> указывается в качестве семейства сокета.

source: Enabling this socket option causes receipt of the credentials of the sending process in an B<SCM_CREDENTIALS ancillary> message in each subsequently received message. The returned credentials are those specified by the sender using B<SCM_CREDENTIALS>, or a default that includes the sender's PID, real user ID, and real group ID, if the sender did not specify B<SCM_CREDENTIALS> ancillary data.
ru: Разрешает приём учётных данных посылающего процесса в вспомогательном сообщении B<SCM_CREDENTIALS> каждого последующего принятого сообщения. Полученные учётные данные были заданы отправителем с помощью B<SCM_CREDENTIALS>, или имеют значение по умолчанию, которое содержит PID отправителя, фактический пользовательский и групповой ID, если отправитель не задал вспомогательные данные B<SCM_CREDENTIALS>.

source: When this option is set and the socket is not yet connected, a unique name in the abstract namespace will be generated automatically.
ru: Если при включении этого параметра сокет ещё не соединён, то в абстрактном пространстве имён будет автоматически создано уникальное имя.

source: The value given as an argument to B<setsockopt>(2) and returned as the result of B<getsockopt>(2) is an integer boolean flag.
ru: Значение передаётся в аргументе B<setsockopt>(2) и возвращается в результате B<getsockopt>(2) в виде целочисленного логического флага.

source: Enables receiving of the SELinux security label of the peer socket in an ancillary message of type B<SCM_SECURITY> (see below).
ru: Разрешает приём метки безопасности SELinux однорангового сокета в вспомогательном сообщении с типом B<SCM_SECURITY> (смотрите ниже).

source: The B<SO_PASSSEC> option is supported for UNIX domain datagram sockets since Linux 2.6.18; support for UNIX domain stream sockets was added in Linux 4.2.
ru: Параметр B<SO_PASSSEC> поддерживается для дейтаграммных доменных сокетов UNIX начиная с Linux 2.6.18; поддержка потоковых доменных сокетов UNIX добавлена в Linux 4.2.

source: See B<socket>(7).
ru: Смотрите B<socket>(7).

source: This read-only socket option returns the credentials of the peer process connected to this socket. The returned credentials are those that were in effect at the time of the call to B<connect>(2) or B<socketpair>(2).
ru: С параметром сокета, доступным только для чтения, возвращаются учётные данные однорангового процесса, соединённого с сокетом. Возвращаются информационные данные, которые были действительными на момент вызова B<connect>(2) или B<socketpair>(2).

source: The argument to B<getsockopt>(2) is a pointer to a I<ucred> structure; define the B<_GNU_SOURCE> feature test macro to obtain the definition of that structure from I<E<lt>sys/socket.hE<gt>>.
ru: Аргументом B<getsockopt>(2) является указатель на структуру I<ucred>; определите макрос тестирования свойств B<_GNU_SOURCE> для получения определения этой структуры из I<E<lt>sys/socket.hE<gt>>.

source: The use of this option is possible only for connected B<AF_UNIX> stream sockets and for B<AF_UNIX> stream and datagram socket pairs created using B<socketpair>(2).
ru: Использование этого параметра возможо только для соединённых потоковых сокетов B<AF_UNIX> и потоков B<AF_UNIX> и для дейтаграммных сокетных пар, созданных с помощью B<socketpair>(2).

source: Autobind feature
ru: Свойство автоматической привязки

source: If a B<bind>(2) call specifies I<addrlen> as I<sizeof(sa_family_t)>, or the B<SO_PASSCRED> socket option was specified for a socket that was not explicitly bound to an address, then the socket is autobound to an abstract address. The address consists of a null byte followed by 5 bytes in the character set I<[0-9a-f]>. Thus, there is a limit of 2^20 autobind addresses. (From Linux 2.1.15, when the autobind feature was added, 8 bytes were used, and the limit was thus 2^32 autobind addresses. The change to 5 bytes came in Linux 2.3.15.)
ru: Если в вызов B<bind>(2) передано значение I<addrlen> равное I<sizeof(sa_family_t)>, или для сокета, который не привязан к адресу явно, был указан параметр сокета B<SO_PASSCRED>, то сокет автоматически привязывается к абстрактному адресу. Адрес состоит из байта null и 5 байтов символов из набора I<[0-9a-f]>. Таким образом, максимальное количество автоматически привязываемых адресов равно 2^20 (в Linux 2.1.15, когда была добавлена автоматическая привязка, использовалось 8 байт, и, таким образом, ограничение было 2^32 адресов. В Linux 2.3.15 количество байт сократили до 5).

source: Sockets API
ru: Программный интерфейс сокетов

source: The following paragraphs describe domain-specific details and unsupported features of the sockets API for UNIX domain sockets on Linux.
ru: В следующих параграфах описываются специфичные тонкости доменов и неподдерживаемые возможности программного интерфейса сокетов для доменных сокетов UNIX в Linux.

source: UNIX domain sockets do not support the transmission of out-of-band data (the B<MSG_OOB> flag for B<send>(2) and B<recv>(2)).
ru: Доменные сокеты UNIX не поддерживают передачу внеполосных данных (флаг B<MSG_OOB> у B<send>(2) и B<recv>(2)).

source: The B<send>(2) B<MSG_MORE> flag is not supported by UNIX domain sockets.
ru: Флаг B<MSG_MORE> у B<send>(2) не поддерживается доменными сокетами UNIX.

source: Before Linux 3.4, the use of B<MSG_TRUNC> in the I<flags> argument of B<recv>(2) was not supported by UNIX domain sockets.
ru: До Linux 3.4 использование B<MSG_TRUNC> в аргументе I<flags> у B<recv>(2) не поддерживалось доменными сокетами UNIX.
