Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: B<other schemes>
ru: B<другие схемы>

source: There are many other URI schemes. Most tools that accept URIs support a set of internal URIs (e.g., Mozilla has the about: scheme for internal information, and the GNOME help browser has the toc: scheme for various starting locations). There are many schemes that have been defined but are not as widely used at the current time (e.g., prospero). The nntp: scheme is deprecated in favor of the news: scheme. URNs are to be supported by the urn: scheme, with a hierarchical name space (e.g., urn:ietf:... would identify IETF documents); at this time URNs are not widely implemented. Not all tools support all schemes.
ru: Существует множество других схем URI. Большинство программ, использующих URI, поддерживают свои собственные схемы URI (например, Mozilla имеет схему about: для работы с внутренней информацией; браузер справки GNOME имеет схему toc: для работы с разными разделами). Есть схемы, которые в данный момент не распространены (например, prospero). Схема news: предпочтительнее схемы nntp:. URN поддерживаются схемой urn: (например, urn:ietf:… означает документы IETF); в настоящее время URN широко не используются. Не все приложения поддерживают все схемы.

source: Character encoding
ru: Кодирование символов

source: URIs use a limited number of characters so that they can be typed in and used in a variety of situations.
ru: В URI используется ограниченный набор символов с учётом того, чтобы их можно было набирать в различных ситуациях.

source: The following characters are reserved, that is, they may appear in a URI but their use is limited to their reserved purpose (conflicting data must be escaped before forming the URI):
ru: Следующие символы зарегистрированы, то есть они могут появляться в URI, но только в определённых для них целях (эти символы в данных должны быть экранированы перед созданием URI):

source: Unreserved characters may be included in a URI. Unreserved characters include uppercase and lowercase English letters, decimal digits, and the following limited set of punctuation marks and symbols:
ru: Незарезервированные символы могут быть использованы в URI. Незарезервированные символы — это английские буквы верхнего и нижнего регистров, цифры и следующий набор знаков пунктуации и символов:

source: All other characters must be escaped. An escaped octet is encoded as a character triplet, consisting of the percent character "%" followed by the two hexadecimal digits representing the octet code (you can use uppercase or lowercase letters for the hexadecimal digits). For example, a blank space must be escaped as "%20", a tab character as "%09", and the "&" as "%26". Because the percent "%" character always has the reserved purpose of being the escape indicator, it must be escaped as "%25". It is common practice to escape space characters as the plus symbol (+) in query text; this practice isn't uniformly defined in the relevant RFCs (which recommend %20 instead) but any tool accepting URIs with query text should be prepared for them. A URI is always shown in its "escaped" form.
ru: Все остальные символы должны экранироваться. Экранированный октет кодируется тремя символами: символом процента «%» и двумя шестнадцатеричными цифрами, представляющими код октета (для ввода шестнадцатеричных цифр можно использовать буквы верхнего и нижнего регистров). Например, пробел обозначается как «%20», символ табуляции (tab) обозначается как «%09», а «&» как «%26». Так как символ «%» зарезервирован, он всегда обозначаться только как «%25». Обычно в запросах пробельные символы заменяют знаком плюс (+); этот способ не определён в RFC (где рекомендуется использовать %20), но любое приложение, принимающее запросы URI, должно его воспринимать. URI всегда показываются в своём «экранированном» виде.

source: Unreserved characters can be escaped without changing the semantics of the URI, but this should not be done unless the URI is being used in a context that does not allow the unescaped character to appear. For example, "%7e" is sometimes used instead of "~" in an HTTP URL path, but the two are equivalent for an HTTP URL.
ru: Незарезервированные символы можно экранировать без изменения семантики URI, но это нельзя делать в случаях, когда URI не используется в контексте, не допускающем появления неэкранированных символов. Например, «%7e» иногда используется вместо «~» в пути HTTP URL, но обе формы воспринимаются в HTTP URL одинаково.

source: For URIs which must handle characters outside the US ASCII character set, the HTML 4.01 specification (section B.2) and IETF RFC\ 2718 (section 2.2.5) recommend the following approach:
ru: Для URI, обрабатывающих символы, не входящих в набор US-ASCII, в главе В.2 документации по HTML 4.01 и в главе 2.2.5 IETF RFC\ 2718 приводится рекомендуемое рациональное решение:

source: translate the character sequences into UTF-8 (IETF RFC\ 2279)\(emsee B<utf-8>(7)\(emand then
ru: Переводить последовательность символов в кодировку UTF-8 (IETF RFC\ 2279) — смотрите B<utf-8>(7) — затем

source: use the URI escaping mechanism, that is, use the %HH encoding for unsafe octets.
ru: использовать механизм экранирования URI, то есть, использовать конвертацию %HH для небезопасных октетов.

source: Writing a URI
ru: Запись URI

source: When written, URIs should be placed inside double quotes (e.g., "http://www.kernel.org"), enclosed in angle brackets (e.g., E<lt>http://lwn.netE<gt>), or placed on a line by themselves. A warning for those who use double-quotes: B<never> move extraneous punctuation (such as the period ending a sentence or the comma in a list) inside a URI, since this will change the value of the URI. Instead, use angle brackets instead, or switch to a quoting system that never includes extraneous characters inside quotation marks. This latter system, called the 'new' or 'logical' quoting system by "Hart's Rules" and the "Oxford Dictionary for Writers and Editors", is preferred practice in Great Britain and hackers worldwide (see the Jargon File's section on Hacker Writing Style, E<.UR http://www.fwi.uva.nl\:/~mes\:/jargon\:/h\:/HackerWritingStyle.html> E<.UE ,> for more information). Older documents suggested inserting the prefix "URL:" just before the URI, but this form has never caught on.
ru: При записи URI должны помещаться в двойные кавычки (например, "http://www.kernel.org"), закрываться в угловые скобки (например, E<lt>http://lwn.netE<gt>) или помещаться на отдельной строке. Предупреждение для использующих двойные кавычки: B<никогда> не помещайте лишнюю пунктуацию (например, точку в конце фразы или запятую в списке) внутрь URI, так как они изменят значение URI. Вместо этого используйте угловые скобки, или перейдите к системе цитирования, в которой никогда не встречаются дополнительные символы внутри цитат. В качестве такой системы можно предложить «новую» или «логическую» систему цитирования от «Hart's Rules» и «Oxford Dictionary for Writers and Editors», используемую в Великобритании и хакерами по всему миру (смотрите раздел Jargon File в Hacker Writing Style, E<.UR http://www.fwi.uva.nl\:/~mes\:/jargon\:/h\:/HackerWritingStyle.html> E<.UE>). Старые документы предполагают вставку префикса «URL:» сразу перед URI, но такая форма никогда не была популярной.

source: The URI syntax was designed to be unambiguous. However, as URIs have become commonplace, traditional media (television, radio, newspapers, billboards, etc.) have increasingly used abbreviated URI references consisting of only the authority and path portions of the identified resource (e.g., E<lt>www.w3.org/AddressingE<gt>). Such references are primarily intended for human interpretation rather than machine, with the assumption that context-based heuristics are sufficient to complete the URI (e.g., hostnames beginning with "www" are likely to have a URI prefix of "http://" and hostnames beginning with "ftp" likely to have a prefix of "ftp://"). Many client implementations heuristically resolve these references. Such heuristics may change over time, particularly when new schemes are introduced. Since an abbreviated URI has the same syntax as a relative URL path, abbreviated URI references cannot be used where relative URIs are permitted, and can be used only when there is no defined base (such as in dialog boxes). Don't use abbreviated URIs as hypertext links inside a document; use the standard format as described here.
ru: Синтаксис URI разрабатывался как однозначный. Однако когда URI стали использовать повсеместно, традиционные средства массовой информации (телевидение, радио, газеты и т.д.) стали применять сокращённые ссылки URI, состоящие из названия домена и пути к конкретному ресурсу (например, E<lt>www.w3.org/AddressingE<gt>). Такие ссылки больше предназначены для человеческого восприятия, а не для считывания машиной в предположении, что для полного понимания URI будет достаточно контекста применения (например, имена узлов, начинающиеся с «www», скорее всего, имеют в URI префикс «http://», а имена узлов, начинающиеся с «ftp», скорее всего, имеют префикс «ftp://»). Много реализаций клиентов «додумывают» такие ссылки. Такие предположения могут иногда меняться, в частности при появлении новых схем. Так как сокращённые URI имеют тот же синтаксис, что и путь относительных URL, сокращённые URI не могут быть использованы в тех случаях, где используются относительные URI; они могут использоваться только когда нет определённой основы (например, в диалоговых окнах). Не используйте сокращённые URI как гипертекстовые ссылки в документах, используйте стандартный формат, как описано в данном документе.

source: Any tool accepting URIs (e.g., a web browser) on a Linux system should be able to handle (directly or indirectly) all of the schemes described here, including the man: and info: schemes. Handling them by invoking some other program is fine and in fact encouraged.
ru: Любое приложение, использующее URI (например, веб-браузер) в Linux, должно поддерживать (непосредственно или косвенно) все схемы, описанные здесь, включая схемы man: и info:. Для обработки предлагается вызывать стороннюю программу.

source: Technically the fragment isn't part of the URI.
ru: Технически, фрагмент не является частью URI.

source: For information on how to embed URIs (including URLs) in a data format, see documentation on that format. HTML uses the format E<lt>A HREF="I<uri>"E<gt> I<text> E<lt>/AE<gt>. Texinfo files use the format @uref{I<uri>}. Man and mdoc have the recently added UR macro, or just include the URI in the text (viewers should be able to detect :// as part of a URI).
ru: Для получения информации о том, как включить URI (включая URL) в формат данных, прочтите соответствующую документацию. HTML использует формат E<lt>A HREF="I<uri>"E<gt> I<text> E<lt>/AE<gt>. Файлы texinfo используют формат @uref{I<uri>}. Man и mdoc имеют недавно добавленный макрос UR или просто включают URI в текст (программы просмотра должны распознавать, что :// это часть URI).

source: The GNOME and KDE desktop environments currently vary in the URIs they accept, in particular in their respective help browsers. To list man pages, GNOME uses E<lt>toc:manE<gt> while KDE uses E<lt>man:(index)E<gt>, and to list info pages, GNOME uses E<lt>toc:infoE<gt> while KDE uses E<lt>info:(dir)E<gt> (the author of this man page prefers the KDE approach here, though a more regular format would be even better). In general, KDE uses E<lt>file:/cgi-bin/E<gt> as a prefix to a set of generated files. KDE prefers documentation in HTML, accessed via the E<lt>file:/cgi-bin/helpindexE<gt>. GNOME prefers the ghelp scheme to store and find documentation. Neither browser handles file: references to directories at the time of this writing, making it difficult to refer to an entire directory with a browsable URI. As noted above, these environments differ in how they handle the info: scheme, probably the most important variation. It is expected that GNOME and KDE will converge to common URI formats, and a future version of this man page will describe the converged result. Efforts to aid this convergence are encouraged.
ru: В настоящее время окружения рабочего стола GNOME и KDE используют различные URI, в частности в своих справочных системах. Для справочных страниц в GNOME используется E<lt>toc:manE<gt>, а в KDE — E<lt>man:(index)E<gt>; для страниц info в GNOME используется E<lt>toc:infoE<gt>, а в KDE — E<lt>info:(dir)E<gt> (автору данной справочной страницы нравится выбор KDE, так как он больше похож на обычно используемый формат). В общем случае, в KDE используется E<lt>file:/cgi-bin/E<gt> в качестве приставки к набору генерируемых файлов. В KDE предпочитают использовать документацию в HTML, доступную как E<lt>file:/cgi-bin/helpindexE<gt>. В GNOME для хранения и поиска документации предпочитают использовать схему ghelp. Ни один обозреватель в момент написания этого документа не поддерживал схему ссылок на каталоги file:, что затрудняет ссылку на весь каталог с помощью просматриваемого URI. Как говорилось ранее, эти окружения различаются по способу поддержки схемы info:. В перспективе GNOME и KDE должны прийти к единому формату URI, и будущая версия системы войдёт в эту справочную страницу. Помогите достичь этого единства.

source: A URI does not in itself pose a security threat. There is no general guarantee that a URL, which at one time located a given resource, will continue to do so. Nor is there any guarantee that a URL will not locate a different resource at some later point in time; such a guarantee can be obtained only from the person(s) controlling that namespace and the resource in question.
ru: Сам по себе URI не создаёт никакой угрозы безопасности. Но нет никакой гарантии, что URL, который однажды указывал на конкретный ресурс, в дальнейшем будет делать то же самое. Так же нет никаких гарантий, что этот же URL позднее не будет ссылаться на совершенно другой ресурс. Такие гарантии можно получить лишь от лица, ответственного за эти ресурсы и их пространство имён.

source: It is sometimes possible to construct a URL such that an attempt to perform a seemingly harmless operation, such as the retrieval of an entity associated with the resource, will in fact cause a possibly damaging remote operation to occur. The unsafe URL is typically constructed by specifying a port number other than that reserved for the network protocol in question. The client unwittingly contacts a site that is in fact running a different protocol. The content of the URL contains instructions that, when interpreted according to this other protocol, cause an unexpected operation. An example has been the use of a gopher URL to cause an unintended or impersonating message to be sent via a SMTP server.
ru: Существует возможность составить URL таким образом, что попытка произвести обыкновенную, «безобидную» операцию, такую, как получение информации с определённого ресурса, возможно, вызовет сбой в её выполнении. Небезопасный URL, обычно, создаётся следующим образом: в запросе указывается номер порта, не совпадающий с номером зарезервированного порта сетевого протокола. Клиент неосознанно заходит на сайт, но используя другой протокол. В URL содержатся команды, которые при их считывании (в соответствии с другим протоколом) производят непредвиденную операцию. Примером может послужить использование gopher URL для создания ненужного и безадресного сообщения, которое отправится через сервер SMTP.

source: Caution should be used when using any URL that specifies a port number other than the default for the protocol, especially when it is a number within the reserved space.
ru: Нужно быть осторожным с URL, в которых указан номер порта, отличный от стандартного порта для протокола, в особенности, если этот номер находится в зарезервированной области.

source: Care should be taken when a URI contains escaped delimiters for a given protocol (for example, CR and LF characters for telnet protocols) that these are not unescaped before transmission. This might violate the protocol, but avoids the potential for such characters to be used to simulate an extra operation or parameter in that protocol, which might lead to an unexpected and possibly harmful remote operation to be performed.
ru: Надо быть очень внимательным и в тех случаях, когда URI содержит экранированные разделители протокола (например, символы CR и LF для протокола telnet), с которых экранирование не будет снято перед передачей. Это могло бы нарушить протокол, но само отключение возможностей таких символов может вызвать возникновение дополнительных действий этого протокола, которые могут привести к выполнению непредвиденных и не совсем безобидных операций.

source: It is clearly unwise to use a URI that contains a password which is intended to be secret. In particular, the use of a password within the "userinfo" component of a URI is strongly recommended against except in those rare cases where the "password" parameter is intended to be public.
ru: Также довольно не предусмотрительно использовать пароль в URI. В частности, рекомендуется использовать пароль внутри URI-компонента «userinfo», за исключением редких случаев, когда параметр «password» может быть показан всем.

source: Documentation may be placed in a variety of locations, so there currently isn't a good URI scheme for general online documentation in arbitrary formats. References of the form E<lt>file:///usr/doc/ZZZE<gt> don't work because different distributions and local installation requirements may place the files in different directories (it may be in /usr/doc, or /usr/local/doc, or /usr/share, or somewhere else). Also, the directory ZZZ usually changes when a version changes (though filename globbing could partially overcome this). Finally, using the file: scheme doesn't easily support people who dynamically load documentation from the Internet (instead of loading the files onto a local filesystem). A future URI scheme may be added (e.g., "userdoc:") to permit programs to include cross-references to more detailed documentation without having to know the exact location of that documentation. Alternatively, a future version of the filesystem specification may specify file locations sufficiently so that the file: scheme will be able to locate documentation.
ru: Документация может быть расположена в различных местах, поэтому не существует схемы URI для просмотра документации в различных форматах. Ссылки типа E<lt>file:///usr/doc/ZZZE<gt> не работают по причине различных требований дистрибутивов и установочных требований, согласно которым документация может быть размещена в разных каталогах (она может быть в /usr/doc, /usr/local/doc, /usr/share или где-нибудь ещё). К тому же, содержимое каталога ZZZ, обычно, изменяется с каждой версией (хотя, частично это можно решить использованием шаблонов имён файлов). А людям, которые получают документацию по Интернет (вместо того, чтобы хранить её в своей системе), схема file: вообще ничем не будет полезна. В будущем может быть добавлена новая схема URI (например, «userdoc:»), которая позволит программам включать перекрёстные ссылки на дополнительную документацию и, при этом, не учитывать точное расположение такой документации. Или же в новой версии файловой системы можно будет указывать расположения файлов так, что можно будет находить документацию прямо по схеме file:.

source: Many programs and file formats don't include a way to incorporate or implement links using URIs.
ru: Многие программы и форматы файлов не имеют возможности включать ссылки с помощью URI.

source: Many programs can't handle all of these different URI formats; there should be a standard mechanism to load an arbitrary URI that automatically detects the users' environment (e.g., text or graphics, desktop environment, local user preferences, and currently executing tools) and invokes the right tool for any URI.
ru: Так как не все программы поддерживают различные форматы URI, то должен существовать стандартный механизм загрузки произвольного URI, который автоматически определит пользовательскую среду (например, текстовую или графическую, рабочий стол, локальные предпочтения пользователя и используемые инструменты) и запустит правильное приложение для любого URI.

source: udp - User Datagram Protocol for IPv4
ru: udp - протокол UDP (User Datagram Protocol) для IPv4

source: This is an implementation of the User Datagram Protocol described in RFC\ 768. It implements a connectionless, unreliable datagram packet service. Packets may be reordered or duplicated before they arrive. UDP generates and checks checksums to catch transmission errors.
ru: Это реализация протокола пользовательских датаграмм (User Datagram Protocol, UDP), который описан в RFC\ 768. Он обеспечивает ненадежную передачу датаграмм без установления соединения. При пересылке пакеты могут дублироваться, а их порядок может быть нарушен. UDP генерирует и проверяет контрольные суммы, чтобы отловить ошибки передачи.

source: When a UDP socket is created, its local and remote addresses are unspecified. Datagrams can be sent immediately using B<sendto>(2) or B<sendmsg>(2) with a valid destination address as an argument. When B<connect>(2) is called on the socket, the default destination address is set and datagrams can now be sent using B<send>(2) or B<write>(2) without specifying a destination address. It is still possible to send to other destinations by passing an address to B<sendto>(2) or B<sendmsg>(2). In order to receive packets, the socket can be bound to a local address first by using B<bind>(2). Otherwise, the socket layer will automatically assign a free local port out of the range defined by I</proc/sys/net/ipv4/ip_local_port_range> and bind the socket to B<INADDR_ANY>.
ru: При создании UDP-сокета его локальный и удалённый адрес не указываются. Датаграммы могут быть посланы немедленно с помощью B<sendto>(2) или B<sendmsg>(2) с правильным адресом назначения в качестве аргумента. Когда для сокета вызывается B<connect>(2), то устанавливается адрес назначения по умолчанию и с этого момента датаграммы могут отсылаться с помощью B<send>(2) или B<write>(2) без указания адреса назначения. При этом всё ещё сохраняется возможность послать пакет другому адресату, передавая его адрес через вызовы B<sendto>(2) или B<sendmsg>(2). Для получения пакетов сокет сначала можно привязать к локальному адресу с помощью B<bind>(2). В противном случае сокетный уровень автоматически присвоит свободный локальный порт из диапазона, заданного в I</proc/sys/net/ipv4/ip_local_port_range>, и привяжет сокет к B<INADDR_ANY>.

source: All receive operations return only one packet. When the packet is smaller than the passed buffer, only that much data is returned; when it is bigger, the packet is truncated and the B<MSG_TRUNC> flag is set. B<MSG_WAITALL> is not supported.
ru: Все операции приёма возвращают только один пакет. Если пакет меньше, чем размер буфера приема, то он возвращается целиком; если пакет больше, то он обрезается и устанавливается флаг B<MSG_TRUNC>. Флаг B<MSG_WAITALL> не поддерживается.

source: IP options may be sent or received using the socket options described in B<ip>(7). They are processed by the kernel only when the appropriate I</proc> parameter is enabled (but still passed to the user even when it is turned off). See B<ip>(7).
ru: Параметры IP могут быть посланы или получены при помощи параметров сокета, описанных в B<ip>(7). Они обрабатываются ядром, только если включён соответствующий параметр в I</proc> (но даже если он отключен, параметры всё равно передаются пользователю). Смотрите B<ip>(7).
