Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: The cases where unmapped IDs are mapped in this fashion include system calls that return user IDs (B<getuid>(2), B<getgid>(2), and similar), credentials passed over a UNIX domain socket, credentials returned by B<stat>(2), B<waitid>(2), and the System V IPC "ctl" B<IPC_STAT> operations, credentials exposed by I</proc/[pid]/status> and the files in I</proc/sysvipc/*>, credentials returned via the I<si_uid> field in the I<siginfo_t> received with a signal (see B<sigaction>(2)), credentials written to the process accounting file (see B<acct>(5)), and credentials returned with POSIX message queue notifications (see B<mq_notify>(3)).
ru: Случаи, где неотображённые ID отображаются в таком виде, относятся к системным вызовам, которые возвращают пользовательские ID (B<getuid>(2), B<getgid>(2) и подобные), мандаты, передаваемые через доменный сокет UNIX, мандаты, возвращаемые B<stat>(2), B<waitid>(2) и System V IPC «ctl»-операциями B<IPC_STAT>, мандаты, показываемые в I</proc/[pid]/status> и файлах в I</proc/sysvipc/*>, мандаты, возвращаемые в поле I<si_uid> структуры I<siginfo_t>, полученной по сигналу (смотрите B<sigaction>(2)), мандаты, записываемые в файл учёта процесса (смотрите B<acct>(5)), и мандаты, возвращаемые с уведомлениями очереди сообщений POSIX (смотрите B<mq_notify>(3)).

source: There is one notable case where unmapped user and group IDs are I<not> converted to the corresponding overflow ID value. When viewing a I<uid_map> or I<gid_map> file in which there is no mapping for the second field, that field is displayed as 4294967295 (-1 as an unsigned integer).
ru: Есть один известный случай, где неотображённый пользовательский и групповой ID I<не> преобразуется в соответствующее значение ID переполнения. Если при просмотре файла I<uid_map> или I<gid_map> обнаруживается, что для второго поля нет отображения, то поле отображается как 4294967295 (-1 для беззнакового целого).

source: Accessing files
ru: Доступ к файлам

source: In order to determine permissions when an unprivileged process accesses a file, the process credentials (UID, GID) and the file credentials are in effect mapped back to what they would be in the initial user namespace and then compared to determine the permissions that the process has on the file. The same is also of other objects that employ the credentials plus permissions mask accessibility model, such as System V IPC objects
ru: Чтобы определить права, с которыми непривилегированный процесс обращается к файлу, берутся идентификаторы процесса (UID, GID) и идентификаторы файла, отображаемые в те, которые были бы в исходном пространстве имён пользователя, и затем сравниваются для определения прав, которые процесс имеет на файл. Это также выполняется и для других объектов, использующих идентификаторы плюс модель маски прав доступа, например для объектов System V IPC.

source: Operation of file-related capabilities
ru: Операции с файловыми мандатами

source: Certain capabilities allow a process to bypass various kernel-enforced restrictions when performing operations on files owned by other users or groups. These capabilities are: B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER>, and B<CAP_FSETID>.
ru: Некоторые мандаты позволяют процессу обходить различные ограничения, налагаемые ядром на выполнение операций над файлами, принадлежащими другим пользователям или группам. Список мандатов: B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER> и B<CAP_FSETID>.

source: Within a user namespace, these capabilities allow a process to bypass the rules if the process has the relevant capability over the file, meaning that:
ru: Внутри пользовательского пространства имён эти мандаты позволяют процессу обходить правила, если процесс имеет соответствующий мандат на файле, подразумевающий что:

source: the process has the relevant effective capability in its user namespace; and
ru: процесс имеет соответствующий эффективный мандат в своём пространстве имён пользователя; и

source: the file's user ID and group ID both have valid mappings in the user namespace.
ru: файловые ID пользователя и группы корректно отображаются в пользовательскомпространстве имён.

source: The B<CAP_FOWNER> capability is treated somewhat exceptionally: it allows a process to bypass the corresponding rules so long as at least the file's user ID has a mapping in the user namespace (i.e., the file's group ID does not need to have a valid mapping).
ru: Мандат B<CAP_FOWNER> учитывается по-другому: it allows a process to bypass the corresponding rules so long as at least the file's user ID has a mapping in the user namespace (т. е., файловый ID группы может не иметь корректного отображения).

source: Set-user-ID and set-group-ID programs
ru: Программы с установленными битами set-user-ID и set-group-ID

source: When a process inside a user namespace executes a set-user-ID (set-group-ID) program, the process's effective user (group) ID inside the namespace is changed to whatever value is mapped for the user (group) ID of the file. However, if either the user I<or> the group ID of the file has no mapping inside the namespace, the set-user-ID (set-group-ID) bit is silently ignored: the new program is executed, but the process's effective user (group) ID is left unchanged. (This mirrors the semantics of executing a set-user-ID or set-group-ID program that resides on a filesystem that was mounted with the B<MS_NOSUID> flag, as described in B<mount>(2).)
ru: Когда процесс внутри пользовательского пространства имён выполняет программу с установленным битом set-user-ID (set-group-ID), то эффективный ID пользователя (группы) внутри пространства имён изменяется на значение, отображённое для ID пользователя (группы) файла. Однако, если ID пользователя I<или> группы файла не имеет отображения внутри пространства имён, то бит set-user-ID (set-group-ID) просто игнорируется: выполняется новая программа, но эффективный ID пользователя (группы) остаётся не изменённым (такое поведение зеркально семантике выполнения программы с set-user-ID или set-group-ID, располагающейся в файловой системе, которая была смонтирована с флагом B<MS_NOSUID>, как описано в B<mount>(2)).

source: Miscellaneous
ru: Разное

source: When a process's user and group IDs are passed over a UNIX domain socket to a process in a different user namespace (see the description of B<SCM_CREDENTIALS> in B<unix>(7)), they are translated into the corresponding values as per the receiving process's user and group ID mappings.
ru: Когда ID пользователя и группы процесса передаются через доменный сокет UNIX в процесс в другом пользовательском пространстве имён (смотрите описание B<SCM_CREDENTIALS> в B<unix>(7)), то они транслируются в соответствующие значения согласно отображению ID пользователя и группы принимающего процесса.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: Namespaces are a Linux-specific feature.
ru: Пространства имён есть только в Linux.

source: Over the years, there have been a lot of features that have been added to the Linux kernel that have been made available only to privileged users because of their potential to confuse set-user-ID-root applications. In general, it becomes safe to allow the root user in a user namespace to use those features because it is impossible, while in a user namespace, to gain more privilege than the root user of a user namespace has.
ru: За эти годы в ядро Linux добавлено много свойств, которые были доступны только привилегированным пользователям, так как их возможности слишком велики, чтобы наделять ими приложения с set-user-ID. В целом, становится безопасно разрешать пользователю root в пользовательском пространстве имён использовать эти свойства, так как будучи в пользовательском пространстве имён, он не может получить больше прав, чем имеет root в пользовательском пространстве имён.

source: Availability
ru: Доступность

source: Use of user namespaces requires a kernel that is configured with the B<CONFIG_USER_NS> option. User namespaces require support in a range of subsystems across the kernel. When an unsupported subsystem is configured into the kernel, it is not possible to configure user namespaces support.
ru: Для использования пользовательских пространств имён ядро должно быть собрано с параметром B<CONFIG_USER_NS>. Пользовательские пространства имён требуют поддержки во многих подсистемах ядра. Если в ядре задействована неподдерживаемая подсистема, то включить поддержку пользовательских пространств имён невозможно.

source: As at Linux 3.8, most relevant subsystems supported user namespaces, but a number of filesystems did not have the infrastructure needed to map user and group IDs between user namespaces. Linux 3.9 added the required infrastructure support for many of the remaining unsupported filesystems (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS, and OCFS2). Linux 3.12 added support for the last of the unsupported major filesystems, XFS.
ru: В Linux 3.8 самые важные подсистемы поддерживают пользовательские пространства имён, но значительное количество файловых систем не имеют инфраструктуры для отображения пользовательских и групповых ID между пользовательскими пространствами имён. В Linux 3.9 добавлена требуемая поддержка инфраструктуры во многие неподдерживаемые файловые системы (Plan 9 (9P), Andrew File System (AFS), Ceph, CIFS, CODA, NFS и OCFS2). В Linux 3.12 добавлена поддержка в последние основные файловые системы (XFS).

source: The program below is designed to allow experimenting with user namespaces, as well as other types of namespaces. It creates namespaces as specified by command-line options and then executes a command inside those namespaces. The comments and I<usage()> function inside the program provide a full explanation of the program. The following shell session demonstrates its use.
ru: Представленная далее программа разработана для экспериментов с пользовательскими пространствами имён. Она создаёт пространства имён согласно параметрам командной строки и затем выполняет команду внутри этих пространств имён. В комментариях и функции I<usage()> предоставлено полное описание программы. Следующий сеанс оболочки показывает её работу.

source: First, we look at the run-time environment:
ru: Сначала, посмотрим на окружение выполнения:

source: $ B<uname -rs> # Need Linux 3.8 or later Linux 3.8.0 $ B<id -u> # Running as unprivileged user 1000 $ B<id -g> 1000
ru: $ B<uname -rs> # требуется Linux 3.8 или новее Linux 3.8.0 $ B<id -u> # работа от непривилегированного пользователя 1000 $ B<id -g> 1000

source: Now start a new shell in new user (I<-U>), mount (I<-m>), and PID (I<-p>) namespaces, with user ID (I<-M>) and group ID (I<-G>) 1000 mapped to 0 inside the user namespace:
ru: Теперь запустим новую оболочку в новых пользовательском (I<-U>), монтирования (I<-m>) и PID (I<-p>) пространствах имён с пользовательским (I<-M>) и групповым ID (I<-G>) 1000, отображающимся в 0 внутри пользовательского пространства имён:

source: The shell has PID 1, because it is the first process in the new PID namespace:
ru: У оболочки PID равен 1, так как это первый процесс в новом пространстве имён PID:

source: Mounting a new I</proc> filesystem and listing all of the processes visible in the new PID namespace shows that the shell can't see any processes outside the PID namespace:
ru: Смонтируем новую файловую систему I</proc> и просмотрим все процессы, видимые в новом пространстве имён PID; убедимся, что оболочка не видит ни одного процесса вне своего пространства имён PID:

source: Inside the user namespace, the shell has user and group ID 0, and a full set of permitted and effective capabilities:
ru: Внутри пользовательского пространства имён идентификаторы пользователя и группы оболочки равны 0, и она имеет полный набор разрешённых и эффективных мандатов:

source: Licensed under GNU General Public License v2 or later
ru: Лицензируется на условиях Универсальной общественной лицензии GNU версии 2 и новее

source: Create a child process that executes a shell command in new namespace(s); allow UID and GID mappings to be specified when creating a user namespace. */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>
ru: Создаёт дочерний процесс, который запускает командную оболочку в новых пространствах имён; может выполнять отображение UID и GID, если они указаны при создании пользовательского пространства имён. */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>string.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>errno.hE<gt>

source: /* A simple error-handling function: print an error message based on the value in \(aqerrno\(aq and terminate the calling process */
ru: /* Простая функция обработки ошибок: выводит сообщение об ошибке согласно значению в «errno» и завершает вызвавший процесс */

source: struct child_args { char **argv; /* Command to be executed by child, with args */ int pipe_fd[2]; /* Pipe used to synchronize parent and child */ };
ru: struct child_args { char **argv; /* команда, выполняемая потомком с параметрами */ int pipe_fd[2]; /* канал для синхронизации родителя и потомка */ };

source: static void usage(char *pname) { fprintf(stderr, "Usage: %s [options] cmd [arg...]\en\en", pname); fprintf(stderr, "Create a child process that executes a shell " "command in a new user namespace,\en" "and possibly also other new namespace(s).\en\en"); fprintf(stderr, "Options can be:\en\en"); #define fpe(str) fprintf(stderr, " %s", str); fpe("-i New IPC namespace\en"); fpe("-m New mount namespace\en"); fpe("-n New network namespace\en"); fpe("-p New PID namespace\en"); fpe("-u New UTS namespace\en"); fpe("-U New user namespace\en"); fpe("-M uid_map Specify UID map for user namespace\en"); fpe("-G gid_map Specify GID map for user namespace\en"); fpe("-z Map user\(aqs UID and GID to 0 in user namespace\en"); fpe(" (equivalent to: -M \(aq0 E<lt>uidE<gt> 1\(aq -G \(aq0 E<lt>gidE<gt> 1\(aq)\en"); fpe("-v Display verbose messages\en"); fpe("\en"); fpe("If -z, -M, or -G is specified, -U is required.\en"); fpe("It is not permitted to specify both -z and either -M or -G.\en"); fpe("\en"); fpe("Map strings for -M and -G consist of records of the form:\en"); fpe("\en"); fpe(" ID-inside-ns ID-outside-ns len\en"); fpe("\en"); fpe("A map string can contain multiple records, separated" " by commas;\en"); fpe("the commas are replaced by newlines before writing" " to map files.\en");
ru: static void usage(char *pname) { fprintf(stderr, "Использование: %s [параметры] кмд [арг…]\en\en", pname); fprintf(stderr, "Создаёт дочерний процесс, который запускает командную " "оболочку в новом пользовательском пространстве имён,\en" "и, возможно, также в других новых пространствах имён.\en\en"); fprintf(stderr, "Параметры:\en\en"); #define fpe(str) fprintf(stderr, " %s", str); fpe("-i Новое пространство имён IPC\en"); fpe("-m Новое пространство имён монтирования\en"); fpe("-n Новое сетевое пространство имён\en"); fpe("-p Новое пространство имён PID\en"); fpe("-u Новое пространство имён UTS\en"); fpe("-U Новое пользовательское пространство имён\en"); fpe("-M uid_map карта UID для пользовательского пространства имён\en"); fpe("-G gid_map карта GID для пользовательского пространства имён\en"); fpe("-z Отображать пользовательский UID и GID в 0 в пользовательском пространстве имён\en"); fpe(" (эквивалентно: -M \(aq0 E<lt>uidE<gt> 1\(aq -G \(aq0 E<lt>gidE<gt> 1\(aq)\en"); fpe("-v показывать дополнительные сообщения\en"); fpe("\en"); fpe("Если указан -z, -M или -G, то требуется -U.\en"); fpe("Нельзя указывать -z вместе с -M или -G.\en"); fpe("\en"); fpe("Строка карты для -M и -G состоит из записей вида:\en"); fpe("\en"); fpe(" ID-внутри-ns ID-вне-ns длина\en"); fpe("\en"); fpe("Строка карты может содержать несколько записей через запятую;\en"); fpe("запятые замещаются на символы новой строки перед записью" " в файлы карт.\en");

source: /* Update the mapping file \(aqmap_file\(aq, with the value provided in \(aqmapping\(aq, a string that defines a UID or GID mapping. A UID or GID mapping consists of one or more newline-delimited records of the form:
ru: /* Обновляем файл отображения «map_file» значением из «mapping» — строкой, в которой определены отображения UID или GID. Отображения UID или GID состоят из одной или более записей (разделённых символом новой строки) вида:

source: ID_inside-ns ID-outside-ns length
ru: ID-внутри-ns ID-снаружи-ns длина

source: Requiring the user to supply a string that contains newlines is of course inconvenient for command-line use. Thus, we permit the use of commas to delimit records in this string, and replace them with newlines before writing the string to the file. */
ru: Требовать от пользователя указывать строку с символами новой строки в командной строке неприемлемо. Поэтому мы позволим использовать для разделения записей запятые и заменим их символами новой строки перед записью строки в файл. */

source: static void update_map(char *mapping, char *map_file) { int fd, j; size_t map_len; /* Length of \(aqmapping\(aq */
ru: static void update_map(char *mapping, char *map_file) { int fd, j; size_t map_len; /* длина «mapping» */

source: /* Replace commas in mapping string with newlines */
ru: /* Заменяем запятые на символы новой строки в строке отображения */

source: fd = open(map_file, O_RDWR); if (fd == -1) { fprintf(stderr, "ERROR: open %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }
ru: fd = open(map_file, O_RDWR); if (fd == -1) { fprintf(stderr, "ОШИБКА: open %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }

source: if (write(fd, mapping, map_len) != map_len) { fprintf(stderr, "ERROR: write %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }
ru: if (write(fd, mapping, map_len) != map_len) { fprintf(stderr, "ОШИБКА: write %s: %s\en", map_file, strerror(errno)); exit(EXIT_FAILURE); }

source: /* Linux 3.19 made a change in the handling of setgroups(2) and the \(aqgid_map\(aq file to address a security issue. The issue allowed *unprivileged* users to employ user namespaces in order to drop The upshot of the 3.19 changes is that in order to update the \(aqgid_maps\(aq file, use of the setgroups() system call in this user namespace must first be disabled by writing "deny" to one of the /proc/PID/setgroups files for this namespace. That is the purpose of the following function. */
ru: /* В Linux 3.19 изменена работа с setgroups(2) и добавлен файл \(aqgid_map\(aq для обеспечения безопасности. Задача в том, чтобы запретить удалять группы *непривилегированному* пользователю через создание пространства имён. Результат изменений 3.19 в том, что для обновления файла \(aqgid_maps\(aq, сначала нужно запретить системный вызов setgroups() в этом пользовательском пространстве имён, записав "deny" в один из файлов /proc/PID/setgroups в этом пространстве имён. Это цель данной функции. */

source: /* We may be on a system that doesn\(aqt support /proc/PID/setgroups. In that case, the file won\(aqt exist, and the system won\(aqt impose the restrictions that Linux 3.19 added. That\(aqs fine: we don\(aqt need to do anything in order to permit \(aqgid_map\(aq to be updated.
ru: /* Система может не поддерживать /proc/PID/setgroups. В этом случае файл не существует, и система не закладывает ограничений, добавленных в Linux 3.19. Хорошо, нам не нужно ничего делать, чтобы разрешить обновлять \(aqgid_map\(aq.

source: However, if the error from open() was something other than the ENOENT error that is expected for that case, let the user know. */
ru: Однако, если ошибка open() отличается от ENOENT, сообщим об этом пользователю. */

source: if (write(fd, str, strlen(str)) == -1) fprintf(stderr, "ERROR: write %s: %s\en", setgroups_path, strerror(errno));
ru: if (write(fd, str, strlen(str)) == -1) fprintf(stderr, "ОШИБКА: write %s: %s\en", setgroups_path, strerror(errno));

source: static int /* Start function for cloned child */ childFunc(void *arg) { struct child_args *args = (struct child_args *) arg; char ch;
ru: static int /* Начальная функция клонированного потомка */ childFunc(void *arg) { struct child_args *args = (struct child_args *) arg; char ch;

source: /* Wait until the parent has updated the UID and GID mappings. See the comment in main(). We wait for end of file on a pipe that will be closed by the parent process once it has updated the mappings. */
ru: /* Ждём пока родитель обновит отображения UID и GID. Смотрите комментарий в main(). Мы ждём конца файла в канале, который будет закрыт родительским процессом после обновления отображений. */

source: close(args-E<gt>pipe_fd[1]); /* Close our descriptor for the write end of the pipe so that we see EOF when parent closes its descriptor */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Failure in child: read from pipe returned != 0\en"); exit(EXIT_FAILURE); }
ru: close(args-E<gt>pipe_fd[1]); /* закрываем наш дескриптор для записи конца канала для того, чтобы мы увидели EOF, когда родитель закроет свой дескриптор */ if (read(args-E<gt>pipe_fd[0], &ch, 1) != 0) { fprintf(stderr, "Ошибка в потомке: при чтении из канала получен != 0\en"); exit(EXIT_FAILURE); }

source: /* Execute a shell command */
ru: /* Запускаем командную оболочку */

source: printf("About to exec %s\en", args-E<gt>argv[0]); execvp(args-E<gt>argv[0], args-E<gt>argv); errExit("execvp"); }
ru: printf("О exec %s\en", args-E<gt>argv[0]); execvp(args-E<gt>argv[0], args-E<gt>argv); errExit("execvp"); }

source: static char child_stack[STACK_SIZE]; /* Space for child\(aqs stack */
ru: static char child_stack[STACK_SIZE]; /* место под стек в потомке */

source: /* Parse command-line options. The initial \(aq+\(aq character in the final getopt() argument prevents GNU-style permutation of command-line options. That\(aqs useful, since sometimes the \(aqcommand\(aq to be executed by this program itself has command-line options. We don\(aqt want getopt() to treat those as options to this program. */
ru: /* Разбираем параметры командной строки. Начальный символ «+» в последнем аргументе getopt() предотвращает подстановку параметров командной строки в стиле GNU. Это полезно, так как иногда «команда», выполняемая этой программой, сама имеет параметры командной строки. Мы не хотим, чтобы getopt() передала их нашей программе. */

source: /* -M or -G without -U is nonsensical */
ru: /* -M или -G без -U не имеют смысла */
