Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: The calling thread's current locale is set to the specified locale.
ru: Текущая локаль вызвавшей нити будет равна указанной локали.

source: The special locale object handle B<LC_GLOBAL_LOCALE>
ru: Специальный обработчик объекта локали B<LC_GLOBAL_LOCALE>

source: The calling thread's current locale is set to the global locale determined by B<setlocale>(3).
ru: Текущая локаль вызвавшей нити будет равна глобальной локали, установленной B<setlocale>(3).

source: The calling thread's current locale is left unchanged (and the current locale is returned as the function result).
ru: Текущая локаль вызвавшей нити останется неизменной (и текущая локаль возвращается как результат работы функции).

source: On success, B<uselocale>() returns the locale handle that was set by the previous call to B<uselocale>() in this thread, or B<LC_GLOBAL_LOCALE> if there was no such previous call. On error, it returns I<(locale_t)\ 0>, and sets I<errno> to indicate the cause of the error.
ru: При успешном выполнении B<uselocale>() возвращает обработчик локали, который был установлен предыдущим вызовом B<uselocale>() в этой нити или B<LC_GLOBAL_LOCALE>, если это первый вызов. При ошибке возвращается I<(locale_t)\ 0>, а I<errno> присваивается код ошибки.

source: I<newloc> does not refer to a valid locale object.
ru: Значение I<newloc> не указывает на допустимый объект локали.

source: The B<uselocale>() function first appeared in version 2.3 of the GNU C library.
ru: Функция B<uselocale>() впервые появилась в версии 2.3 библиотеки GNU C.

source: Unlike B<setlocale>(3), B<uselocale>() does not allow selective replacement of individual locale categories. To employ a locale that differs in only a few categories from the current locale, use calls to B<duplocale>(3) and B<newlocale>(3) to obtain a locale object equivalent to the current locale and modify the desired categories in that object.
ru: В отличие от B<setlocale>(3), B<uselocale>() не позволяет выборочно указывать отдельные категории локали. Для задания локали, которая отличается только отдельными категориями от текущей локали, используйте вызов B<duplocale>(3) и B<newlocale>(3) для получения эквивалента объекта локали для текущей локали и измените желаемые категории в этом объекте.

source: See B<newlocale>(3) and B<duplocale>(3).
ru: Смотрите B<newlocale>(3) и B<duplocale>(3).

source: ualarm - schedule signal after given number of microseconds
ru: ualarm - планирует отправку сигнала через заданное число микросекунд

source: The B<ualarm>() function causes the signal B<SIGALRM> to be sent to the invoking process after (not less than) I<usecs> microseconds. The delay may be lengthened slightly by any system activity or by the time spent processing the call or by the granularity of system timers.
ru: Функция B<ualarm>() планирует отправку сигнала B<SIGALRM> вызывающему процессу (не менее чем) через I<usecs> микросекунд. Задержка может быть слегка больше при большой загруженности системы, из-за, собственно, времени обработки этого вызова или из-за неточности хода системных часов.

source: Unless caught or ignored, the B<SIGALRM> signal will terminate the process.
ru: Если сигнал не будет пойман или проигнорирован, то B<SIGALRM> уничтожит процесс.

source: If the I<interval> argument is nonzero, further B<SIGALRM> signals will be sent every I<interval> microseconds after the first.
ru: Если аргумент I<interval> не равен нулю, то сигналы B<SIGALRM> будут отправляться повторно каждые I<interval> микросекунд после первого.

source: This function returns the number of microseconds remaining for any alarm that was previously set, or 0 if no alarm was pending.
ru: Эта функция возвращает число микросекунд, оставшихся от любого ранее установленного сигнала, или 0, если сигналов не запланировано.

source: I<usecs> or I<interval> is not smaller than 1000000. (On systems where that is considered an error.)
ru: Значение I<usec> или I<interval> больше 1000000 (в тех системах, где это считается ошибкой).

source: 4.3BSD, POSIX.1-2001. POSIX.1-2001 marks B<ualarm>() as obsolete. POSIX.1-2008 removes the specification of B<ualarm>(). 4.3BSD, SUSv2, and POSIX do not define any errors.
ru: 4.3BSD, POSIX.1-2001. В POSIX.1-2001 функция B<ualarm>() помечена как устаревшая. В POSIX.1-2008 описание B<ualarm>() было удалено. В 4.3BSD, SUSv2 и POSIX нет описания ошибок.

source: POSIX.1-2001 does not specify what happens if the I<usecs> argument is 0. On Linux (and probably most other systems), the effect is to cancel any pending alarm.
ru: В POSIX.1-2001 не указано, что случится, если значение I<usecs> равно 0. В Linux (и, вероятно, в большинстве систем) произойдёт отмена любого взведённого будильника.

source: The type I<useconds_t> is an unsigned integer type capable of holding integers in the range [0,1000000]. On the original BSD implementation, and in glibc before version 2.1, the arguments to B<ualarm>() were instead typed as I<unsigned int>. Programs will be more portable if they never mention I<useconds_t> explicitly.
ru: Тип I<useconds_t> является беззнаковым целым типом, способным хранить целые числа в диапазоне [0,1000000]. В первоначальной реализации BSD и glibc до версии 2.1, аргументы B<ualarm>() имели тип I<unsigned int>. Программы будут более переносимы, если они никогда не будут явно упоминать тип I<useconds_t>.

source: The interaction of this function with other timer functions such as B<alarm>(2), B<sleep>(3), B<nanosleep>(2), B<setitimer>(2), B<timer_create>(2), B<timer_delete>(2), B<timer_getoverrun>(2), B<timer_gettime>(2), B<timer_settime>(2), B<usleep>(3) is unspecified.
ru: Взаимодействие этой функции с другими функциями таймера, такими как B<alarm>(2), B<sleep>(3), B<nanosleep>(2), B<setitimer>(2), B<timer_create>(2), B<timer_delete>(2), B<timer_getoverrun>(2), B<timer_gettime>(2), B<timer_settime>(2), B<usleep>(3) не определено.

source: This function is obsolete. Use B<setitimer>(2) or POSIX interval timers (B<timer_create>(2), etc.) instead.
ru: Эта функция устарела. Используйте вместо неё B<setitimer>(2) или интервальные таймеры POSIX (B<timer_create>(2) и т.д.).

source: updwtmp, logwtmp - append an entry to the wtmp file
ru: updwtmp, logwtmp - добавляет запись в файл wtmp

source: For B<logwtmp>(), link with I<-lutil>.
ru: Для B<logwtmp>(): компонуется при указании параметра I<-lutil>.

source: B<updwtmp>() appends the utmp structure I<ut> to the wtmp file.
ru: Функция B<updwtmp>() добавляет структуру utmp I<ut> в файл wtmp.

source: B<logwtmp>() constructs a utmp structure using I<line>, I<name>, I<host>, current time and current process ID. Then it calls B<updwtmp>() to append the structure to the wtmp file.
ru: Функция B<logwtmp>() создаёт структуру utmp из I<line>, I<name>, I<host>, текущего времени и текущего идентификатора процесса. После этого вызывается B<updwtmp>() для добавления структуры в файл wtmp.

source: database of past user logins
ru: база данных предыдущих пользовательских входов в систему

source: Not in POSIX.1. Present on Solaris, NetBSD, and perhaps other systems.
ru: Отсутствует в POSIX.1. Имеется в Solaris, NetBSD и, возможно, в других системах.

source: For consistency with the other "utmpx" functions (see B<getutxent>(3)), glibc provides (since version 2.1):
ru: Для схожести с другими функциями «utmpx» (смотрите B<getutxent>(3)), в glibc (начиная с версии 2.1) имеется:

source: This function performs the same task as B<updwtmp>(), but differs in that it takes a I<utmpx> structure as its last argument.
ru: Эта функция выполняет ту же задачу что и B<updwtmp>(); отличие в том, что типом последнего аргумента является структура I<utmpx>.

source: undocumented - undocumented library functions
ru: undocumented - недокументированные библиотечные функции

source: Undocumented library functions
ru: Недокументированные библиотечные функции

source: This man page mentions those library functions which are implemented in the standard libraries but not yet documented in man pages.
ru: В этой справочной странице перечислены библиотечные функции, реализованные в стандартных библиотеках, но для которых пока нет справочных страниц.

source: Solicitation
ru: Содействие

source: If you have information about these functions, please look in the source code, write a man page (using a style similar to that of the other Linux section 3 man pages), and send it to B<mtk.manpages@gmail.com> for inclusion in the next man page release.
ru: Если вы располагаете информацией об этих функциях, посмотрите исходный код, напишите справочную страницу (в том же стиле, что и остальные документы Linux в справочном разделе 3) и отправьте её на адрес B<mtk.manpages@gmail.com> для того, чтобы она вошла в следующий выпуск страниц.

source: The list
ru: Список
