Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: Ask the filesystem to abort pending requests before attempting the unmount. This may allow the unmount to complete without waiting for an inaccessible server, but could cause data loss. If, after aborting requests, some processes still have active references to the filesystem, the unmount will still fail. As at Linux 4.12, B<MNT_FORCE> is supported only on the following filesystems: 9p (since Linux 2.6.16), ceph (since Linux 2.6.34), cifs (since Linux 2.6.12), fuse (since Linux 2.6.16), lustre (since Linux 3.11), and NFS (since Linux 2.1.116).
ru: Попросить файловую систему прервать ожидающие запросы перед попыткой размонтирования. Это может позволить выполнить размонтирование без ожидания недоступного сервера, но может привести к потере данных. Если после прерывания запросов некоторые процессы продолжат обращаться к файловой системе, размонтирование не будет выполнено. В Linux 4.12 B<MNT_FORCE> поддерживается только в следующих файловых системах: 9p (начиная с Linux 2.6.16), ceph (начиная с Linux 2.6.34), cifs (начиная с Linux 2.6.12), fuse (начиная с Linux 2.6.16), lustre (начиная с Linux 3.11) и NFS (начиная с Linux 2.1.116).

source: B<MNT_DETACH> (since Linux 2.4.11)
ru: B<MNT_DETACH> (начиная с Linux 2.4.11)

source: Perform a lazy unmount: make the mount point unavailable for new accesses, immediately disconnect the filesystem and all filesystems mounted below it from each other and from the mount table, and actually perform the unmount when the mount point ceases to be busy.
ru: Выполнить отложенное размонтирование: сделать точку монтирования недоступной для новых подключений, немедленно размонтировать файловую систему и все файловые системы, смонтированные ниже по дереву и по таблице монтирования, и выполнить настоящее размонтирование только когда точка доступа станет свободной.

source: B<MNT_EXPIRE> (since Linux 2.6.8)
ru: B<MNT_EXPIRE> (начиная Linux 2.6.8)

source: Mark the mount point as expired. If a mount point is not currently in use, then an initial call to B<umount2>() with this flag fails with the error B<EAGAIN>, but marks the mount point as expired. The mount point remains expired as long as it isn't accessed by any process. A second B<umount2>() call specifying B<MNT_EXPIRE> unmounts an expired mount point. This flag cannot be specified with either B<MNT_FORCE> or B<MNT_DETACH>.
ru: Пометить точку монтирования как недействительную. Если точка монтирования в это время не используется, то первоначальный вызов B<umount2>() с этим флагом завершится с ошибкой B<EAGAIN>, но пометит точку монтирования как недействительную. Точка монтирования остаётся недействительной до тех пор, пока какой-нибудь процесс не запросит к ней доступ. Второй вызов B<umount2>() с флагом B<MNT_EXPIRE> размонтирует недействительную точку монтирования. Этот флаг нельзя указывать вместе с B<MNT_FORCE> или B<MNT_DETACH>.

source: B<UMOUNT_NOFOLLOW> (since Linux 2.6.34)
ru: B<UMOUNT_NOFOLLOW> (начиная с Linux 2.6.34)

source: Don't dereference I<target> if it is a symbolic link. This flag allows security problems to be avoided in set-user-ID-I<root> programs that allow unprivileged users to unmount filesystems.
ru: Не следовать по ссылке, если I<target> является символьной ссылкой. Это флаг помогает избежать проблем с безопасностью в программах принадлежащих root и с установленным битом set-user-ID, которые позволяют непривилегированным пользователям размонтировать файловые системы.

source: The error values given below result from filesystem type independent errors. Each filesystem type may have its own special errors and its own special behavior. See the Linux kernel source code for details.
ru: Коды ошибок, описанные ниже, не зависят от типа файловой системы. У каждой файловой системы могут быть свои коды ошибок и своё собственное поведение. Подробности смотрите в исходном коде ядра Linux.

source: A call to B<umount2>() specifying B<MNT_EXPIRE> successfully marked an unbusy filesystem as expired.
ru: Вызов B<umount2>() с флагом B<MNT_EXPIRE> успешно пометил незанятую файловую систему как недействительную.

source: I<target> could not be unmounted because it is busy.
ru: Объект I<target> не может быть размонтирован, так как он занят.

source: I<target> points outside the user address space.
ru: Объект I<target> указывает вне адресного пространства, доступного пользователю.

source: I<target> is not a mount point.
ru: Значение I<target> не является точкой монтирования.

source: B<umount2>() was called with B<MNT_EXPIRE> and either B<MNT_DETACH> or B<MNT_FORCE>.
ru: Вызов B<umount2>() был вызван с флагом B<MNT_EXPIRE> и с B<MNT_DETACH> или B<MNT_FORCE>.

source: B<EINVAL> (since Linux 2.6.34)
ru: B<EINVAL> (начиная с Linux 2.6.34)

source: B<umount2>() was called with an invalid flag value in I<flags>.
ru: Вызов B<umount2>() был сделан с неверным значением флага I<flags>.

source: A pathname was longer than B<MAXPATHLEN>.
ru: Значение пути длиннее чем B<MAXPATHLEN>.

source: A pathname was empty or had a nonexistent component.
ru: Указан пустой путь или одна из его частей не существует.

source: The kernel could not allocate a free page to copy filenames or data into.
ru: Ядро не может выделить свободную страницу для копирования имени файла или данных.

source: The caller does not have the required privileges.
ru: Вызывающий процесс не имеет требуемых привилегий.

source: B<MNT_DETACH> and B<MNT_EXPIRE> are available in glibc since version 2.11.
ru: Флаги B<MNT_DETACH> и B<MNT_EXPIRE> доступны в glibc начиная с версии 2.11.

source: These functions are Linux-specific and should not be used in programs intended to be portable.
ru: Эти функции есть только в Linux, и они не должны использоваться в переносимых программах.

source: umount() and shared mount points
ru: Вызов umount() и общие точки монтирования

source: Shared mount points cause any mount activity on a mount point, including B<umount>() operations, to be forwarded to every shared mount point in the peer group and every slave mount of that peer group. This means that B<umount>() of any peer in a set of shared mounts will cause all of its peers to be unmounted and all of their slaves to be unmounted as well.
ru: Действия на точку монтирования, являющуюся общей, включая операции B<umount>(), будут переданы каждой общей точке монтирования в этой группе и каждой подчинённой точке монтирования в этой группе. Это означает, что B<umount>() члена из набора общих точек монтирования приведёт к размонтированию всех в его членов, а также всех их подчинённых.

source: This propagation of unmount activity can be particularly surprising on systems where every mount point is shared by default. On such systems, recursively bind mounting the root directory of the filesystem onto a subdirectory and then later unmounting that subdirectory with B<MNT_DETACH> will cause every mount in the mount namespace to be lazily unmounted.
ru: Это распространение действия размонтирования может быть особенно удивительным в системах, где каждая точка монтирования является общей по умолчанию. В таких системах рекурсивно привязываемое монтирование корневого каталога файловой системы в подкаталог, а затем размонтирование этого подкаталога с B<MNT_DETACH> приведёт к тому, что каждая точка монтирования в пространстве имён монтирования будет размонтирована в отложенном режиме.

source: To ensure B<umount>() does not propagate in this fashion, the mount point may be remounted using a B<mount>() call with a I<mount_flags> argument that includes both B<MS_REC> and B<MS_PRIVATE> prior to B<umount>() being called.
ru: Чтобы B<umount>() также не делал, перед вызовом B<umount>() точка монтирования может быть перемонтирована с помощью вызова B<mount>() с аргументом I<mount_flags>, в который добавлены B<MS_REC> и B<MS_PRIVATE>.

source: Historical details
ru: Историческая справка

source: The original B<umount>() function was called as I<umount(device)> and would return B<ENOTBLK> when called with something other than a block device. In Linux 0.98p4, a call I<umount(dir)> was added, in order to support anonymous devices. In Linux 2.3.99-pre7, the call I<umount(device)> was removed, leaving only I<umount(dir)> (since now devices can be mounted in more than one place, so specifying the device does not suffice).
ru: Изначально функция B<umount>() вызывалась как I<umount(device)> и возвращала B<ENOTBLK> при попытке работы с любым не блочным устройством. В Linux 0.98p4 был добавлен вызов I<umount(dir)> для поддержки анонимных устройств. В Linux 2.3.99-pre7 был убран вызов I<umount(device)>, остался только I<umount(dir)> (теперь устройства могут быть подключены более чем к одной точке, поэтому указания только устройства недостаточно).

source: unlink, unlinkat - delete a name and possibly the file it refers to
ru: unlink, unlinkat - удаляет имя и, возможно, файл, на который оно ссылается

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>unistd.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> >/* определения констант of AT_* */ B<#include E<lt>unistd.hE<gt>>

source: B<unlink>() deletes a name from the filesystem. If that name was the last link to a file and no processes have the file open, the file is deleted and the space it was using is made available for reuse.
ru: B<unlink>() удаляет имя из файловой системы. Если это имя было последней ссылкой на файл и больше нет процессов, которые держат этот файл открытым, данный файл удаляется и место, которое он занимает, освобождается для дальнейшего использования.

source: If the name was the last link to a file but any processes still have the file open, the file will remain in existence until the last file descriptor referring to it is closed.
ru: Если имя было последней ссылкой на файл, но какие-либо процессы всё ещё держат этот файл открытым, файл будет оставлен, пока последний файловый дескриптор, указывающий на него, не будет закрыт.

source: If the name referred to a symbolic link, the link is removed.
ru: Если имя указывает на символьную ссылку, то будет удалена ссылка.

source: If the name referred to a socket, FIFO, or device, the name for it is removed but processes which have the object open may continue to use it.
ru: Если имя указывает на сокет, FIFO или устройство, то имя будет удалено, но процессы, которые открыли любой из этих объектов могут продолжать его использовать.

source: The B<unlinkat>() system call operates in exactly the same way as either B<unlink>() or B<rmdir>(2) (depending on whether or not I<flags> includes the B<AT_REMOVEDIR> flag) except for the differences described here.
ru: Системный вызов B<unlinkat>() работает также как B<unlink>() или B<rmdir>(2) (в зависимости от того, есть ли флаг B<AT_REMOVEDIR> во I<flags>), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<unlink>() and B<rmdir>(2) for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<unlink>() и B<rmdir>(2)).

source: If the pathname given in I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<unlink>() and B<rmdir>(2)).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<unlink>() и B<rmdir>(2)).

source: If the pathname given in I<pathname> is absolute, then I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то I<dirfd> игнорируется.

source: I<flags> is a bit mask that can either be specified as 0, or by ORing together flag values that control the operation of B<unlinkat>(). Currently, only one such flag is defined:
ru: Аргумент I<flags> представляет собой битовую маску, значение которой может быть 0, или объединённым значением флагов с помощью OR, определяющих операцию B<unlinkat>(). В настоящее время определён только один флаг:

source: By default, B<unlinkat>() performs the equivalent of B<unlink>() on I<pathname>. If the B<AT_REMOVEDIR> flag is specified, then performs the equivalent of B<rmdir>(2) on I<pathname>.
ru: По умолчанию, B<unlinkat>() выполняет действие, эквивалентное B<unlink>() с параметром I<pathname>. Если указан флаг B<AT_REMOVEDIR>, то выполняется действие, эквивалентное B<rmdir>(2) с параметром I<pathname>.

source: See B<openat>(2) for an explanation of the need for B<unlinkat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<unlinkat>().

source: Write access to the directory containing I<pathname> is not allowed for the process's effective UID, or one of the directories in I<pathname> did not allow search permission. (See also B<path_resolution>(7).)
ru: Для эффективного UID процесса нет прав на запись в каталог, содержащийся в I<pathname>, или в одном из каталогов в I<pathname> не разрешён поиск (смотрите также B<path_resolution>(7)).

source: The file I<pathname> cannot be unlinked because it is being used by the system or another process; for example, it is a mount point or the NFS client software created it to represent an active but otherwise nameless inode ("NFS silly renamed").
ru: Файл I<pathname> не может быть удалён, так как он ещё используется системой или другим процессом; например, это точка монтирования или его создал клиент NFS для представления активной, но пока безымянной inode («NFS silly renamed»).

source: I<pathname> points outside your accessible address space.
ru: Аргумент I<pathname> указывает за пределы доступного адресного пространства.

source: An I/O error occurred.
ru: Произошла ошибка ввода-вывода.

source: I<pathname> refers to a directory. (This is the non-POSIX value returned by Linux since 2.1.132.)
ru: I<pathname> ссылается на каталог. (Этого значения нет в POSIX, возвращается в Linux начиная с 2.1.132.)

source: Too many symbolic links were encountered in translating I<pathname>.
ru: Во время определения I<pathname> встретилось слишком много символьных ссылок.

source: I<pathname> was too long.
ru: I<pathname> слишком длинен.

source: A component in I<pathname> does not exist or is a dangling symbolic link, or I<pathname> is empty.
ru: Компонент I<pathname> не существует, является повисшей ссылкой или I<pathname> пуст.

source: A component used as a directory in I<pathname> is not, in fact, a directory.
ru: Компонент пути, использованный как каталог в I<pathname>, в действительности таковым не является.

source: The system does not allow unlinking of directories, or unlinking of directories requires privileges that the calling process doesn't have. (This is the POSIX prescribed error return; as noted above, Linux returns B<EISDIR> for this case.)
ru: Система не разрешает удаление каталогов или для удаления каталогов требуются права, которыми не обладает вызвавший процесс. (Этот код ошибки предусмотрен в POSIX; как описано выше, в Linux в этом случае возвращается B<EISDIR>.)

source: B<EPERM> (Linux only)
ru: B<EPERM> (только в Linux)

source: The filesystem does not allow unlinking of files.
ru: Файловая система не позволяет удаление файлов.

source: B<EPERM> or B<EACCES>
ru: B<EPERM> или B<EACCES>

source: The directory containing I<pathname> has the sticky bit (B<S_ISVTX>) set and the process's effective UID is neither the UID of the file to be deleted nor that of the directory containing it, and the process is not privileged (Linux: does not have the B<CAP_FOWNER> capability).
ru: На каталоге, содержащемся в I<pathname>, установлен закрепляющий бит (B<S_ISVTX>) и эффективный UID процесса не совпадает ни с UID удаляемого файла, ни с каталогом, в котором он содержится, и у процесса нет прав (Linux: нет мандата B<CAP_FOWNER>).

source: The file to be unlinked is marked immutable or append-only. (See B<ioctl_iflags>(2).)
ru: Файл для удаления помечен как неизменяемый (immutable) или только для добавления (смотрите B<ioctl_iflags>(2)).

source: I<pathname> refers to a file on a read-only filesystem.
ru: I<pathname> указывает на файл в файловой системе, доступной только для чтения.

source: The same errors that occur for B<unlink>() and B<rmdir>(2) can also occur for B<unlinkat>(). The following additional errors can occur for B<unlinkat>():
ru: В B<unlinkat>() могут возникнуть те же ошибки, что и в B<unlink>() и B<rmdir>(2). Также, в B<unlinkat>() могут возникнуть следующие ошибки:

source: I<dirfd> is not a valid file descriptor.
ru: I<dirfd> не является правильным файловым дескриптором.

source: An invalid flag value was specified in I<flags>.
ru: В I<flags> указано неверное значение флага.

source: I<pathname> refers to a directory, and B<AT_REMOVEDIR> was not specified in I<flags>.
ru: Значение I<pathname> ссылается на каталог и в I<flags> не указан B<AT_REMOVEDIR>.

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
ru: Значение I<pathname> содержит относительный путь и I<dirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог.

source: B<unlinkat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Системный вызов B<unlinkat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: Glibc notes
ru: Замечания по glibc

source: On older kernels where B<unlinkat>() is unavailable, the glibc wrapper function falls back to the use of B<unlink>() or B<rmdir>(2). When I<pathname> is a relative pathname, glibc constructs a pathname based on the symbolic link in I</proc/self/fd> that corresponds to the I<dirfd> argument.
ru: В старых ядрах, где B<unlinkat>() отсутствует, обёрточная функция glibc использует B<unlink>(2) или B<rmdir>(2). Если I<pathname> является относительным путём, то glibc собирает путь относительно символической ссылки в I</proc/self/fd>, которая соответствует аргументу I<dirfd>.

source: Infelicities in the protocol underlying NFS can cause the unexpected disappearance of files which are still being used.
ru: Неточности в протоколе NFS могут приводить к неожиданному исчезновению файлов, которые всё ещё используются.

source: utmp, wtmp - login records
ru: utmp, wtmp - записи о входах в систему

source: The I<utmp> file allows one to discover information about who is currently using the system. There may be more users currently using the system, because not all programs use utmp logging.
ru: Файл I<utmp> позволяет получать информацию о том, кто в данный момент работает в системе. Пользователей, в данное время использующих систему, может быть большое количество, поскольку не все программы используют протоколирование через utmp.

source: B<Warning:> I<utmp> must not be writable by the user class "other", because many system programs (foolishly) depend on its integrity. You risk faked system logfiles and modifications of system files if you leave I<utmp> writable to any user other than the owner and group owner of the file.
ru: B<Предупреждение:> I<utmp> не должен быть доступен на запись классу пользователей "остальные", так как многие системные программы (что очень глупо) зависят от его целостности. Вы рискуете получить фиктивные системные файлы статистики и изменения в системных файлах, если предоставите любому пользователю возможность писать в файл I<utmp> кроме владельца и группы, которой принадлежит файл.

source: The file is a sequence of I<utmp> structures, declared as follows in I<E<lt>utmp.hE<gt>> (note that this is only one of several definitions around; details depend on the version of libc):
ru: Файл состоит из списка записей с типом структуры I<utmp>, объявленной в I<E<lt>utmp.hE<gt>> (заметим, что в данном случае указано только один из вариантов; детали зависят от версии libc):

source: /* Values for ut_type field, below */
ru: /* Значения поля ut_type приведены далее */

source: #define EMPTY 0 /* Record does not contain valid info (formerly known as UT_UNKNOWN on Linux) */ #define RUN_LVL 1 /* Change in system run-level (see B<init>(8)) */ #define BOOT_TIME 2 /* Time of system boot (in I<ut_tv>) */ #define NEW_TIME 3 /* Time after system clock change (in I<ut_tv>) */ #define OLD_TIME 4 /* Time before system clock change (in I<ut_tv>) */ #define INIT_PROCESS 5 /* Process spawned by B<init>(8) */ #define LOGIN_PROCESS 6 /* Session leader process for user login */ #define USER_PROCESS 7 /* Normal process */ #define DEAD_PROCESS 8 /* Terminated process */ #define ACCOUNTING 9 /* Not implemented */
ru: #define EMPTY 0 /* запись не содержит корректной информации (также называемая UT_UNKNOWN в Linux) */ #define RUN_LVL 1 /* изменение уровня выполнения (см. B<init>(8)) */ #define BOOT_TIME 2 /* время загрузки системы (в I<ut_tv>) */ #define NEW_TIME 3 /* время после изменения часов системы (в I<ut_tv>) */ #define OLD_TIME 4 /* время до изменения часов в системе (в I<ut_tv>) */ #define INIT_PROCESS 5 /* процесс запущен B<init>(8) */ #define LOGIN_PROCESS 6 /* процесс-лидер сеанса для пользовательского входа */ #define USER_PROCESS 7 /* нормальный процесс */ #define DEAD_PROCESS 8 /* завершённый процесс */ #define ACCOUNTING 9 /* не реализовано */

source: struct exit_status { /* Type for ut_exit, below */ short int e_termination; /* Process termination status */ short int e_exit; /* Process exit status */ };
ru: struct exit_status { /* тип для ut_exit, описан далее */ short int e_termination; /* код завершения процесса */ short int e_exit; /* код выхода процесса */ };

source: struct utmp { short ut_type; /* Type of record */ pid_t ut_pid; /* PID of login process */ char ut_line[UT_LINESIZE]; /* Device name of tty - "/dev/" */ char ut_id[4]; /* Terminal name suffix, or inittab(5) ID */ char ut_user[UT_NAMESIZE]; /* Username */ char ut_host[UT_HOSTSIZE]; /* Hostname for remote login, or kernel version for run-level messages */ struct exit_status ut_exit; /* Exit status of a process marked as DEAD_PROCESS; not used by Linux init (1 */ /* The ut_session and ut_tv fields must be the same size when compiled 32- and 64-bit. This allows data files and shared memory to be shared between 32- and 64-bit applications. */ #if __WORDSIZE == 64 && defined __WORDSIZE_COMPAT32 int32_t ut_session; /* Session ID (B<getsid>(2)), used for windowing */ struct { int32_t tv_sec; /* Seconds */ int32_t tv_usec; /* Microseconds */ } ut_tv; /* Time entry was made */ #else long ut_session; /* Session ID */ struct timeval ut_tv; /* Time entry was made */ #endif
ru: struct utmp { short ut_type; /* тип записи */ pid_t ut_pid; /* PID процесса входа в систему */ char ut_line[UT_LINESIZE]; /* имя устройства tty - "/dev/" */ char ut_id[4]; /* суффикс имени терминала или inittab(5) ID */ char ut_user[UT_NAMESIZE]; /* имя пользователя */ char ut_host[UT_HOSTSIZE]; /* имя узла при удалённом входе или версия ядра для сообщений уровня выполнения */ struct exit_status ut_exit; /* код выхода процесса, помеченного как DEAD_PROCESS; не используется Linux init(1) */ /* Поля ut_session и ut_tv должны быть одинакового размера и при 32- и при 64-битной компиляции. Это позволяет использовать файлы данных и память одновременно и в 32- и в 64-битных приложениях. */ #if __WORDSIZE == 64 && defined __WORDSIZE_COMPAT32 int32_t ut_session; /* ID сеанса (B<getsid>(2)), используемый при работе с окнами */ struct { int32_t tv_sec; /* секунды */ int32_t tv_usec; /* микросекунды */ } ut_tv; /* время создания элемента */ #else long ut_session; /* ID сеанса */ struct timeval ut_tv; /* время создания элемента */ #endif
