Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: With regard to IPv6 jumbograms (RFC\ 2675), the UDP-Litev6 checksum coverage is limited to the first 2^16-1 octets, as per RFC\ 3828, 3.5. Higher values are therefore silently truncated to 2^16-1. If in doubt, the current coverage value can always be queried using B<getsockopt>(2).
ru: При использовании джумбограмм (jumbograms) IPv6 (RFC\ 2675), охват контрольной суммы в UDP-Litev6 ограничен первыми 2^16-1 октетами (согласно RFC\ 3828, 3.5). Большие значения безошибочно урезаются до 2^16-1. Текущее значение охвата всегда можно запросить с помощью B<getsockopt>(2).

source: This is the receiver-side analogue and uses the same argument format and value range as B<UDPLITE_SEND_CSCOV>. This option is not required to enable traffic with partial checksum coverage. Its function is that of a traffic filter: when enabled, it instructs the kernel to drop all packets which have a coverage I<less> than the specified coverage value.
ru: Это аналог с приёмной стороны, использует тот же формат аргумента и диапазон значений, что и у B<UDPLITE_SEND_CSCOV>. Данный параметр не требуется для приёма трафика с контрольной суммой частичного охвата. Он предназначен для фильтрации трафика: если включён, то это указывает ядру отбрасывать все пакеты, у которых охват I<менее> заданного значения.

source: When the value of B<UDPLITE_RECV_CSCOV> exceeds the actual packet coverage, incoming packets are silently dropped, but may generate a warning message in the system log.
ru: Если значение B<UDPLITE_RECV_CSCOV> превышает реальный охват пакета, то поступающие пакеты просто отбрасываются, но при этом может генерироваться предупреждающее сообщение в системный журнал.

source: All errors documented for B<udp>(7) may be returned. UDP-Lite does not add further errors.
ru: Могут быть возвращены любые ошибки, описанные для B<udp>(7). UDP-Lite не вносит никаких дополнительных типов ошибок.

source: FILES
ru: ФАЙЛЫ

source: Basic UDP-Litev4 statistics counters.
ru: Основные счётчики статистики UDP-Litev4.

source: Basic UDP-Litev6 statistics counters.
ru: Основные счётчики статистики UDP-Litev6.

source: UDP-Litev4/v6 first appeared in Linux 2.6.20.
ru: UDP-Litev4/v6 впервые появился в Linux 2.6.20.

source: Where glibc support is missing, the following definitions are needed:
ru: Если поддержка в glibc отсутствует, то требуются следующие определения:

source: RFC\ 3828 for the Lightweight User Datagram Protocol (UDP-Lite).
ru: В RFC\ 3828 описан облегчённый протокол пользовательских датаграмм (Lightweight User Datagram Protocol — UDP-Lite).

source: I<Documentation/networking/udplite.txt> in the Linux kernel source tree
ru: Файл I<Documentation/networking/udplite.txt> в дереве исходного кода ядра Linux

source: user_namespaces - overview of Linux user namespaces
ru: user_namespaces - обзор пользовательских пространств имён Linux

source: For an overview of namespaces, see B<namespaces>(7).
ru: Обзор пространств имён смотрите в B<namespaces>(7).

source: User namespaces isolate security-related identifiers and attributes, in particular, user IDs and group IDs (see B<credentials>(7)), the root directory, keys (see B<keyrings>(7)), and capabilities (see B<capabilities>(7)). A process's user and group IDs can be different inside and outside a user namespace. In particular, a process can have a normal unprivileged user ID outside a user namespace while at the same time having a user ID of 0 inside the namespace; in other words, the process has full privileges for operations inside the user namespace, but is unprivileged for operations outside the namespace.
ru: Пользовательские пространства имён изолируют идентификаторы и атрибуты безопасности, в частности ID пользователя и ID группы (смотрите B<credentials>(7)), корневой каталог, ключи (смотрите B<keyrings>(7)) и мандаты (смотрите B<capabilities>(7)). Идентификаторы пользователя и группы процесса могут отличаться внутри и снаружи пользовательского пространства имён. В частности, процесс может иметь обычный бесправный пользовательский ID снаружи и ID равный 0 внутри пространства имён; другими словами, процесс имеет доступ ко всем операциям внутри пользовательского пространства имён, но не имеет доступа к привилегированным операциям вне пространства имён.

source: Nested namespaces, namespace membership
ru: Вложенные пространства имён, членство пространств имён

source: User namespaces can be nested; that is, each user namespace\(emexcept the initial ("root") namespace\(emhas a parent user namespace, and can have zero or more child user namespaces. The parent user namespace is the user namespace of the process that creates the user namespace via a call to B<unshare>(2) or B<clone>(2) with the B<CLONE_NEWUSER> flag.
ru: Пользовательские пространства имён могут быть вложенными, то есть каждое пользовательское пространство имён — за исключением первого («корневого») — имеет родительское пространство имён и может иметь ноль или более дочерних пространств имён. Родительское пространство имён — это пользовательское пространство имён процесса, которое создаётся с помощью вызова B<unshare>(2) или B<clone>(2) с флагом B<CLONE_NEWUSER>.

source: The kernel imposes (since version 3.11) a limit of 32 nested levels of user namespaces. Calls to B<unshare>(2) or B<clone>(2) that would cause this limit to be exceeded fail with the error B<EUSERS>.
ru: Ядро ограничивает (начиная с версии 3.11) глубину вложенности пользовательских пространств имён 32 уровнями. Вызовы B<unshare>(2) или B<clone>(2), которые бы превысили это ограничение, завершаются с ошибкой B<EUSERS>.

source: Each process is a member of exactly one user namespace. A process created via B<fork>(2) or B<clone>(2) without the B<CLONE_NEWUSER> flag is a member of the same user namespace as its parent. A single-threaded process can join another user namespace with B<setns>(2) if it has the B<CAP_SYS_ADMIN> in that namespace; upon doing so, it gains a full set of capabilities in that namespace.
ru: Каждый процесс является членом только одного пользовательского пространства имён. Процесс, созданный с помощью B<fork>(2) или B<clone>(2) без флага B<CLONE_NEWUSER>, является членом того же пользовательского пространства имён что и его родитель. Однонитевой процесс может перейти в другое пользовательское пространство имён с помощью B<setns>(2), если в этом пространстве у него есть мандат B<CAP_SYS_ADMIN>; после перехода он получает полный набор мандатов в этом пространстве имён.

source: A call to B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWUSER> flag makes the new child process (for B<clone>(2)) or the caller (for B<unshare>(2)) a member of the new user namespace created by the call.
ru: Вызов B<clone>(2) или B<unshare>(2) с флагом B<CLONE_NEWUSER> делает новый дочерний (для B<clone>(2)) или вызвавший (для B<unshare>(2)) процесс членом нового пользовательского пространства имён, создаваемого вызовом.

source: The B<NS_GET_PARENT> B<ioctl>(2) operation can be used to discover the parental relationship between user namespaces; see B<ioctl_ns>(2).
ru: Операцию B<NS_GET_PARENT> B<ioctl>(2) можно использовать для обнаружения родительской связи между пространствами имён пользователя; смотрите B<ioctl_ns>(2).

source: Capabilities
ru: Мандаты

source: The child process created by B<clone>(2) with the B<CLONE_NEWUSER> flag starts out with a complete set of capabilities in the new user namespace. Likewise, a process that creates a new user namespace using B<unshare>(2) or joins an existing user namespace using B<setns>(2) gains a full set of capabilities in that namespace. On the other hand, that process has no capabilities in the parent (in the case of B<clone>(2)) or previous (in the case of B<unshare>(2) and B<setns>(2)) user namespace, even if the new namespace is created or joined by the root user (i.e., a process with user ID 0 in the root namespace).
ru: Дочерний процесс, созданный B<clone>(2) с флагом B<CLONE_NEWUSER>, запускается в новом пользовательском пространстве имён с полным набором мандатов. Аналогично, процесс, создающий новое пользовательское пространство имён с помощью B<unshare>(2) или переходящий в существующее пользовательское пространство имён с помощью B<setns>(2), получает полный набор мандатов в этом пространстве имён. С другой стороны, этот процесс не имеет мандатов в родительском (в случае B<clone>(2)) или предыдущем (в случае B<unshare>(2) и B<setns>(2)) пользовательском пространстве имён, даже если новое пространство имён создано или переход осуществлялся суперпользователем (т. е., процесс с ID пользователя 0 в корневом пространстве имён).

source: Note that a call to B<execve>(2) will cause a process's capabilities to be recalculated in the usual way (see B<capabilities>(7)). Consequently, unless the process has a user ID of 0 within the namespace, or the executable file has a nonempty inheritable capabilities mask, the process will lose all capabilities. See the discussion of user and group ID mappings, below.
ru: Заметим, что вызов B<execve>(2) приводит к пересчёту мандатов процесса обычным порядком (смотрите B<capabilities>(7)). Следовательно, если ID пользователя процесс не равно 0 внутри пространства имён или исполняемый файл имеет непустую маску наследования мандатов, то процесс теряет все мандаты. Смотрите описание отображения пользовательских и групповых ID далее.

source: A call to B<clone>(2), B<unshare>(2), or B<setns>(2) using the B<CLONE_NEWUSER> flag sets the "securebits" flags (see B<capabilities>(7)) to their default values (all flags disabled) in the child (for B<clone>(2)) or caller (for B<unshare>(2), or B<setns>(2)). Note that because the caller no longer has capabilities in its original user namespace after a call to B<setns>(2), it is not possible for a process to reset its "securebits" flags while retaining its user namespace membership by using a pair of B<setns>(2) calls to move to another user namespace and then return to its original user namespace.
ru: Вызов B<clone>(2), B<unshare>(2) или B<setns>(2) с флагом B<CLONE_NEWUSER> устанавливает флаги «securebits» (смотрите B<capabilities>(7)) в их значения по умолчанию (все флаги сброшены) в потомке (для B<clone>(2)) или вызывающем (для B<unshare>(2) или B<setns>(2)). Заметим, что из-то того, что вызывающий больше не имеет мандатов в своём первоначальном пользовательском пространстве имён после вызова B<setns>(2), невозможно у процесса сбросить его флаги «securebits», хотя удержать своё членство в пользовательском пространстве имён можно с помощью пары вызовов B<setns>(2) — сначала переместиться в другое пользовательское пространство имён и затем вернуться в своё первоначальное пользовательское пространство имён.

source: The rules for determining whether or not a process has a capability in a particular user namespace are as follows:
ru: Правила определения наличия мандата у процесса в определённом пользовательском пространстве имён следующие:

source: A process has a capability inside a user namespace if it is a member of that namespace and it has the capability in its effective capability set. A process can gain capabilities in its effective capability set in various ways. For example, it may execute a set-user-ID program or an executable with associated file capabilities. In addition, a process may gain capabilities via the effect of B<clone>(2), B<unshare>(2), or B<setns>(2), as already described.
ru: Процесс имеет мандат внутри пользовательского пространства имён, если он является членом этого пространства имён и имеет мандат в своём наборе эффективных мандатов. Процесс может получить мандаты в своём наборе эффективных мандатов различными способами. Например, он может запустить программу с битом set-user-ID или исполняемый файл, имеющий мандаты файла. Также процесс может получить мандаты при выполнении B<clone>(2), B<unshare>(2) или B<setns>(2), как описывалось ранее.

source: If a process has a capability in a user namespace, then it has that capability in all child (and further removed descendant) namespaces as well.
ru: Если процесс имеет мандат в пользовательском пространстве имён, то он также имеет этот мандат во всех дочерних (и позже удалённых потомках) пространствах имён.

source: When a user namespace is created, the kernel records the effective user ID of the creating process as being the "owner" of the namespace. A process that resides in the parent of the user namespace and whose effective user ID matches the owner of the namespace has all capabilities in the namespace. By virtue of the previous rule, this means that the process has all capabilities in all further removed descendant user namespaces as well. The B<NS_GET_OWNER_UID> B<ioctl>(2) operation can be used to discover the user ID of the owner of the namespace; see B<ioctl_ns>(2).
ru: При создании пользовательского пространства имён ядро записывает эффективный пользовательский ID создающего процесса как «владельца» пространства имён. Процесс, располагающийся в родительском пространстве имён пользовательского пространства имён и чей эффективный пользовательский ID совпадает с владельцем пространства имён, имеет все мандаты в пространстве имён. Предыдущее правило означает, что у процесса также есть все мандаты во всех в последствии удалённых потомках пользовательских пространств имён. Для обнаружения идентификатора пользователя-владельца пространства имён можно использовать операцию B<NS_GET_OWNER_UID> вызова B<ioctl>(2); смотрите B<ioctl_ns>(2).

source: Effect of capabilities within a user namespace
ru: Влияние мандатов внутри пространства имён пользователя

source: Having a capability inside a user namespace permits a process to perform operations (that require privilege) only on resources governed by that namespace. In other words, having a capability in a user namespace permits a process to perform privileged operations on resources that are governed by (nonuser) namespaces owned by (associated with) the user namespace (see the next subsection).
ru: Наличие мандата внутри пространства имён пользователя разрешает процессу выполнять операции (требующие привилегий) с ресурсами, управляемыми только этим пространством имён. Иначе говоря, наличие мандата в пользовательском пространстве имён разрешает процессу выполнять привилегированные операции с ресурсами, которые управляются (не пользовательскими) пространствами имён, принадлежащими (связанными с) пространству имён пользователя (смотрите следующий подраздел).

source: On the other hand, there are many privileged operations that affect resources that are not associated with any namespace type, for example, changing the system time (governed by B<CAP_SYS_TIME>), loading a kernel module (governed by B<CAP_SYS_MODULE>), and creating a device (governed by B<CAP_MKNOD>). Only a process with privileges in the I<initial> user namespace can perform such operations.
ru: С другой стороны, существует много привилегированных операций, которые влияют на ресурсы не связанные с каким-либо типом пространства имён, например, изменение системного времени (регулируется B<CAP_SYS_TIME>), загрузка модуля ядра (регулируется B<CAP_SYS_MODULE>) и создание устройства (регулируется B<CAP_MKNOD>). Такие операции может выполнять только процесс с привилегиями в I<начальном> пользовательском пространстве имён.

source: Holding B<CAP_SYS_ADMIN> within the user namespace that owns a process's mount namespace allows that process to create bind mounts and mount the following types of filesystems:
ru: Наличие B<CAP_SYS_ADMIN> внутри пользовательского пространства имён, принадлежащему пространству имён монтирования процесса, позволяет этому процессу создавать привязки монтирования и монтировать следующие типы файловых систем:

source: I</proc> (since Linux 3.8)
ru: I</proc> (начиная с Linux 3.8)

source: I</sys> (since Linux 3.8)
ru: I</sys> (начиная с Linux 3.8)

source: I<devpts> (since Linux 3.9)
ru: I<devpts> (начиная с Linux 3.9)

source: B<tmpfs>(5) (since Linux 3.9)
ru: B<tmpfs>(5) (начиная с Linux 3.9)

source: I<ramfs> (since Linux 3.9)
ru: I<ramfs> (начиная с Linux 3.9)

source: I<mqueue> (since Linux 3.9)
ru: I<mqueue> (начиная с Linux 3.9)

source: I<bpf> (since Linux 4.4)
ru: I<bpf> (начиная с Linux 4.4)

source: Holding B<CAP_SYS_ADMIN> within the user namespace that owns a process's cgroup namespace allows (since Linux 4.6) that process to the mount the cgroup version 2 filesystem and cgroup version 1 named hierarchies (i.e., cgroup filesystems mounted with the I<"none,name="> option).
ru: Наличие B<CAP_SYS_ADMIN> внутри пользовательского пространства имён, принадлежащему пространству имён cgroup процесса, позволяет (начиная с Linux 4.6) этому процессу монтировать именованные иерархии файловой системы cgroup версии 2 и cgroup версии 1 (т. е., файловые системы cgroup, монтируемые с параметром I<"none,name=">).

source: Holding B<CAP_SYS_ADMIN> within the user namespace that owns a process's PID namespace allows (since Linux 3.8) that process to mount I</proc> filesystems.
ru: Наличие B<CAP_SYS_ADMIN> внутри пользовательского пространства имён, принадлежащему пространству имён PID процесса, позволяет (начиная с Linux 3.8) этому процессу монтировать файловые системы I</proc>.

source: Note however, that mounting block-based filesystems can be done only by a process that holds B<CAP_SYS_ADMIN> in the initial user namespace.
ru: Однако заметим, что монтирование блочных файловых систем может производиться только процессом, имеющим B<CAP_SYS_ADMIN> в начальном пространстве имён пользователя.

source: Interaction of user namespaces and other types of namespaces
ru: Взаимодействие между пользовательскими и другими типами пространств имён

source: Starting in Linux 3.8, unprivileged processes can create user namespaces, and the other types of namespaces can be created with just the B<CAP_SYS_ADMIN> capability in the caller's user namespace.
ru: Начиная с Linux 3.8, непривилегированные процессы могут создавать пользовательские пространства имён, а для создания пространств имён других типов требуется мандат B<CAP_SYS_ADMIN> в пользовательском пространстве имён вызывающего.

source: When a nonuser namespace is created, it is owned by the user namespace in which the creating process was a member at the time of the creation of the namespace. Privileged operations on resources governed by the nonuser namespace require that the process has the necessary capabilities in the user namespace that owns the nonuser namespace.
ru: После создания не пользовательского пространства имён оно принадлежит пользовательскому пространству имён, в котором на момент создания пространства имён создающий процесс являлся членом. Для привилегированных операций над ресурсами, управляемыми не пользовательским пространством имён, от процесса требуется иметь мандаты в пользовательском пространстве имён, которому принадлежит не пользовательское пространство имён.

source: If B<CLONE_NEWUSER> is specified along with other B<CLONE_NEW*> flags in a single B<clone>(2) or B<unshare>(2) call, the user namespace is guaranteed to be created first, giving the child (B<clone>(2)) or caller (B<unshare>(2)) privileges over the remaining namespaces created by the call. Thus, it is possible for an unprivileged caller to specify this combination of flags.
ru: Если вместе с флагами B<CLONE_NEW*> указан флаг B<CLONE_NEWUSER> в вызове B<clone>(2) или B<unshare>(2), то пользовательское пространство имён гарантированно создаётся первым, давая потомку (B<clone>(2)) или вызывающему (B<unshare>(2)) права на остальные пространства имён, создаваемые вызовом. Даже бесправный вызывающий может задать такую комбинацию флагов.

source: When a new namespace (other than a user namespace) is created via B<clone>(2) or B<unshare>(2), the kernel records the user namespace of the creating process as the owner of the new namespace. (This association can't be changed.) When a process in the new namespace subsequently performs privileged operations that operate on global resources isolated by the namespace, the permission checks are performed according to the process's capabilities in the user namespace that the kernel associated with the new namespace. For example, suppose that a process attempts to change the hostname (B<sethostname>(2)), a resource governed by the UTS namespace. In this case, the kernel will determine which user namespace owns the process's UTS namespace, and check whether the process has the required capability (B<CAP_SYS_ADMIN>) in that user namespace.
ru: При создании нового пространства имён (не пользовательского пространства имён) посредством B<clone>(2) или B<unshare>(2), ядро записывает пользовательское пространство имён создающего процесса как владельца нового пространства имён (эту связь нельзя изменить). Когда процесс в новом пространстве имён в дальнейшем выполняет привилегированные операции, которые работают с глобальными ресурсами, изолированными пространством имён, выполняется проверка прав согласно мандатам процесса в пользовательском пространстве имён, которое ядро связало с новым пространством имён. Например, предположим, что процесс пытается изменить имя узла (B<sethostname>(2)) — ресурс, управляемый пространство имён UTS. В этом случае, ядро будет искать пространство имён пользователя, принадлежащее пространству имён UTS процесса, и проверять что процесс имеет необходимый мандат (B<CAP_SYS_ADMIN>) в этом пространстве имён пользователя.

source: The B<NS_GET_USERNS> B<ioctl>(2) operation can be used to discover the user namespace that owns a nonuser namespace; see B<ioctl_ns>(2).
ru: Операцию B<NS_GET_USERNS> B<ioctl>(2) можно использовать для обнаружения пространства имён пользователя, которое владеет не пользовательским пространством имён; смотрите B<ioctl_ns>(2).

source: User and group ID mappings: uid_map and gid_map
ru: Отображение идентификаторов пользователей и групп: uid_map и gid_map

source: When a user namespace is created, it starts out without a mapping of user IDs (group IDs) to the parent user namespace. The I</proc/[pid]/uid_map> and I</proc/[pid]/gid_map> files (available since Linux 3.5) expose the mappings for user and group IDs inside the user namespace for the process I<pid>. These files can be read to view the mappings in a user namespace and written to (once) to define the mappings.
ru: В новом созданном пользовательском пространстве имён отсутствует отображение пользовательских ID (ID групп) в родительское пользовательское пространство. Файл I</proc/[pid]/uid_map> и I</proc/[pid]/gid_map> (доступны начиная с Linux 3.5) предоставляют отображения пользовательских и групповых ID внутри пользовательского пространства имён для процесса I<pid>. Эти файлы можно читать для просмотра отображений в пользовательском пространстве имён и писать (однократно) для определения отображений.

source: The description in the following paragraphs explains the details for I<uid_map>; I<gid_map> is exactly the same, but each instance of "user ID" is replaced by "group ID".
ru: В следующих параграфах объясняется формат I<uid_map>; I<gid_map> имеет тот же формат, но каждый экземпляр «ID пользователя» заменяется на «ID группы».
