Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: The following code demonstrates the use of sequenced-packet sockets for local interprocess communication. It consists of two programs. The server program waits for a connection from the client program. The client sends each of its command-line arguments in separate messages. The server treats the incoming messages as integers and adds them up. The client sends the command string "END". The server sends back a message containing the sum of the client's integers. The client prints the sum and exits. The server waits for the next client to connect. To stop the server, the client is called with the command-line argument "DOWN".
ru: В следующем коде демонстрируется использование пакето-упорядочивающих сокетов для локального межпроцессного обмена. Он состоит из двух программ. Программа-сервер ждёт подключения программы-клиента. Клиент посылает свой каждый аргумент командной строки в виде отдельного сообщения. Сервер считает входящие сообщения как целые числа и складывает их. Клиент посылает строку-команду «END». Сервер посылает ответное сообщение, содержащее сумму чисел клиента. Клиент печатает сумму и завершает работу. Сервер ждёт подключение следующего клиента. Для остановки сервера, клиент вызывается с аргументом командной строки «DOWN».

source: The following output was recorded while running the server in the background and repeatedly executing the client. Execution of the server program ends when it receives the "DOWN" command.
ru: Следующий вывод был записан при работе сервера в фоновом режиме и повторяющемся запуске клиента. Выполнение программы-сервера завершилось после получения им команды «DOWN».

source: Example output
ru: Пример вывода

source: $ B<./server &> [1] 25887 $ B<./client 3 4> Result = 7 $ B<./client 11 -5> Result = 6 $ B<./client DOWN> Result = 0 [1]+ Done ./server $
ru: $ B<./server &> [1] 25887 $ B<./client 3 4> Результат = 7 $ B<./client 11 -5> Результат = 6 $ B<./client DOWN> Результат = 0 [1]+ Done ./server $

source: Program source
ru: Исходный код программы

source: /* * File connection.h */
ru: /* * Файл connection.h */

source: /* * File server.c */
ru: /* * Файл server.c */

source: /* * In case the program exited inadvertently on the last run, * remove the socket. */
ru: /* * Удалить сокет, оставшийся после последнего * некорректного завершения программы. */

source: /* Create local socket. */
ru: /* Создание локального сокета. */

source: /* * For portability clear the whole structure, since some * implementations have additional (nonstandard) fields in * the structure. */
ru: /* * Для переносимости очищаем всю структуру, так как в некоторых * реализациях имеются дополнительные (нестандартные) поля. */

source: /* Bind socket to socket name. */
ru: /* Привязываем сокет к имени сокета. */

source: /* * Prepare for accepting connections. The backlog size is set * to 20. So while one request is being processed other requests * can be waiting. */
ru: /* * Готовимся принимать подключения. Размер очереди (backlog) * устанавливаем равным 20. Пока один запрос обрабатывается, другие * запросы смогут подождать. */

source: /* This is the main loop for handling connections. */
ru: /* Основной цикл обработки подключений. */

source: /* Wait for incoming connection. */
ru: /* Ожидание входящих подключений. */

source: /* Wait for next data packet. */
ru: /* Ожидание следующего пакета с данными. */

source: /* Ensure buffer is 0-terminated. */
ru: /* Проверяем, что буфер завершается 0. */

source: /* Handle commands. */
ru: /* Обработка команд. */

source: /* Add received summand. */
ru: /* Добавляем полученную команду. */

source: /* Send result. */
ru: /* Отправка результата. */

source: /* Close socket. */
ru: /* Закрытие сокета. */

source: /* Quit on DOWN command. */
ru: /* Завершаем работу по команде DOWN. */

source: /* Unlink the socket. */
ru: /* Удаляем сокет. */

source: /* * File client.c */
ru: /* * Файл client.c */

source: /* Connect socket to socket address */
ru: /* соединяем сокет с адресом сокета */

source: /* Send arguments. */
ru: /* Посылаем аргументы. */

source: /* Request result. */
ru: /* Отправка результата. */

source: /* Receive result. */
ru: /* Получение результата. */

source: /* Ensure buffer is 0-terminated. */
ru: /* Проверяем, что буфер завершается 0. */

source: /* Close socket. */
ru: /* Закрытие сокета. */

source: For an example of the use of B<SCM_RIGHTS> see B<cmsg>(3).
ru: Пример использования B<SCM_RIGHTS> приведён в B<cmsg>(3).

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: user-keyring - per-user keyring
ru: user-keyring - пользовательская связка ключей

source: The user keyring is a keyring used to anchor keys on behalf of a user. Each UID the kernel deals with has its own user keyring that is shared by all processes with that UID. The user keyring has a name (description) of the form I<_uid.E<lt>UIDE<gt>> where I<E<lt>UIDE<gt>> is the user ID of the corresponding user.
ru: Пользовательская связка ключей используется для хранения ключей пользователя. Для каждого UID у ядра есть своя связка ключей пользователя, которая доступна из всех процессов с этим UID. Пользовательская связка ключей имеет имя (описание) в виде I<_uid.E<lt>UIDE<gt>>, где I<E<lt>UIDE<gt>> идентификатор пользователя соответствующего пользователя.

source: The user keyring is associated with the record that the kernel maintains for the UID. It comes into existence upon the first attempt to access either the user keyring, the B<user-session-keyring>(7), or the B<session-keyring>(7). The keyring remains pinned in existence so long as there are processes running with that real UID or files opened by those processes remain open. (The keyring can also be pinned indefinitely by linking it into another keyring.)
ru: Пользовательская связка ключей связана с записью, которая обслуживается ядром для UID. Она начинает существовать при попытке первого обращения к пользовательской связке ключей, к B<user-session-keyring>(7) или к B<session-keyring>(7). Связка ключей существует привязанной всё время пока выполняются процессы с этим реальным UID или остаются открытыми файлы, открытые этими процессами (связка ключей также может быть привязана бесконечно, если её прицепить к другой связке ключей).

source: Typically, the user keyring is created by B<pam_keyinit>(8) when a user logs in.
ru: Обычно, пользовательская связка ключей создаётся B<pam_keyinit>(8) при входе пользователя в систему.

source: The user keyring is not searched by default by B<request_key>(2). When B<pam_keyinit>(8) creates a session keyring, it adds to it a link to the user keyring so that the user keyring will be searched when the session keyring is.
ru: По умолчанию в пользовательской связке ключей вызов B<request_key>(2) не производит поиск. Когда B<pam_keyinit>(8) создаёт связку ключей сеанса, он добавляет в неё пользовательскую связку ключей, и таким образом поиск выполняется в пользовательской связке ключей, если происходит поиск в связке ключей сеанса.

source: A special serial number value, B<KEY_SPEC_USER_KEYRING>, is defined that can be used in lieu of the actual serial number of the calling process's user keyring.
ru: Существует специальный серийный номер, B<KEY_SPEC_USER_KEYRING>, который можно указывать вместо реального серийного номера пользовательской связки ключей вызывающего процесса.

source: From the B<keyctl>(1) utility, 'B<@u>' can be used instead of a numeric key ID in much the same way.
ru: В утилите B<keyctl>(1) подобным образом можно использовать «B<@u>» вместо числового идентификатора ключа.

source: User keyrings are independent of B<clone>(2), B<fork>(2), B<vfork>(2), B<execve>(2), and B<_exit>(2) excepting that the keyring is destroyed when the UID record is destroyed when the last process pinning it exits.
ru: Пользовательские связки ключей не зависят от B<clone>(2), B<fork>(2), B<vfork>(2), B<execve>(2) и B<_exit>(2) за исключением того, что эта связка ключей уничтожается когда запись UID уничтожается при завершении последнего привязанного процесса.

source: If it is necessary for a key associated with a user to exist beyond the UID record being garbage collected\(emfor example, for use by a B<cron>(8) script\(emthen the B<persistent-keyring>(7) should be used instead.
ru: Если нужно, чтобы ключ, связанный с пользователем, существовал и после сбора мусорщиком записи UID — например, для сценария B<cron>(8) — то должна быть использована B<persistent-keyring>(7).

source: If a user keyring does not exist when it is accessed, it will be created.
ru: Если связка ключей пользователя не существует на момент доступа, то она создаётся.

source: UTF-8 - an ASCII compatible multibyte Unicode encoding
ru: UTF-8 - ASCII-совместимая многобайтовая юникодная кодировка

source: The Unicode 3.0 character set occupies a 16-bit code space. The most obvious Unicode encoding (known as UCS-2) consists of a sequence of 16-bit words. Such strings can contain\(emas part of many 16-bit characters\(embytes such as \(aq\e0\(aq or \(aq/\(aq, which have a special meaning in filenames and other C library function arguments. In addition, the majority of UNIX tools expect ASCII files and can't read 16-bit words as characters without major modifications. For these reasons, UCS-2 is not a suitable external encoding of Unicode in filenames, text files, environment variables, and so on. The ISO 10646 Universal Character Set (UCS), a superset of Unicode, occupies an even larger code space\(em31\ bits\(emand the obvious UCS-4 encoding for it (a sequence of 32-bit words) has the same problems.
ru: Набор символов Unicode 3.0 занимает 16-битное кодовое пространство. Наиболее распространённая юникодная кодировка, известная как UCS-2, содержит последовательности 16-битных слов. Закодированные таким образом строки могут состоять из частей 16-битных символов например, \(aq\e0\(aq или \(aq/\(aq, которые имеют специальное значение в именах файлов и других параметрах функций библиотеки языка Си. Кроме того, большинство утилит UNIX предназначено для обработки ASCII-файлов и не может воспринимать 16-битные слова как символы. По этим причинам UCS-2 является неподходящей кодировкой Юникода для имён файлов, текстовых файлов, переменных окружения и т.д. Набор ISO Universal Character Set (UCS), расширенный набор Юникода, занимает более 31-битного кодового пространства, а используемая для него кодировка UCS-4 (последовательность 32-битных слов) имеет те же недостатки, что и описанные выше.

source: The UTF-8 encoding of Unicode and UCS does not have these problems and is the common way in which Unicode is used on UNIX-style operating systems.
ru: Кодировка UTF-8 для представления Юникода и UCS лишена этих недостатков и поэтому в UNIX-подобных операционных системах используется наиболее часто.

source: Properties
ru: Свойства

source: The UTF-8 encoding has the following nice properties:
ru: Кодировка UTF-8 обладает следующими полезными свойствами:

source: UCS characters 0x00000000 to 0x0000007f (the classic US-ASCII characters) are encoded simply as bytes 0x00 to 0x7f (ASCII compatibility). This means that files and strings which contain only 7-bit ASCII characters have the same encoding under both ASCII and UTF-8 .
ru: UCS-символы с кодами от 0x00000000 до 0x0000007f (стандартный набор US-ASCII) кодируются как байты с кодами от 0x00 до 0x7f (для совместимости с кодовой таблицей ASCII). Это означает, что файлы и строки, содержащие только 7-битные ASCII-символы, будут иметь одинаковое представление как в ASCII так и в UTF-8.

source: All UCS characters greater than 0x7f are encoded as a multibyte sequence consisting only of bytes in the range 0x80 to 0xfd, so no ASCII byte can appear as part of another character and there are no problems with, for example, \(aq\e0\(aq or \(aq/\(aq.
ru: Все UCS-символы с кодами больше чем 0x7f кодируются как многобайтовые последовательности, содержащие только байты в диапазоне от 0x80 до 0xfd, так что ASCII-байты не могут оказаться частью другого символа и, как следствие, не будет проблем с использованием \(aq\e0\(aq или \(aq/\(aq.

source: The lexicographic sorting order of UCS-4 strings is preserved.
ru: Сохраняется лексикографический порядок сортировки строк как в кодировке UCS-4.

source: All possible 2^31 UCS codes can be encoded using UTF-8.
ru: При помощи UTF-8 могут быть закодированы все 2^31 значения UCS.

source: The bytes 0xc0, 0xc1, 0xfe, and 0xff are never used in the UTF-8 encoding.
ru: В кодировке UTF-8 никогда не используются байты с кодами 0xc0, 0xc1, 0xfe и 0xff.

source: The first byte of a multibyte sequence which represents a single non-ASCII UCS character is always in the range 0xc2 to 0xfd and indicates how long this multibyte sequence is. All further bytes in a multibyte sequence are in the range 0x80 to 0xbf. This allows easy resynchronization and makes the encoding stateless and robust against missing bytes.
ru: Первый байт многобайтовой последовательности, представляющей один не ASCII UCS-символ, всегда находится в диапазоне от 0xc2 до 0xfd и указывает на длину многобайтовой последовательности. Все последующие байты в многобайтовой последовательности находятся в диапазоне от 0x80 до 0xbf. Это позволяет облегчить ресинхронизацию, устраняет необходимость учитывать состояние кодировки (statelessness) и делает кодировку независимой от пропущенных байтов.

source: UTF-8 encoded UCS characters may be up to six bytes long, however the Unicode standard specifies no characters above 0x10ffff, so Unicode characters can be only up to four bytes long in UTF-8.
ru: Символы UCS, закодированные в UTF-8, могут занимать до шести байтов, однако в стандарте Юникода не определены символы выше 0x10ffff, поэтому в UTF-8 юникодные символы могут иметь максимальный размер 4 байта.

source: Encoding
ru: Кодирование

source: The following byte sequences are used to represent a character. The sequence to be used depends on the UCS code number of the character:
ru: Приведённые ниже последовательности байтов используются для отображения символа. Конкретная последовательность зависит от номера символа в кодировке UCS:

source: The I<xxx> bit positions are filled with the bits of the character code number in binary representation, most significant bit first (big-endian). Only the shortest possible multibyte sequence which can represent the code number of the character can be used.
ru: Позиции битов, обозначенные как I<xxx>, заполняются соответствующими битами из кода символа в двоичном виде, наиболее значимый бит первый (прямой порядок байт).Используется самая короткая из возможных многобайтовых последовательностей, которые могут представить код символа.

source: The UCS code values 0xd800\(en0xdfff (UTF-16 surrogates) as well as 0xfffe and 0xffff (UCS noncharacters) should not appear in conforming UTF-8 streams. According to RFC 3629 no point above U+10FFFF should be used, which limits characters to four bytes.
ru: Значения кодов UCS 0xd00\(en0xdfff (суррогаты UTF-16), а также 0xfffe и 0xffff (не символьные значения UCS), не должны появляться в потоках UTF-8. Согласно RFC 3629 точки выше U+10FFFF не должны использоваться, что ограничивает символы четырьмя байтами.

source: Example
ru: Пример

source: The Unicode character 0xa9 = 1010 1001 (the copyright sign) is encoded in UTF-8 as
ru: Символ Юникода с кодом 0xa9 = 1010 1001 (знак авторского права) кодируется в UTF-8 как

source: and character 0x2260 = 0010 0010 0110 0000 (the "not equal" symbol) is encoded as:
ru: а символ с кодом 0x2260 = 0010 0010 0110 0000 (знак неравенства) кодируется так:

source: Application notes
ru: Замечания к применению

source: Users have to select a UTF-8 locale, for example with
ru: Например, с помощью

source: in order to activate the UTF-8 support in applications.
ru: пользователи должны выбрать локаль UTF-8 для включения поддержки UTF-8 в приложениях.

source: Application software that has to be aware of the used character encoding should always set the locale with for example
ru: Программы, в которых учитывается используемая пользователем кодировка, должны всегда устанавливать локаль с помощью

source: and programmers can then test the expression
ru: и затем проверять выражением

source: to determine whether a UTF-8 locale has been selected and whether therefore all plaintext standard input and output, terminal communication, plaintext file content, filenames and environment variables are encoded in UTF-8.
ru: что локаль UTF-8 выбрана и во всех стандартных текстовых потоках ввода и вывода, на терминалах, в содержимом простых текстовых файлов, именах файлов и переменных окружения будет использоваться кодировка UTF-8.

source: Programmers accustomed to single-byte encodings such as US-ASCII or ISO 8859 have to be aware that two assumptions made so far are no longer valid in UTF-8 locales. Firstly, a single byte does not necessarily correspond any more to a single character. Secondly, since modern terminal emulators in UTF-8 mode also support Chinese, Japanese, and Korean double-width characters as well as nonspacing combining characters, outputting a single character does not necessarily advance the cursor by one position as it did in ASCII. Library functions such as B<mbsrtowcs>(3) and B<wcswidth>(3) should be used today to count characters and cursor positions.
ru: Программисты, привыкшие к однобайтовым кодировкам, таким как, US-ASCII или ISO 8859, должны учесть, что два предположения, действовавших ранее, в локалях UTF-8 не работают. Первое: один байт теперь не обязательно соответствует одному символу. Второе: современные эмуляторы терминала в режиме UTF-8 также поддерживают китайские, японские и корейские символы двойной ширины (double-width characters), а также комбинированные символы без пробелов, и вывод одного символа необязательно смещает курсор на одну позицию, как это было в ASCII. Для подсчёта количества символов и позиций курсора нужно использовать библиотечные функции, такие как B<mbsrtowcs>(3) и B<wcswidth>(3).

source: The official ESC sequence to switch from an ISO 2022 encoding scheme (as used for instance by VT100 terminals) to UTF-8 is ESC % G ("\ex1b%G"). The corresponding return sequence from UTF-8 to ISO 2022 is ESC % @ ("\ex1b%@"). Other ISO 2022 sequences (such as for switching the G0 and G1 sets) are not applicable in UTF-8 mode.
ru: Стандартной ESC-последовательностью для переключения из схемы кодировки ISO 2022 (используется в терминалах VT100) в UTF-8 является ESC % G ("\ex1b%G"). Соответственно, обратной последовательностью для переключения из UTF-8 в ISO 2022 будет ESC % @ ("\ex1b%@"). Остальные последовательности ISO 2022 (такие, как переключение в наборы G0 и G1) в режиме UTF-8 не работают.

source: Security
ru: Безопасность

source: The Unicode and UCS standards require that producers of UTF-8 shall use the shortest form possible, for example, producing a two-byte sequence with first byte 0xc0 is nonconforming. Unicode 3.1 has added the requirement that conforming programs must not accept non-shortest forms in their input. This is for security reasons: if user input is checked for possible security violations, a program might check only for the ASCII version of "/../" or ";" or NUL and overlook that there are many non-ASCII ways to represent these things in a non-shortest UTF-8 encoding.
ru: Стандарты Юникода и UCS требуют, чтобы генераторы UTF-8 использовали самую короткую возможную форму представления символов, то есть создание двухбайтной последовательности с первым байтом, равным 0xc0, запрещено. В стандарте Unicode 3.1 это правило расширено и запрещает программам воспринимать не самую короткую форму при вводе. Это сделано из соображений безопасности: если вводимые пользователем символы проверяются системой безопасности на возможные нарушения, то программам остаётся проверить только ASCII версии символов «/../», «;» или NUL, так как для этих символов может быть очень много не ASCII способов представления при не самом коротком кодировании в UTF-8.

source: Standards
ru: Стандарты

source: udplite - Lightweight User Datagram Protocol
ru: udplite - облегчённый протокол пользовательских датаграмм

source: This is an implementation of the Lightweight User Datagram Protocol (UDP-Lite), as described in RFC\ 3828.
ru: Это реализация облегчённого протокола пользовательских датаграмм (UDP-Lite), описанная в RFC\ 3828.

source: UDP-Lite is an extension of UDP (RFC\ 768) to support variable-length checksums. This has advantages for some types of multimedia transport that may be able to make use of slightly damaged datagrams, rather than having them discarded by lower-layer protocols.
ru: UDP-Lite представляет собой расширение UDP (RFC\ 768), содержащее поддержку контрольных сумм переменной длины. Это даёт преимущества при передаче данных некоторых типов мультимедиа, для которых допустимо использовать слегка повреждённые датаграммы, если бы они не отбрасывались другими нижележащими протоколами.

source: The variable-length checksum coverage is set via a B<setsockopt>(2) option. If this option is not set, the only difference from UDP is in using a different IP protocol identifier (IANA number 136).
ru: Охват (coverage) контрольной суммы переменной длины задаётся с помощью параметра через B<setsockopt>(2). Если параметр не установлен, то отличием от UDP будет только другой идентификатор протокола IP (номер по IANA — 136).

source: The UDP-Lite implementation is a full extension of B<udp>(7)\(emthat is, it shares the same API and API behavior, and in addition offers two socket options to control the checksum coverage.
ru: Реализация UDP-Lite представляет собой полноценное расширение B<udp>(7) — используется тот же программный интерфейс и поведение; кроме этого имеются два параметра сокета для управления охватом контрольной суммы.

source: UDP-Litev4 uses the I<sockaddr_in> address format described in B<ip>(7). UDP-Litev6 uses the I<sockaddr_in6> address format described in B<ipv6>(7).
ru: В UDP-Litev4 используется формат адреса I<sockaddr_in>, описанный в B<ip>(7). В UDP-Litev6 используется формат адреса I<sockaddr_in6>, описанный в B<ipv6>(7).

source: To set or get a UDP-Lite socket option, call B<getsockopt>(2) to read or B<setsockopt>(2) to write the option with the option level argument set to B<IPPROTO_UDPLITE>. In addition, all B<IPPROTO_UDP> socket options are valid on a UDP-Lite socket. See B<udp>(7) for more information.
ru: Для получения и задания параметров сокетов UDP-Lite, используйте вызовы B<getsockopt>(2) и B<setsockopt>(2), соответственно. Значение аргумента уровня параметров должно быть равно B<IPPROTO_UDPLITE>. Кроме того, сокетам UDP-Lite доступно большинство параметров сокета B<IPPROTO_UDP>. Дополнительная информация приведена в B<udp>(7).

source: The following two options are specific to UDP-Lite.
ru: Следующие параметры относятся только к UDP-Lite.

source: This option sets the sender checksum coverage and takes an I<int> as argument, with a checksum coverage value in the range 0..2^16-1.
ru: Этим параметром задаётся охват данных контрольной суммой; в качестве аргумента ожидается значение типа I<int>, которым задаётся охват в диапазоне 0..2^16-1.

source: A value of 0 means that the entire datagram is always covered. Values from 1-7 are illegal (RFC\ 3828, 3.1) and are rounded up to the minimum coverage of 8.
ru: Значение 0 означает, что охватывается вся датаграмма. Значения 1-7 некорректны (RFC\ 3828, 3.1) и округляются до минимального охвата — 8.
