Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: /* We use a pipe to synchronize the parent and child, in order to ensure that the parent sets the UID and GID maps before the child calls execve(). This ensures that the child maintains its capabilities during the execve() in the common case where we want to map the child\(aqs effective user ID to 0 in the new user namespace. Without this synchronization, the child would lose its capabilities if it performed an execve() with nonzero user IDs (see the capabilities(7) man page for details of the transformation of a process\(aqs capabilities during execve()). */
ru: /* Мы используем канал для синхронизации родителя и потомка, чтобы родитель настроил отображения UID и GID до того, как потомок вызовет execve(). Это гарантирует, что потомок предъявит свои мандаты при execve(); обычно мы хотим отобразить эффективный пользовательский ID потомка в 0 в новом пользовательском пространстве имён. Без этой синхронизации потомок потерял бы свои мандаты при вызове execve() с ненулевым пользовательским ID (смотрите в справочной странице capabilities(7) подробности преобразования мандатов процесса при execve()). */

source: /* Create the child in new namespace(s) */
ru: /* создаём потомка в новом пространстве имён */

source: /* Parent falls through to here */
ru: /* предок попадает сюда */

source: if (verbose) printf("%s: PID of child created by clone() is %ld\en", argv[0], (long) child_pid);
ru: if (verbose) printf("%s: PID потомка, созданного clone(): %ld\en", argv[0], (long) child_pid);

source: /* Update the UID and GID maps in the child */
ru: /* обновляем отображения UID и GID в потомке */

source: /* Close the write end of the pipe, to signal to the child that we have updated the UID and GID maps */
ru: /* закрываем конец канала на стороне записи для сообщения потомку о том, что мы обновили отображения UID и GID */

source: if (waitpid(child_pid, NULL, 0) == -1) /* Wait for child */ errExit("waitpid");
ru: if (waitpid(child_pid, NULL, 0) == -1) /* ждём потомка */ errExit("waitpid");

source: if (verbose) printf("%s: terminating\en", argv[0]);
ru: if (verbose) printf("%s: завершение\en", argv[0]);

source: The kernel source file I<Documentation/namespaces/resource-control.txt>.
ru: Файл из дерева исходного кода ядра I<Documentation/namespaces/resource-control.txt>.

source: unicode - universal character set
ru: unicode - универсальный набор символов

source: The international standard ISO 10646 defines the Universal Character Set (UCS). UCS contains all characters of all other character set standards. It also guarantees "round-trip compatibility"; in other words, conversion tables can be built such that no information is lost when a string is converted from any other encoding to UCS and back.
ru: Universal Character Set (UCS) (универсальный набор символов — Юникод) определён в международном стандарте ISO 10646. UCS содержит все символы других стандартов. Его использование гарантирует «полную взаимозаменяемость», другими словами, таблицы для преобразований могут быть построены таким образом, что не произойдёт потери информации при преобразовании строки из сторонней кодировки в UCS и обратно.

source: UCS contains the characters required to represent practically all known languages. This includes not only the Latin, Greek, Cyrillic, Hebrew, Arabic, Armenian, and Georgian scripts, but also Chinese, Japanese and Korean Han ideographs as well as scripts such as Hiragana, Katakana, Hangul, Devanagari, Bengali, Gurmukhi, Gujarati, Oriya, Tamil, Telugu, Kannada, Malayalam, Thai, Lao, Khmer, Bopomofo, Tibetan, Runic, Ethiopic, Canadian Syllabics, Cherokee, Mongolian, Ogham, Myanmar, Sinhala, Thaana, Yi, and others. For scripts not yet covered, research on how to best encode them for computer usage is still going on and they will be added eventually. This might eventually include not only Hieroglyphs and various historic Indo-European languages, but even some selected artistic scripts such as Tengwar, Cirth, and Klingon. UCS also covers a large number of graphical, typographical, mathematical, and scientific symbols, including those provided by TeX, Postscript, APL, MS-DOS, MS-Windows, Macintosh, OCR fonts, as well as many word processing and publishing systems, and more are being added.
ru: UCS содержит символы, необходимые для представления практически всех известных сейчас языковых символов. В него включены не только языковые символы из латинской, греческой, кириллицы, иврита, арабской, армянской, грузинской письменности, но и китайские, японские и корейские идеограммы, а также символы из таких письменностей как хирагана, катакана, хангул, деванагари, бенгальской, гурмуки, гуджарати, ория, тамильской, телугской, каннада, малаяламской, тайской, лаосской, кхмерской, бопомофо, тибетской, рунической, эфиопской, канадского слогового письма, чероки, монгольской, охамской, мьянмарской, синхальской,таанской, юи и других. По ещё не включённым письменностям постоянно ведутся работы для поиска их самой оптимальной кодировки для компьютеров и добавлении. К ним относятся не только различные иероглифы и письменности из индо-европейской исторической группы, но и некоторые искусственные языки, такие как тенгвар, сирт и клингонский. Также UCS содержит большое множество графических, типографических, математических и научных символов, используемых в таких программах, как TeX, Postscript, APL, MS-DOS, MS-Windows, Macintosh, шрифтах OCR и многих других текстовых процессорах и издательских системах.

source: The UCS standard (ISO 10646) describes a 31-bit character set architecture consisting of 128 24-bit I<groups>, each divided into 256 16-bit I<planes> made up of 256 8-bit I<rows> with 256 I<column> positions, one for each character. Part 1 of the standard (ISO 10646-1) defines the first 65534 code positions (0x0000 to 0xfffd), which form the I<Basic Multilingual Plane> (BMP), that is plane 0 in group 0. Part 2 of the standard (ISO 10646-2) adds characters to group 0 outside the BMP in several I<supplementary planes> in the range 0x10000 to 0x10ffff. There are no plans to add characters beyond 0x10ffff to the standard, therefore of the entire code space, only a small fraction of group 0 will ever be actually used in the foreseeable future. The BMP contains all characters found in the commonly used other character sets. The supplemental planes added by ISO 10646-2 cover only more exotic characters for special scientific, dictionary printing, publishing industry, higher-level protocol and enthusiast needs.
ru: Стандарт UCS (ISO 10646) описывает 31-битную архитектуру набора символов, состоящую из 128 24-битных I<групп>, каждая из которых разделена на 256 16-битных I<плоскостей>, которые, в свою очередь, состоят из 256 8-битных I<строк> и 256 I<колонок>, каждая для одного символа. В 1 части стандарта (ISO 10646-1) определяются первые 65534 кодируемых позиций (с 0x0000 по 0xfffd), каждая из которых образует Basic Multilingual Plane (BMP) (I<основную многоязычную матрицу>), являющуюся плоскостью 0 в группе 0. В 2 части стандарта (ISO 10646-2) добавляются символы, не вошедшие в BMP, в некоторые I<дополнительные плоскости> в диапазоне от 0x10000 до 0x10ffff группы 0. Пока нет планов по добавлению символов за предел 0x10ffff в существующий стандарт, поэтому в обозримом будущем во всём закодированном пространстве в действительности будет использоваться только малая часть группы 0. BMP содержит все символы, используемые в других наборах символов. Дополнительные плоскости, добавляемые ISO 10646-2 покрывают некоторые особенные, специальные и экзотические символы, используемые в науке, при печати словарей, издательской индустрии, протоколах высокого уровня и некоторыми энтузиастами.

source: The representation of each UCS character as a 2-byte word is referred to as the UCS-2 form (only for BMP characters), whereas UCS-4 is the representation of each character by a 4-byte word. In addition, there exist two encoding forms UTF-8 for backward compatibility with ASCII processing software and UTF-16 for the backward-compatible handling of non-BMP characters up to 0x10ffff by UCS-2 software.
ru: Представление каждого символа в UCS в виде -байтного слова называют формой UCS-2 (только для символов BMP), UCS-4 называют представление каждого символа 4-байтным словом. Также существуют 2 формы кодировки: UTF-8 — для совместимости со старым ПО, работающим с кодировкой ASCII, и UTF-16 — для совместимости с ПО, работающим с кодировкой UCS-2, для не BMP символов до 0x10ffff позиции.

source: The UCS characters 0x0000 to 0x007f are identical to those of the classic US-ASCII character set and the characters in the range 0x0000 to 0x00ff are identical to those in ISO 8859-1 (Latin-1).
ru: Символы UCS от 0x0000 до 0x007f идентичны обычному набору символов US-ASCII, а символы в диапазоне от 0x0000 до 0x00ff идентичны символам ISO 8859-1 (Latin-1).

source: Combining characters
ru: Комбинирующие символы

source: Some code points in UCS have been assigned to I<combining characters>. These are similar to the nonspacing accent keys on a typewriter. A combining character just adds an accent to the previous character. The most important accented characters have codes of their own in UCS, however, the combining character mechanism allows us to add accents and other diacritical marks to any character. The combining characters always follow the character which they modify. For example, the German character Umlaut-A ("Latin capital letter A with diaeresis") can either be represented by the precomposed UCS code 0x00c4, or alternatively as the combination of a normal "Latin capital letter A" followed by a "combining diaeresis": 0x0041 0x0308.
ru: Некоторые позиции в UCS зарезервированы для I<комбинирующих символов>. Они аналогичны клавишам печатной машинки, которые служат для набора букв с ударением. Комбинирующий символ лишь добавляет ударение к предыдущему символу. Наиболее употребляемые символы, требующие ударения, имеют собственный код в UCS, однако комбинирующий символ позволяет добавить ударение или другой диакритический знак к любому символу. Комбинирующие символы всегда указываются после буквы, которую они изменяют. Например, немецкий символ «умляут-А» (латинская заглавная буква А с диерезой) может быть представлен как зарезервированный специальный символ UCS с кодом 0x00c4, или как комбинация обыкновенной «латинской заглавной буквы А» и последующей «комбинирующей диерезы: 0x0041 0x0308.

source: Combining characters are essential for instance for encoding the Thai script or for mathematical typesetting and users of the International Phonetic Alphabet.
ru: Комбинирующие символы являются необходимым инструментом для кодирования символов тайского языка, математики и для пользователей международного фонетического алфавита (International Phonetic Alphabet).

source: Implementation levels
ru: Уровни реализации

source: As not all systems are expected to support advanced mechanisms like combining characters, ISO 10646-1 specifies the following three I<implementation levels> of UCS:
ru: Так как не все системы могут поддерживать такой сложный механизм, как реализацию комбинирующих символов, стандарт ISO 10646-1 предусматривает следующие три I<уровня реализации> UCS:

source: Level 1
ru: Уровень 1

source: Combining characters and Hangul Jamo (a variant encoding of the Korean script, where a Hangul syllable glyph is coded as a triplet or pair of vowel/consonant codes) are not supported.
ru: Комбинирующие символы и символы Hangul Jamo (вариант кодировки корейского письма, где слоги хангыль кодируются по два или по три гласных кода) не поддерживаются.

source: Level 2
ru: Уровень 2

source: In addition to level 1, combining characters are now allowed for some languages where they are essential (e.g., Thai, Lao, Hebrew, Arabic, Devanagari, Malayalam).
ru: В дополнении к символам уровня 1 комбинирующие символы разрешено использовать для некоторых языков, в которых они важны (например: тайский, лаосский, иврит, арабский, деванагари, малаяламский).

source: Level 3
ru: Уровень 3

source: All UCS characters are supported.
ru: Поддерживаются все символы UCS.

source: The Unicode 3.0 Standard published by the Unicode Consortium contains exactly the UCS Basic Multilingual Plane at implementation level 3, as described in ISO 10646-1:2000. Unicode 3.1 added the supplemental planes of ISO 10646-2. The Unicode standard and technical reports published by the Unicode Consortium provide much additional information on the semantics and recommended usages of various characters. They provide guidelines and algorithms for editing, sorting, comparing, normalizing, converting, and displaying Unicode strings.
ru: Стандарт Unicode 3.0, опубликованный Unicode Consortium, содержит точную реализацию UCS Basic Multilingual Plane на уровне 3, как описано в стандарте ISO 10646-1:2000. В Unicode 3.1 добавлены дополнительные плоскости ISO 10646-2. Стандарт Юникода и технические сообщения, публикуемые Unicode Consortium, предоставляют много дополнительной информации по семантике и рекомендации по использованию разных символов. Также поясняются принципы и алгоритмы для редактирования, сортировки, сравнения, нормализации, преобразования и вывода строк Юникода.

source: Unicode under Linux
ru: Юникод в Linux

source: Under GNU/Linux, the C type I<wchar_t> is a signed 32-bit integer type. Its values are always interpreted by the C library as UCS code values (in all locales), a convention that is signaled by the GNU C library to applications by defining the constant B<__STDC_ISO_10646__> as specified in the ISO C99 standard.
ru: В системах GNU/Linux тип языка Cи I<wchar_t> является 32-битным знаковым целым типом. Его значения всегда интерпретируются библиотекой Си как значения кодов UCS (во всех локалях); в этом случае, согласно стандарту ISO C99, библиотека GNU C определяет константу B<__STDC_ISO_10646__>.

source: UCS/Unicode can be used just like ASCII in input/output streams, terminal communication, plaintext files, filenames, and environment variables in the ASCII compatible UTF-8 multibyte encoding. To signal the use of UTF-8 as the character encoding to all applications, a suitable I<locale> has to be selected via environment variables (e.g., "LANG=en_GB.UTF-8").
ru: UCS/Unicode может использоваться подобно ASCII в потоках ввода/вывода, соединениях с терминалами, в текстовых файлах, названиях файлов и в переменных окружения в виде многобайтовой кодировке UTF-8, совместимой с ASCII. Для обозначения использования UTF-8 как кодировки во всех приложениях должна быть выбрана подходящая I<локаль> через переменные окружения (например, «LANG=ru_RU.UTF-8»).

source: The B<nl_langinfo(CODESET)> function returns the name of the selected encoding. Library functions such as B<wctomb>(3) and B<mbsrtowcs>(3) can be used to transform the internal I<wchar_t> characters and strings into the system character encoding and back and B<wcwidth>(3) tells, how many positions (0\(en2) the cursor is advanced by the output of a character.
ru: Функция B<nl_langinfo(CODESET)> возвращает название выбранной кодировки. Библиотечные функции, такие как B<wctomb>(3) и B<mbsrtowcs>(3), могут использоваться для преобразования внутренних символов I<wchar_t> и строк в кодировку системных символов и наоборот; B<wcwidth>(3) определяет, на сколько позиций (0\(en2) сместился курсор при выводе символа.

source: Private Use Areas (PUA)
ru: Закрытые используемые области (Private Use Areas, PUA)

source: In the Basic Multilingual Plane, the range 0xe000 to 0xf8ff will never be assigned to any characters by the standard and is reserved for private usage. For the Linux community, this private area has been subdivided further into the range 0xe000 to 0xefff which can be used individually by any end-user and the Linux zone in the range 0xf000 to 0xf8ff where extensions are coordinated among all Linux users. The registry of the characters assigned to the Linux zone is maintained by LANANA and the registry itself is I<Documentation/admin-guide/unicode.rst> in the Linux kernel sources (or I<Documentation/unicode.txt> before Linux 4.10).
ru: В основной многоязычной матрице диапазон с 0xe000 до 0xf8ff никогда не будет использован для обозначения стандартных символов, он зарезервирован для частного использования. В Linux эта закрытая область делится на: диапазон 0xe000 по 0xefff может использоваться конечным пользователем; диапазон 0xf000 по 0xf8ff (так называемая зона Linux) может использоваться для расширений, согласованных среди пользователей Linux. В настоящее время регистрацией символов в зоне Linux занимается LANANA, а сам реестр находится в файле I<Documentation/admin-guide/unicode.rst> исходного кода ядра Linux (в I<Documentation/unicode.txt> до Linux 4.10).

source: Two other planes are reserved for private usage, plane 15 (Supplementary Private Use Area-A, range 0xf0000 to 0xffffd) and plane 16 (Supplementary Private Use Area-B, range 0x100000 to 0x10fffd).
ru: Две другие плоскости зарезервированы для закрытого использования, плоскость 15 (дополнительная закрытая используемая область-A, диапазон от 0xf0000 до 0xffffd) и плоскость 16 (дополнительная закрытая используемая область-B, диапазон от 0x100000 до 0x10fffd).

source: Literature
ru: Литература

source: This is the official specification of UCS . Available from E<.UR http://www.iso.ch/> E<.UE .>
ru: Официальная спецификация UCS. Доступна с E<.UR http://www.iso.ch/> E<.UE .>

source: A good reference book about the C programming language. The fourth edition covers the 1994 Amendment 1 to the ISO C90 standard, which adds a large number of new C library functions for handling wide and multibyte character encodings, but it does not yet cover ISO C99, which improved wide and multibyte character support even further.
ru: Хорошая книга о программировании на языке Си. Четвёртое издание включает в себя описание поправки 1, сделанной в стандарте ISO C90 в 1994 году. Эта поправка добавляет к стандарту большое количество новых библиотечных функций Си для поддержки кодирования широких и многобайтовых символов, но она не так полна как стандарт ISO C99, который расширяет поддержку широких и многобайтовых символов.

source: uri, url, urn - uniform resource identifier (URI), including a URL or URN
ru: uri, url, urn - единый идентификатор ресурса (URI), содержащий URL или URN

source: URI = [ absoluteURI | relativeURI ] [ "#" fragment ]
ru: URI = [ абсолютный_URI | относительный_URI ] [ "#" фрагмент ]

source: absoluteURI = scheme ":" ( hierarchical_part | opaque_part )
ru: абсолютныйURI = схема ":" ( иерархическая_часть | неясная_часть )

source: relativeURI = ( net_path | absolute_path | relative_path ) [ "?" query ]
ru: относительныйURI = ( сетевой_путь | абсолютный_путь | относительный_путь ) [ "?" запрос ]

source: scheme = "http" | "ftp" | "gopher" | "mailto" | "news" | "telnet" | "file" | "man" | "info" | "whatis" | "ldap" | "wais" | \&...
ru: схема = "http" | "ftp" | "gopher" | "mailto" | "news" | "telnet" | "file" | "man" | "info" | "whatis" | "ldap" | "wais" | …

source: hierarchical_part = ( net_path | absolute_path ) [ "?" query ]
ru: иерархическая_часть = ( сетевой_путь | абсолютный_путь ) [ "?" запрос ]

source: net_path = "//" authority [ absolute_path ]
ru: сетевой_путь = "//" полномочия [ абсолютный_путь ]

source: absolute_path = "/" path_segments
ru: абсолютный_путь = "/" сегменты_пути

source: relative_path = relative_segment [ absolute_path ]
ru: относительный_путь = относительный_сегмент [ абсолютный_путь ]

source: A Uniform Resource Identifier (URI) is a short string of characters identifying an abstract or physical resource (for example, a web page). A Uniform Resource Locator (URL) is a URI that identifies a resource through its primary access mechanism (e.g., its network "location"), rather than by name or some other attribute of that resource. A Uniform Resource Name (URN) is a URI that must remain globally unique and persistent even when the resource ceases to exist or becomes unavailable.
ru: Единый идентификатор ресурса (Uniform Resource Identifier (URI)) — это короткая строка символов, идентифицирующая абстрактный или физический ресурс (например, веб-страницу). Единый указатель местоположения ресурса (Uniform Resource Locator (URL)) — это URI, который идентифицирует ресурс по основному способу доступа к нему (например, его «местонахождению в сети»), а не по названию или другим атрибутам этого ресурса. Единое название ресурса (Uniform Resource Name (URN)) — это URI, который должен оставаться уникальным и неизменным даже в том случае, когда ресурс уже не существует или недоступен.

source: URIs are the standard way to name hypertext link destinations for tools such as web browsers. The string "http://www.kernel.org" is a URL (and thus it is also a URI). Many people use the term URL loosely as a synonym for URI (though technically URLs are a subset of URIs).
ru: URI являются стандартным способом создания конечных адресов гипертекстовых ссылок для таких инструментов как веб-браузеры. Строка «http://www.kernel.org» является URL (а значит и URI). Многие используют термин URL неправильно, как синоним URI (технически, URL являются частью URI).

source: URIs can be absolute or relative. An absolute identifier refers to a resource independent of context, while a relative identifier refers to a resource by describing the difference from the current context. Within a relative path reference, the complete path segments "." and ".." have special meanings: "the current hierarchy level" and "the level above this hierarchy level", respectively, just like they do in UNIX-like systems. A path segment which contains a colon character can't be used as the first segment of a relative URI path (e.g., "this:that"), because it would be mistaken for a scheme name; precede such segments with ./ (e.g., "./this:that"). Note that descendants of MS-DOS (e.g., Microsoft Windows) replace devicename colons with the vertical bar ("|") in URIs, so "C:" becomes "C|".
ru: URI могут быть абсолютными или относительными. Абсолютный идентификатор ссылается на ресурс независимо от контекста, в то время как относительный идентификатор ссылается на ресурс, описывая его относительно текущего контекста. В относительном идентификаторе части пути «.» и «..» имеют специальные значения: «текущий иерархический уровень» и «уровень выше текущего иерархического уровня», соответственно —аналогично UNIX-подобным системам. Часть пути, содержащая двоеточие, не может быть использована как первая часть пути относительного URI (например, «это:то»), потому что это приведёт к ошибке; перед такими частями надо ставить ./ (например, «./это:то»). Заметим, что в производных MS-DOS (например, Microsoft Windows) в URI в именах устройств двоеточие заменено на вертикальную черту («|»), то есть «C:» заменяется на «C|».

source: A fragment identifier, if included, refers to a particular named portion (fragment) of a resource; text after a \(aq#\(aq identifies the fragment. A URI beginning with \(aq#\(aq refers to that fragment in the current resource.
ru: Если используется идентификатор фрагмента, то он ссылается на часть ресурса с конкретным названием; фрагментом называют текст после символа «#». URI, начинающийся с «#», ссылается на такой фрагмент в текущем ресурсе.

source: Usage
ru: Использование
