Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: This flag has the same effect as the B<clone>(2) B<CLONE_NEWIPC> flag. Unshare the IPC namespace, so that the calling process has a private copy of the IPC namespace which is not shared with any other process. Specifying this flag automatically implies B<CLONE_SYSVSEM> as well. Use of B<CLONE_NEWIPC> requires the B<CAP_SYS_ADMIN> capability.
ru: Этот флаг имеет действие подобное флагу B<CLONE_NEWIPC> для B<clone>(2). Отделяет пространство имён IPC таким образом, что вызывающий процесс будет иметь свою личную копию пространства имён IPC, неиспользуемую другими процессами. Задание данного флага автоматически устанавливает флаг B<CLONE_SYSVSEM>. Для использования B<CLONE_NEWIPC> требуется мандат B<CAP_SYS_ADMIN>.

source: B<CLONE_NEWNET> (since Linux 2.6.24)
ru: B<CLONE_NEWNET> (начиная с Linux 2.6.24)

source: This flag has the same effect as the B<clone>(2) B<CLONE_NEWNET> flag. Unshare the network namespace, so that the calling process is moved into a new network namespace which is not shared with any previously existing process. Use of B<CLONE_NEWNET> requires the B<CAP_SYS_ADMIN> capability.
ru: Этот флаг имеет действие подобное флагу B<CLONE_NEWNET> для B<clone>(2). Отделяет сетевое пространство имён таким образом, что вызывающий процесс будет иметь свою личную копию сетевого пространства имён, неиспользуемую другими процессами. Для использования B<CLONE_NEWNET> требуется мандат B<CAP_SYS_ADMIN>.

source: This flag has the same effect as the B<clone>(2) B<CLONE_NEWNS> flag. Unshare the mount namespace, so that the calling process has a private copy of its namespace which is not shared with any other process. Specifying this flag automatically implies B<CLONE_FS> as well. Use of B<CLONE_NEWNS> requires the B<CAP_SYS_ADMIN> capability. For further information, see B<mount_namespaces>(7).
ru: Этот флаг имеет действие подобное флагу B<CLONE_NEWNS> для B<clone>(2). Отделяет пространство имён монтирования таким образом, что вызывающий процесс будет иметь свою личную копию данного пространства имён, неиспользуемую другими процессами. Задание данного флага автоматически устанавливает флаг B<CLONE_FS>. Для использования B<CLONE_NEWNS> требуется мандат B<CAP_SYS_ADMIN>. Дополнительная информация доступна в B<mount_namespaces>(7).

source: B<CLONE_NEWPID> (since Linux 3.8)
ru: B<CLONE_NEWPID> (начиная с Linux 3.8)

source: This flag has the same effect as the B<clone>(2) B<CLONE_NEWPID> flag. Unshare the PID namespace, so that the calling process has a new PID namespace for its children which is not shared with any previously existing process. The calling process is I<not> moved into the new namespace. The first child created by the calling process will have the process ID 1 and will assume the role of B<init>(1) in the new namespace. B<CLONE_NEWPID> automatically implies B<CLONE_THREAD> as well. Use of B<CLONE_NEWPID> requires the B<CAP_SYS_ADMIN> capability. For further information, see B<pid_namespaces>(7).
ru: Данный флаг позволяет то же что и B<CLONE_NEWPID> у B<clone>(2). Выполняется отключение от пространства имён PID; вызывающий процесс создаёт новое пространство имён PID для своих потомков, которые до этого не были объединены с существующим процессом. Вызывающий процесс I<не> перемещается в новое пространство имён. Первый потомок, созданный вызывающим процессом, будет иметь ID процесса 1 и считаться B<init>(1) в новом пространстве имён. Также флаг B<CLONE_NEWPID> автоматически подразумевает B<CLONE_THREAD>. Для использования B<CLONE_NEWPID> требуется мандат B<CAP_SYS_ADMIN>. Подробней смотрите B<pid_namespaces>(7).

source: B<CLONE_NEWUSER> (since Linux 3.8)
ru: B<CLONE_NEWUSER> (начиная с Linux 3.8)

source: This flag has the same effect as the B<clone>(2) B<CLONE_NEWUSER> flag. Unshare the user namespace, so that the calling process is moved into a new user namespace which is not shared with any previously existing process. As with the child process created by B<clone>(2) with the B<CLONE_NEWUSER> flag, the caller obtains a full set of capabilities in the new namespace.
ru: Данный флаг позволяет то же что и B<CLONE_NEWUSER> у B<clone>(2). Выполняется отключение от пользовательского пространства имён; вызывающий процесс перемещается в новое пользовательское пространство имён, которое до этого не был общим для существующего процесса. Как потомок процесса, созданный B<clone>(2) с флагом B<CLONE_NEWUSER>, вызывающий получает полный набор мандатов в новом пользовательском пространстве имён.

source: B<CLONE_NEWUSER> requires that the calling process is not threaded; specifying B<CLONE_NEWUSER> automatically implies B<CLONE_THREAD>. Since Linux 3.9, B<CLONE_NEWUSER> also automatically implies B<CLONE_FS>. B<CLONE_NEWUSER> requires that the user ID and group ID of the calling process are mapped to user IDs and group IDs in the user namespace of the calling process at the time of the call.
ru: Для B<CLONE_NEWUSER> требуется, чтобы вызывающий процесс не имел нитей; указание B<CLONE_NEWUSER> автоматически подразумевает B<CLONE_THREAD>. Начиная с Linux 3.9, B<CLONE_NEWUSER> также автоматически подразумевает B<CLONE_FS>. Для B<CLONE_NEWUSER> требуется, чтобы ID пользователя и группы вызывающего процесса отображались в ID пользователя и группы в пользовательском пространстве имён вызывающего процесса на момент вызова.

source: For further information on user namespaces, see B<user_namespaces>(7).
ru: Дополнительную информацию о пространствах имён пользователя смотрите в B<user_namespaces>(7).

source: B<CLONE_NEWUTS> (since Linux 2.6.19)
ru: B<CLONE_NEWUTS> (начиная с Linux 2.6.19)

source: This flag has the same effect as the B<clone>(2) B<CLONE_NEWUTS> flag. Unshare the UTS IPC namespace, so that the calling process has a private copy of the UTS namespace which is not shared with any other process. Use of B<CLONE_NEWUTS> requires the B<CAP_SYS_ADMIN> capability.
ru: Этот флаг имеет действие подобное флагу B<CLONE_NEWUTS> для B<clone>(2). Отделяет пространство имён UTS IPC таким образом, что вызывающий процесс будет иметь свою личную копию пространства имён UTS, неиспользуемую другими процессами. Для использования B<CLONE_NEWUTS> требуется мандат B<CAP_SYS_ADMIN>.

source: B<CLONE_SYSVSEM> (since Linux 2.6.26)
ru: B<CLONE_SYSVSEM> (начиная с Linux 2.6.26)

source: This flag reverses the effect of the B<clone>(2) B<CLONE_SYSVSEM> flag. Unshare System\ V semaphore adjustment (I<semadj>) values, so that the calling process has a new empty I<semadj> list that is not shared with any other process. If this is the last process that has a reference to the process's current I<semadj> list, then the adjustments in that list are applied to the corresponding semaphores, as described in B<semop>(2).
ru: С данным флагом выполняется обратное действие B<clone>(2) с флагом B<CLONE_SYSVSEM>. Выполняется отмена изменения значений семафоров System\ V (I<semadj>) таким образом, что вызывающий процесс получает новый пустой список I<semadj>, который не является общим ни с одним другим процессом. Если это последний процесс, который ссылается на текущий список I<semadj> процесса, то изменения (adjustments) в этом списке применяются к соответствующим семафорам как описано в B<semop>(2).

source: In addition, B<CLONE_THREAD>, B<CLONE_SIGHAND>, and B<CLONE_VM> can be specified in I<flags> if the caller is single threaded (i.e., it is not sharing its address space with another process or thread). In this case, these flags have no effect. (Note also that specifying B<CLONE_THREAD> automatically implies B<CLONE_VM>, and specifying B<CLONE_VM> automatically implies B<CLONE_SIGHAND>.) If the process is multithreaded, then the use of these flags results in an error.
ru: Также в I<flags> могут быть указаны флаги B<CLONE_THREAD>, B<CLONE_SIGHAND> и B<CLONE_VM>, если вызывающий состоит из одной нити (т. е., он не делит своё адресное пространство с другим процессом или нитью). Иначе данные флаги не работают (также заметим, что указание B<CLONE_THREAD> автоматически подразумевает B<CLONE_VM>, а указание B<CLONE_VM> автоматически подразумевает B<CLONE_SIGHAND>). Если процесс состоит из нескольких нитей, то использование данных флагов приведёт к ошибке.

source: If I<flags> is specified as zero, then B<unshare>() is a no-op; no changes are made to the calling process's execution context.
ru: Если значение I<flags> равно нулю, то B<unshare>() ничего не делает, то есть в контексте выполнения вызывающего процесса ничего не изменяется.

source: On success, zero returned. On failure, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении возвращается 0. При ошибке возвращается -1, а I<errno> присваивается значение ошибки.

source: An invalid bit was specified in I<flags>.
ru: В значении I<flags> установлен недопустимый бит.

source: B<CLONE_THREAD>, B<CLONE_SIGHAND>, or B<CLONE_VM> was specified in I<flags>, and the caller is multithreaded.
ru: В I<flags> указан B<CLONE_THREAD>, B<CLONE_SIGHAND> или B<CLONE_VM>, а вызывающий состоит из нескольких нитей.

source: B<CLONE_NEWIPC> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_SYSVIPC> and B<CONFIG_IPC_NS> options.
ru: Указан флаг B<CLONE_NEWIPC> в I<flags>, но ядро собрано без параметров B<CONFIG_SYSVIPC> и B<CONFIG_IPC_NS>.

source: B<CLONE_NEWNET> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_NET_NS> option.
ru: Указан флаг B<CLONE_NEWNET> в I<flags>, но ядро собрано без параметра B<CONFIG_NET_NS>.

source: B<CLONE_NEWPID> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_PID_NS> option.
ru: Указан флаг B<CLONE_NEWPID> в I<flags>, но ядро собрано без параметра B<CONFIG_PID_NS>.

source: B<CLONE_NEWUSER> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_USER_NS> option.
ru: Указан флаг B<CLONE_NEWUSER> в I<flags>, но ядро собрано без параметра B<CONFIG_USER_NS>.

source: B<CLONE_NEWUTS> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_UTS_NS> option.
ru: Указан флаг B<CLONE_NEWUTS> в I<flags>, но ядро собрано без параметра B<CONFIG_UTS_NS>.

source: B<CLONE_NEWPID> was specified in I<flags>, but the process has previously called B<unshare>() with the B<CLONE_NEWPID> flag.
ru: Указан флаг B<CLONE_NEWPID> в I<flags>, но процесс был ранее вызван B<unshare>() с флагом B<CLONE_NEWPID>.

source: Cannot allocate sufficient memory to copy parts of caller's context that need to be unshared.
ru: Не удалось выделить достаточно памяти для копирования части контекста вызывающего, которая должна быть отделена.

source: B<ENOSPC> (since Linux 3.7)
ru: B<ENOSPC> (начиная с Linux 3.7)

source: B<CLONE_NEWPID> was specified in flags, but the limit on the nesting depth of PID namespaces would have been exceeded; see B<pid_namespaces>(7).
ru: В флагах указан B<CLONE_NEWPID>, но вызов привёл бы к превышению ограничения на количество вложенных имён PID; смотрите B<pid_namespaces>(7).

source: B<ENOSPC> (since Linux 4.9; beforehand B<EUSERS>)
ru: B<ENOSPC> (начиная с Linux 4.9; до этого B<EUSERS>)

source: B<CLONE_NEWUSER> was specified in I<flags>, and the call would cause the limit on the number of nested user namespaces to be exceeded. See B<user_namespaces>(7).
ru: Флаг B<CLONE_NEWUSER> указан в I<flags>, и вызов привёл бы к превышению ограничения на количество вложенных пользовательских пространств имён. Смотрите B<user_namespaces>(7).

source: From Linux 3.11 to Linux 4.8, the error diagnosed in this case was B<EUSERS>.
ru: В этом случае в Linux 3.11 по Linux 4.8 возвращалась ошибка B<EUSERS>.

source: B<ENOSPC> (since Linux 4.9)
ru: B<ENOSPC> (начиная с Linux 4.9)

source: One of the values in I<flags> specified the creation of a new user namespace, but doing so would have caused the limit defined by the corresponding file in I</proc/sys/user> to be exceeded. For further details, see B<namespaces>(7).
ru: Одним из значений в I<flags> задаётся создание нового пространства пространства имён пользователя, но это превысило бы ограничение, определённое в соответствующем файле в каталоге I</proc/sys/user>. Дополнительную информацию смотрите в B<namespaces>(7).

source: The calling process did not have the required privileges for this operation.
ru: Вызывающий процесс не имеет требуемых привилегий для этой операции.

source: B<CLONE_NEWUSER> was specified in I<flags>, but either the effective user ID or the effective group ID of the caller does not have a mapping in the parent namespace (see B<user_namespaces>(7)).
ru: Флаг B<CLONE_NEWUSER> указан в I<flags>, но эффективный пользовательский ID или эффективный ID группы вызывающего не отображён в родительское пространство имён (смотрите B<user_namespaces>(7)).

source: B<EPERM> (since Linux 3.9)
ru: B<EPERM> (начиная с Linux 3.9)

source: B<CLONE_NEWUSER> was specified in I<flags> and the caller is in a chroot environment (i.e., the caller's root directory does not match the root directory of the mount namespace in which it resides).
ru: В I<flags> был указан флаг B<CLONE_NEWUSER> и вызывающий выполняется в окружении chroot (т. е. корневой каталог вызывающего не совпадает с корневым каталогом пространства имён монтирования, в котором он находится).

source: B<EUSERS> (from Linux 3.11 to Linux 4.8)
ru: B<EUSERS> (Linux 3.11 по Linux 4.8)

source: B<CLONE_NEWUSER> was specified in I<flags>, and the limit on the number of nested user namespaces would be exceeded. See the discussion of the B<ENOSPC> error above.
ru: Флаг B<CLONE_NEWUSER> указан в I<flags>, и вызов привёл бы к превышению ограничения на количество вложенных пользовательских пространств имён. Смотрите описание ошибки B<ENOSPC>, представленное выше.

source: The B<unshare>() system call was added to Linux in kernel 2.6.16.
ru: Системный вызов B<unshare>() был добавлен в ядро Linux версии 2.6.16.

source: The B<unshare>() system call is Linux-specific.
ru: Системный вызов B<unshare>() есть только в Linux.

source: Not all of the process attributes that can be shared when a new process is created using B<clone>(2) can be unshared using B<unshare>(). In particular, as at kernel 3.8, B<unshare>() does not implement flags that reverse the effects of B<CLONE_SIGHAND>, B<CLONE_THREAD>, or B<CLONE_VM>. Such functionality may be added in the future, if required.
ru: Не все атрибуты процесса, которые могут использоваться совместно при создании нового процесса с помощью B<clone>(2), могут быть отделены с помощью B<unshare>(). В частности, начиная с ядра 3.8 в B<unshare>() не реализована поддержка флагов, которые были имели обратное действие B<CLONE_SIGHAND>, B<CLONE_THREAD> или B<CLONE_VM>. Эти возможности могут быть добавлены позднее, если потребуется.

source: The program below provides a simple implementation of the B<unshare>(1) command, which unshares one or more namespaces and executes the command supplied in its command-line arguments. Here's an example of the use of this program, running a shell in a new mount namespace, and verifying that the original shell and the new shell are in separate mount namespaces:
ru: Программа, представленная далее, предоставляет простую реализацию команды B<unshare>(1), которая отключает использование одного или более пространств имён и выполняет команду, переданную в аргументах командной строки. Вот пример использования этой программы; запускается оболочка в новом пространстве имён монтирования и проверяется, что первоначальная оболочка и новая оболочка находятся в разных пространствах имён монтирования:

source: The differing output of the two B<readlink>(1) commands shows that the two shells are in different mount namespaces.
ru: Различающийся вывод двух команд B<readlink>(1) показывает, что две оболочки находятся в разных пространствах имён монтирования.

source: A simple implementation of the unshare(1) command: unshare namespaces and execute a command. */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdio.hE<gt>
ru: Простая реализация команды unshare(1): отключение от пространств имён и выполнение команды. */ #define _GNU_SOURCE #include E<lt>sched.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdio.hE<gt>

source: static void usage(char *pname) { fprintf(stderr, "Usage: %s [options] program [arg...]\en", pname); fprintf(stderr, "Options can be:\en"); fprintf(stderr, " -i unshare IPC namespace\en"); fprintf(stderr, " -m unshare mount namespace\en"); fprintf(stderr, " -n unshare network namespace\en"); fprintf(stderr, " -p unshare PID namespace\en"); fprintf(stderr, " -u unshare UTS namespace\en"); fprintf(stderr, " -U unshare user namespace\en"); exit(EXIT_FAILURE); }
ru: static void usage(char *pname) { fprintf(stderr, "Использование: %s [параметры] программа [аргументы…]\en", pname); fprintf(stderr, "Параметры:\en"); fprintf(stderr, " -i отключиться от пространства имён IPC\en"); fprintf(stderr, " -m отключиться от пространства имён монтирования\en"); fprintf(stderr, " -n отключиться от сетевого пространства имён\en"); fprintf(stderr, " -p отключиться от пространства имён PID\en"); fprintf(stderr, " -u отключиться от пространства имён UTS\en"); fprintf(stderr, " -U отключиться от пользовательского пространства имён\en"); exit(EXIT_FAILURE); }

source: I<Documentation/userspace-api/unshare.rst> in the Linux kernel source tree (or I<Documentation/unshare.txt> before Linux 4.12)
ru: Файл I<Documentation/userspace-api/unshare.rst> из дерева исходного кода ядра Linux (или I<Documentation/unshare.txt> до Linux 4.12)

source: ustat - get filesystem statistics
ru: ustat - получить статистику по файловой системе

source: B<ustat>() returns information about a mounted filesystem. I<dev> is a device number identifying a device containing a mounted filesystem. I<ubuf> is a pointer to a I<ustat> structure that contains the following members:
ru: B<ustat>() возвращает информацию о смонтированной файловой системе. В I<dev> указывается номер, который идентифицирует устройство, содержащее нужную файловую систему. Аргумент I<ubuf> является указателем на структуру I<ustat>, которая имеет следующий вид:

source: daddr_t f_tfree; /* Total free blocks */ ino_t f_tinode; /* Number of free inodes */ char f_fname[6]; /* Filsys name */ char f_fpack[6]; /* Filsys pack name */
ru: daddr_t f_tfree; /* всего свободных блоков */ ino_t f_tinode; /* количество свободных индексных дескрипторов */ char f_fname[6]; /* имя Filsys */ char f_fpack[6]; /* имя Filsys pack */

source: The last two fields, I<f_fname> and I<f_fpack>, are not implemented and will always be filled with null bytes (\(aq\e0\(aq).
ru: Обработка последних двух полей, I<f_fname> и I<f_fpack>, не реализована, и они всегда будут заполнены нулевыми символами (\(aq\e0\(aq).

source: On success, zero is returned and the I<ustat> structure pointed to by I<ubuf> will be filled in. On error, -1 is returned, and I<errno> is set appropriately.
ru: В случае успешного завершения возвращается ноль и структура I<ustat>, на которую указывает I<ubuf>, будет заполнена значениями. В случае ошибки возвращается -1, а значение I<errno> устанавливается соответствующим образом.

source: I<ubuf> points outside of your accessible address space.
ru: I<ubuf> указывает за пределы доступного адресного пространства.

source: I<dev> does not refer to a device containing a mounted filesystem.
ru: I<dev> не указывает на устройство, содержащее смонтированную файловую систему.

source: The mounted filesystem referenced by I<dev> does not support this operation, or any version of Linux before 1.3.16.
ru: Смонтированная файловая система, на которую ссылается I<dev>, не поддерживает данную операцию или версия Linux меньше, чем 1.3.16.

source: Since version 2.28, glibc no longer provides a wrapper for this system call.
ru: Начиная с версии 2.28, в glibc удалена обёрточная функция этого устаревшего системного вызова.

source: B<ustat>() is deprecated and has been provided only for compatibility. All new programs should use B<statfs>(2) instead.
ru: Вызов B<ustat>() устарел и предоставляется только для совместимости. Во всех новых программах вместо него нужно использовать вызов B<statfs>(2).

source: HP-UX notes
ru: Замечания, касающиеся HP-UX

source: The HP-UX version of the I<ustat> structure has an additional field, I<f_blksize>, that is unknown elsewhere. HP-UX warns: For some filesystems, the number of free inodes does not change. Such filesystems will return -1 in the field I<f_tinode>. For some filesystems, inodes are dynamically allocated. Such filesystems will return the current number of free inodes.
ru: Версия структуры I<ustat> в HP-UX содержит дополнительное поле I<f_blksize>, которого в других версиях нет. HP предупреждает: в некоторых файловых системах количество свободных индексных дескрипторов (inodes) не изменяется. Для таких файловых систем в поле I<f_tinode> возвращается значение -1. В некоторых файловых системах индексные дескрипторы выделяются динамически. Для таких файловых систем будет возвращено текущее количество свободных индексных дескрипторов.

source: utime, utimes - change file last access and modification times
ru: utime, utimes - изменить последнее время доступа и изменения к inode

source: B<Note:> modern applications may prefer to use the interfaces described in B<utimensat>(2).
ru: B<Замечание:> современным приложениям лучше использовать интерфейсы, описанные в B<utimensat>(2).

source: The B<utime>() system call changes the access and modification times of the inode specified by I<filename> to the I<actime> and I<modtime> fields of I<times> respectively.
ru: Системный вызов B<utime>() изменяет время доступа и изменения у inode, указанного в I<filename> на значения полей I<actime> и I<modtime> из структуры I<times>, соответственно.

source: If I<times> is NULL, then the access and modification times of the file are set to the current time.
ru: Если значение I<times> равно NULL, то время доступа и изменения файла устанавливаются в текущее время.

source: Changing timestamps is permitted when: either the process has appropriate privileges, or the effective user ID equals the user ID of the file, or I<times> is NULL and the process has write permission for the file.
ru: Изменение временных меток разрешено если: процесс имеет соответствующие права или эффективный пользовательский идентификатор равен пользовательскому идентификатору файла, или значение I<times> равно NULL и процесс имеет права на запись в файл.

source: The I<utimbuf> structure is:
ru: Структура I<utimbuf> выглядит так:

source: struct utimbuf { time_t actime; /* access time */ time_t modtime; /* modification time */ };
ru: struct utimbuf { time_t actime; /* время доступа */ time_t modtime; /* время изменения */ };

source: The B<utime>() system call allows specification of timestamps with a resolution of 1 second.
ru: Системный вызов B<utime>() позволяет указывать временные метки с точностью до 1 секунды.

source: The B<utimes>() system call is similar, but the I<times> argument refers to an array rather than a structure. The elements of this array are I<timeval> structures, which allow a precision of 1 microsecond for specifying timestamps. The I<timeval> structure is:
ru: Системный вызов B<utimes>() выполняет подобное действие, но аргумент I<times> указывает на массив, а не на структуру. Элементы массива представляют собой структуры I<timeval>, с помощью которых можно указывать временные метки с точностью до 1 микросекунды . Структура I<timeval>:

source: struct timeval { long tv_sec; /* seconds */ long tv_usec; /* microseconds */ };
ru: struct timeval { long tv_sec; /* секунды */ long tv_usec; /* микросекунды */ };
