Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: If multiple events are available and the supplied buffer is large enough, B<read>(2) returns as many events as will fit in the supplied buffer. If the buffer supplied to B<read>(2) is smaller than the size of the I<uffd_msg> structure, the B<read>(2) fails with the error B<EINVAL>.
ru: Если доступно несколько событий и переданный буфер достаточного размера, то B<read>(2) возвращает столько событий сколько влезает в буфер. Если буфер, указанный B<read>(2), меньше размера структуры I<uffd_msg>, то B<read>(2) завершается ошибкой B<EINVAL>.

source: The fields set in the I<uffd_msg> structure are as follows:
ru: Поля структуры I<uffd_msg>:

source: The type of event. Depending of the event type, different fields of the I<arg> union represent details required for the event processing. The non-page-fault events are generated only when appropriate feature is enabled during API handshake with B<UFFDIO_API> B<ioctl>(2).
ru: Тип события. Тип события влияет на заполняемые поля объединения I<arg>, представляющего детали, требуемые для обработки события. События, не относящиеся к страничным ошибкам, генерируются только когда включено соответствующее свойство при согласовании программного интерфейса с помощью операции B<UFFDIO_API> вызова B<ioctl>(2).

source: The following values can appear in the I<event> field:
ru: В поле I<event> могут появляться следующие значения:

source: B<UFFD_EVENT_PAGEFAULT> (since Linux 4.3)
ru: B<UFFD_EVENT_PAGEFAULT> (начиная с Linux 4.3)

source: A page-fault event. The page-fault details are available in the I<pagefault> field.
ru: Событие страничной ошибки. Детали ошибки доступны в поле I<pagefault>.

source: B<UFFD_EVENT_FORK> (since Linux 4.11)
ru: B<UFFD_EVENT_FORK> (начиная с Linux 4.11)

source: Generated when the faulting process invokes B<fork>(2) (or B<clone>(2) without the B<CLONE_VM> flag). The event details are available in the I<fork> field.
ru: Генерируется, когда процесс с ошибкой вызывает B<fork>(2) (или B<clone>(2) без флага B<CLONE_VM>). Детали ошибки доступны в поле I<fork>.

source: B<UFFD_EVENT_REMAP> (since Linux 4.11)
ru: B<UFFD_EVENT_REMAP> (начиная с Linux 4.11)

source: Generated when the faulting process invokes B<mremap>(2). The event details are available in the I<remap> field.
ru: Генерируется, когда процесс с ошибкой вызывает B<mremap>(2). Детали ошибки доступны в поле I<remap>.

source: B<UFFD_EVENT_REMOVE> (since Linux 4.11)
ru: B<UFFD_EVENT_REMOVE> (начиная с Linux 4.11)

source: Generated when the faulting process invokes B<madvise>(2) with B<MADV_DONTNEED> or B<MADV_REMOVE> advice. The event details are available in the I<remove> field.
ru: Генерируется, когда процесс с ошибкой вызывает B<madvise>(2) с советом B<MADV_DONTNEED> или B<MADV_REMOVE>. Детали ошибки доступны в поле I<remove>.

source: B<UFFD_EVENT_UNMAP> (since Linux 4.11)
ru: B<UFFD_EVENT_UNMAP> (начиная с Linux 4.11)

source: Generated when the faulting process unmaps a memory range, either explicitly using B<munmap>(2) or implicitly during B<mmap>(2) or B<mremap>(2). The event details are available in the I<remove> field.
ru: Генерируется, когда процесс с ошибкой отменяет проецирование диапазона памяти явным образом с помощью B<munmap>(2) или неявно при вызове B<mmap>(2) или B<mremap>(2). Детали ошибки доступны в поле I<remove>.

source: The address that triggered the page fault.
ru: Адрес, из-за которого возникла страничная ошибка.

source: A bit mask of flags that describe the event. For B<UFFD_EVENT_PAGEFAULT>, the following flag may appear:
ru: Битовая маска флагов, описывающих событие. Для B<UFFD_EVENT_PAGEFAULT> может появляться следующий флаг:

source: If the address is in a range that was registered with the B<UFFDIO_REGISTER_MODE_MISSING> flag (see B<ioctl_userfaultfd>(2)) and this flag is set, this a write fault; otherwise it is a read fault.
ru: Если адрес в диапазоне, который был зарегистрирован с флагом B<UFFDIO_REGISTER_MODE_MISSING> (смотрите B<ioctl_userfaultfd>(2)) и этот флаг установлен, то это ошибка записи; в противном случае это ошибка чтения.

source: The file descriptor associated with the userfault object created for the child created by B<fork>(2).
ru: С помощью B<fork>(2) был создан потомок, для которого был создан файловый дескриптор, связанный с объектом userfault.

source: The original address of the memory range that was remapped using B<mremap>(2).
ru: Первоначальный адрес диапазона памяти, который был переотображён с помощью B<mremap>(2).

source: The new address of the memory range that was remapped using B<mremap>(2).
ru: Новый адрес диапазона памяти, который был переотображён с помощью B<mremap>(2).

source: The original length of the memory range that was remapped using B<mremap>(2).
ru: Первоначальный размер диапазона памяти, который был переотображён с помощью B<mremap>(2).

source: The start address of the memory range that was freed using B<madvise>(2) or unmapped
ru: Начальный адрес диапазона памяти, который был освобождён с помощью B<madvise>(2) или было отменено проецирование.

source: The end address of the memory range that was freed using B<madvise>(2) or unmapped
ru: Конечный адрес диапазона памяти, который был освобождён с помощью B<madvise>(2) или было отменено проецирование.

source: A B<read>(2) on a userfaultfd file descriptor can fail with the following errors:
ru: Вызов B<read>(2) с файловым дескриптором userfaultfd может завершиться следующими ошибками:

source: The userfaultfd object has not yet been enabled using the B<UFFDIO_API> B<ioctl>(2) operation
ru: Объект userfaultfd не был включён с помощью операции B<UFFDIO_API> вызова B<ioctl>(2).

source: If the B<O_NONBLOCK> flag is enabled in the associated open file description, the userfaultfd file descriptor can be monitored with B<poll>(2), B<select>(2), and B<epoll>(7). When events are available, the file descriptor indicates as readable. If the B<O_NONBLOCK> flag is not enabled, then B<poll>(2) (always) indicates the file as having a B<POLLERR> condition, and B<select>(2) indicates the file descriptor as both readable and writable.
ru: Если в связанном открытом файловом описании указан флаг B<O_NONBLOCK>, то файловый дескриптор userfaultfd можно отслеживать с помощью B<poll>(2), B<select>(2) и B<epoll>(7). При возникновении событий, файловый дескриптор помечается как доступный на чтение. Если флаг B<O_NONBLOCK> не задан, то B<poll>(2) (всегда) показывает, что файл находится в состоянии B<POLLERR>, а B<select>(2) показывает, что файловый дескриптор доступен на чтение и запись.

source: On success, B<userfaultfd>() returns a new file descriptor that refers to the userfaultfd object. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<userfaultfd>() возвращает новый файловый дескриптор, который ссылается на объект userfaultfd. При ошибке возвращается -1, и I<errno> изменяется соответствующим образом.

source: An unsupported value was specified in I<flags>.
ru: В I<flags> указано неподдерживаемое значение.

source: The per-process limit on the number of open file descriptors has been reached
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: Insufficient kernel memory was available.
ru: Недостаточное количество памяти ядра.

source: The B<userfaultfd>() system call first appeared in Linux 4.3.
ru: Системный вызов B<userfaultfd>() впервые появился в Linux 4.3.

source: The support for hugetlbfs and shared memory areas and non-page-fault events was added in Linux 4.11
ru: Поддержка hugetlbfs и общих областей памяти, а также событий, не относящихся к страничным ошибкам, была добавлена в Linux 4.11.

source: B<userfaultfd>() is Linux-specific and should not be used in programs intended to be portable.
ru: Вызов B<userfaultfd>() есть только в Linux и поэтому не должен использоваться в программах, предназначенных для переноса на другие платформы.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2).
ru: В glibc нет обёртки для данного системного вызова; запускайте его с помощью B<syscall>(2).

source: The userfaultfd mechanism can be used as an alternative to traditional user-space paging techniques based on the use of the B<SIGSEGV> signal and B<mmap>(2). It can also be used to implement lazy restore for checkpoint/restore mechanisms, as well as post-copy migration to allow (nearly) uninterrupted execution when transferring virtual machines and Linux containers from one host to another.
ru: Механизм userfaultfd может быть использован как альтернатива обычному страничному делению пользовательского пространства на основе использования сигнала B<SIGSEGV> и B<mmap>(2). Также он может быть использован для реализации отложенного (lazy) восстановления checkpoint/restore mechanisms, as well as post-copy migration to allow (почти) не прерываемого выполнения при переносе виртуальных машин и контейнеров Linux с одного узла на другой.

source: If the B<UFFD_FEATURE_EVENT_FORK> is enabled and a system call from the B<fork>(2) family is interrupted by a signal or failed, a stale userfaultfd descriptor might be created. In this case, a spurious B<UFFD_EVENT_FORK> will be delivered to the userfaultfd monitor.
ru: Если указано B<UFFD_FEATURE_EVENT_FORK> и системный вызов из семейства B<fork>(2) прерывается по сигналу или завершается ошибкой, то может быть создан повисший дескриптор userfaultfd. В этом случае программе слежения за userfaultfd может быть доставлен ложный B<UFFD_EVENT_FORK>.

source: The program below demonstrates the use of the userfaultfd mechanism. The program creates two threads, one of which acts as the page-fault handler for the process, for the pages in a demand-page zero region created using B<mmap>(2).
ru: Программа, представленная далее, показывает использование механизма userfaultfd. Она создаёт две нити, одна служит обработчиком страничных ошибок процесса для страниц в режиме выделения при необходимости, созданных B<mmap>(2).

source: The program takes one command-line argument, which is the number of pages that will be created in a mapping whose page faults will be handled via userfaultfd. After creating a userfaultfd object, the program then creates an anonymous private mapping of the specified size and registers the address range of that mapping using the B<UFFDIO_REGISTER> B<ioctl>(2) operation. The program then creates a second thread that will perform the task of handling page faults.
ru: Программа имеет один параметр командной строки, определяющий количество страниц, которые будут созданы в отображении, чьи страничные ошибки будут обработаны userfaultfd. После создания объекта userfaultfd программа создаёт анонимное частное отображение указанного размера и регистрирует адресный диапазон отображения с помощью операции B<UFFDIO_REGISTER> вызовом B<ioctl>(2). После этого программа создаёт вторую нить, которая будет выполнять задачу по обработке страничных ошибок.

source: The main thread then walks through the pages of the mapping fetching bytes from successive pages. Because the pages have not yet been accessed, the first access of a byte in each page will trigger a page-fault event on the userfaultfd file descriptor.
ru: После этого главная нить обходит страницы отображения запрашивая байты следующей страницы. Так как к страницам ещё не обращались, первый доступ к байту в каждой странице будет вызывать событие страничной ошибки в файловом дескрипторе userfaultfd.

source: Each of the page-fault events is handled by the second thread, which sits in a loop processing input from the userfaultfd file descriptor. In each loop iteration, the second thread first calls B<poll>(2) to check the state of the file descriptor, and then reads an event from the file descriptor. All such events should be B<UFFD_EVENT_PAGEFAULT> events, which the thread handles by copying a page of data into the faulting region using the B<UFFDIO_COPY> B<ioctl>(2) operation.
ru: Каждое событие страничной ошибки обрабатывается второй нитью, которая выполняет цикл обработки ввода из файлового дескриптора userfaultfd. При каждом проходе цикла вторая нить сначала вызывает B<poll>(2) для проверки состояния файлового дескриптора, затем читает событие из файлового дескриптора. Все события должны быть B<UFFD_EVENT_PAGEFAULT>, для их обработки нить копирует страницу данных в ошибочную область с помощью операции B<UFFDIO_COPY> вызова B<ioctl>(2).

source: The following is an example of what we see when running the program:
ru: Результат работы программы:

source: $ B<./userfaultfd_demo 3> Address returned by mmap() = 0x7fd30106c000
ru: $ B<./userfaultfd_demo 3> Адрес, возвращённый mmap() = 0x7fd30106c000

source: fault_handler_thread(): poll() returns: nready = 1; POLLIN = 1; POLLERR = 0 UFFD_EVENT_PAGEFAULT event: flags = 0; address = 7fd30106c00f (uffdio_copy.copy returned 4096) Read address 0x7fd30106c00f in main(): A Read address 0x7fd30106c40f in main(): A Read address 0x7fd30106c80f in main(): A Read address 0x7fd30106cc0f in main(): A
ru: fault_handler_thread(): poll() вернул: nready = 1; POLLIN = 1; POLLERR = 0 событие UFFD_EVENT_PAGEFAULT: флаги = 0; адрес = 7fd30106c00f (uffdio_copy.copy равно 4096) Чтение по адресу 0x7fd30106c00f в main(): A Чтение по адресу 0x7fd30106c40f в main(): A Чтение по адресу 0x7fd30106c80f в main(): A Чтение по адресу 0x7fd30106cc0f в main(): A

source: fault_handler_thread(): poll() returns: nready = 1; POLLIN = 1; POLLERR = 0 UFFD_EVENT_PAGEFAULT event: flags = 0; address = 7fd30106d00f (uffdio_copy.copy returned 4096) Read address 0x7fd30106d00f in main(): B Read address 0x7fd30106d40f in main(): B Read address 0x7fd30106d80f in main(): B Read address 0x7fd30106dc0f in main(): B
ru: fault_handler_thread(): poll() вернул: nready = 1; POLLIN = 1; POLLERR = 0 событие UFFD_EVENT_PAGEFAULT: флаги = 0; адрес = 7fd30106d00f (uffdio_copy.copy равно 4096) Чтение по адресу 0x7fd30106d00f в main(): B Чтение по адресу 0x7fd30106d40f в main(): B Чтение по адресу 0x7fd30106d80f в main(): B Чтение по адресу 0x7fd30106dc0f в main(): B

source: fault_handler_thread(): poll() returns: nready = 1; POLLIN = 1; POLLERR = 0 UFFD_EVENT_PAGEFAULT event: flags = 0; address = 7fd30106e00f (uffdio_copy.copy returned 4096) Read address 0x7fd30106e00f in main(): C Read address 0x7fd30106e40f in main(): C Read address 0x7fd30106e80f in main(): C Read address 0x7fd30106ec0f in main(): C
ru: fault_handler_thread(): poll() вернул: nready = 1; POLLIN = 1; POLLERR = 0 событие UFFD_EVENT_PAGEFAULT: флаги = 0; адрес = 7fd30106e00f (uffdio_copy.copy равно 4096) Чтение по адресу 0x7fd30106e00f в main(): C Чтение по адресу 0x7fd30106e40f в main(): C Чтение по адресу 0x7fd30106e80f в main(): C Чтение по адресу 0x7fd30106ec0f в main(): C

source: Licensed under the GNU General Public License version 2 or later. */ #define _GNU_SOURCE #include E<lt>sys/types.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>linux/userfaultfd.hE<gt> #include E<lt>pthread.hE<gt> #include E<lt>errno.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>poll.hE<gt> #include E<lt>string.hE<gt> #include E<lt>sys/mman.hE<gt> #include E<lt>sys/syscall.hE<gt> #include E<lt>sys/ioctl.hE<gt> #include E<lt>poll.hE<gt>
ru: распространяется по лицензии GNU General Public License version 2 и новее. */ #define _GNU_SOURCE #include E<lt>sys/types.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>linux/userfaultfd.hE<gt> #include E<lt>pthread.hE<gt> #include E<lt>errno.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>signal.hE<gt> #include E<lt>poll.hE<gt> #include E<lt>string.hE<gt> #include E<lt>sys/mman.hE<gt> #include E<lt>sys/syscall.hE<gt> #include E<lt>sys/ioctl.hE<gt> #include E<lt>poll.hE<gt>

source: static void * fault_handler_thread(void *arg) { static struct uffd_msg msg; /* Data read from userfaultfd */ static int fault_cnt = 0; /* Number of faults so far handled */ long uffd; /* userfaultfd file descriptor */ static char *page = NULL; struct uffdio_copy uffdio_copy; ssize_t nread;
ru: static void * fault_handler_thread(void *arg) { static struct uffd_msg msg; /* данные, прочитанные из userfaultfd */ static int fault_cnt = 0; /* количество обработанных ошибок */ long uffd; /* файловый дескриптор userfaultfd */ static char *page = NULL; struct uffdio_copy uffdio_copy; ssize_t nread;

source: /* Create a page that will be copied into the faulting region */
ru: /* создаём страницу, которая будет копироваться в ошибочную область */

source: /* Loop, handling incoming events on the userfaultfd file descriptor */
ru: /* циклически обрабатываем входные сообщения в файловом дескрипторе userfaultfd */

source: /* See what poll() tells us about the userfaultfd */
ru: /* С помощью poll() проверяем userfaultfd */

source: printf("\enfault_handler_thread():\en"); printf(" poll() returns: nready = %d; " "POLLIN = %d; POLLERR = %d\en", nready, (pollfd.revents & POLLIN) != 0, (pollfd.revents & POLLERR) != 0);
ru: printf("\enfault_handler_thread():\en"); printf(" poll() вернул: nready = %d; " "POLLIN = %d; POLLERR = %d\en", nready, (pollfd.revents & POLLIN) != 0, (pollfd.revents & POLLERR) != 0);

source: /* Read an event from the userfaultfd */
ru: /* читаем событие из userfaultfd */

source: nread = read(uffd, &msg, sizeof(msg)); if (nread == 0) { printf("EOF on userfaultfd!\en"); exit(EXIT_FAILURE); }
ru: nread = read(uffd, &msg, sizeof(msg)); if (nread == 0) { printf("EOF в userfaultfd!\en"); exit(EXIT_FAILURE); }

source: /* We expect only one kind of event; verify that assumption */
ru: /* ожидаем только один тип событий; проверяем, что это так */

source: if (msg.event != UFFD_EVENT_PAGEFAULT) { fprintf(stderr, "Unexpected event on userfaultfd\en"); exit(EXIT_FAILURE); }
ru: if (msg.event != UFFD_EVENT_PAGEFAULT) { fprintf(stderr, "Неожидаемый тип события в userfaultfd\en"); exit(EXIT_FAILURE); }

source: /* Display info about the page-fault event */
ru: /* показываем информацию о событии страничной ошибки */

source: printf(" UFFD_EVENT_PAGEFAULT event: "); printf("flags = %llx; ", msg.arg.pagefault.flags); printf("address = %llx\en", msg.arg.pagefault.address);
ru: printf(" событие UFFD_EVENT_PAGEFAULT: "); printf("флаги = %llx; ", msg.arg.pagefault.flags); printf("адрес = %llx\en", msg.arg.pagefault.address);

source: /* Copy the page pointed to by \(aqpage\(aq into the faulting region. Vary the contents that are copied in, so that it is more obvious that each fault is handled separately. */
ru: /* копируем страницу, на которую указывает \(aqpage\(aq, в ошибочную область. Меняем содержимое, которое копируем для того, чтобы было более очевидно, что каждая ошибка обрабатывается отдельно. */

source: /* We need to handle page faults in units of pages(!). So, round faulting address down to page boundary */
ru: /* мы должны обрабатывать страничные ошибки в единицах страниц(!). поэтому округляем адрес ошибки по нижней границы страницы */

source: printf(" (uffdio_copy.copy returned %lld)\en", uffdio_copy.copy); } }
ru: printf(" (uffdio_copy.copy равно %lld)\en", uffdio_copy.copy); } }

source: int main(int argc, char *argv[]) { long uffd; /* userfaultfd file descriptor */ char *addr; /* Start of region handled by userfaultfd */ unsigned long len; /* Length of region handled by userfaultfd */ pthread_t thr; /* ID of thread that handles page faults */ struct uffdio_api uffdio_api; struct uffdio_register uffdio_register; int s;
ru: int main(int argc, char *argv[]) { long uffd; /* файловый дескриптор userfaultfd */ char *addr; /* Начало области, обрабатываемое userfaultfd */ unsigned long len; /* Размер области, обрабатываемой userfaultfd */ pthread_t thr; /* ID нити, обрабатывающей страничные ошибки */ struct uffdio_api uffdio_api; struct uffdio_register uffdio_register; int s;

source: if (argc != 2) { fprintf(stderr, "Usage: %s num-pages\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s количество-страниц\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Create and enable userfaultfd object */
ru: /* создаём и включаем объект userfaultfd */

source: /* Create a private anonymous mapping. The memory will be demand-zero paged--that is, not yet allocated. When we actually touch the memory, it will be allocated via the userfaultfd. */
ru: /* Копируем частное анонимное отображение. Память будет выделена по требованию, то есть реально не выделяется. Когда мы обратимся к памяти, она будет выделена с помощью userfaultfd. */

source: printf("Address returned by mmap() = %p\en", addr);
ru: printf("Адрес, возвращённый mmap() = %p\en", addr);

source: /* Register the memory range of the mapping we just created for handling by the userfaultfd object. In mode, we request to track missing pages (i.e., pages that have not yet been faulted in). */
ru: /* Регистрируем в объекте userfaultfd область памяти отображения которое мы только что создали. Запрашиваем режим слежения за отсутствующими страницами (т. е., которые пока не были заполнены). */

source: /* Create a thread that will process the userfaultfd events */
ru: /* Создаём нить, которая будет обрабатывать события userfaultfd */

source: /* Main thread now touches memory in the mapping, touching locations 1024 bytes apart. This will trigger userfaultfd events for all pages in the region. */
ru: /* Теперь главная нить обращается к памяти в отображении c интервалом в 1024 байта. Это создаст события в userfaultfd для всех страниц в области. */

source: int l; l = 0xf; /* Ensure that faulting address is not on a page boundary, in order to test that we correctly handle that case in fault_handling_thread() */ while (l E<lt> len) { char c = addr[l]; printf("Read address %p in main(): ", addr + l); printf("%c\en", c); l += 1024; usleep(100000); /* Slow things down a little */ }
ru: int l; l = 0xf; /* Гарантируем, что ошибочный адрес не на границе страницы, чтобы протестировать что, мы правильно обрабатываем этот случай в fault_handling_thread() */ while (l E<lt> len) { char c = addr[l]; printf("Чтение по адресу %p в main(): ", addr + l); printf("%c\en", c); l += 1024; usleep(100000); /* замедлим программу */ }

source: I<Documentation/admin-guide/mm/userfaultfd.rst> in the Linux kernel source tree
ru: Файл I<Documentation/admin-guide/mm/userfaultfd.rst> из дерева исходного кода ядра Linux

source: umount, umount2 - unmount filesystem
ru: umount, umount2 - размонтирует файловую систему

source: B<umount>() and B<umount2>() remove the attachment of the (topmost) filesystem mounted on I<target>.
ru: Вызовы B<umount>() и B<umount2>() удаляют подключение (самого верхнего уровня) к файловой системе, примонтированной к I<target>.

source: Appropriate privilege (Linux: the B<CAP_SYS_ADMIN> capability) is required to unmount filesystems.
ru: Для размонтирования файловых систем требуются права (Linux: мандат B<CAP_SYS_ADMIN>).

source: Linux 2.1.116 added the B<umount2>() system call, which, like B<umount>(), unmounts a target, but allows additional I<flags> controlling the behavior of the operation:
ru: В Linux 2.1.116 добавлен системный вызов B<umount2>(), который, подобно B<umount>(), размонтирует заданный объект, но позволяет указать дополнительные флаги I<flags>, контролирующие поведение операции:

source: B<MNT_FORCE> (since Linux 2.1.116)
ru: B<MNT_FORCE> (начиная с Linux 2.1.116)
