Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: The I<uid_map> file exposes the mapping of user IDs from the user namespace of the process I<pid> to the user namespace of the process that opened I<uid_map> (but see a qualification to this point below). In other words, processes that are in different user namespaces will potentially see different values when reading from a particular I<uid_map> file, depending on the user ID mappings for the user namespaces of the reading processes.
ru: Файл I<uid_map> предоставляет отображение пользовательских ID из пользовательского пространства имён процесса I<pid> в пользовательское пространство имён процесса, который открыл I<uid_map> (но смотрите уточнение далее). Другими словами, процессы, которые находятся в разных пользовательских пространствах имён, возможно будут видеть разные значения при чтении соответствующего файла I<uid_map>, в зависимости от отображений пользовательских ID у пользовательских пространств имён читающего процесса.

source: Each line in the I<uid_map> file specifies a 1-to-1 mapping of a range of contiguous user IDs between two user namespaces. (When a user namespace is first created, this file is empty.) The specification in each line takes the form of three numbers delimited by white space. The first two numbers specify the starting user ID in each of the two user namespaces. The third number specifies the length of the mapped range. In detail, the fields are interpreted as follows:
ru: Каждая строка в файле I<uid_map> определяет отображение 1-в-1 непрерывного диапазона пользовательских ID между двумя пользовательскими пространствами имён (при создании пользовательского пространства имён этот файл пуст). В каждой строке содержится три числа через пробел. Первые два числа определяют начальный пользовательский ID в каждом из двух пользовательских пространств имён. Третье число определяет длину отображаемого диапазона. Эти поля рассматриваются так:

source: The start of the range of user IDs in the user namespace of the process I<pid>.
ru: Начало диапазона пользовательских ID в пользовательском пространстве имён процесса I<pid>.

source: The start of the range of user IDs to which the user IDs specified by field one map. How field two is interpreted depends on whether the process that opened I<uid_map> and the process I<pid> are in the same user namespace, as follows:
ru: Начало диапазона пользовательских ID, на который отображаются пользовательские ID, указанные в первом поле. Интерпретация второго поля зависит от того, находится ли процесс, открывший I<uid_map>, и процесс I<pid>, в одном пользовательском пространстве имён:

source: a)
ru: а)

source: If the two processes are in different user namespaces: field two is the start of a range of user IDs in the user namespace of the process that opened I<uid_map>.
ru: Если два процесса находятся в разных пользовательских пространствах имён: поле два — начало диапазона пользовательских ID в пользовательском пространстве имён процесса, который открыл I<uid_map>.

source: b)
ru: б)

source: If the two processes are in the same user namespace: field two is the start of the range of user IDs in the parent user namespace of the process I<pid>. This case enables the opener of I<uid_map> (the common case here is opening I</proc/self/uid_map>) to see the mapping of user IDs into the user namespace of the process that created this user namespace.
ru: Если два процесса находятся в одном пользовательском пространстве имён: поле два — начало диапазона пользовательских ID в родительском пользовательском пространстве имён процесса I<pid>. Это позволяет открывшему I<uid_map> (обычно открывают I</proc/self/uid_map>) видеть отображение пользовательских ID в пользовательском пространстве имён процесса, создавшего это пользовательское пространство имён.

source: The length of the range of user IDs that is mapped between the two user namespaces.
ru: Длина диапазона пользовательских ID, выполняющего отображение между двумя пользовательскими пространствами имён.

source: System calls that return user IDs (group IDs)\(emfor example, B<getuid>(2), B<getgid>(2), and the credential fields in the structure returned by B<stat>(2)\(emreturn the user ID (group ID) mapped into the caller's user namespace.
ru: Системные вызовы, возвращающие пользовательские ID (ID групп), например, B<getuid>(2), B<getgid>(2), и мандатные поля в структуре, возвращаемой B<stat>(2), возвращают пользовательский ID (ID группы), отображённый в пользовательском пространстве имён вызывающего.

source: When a process accesses a file, its user and group IDs are mapped into the initial user namespace for the purpose of permission checking and assigning IDs when creating a file. When a process retrieves file user and group IDs via B<stat>(2), the IDs are mapped in the opposite direction, to produce values relative to the process user and group ID mappings.
ru: Когда процесс обращается к файлу, его ID пользователя и группы отображаются в начальном пользовательском пространстве имён с целью проверки прав доступа и назначенного ID при создании файла. Когда процесс получает ID пользователя и группы файла через B<stat>(2), то ID отображаются в обратном направлении, для создания значений, относительно отображений ID пользователя и группы процесса.

source: The initial user namespace has no parent namespace, but, for consistency, the kernel provides dummy user and group ID mapping files for this namespace. Looking at the I<uid_map> file (I<gid_map> is the same) from a shell in the initial namespace shows:
ru: Начальное пользовательское пространство имён не имеет родительского пространства имён, но для однородности, для него ядро предоставляет фиктивные файлы отображения ID пользователей и групп. Посмотрим на файл I<uid_map> (в I<gid_map> тоже самое) из оболочки в начальном пространстве имён:

source: This mapping tells us that the range starting at user ID 0 in this namespace maps to a range starting at 0 in the (nonexistent) parent namespace, and the length of the range is the largest 32-bit unsigned integer. This leaves 4294967295 (the 32-bit signed -1 value) unmapped. This is deliberate: I<(uid_t)\ -1> is used in several interfaces (e.g., B<setreuid>(2)) as a way to specify "no user ID". Leaving I<(uid_t)\ -1> unmapped and unusable guarantees that there will be no confusion when using these interfaces.
ru: Данное отображение показывает, что диапазон начинающийся с пользовательского ID 0 в этом пространстве имён, отображается в диапазон, начинающийся, с 0, в (несуществующее) родительское пространство имён, и длина диапазона равна самому большому 32-битному беззнаковому целому. Значение 4294967295 (32-битное знаковое значение -1) оставлено без отображения. Предназначение: I<(uid_t)\ -\1> используется в некоторых интерфейсах (например, B<setreuid>(2)) для указания «отсутствия ID пользователя». Оставление I<(uid_t)\ -\1> без отображения и его не использование гарантирует, что при использовании этих интерфейсов не будет проблем).

source: Defining user and group ID mappings: writing to uid_map and gid_map
ru: Отображение идентификаторов пользователей и групп: запись в uid_map и gid_map

source: After the creation of a new user namespace, the I<uid_map> file of I<one> of the processes in the namespace may be written to I<once> to define the mapping of user IDs in the new user namespace. An attempt to write more than once to a I<uid_map> file in a user namespace fails with the error B<EPERM>. Similar rules apply for I<gid_map> files.
ru: После создания нового пользовательского пространства имён в файл I<uid_map> I<один> из процессов в пространстве имён может выполнить I<однократную> запись для определения отображения пользовательских ID в новом пользовательском пространстве имён. Повторная попытка записи в файл I<uid_map> в пользовательском пространстве имён завершится с ошибкой B<EPERM>. Эти же правила применимы к файлам I<gid_map>.

source: The lines written to I<uid_map> (I<gid_map>) must conform to the following rules:
ru: Записываемые в I<uid_map> (I<gid_map>) строки должны соответствовать следующим правилам:

source: The three fields must be valid numbers, and the last field must be greater than 0.
ru: В трёх полях должны быть корректные числа и последнее поле должно быть больше 0.

source: Lines are terminated by newline characters.
ru: Строки заканчиваются символами новой строки.

source: There is a limit on the number of lines in the file. In Linux 4.14 and earlier, this limit was (arbitrarily) set at 5 lines. Since Linux 4.15, the limit is 340 lines. In addition, the number of bytes written to the file must be less than the system page size, and the write must be performed at the start of the file (i.e., B<lseek>(2) and B<pwrite>(2) can't be used to write to nonzero offsets in the file).
ru: Существует ограничение на количество строк в файле. В Linux 4.14 и старее оно установлено (произвольно) равным пятью строкам. Начиная с Linux 4.14 его значение равно 340 строкам. Также, количество байт, записываемых в файл, должно быть меньше размера системной страницы, и запись должна выполняться в начало файла (т. е., нельзя использовать B<lseek>(2) и B<pwrite>(2) для записи в файл при ненулевом смещении).

source: The range of user IDs (group IDs) specified in each line cannot overlap with the ranges in any other lines. In the initial implementation (Linux 3.8), this requirement was satisfied by a simplistic implementation that imposed the further requirement that the values in both field 1 and field 2 of successive lines must be in ascending numerical order, which prevented some otherwise valid maps from being created. Linux 3.9 and later fix this limitation, allowing any valid set of nonoverlapping maps.
ru: Диапазон пользовательских ID (групповых ID), указанный в каждой строке, не должен перекрываться с диапазонами в других строках. В первой реализации (Linux 3.8) это требование удовлетворялось простейшим способом, который задавал другое требование: значения в полях 1 и 2 следующих одна за одной строк, должны увеличиваться, что не давало создавать некоторые корректные отображения. В Linux 3.9 и новее это ограничение было снято, и допустим любой набор не перекрывающихся отображений.

source: At least one line must be written to the file.
ru: В файл должна быть записана, как минимум, одна строка.

source: Writes that violate the above rules fail with the error B<EINVAL>.
ru: Попытки записи, нарушающие перечисленные выше правила, завершаются с ошибкой B<EINVAL>.

source: In order for a process to write to the I</proc/[pid]/uid_map> (I</proc/[pid]/gid_map>) file, all of the following requirements must be met:
ru: Чтобы процесс мог записывать в файл I</proc/[pid]/uid_map> (I</proc/[pid]/gid_map>) должны быть удовлетворены все условия:

source: The writing process must have the B<CAP_SETUID> (B<CAP_SETGID>) capability in the user namespace of the process I<pid>.
ru: Записывающий процесс должен иметь мандат B<CAP_SETUID> (B<CAP_SETGID>) в пользовательском пространстве имён процесса I<pid>.

source: The writing process must either be in the user namespace of the process I<pid> or be in the parent user namespace of the process I<pid>.
ru: Записывающий процесс должен находиться в пользовательском пространстве имён процесса I<pid> или быть родительским пользовательским пространством имён процесса I<pid>.

source: The mapped user IDs (group IDs) must in turn have a mapping in the parent user namespace.
ru: Отображаемые пользовательские ID (групповые ID) должны иметь соответствующее отображение в родительском пользовательском пространстве имён.

source: One of the following two cases applies:
ru: Применимо к одному из двух случаев:

source: I<Either> the writing process has the B<CAP_SETUID> (B<CAP_SETGID>) capability in the I<parent> user namespace.
ru: I<Или> записывающий процесс имеет мандат B<CAP_SETUID> (B<CAP_SETGID>) в I<родительском> пользовательском пространстве имён.

source: No further restrictions apply: the process can make mappings to arbitrary user IDs (group IDs) in the parent user namespace.
ru: В дальнейшем ограничения не применяются: процесс может создавать отображения в произвольные пользовательские ID (групповые ID) в родительском пользовательском пространстве имён.

source: I<Or> otherwise all of the following restrictions apply:
ru: I<Или> в противном случае накладываются следующие (все) ограничения:

source: The data written to I<uid_map> (I<gid_map>) must consist of a single line that maps the writing process's effective user ID (group ID) in the parent user namespace to a user ID (group ID) in the user namespace.
ru: Данные, записываемые в I<uid_map> (I<gid_map>), должны состоять из одной строки, которая отображает эффективный пользовательский ID (групповой ID) записывающего процесса в родительском пользовательском пространстве имён в пользовательский ID (групповой ID) в пользовательском пространстве имён.

source: The writing process must have the same effective user ID as the process that created the user namespace.
ru: Записывающий процесс должен иметь мандат тот же эффективный пользовательский ID что и процесс, который создал пользовательское пространство имён.

source: In the case of I<gid_map>, use of the B<setgroups>(2) system call must first be denied by writing "I<deny>" to the I</proc/[pid]/setgroups> file (see below) before writing to I<gid_map>.
ru: В случае I<gid_map>, перед записью в I<gid_map> сначала нужно использовать системный B<setgroups>(2) для записи "I<deny>" в файл I</proc/[pid]/setgroups> (смотрите ниже).

source: Writes that violate the above rules fail with the error B<EPERM>.
ru: Попытки записи, нарушающие перечисленные выше правила, завершаются с ошибкой B<EPERM>.

source: Interaction with system calls that change process UIDs or GIDs
ru: Взаимодействие с системными вызовами, которые изменяют UID или GID процесса.

source: In a user namespace where the I<uid_map> file has not been written, the system calls that change user IDs will fail. Similarly, if the I<gid_map> file has not been written, the system calls that change group IDs will fail. After the I<uid_map> and I<gid_map> files have been written, only the mapped values may be used in system calls that change user and group IDs.
ru: В пользовательском пространстве имён, в котором не выполнялась запись в файл I<uid_map>, системные вызовы, изменяющие ID пользователя, будут завершаться с ошибкой. Подобными образом, если не выполнялась запись в файл I<gid_map>, то системные вызовы, изменяющие ID группы, будут завершаться с ошибкой. После записи в файл I<uid_map> и I<gid_map> только отображённые значения могут использоваться в системных вызовах, изменяющих ID пользователя или группы.

source: For user IDs, the relevant system calls include B<setuid>(2), B<setfsuid>(2), B<setreuid>(2), and B<setresuid>(2). For group IDs, the relevant system calls include B<setgid>(2), B<setfsgid>(2), B<setregid>(2), B<setresgid>(2), and B<setgroups>(2).
ru: Для ID пользователя, это относится к следующим системным вызовам: B<setuid>(2), B<setfsuid>(2), B<setreuid>(2) и B<setresuid>(2). Для ID группы, это относится к следующим системным вызовам: B<setgid>(2), B<setfsgid>(2), B<setregid>(2), B<setresgid>(2) и B<setgroups>(2).

source: Writing "I<deny>" to the I</proc/[pid]/setgroups> file before writing to I</proc/[pid]/gid_map> will permanently disable B<setgroups>(2) in a user namespace and allow writing to I</proc/[pid]/gid_map> without having the B<CAP_SETGID> capability in the parent user namespace.
ru: Запись "I<deny>" в файле I</proc/[pid]/setgroups> перед записью в I</proc/[pid]/gid_map> насовсем отключает B<setgroups>(2) в пользовательском пространстве имён, а также разрешает запись в I</proc/[pid]/gid_map> без мандата B<CAP_SETGID> в родительском пользовательском пространстве имён.

source: The /proc/[pid]/setgroups file
ru: Файл /proc/[pid]/setgroups

source: The I</proc/[pid]/setgroups> file displays the string "I<allow>" if processes in the user namespace that contains the process I<pid> are permitted to employ the B<setgroups>(2) system call; it displays "I<deny>" if B<setgroups>(2) is not permitted in that user namespace. Note that regardless of the value in the I</proc/[pid]/setgroups> file (and regardless of the process's capabilities), calls to B<setgroups>(2) are also not permitted if I</proc/[pid]/gid_map> has not yet been set.
ru: Файл I</proc/[pid]/setgroups> содержит строку "I<allow>", если процессам в пользовательском пространстве имён, которые содержат процесс с I<pid>, разрешено выполнять системный вызов B<setgroups>(2); в файл содержится строка "I<deny>", если B<setgroups>(2) запрещён в этом пользовательском пространстве имён. Заметим, что независимо от значения в файле I</proc/[pid]/setgroups> (и независимо от мандатов процесса) вызовы B<setgroups>(2) также запрещены, если I</proc/[pid]/gid_map> до этого не был настроен.

source: A privileged process (one with the B<CAP_SYS_ADMIN> capability in the namespace) may write either of the strings "I<allow>" or "I<deny>" to this file I<before> writing a group ID mapping for this user namespace to the file I</proc/[pid]/gid_map>. Writing the string "I<deny>" prevents any process in the user namespace from employing B<setgroups>(2).
ru: Привилегированный процесс (с мандатом B<CAP_SYS_ADMIN> в пространстве имён) может записать строку "I<allow>" или "I<deny>" в этот файл I<до> записи отображения ID групп для этого пользовательского пространства имён в файл I</proc/[pid]/gid_map>. Запись строки "I<deny>" запрещает любому процессу в пользовательском пространстве имён выполнять B<setgroups>(2).

source: The essence of the restrictions described in the preceding paragraph is that it is permitted to write to I</proc/[pid]/setgroups> only so long as calling B<setgroups>(2) is disallowed because I</proc/[pid]gid_map> has not been set. This ensures that a process cannot transition from a state where B<setgroups>(2) is allowed to a state where B<setgroups>(2) is denied; a process can transition only from B<setgroups>(2) being disallowed to B<setgroups>(2) being allowed.
ru: Сущность ограничений, описанных в предыдущем абзаце в том, чтобы разрешить запись в I</proc/[pid]/setgroups> только когда запрещено вызывать B<setgroups>(2), так как I</proc/[pid]gid_map> не настроен. Это гарантирует, что процесс не сможет перейти из состояния, в котором B<setgroups>(2) разрешён, в состояние, в котором B<setgroups>(2) запрещён; процесс может переходить только из состояния, когда B<setgroups>(2) запрещён, в состояние, когда B<setgroups>(2) разрешён.

source: The default value of this file in the initial user namespace is "I<allow>".
ru: Значение по умолчанию в этом файле для начального состояния пользовательского пространства имён равно "I<allow>".

source: Once I</proc/[pid]/gid_map> has been written to (which has the effect of enabling B<setgroups>(2) in the user namespace), it is no longer possible to disallow B<setgroups>(2) by writing "I<deny>" to I</proc/[pid]/setgroups> (the write fails with the error B<EPERM>).
ru: После записи в I</proc/[pid]/gid_map> (что действует как разрешение работы B<setgroups>(2) в пользовательском пространстве имён), больше невозможно запретить B<setgroups>(2) записью "I<deny>" в I</proc/[pid]/setgroups> (запись завершается ошибкой B<EPERM>).

source: A child user namespace inherits the I</proc/[pid]/setgroups> setting from its parent.
ru: Дочернее пользовательское пространство имён наследует значение I</proc/[pid]/setgroups> своего родителя.

source: If the I<setgroups> file has the value "I<deny>", then the B<setgroups>(2) system call can't subsequently be reenabled (by writing "I<allow>" to the file) in this user namespace. (Attempts to do so fail with the error B<EPERM>.) This restriction also propagates down to all child user namespaces of this user namespace.
ru: Если файл I<setgroups> содержит значение "I<deny>", то системный вызов B<setgroups>(2) не может быть повторно включён в дальнейшем (записью "I<allow>" в файл) в этом пользовательском пространстве имён (попытка это сделать завершается ошибкой B<EPERM>). Это ограничение также распространяется на всех потомков пользовательского пространства имён этого пользовательского пространства имён.

source: The I</proc/[pid]/setgroups> file was added in Linux 3.19, but was backported to many earlier stable kernel series, because it addresses a security issue. The issue concerned files with permissions such as "rwx---rwx". Such files give fewer permissions to "group" than they do to "other". This means that dropping groups using B<setgroups>(2) might allow a process file access that it did not formerly have. Before the existence of user namespaces this was not a concern, since only a privileged process (one with the B<CAP_SETGID> capability) could call B<setgroups>(2). However, with the introduction of user namespaces, it became possible for an unprivileged process to create a new namespace in which the user had all privileges. This then allowed formerly unprivileged users to drop groups and thus gain file access that they did not previously have. The I</proc/[pid]/setgroups> file was added to address this security issue, by denying any pathway for an unprivileged process to drop groups with B<setgroups>(2).
ru: Файл I</proc/[pid]/setgroups> был добавлен в Linux 3.19, но перенесён и в старшие серии ядра, так как служит для обеспечения безопасности. В частности, это влияет на файлы с правами доступа «rwx---rwx». Эти файлы меньшие права «группе» по сравнению с группой «остальные». Это означает, что удаление группы с помощью B<setgroups>(2) может открыть доступ к файлу, тем которые не имели его. До существования пользовательских пространств имён это не было проблемой, так как только привилегированный процесс (с мандатом B<CAP_SETGID>) мог вызывать B<setgroups>(2). Однако с введение пользовательских пространств имён стало возможным и непривилегированному процессу создавать новое пространство имён, в котором пользователь имеет все права. После этого ранее непривилегированный пользователь может удалить группы и таким образом получить доступ к файлу, которого раньше не имел. Файл I</proc/[pid]/setgroups> был добавлен для решения этой проблемы безопасности; он запрещает непривилегированному процессу удалять группы с помощью B<setgroups>(2).

source: Unmapped user and group IDs
ru: Неотображённые пользовательские и групповые ID

source: There are various places where an unmapped user ID (group ID) may be exposed to user space. For example, the first process in a new user namespace may call B<getuid>(2) before a user ID mapping has been defined for the namespace. In most such cases, an unmapped user ID is converted to the overflow user ID (group ID); the default value for the overflow user ID (group ID) is 65534. See the descriptions of I</proc/sys/kernel/overflowuid> and I</proc/sys/kernel/overflowgid> in B<proc>(5).
ru: Есть несколько мест, где в пользовательском пространстве могут появиться неотображённые пользовательские ID (групповые ID). Например, первый процесс в новом пользовательском пространстве имён может вызвать B<getuid>(2) до определения отображения пользовательских ID для пространства имён. В большинстве случаев, неотображённый пользовательский ID преобразуется в пользовательский ID (групповой ID) переполнения (overflow); значение по умолчанию для пользовательского ID (группового ID) переполнения равно 65534. Смотрите описание I</proc/sys/kernel/overflowuid> и I</proc/sys/kernel/overflowgid> в B<proc>(5).
