Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: There are many different URI schemes, each with specific additional rules and meanings, but they are intentionally made to be as similar as possible. For example, many URL schemes permit the authority to be the following format, called here an I<ip_server> (square brackets show what's optional):
ru: Существует множество различных схем URI, в каждой могут быть свои дополнительные правила и смыслы, но все они создаются максимально похожими друг на друга. Например, многие схемы URL позволяют задавать полномочия в следующем формате, обозначаемом здесь как I<ip_server> (квадратные скобки указывают на необязательность):

source: I<ip_server = >[I<user> [ : I<password> ] @ ] I<host> [ : I<port>]
ru: I<ip_server = >[I<пользователь> [ : I<пароль> ] @ ] I<узел> [ : I<порт>]

source: This format allows you to optionally insert a username, a user plus password, and/or a port number. The I<host> is the name of the host computer, either its name as determined by DNS or an IP address (numbers separated by periods). Thus the URI E<lt>http://fred:fredpassword@example.com:8080/E<gt> logs into a web server on host example.com as fred (using fredpassword) using port 8080. Avoid including a password in a URI if possible because of the many security risks of having a password written down. If the URL supplies a username but no password, and the remote server requests a password, the program interpreting the URL should request one from the user.
ru: Этот формат позволяет указать имя пользователя, его пароль и/или номер порта. I<Узел> — это имя компьютера-узла; он может быть указан в виде имени DNS или IP-адреса (числа через точку). Таким образом, URI E<lt>http://fred:fredpassword@example.com:8080/E<gt> определяется подключение к веб-серверу example.com по порту 8080 пользователем fred (с помощью пароля fredpassword). Желательно в целях безопасности не указывать пароль в URI. Если в URL указано имя пользователя, но нет пароля, а серверу этот пароль требуется, то программа, обрабатывающая URL, должна запросить его у пользователя.

source: Here are some of the most common schemes in use on UNIX-like systems that are understood by many tools. Note that many tools using URIs also have internal schemes or specialized schemes; see those tools' documentation for information on those schemes.
ru: Далее приводятся наиболее распространённые схемы, используемые в UNIX-подобных системах. Заметьте, что многие программы, использующие URI, имеют внутренние или специализированные схемы, поэтому советуем прочитать на них документацию.

source: B<http - Web (HTTP) server>
ru: B<http — веб-сервер (HTTP)>

source: http://I<ip_server>/I<path>
ru: http://I<ip_server>/I<путь>

source: http://I<ip_server>/I<path>?I<query>
ru: http://I<ip_server>/I<путь>?I<запрос>

source: This is a URL accessing a web (HTTP) server. The default port is 80. If the path refers to a directory, the web server will choose what to return; usually if there is a file named "index.html" or "index.htm" its content is returned, otherwise, a list of the files in the current directory (with appropriate links) is generated and returned. An example is E<lt>http://lwn.netE<gt>.
ru: Это URL для доступа к веб-серверу (HTTP). По умолчанию используется порт 80. Если путь указывает на каталог, то веб-сервер сам выберет, что необходимо вернуть; обычно, если есть файл «index.html» или «index.htm», то возвращается его содержимое, в ином случае возвращается список файлов в каталоге. Пример: E<lt>http://lwn.netE<gt>.

source: A query can be given in the archaic "isindex" format, consisting of a word or phrase and not including an equal sign (=). A query can also be in the longer "GET" format, which has one or more query entries of the form I<key>=I<value> separated by the ampersand character (&). Note that I<key> can be repeated more than once, though it's up to the web server and its application programs to determine if there's any meaning to that. There is an unfortunate interaction with HTML/XML/SGML and the GET query format; when such URIs with more than one key are embedded in SGML/XML documents (including HTML), the ampersand (&) has to be rewritten as &amp;. Note that not all queries use this format; larger forms may be too long to store as a URI, so they use a different interaction mechanism (called POST) which does not include the data in the URI. See the Common Gateway Interface specification at E<.UR http://www.w3.org\:/CGI> E<.UE> for more information.
ru: Запрос может быть задан в устаревшем формате «isindex», состоящим из слова или фразы, и не содержащим знака равенства (=). Запрос может быть также в удлинённом формате «GET», в котором может быть несколько запрашиваемых элементов в виде I<ключ>=I<значение> и разделяемых амперсандом (&). Заметим, что I<ключ> может повторяться, но как это обрабатывать будет решать сам веб-сервер и его прикладная программа. Есть проблемы при работе с HTML/XML/SGML с помощью формата запроса GET: когда в такие URI добавляются несколько ключей, используемый в документах SGML/XML (включая HTML) амперсанд (&) перезаписывается в виде &amp;. Заметим, что не все запросы используют этот формат; огромные формы могут быть слишком большими для записи в виде URI, поэтому они используют другой механизм взаимодействия (называемый POST), в котором данные в URI не включаются. Подробности смотрите в спецификации на Common Gateway Interface E<.UR http://www.w3.org\:/CGI> E<.UE .>

source: B<ftp - File Transfer Protocol (FTP)>
ru: B<ftp — протокол передачи файлов (FTP)>

source: ftp://I<ip_server>/I<path>
ru: ftp://I<ip_server>/I<путь>

source: This is a URL accessing a file through the file transfer protocol (FTP). The default port (for control) is 21. If no username is included, the username "anonymous" is supplied, and in that case many clients provide as the password the requestor's Internet email address. An example is E<lt>ftp://ftp.is.co.za/rfc/rfc1808.txtE<gt>.
ru: Это URL для получения доступа к файлу с помощью протокола передачи файлов FTP. Номер порта (управляющего) по умолчанию равен 21. Если не указано имя пользователя, то пишется слово «anonymous», и в этом случае многие клиентские программы в качестве пароля отправляют адрес электронной почты пользователя. Пример: E<lt>ftp://ftp.is.co.za/rfc/rfc1808.txtE<gt>.

source: B<gopher - Gopher server>
ru: B<gopher — сервер Gopher>

source: gopher://I<ip_server>/I<gophertype selector>
ru: gopher://I<ip_server>/I<тип_gopher селектор>

source: gopher://I<ip_server>/I<gophertype selector>%09I<search>
ru: gopher://I<ip_server>/I<тип_gopher селектор>%09I<поиск>

source: gopher://I<ip_server>/I<gophertype selector>%09I<search>%09I<gopher+_string>
ru: gopher://I<ip_server>/I<тип_gopher селектор>%09I<поиск>%09I<gopher+_строка>

source: The default gopher port is 70. I<gophertype> is a single-character field to denote the Gopher type of the resource to which the URL refers. The entire path may also be empty, in which case the delimiting "/" is also optional and the gophertype defaults to "1".
ru: По умолчанию служба gopher использует порт 70. I<тип_gopher> — односимвольное поле для указания типа ресурса Gopher, на который ссылается URL. Полный путь может быть пустым; в этом случае знак «/» тоже является необязательным, а значение тип_gopher по умолчанию равно «1».

source: I<selector> is the Gopher selector string. In the Gopher protocol, Gopher selector strings are a sequence of octets which may contain any octets except 09 hexadecimal (US-ASCII HT or tab), 0A hexadecimal (US-ASCII character LF), and 0D (US-ASCII character CR).
ru: I<селектор> — это строка селектора в Gopher. В протоколе Gopher строки селектора могут содержать любые байты, кроме шестнадцатеричных 09 (US-ASCII HT или tab), 0A (US-ASCII-символ LF) и 0D (US-ASCII-символ CR).

source: B<mailto - Email address>
ru: B<mailto — адрес электронной почты>

source: mailto:I<email-address>
ru: mailto:I<адрес_email>

source: This is an email address, usually of the form I<name>@I<hostname>. See B<mailaddr>(7) for more information on the correct format of an email address. Note that any % character must be rewritten as %25. An example is E<lt>mailto:dwheeler@dwheeler.comE<gt>.
ru: Это адрес электронный почты, обычно имеющий форму I<имя_пользователя>@I<имя_узла>. Для получения более подробной информации о формате адресов электронной почты смотрите B<mailaddr>(7). Заметим, что любой символ % должен записываться как %25. Пример: E<lt>mailto:dwheeler@dwheeler.comE<gt>.

source: B<news - Newsgroup or News message>
ru: B<news — сообщение или группа новостей>

source: A I<newsgroup-name> is a period-delimited hierarchical name, such as "comp.infosystems.www.misc". If E<lt>newsgroup-nameE<gt> is "*" (as in E<lt>news:*E<gt>), it is used to refer to "all available news groups". An example is E<lt>news:comp.lang.adaE<gt>.
ru: В I<newsgroup-name> задаётся иерархическое имя, разделённое точками, например, «comp.infosystems.www.misc». Если значение E<lt>newsgroup-nameE<gt> равно «*» (записывается как E<lt>news:*E<gt>), то такая запись используется для указания «всех доступных групп новостей». Пример: E<lt>news:comp.lang.adaE<gt>.

source: A I<message-id> corresponds to the Message-ID of E<.UR http://www.ietf.org\:/rfc\:/rfc1036.txt> IETF RFC\ 1036, E<.UE> without the enclosing "E<lt>" and "E<gt>"; it takes the form I<unique>@I<full_domain_name>. A message identifier may be distinguished from a news group name by the presence of the "@" character.
ru: Значение I<message-id> соответствует Message-ID из E<.UR http://www.ietf.org\:/rfc\:/rfc1036.txt> IETF RFC\ 1036, E<.UE> без крайних «E<lt>» и «E<gt>»; оно имеет вид I<уникальная_часть>@I<полное_доменное_имя>. Идентификатор сообщения можно отличить от названия группы новостей по находящемуся в названии символу «@».

source: B<telnet - Telnet login>
ru: B<telnet — удалённый вход>

source: The Telnet URL scheme is used to designate interactive text services that may be accessed by the Telnet protocol. The final "/" character may be omitted. The default port is 23. An example is E<lt>telnet://melvyl.ucop.edu/E<gt>.
ru: Схема URL для Telnet используется для определения интерактивных текстовых служб, которые доступны по протоколу Telnet. Последний символ «/» может быть опущен. По умолчанию используется порт 23. Пример: E<lt>telnet://melvyl.ucop.edu/E<gt>.

source: B<file - Normal file>
ru: B<file — обычный файл>

source: file://I<ip_server>/I<path_segments>
ru: file://I<ip_server>/I<сегменты_пути>

source: file:I<path_segments>
ru: file:I<сегменты_пути>

source: This represents a file or directory accessible locally. As a special case, I<ip_server> can be the string "localhost" or the empty string; this is interpreted as "the machine from which the URL is being interpreted". If the path is to a directory, the viewer should display the directory's contents with links to each containee; not all viewers currently do this. KDE supports generated files through the URL E<lt>file:/cgi-binE<gt>. If the given file isn't found, browser writers may want to try to expand the filename via filename globbing (see B<glob>(7) and B<glob>(3)).
ru: Представляет файл или каталог, доступный локально. Исключение: значение I<ip_server> может быть пустым или равно строке «localhost»; это означает: «машина, с которой обращаются по URL». Если путь указывает на каталог, то программа просмотра представит содержимое каталога с ссылками на каждый элемент, что выполняется не всеми просмотрщиками. KDE поддерживает генерируемые файлы с помощью URL E<lt>file:/cgi-binE<gt>. Если указанный файл не найден, то обозреватель может попробовать расширить имя файла при помощи функций охвата (смотрите B<glob>(7) и B<glob>(3)).

source: The second format (e.g., E<lt>file:/etc/passwdE<gt>) is a correct format for referring to a local file. However, older standards did not permit this format, and some programs don't recognize this as a URI. A more portable syntax is to use an empty string as the server name, for example, E<lt>file:///etc/passwdE<gt>; this form does the same thing and is easily recognized by pattern matchers and older programs as a URI. Note that if you really mean to say "start from the current location," don't specify the scheme at all; use a relative address like E<lt>../test.txtE<gt>, which has the side-effect of being scheme-independent. An example of this scheme is E<lt>file:///etc/passwdE<gt>.
ru: Второй формат (например, E<lt>file:/etc/passwdE<gt>) существует для ссылки на локальные файлы. Однако, в старых стандартах этот формат не допускался и некоторые программы не воспринимают его как URI. Более переносим следующий синтаксис: пустая строка вместо имени сервера, например, E<lt>file:///etc/passwdE<gt>; эта форма имеет тот же смысл, легко распознаётся определителями по шаблону и старыми программами как URI. Заметим, что если вы на самом деле хотите «начать с текущего места», то не используйте такую схему вообще; рекомендуется использовать относительный адрес, такой как, E<lt>../test.txtE<gt>, который имеет побочный эффект: он не зависит от схемы. Пример такой схемы: E<lt>file:///etc/passwdE<gt>.

source: B<man - Man page documentation>
ru: B<man — справочная страница man>

source: man:I<command-name>
ru: man:I<имя_команды>

source: man:I<command-name>(I<section>)
ru: man:I<имя_команды>(I<раздел>)

source: This refers to local online manual (man) reference pages. The command name can optionally be followed by a parenthesis and section number; see B<man>(7) for more information on the meaning of the section numbers. This URI scheme is unique to UNIX-like systems (such as Linux) and is not currently registered by the IETF. An example is E<lt>man:ls(1)E<gt>.
ru: Это ссылка на локальные справочные страницы (man). За именем команды может следовать номер раздела в круглых скобках; для получения более подробной информации о разделах прочтите B<man>(7). Схемы URI в UNIX-подобных системах (например, Linux) различаются и до сих пор не зарегистрированы в IETF. Пример: E<lt>man:ls(1)E<gt>.

source: B<info - Info page documentation>
ru: B<info — страница документации info>

source: info:I<virtual-filename>
ru: info:I<виртуальное_имя_файла>

source: info:I<virtual-filename>#I<nodename>
ru: info:I<виртуальное_имя_файла>#I<имя_узла>

source: info:(I<virtual-filename>)
ru: info:(I<виртуальное_имя_файла>)

source: info:(I<virtual-filename>)I<nodename>
ru: info:(I<виртуальное_имя_файла>)I<имя_узла>

source: This scheme refers to online info reference pages (generated from texinfo files), a documentation format used by programs such as the GNU tools. This URI scheme is unique to UNIX-like systems (such as Linux) and is not currently registered by the IETF. As of this writing, GNOME and KDE differ in their URI syntax and do not accept the other's syntax. The first two formats are the GNOME format; in nodenames all spaces are written as underscores. The second two formats are the KDE format; spaces in nodenames must be written as spaces, even though this is forbidden by the URI standards. It's hoped that in the future most tools will understand all of these formats and will always accept underscores for spaces in nodenames. In both GNOME and KDE, if the form without the nodename is used the nodename is assumed to be "Top". Examples of the GNOME format are E<lt>info:gccE<gt> and E<lt>info:gcc#G++_and_GCCE<gt>. Examples of the KDE format are E<lt>info:(gcc)E<gt> and E<lt>info:(gcc)G++ and GCCE<gt>.
ru: Эта схема ссылается на справочные страницы info (созданные из файлов texinfo); данный формат документации используется в инструментах GNU. Схемы URI в UNIX-подобных системах (например, Linux) различаются и до сих пор не зарегистрированы в IETF. На момент написания синтаксисы URI у GNOME и KDE различались, поэтому они не понимают синтаксис друг друга. Первые два формата — GNOME: в именах узлов все пробелы заменены подчеркиванием. Следующие два формата — KDE: пробелы в названиях узлов остаются пробелами, даже если это запрещено стандартами URI. Это делалось в надежде на то, что в будущем все программы будут принимать все эти форматы и будут считать подчеркивания как пробелы. В GNOME и KDE, если используется форма без названия узла, то названием по умолчанию считается «Top». Пример формата GNOME: E<lt>info:gccE<gt> и E<lt>info:gcc#G++_and_GCCE<gt>. Пример формата КDE: E<lt>info:(gcc)E<gt> и E<lt>info:(gcc)G++ and GCCE<gt>.

source: B<whatis - Documentation search>
ru: B<whatis — поиск документации>

source: whatis:I<string>
ru: whatis:I<строка>

source: This scheme searches the database of short (one-line) descriptions of commands and returns a list of descriptions containing that string. Only complete word matches are returned. See B<whatis>(1). This URI scheme is unique to UNIX-like systems (such as Linux) and is not currently registered by the IETF.
ru: Эта схема применяет для поиска в базе однострочных описаний команд и возвращает список описаний, содержащих искомую строку. Возвращаются только полные совпадения. За более полной информацией обращайтесь к B<whatis>(1). Данная схема URI в UNIX-подобных системах (например, Linux) различается и до сих пор не зарегистрирована IETF.

source: B<ghelp - GNOME help documentation>
ru: B<ghelp — справочная документация GNOME>

source: ghelp:I<name-of-application>
ru: ghelp:I<название_приложения>

source: This loads GNOME help for the given application. Note that not much documentation currently exists in this format.
ru: Схема загружает справку GNOME для заданного приложения. Замечание: пока в документации описаны не все приложения в этом формате.

source: B<ldap - Lightweight Directory Access Protocol>
ru: B<ldap — простой протокол доступа к каталогам (Lightweight Directory Access Protocol)>

source: ldap://I<hostport>
ru: ldap://I<узел_порт>

source: ldap://I<hostport>/
ru: ldap://I<узел_порт>/

source: ldap://I<hostport>/I<dn>
ru: ldap://I<узел_порт>/I<dn>

source: ldap://I<hostport>/I<dn>?I<attributes>
ru: ldap://I<узел_порт>/I<dn>?I<атрибуты>

source: ldap://I<hostport>/I<dn>?I<attributes>?I<scope>
ru: ldap://I<узел_порт>/I<dn>?I<атрибуты>?I<область>

source: ldap://I<hostport>/I<dn>?I<attributes>?I<scope>?I<filter>
ru: ldap://I<узел_порт>/I<dn>?I<атрибуты>?I<область>?I<фильтр>

source: ldap://I<hostport>/I<dn>?I<attributes>?I<scope>?I<filter>?I<extensions>
ru: ldap://I<узел_порт>/I<dn>?I<атрибуты>?I<область>?I<фильтр>?I<расширения>

source: This scheme supports queries to the Lightweight Directory Access Protocol (LDAP), a protocol for querying a set of servers for hierarchically organized information (such as people and computing resources). See E<.UR http://www.ietf.org\:/rfc\:/rfc2255.txt> RFC\ 2255 E<.UE> for more information on the LDAP URL scheme. The components of this URL are:
ru: Эта схема поддерживает запросы, направляемые по протоколу LDAP одному или нескольким серверам для получения иерархически упорядоченной информации (например, о людях или ресурсах компьютеров). Подробности о схеме LDAP URL смотрите в E<.UR http://www.ietf.org\:/rfc\:/rfc2255.txt> RFC\ 2255 E<.UE .> Компоненты этого URL:

source: hostport
ru: узел_порт

source: the LDAP server to query, written as a hostname optionally followed by a colon and the port number. The default LDAP port is TCP port 389. If empty, the client determines which the LDAP server to use.
ru: запрашиваемый сервер LDAP, записывается как имя машины, двоеточие, номер порта (необязательно). По умолчанию в LDAP используется TCP-порт 389. Если компонент не указан, то клиент сам определяет, какой из LDAP-серверов запрашивать.

source: the LDAP Distinguished Name, which identifies the base object of the LDAP search (see E<.UR http://www.ietf.org\:/rfc\:/rfc2253.txt> RFC\ 2253 E<.UE> section 3).
ru: отличительное имя LDAP, которое определяет базовый объект поиска LDAP (смотрите E<.UR http://www.ietf.org\:/rfc\:/rfc2253.txt> RFC\ 2253 E<.UE> раздел 3).

source: attributes
ru: атрибуты

source: a comma-separated list of attributes to be returned; see RFC\ 2251 section 4.1.5. If omitted, all attributes should be returned.
ru: возвращаемый список атрибутов, разделённых запятой; смотрите RFC\ 2251, раздел 4.1.5. Если данный компонент не задан, то возвращаются все атрибуты.

source: scope
ru: область

source: specifies the scope of the search, which can be one of "base" (for a base object search), "one" (for a one-level search), or "sub" (for a subtree search). If scope is omitted, "base" is assumed.
ru: область поиска, значениями могут быть: «base» (для поиска по базовому объекту), «one» (для поиска на одном уровне) или «sub» (для поиска по ветвям). Если область поиска не указывается, то по умолчанию используется «base».

source: filter
ru: фильтр

source: specifies the search filter (subset of entries to return). If omitted, all entries should be returned. See E<.UR http://www.ietf.org\:/rfc\:/rfc2254.txt> RFC\ 2254 E<.UE> section 4.
ru: фильтр поиска (набор возвращаемых записей). Если компонент не задан, то возвращаются все записи. Смотрите E<.UR http://www.ietf.org\:/rfc\:/rfc2254.txt> RFC\ 2254 E<.UE> раздел 4.

source: extensions
ru: расширения

source: a comma-separated list of type=value pairs, where the =value portion may be omitted for options not requiring it. An extension prefixed with a \(aq!\(aq is critical (must be supported to be valid), otherwise it is noncritical (optional).
ru: список пар тип=значение (через запятую), где часть =значение (в случаях, когда это не требуется) может не употребляться. Расширение с приставкой «!» обязательно; если этот значок отсутствует, то необязательно.

source: LDAP queries are easiest to explain by example. Here's a query that asks ldap.itd.umich.edu for information about the University of Michigan in the U.S.:
ru: Приведём примеры запросов LDAP. Запрос к ldap.itd.umich.edu информации о Мичиганском университете США:

source: To just get its postal address attribute, request:
ru: Для того, чтобы получить атрибут почтового адреса, введите запрос:

source: To ask a host.com at port 6666 for information about the person with common name (cn) "Babs Jensen" at University of Michigan, request:
ru: Для того, чтобы запросить у host.com (порт 6666) информацию о человеке по имени (cn) «Babs Jensen» в Мичиганском университете, введите строку:

source: B<wais - Wide Area Information Servers>
ru: B<wais — глобальная сеть информационных серверов (Wide Area Information Servers)>

source: wais://I<hostport>/I<database>
ru: wais://I<узел_порт>/I<база_данных>

source: wais://I<hostport>/I<database>?I<search>
ru: wais://I<узел_порт>/I<база_данных>?I<поиск>

source: wais://I<hostport>/I<database>/I<wtype>/I<wpath>
ru: wais://I<узел_порт>/I<база_данных>/I<wtype>/I<wpath>

source: This scheme designates a WAIS database, search, or document (see E<.UR http://www.ietf.org\:/rfc\:/rfc1625.txt> IETF RFC\ 1625 E<.UE> for more information on WAIS). Hostport is the hostname, optionally followed by a colon and port number (the default port number is 210).
ru: Эта схема предназначена для базы данных WAIS, поиска или документа (более подробную информацию о WAIS смотрите E<.UR http://www.ietf.org\:/rfc\:/rfc1625.txt> IETF RFC\ 1625 E<.UE>). Узел_порт — это название машины, в некоторых случаях сопровождающееся номером порта (после двоеточия). Используемый порт по умолчанию — 210.

source: The first form designates a WAIS database for searching. The second form designates a particular search of the WAIS database I<database>. The third form designates a particular document within a WAIS database to be retrieved. I<wtype> is the WAIS designation of the type of the object and I<wpath> is the WAIS document-id.
ru: Первая форма определяет базу данных WAIS для поиска. Вторая форма — это определённой поиск в I<базе данных> WAIS. Третья форма предназначена для поиска конкретного документа в базе данных WAIS. Значение I<wtype> служит для обозначения объекта в WAIS, а I<wpath> — это document-id WAIS.
