Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_u/*.po
Languages: ru

source: int32_t ut_addr_v6[4]; /* Internet address of remote host; IPv4 address uses just ut_addr_v6[0] */ char __unused[20]; /* Reserved for future use */ };
ru: int32_t ut_addr_v6[4]; /* интернет-адрес удалённого узла; для адреса IPv4 используется только ut_addr_v6[0] */ char __unused[20]; /* зарезервировано для будущего использования */ };

source: /* Backward compatibility hacks */ #define ut_name ut_user #ifndef _NO_UT_TIME #define ut_time ut_tv.tv_sec #endif #define ut_xtime ut_tv.tv_sec #define ut_addr ut_addr_v6[0]
ru: /* разное для обратной совместимости */ #define ut_name ut_user #ifndef _NO_UT_TIME #define ut_time ut_tv.tv_sec #endif #define ut_xtime ut_tv.tv_sec #define ut_addr ut_addr_v6[0]

source: This structure gives the name of the special file associated with the user's terminal, the user's login name, and the time of login in the form of B<time>(2). String fields are terminated by a null byte (\(aq\e0\(aq) if they are shorter than the size of the field.
ru: Эта структура дает имя специальному файлу, связанному с терминалом пользователя, именем входа пользователя и временем входа в виде как у B<time>(2). Поля строк заканчиваются байтом null (\(aq\e\(aq), если они короче, чем размер поля.

source: The first entries ever created result from B<init>(1) processing B<inittab>(5). Before an entry is processed, though, B<init>(1) cleans up utmp by setting I<ut_type> to B<DEAD_PROCESS>, clearing I<ut_user>, I<ut_host>, and I<ut_time> with null bytes for each record which I<ut_type> is not B<DEAD_PROCESS> or B<RUN_LVL> and where no process with PID I<ut_pid> exists. If no empty record with the needed I<ut_id> can be found, B<init>(1) creates a new one. It sets I<ut_id> from the inittab, I<ut_pid> and I<ut_time> to the current values, and I<ut_type> to B<INIT_PROCESS>.
ru: Самые первые записи создаются B<init>(1) после обработки B<inittab>(5). Хотя перед тем, как элемент обрабатывается, B<init>(1) очищает utmp, устанавливая I<ut_type> равным B<DEAD_PROCESS>, заполняя I<ut_user>, I<ut_host> и I<ut_time> нулевыми байтами в записях, в которых I<ut_type> не равен B<DEAD_PROCESS> или B<RUN_LVL> и для которых не существует процессов с PID, равным I<ut_pid>. Если не найдено ни одной пустой записи с нужным I<ut_id>, то B<init>(1) создает новую. Он устанавливает значение I<ut_id> из inittab, I<ut_pid> и I<ut_time> из текущих значений и I<ut_type> в B<INIT_PROCESS>.

source: B<mingetty>(8) (or B<agetty>(8)) locates the entry by the PID, changes I<ut_type> to B<LOGIN_PROCESS>, changes I<ut_time>, sets I<ut_line>, and waits for connection to be established. B<login>(1), after a user has been authenticated, changes I<ut_type> to B<USER_PROCESS>, changes I<ut_time>, and sets I<ut_host> and I<ut_addr>. Depending on B<mingetty>(8) (or B<agetty>(8)) and B<login>(1), records may be located by I<ut_line> instead of the preferable I<ut_pid>.
ru: B<mingetty>(8) (или B<agetty>(8)) находит элементы по их идентификатору PID, меняет I<ut_type> на B<LOGIN_PROCESS>, изменяет I<ut_time>, устанавливает I<ut_line> и ожидает установки соединения.B<login>(1), после того как пользователь был идентифицирован, меняет I<ut_type> на B<USER_PROCESS>, изменяет I<ut_time> и устанавливает I<ut_host> и I<ut_addr>. В зависимости от B<mingetty>(8) (или B<agetty>(8)) и B<login>(1), записи могут быть расположены в соответствии с I<ut_line>, вместо более предпочитаемого I<ut_pid>.

source: When B<init>(1) finds that a process has exited, it locates its utmp entry by I<ut_pid>, sets I<ut_type> to B<DEAD_PROCESS>, and clears I<ut_user>, I<ut_host> and I<ut_time> with null bytes.
ru: Когда B<init>(1) обнаруживает, что процесс завершился, он находит его запись в utmp по I<ut_pid>, устанавливает I<ut_type> в B<DEAD_PROCESS>, и затирает I<ut_user>, I<ut_host> и I<ut_time> нулями.

source: B<xterm>(1) and other terminal emulators directly create a B<USER_PROCESS> record and generate the I<ut_id> by using the string that suffix part of the terminal name (the characters following I</dev/[pt]ty>). If they find a B<DEAD_PROCESS> for this ID, they recycle it, otherwise they create a new entry. If they can, they will mark it as B<DEAD_PROCESS> on exiting and it is advised that they null I<ut_line>, I<ut_time>, I<ut_user>, and I<ut_host> as well.
ru: B<xterm>(1) и другие эмуляторы терминалов самостоятельно создают запись B<USER_PROCESS> и генерируют I<ut_id>, используя последние две буквы имени из имени терминала (символы после I</dev/[pt]ty>). Если они обнаруживают B<DEAD_PROCESS> для этого ID, то они удаляют его или создают новый элемент. Если возможно, они пометят его как B<DEAD_PROCESS> при выходе; предполагается, что они также обнуляют I<ut_line>, I<ut_time>, I<ut_user> и I<ut_host>.

source: B<telnetd>(8) sets up a B<LOGIN_PROCESS> entry and leaves the rest to B<login>(1) as usual. After the telnet session ends, B<telnetd>(8) cleans up utmp in the described way.
ru: B<telnetd>(8) устанавливает элемент B<LOGIN_PROCESS> и оставляет остальное, как обычно, аргументу для B<login>(1). После завершения сеанса telnet, B<telnetd>(8) очищает utmp вышеописанным путем.

source: The I<wtmp> file records all logins and logouts. Its format is exactly like I<utmp> except that a null username indicates a logout on the associated terminal. Furthermore, the terminal name B<~> with username B<shutdown> or B<reboot> indicates a system shutdown or reboot and the pair of terminal names B<|>/B<}> logs the old/new system time when B<date>(1) changes it. I<wtmp> is maintained by B<login>(1), B<init>(1), and some versions of B<getty>(8) (e.g., B<mingetty>(8) or B<agetty>(8)). None of these programs creates the file, so if it is removed, record-keeping is turned off.
ru: В файл I<wtmp> записываются все входы и выходы в систему. Его формат в точности похож на формат I<utmp>, за исключением того, что пустое имя пользователя означает выход из системы через связанный терминал. Кроме того, название терминала B<~> с именем пользователя B<shutdown> или B<reboot> означает выключение системы или её перезагрузку, а пара названий терминала B<|>/B<}> означает старое/новое системное время в случае, когда B<date>(1) меняет их. В I<wtmp> пишут B<login>(1), B<init>(1) и некоторые версии B<getty>(8) (например, B<mingetty>(8) или B<agetty>(8)). Ни одна из этих программ не создает файл, поэтому если он удалён, то ведение записей заканчивается.

source: POSIX.1 does not specify a I<utmp> structure, but rather one named I<utmpx>, with specifications for the fields I<ut_type>, I<ut_pid>, I<ut_line>, I<ut_id>, I<ut_user>, and I<ut_tv>. POSIX.1 does not specify the lengths of the I<ut_line> and I<ut_user> fields.
ru: В POSIX.1 структура I<utmp> не определена, но есть похожая с именем I<utmpx> и полями I<ut_type>, I<ut_pid>, I<ut_line>, I<ut_id>, I<ut_user> и I<ut_tv>. В POSIX.1 не указан размер полей I<ut_line> и I<ut_user>.

source: Linux defines the I<utmpx> structure to be the same as the I<utmp> structure.
ru: В Linux структура I<utmpx> совпадает со структурой I<utmp>.

source: Comparison with historical systems
ru: Сравнение со старыми системами

source: Linux utmp entries conform neither to v7/BSD nor to System V; they are a mix of the two.
ru: В Linux записи utmp не следуют форматам ни v7/BSD ни System V; они содержат поля из обоих форматов.

source: v7/BSD has fewer fields; most importantly it lacks I<ut_type>, which causes native v7/BSD-like programs to display (for example) dead or login entries. Further, there is no configuration file which allocates slots to sessions. BSD does so because it lacks I<ut_id> fields.
ru: v7/BSD имеет меньшее количество полей; важнее всего то, что в нём нет I<ut_type>, который заставляет v7/BSD-совместимые программы выводить, к примеру, отработавшие записи или записи о входе систему. Также в этой версии отсутствует файл настройки, который определяет места для сеансов. Всё это делается в BSD из-за отсутствия поля I<ut_id>.

source: In Linux (as in System V), the I<ut_id> field of a record will never change once it has been set, which reserves that slot without needing a configuration file. Clearing I<ut_id> may result in race conditions leading to corrupted utmp entries and potential security holes. Clearing the abovementioned fields by filling them with null bytes is not required by System V semantics, but makes it possible to run many programs which assume BSD semantics and which do not modify utmp. Linux uses the BSD conventions for line contents, as documented above.
ru: В Linux (как в System V) поле I<ut_id> записи никогда не меняется после того, как один раз установлено, что позволяет резервировать место без необходимости в файле настройки. Очищение I<ut_id> может привести к соперничеству, приводящему к повреждению элементов utmp и нарушению безопасности системы. Очистка вышеупомянутых полей нулями не требуется согласно семантике System V, но позволяет запускать многие программы, которые используют семантику BSD и которые не изменяют utmp. Linux использует соглашение BSD при работе с содержимым строк, как описано ранее.

source: System V has no I<ut_host> or I<ut_addr_v6> fields.
ru: В System V нет полей I<ut_host> и I<ut_addr_v6>.

source: Unlike various other systems, where utmp logging can be disabled by removing the file, utmp must always exist on Linux. If you want to disable B<who>(1), then do not make utmp world readable.
ru: В отличии от других систем, где протоколирование сообщений utmp может быть выключено простым удалением файла, в Linux файл utmp всегда должен существовать. Если вы хотите отключить B<who>(1), то просто сделайте чтение utmp недоступным всем остальным.

source: The file format is machine-dependent, so it is recommended that it be processed only on the machine architecture where it was created.
ru: Формат файла зависит от архитектуры, поэтому рекомендуется, чтобы он обрабатывался только на машинах с одинаковой архитектурой.

source: Note that on I<biarch> platforms, that is, systems which can run both 32-bit and 64-bit applications (x86-64, ppc64, s390x, etc.), I<ut_tv> is the same size in 32-bit mode as in 64-bit mode. The same goes for I<ut_session> and I<ut_time> if they are present. This allows data files and shared memory to be shared between 32-bit and 64-bit applications. This is achieved by changing the type of I<ut_session> to I<int32_t>, and that of I<ut_tv> to a struct with two I<int32_t> fields I<tv_sec> and I<tv_usec>. Since I<ut_tv> may not be the same as I<struct timeval>, then instead of the call:
ru: Заметим, что на I<двуархитектурных> платформах, то есть системах, которые позволяют запускать сразу 32- и 64-битные приложения (x86-64, ppc64, s390x и т.д.), поле I<ut_tv> имеет одинаковый размер в 32- и 64-битном режиме. Это же относится к I<ut_session> и I<ut_time>, если они есть. Это позволяет использовать файлы данных и память одновременно и в 32- и в 64-битных приложениях. Данная возможность достигается сменой типа I<ut_session> на I<int32_t> и I<ut_tv> на структуру с двумя полями I<int32_t> \(em I<tv_sec> и I<tv_usec>. Так как I<ut_tv> не может быть одинакова с I<struct timeval>, то вместо вызова:

source: the following method of setting this field is recommended:
ru: для установки значения этого поля рекомендуется использовать:

source: usleep - suspend execution for microsecond intervals
ru: usleep - задерживает выполнение на определенное количество микросекунд

source: Since glibc 2.12:
ru: Начиная с glibc 2.12:

source: (_XOPEN_SOURCE\ E<gt>=\ 500) && ! (_POSIX_C_SOURCE\ E<gt>=\ 200809L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: (_XOPEN_SOURCE\ E<gt>=\ 500) && ! (_POSIX_C_SOURCE\ E<gt>=\ 200809L) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версиях glibc E<lt>= 2.19: */ _BSD_SOURCE

source: Before glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500
ru: До glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500

source: The B<usleep>() function suspends execution of the calling thread for (at least) I<usec> microseconds. The sleep may be lengthened slightly by any system activity or by the time spent processing the call or by the granularity of system timers.
ru: Функция B<usleep>() приостанавливает выполнение вызвавшей нити на (не менее) I<usec> микросекунд. Остановка может продлиться слегка больше при большой загруженности системы, из-за, собственно, времени обработки этого вызова или из-за неточности хода системных часов.

source: The B<usleep>() function returns 0 on success. On error, -1 is returned, with I<errno> set to indicate the cause of the error.
ru: При успешном выполнении B<usleep>() возвращается 0. При ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: Interrupted by a signal; see B<signal>(7).
ru: Прервано сигналом; см. B<signal>(7).

source: I<usec> is greater than or equal to 1000000. (On systems where that is considered an error.)
ru: Значение I<usec> больше или равно 1000000 (в тех системах, где это считается ошибкой).

source: 4.3BSD, POSIX.1-2001. POSIX.1-2001 declares this function obsolete; use B<nanosleep>(2) instead. POSIX.1-2008 removes the specification of B<usleep>().
ru: 4.3BSD, POSIX.1-2001. В POSIX.1-2001 эта функция объявлена устаревшей; вместо неё используйте B<nanosleep>(2). Из POSIX.1-2008 описание B<usleep>() было удалено.

source: On the original BSD implementation, and in glibc before version 2.2.2, the return type of this function is I<void>. The POSIX version returns I<int>, and this is also the prototype used since glibc 2.2.2.
ru: В первоначальной реализации BSD и в glibc до версии 2.2.2 типом возвращаемого значение функции был I<void>. В версии POSIX возвращается I<int>, и этот прототип также используется в glibc начиная с версии 2.2.2.

source: Only the B<EINVAL> error return is documented by SUSv2 and POSIX.1-2001.
ru: Возвращаемая ошибка B<EINVAL> определена только в SUSv2 и POSIX.1-2001.

source: The type I<useconds_t> is an unsigned integer type capable of holding integers in the range [0,1000000]. Programs will be more portable if they never mention this type explicitly. Use
ru: Тип I<useconds_t> является беззнаковым целым типом, способным хранить целые числа в диапазоне [0,1000000]. Программы будут иметь более высокий уровень переносимости на другие ОС, если они никогда не будут явно упоминать этот тип. Используйте

source: The interaction of this function with the B<SIGALRM> signal, and with other timer functions such as B<alarm>(2), B<sleep>(3), B<nanosleep>(2), B<setitimer>(2), B<timer_create>(2), B<timer_delete>(2), B<timer_getoverrun>(2), B<timer_gettime>(2), B<timer_settime>(2), B<ualarm>(3) is unspecified.
ru: Взаимодействие этой функции с сигналом B<SIGALRM> и другими функциями таймера, такими как B<alarm>(2), B<sleep>(3), B<nanosleep>(2), B<setitimer>(2), B<timer_create>(2), B<timer_delete>(2), B<timer_getoverrun>(2), B<timer_gettime>(2), B<timer_settime>(2), B<ualarm>(3), не определено.

source: unlockpt - unlock a pseudoterminal master/slave pair
ru: unlockpt - разблокирует пару основной/подчинённый псевдо-терминал

source: Since glibc 2.24: _XOPEN_SOURCE\ E<gt>=\ 500 || (_XOPEN_SOURCE\ &&\ _XOPEN_SOURCE_EXTENDED)
ru: начиная с glibc 2.24: _XOPEN_SOURCE\ E<gt>=\ 500 || (_XOPEN_SOURCE\ &&\ _XOPEN_SOURCE_EXTENDED)

source: Glibc 2.23 and earlier: _XOPEN_SOURCE
ru: glibc 2.23 и старее: _XOPEN_SOURCE

source: The B<unlockpt>() function unlocks the slave pseudoterminal device corresponding to the master pseudoterminal referred to by I<fd>.
ru: Функция B<unlockpt>() разблокирует устройство подчиненного псевдо-терминала соответствующего основному псевдо-терминалу, на который ссылается I<fd>.

source: B<unlockpt>() should be called before opening the slave side of a pseudoterminal.
ru: Функция B<unlockpt>() должна вызываться перед открытием подчинённой стороны псевдо-терминала.

source: When successful, B<unlockpt>() returns 0. Otherwise, it returns -1 and sets I<errno> appropriately.
ru: При успешном выполнении B<unlockpt>() возвращает 0. Иначе возвращается -1 и переменная I<errno> устанавливается соответствующим образом.

source: The I<fd> argument is not a file descriptor open for writing.
ru: Значение I<fd> не является правильным файловым дескриптором, открытым для записи.

source: The I<fd> argument is not associated with a master pseudoterminal.
ru: Значение I<fd> не связано с основным псевдо-терминалом.

source: B<unlockpt>() is provided in glibc since version 2.1.
ru: Функция B<unlockpt>() появилась в glibc начиная с версии 2.1.

source: getc_unlocked, getchar_unlocked, putc_unlocked, putchar_unlocked - nonlocking stdio functions
ru: getc_unlocked, getchar_unlocked, putc_unlocked, putchar_unlocked - неблокирующие функции стандартного ввода-вывода

source: /* Since glibc 2.24: */ _POSIX_C_SOURCE\ E<gt>=\ 199309L || /* Glibc versions E<lt>= 2.23: */ _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: /* начиная с glibc 2.24: */ _POSIX_C_SOURCE\ E<gt>=\ 199309L || /* Glibc versions E<lt>= 2.23: */ _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версиях glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: Each of these functions has the same behavior as its counterpart without the "_unlocked" suffix, except that they do not use locking (they do not set locks themselves, and do not test for the presence of locks set by others) and hence are thread-unsafe. See B<flockfile>(3).
ru: Все эти функции ведут себя так же, как и их аналоги без суффикса «_unlocked», за исключением того, что они не используют блокировку (они не устанавливают блокировки самостоятельно и не проверяют наличие других блокировок) и, таким образом, не являются нитебезопасными. Смотрите B<flockfile>(3).

source: The four functions B<getc_unlocked>(), B<getchar_unlocked>(), B<putc_unlocked>(), B<putchar_unlocked>() are in POSIX.1-2001 and POSIX.1-2008.
ru: Четыре функции B<getc_unlocked>(), B<getchar_unlocked>(), B<putc_unlocked>() и B<putchar_unlocked>() являются частью стандартов POSIX.1-2001 и POSIX.1-2008.

source: The nonstandard B<*_unlocked>() variants occur on a few UNIX systems, and are available in recent glibc. They should probably not be used.
ru: В некоторых систем UNIX и последних версиях glibc встречаются нестандартные варианты функций B<*_unlocked>(). Вероятно, не стоит их использовать.

source: ungetwc - push back a wide character onto a FILE stream
ru: ungetwc - отправка широкого символа обратно в поток FILE

source: The B<ungetwc>() function is the wide-character equivalent of the B<ungetc>(3) function. It pushes back a wide character onto I<stream> and returns it.
ru: Функция B<ungetwc>() — это эквивалент функции B<ungetc>(3) для широких символов. Она отправляет широкий символ обратно в поток I<stream> и возвращает его.

source: If I<wc> is B<WEOF>, it returns B<WEOF>. If I<wc> is an invalid wide character, it sets I<errno> to B<EILSEQ> and returns B<WEOF>.
ru: Если I<wc> равно B<WEOF>, то возвращается B<WEOF>. Если I<wc> — это некорректный широкий символ, то значение I<errno> устанавливается в B<EILSEQ> и возвращается B<WEOF>.

source: If I<wc> is a valid wide character, it is pushed back onto the stream and thus becomes available for future wide-character read operations. The file-position indicator is decremented by one or more. The end-of-file indicator is cleared. The backing storage of the file is not affected.
ru: Если I<wc> — это корректный широкий символ, то он отправляется обратно в поток и, таким образом, становится доступным для последующих операций чтения широких символов. Индикатор позиции в файле уменьшается на единицу или более. Индикатор конца файла очищается. Непосредственный носитель файла при этой операции не задействуется.

source: Note: I<wc> need not be the last wide-character read from the stream; it can be any other valid wide character.
ru: Замечание: I<wc> не должен быть последним широким символом в потоке; он может быть любым другим корректным широким символом.

source: If the implementation supports multiple push-back operations in a row, the pushed-back wide characters will be read in reverse order; however, only one level of push-back is guaranteed.
ru: Если реализация поддерживает несколько последовательных операций возвращения подряд, то возвращённые широкие символы будут прочитаны в обратном порядке; однако гарантированно работает только однократный возврат.

source: The B<ungetwc>() function returns I<wc> when successful, or B<WEOF> upon failure.
ru: При успешном выполнении функция B<ungetwc> возвращает I<wc> или B<WEOF> в случае ошибки.

source: The behavior of B<ungetwc>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<ungetwc>() зависит от категории B<LC_CTYPE> текущей локали.

source: ulimit - get and set user limits
ru: ulimit - установка или получение пользовательских ограничений

source: Warning: this routine is obsolete. Use B<getrlimit>(2), B<setrlimit>(2), and B<sysconf>(3) instead. For the shell command B<ulimit>(), see B<bash>(1).
ru: Предупреждение: эта функция устарела. Вместо неё используйте B<getrlimit>(2), B<setrlimit>(2) и B<sysconf>(3). Справку по вызову B<ulimit> из командной строки смотрите в B<bash>(1).

source: The B<ulimit>() call will get or set some limit for the calling process. The I<cmd> argument can have one of the following values.
ru: Вызов B<ulimit> позволяет получить или установить ограничения вызывающего процесса. Аргумент I<cmd> может принимать следующие значения:

source: Return the limit on the size of a file, in units of 512 bytes.
ru: Возвращается ограничение на размер файла (в блоках по 512 байтов).

source: Set the limit on the size of a file.
ru: Устанавливается ограничение размера файла.

source: (Not implemented for Linux.) Return the maximum possible address of the data segment.
ru: Возвращается максимально возможный адрес сегмента данных (не реализовано в Linux).

source: (Implemented but no symbolic constant provided.) Return the maximum number of files that the calling process can open.
ru: Возвращается максимальное количество файлов, которое может открыть вызывающий процесс (реализовано, но нет символической константы).

source: On success, B<ulimit>() returns a nonnegative value. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<ulimit> возвращает неотрицательное число. В случае ошибки возвращается -1, а значение I<errno> устанавливается соответствующим образом.

source: An unprivileged process tried to increase a limit.
ru: Непривилегированный процесс пытается увеличить лимит.

source: SVr4, POSIX.1-2001. POSIX.1-2008 marks B<ulimit>() as obsolete.
ru: SVr4, POSIX.1-2001. В POSIX.1-2008 функция B<ulimit>() помечена как устаревшая.

source: uselocale - set/get the locale for the calling thread
ru: uselocale - задаёт/получает локаль для вызывающей нити

source: The B<uselocale>() function sets the current locale for the calling thread, and returns the thread's previously current locale. After a successful call to B<uselocale>(), any calls by this thread to functions that depend on the locale will operate as though the locale has been set to I<newloc>.
ru: Функция B<uselocale>() задаёт текущую локаль в вызвавшей нити и возвращает использовавшуюся локаль в этой нити ранее. После успешного выполнения B<uselocale>() любые выполняемые нитью вызовы функций, зависящие от локали, будут работать с учётом установленной локали I<newloc>.

source: The I<newloc> argument can have one of the following values:
ru: В аргументе I<newloc> можно указать одно из следующих значений:

source: A handle returned by a call to B<newlocale>(3) or B<duplocale>(3)
ru: Обработчик, полученный от вызовов B<newlocale>(3) или B<duplocale>(3)
