Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_q/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: query_module - query the kernel for various bits pertaining to modules
ru: query_module - запросить ядро о различных параметрах, касающихся модулей

source: SYNOPSIS
ru: ОБЗОР

source: I<Note>: No declaration of this system call is provided in glibc headers; see NOTES.
ru: I<Замечание>: В заголовочных файлах glibc этой системный вызов отсутствует; смотрите ЗАМЕЧАНИЯ.

source: DESCRIPTION
ru: ОПИСАНИЕ

source: I<Note>: This system call is present only in kernels before Linux 2.6.
ru: I<Замечание>: Данный системный вызов доступен только в ядрах до Linux 2.6.

source: B<query_module>() requests information from the kernel about loadable modules. The returned information is placed in the buffer pointed to by I<buf>. The caller must specify the size of I<buf> in I<bufsize>. The precise nature and format of the returned information depend on the operation specified by I<which>. Some operations require I<name> to identify a currently loaded module, some allow I<name> to be NULL, indicating the kernel proper.
ru: B<query_module>() запрашивает информацию у ядра о загружаемых модулях. Возвращаемая информация помещается в буфер, указанный в I<buf>. Вызывающий должен указать размер I<buf> в I<bufsize>. Смысл и формат возвращаемой информации зависит от операции, задаваемой в I<which>. Для некоторых операций требуется заполнить I<name> для указания на уже загруженный модуль, для некоторых в I<name> можно указать NULL, что указывает на получения свойства ядра.

source: The following values can be specified for I<which>:
ru: В I<which> можно указать следующие значения:

source: Returns success, if the kernel supports B<query_module>(). Used to probe for availability of the system call.
ru: Завершается успешно, если ядро поддерживает B<query_module>(). Используется для проверки доступности системного вызова.

source: Returns the names of all loaded modules. The returned buffer consists of a sequence of null-terminated strings; I<ret> is set to the number of modules.
ru: Возвращает имена всех загруженных модулей. Возвращаемый буфер содержит последовательность строк, оканчивающихся null; в I<ret> указано количество модулей.

source: Returns the names of all modules used by the indicated module. The returned buffer consists of a sequence of null-terminated strings; I<ret> is set to the number of modules.
ru: Возвращает имена всех модулей, используемых указанным модулем. Возвращаемый буфер содержит последовательность строк, оканчивающихся null; в I<ret> указано количество модулей.

source: Returns the names of all modules using the indicated module. This is the inverse of B<QM_DEPS>. The returned buffer consists of a sequence of null-terminated strings; I<ret> is set to the number of modules.
ru: Возвращает имена всех модулей, использующих указанный модуль. Это обратная по отношению к B<QM_DEPS> операция. Возвращаемый буфер содержит последовательность строк, оканчивающихся null; в I<ret> указано количество модулей.

source: Returns the symbols and values exported by the kernel or the indicated module. The returned buffer is an array of structures of the following form
ru: Возвращает символы и значения, экспортируемые ядром или указанным модулем. Возвращаемый буфер содержит массив структур следующего формата:

source: followed by null-terminated strings. The value of I<name> is the character offset of the string relative to the start of I<buf>; I<ret> is set to the number of symbols.
ru: завершаемого строками, оканчивающимися null. Значение I<name> содержит смещение строки в знаках относительно начала I<buf>; в I<ret> указано количество символов.

source: Returns miscellaneous information about the indicated module. The output buffer format is:
ru: Возвращает различную информацию об указанном модуле. Формат результата в буфере:

source: where I<address> is the kernel address at which the module resides, I<size> is the size of the module in bytes, and I<flags> is a mask of B<MOD_RUNNING>, B<MOD_AUTOCLEAN>, and so on, that indicates the current status of the module (see the Linux kernel source file I<include/linux/module.h>). I<ret> is set to the size of the I<module_info> structure.
ru: где I<address> — это адрес ядра, где располагается модуль, I<size> — размер модуля в байтах, I<flags> — маска B<MOD_RUNNING>, B<MOD_AUTOCLEAN> и т. п., показывающая текущее состояние модуля (смотрите файл исходного кода ядра Linux I<include/linux/module.h>). В I<ret> указан размер структуры I<module_info>.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On success, zero is returned. On error, -1 is returned and I<errno> is set appropriately.
ru: При успешном выполнении возвращается ноль. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: ERRORS
ru: ОШИБКИ

source: At least one of I<name>, I<buf>, or I<ret> was outside the program's accessible address space.
ru: Одно из значений в I<name>, I<buf> или I<ret> находится вне доступного программного адресного пространства.

source: Invalid I<which>; or I<name> is NULL (indicating "the kernel"), but this is not permitted with the specified value of I<which>.
ru: Неправильное значение I<which>; I<name> равно NULL (указывающее "параметры ядра"), но оно не разрешено для указанного значения I<which>.

source: No module by that I<name> exists.
ru: Модуль с именем, указанным в I<name>, не существует.

source: The buffer size provided was too small. I<ret> is set to the minimum size needed.
ru: Указанный размер буфера слишком мал. В I<ret> возвращается минимальный необходимый размер.

source: B<query_module>() is not supported in this version of the kernel (e.g., the kernel is version 2.6 or later).
ru: B<query_module>() не поддерживается в этой версии ядра (например, в 2.6 или более поздних).

source: VERSIONS
ru: ВЕРСИИ

source: This system call is present on Linux only up until kernel 2.4; it was removed in Linux 2.6.
ru: Данный системный вызов есть только в Linux до версии 2.4; он был удалён в Linux 2.6.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: B<query_module>() is Linux-specific.
ru: B<query_module>() есть только в Linux.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: Some of the information that was formerly available via B<query_module>() can be obtained from I</proc/modules>, I</proc/kallsyms>, and the files under the directory I</sys/module>.
ru: Некоторую информацию, которая была ранее доступна через B<query_module>(), можно получить из I</proc/modules>, I</proc/kallsyms> и файлов из каталога I</sys/modules>.

source: The B<query_module>() system call is not supported by glibc. No declaration is provided in glibc headers, but, through a quirk of history, glibc does export an ABI for this system call. Therefore, in order to employ this system call, it is sufficient to manually declare the interface in your code; alternatively, you can invoke the system call using B<syscall>(2).
ru: Системный вызов B<query_module>() не поддерживается glibc. В заголовочных файлах glibc он не объявлен, но в недавнем прошлом glibc экспортировал ABI для этого системного вызова. Поэтому чтобы получить данный системный вызов достаточно вручную объявить интерфейс в своём коде; или же вы можете вызвать его через B<syscall>(2).

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: quotactl - manipulate disk quotas
ru: quotactl - управление дисковыми квотами

source: B<#include E<lt>sys/quota.hE<gt>> B<#include E<lt>xfs/xqm.hE<gt> /* for XFS quotas */>
ru: B<#include E<lt>sys/quota.hE<gt>> B<#include E<lt>xfs/xqm.hE<gt> /* для квот XFS */>

source: The quota system can be used to set per-user, per-group, and per-project limits on the amount of disk space used on a filesystem. For each user and/or group, a soft limit and a hard limit can be set for each filesystem. The hard limit can't be exceeded. The soft limit can be exceeded, but warnings will ensue. Moreover, the user can't exceed the soft limit for more than grace period duration (one week by default) at a time; after this, the soft limit counts as a hard limit.
ru: С помощью системы квот можно задать каждому пользователю, группе или проекту лимит использования дискового пространства. Для пользователя или группы в каждой файловой системе можно указать необязательный (soft) и обязательный (hard) лимиты. Обязательный лимит не может быть превышен. Необязательный лимит превышать можно, но будет выдано соответствующее предостережение. Более того, пользователь может превышать необязательный лимит только в течении льготного срока (по умолчанию,одна неделя); после этого необязательный лимит будет считаться обязательным.

source: The B<quotactl>() call manipulates disk quotas. The I<cmd> argument indicates a command to be applied to the user or group ID specified in I<id>. To initialize the I<cmd> argument, use the I<QCMD(subcmd, type)> macro. The I<type> value is either B<USRQUOTA>, for user quotas, B<GRPQUOTA>, for group quotas, or (since Linux 4.1) B<PRJQUOTA>, for project quotas. The I<subcmd> value is described below.
ru: Управление квотами выполняется с помощью вызова B<quotactl>(). В аргументе I<cmd> задаётся команда, которая должна быть применена для пользовательского или группового идентификатора, указанного в I<id>. Для инициализации значения аргумента I<cmd> используйте макрос I<QCMD(subcmd, type)>. Значение I<type> может быть B<USRQUOTA> (для пользовательских квот), B<GRPQUOTA> (для групповых квот) или (начиная с Linux 4.1) B<PRJQUOTA> (для проектных квот). Значение I<subcmd> описано ниже.

source: The I<special> argument is a pointer to a null-terminated string containing the pathname of the (mounted) block special device for the filesystem being manipulated.
ru: Аргумент I<special> представляет собой указатель на строку, завершающуюся null и содержащую путь к блочному устройству (смонтированному) с файловой системой, на которую накладывается квота.

source: The I<addr> argument is the address of an optional, command-specific, data structure that is copied in or out of the system. The interpretation of I<addr> is given with each command below.
ru: Аргумент I<addr> представляет собой адрес необязательной, зависящей от команды, структуры данных, которые копируются в или из системы. Интерпретация I<addr> указана ниже (для каждой команды).

source: The I<subcmd> value is one of the following:
ru: Значением I<subcmd> может быть одно из:

source: Turn on quotas for a filesystem. The I<id> argument is the identification number of the quota format to be used. Currently, there are three supported quota formats:
ru: Включает учёт квот в файловой системе. В аргументе I<id> задаётся используемый идентификационный номер формата квот. В настоящее время поддерживается три формата квот:

source: The original quota format.
ru: Самая первая версия формата квот.

source: The standard VFS v0 quota format, which can handle 32-bit UIDs and GIDs and quota limits up to 2^42 bytes and 2^32 inodes.
ru: Стандартный формат квот VFS v0, позволяет работать с 32-битными UID и GID и ограничениями по квотам до 2^42 байт и 2^32 inode.

source: A quota format that can handle 32-bit UIDs and GIDs and quota limits of 2^64 bytes and 2^64 inodes.
ru: Данный формат квот позволяет работать с 32-битными UID и GID и ограничениями по квотам до 2^64 байт и 2^64 inode.

source: The I<addr> argument points to the pathname of a file containing the quotas for the filesystem. The quota file must exist; it is normally created with the B<quotacheck>(8) program. This operation requires privilege (B<CAP_SYS_ADMIN>).
ru: Аргумент I<addr> представляет собой указатель на путь к файлу, в котором содержатся квоты файловой системы. Файл квот должен существовать; обычно он создаётся с помощью программы B<quotacheck>(8). Данная операция требует дополнительных прав (B<CAP_SYS_ADMIN>).

source: Turn off quotas for a filesystem. The I<addr> and I<id> arguments are ignored. This operation requires privilege (B<CAP_SYS_ADMIN>).
ru: Выключает учёт квот в файловой системе. Аргументы I<addr> и I<id> игнорируются. Данная операция требует дополнительных прав (B<CAP_SYS_ADMIN>).

source: Get disk quota limits and current usage for user or group I<id>. The I<addr> argument is a pointer to a I<dqblk> structure defined in I<E<lt>sys/quota.hE<gt>> as follows:
ru: Возвращает данные по лимитам и текущее значение использованного пространства для пользователя или группы с заданным I<id>. Аргумент I<addr> является указателем на структуру I<dqblk>, определённую в I<E<lt>sys/quota.hE<gt>> следующим образом:

source: /* uint64_t is an unsigned 64-bit integer; uint32_t is an unsigned 32-bit integer */
ru: /* uint64_t имеет тип unsigned 64-bit integer; uint32_t имеет тип unsigned 32-bit integer */

source: struct dqblk { /* Definition since Linux 2.4.22 */ uint64_t dqb_bhardlimit; /* Absolute limit on disk quota blocks alloc */ uint64_t dqb_bsoftlimit; /* Preferred limit on disk quota blocks */ uint64_t dqb_curspace; /* Current occupied space (in bytes) */ uint64_t dqb_ihardlimit; /* Maximum number of allocated inodes */ uint64_t dqb_isoftlimit; /* Preferred inode limit */ uint64_t dqb_curinodes; /* Current number of allocated inodes */ uint64_t dqb_btime; /* Time limit for excessive disk use */ uint64_t dqb_itime; /* Time limit for excessive files */ uint32_t dqb_valid; /* Bit mask of QIF_* constants */ };
ru: struct dqblk { /* определение, действующее с Linux 2.4.22 */ uint64_t dqb_bhardlimit; /* абсолютный лимит на выделяемые блоки дисковых квот */ uint64_t dqb_bsoftlimit; /* предпочтительный лимит на выделяемые блоки дисковых квот */ uint64_t dqb_curspace; /* занятое в данный момент пространство (в байтах) */ uint64_t dqb_ihardlimit; /* максимальное количество выделенных инод */ uint64_t dqb_isoftlimit; /* предпочтительный лимит на иноды */ uint64_t dqb_curinodes; /* текущее количество выделенных инод */ uint64_t dqb_btime; /* временной лимит по превышению использования диска */ uint64_t dqb_itime; /* временной лимит по превышению файлов */ uint32_t dqb_valid; /* битовая маска констант QIF_* */ };

source: /* Flags in dqb_valid that indicate which fields in dqblk structure are valid. */
ru: /* Флаги в dqb_valid указывают, какие поля в структуре dqblk являются рабочими. */

source: The I<dqb_valid> field is a bit mask that is set to indicate the entries in the I<dqblk> structure that are valid. Currently, the kernel fills in all entries of the I<dqblk> structure and marks them as valid in the I<dqb_valid> field. Unprivileged users may retrieve only their own quotas; a privileged user (B<CAP_SYS_ADMIN>) can retrieve the quotas of any user.
ru: Поле I<dqb_valid> представляет собой битовую маску, показывающую какие поля в структуре I<dqblk> являются рабочими. В настоящее время ядро заполняется все поля структуры I<dqblk> и маркирует их как рабочие в поле I<dqb_valid>. Непривилегированные пользователи могут получить данные только по своим квотам; привилегированный пользователь (имеющий мандат B<CAP_SYS_ADMIN>) может получить данные по квотам любого пользователя.

source: B<Q_GETNEXTQUOTA> (since Linux 4.6)
ru: B<Q_GETNEXTQUOTA> (начиная с Linux 4.6)

source: This operation is the same as B<Q_GETQUOTA>, but it returns quota information for the next ID greater than or equal to I<id> that has a quota set.
ru: Эта операция подобна B<Q_GETQUOTA>, но возвращает информацию о квоте для следующего ID, большего или равного I<id>, у которого установлена квота.

source: The I<addr> argument is a pointer to a I<nextdqblk> structure whose fields are as for the I<dqblk>, except for the addition of a I<dqb_id> field that is used to return the ID for which quota information is being returned:
ru: Аргумент I<addr> представляет собой указатель на структуру I<nextdqblk> с полями как у I<dqblk>, но имеющей дополнительное поле I<dqb_id>, используемое для возврата ID, для которого возвращается информация по квоте:

source: Set quota information for user or group I<id>, using the information supplied in the I<dqblk> structure pointed to by I<addr>. The I<dqb_valid> field of the I<dqblk> structure indicates which entries in the structure have been set by the caller. This operation supersedes the B<Q_SETQLIM> and B<Q_SETUSE> operations in the previous quota interfaces. This operation requires privilege (B<CAP_SYS_ADMIN>).
ru: Устанавливает квоты для пользователя или группы с указанным I<id>, используя информацию из структуры I<dqblk>, на которую указывает I<addr>. Полем I<dqb_valid> в структуре I<dqblk> определяется какие элементы структуры установлены вызывающим. Эта операция заменяет предоставляемые прежде операции работы с квотами B<Q_SETQLIM> и B<Q_SETUSE>. Эта операция требует дополнительных прав (B<CAP_SYS_ADMIN>).

source: B<Q_GETINFO> (since Linux 2.4.22)
ru: B<Q_GETINFO> (начиная с Linux 2.4.22)

source: Get information (like grace times) about quotafile. The I<addr> argument should be a pointer to a I<dqinfo> structure. This structure is defined in I<E<lt>sys/quota.hE<gt>> as follows:
ru: Возвращает информацию (например, льготное время (grace times)) о quotafile. Аргумент I<addr> должен содержать указатель на структуру I<dqinfo>. Эта структура определена в I<E<lt>sys/quota.hE<gt>> следующим образом:

source: struct dqinfo { /* Defined since kernel 2.4.22 */ uint64_t dqi_bgrace; /* Time before block soft limit becomes hard limit */ uint64_t dqi_igrace; /* Time before inode soft limit becomes hard limit */ uint32_t dqi_flags; /* Flags for quotafile (DQF_*) */ uint32_t dqi_valid; };
ru: struct dqinfo { /* определена начиная с ядра 2.4.22 */ uint64_t dqi_bgrace; /* период времени, после которого блоковый необязательный лимит становится обязательным */ uint64_t dqi_igrace; /* период времени, после которого инодовый необязательный лимит становится обязательным */ uint32_t dqi_flags; /* флаги quotafile (DQF_*) */ uint32_t dqi_valid; };

source: /* Bits for dqi_flags */
ru: /* биты из dqi_flags */

source: /* Quota format QFMT_VFS_OLD */
ru: /* формат квот QFMT_VFS_OLD */

source: #define DQF_ROOT_SQUASH (1 E<lt>E<lt> 0) /* Root squash enabled */ /* Before Linux v4.0, this had been defined privately as V1_DQF_RSQUASH */
ru: #define DQF_ROOT_SQUASH (1 E<lt>E<lt> 0) /* включено ограничение для */ /* суперпользователя; до Linux v4.0 это было закрытым определением с именем V1_DQF_RSQUASH */

source: /* Quota format QFMT_VFS_V0 / QFMT_VFS_V1 */
ru: /* формат квот QFMT_VFS_V0 / QFMT_VFS_V1 */

source: #define DQF_SYS_FILE (1 E<lt>E<lt> 16) /* Quota stored in a system file */
ru: #define DQF_SYS_FILE (1 E<lt>E<lt> 16) /* квота хранится в системном файле */

source: /* Flags in dqi_valid that indicate which fields in dqinfo structure are valid. */
ru: /* флаги в dqi_valid, которые показывают какие поля в структуре dqinfo рабочие. */

source: The I<dqi_valid> field in the I<dqinfo> structure indicates the entries in the structure that are valid. Currently, the kernel fills in all entries of the I<dqinfo> structure and marks them all as valid in the I<dqi_valid> field. The I<id> argument is ignored.
ru: Значение поля I<dqi_valid> в структуре I<dqinfo> указывает на рабочие элементы. В настоящее время ядро заполняет все элементы структуры I<dqinfo> и помечает их как рабочие в поле I<dqi_valid>. Аргумент I<id> игнорируется.

source: B<Q_SETINFO> (since Linux 2.4.22)
ru: B<Q_SETINFO> (начиная с Linux 2.4.22)

source: Set information about quotafile. The I<addr> argument should be a pointer to a I<dqinfo> structure. The I<dqi_valid> field of the I<dqinfo> structure indicates the entries in the structure that have been set by the caller. This operation supersedes the B<Q_SETGRACE> and B<Q_SETFLAGS> operations in the previous quota interfaces. The I<id> argument is ignored. This operation requires privilege (B<CAP_SYS_ADMIN>).
ru: Задаёт информацию о quotafile. Значение аргумента I<addr> должно быть указателем на структуру I<dqinfo>. Полем I<dqi_valid> в структуре I<dqinfo> определяется, какие элементы структуры установлены вызывающим. Эта операция заменяет операции B<Q_SETGRACE> и B<Q_SETFLAGS> из предоставляемых прежде операций работы с квотами. Аргумент I<id> игнорируется. Эта операция требует дополнительных прав (B<CAP_SYS_ADMIN>).

source: B<Q_GETFMT> (since Linux 2.4.22)
ru: B<Q_GETFMT> (начиная с Linux 2.4.22)

source: Get quota format used on the specified filesystem. The I<addr> argument should be a pointer to a 4-byte buffer where the format number will be stored.
ru: Возвращает формат квоты, используемый в указанной файловой системе. В аргументе I<addr> должен содержаться указатель на 4-байтовый буфер, в который будет записан номер формата.

source: Update the on-disk copy of quota usages for a filesystem. If I<special> is NULL, then all filesystems with active quotas are sync'ed. The I<addr> and I<id> arguments are ignored.
ru: Обновляет дисковую копию используемых квот в файловой системе. Если значение I<special> равно NULL, то действующие квоты будут синхронизированы на всех файловых системах. Аргументы I<addr> и I<id> игнорируются.

source: B<Q_GETSTATS> (supported up to Linux 2.4.21)
ru: B<Q_GETSTATS> (поддерживалась до Linux 2.4.21)

source: Get statistics and other generic information about the quota subsystem. The I<addr> argument should be a pointer to a I<dqstats> structure in which data should be stored. This structure is defined in I<E<lt>sys/quota.hE<gt>>. The I<special> and I<id> arguments are ignored.
ru: Возвращает статистику и другую общую информацию о подсистеме квот. Аргумент I<addr> должен содержать указатель на структуру I<dqstats>, в которую нужно сохранить данные. Эта структура определена в I<E<lt>sys/quota.hE<gt>>. Аргументы I<special> и I<id> игнорируются.

source: This operation is obsolete and was removed in Linux 2.4.22. Files in I</proc/sys/fs/quota/> carry the information instead.
ru: Эта операция устарела и была удалена в Linux 2.4.22. Информацию можно получить из файлов в I</proc/sys/fs/quota/>.

source: For XFS filesystems making use of the XFS Quota Manager (XQM), the above commands are bypassed and the following commands are used:
ru: Для файловых систем XFS, использующих XFS Quota Manager (XQM), приведённые выше команды не выполняются, а используются следующие команды:

source: Turn on quotas for an XFS filesystem. XFS provides the ability to turn on/off quota limit enforcement with quota accounting. Therefore, XFS expects I<addr> to be a pointer to an I<unsigned int> that contains a combination of the following flags (defined in I<E<lt>xfs/xqm.hE<gt>>):
ru: Включает квоты в файловой системе XFS. XFS позволяет включать/выключать лимиты по квотам с ведением учёта. Поэтому для XFS в I<addr> ожидается указатель на I<unsigned int>, который представляет собой комбинацию следующих флагов (определены в I<E<lt>xfs/xqm.hE<gt>>):

source: #define XFS_QUOTA_UDQ_ACCT (1E<lt>E<lt>0) /* User quota accounting */ #define XFS_QUOTA_UDQ_ENFD (1E<lt>E<lt>1) /* User quota limits enforcement */ #define XFS_QUOTA_GDQ_ACCT (1E<lt>E<lt>2) /* Group quota accounting */ #define XFS_QUOTA_GDQ_ENFD (1E<lt>E<lt>3) /* Group quota limits enforcement */ #define XFS_QUOTA_PDQ_ACCT (1E<lt>E<lt>4) /* Project quota accounting */ #define XFS_QUOTA_PDQ_ENFD (1E<lt>E<lt>5) /* Project quota limits enforcement */
ru: #define XFS_QUOTA_UDQ_ACCT (1E<lt>E<lt>0) /* учёт пользовательских квот */ #define XFS_QUOTA_UDQ_ENFD (1E<lt>E<lt>1) /* применение лимитов пользовательских квот */ #define XFS_QUOTA_GDQ_ACCT (1E<lt>E<lt>2) /* учёт групповых квот */ #define XFS_QUOTA_GDQ_ENFD (1E<lt>E<lt>3) /* применение лимитов групповых квот */ #define XFS_QUOTA_PDQ_ACCT (1E<lt>E<lt>4) /* учёт проектных квот */ #define XFS_QUOTA_PDQ_ENFD (1E<lt>E<lt>5) /* применение лимитов проектных квот */

source: This operation requires privilege (B<CAP_SYS_ADMIN>). The I<id> argument is ignored.
ru: Для этой операции требуются права (B<CAP_SYS_ADMIN>). Аргумент I<id> игнорируется.
