Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_q/*.po
Languages: ru

source: Turn off quotas for an XFS filesystem. As with B<Q_QUOTAON>, XFS filesystems expect a pointer to an I<unsigned int> that specifies whether quota accounting and/or limit enforcement need to be turned off (using the same flags as for B<Q_XQUOTAON> subcommand). This operation requires privilege (B<CAP_SYS_ADMIN>). The I<id> argument is ignored.
ru: Выключает квоты для файловой системы XFS. Как в B<Q_QUOTAON>, для файловых систем XFS ожидается указатель на I<unsigned int>, в котором задаётся что нужно отключить: учёт или применение квот (используются флаги из операции B<Q_XQUOTAON>). Эта операция требует прав (B<CAP_SYS_ADMIN>). Аргумент I<id> игнорируется.

source: Get disk quota limits and current usage for user I<id>. The I<addr> argument is a pointer to an I<fs_disk_quota> structure, which is defined in I<E<lt>xfs/xqm.hE<gt>> as follows:
ru: Возвращает данные по лимитам и текущее значение использованного пространства для пользователя I<id>. Аргумент I<addr> является указателем на структуру I<fs_disk_quota>, определённую в I<E<lt>xfs/xqm.hE<gt>> следующим образом:

source: /* All the blk units are in BBs (Basic Blocks) of 512 bytes. */
ru: /* все части blk в BB (Basic Blocks) размером 512 байт */

source: #define XFS_USER_QUOTA (1E<lt>E<lt>0) /* User quota type */ #define XFS_PROJ_QUOTA (1E<lt>E<lt>1) /* Project quota type */ #define XFS_GROUP_QUOTA (1E<lt>E<lt>2) /* Group quota type */
ru: #define XFS_USER_QUOTA (1E<lt>E<lt>0) /* тип пользовательской квоты */ #define XFS_PROJ_QUOTA (1E<lt>E<lt>1) /* тип проектной квоты */ #define XFS_GROUP_QUOTA (1E<lt>E<lt>2) /* тип групповой квоты */

source: struct fs_disk_quota { int8_t d_version; /* Version of this structure */ int8_t d_flags; /* XFS_{USER,PROJ,GROUP}_QUOTA */ uint16_t d_fieldmask; /* Field specifier */ uint32_t d_id; /* User, project, or group ID */ uint64_t d_blk_hardlimit; /* Absolute limit on disk blocks */ uint64_t d_blk_softlimit; /* Preferred limit on disk blocks */ uint64_t d_ino_hardlimit; /* Maximum # allocated inodes */ uint64_t d_ino_softlimit; /* Preferred inode limit */ uint64_t d_bcount; /* # disk blocks owned by the user */ uint64_t d_icount; /* # inodes owned by the user */ int32_t d_itimer; /* Zero if within inode limits */ /* If not, we refuse service */ int32_t d_btimer; /* Similar to above; for disk blocks */ uint16_t d_iwarns; /* # warnings issued with respect to # of inodes */ uint16_t d_bwarns; /* # warnings issued with respect to disk blocks */ int32_t d_padding2; /* Padding - for future use */ uint64_t d_rtb_hardlimit; /* Absolute limit on realtime (RT) disk blocks */ uint64_t d_rtb_softlimit; /* Preferred limit on RT disk blocks */ uint64_t d_rtbcount; /* # realtime blocks owned */ int32_t d_rtbtimer; /* Similar to above; for RT disk blocks */ uint16_t d_rtbwarns; /* # warnings issued with respect to RT disk blocks */ int16_t d_padding3; /* Padding - for future use */ char d_padding4[8]; /* Yet more padding */ };
ru: struct fs_disk_quota { int8_t d_version; /* версия данной структуры */ int8_t d_flags; /* XFS_{USER,PROJ,GROUP}_QUOTA */ uint16_t d_fieldmask; /* определитель поля */ uint32_t d_id; /* ID пользователя, группы или проекта */ uint64_t d_blk_hardlimit; /* абсолютный лимит на дисковые блоки */ uint64_t d_blk_softlimit; /* предпочтительный лимит на дисковые блоки */ uint64_t d_ino_hardlimit; /* максимальное кол-во выделяемых инод */ uint64_t d_ino_softlimit; /* предпочтительный лимит на иноды */ uint64_t d_bcount; /* # кол-во дисковых блоков, принадлежащих пользователю */ uint64_t d_icount; /* # кол-во инод, принадлежащих пользователю */ int32_t d_itimer; /* ноль, если лимит на иноды не превышен */ /* если нет, то нам отказывают */ int32_t d_btimer; /* подобное предыдущему, но для дисковых блоков */ uint16_t d_iwarns; /* кол-во предупреждений в соответствии с кол-вом инод */ uint16_t d_bwarns; /* кол-во предупреждений в соответствии с кол-вом дисковых блоков */ int32_t d_padding2; /* заполнитель, для использования в будущем */ uint64_t d_rtb_hardlimit; /* абсолютный лимит на работу с дисковыми блоками в реальном времени (RT) */ uint64_t d_rtb_softlimit; /* предпочтительный лимит на дисковые блоки в RT */ uint64_t d_rtbcount; /* кол-во дисковых блоков под реальное время */ int32_t d_rtbtimer; /* подобное предыдущему, но для дисковых блоков RT */ uint16_t d_rtbwarns; /* кол-во предупреждений в соответствии с дисковыми блоками RT */ int16_t d_padding3; /* заполнитель, для использования в будущем */ char d_padding4[8]; /* ещё заполнитель */ };

source: Unprivileged users may retrieve only their own quotas; a privileged user (B<CAP_SYS_ADMIN>) may retrieve the quotas of any user.
ru: Непривилегированные пользователи могут получить данные только по своим квотам; привилегированный пользователь (с B<CAP_SYS_ADMIN>) может получить информацию о квотах любого пользователя.

source: B<Q_XGETNEXTQUOTA> (since Linux 4.6)
ru: B<Q_XGETNEXTQUOTA> (начиная с Linux 4.6)

source: This operation is the same as B<Q_XGETQUOTA>, but it returns (in the I<fs_disk_quota> structure pointed by I<addr>) quota information for the next ID greater than or equal to I<id> that has a quota set. Note that since I<fs_disk_quota> already has I<q_id> field, no separate structure type is needed (in contrast with B<Q_GETQUOTA> and B<Q_GETNEXTQUOTA> commands)
ru: Эта операция подобна B<Q_XGETQUOTA>, но возвращает (in the I<fs_disk_quota> structure pointed by I<addr>) информацию о квоте для следующего ID, большего или равного I<id>, у которого установлена квота. Заметим, что так как в I<fs_disk_quota> уже есть поле I<q_id>, то отдельного типа для структуры не требуется (как для B<Q_GETQUOTA> и B<Q_GETNEXTQUOTA>).

source: Set disk quota limits for user I<id>. The I<addr> argument is a pointer to an I<fs_disk_quota> structure. This operation requires privilege (B<CAP_SYS_ADMIN>).
ru: Устанавливает дисковую квоту для пользователя с указанным I<id>. В аргументе I<addr> задаётся указатель на структуру I<fs_disk_quota>. Эта операция требует прав (B<CAP_SYS_ADMIN>).

source: Returns XFS filesystem-specific quota information in the I<fs_quota_stat> structure pointed by I<addr>. This is useful for finding out how much space is used to store quota information, and also to get the quota on/off status of a given local XFS filesystem. The I<fs_quota_stat> structure itself is defined as follows:
ru: Возвращает доступную только в XFS информацию о квоте в структуре I<fs_quota_stat>, на которую указывает I<addr>. Это полезно для определения количества пространства, использованного для хранения информации о квоте, а также для получения состояния включения/отключения квоты определённой локальной файловой системы XFS. Структура I<fs_quota_stat> определена следующим образом:

source: struct fs_qfilestat { uint64_t qfs_ino; /* Inode number */ uint64_t qfs_nblks; /* Number of BBs 512-byte-blocks */ uint32_t qfs_nextents; /* Number of extents */ };
ru: struct fs_qfilestat { uint64_t qfs_ino; /* номер иноды */ uint64_t qfs_nblks; /* количество BB блоков размером 512 байт */ uint32_t qfs_nextents; /* количество экстентов */ };

source: struct fs_quota_stat { int8_t qs_version; /* Version number for future changes */ uint16_t qs_flags; /* XFS_QUOTA_{U,P,G}DQ_{ACCT,ENFD} */ int8_t qs_pad; /* Unused */ struct fs_qfilestat qs_uquota; /* User quota storage information */ struct fs_qfilestat qs_gquota; /* Group quota storage information */ uint32_t qs_incoredqs; /* Number of dquots in core */ int32_t qs_btimelimit; /* Limit for blocks timer */ int32_t qs_itimelimit; /* Limit for inodes timer */ int32_t qs_rtbtimelimit;/* Limit for RT blocks timer */ uint16_t qs_bwarnlimit; /* Limit for # of warnings */ uint16_t qs_iwarnlimit; /* Limit for # of warnings */ };
ru: struct fs_quota_stat { int8_t qs_version; /* номер версии для изменений в будущем */ uint16_t qs_flags; /* XFS_QUOTA_{U,P,G}DQ_{ACCT,ENFD} */ int8_t qs_pad; /* не используется */ struct fs_qfilestat qs_uquota; /* информация о хранилище пользовательской квоты */ struct fs_qfilestat qs_gquota; /* информация о хранилище групповой квоты */ uint32_t qs_incoredqs; /* количество dquots в ядре */ int32_t qs_btimelimit; /* лимит для таймера на блоки*/ int32_t qs_itimelimit; /* лимит для таймера на иноды */ int32_t qs_rtbtimelimit;/* лимит для таймера на блоки RT */ uint16_t qs_bwarnlimit; /* лимит на количество предупреждений */ uint16_t qs_iwarnlimit; /* лимит на количество предупреждений */ };

source: The I<id> argument is ignored.
ru: Аргумент I<id> игнорируется.

source: Returns XFS filesystem-specific quota information in the I<fs_quota_statv> pointed to by I<addr>. This version of the command uses a structure with proper versioning support, along with appropriate layout (all fields are naturally aligned) and padding to avoiding special compat handling; it also provides the ability to get statistics regarding the project quota file. The I<fs_quota_statv> structure itself is defined as follows:
ru: Возвращает доступную только в XFS информацию о квоте в структуре I<fs_quota_statv>, на которую указывает I<addr>. Данная версия операции учитывается версию структуры, а также соответствие расположения (все поля корректно выровнены) и заполнителей, чтобы не выполнять обработку совместимости; также она предоставляет возможность получения статистики оп файлу квот проекта. Структура I<fs_quota_statv> определена следующим образом:

source: struct fs_qfilestatv { uint64_t qfs_ino; /* Inode number */ uint64_t qfs_nblks; /* Number of BBs 512-byte-blocks */ uint32_t qfs_nextents; /* Number of extents */ uint32_t qfs_pad; /* Pad for 8-byte alignment */ };
ru: struct fs_qfilestatv { uint64_t qfs_ino; /* номер иноды */ uint64_t qfs_nblks; /* количество BB блоков размером 512 байт */ uint32_t qfs_nextents; /* количество экстентов */ uint32_t qfs_pad; /* заполнитель для 8-байтового выравнивания */ };

source: struct fs_quota_statv { int8_t qs_version; /* Version for future changes */ uint8_t qs_pad1; /* Pad for 16-bit alignment */ uint16_t qs_flags; /* XFS_QUOTA_.* flags */ uint32_t qs_incoredqs; /* Number of dquots incore */ struct fs_qfilestatv qs_uquota; /* User quota information */ struct fs_qfilestatv qs_gquota; /* Group quota information */ struct fs_qfilestatv qs_pquota; /* Project quota information */ int32_t qs_btimelimit; /* Limit for blocks timer */ int32_t qs_itimelimit; /* Limit for inodes timer */ int32_t qs_rtbtimelimit; /* Limit for RT blocks timer */ uint16_t qs_bwarnlimit; /* Limit for # of warnings */ uint16_t qs_iwarnlimit; /* Limit for # of warnings */ uint64_t qs_pad2[8]; /* For future proofing */ };
ru: struct fs_quota_statv { int8_t qs_version; /* версия для изменений в будущем */ uint8_t qs_pad1; /* заполнитель для 16-битного выравнивания */ uint16_t qs_flags; /* флаги XFS_QUOTA_.* */ uint32_t qs_incoredqs; /* количество dquots incore */ struct fs_qfilestatv qs_uquota; /* информация о пользовательской квоте */ struct fs_qfilestatv qs_gquota; /* информация о групповой квоте */ struct fs_qfilestatv qs_pquota; /* информация о проектной квоте */ int32_t qs_btimelimit; /* лимит по таймеру на блоки */ int32_t qs_itimelimit; /* лимит по таймеру на иноды */ int32_t qs_rtbtimelimit; /* лимит по таймеру на блоки RT */ uint16_t qs_bwarnlimit; /* лимит на кол-во предупреждений */ uint16_t qs_iwarnlimit; /* лимит на кол-во предупреждений */ uint64_t qs_pad2[8]; /* для использования в будущем */ };

source: The I<qs_version> field of the structure should be filled with the version of the structure supported by the callee (for now, only I<FS_QSTAT_VERSION1> is supported). The kernel will fill the structure in accordance with version provided. The I<id> argument is ignored.
ru: Поле I<qs_version> должно быть заполнено версией структуры, поддерживаемой вызываемым (пока поддерживается только I<FS_QSTAT_VERSION1>). Ядро заполнит структуру согласно предоставленной версии. Аргумент I<id> игнорируется.

source: Free the disk space taken by disk quotas. The I<addr> argument should be a pointer to an I<unsigned int> value containing flags (the same as in I<d_flags> field of I<fs_disk_quota> structure) which identify what types of quota should be removed (note that the quota type passed in the I<cmd> argument is ignored, but should remain valid in order to pass preliminary quotactl syscall handler checks).
ru: Освободить место на диске, занятое квотами. В аргументе I<addr> должен быть указатель на значение I<unsigned int>, содержащее флаги (те же, что и для поля I<d_flags> структуры I<fs_disk_quota>), которые показывают какие типы квот должны быть удалены (заметим, что тип квот, передаваемый в аргументе I<cmd>, игнорируется, но должен быть корректным, чтобы пройти предварительные проверки обработчика системного вызова quotactl).

source: Quotas must have already been turned off. The I<id> argument is ignored.
ru: Квоты должны быть предварительно выключены. Аргумент I<id> игнорируется.

source: B<Q_XQUOTASYNC> (since Linux 2.6.15; no-op since Linux 3.4)
ru: B<Q_XQUOTASYNC> (начиная с Linux 2.6.15; ничего не делает начиная с Linux 3.4)

source: This command was an XFS quota equivalent to I<Q_SYNC>, but it is no-op since Linux 3.4, as B<sync>(1) writes quota information to disk now (in addition to the other filesystem metadata that it writes out). The I<special>, I<id> and I<addr> arguments are ignored.
ru: Данная команда была эквивалентом I<Q_SYNC> в XFS, но начиная с Linux 3.4 она ничего не делает, так как информации о квоте на диск теперь записывает B<sync>(1) (вместе с записью других метаданных файловой системы). Аргументы I<special>, I<id> и I<addr> игнорируются.

source: On success, B<quotactl>() returns 0; on error -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<quotactl>() возвращается 0; при ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: I<cmd> is B<Q_QUOTAON>, and the quota file pointed to by I<addr> exists, but is not a regular file or is not on the filesystem pointed to by I<special>.
ru: Значение I<cmd> равно B<Q_QUOTAON> и файл квот, указанный в I<addr>, существует, но не является обычным файлом или находится не в файловой системе, указанной в I<special>.

source: I<cmd> is B<Q_QUOTAON>, but another B<Q_QUOTAON> had already been performed.
ru: Значение I<cmd> равно B<Q_QUOTAON>, но уже выполняется другой запуск B<Q_QUOTAON>.

source: I<addr> or I<special> is invalid.
ru: Неверное значение I<addr> или I<special>.

source: I<cmd> or I<type> is invalid.
ru: Неверное значение I<cmd> или I<type>.

source: I<cmd> is B<Q_QUOTAON>, but the specified quota file is corrupted.
ru: Значение I<cmd> равно B<Q_QUOTAON>, но указанный файл квот повреждён.

source: The file specified by I<special> or I<addr> does not exist.
ru: Файл, указанный в I<special> или I<addr>, не существует.

source: The kernel has not been compiled with the B<CONFIG_QUOTA> option.
ru: Ядро собрано с выключенным параметром B<CONFIG_QUOTA>.

source: I<special> is not a block device.
ru: Значение I<special> не указывает на блочное устройство.

source: The caller lacked the required privilege (B<CAP_SYS_ADMIN>) for the specified operation.
ru: Вызывающий не имеет необходимых прав (B<CAP_SYS_ADMIN>) для выполнения указанной операции.

source: I<cmd> is B<Q_SETQUOTA>, but the specified limits are out of the range allowed by the quota format.
ru: Значение I<cmd> равно B<Q_SETQUOTA>, но заданный лимит вне диапазона допустимого форматом квот.

source: No disk quota is found for the indicated user. Quotas have not been turned on for this filesystem.
ru: Не найдена дисковая квота для заданного пользователя. Квоты выключены в файловой системе.

source: I<cmd> is B<Q_QUOTAON>, but the specified quota format was not found.
ru: Значение I<cmd> равно B<Q_QUOTAON>, но заданный формат квот не найден.

source: I<cmd> is B<Q_GETNEXTQUOTA> or B<Q_XGETNEXTQUOTA>, but there is no ID greater than or equal to I<id> that has an active quota.
ru: Значение I<cmd> равно B<Q_GETNEXTQUOTA> или B<Q_XGETNEXTQUOTA>, но нет ID, который больше или равен I<id> с активной квотой.

source: Instead of I<E<lt>xfs/xqm.hE<gt>> one can use I<E<lt>linux/dqblk_xfs.hE<gt>>, taking into account that there are several naming discrepancies:
ru: Вместо I<E<lt>xfs/xqm.hE<gt>> может быть использован I<E<lt>linux/dqblk_xfs.hE<gt>>, но следует учесть, что есть несколько несоответствий названий:

source: Quota enabling flags (of format B<XFS_QUOTA_[UGP]DQ_{ACCT,ENFD}>) are defined without a leading "X", as B<FS_QUOTA_[UGP]DQ_{ACCT,ENFD}>.
ru: Флаги включения квот (формата B<XFS_QUOTA_[UGP]DQ_{ACCT,ENFD}>) определены без начального «X» в виде B<FS_QUOTA_[UGP]DQ_{ACCT,ENFD}>.

source: The same is true for B<XFS_{USER,GROUP,PROJ}_QUOTA> quota type flags, which are defined as B<FS_{USER,GROUP,PROJ}_QUOTA>.
ru: Это же верно и для флагов типов квот B<XFS_{USER,GROUP,PROJ}_QUOTA>, которые определены как B<FS_{USER,GROUP,PROJ}_QUOTA>.

source: The I<dqblk_xfs.h> header file defines its own B<XQM_USRQUOTA>, B<XQM_GRPQUOTA>, and B<XQM_PRJQUOTA> constants for the available quota types, but their values are the same as for constants without the B<XQM_> prefix.
ru: В заголовочном файле I<dqblk_xfs.h> определены свои константы B<XQM_USRQUOTA>, B<XQM_GRPQUOTA> и B<XQM_PRJQUOTA> для доступных типов квот, но их значения совпадают с константами без префикса B<XQM_>.

source: qsort, qsort_r - sort an array
ru: qsort, qsort_r - сортировка массива

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: The B<qsort>() function sorts an array with I<nmemb> elements of size I<size>. The I<base> argument points to the start of the array.
ru: Функция B<qsort>() сортирует массив из I<nmemb> размером I<size>. Аргумент I<base> указывает на начало массива.

source: The contents of the array are sorted in ascending order according to a comparison function pointed to by I<compar>, which is called with two arguments that point to the objects being compared.
ru: Содержимое массива сортируется в соответствии с функцией сравнения, на которую ссылается I<compar>, вызываемой вместе с двумя аргументами, которые ссылаются на сравниваемые объекты.

source: The comparison function must return an integer less than, equal to, or greater than zero if the first argument is considered to be respectively less than, equal to, or greater than the second. If two members compare as equal, their order in the sorted array is undefined.
ru: Функция сравнения должна вернуть целое, меньшее, равное и большее нуля для случаев, когда первый аргумент меньше, равен или больше второго соответственно. Если оба элемента сравнения равны, порядок их сортировки в массиве не будет определен.

source: The B<qsort_r>() function is identical to B<qsort>() except that the comparison function I<compar> takes a third argument. A pointer is passed to the comparison function via I<arg>. In this way, the comparison function does not need to use global variables to pass through arbitrary arguments, and is therefore reentrant and safe to use in threads.
ru: Функция B<qsort_r>() идентична B<qsort>(), за исключением того, что в функцию сравнения I<compar> добавлен третий аргумент. Указатель передаётся в функцию сравнения через аргумент I<arg>. Таким образом, функции сравнения не требуется глобальные переменные для передачи произвольных аргументов, и поэтому она реентерабельна и её можно безопасно использовать в нитях.

source: The B<qsort>() and B<qsort_r>() functions return no value.
ru: Функции B<qsort>() и B<qsort_r>() ничего не возвращают.

source: B<qsort_r>() was added to glibc in version 2.8.
ru: Функция B<qsort_r>() впервые появилась в glibc 2.8.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: To compare C strings, the comparison function can call B<strcmp>(3), as shown in the example below.
ru: Для сравнения C-строк в качестве функции сравнения можно использовать B<strcmp>(3), как это указано ниже.

source: EXAMPLE
ru: ПРИМЕР

source: For one example of use, see the example under B<bsearch>(3).
ru: Для примера использования смотрите пример, указанный в B<bsearch>(3).

source: Another example is the following program, which sorts the strings given in its command-line arguments:
ru: Еще один пример программы, сортирующей строки, переданные в качестве аргументов через командную строку:

source: static int cmpstringp(const void *p1, const void *p2) { /* The actual arguments to this function are "pointers to pointers to char", but strcmp(3) arguments are "pointers to char", hence the following cast plus dereference */
ru: static int cmpstringp(const void *p1, const void *p2) { /* Аргументами данной функции являются "pointers to pointers to char", однако аргументами strcmp(3) являются "pointers to char", так что здесь происходит преобразование и разыменовывание ссылок */

source: if (argc E<lt> 2) { fprintf(stderr, "Usage: %s E<lt>stringE<gt>...\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 2) { fprintf(stderr, "Использование: %s E<lt>stringE<gt>...\en", argv[0]); exit(EXIT_FAILURE); }

source: February 7, 2015
ru: 7 февраля 2015 г.

source: implementations of singly-linked lists, singly-linked tail queues,
ru: реализации односвязных списков, односвязных хвостовых очередей,

source: lists and tail queues
ru: списков и хвостовых очередей

source: These macros define and operate on four types of data structures: singly-linked lists, singly-linked tail queues, lists, and tail queues. All four structures support the following functionality:
ru: Данные макросы определяют и управляют четырьмя типами структур данных: односвязными списками, односвязными хвостовыми очередями, списками и хвостовыми очередями. Все четыре структуры поддерживают следующие возможности:

source: Insertion of a new entry at the head of the list.
ru: Вставка нового элемента в начало списка.

source: Insertion of a new entry after any element in the list.
ru: Вставка нового элемента после любого элемента списка.

source: O(1) removal of an entry from the head of the list.
ru: Удаление элемента из начала списка за время O(1).

source: Forward traversal through the list.
ru: Обход списка из начала в конец.

source: Swapping the contents of two lists.
ru: Перестановка содержимого двух списков.

source: Singly-linked lists are the simplest of the four data structures and support only the above functionality. Singly-linked lists are ideal for applications with large datasets and few or no removals, or for implementing a LIFO queue. Singly-linked lists add the following functionality:
ru: Односвязные списки — самая простая из этих четырёх структур данных и поддерживает только указанные выше возможности. Односвязные списки идеальны для приложений с большими наборами данных, из которых производится очень мало удалений, или для реализации очереди LIFO (последним пришёл — первым ушёл). У односвязных списков есть дополнительное свойство:

source: O(n) removal of any entry in the list.
ru: Удаление любого элемента списка за время O(n).

source: Singly-linked tail queues add the following functionality:
ru: У односвязных хвостовых очередей есть дополнительные свойства:

source: Entries can be added at the end of a list.
ru: Добавление элементов в конец списка.

source: They may be concatenated.
ru: Возможность объединения.

source: However:
ru: Однако:

source: All list insertions must specify the head of the list.
ru: При вставке элементов нужно указывать начало списка.
