Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_q/*.po
Languages: ru

source: Each head entry requires two pointers rather than one.
ru: Каждый начальный элемент требует двух указателей вместо одного.

source: Code size is about 15% greater and operations run about 20% slower than singly-linked lists.
ru: Код примерно на 15% больше и на 20% медленнее, чем для односвязных списков.

source: Singly-linked tail queues are ideal for applications with large datasets and few or no removals, or for implementing a FIFO queue.
ru: Односвязные хвостовые очереди идеальны для приложений с большими наборами данных из которых производится очень мало удалений, или для реализации очереди FIFO (первым пришёл — первым ушёл).

source: All doubly linked types of data structures (lists and tail queues) additionally allow:
ru: Все двусвязные типы структур данных (списки и хвостовые очереди) дополнительно позволяют:

source: Insertion of a new entry before any element in the list.
ru: Вставку нового элемента перед любым элементом списка.

source: O(1) removal of any entry in the list.
ru: Удаление любого элемента списка за время O(1).

source: Each element requires two pointers rather than one.
ru: Для каждого элемента требуется два указателя вместо одного.

source: Code size and execution time of operations (except for removal) is about twice that of the singly-linked data-structures.
ru: Размер кода и время выполнения операций (кроме удаления) удваивается, по сравнению с односвязными структурами данных.

source: Linked lists are the simplest of the doubly linked data structures. They add the following functionality over the above:
ru: Связные списки — самая простая из двусвязных структур данных. К указанным выше возможностям для них возможно:

source: They may be traversed backwards.
ru: Обход в обратном направлении.

source: To traverse backwards, an entry to begin the traversal and the list in which it is contained must be specified.
ru: Для обхода в обратном направлении требуется указывать начало обхода и сам список.

source: Tail queues add the following functionality:
ru: У хвостовых очередей есть дополнительные свойства:

source: They may be traversed backwards, from tail to head.
ru: Обход может идти в обратном направлении, от конца к началу.

source: All list insertions and removals must specify the head of the list.
ru: При вставке и удалении элементов нужно указывать начало списка.

source: In the macro definitions, E<.Fa TYPE> is the name of a user defined structure, that must contain a field of type E<.Li SLIST_ENTRY>, E<.Li STAILQ_ENTRY>, E<.Li LIST_ENTRY>, or E<.Li TAILQ_ENTRY>, named E<.Fa NAME>. The argument E<.Fa HEADNAME> is the name of a user defined structure that must be declared using the macros E<.Li SLIST_HEAD>, E<.Li STAILQ_HEAD>, E<.Li LIST_HEAD>, or E<.Li TAILQ_HEAD>. See the examples below for further explanation of how these macros are used.
ru: В определениях макросов E<.Fa TYPE> — это имя определяемое пользователем структуры, которая должна содержать поле типа E<.Li SLIST_ENTRY>, E<.Li STAILQ_ENTRY>, E<.Li LIST_ENTRY> или E<.Li TAILQ_ENTRY>, названное E<.Fa NAME>. Аргумент E<.Fa HEADNAME> — это имя определяемое пользователем структуры, которая должна быть объявлена с помощью макроса E<.Li SLIST_HEAD>, E<.Li STAILQ_HEAD>, E<.Li LIST_HEAD> или E<.Li TAILQ_HEAD>. Ниже показаны примеры использования этих макросов.

source: Singly-linked lists
ru: Односвязные списки

source: A singly-linked list is headed by a structure defined by the E<.Nm SLIST_HEAD> macro. This structure contains a single pointer to the first element on the list. The elements are singly linked for minimum space and pointer manipulation overhead at the expense of O(n) removal for arbitrary elements. New elements can be added to the list after an existing element or at the head of the list. An E<.Fa SLIST_HEAD> structure is declared as follows:
ru: Односвязный список начинается со структуры, определённой макросом E<.Nm SLIST_HEAD>. В этой структуре содержится одиночный указатель на первый элемент списка. Элементы имеют по одной связи для минимизации занимаемого пространства, а дополнительный расход на операции с указателями равен O(n) при удалении произвольного элемента. Новые элементы можно добавлять в список после существующего элемента или в начало списка. Структура E<.Fa SLIST_HEAD> объявляется следующим образом:

source: where E<.Fa HEADNAME> is the name of the structure to be defined, and E<.Fa TYPE> is the type of the elements to be linked into the list. A pointer to the head of the list can later be declared as:
ru: где E<.Fa HEADNAME> — имя определяемой структуры, а E<.Fa TYPE> — тип элементов, объединяемых в список. Указатель на начало списка может в дальнейшем объявляться так:

source: (The names E<.Li head> and E<.Li headp> are user selectable.)
ru: (Имена E<.Li head> и E<.Li headp> могут выбираться пользователем.)

source: The macro E<.Nm SLIST_HEAD_INITIALIZER> evaluates to an initializer for the list E<.Fa head>.
ru: Макрос E<.Nm SLIST_HEAD_INITIALIZER> запускает инициализатор для E<.Fa head> списка.

source: The macro E<.Nm SLIST_EMPTY> evaluates to true if there are no elements in the list.
ru: Макрос E<.Nm SLIST_EMPTY> возвращает true, если в списке нет элементов.

source: The macro E<.Nm SLIST_ENTRY> declares a structure that connects the elements in the list.
ru: Макрос E<.Nm SLIST_ENTRY> объявляет структуру, которая добавляет элементы в список.

source: The macro E<.Nm SLIST_FIRST> returns the first element in the list or NULL if the list is empty.
ru: Макрос E<.Nm SLIST_FIRST> возвращает первый элемент списка или NULL, если список пуст.

source: The macro E<.Nm SLIST_FOREACH> traverses the list referenced by E<.Fa head> in the forward direction, assigning each element in turn to E<.Fa var>.
ru: Макрос E<.Nm SLIST_FOREACH> обходит список, на который ссылается E<.Fa head>, от начало в конец, назначая E<.Fa var> каждый элемент.

source: The macro E<.Nm SLIST_INIT> initializes the list referenced by E<.Fa head>.
ru: Макрос E<.Nm SLIST_INIT> инициализирует список, на который ссылается E<.Fa head>.

source: The macro E<.Nm SLIST_INSERT_HEAD> inserts the new element E<.Fa elm> at the head of the list.
ru: Макрос E<.Nm SLIST_INSERT_HEAD> вставляет новый элемент E<.Fa elm> в начало списка.

source: The macro E<.Nm SLIST_INSERT_AFTER> inserts the new element E<.Fa elm> after the element E<.Fa listelm>.
ru: Макрос E<.Nm SLIST_INSERT_AFTER> вставляет новый элемент E<.Fa elm> за элементом E<.Fa listelm>.

source: The macro E<.Nm SLIST_NEXT> returns the next element in the list.
ru: Макрос E<.Nm SLIST_NEXT> возвращает следующий элемент списка.

source: The macro E<.Nm SLIST_REMOVE_HEAD> removes the element E<.Fa elm> from the head of the list. For optimum efficiency, elements being removed from the head of the list should explicitly use this macro instead of the generic E<.Fa SLIST_REMOVE> macro.
ru: Макрос E<.Nm SLIST_REMOVE_HEAD> удаляет элемент E<.Fa elm> из начала списка. В целях эффективности удаления элемента из начала списка нужно использовать именно этот макрос вместо обычного E<.Fa SLIST_REMOVE>.

source: The macro E<.Nm SLIST_REMOVE> removes the element E<.Fa elm> from the list.
ru: Макрос E<.Nm SLIST_REMOVE> удаляет элемент E<.Fa elm> из списка.

source: Singly-linked list example
ru: Пример односвязного списка

source: SLIST_HEAD(slisthead, entry) head = SLIST_HEAD_INITIALIZER(head); struct slisthead *headp; /* Singly-linked List head. */ struct entry { ... SLIST_ENTRY(entry) entries; /* Singly-linked List. */ ... } *n1, *n2, *n3, *np;
ru: SLIST_HEAD(slisthead, entry) head = SLIST_HEAD_INITIALIZER(head); struct slisthead *headp; /* начало односвязного списка */ struct entry { ... SLIST_ENTRY(entry) entries; /* односвязный список */ ... } *n1, *n2, *n3, *np;

source: SLIST_INIT(&head); /* Initialize the list. */
ru: SLIST_INIT(&head); /* инициализация списка */

source: n1 = malloc(sizeof(struct entry)); /* Insert at the head. */ SLIST_INSERT_HEAD(&head, n1, entries);
ru: n1 = malloc(sizeof(struct entry)); /* вставка начального элемента */ SLIST_INSERT_HEAD(&head, n1, entries);

source: n2 = malloc(sizeof(struct entry)); /* Insert after. */ SLIST_INSERT_AFTER(n1, n2, entries);
ru: n2 = malloc(sizeof(struct entry)); /* вставка последующих */ SLIST_INSERT_AFTER(n1, n2, entries);

source: SLIST_REMOVE(&head, n2, entry, entries);/* Deletion. */ free(n2);
ru: SLIST_REMOVE(&head, n2, entry, entries);/* удаление */ free(n2);

source: n3 = SLIST_FIRST(&head); SLIST_REMOVE_HEAD(&head, entries); /* Deletion from the head. */ free(n3); /* Forward traversal. */ SLIST_FOREACH(np, &head, entries) np\-E<gt> ...
ru: n3 = SLIST_FIRST(&head); SLIST_REMOVE_HEAD(&head, entries); /* удаление начального элемента */ free(n3); /* обход из начала в конец */ SLIST_FOREACH(np, &head, entries) np\-E<gt> ...

source: while (!SLIST_EMPTY(&head)) { /* List Deletion. */ n1 = SLIST_FIRST(&head); SLIST_REMOVE_HEAD(&head, entries); free(n1); }
ru: while (!SLIST_EMPTY(&head)) { /* удаление списка */ n1 = SLIST_FIRST(&head); SLIST_REMOVE_HEAD(&head, entries); free(n1); }

source: Singly-linked tail queues
ru: Односвязные хвостовые очереди

source: A singly-linked tail queue is headed by a structure defined by the E<.Nm STAILQ_HEAD> macro. This structure contains a pair of pointers, one to the first element in the tail queue and the other to the last element in the tail queue. The elements are singly linked for minimum space and pointer manipulation overhead at the expense of O(n) removal for arbitrary elements. New elements can be added to the tail queue after an existing element, at the head of the tail queue, or at the end of the tail queue. A E<.Fa STAILQ_HEAD> structure is declared as follows:
ru: Односвязная хвостовая очередь начинается со структуры, определяемой макросом E<.Nm STAILQ_HEAD>. В этой структуре содержится пара указателей, один на первый элемент хвостовой очереди, а другой на последний элемент. Элементы имеют по одной связи для минимизации занимаемого пространства, а дополнительный расход на операции с указателями равен O(n) при удалении произвольного элемента. Новые элементы можно добавлять в хвостовую очередь после существующего элемента, в начало или конец хвостовой очереди, Структура E<.Fa STAILQ_HEAD> объявляется следующим образом:

source: where E<.Li HEADNAME> is the name of the structure to be defined, and E<.Li TYPE> is the type of the elements to be linked into the tail queue. A pointer to the head of the tail queue can later be declared as:
ru: где E<.Li HEADNAME> — имя определяемой структуры, а E<.Li TYPE> — тип связанных элементов в хвостовой очереди. Указатель на начало хвостовой очереди может в дальнейшем объявляться так:

source: The macro E<.Nm STAILQ_HEAD_INITIALIZER> evaluates to an initializer for the tail queue E<.Fa head>.
ru: Макрос E<.Nm STAILQ_HEAD_INITIALIZER> запускает инициализатор для E<.Fa head> хвостовой очереди.

source: The macro E<.Nm STAILQ_CONCAT> concatenates the tail queue headed by E<.Fa head2> onto the end of the one headed by E<.Fa head1> removing all entries from the former.
ru: Макрос E<.Nm STAILQ_CONCAT> добавляет хвостовую очередь с началом E<.Fa head2> в конец очереди с началом E<.Fa head1>, удаляя все элементы из первой.

source: The macro E<.Nm STAILQ_EMPTY> evaluates to true if there are no items on the tail queue.
ru: Макрос E<.Nm STAILQ_EMPTY> возвращает true, если в хвостовой очереди нет элементов.

source: The macro E<.Nm STAILQ_ENTRY> declares a structure that connects the elements in the tail queue.
ru: Макрос E<.Nm STAILQ_ENTRY> объявляет структуру, которая подключает элементы в хвостовую очередь.

source: The macro E<.Nm STAILQ_FIRST> returns the first item on the tail queue or NULL if the tail queue is empty.
ru: Макрос E<.Nm STAILQ_FIRST> возвращает первый элемент из хвостовой очереди или NULL, если очередь пуста.

source: The macro E<.Nm STAILQ_FOREACH> traverses the tail queue referenced by E<.Fa head> in the forward direction, assigning each element in turn to E<.Fa var>.
ru: Макрос E<.Nm STAILQ_FOREACH> обходит хвостовую очередь, на которую ссылается E<.Fa head>, из начала в конец, назначая E<.Fa var> каждый элемент.

source: The macro E<.Nm STAILQ_INIT> initializes the tail queue referenced by E<.Fa head>.
ru: Макрос E<.Nm STAILQ_INIT> инициализирует хвостовую очередь, на которую ссылается E<.Fa head>.

source: The macro E<.Nm STAILQ_INSERT_HEAD> inserts the new element E<.Fa elm> at the head of the tail queue.
ru: Макрос E<.Nm STAILQ_INSERT_HEAD> вставляет новый элемент IE<.Fa elm> в начало хвостовой очереди.

source: The macro E<.Nm STAILQ_INSERT_TAIL> inserts the new element E<.Fa elm> at the end of the tail queue.
ru: Макрос E<.Nm STAILQ_INSERT_TAIL> вставляет новый элемент E<.Fa elm> в конец хвостовой очереди.

source: The macro E<.Nm STAILQ_INSERT_AFTER> inserts the new element E<.Fa elm> after the element E<.Fa listelm>.
ru: Макрос E<.Nm STAILQ_INSERT_AFTER> вставляет новый элемент E<.Fa elm> за элементом E<.Fa listelm>.

source: The macro E<.Nm STAILQ_NEXT> returns the next item on the tail queue, or NULL this item is the last.
ru: Макрос E<.Nm STAILQ_NEXT> возвращает следующий элемент из хвостовой очереди или NULL, если элемент последний.

source: The macro E<.Nm STAILQ_REMOVE_HEAD> removes the element at the head of the tail queue. For optimum efficiency, elements being removed from the head of the tail queue should use this macro explicitly rather than the generic E<.Fa STAILQ_REMOVE> macro.
ru: Макрос E<.Nm STAILQ_REMOVE_HEAD> удаляет элемент из начала хвостовой очереди. В целях эффективности удаления элемента из начала хвостовой очереди нужно использовать именно этот макрос вместо обычного E<.Fa STAILQ_REMOVE>.

source: The macro E<.Nm STAILQ_REMOVE> removes the element E<.Fa elm> from the tail queue.
ru: Макрос E<.Nm STAILQ_REMOVE> удаляет элемент E<.Fa elm> из хвостовой очереди.

source: Singly-linked tail queue example
ru: Пример односвязной хвостовой очереди

source: STAILQ_HEAD(stailhead, entry) head = STAILQ_HEAD_INITIALIZER(head); struct stailhead *headp; /* Singly-linked tail queue head. */ struct entry { ... STAILQ_ENTRY(entry) entries; /* Tail queue. */ ... } *n1, *n2, *n3, *np;
ru: STAILQ_HEAD(stailhead, entry) head = STAILQ_HEAD_INITIALIZER(head); struct stailhead *headp; /* начало односвязной хвостовой очереди */ struct entry { ... STAILQ_ENTRY(entry) entries; /* хвостовая очередь */ ... } *n1, *n2, *n3, *np;

source: STAILQ_INIT(&head); /* Initialize the queue. */
ru: STAILQ_INIT(&head); /* инициализация очереди */

source: n1 = malloc(sizeof(struct entry)); /* Insert at the head. */ STAILQ_INSERT_HEAD(&head, n1, entries);
ru: n1 = malloc(sizeof(struct entry)); /* вставка начального элемента */ STAILQ_INSERT_HEAD(&head, n1, entries);

source: n1 = malloc(sizeof(struct entry)); /* Insert at the tail. */ STAILQ_INSERT_TAIL(&head, n1, entries);
ru: n1 = malloc(sizeof(struct entry)); /* вставка в очередь */ STAILQ_INSERT_TAIL(&head, n1, entries);

source: n2 = malloc(sizeof(struct entry)); /* Insert after. */ STAILQ_INSERT_AFTER(&head, n1, n2, entries); /* Deletion. */ STAILQ_REMOVE(&head, n2, entry, entries); free(n2); /* Deletion from the head. */ n3 = STAILQ_FIRST(&head); STAILQ_REMOVE_HEAD(&head, entries); free(n3); /* Forward traversal. */ STAILQ_FOREACH(np, &head, entries) np\-E<gt> ... /* TailQ Deletion. */ while (!STAILQ_EMPTY(&head)) { n1 = STAILQ_FIRST(&head); STAILQ_REMOVE_HEAD(&head, entries); free(n1); } /* Faster TailQ Deletion. */ n1 = STAILQ_FIRST(&head); while (n1 != NULL) { n2 = STAILQ_NEXT(n1, entries); free(n1); n1 = n2; } STAILQ_INIT(&head);
ru: n2 = malloc(sizeof(struct entry)); /* вставка последующего */ STAILQ_INSERT_AFTER(&head, n1, n2, entries); /* удаление */ STAILQ_REMOVE(&head, n2, entry, entries); free(n2); /* удаление из начала */ n3 = STAILQ_FIRST(&head); STAILQ_REMOVE_HEAD(&head, entries); free(n3); /* обход от начала в конец */ STAILQ_FOREACH(np, &head, entries) np\-E<gt> ... /* удаление TailQ */ while (!STAILQ_EMPTY(&head)) { n1 = STAILQ_FIRST(&head); STAILQ_REMOVE_HEAD(&head, entries); free(n1); } /* быстрое удаление TailQ */ n1 = STAILQ_FIRST(&head); while (n1 != NULL) { n2 = STAILQ_NEXT(n1, entries); free(n1); n1 = n2; } STAILQ_INIT(&head);

source: Lists
ru: Списки

source: A list is headed by a structure defined by the E<.Nm LIST_HEAD> macro. This structure contains a single pointer to the first element on the list. The elements are doubly linked so that an arbitrary element can be removed without traversing the list. New elements can be added to the list after an existing element, before an existing element, or at the head of the list. A E<.Fa LIST_HEAD> structure is declared as follows:
ru: Список начинается структурой, определённой макросом E<.Nm LIST_HEAD>. Эта структура содержит единственный указатель на первый элемент списка. Элементы дважды связаны, поэтому произвольный элемент можно удалить без прохода по всему списку. Новые элементы могут быть добавлены в список перед или после существующего элемента, а также в начало списка. Структура E<.Fa LIST_HEAD> объявляется следующим образом:

source: The macro E<.Nm LIST_HEAD_INITIALIZER> evaluates to an initializer for the list E<.Fa head>.
ru: Макрос E<.Nm LIST_HEAD_INITIALIZER> запускает инициализатор для E<.Fa head> списка.

source: The macro E<.Nm LIST_EMPTY> evaluates to true if there are no elements in the list.
ru: Макрос E<.Nm LIST_EMPTY> возвращает true, если в списке нет элементов.

source: The macro E<.Nm LIST_ENTRY> declares a structure that connects the elements in the list.
ru: Макрос E<.Nm LIST_ENTRY> объявляет структуру, которая добавляет элементы в список.

source: The macro E<.Nm LIST_FIRST> returns the first element in the list or NULL if the list is empty.
ru: Макрос E<.Nm LIST_FIRST> возвращает первый элемент списка или NULL, если список пуст.

source: The macro E<.Nm LIST_FOREACH> traverses the list referenced by E<.Fa head> in the forward direction, assigning each element in turn to E<.Fa var>.
ru: Макрос E<.Nm LIST_FOREACH> обходит список, на который ссылается E<.Fa head>, от начало в конец, назначая E<.Fa var> каждый элемент.

source: The macro E<.Nm LIST_INIT> initializes the list referenced by E<.Fa head>.
ru: Макрос E<.Nm LIST_INIT> инициализирует список, на который ссылается E<.Fa head>.

source: The macro E<.Nm LIST_INSERT_HEAD> inserts the new element E<.Fa elm> at the head of the list.
ru: Макрос E<.Nm LIST_INSERT_HEAD> вставляет новый элемент E<.Fa elm> в начало списка.

source: The macro E<.Nm LIST_INSERT_AFTER> inserts the new element E<.Fa elm> after the element E<.Fa listelm>.
ru: Макрос E<.Nm LIST_INSERT_AFTER> вставляет новый элемент E<.Fa elm> за элементом E<.Fa listelm>.

source: The macro E<.Nm LIST_INSERT_BEFORE> inserts the new element E<.Fa elm> before the element E<.Fa listelm>.
ru: Макрос E<.Nm LIST_INSERT_AFTER> вставляет новый элемент E<.Fa elm> перед элементом E<.Fa listelm>.

source: The macro E<.Nm LIST_NEXT> returns the next element in the list, or NULL if this is the last.
ru: Макрос E<.Nm LIST_NEXT> возвращает следующий элемент списка или NULL, если элемент последний.

source: The macro E<.Nm LIST_REMOVE> removes the element E<.Fa elm> from the list.
ru: Макрос E<.Nm LIST_REMOVE> удаляет элемент E<.Fa elm> из списка.

source: List example
ru: Пример списка

source: LIST_HEAD(listhead, entry) head = LIST_HEAD_INITIALIZER(head); struct listhead *headp; /* List head. */ struct entry { ... LIST_ENTRY(entry) entries; /* List. */ ... } *n1, *n2, *n3, *np, *np_temp;
ru: LIST_HEAD(listhead, entry) head = LIST_HEAD_INITIALIZER(head); struct listhead *headp; /* начало списка */ struct entry { ... LIST_ENTRY(entry) entries; /* список */ ... } *n1, *n2, *n3, *np, *np_temp;

source: LIST_INIT(&head); /* Initialize the list. */
ru: LIST_INIT(&head); /* инициализация списка */

source: n1 = malloc(sizeof(struct entry)); /* Insert at the head. */ LIST_INSERT_HEAD(&head, n1, entries);
ru: n1 = malloc(sizeof(struct entry)); /* вставка в начало */ LIST_INSERT_HEAD(&head, n1, entries);

source: n2 = malloc(sizeof(struct entry)); /* Insert after. */ LIST_INSERT_AFTER(n1, n2, entries);
ru: n2 = malloc(sizeof(struct entry)); /* вставка последующего */ LIST_INSERT_AFTER(n1, n2, entries);

source: n3 = malloc(sizeof(struct entry)); /* Insert before. */ LIST_INSERT_BEFORE(n2, n3, entries);
ru: n3 = malloc(sizeof(struct entry)); /* вставка перед */ LIST_INSERT_BEFORE(n2, n3, entries);

source: LIST_REMOVE(n2, entries); /* Deletion. */ free(n2); /* Forward traversal. */ LIST_FOREACH(np, &head, entries) np\-E<gt> ...
ru: LIST_REMOVE(n2, entries); /* удаление */ free(n2); /* обход из начала в конец */ LIST_FOREACH(np, &head, entries) np\-E<gt> ...

source: while (!LIST_EMPTY(&head)) { /* List Deletion. */ n1 = LIST_FIRST(&head); LIST_REMOVE(n1, entries); free(n1); }
ru: while (!LIST_EMPTY(&head)) { /* удаление списка */ n1 = LIST_FIRST(&head); LIST_REMOVE(n1, entries); free(n1); }

source: n1 = LIST_FIRST(&head); /* Faster List Deletion. */ while (n1 != NULL) { n2 = LIST_NEXT(n1, entries); free(n1); n1 = n2; } LIST_INIT(&head);
ru: n1 = LIST_FIRST(&head); /* быстрое удаление списка */ while (n1 != NULL) { n2 = LIST_NEXT(n1, entries); free(n1); n1 = n2; } LIST_INIT(&head);

source: Tail queues
ru: Хвостовые очереди

source: A tail queue is headed by a structure defined by the E<.Nm TAILQ_HEAD> macro. This structure contains a pair of pointers, one to the first element in the tail queue and the other to the last element in the tail queue. The elements are doubly linked so that an arbitrary element can be removed without traversing the tail queue. New elements can be added to the tail queue after an existing element, before an existing element, at the head of the tail queue, or at the end of the tail queue. A E<.Fa TAILQ_HEAD> structure is declared as follows:
ru: Хвостовая очередь начинается со структуры, определяемой макросом E<.Nm TAILQ_HEAD>. Эта структура содержит пару указателей, один для первого элемента хвостовой очереди, а другой для последнего элемента хвостовой очереди. Элементы связаны дважды так, что любой элемент может быть удалён без прохождения по всей очереди. Новые элементы могут быть добавлены в хвостовую очередь перед и после существующего элемента, в конец или в начало очереди. Структура E<.Fa TAILQ_HEAD> объявляется следующим образом:

source: The macro E<.Nm TAILQ_HEAD_INITIALIZER> evaluates to an initializer for the tail queue E<.Fa head>.
ru: Макрос E<.Nm TAILQ_HEAD_INITIALIZER> запускает инициализатор для E<.Fa head> хвостовой очереди.

source: The macro E<.Nm TAILQ_CONCAT> concatenates the tail queue headed by E<.Fa head2> onto the end of the one headed by E<.Fa head1> removing all entries from the former.
ru: Макрос E<.Nm TAILQ_CONCAT> добавляет хвостовую очередь с началом E<.Fa head2> в конец очереди с началом E<.Fa head1>, удаляя все элементы из первой.

source: The macro E<.Nm TAILQ_EMPTY> evaluates to true if there are no items on the tail queue.
ru: Макрос E<.Nm TAILQ_EMPTY> возвращает true, если в хвостовой очереди нет элементов.

source: The macro E<.Nm TAILQ_ENTRY> declares a structure that connects the elements in the tail queue.
ru: Макрос E<.Nm TAILQ_ENTRY> объявляет структуру, которая подключает элементы в хвостовую очередь.

source: The macro E<.Nm TAILQ_FIRST> returns the first item on the tail queue or NULL if the tail queue is empty.
ru: Макрос E<.Nm TAILQ_FIRST> возвращает первый элемент из хвостовой очереди или NULL, если очередь пуста.
