Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_q/*.po
Languages: ru

source: The macro E<.Nm TAILQ_FOREACH> traverses the tail queue referenced by E<.Fa head> in the forward direction, assigning each element in turn to E<.Fa var>. E<.Fa var> is set to E<.Dv NULL> if the loop completes normally, or if there were no elements.
ru: Макрос E<.Nm TAILQ_FOREACH> обходит хвостовую очередь, на которую ссылается E<.Fa head>, из начала в конец, назначая E<.Fa var> каждый элемент. Значение E<.Fa var> равно E<.Dv NULL>, если пройдена вся очередь или в ней нет элементов.

source: The macro E<.Nm TAILQ_FOREACH_REVERSE> traverses the tail queue referenced by E<.Fa head> in the reverse direction, assigning each element in turn to E<.Fa var>.
ru: Макрос E<.Nm TAILQ_FOREACH_REVERSE> обходит хвостовую очередь, на которую ссылается E<.Fa head>, в обратном направлении, назначая E<.Fa var> каждый элемент.

source: The macro E<.Nm TAILQ_INIT> initializes the tail queue referenced by E<.Fa head>.
ru: Макрос E<.Nm TAILQ_INIT> инициализирует хвостовую очередь, на которую ссылается E<.Fa head>.

source: The macro E<.Nm TAILQ_INSERT_HEAD> inserts the new element E<.Fa elm> at the head of the tail queue.
ru: Макрос E<.Nm TAILQ_INSERT_HEAD> вставляет новый элемент IE<.Fa elm> в начало хвостовой очереди.

source: The macro E<.Nm TAILQ_INSERT_TAIL> inserts the new element E<.Fa elm> at the end of the tail queue.
ru: Макрос E<.Nm TAILQ_INSERT_TAIL> вставляет новый элемент E<.Fa elm> в конец хвостовой очереди.

source: The macro E<.Nm TAILQ_INSERT_AFTER> inserts the new element E<.Fa elm> after the element E<.Fa listelm>.
ru: Макрос E<.Nm TAILQ_INSERT_AFTER> вставляет новый элемент E<.Fa elm> за элементом E<.Fa listelm>.

source: The macro E<.Nm TAILQ_INSERT_BEFORE> inserts the new element E<.Fa elm> before the element E<.Fa listelm>.
ru: Макрос E<.Nm TAILQ_INSERT_BEFORE> вставляет новый элемент E<.Fa elm> перед элементом E<.Fa listelm>.

source: The macro E<.Nm TAILQ_LAST> returns the last item on the tail queue. If the tail queue is empty the return value is E<.Dv NULL>.
ru: Макрос E<.Nm TAILQ_LAST> возвращает последний элемент из хвостовой очереди или E<.Dv NULL>, если очередь пуста.

source: The macro E<.Nm TAILQ_NEXT> returns the next item on the tail queue, or NULL if this item is the last.
ru: Макрос E<.Nm TAILQ_NEXT> возвращает следующий элемент из хвостовой очереди или NULL, если элемент последний.

source: The macro E<.Nm TAILQ_PREV> returns the previous item on the tail queue, or NULL if this item is the first.
ru: Макрос E<.Nm TAILQ_PREV> возвращает предыдущий элемент из хвостовой очереди или NULL, если элемент первый.

source: The macro E<.Nm TAILQ_REMOVE> removes the element E<.Fa elm> from the tail queue.
ru: Макрос E<.Nm TAILQ_REMOVE> удаляет элемент E<.Fa elm> из хвостовой очереди.

source: The macro E<.Nm TAILQ_SWAP> swaps the contents of E<.Fa head1> and E<.Fa head2>.
ru: Макрос E<.Nm TAILQ_SWAP> меняет местами содержимое E<.Fa head1> и E<.Fa head2>.

source: Tail queue example
ru: Пример хвостовой очереди

source: TAILQ_HEAD(tailhead, entry) head = TAILQ_HEAD_INITIALIZER(head); struct tailhead *headp; /* Tail queue head. */ struct entry { ... TAILQ_ENTRY(entry) entries; /* Tail queue. */ ... } *n1, *n2, *n3, *np;
ru: TAILQ_HEAD(tailhead, entry) head = TAILQ_HEAD_INITIALIZER(head); struct tailhead *headp; /* начало хвостовой очереди */ struct entry { ... TAILQ_ENTRY(entry) entries; /* хвостовая очередь */ ... } *n1, *n2, *n3, *np;

source: TAILQ_INIT(&head); /* Initialize the queue. */
ru: TAILQ_INIT(&head); /* инициализация очереди */

source: n1 = malloc(sizeof(struct entry)); /* Insert at the head. */ TAILQ_INSERT_HEAD(&head, n1, entries);
ru: n1 = malloc(sizeof(struct entry)); /* вставка в начало */ TAILQ_INSERT_HEAD(&head, n1, entries);

source: n1 = malloc(sizeof(struct entry)); /* Insert at the tail. */ TAILQ_INSERT_TAIL(&head, n1, entries);
ru: n1 = malloc(sizeof(struct entry)); /* вставка в конец */ TAILQ_INSERT_TAIL(&head, n1, entries);

source: n2 = malloc(sizeof(struct entry)); /* Insert after. */ TAILQ_INSERT_AFTER(&head, n1, n2, entries);
ru: n2 = malloc(sizeof(struct entry)); /* вставка последующего */ TAILQ_INSERT_AFTER(&head, n1, n2, entries);

source: n3 = malloc(sizeof(struct entry)); /* Insert before. */ TAILQ_INSERT_BEFORE(n2, n3, entries);
ru: n3 = malloc(sizeof(struct entry)); /* вставка перед */ TAILQ_INSERT_BEFORE(n2, n3, entries);

source: TAILQ_REMOVE(&head, n2, entries); /* Deletion. */ free(n2); /* Forward traversal. */ TAILQ_FOREACH(np, &head, entries) np\-E<gt> ... /* Reverse traversal. */ TAILQ_FOREACH_REVERSE(np, &head, tailhead, entries) np\-E<gt> ... /* TailQ Deletion. */ while (!TAILQ_EMPTY(&head)) { n1 = TAILQ_FIRST(&head); TAILQ_REMOVE(&head, n1, entries); free(n1); } /* Faster TailQ Deletion. */ n1 = TAILQ_FIRST(&head); while (n1 != NULL) { n2 = TAILQ_NEXT(n1, entries); free(n1); n1 = n2; }
ru: TAILQ_REMOVE(&head, n2, entries); /* удаление */ free(n2); /* обход из начало в конец */ TAILQ_FOREACH(np, &head, entries) np\-E<gt> ... /* обход в обратном направлении */ TAILQ_FOREACH_REVERSE(np, &head, tailhead, entries) np\-E<gt> ... /* удаление TailQ */ while (!TAILQ_EMPTY(&head)) { n1 = TAILQ_FIRST(&head); TAILQ_REMOVE(&head, n1, entries); free(n1); } /* быстрое удаление TailQ */ n1 = TAILQ_FIRST(&head); while (n1 != NULL) { n2 = TAILQ_NEXT(n1, entries); free(n1); n1 = n2; }

source: TAILQ_INIT(&head); n2 = malloc(sizeof(struct entry)); /* Insert before. */ CIRCLEQ_INSERT_BEFORE(&head, n1, n2, entries); /* Forward traversal. */ for (np = head.cqh_first; np != (void *)&head; np = np\-E<gt>entries.cqe_next) np\-E<gt> ... /* Reverse traversal. */ for (np = head.cqh_last; np != (void *)&head; np = np\-E<gt>entries.cqe_prev) np\-E<gt> ... /* Delete. */ while (head.cqh_first != (void *)&head) CIRCLEQ_REMOVE(&head, head.cqh_first, entries);
ru: TAILQ_INIT(&head); n2 = malloc(sizeof(struct entry)); /* вставка перед */ CIRCLEQ_INSERT_BEFORE(&head, n1, n2, entries); /* обход из начала в конец */ for (np = head.cqh_first; np != (void *)&head; np = np\-E<gt>entries.cqe_next) np\-E<gt> ... /* обход в обратном направлении */ for (np = head.cqh_last; np != (void *)&head; np = np\-E<gt>entries.cqe_prev) np\-E<gt> ... /* удаление */ while (head.cqh_first != (void *)&head) CIRCLEQ_REMOVE(&head, head.cqh_first, entries);

source: Not in POSIX.1, POSIX.1-2001 or POSIX.1-2008. Present on the BSDs. E<.Nm queue> functions first appeared in E<.Bx 4.4>.
ru: Нет в POSIX.1, POSIX.1-2001 и POSIX.1-2008. Присутствует в BSD. Функции E<.Nm queue> впервые появились в E<.Bx 4.4>.

source: qecvt, qfcvt, qgcvt - convert a floating-point number to a string
ru: qecvt, qfcvt, qgcvt - преобразуют число с плавающей точкой в строку

source: The functions B<qecvt>(), B<qfcvt>(), and B<qgcvt>() are identical to B<ecvt>(3), B<fcvt>(3), and B<gcvt>(3) respectively, except that they use a I<long double> argument I<number>. See B<ecvt>(3) and B<gcvt>(3).
ru: Функции B<qecvt>(), B<qfcvt>() и B<qgcvt>() идентичны B<ecvt>(3), B<fcvt>(3) и B<gcvt>(3), соответственно, за исключением того, что аргумент I<number> имеет тип I<long double>. Смотрите B<ecvt>(3) и B<gcvt>(3).

source: SVr4. Not seen in most common UNIX implementations, but occurs in SunOS. Supported by glibc.
ru: SVr4. Отсутствуют в наиболее распространённых реализациях UNIX, но есть в SunOS. Поддерживаются в glibc.

source: These functions are obsolete. Instead, B<snprintf>(3) is recommended.
ru: Данные функции устарели. Вместо них рекомендуется использовать B<snprintf>(3).
