Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: Netlink is not a reliable protocol. It tries its best to deliver a message to its destination(s), but may drop messages when an out-of-memory condition or other error occurs. For reliable transfer the sender can request an acknowledgement from the receiver by setting the B<NLM_F_ACK> flag. An acknowledgment is an B<NLMSG_ERROR> packet with the error field set to 0. The application must generate acknowledgements for received messages itself. The kernel tries to send an B<NLMSG_ERROR> message for every failed packet. A user process should follow this convention too.
ru: Netlink не является надежным протоколом. Он делает всё возможное для доставки сообщения по адресу (адресам), но может отбрасывать пакеты при нехватке памяти или возникновении других ошибок в работе. Для повышения надёжности передачи отправитель может запросить подтверждение от получателя, установив флаг B<NLM_F_ACK>. Подтверждающим является пакет B<NLMSG_ERROR> с полем ошибки, равным нулю. Приложение должно само создавать подтверждения полученным сообщениям. Ядро пытается послать сообщение B<NLMSG_ERROR> всем ошибочным пакетам. Процесс пользователя также должен следовать этому соглашению.

source: However, reliable transmissions from kernel to user are impossible in any case. The kernel can't send a netlink message if the socket buffer is full: the message will be dropped and the kernel and the user-space process will no longer have the same view of kernel state. It is up to the application to detect when this happens (via the B<ENOBUFS> error returned by B<recvmsg>(2)) and resynchronize.
ru: Однако, надёжная передача от ядра пользователю в любом случае невозможна. Ядро не может послать сообщение netlink, если заполнен буфер сокета: сообщение будет отброшено и ядро и пользовательский процесс будут иметь разное понятие о состоянии ядра. В обязанность приложения входит обнаружение такой ситуации (посредством ошибки B<ENOBUFS>, возвращаемой B<recvmsg>(2)) и выполнение восстановления синхронизации.

source: Address formats
ru: Форматы адресов

source: The I<sockaddr_nl> structure describes a netlink client in user space or in the kernel. A I<sockaddr_nl> can be either unicast (only sent to one peer) or sent to netlink multicast groups (I<nl_groups> not equal 0).
ru: Структура I<sockaddr_nl> описывает клиент netlink в пространстве пользователя или в ядре. Она может быть как одноадресной (передача информации только на один адрес), так и посылаться многоадресной группе netlink (значение I<nl_groups> не равно нулю).

source: struct sockaddr_nl { sa_family_t nl_family; /* AF_NETLINK */ unsigned short nl_pad; /* Zero */ pid_t nl_pid; /* Port ID */ __u32 nl_groups; /* Multicast groups mask */ };
ru: struct sockaddr_nl { sa_family_t nl_family; /* AF_NETLINK */ unsigned short nl_pad; /* ноль */ pid_t nl_pid; /* ID порта */ __u32 nl_groups; /* маска многоадресных групп */ };

source: I<nl_pid> is the unicast address of netlink socket. It's always 0 if the destination is in the kernel. For a user-space process, I<nl_pid> is usually the PID of the process owning the destination socket. However, I<nl_pid> identifies a netlink socket, not a process. If a process owns several netlink sockets, then I<nl_pid> can be equal to the process ID only for at most one socket. There are two ways to assign I<nl_pid> to a netlink socket. If the application sets I<nl_pid> before calling B<bind>(2), then it is up to the application to make sure that I<nl_pid> is unique. If the application sets it to 0, the kernel takes care of assigning it. The kernel assigns the process ID to the first netlink socket the process opens and assigns a unique I<nl_pid> to every netlink socket that the process subsequently creates.
ru: I<nl_pid> — одиночный адрес сокета netlink. Он всегда равен 0, если местом назначения является ядро. Для процесса пользовательского пространства значение I<nl_pid>, обычно, равно PID процесса, которому принадлежит сокет назначения. Однако, значением I<nl_pid> определяется сокет netlink, а не процесс. Если процессу принадлежит несколько сокетов netlink, то значение I<nl_pid> может быть равно ID процесса только у одного сокета. Есть два способа назначить I<nl_pid> сокету netlink. Если приложение задаёт I<nl_pid> до вызова B<bind>(2), то приложение само должно убедиться, что значение I<nl_pid> уникально. Если приложение устанавливает его равным 0, то присвоение уникального значения выполняется ядром. Первому сокету netlink ядро назначает ID процесса, который его открыл, а всем последующим создаваемым процессом сокетам netlink, будет назначено уникальное значение I<nl_pid>.

source: I<nl_groups> is a bit mask with every bit representing a netlink group number. Each netlink family has a set of 32 multicast groups. When B<bind>(2) is called on the socket, the I<nl_groups> field in the I<sockaddr_nl> should be set to a bit mask of the groups which it wishes to listen to. The default value for this field is zero which means that no multicasts will be received. A socket may multicast messages to any of the multicast groups by setting I<nl_groups> to a bit mask of the groups it wishes to send to when it calls B<sendmsg>(2) or does a B<connect>(2). Only processes with an effective UID of 0 or the B<CAP_NET_ADMIN> capability may send or listen to a netlink multicast group. Since Linux 2.6.13, messages can't be broadcast to multiple groups. Any replies to a message received for a multicast group should be sent back to the sending PID and the multicast group. Some Linux kernel subsystems may additionally allow other users to send and/or receive messages. As at Linux 3.0, the B<NETLINK_KOBJECT_UEVENT>, B<NETLINK_GENERIC>, B<NETLINK_ROUTE>, and B<NETLINK_SELINUX> groups allow other users to receive messages. No groups allow other users to send messages.
ru: Значение I<nl_groups> — это битовая маска, где каждый бит представляет номер группы netlink. Каждое семейство netlink имеет набор из 32-х многоадресных групп. Когда для сокета вызывается B<bind>(2), то поле I<nl_groups> структуры I<sockaddr_nl> должно содержать битовую маску групп, которые оно хочет прослушивать. По умолчанию значение этого поля равно нулю, что означает, что многоадресные передачи не будут приниматься. Сокет может передавать многоадресные сообщения любой из многоадресных групп, присвоив I<nl_groups> битовую маску групп, которым он желает передавать данные вызовом B<sendmsg>(2) или при выполнении B<connect>(2). Принимать или посылать сообщения многоадресной группы netlink могут только процессы с эффективным UID, равным 0, или имеющие мандат B<CAP_NET_ADMIN>. Начиная с Linux 2.6.13, сообщения не могут вещаться в многоадресные группы. Любые ответы на сообщение, полученное многоадресной группой, должны быть отправлены посылающему процессу с PID и многоадресной группе. Некоторые подсистемы ядра Linux могут разрешать отправку и/или приём сообщений другим пользователям. Начиная с Linux 3.0, в группах B<NETLINK_KOBJECT_UEVENT>, B<NETLINK_GENERIC>, B<NETLINK_ROUTE> и B<NETLINK_SELINUX> разрешено принимать сообщения от других пользователей. Отправлять сообщения другим пользователям запрещено.

source: Socket options
ru: Параметры сокета

source: To set or get a netlink socket option, call B<getsockopt>(2) to read or B<setsockopt>(2) to write the option with the option level argument set to B<SOL_NETLINK>. Unless otherwise noted, I<optval> is a pointer to an I<int>.
ru: Для получения и задания параметров сокета netlink используйте вызовы B<getsockopt>(2) и B<setsockopt>(2), соответственно. Значение аргумента уровня параметров должно быть равно B<SOL_NETLINK>. Если не указано обратного, значение I<optval> является указателем на I<int>.

source: B<NETLINK_PKTINFO> (since Linux 2.6.14)
ru: B<NETLINK_PKTINFO> (начиная с Linux 2.6.14)

source: Enable B<nl_pktinfo> control messages for received packets to get the extended destination group number.
ru: Включить управляющие сообщения B<nl_pktinfo> для приёма пакетов, чтобы получать расширенный номер группы назначения.

source: B<NETLINK_ADD_MEMBERSHIP>,\ B<NETLINK_DROP_MEMBERSHIP> (since Linux 2.6.14)
ru: B<NETLINK_ADD_MEMBERSHIP>,\ B<NETLINK_DROP_MEMBERSHIP> (начиная с Linux 2.6.14)

source: Join/leave a group specified by I<optval>.
ru: Присоединиться/покинуть группу, заданную в I<optval>.

source: B<NETLINK_LIST_MEMBERSHIPS> (since Linux 4.2)
ru: B<NETLINK_LIST_MEMBERSHIPS> (начиная с Linux 4.2)

source: Retrieve all groups a socket is a member of. I<optval> is a pointer to B<__u32> and I<optlen> is the size of the array. The array is filled with the full membership set of the socket, and the required array size is returned in I<optlen>.
ru: Получить все группы, в которых сокет является членом В аргументе I<optval> передаётся указатель на B<__u32>, а в I<optlen> — размер массива. Массив заполняется полным набором членства сокета, а требуемый размер массива возвращается в I<optlen>.

source: B<NETLINK_BROADCAST_ERROR> (since Linux 2.6.30)
ru: B<NETLINK_BROADCAST_ERROR> (начиная с Linux 2.6.30)

source: When not set, B<netlink_broadcast()> only reports B<ESRCH> errors and silently ignore B<NOBUFS> errors.
ru: Если не установлен, то B<netlink_broadcast()> сообщает только об ошибках B<ESRCH> и игнорирует ошибки B<NOBUFS>.

source: B<NETLINK_NO_ENOBUFS> (since Linux 2.6.30)
ru: B<NETLINK_NO_ENOBUFS> (начиная с Linux 2.6.30)

source: This flag can be used by unicast and broadcast listeners to avoid receiving B<ENOBUFS> errors.
ru: Данный флаг могут использовать слушающие одноадресные и широковещательные передачи, чтобы избежать ошибок B<ENOBUFS>.

source: B<NETLINK_LISTEN_ALL_NSID> (since Linux 4.2)
ru: B<NETLINK_LISTEN_ALL_NSID> (начиная с Linux 4.2)

source: When set, this socket will receive netlink notifications from all network namespaces that have an I<nsid> assigned into the network namespace where the socket has been opened. The I<nsid> is sent to user space via an ancillary data.
ru: Если установлен, то этот сокет будет принимать уведомления netlink из всех сетевых пространств имён, имеющих назначенный I<nsid> сетевого пространства имён, в котором был открыт сокет. Значение I<nsid> посылается в пользовательское пространство во вспомогательных данных.

source: B<NETLINK_CAP_ACK> (since Linux 4.2)
ru: B<NETLINK_CAP_ACK> (начиная с Linux 4.2)

source: The kernel may fail to allocate the necessary room for the acknowledgment message back to user space. This option trims off the payload of the original netlink message. The netlink message header is still included, so the user can guess from the sequence number which message triggered the acknowledgment.
ru: В ядре может возникнуть ошибка при выделении необходимого места в пользовательском пространстве для подтверждающего сообщения. При установке этого параметра обрезаются данные оригинального сообщения netlink. Заголовок сообщения netlink остаётся, поэтому пользователь может узнать номер последовательности сообщения, на которое пришло подтверждение.

source: VERSIONS
ru: ВЕРСИИ

source: The socket interface to netlink first appeared Linux 2.2.
ru: Сокетный интерфейс для netlink впервые появился в Linux 2.2.

source: Linux 2.0 supported a more primitive device-based netlink interface (which is still available as a compatibility option). This obsolete interface is not described here.
ru: Linux 2.0 поддерживал более примитивный интерфейс на основе устройств (который всё ещё доступен для совместимости). Этот устаревший интерфейс здесь не описывается.

source: It is often better to use netlink via I<libnetlink> or I<libnl> than via the low-level kernel interface.
ru: В большинстве случаев лучше использовать netlink с помощью функций библиотек I<libnetlink> или I<libnl>, а не через низкоуровневый интерфейс ядра.

source: BUGS
ru: ДЕФЕКТЫ

source: This manual page is not complete.
ru: Эта справочной странице не содержится всей необходимой информации.

source: EXAMPLE
ru: ПРИМЕР

source: The following example creates a B<NETLINK_ROUTE> netlink socket which will listen to the B<RTMGRP_LINK> (network interface create/delete/up/down events) and B<RTMGRP_IPV4_IFADDR> (IPv4 addresses add/delete events) multicast groups.
ru: В следующем примере создаётся сокет netlink семейства B<NETLINK_ROUTE>, который будет прослушивать многоадресные группы B<RTMGRP_LINK> (события о создании/удалении/включении/выключении сетевых интерфейсов) и B<RTMGRP_IPV4_IFADDR> (события о добавлении/удалении адресов IPv4).

source: The next example demonstrates how to send a netlink message to the kernel (pid 0). Note that the application must take care of message sequence numbers in order to reliably track acknowledgements.
ru: В следующем примере показано как отправить сообщение netlink ядру (pid 0). Заметим, что приложение должно управлять нумерацией сообщений, чтобы отслеживать подтверждения о доставке.

source: struct nlmsghdr *nh; /* The nlmsghdr with payload to send */ struct sockaddr_nl sa; struct iovec iov = { nh, nh-E<gt>nlmsg_len }; struct msghdr msg;
ru: struct nlmsghdr *nh; /* отправляется nlmsghdr с полезной нагрузкой */ struct sockaddr_nl sa; struct iovec iov = { nh, nh-E<gt>nlmsg_len }; struct msghdr msg;

source: msg = { &sa, sizeof(sa), &iov, 1, NULL, 0, 0 }; memset(&sa, 0, sizeof(sa)); sa.nl_family = AF_NETLINK; nh-E<gt>nlmsg_pid = 0; nh-E<gt>nlmsg_seq = ++sequence_number; /* Request an ack from kernel by setting NLM_F_ACK */ nh-E<gt>nlmsg_flags |= NLM_F_ACK;
ru: msg = { &sa, sizeof(sa), &iov, 1, NULL, 0, 0 }; memset(&sa, 0, sizeof(sa)); sanl_family = AF_NETLINK; nh-E<gt>nlmsg_pid = 0; nh-E<gt>nlmsg_seq = ++sequence_number; /* для запроса подтверждения от ядра, устанавливаем NLM_F_ACK */ nh-E<gt>nlmsg_flags |= NLM_F_ACK;

source: And the last example is about reading netlink message.
ru: И последний пример о том, как выполнять чтение сообщения netlink.

source: int len; char buf[8192]; /* 8192 to avoid message truncation on platforms with page size E<gt> 4096 */ struct iovec iov = { buf, sizeof(buf) }; struct sockaddr_nl sa; struct msghdr msg; struct nlmsghdr *nh;
ru: int len; char buf[8192]; /* 8192 чтобы сообщение не обрезалось на платформах с размером страницы E<gt> 4096 */ struct iovec iov = { buf, sizeof(buf) }; struct sockaddr_nl sa; struct msghdr msg; struct nlmsghdr *nh;

source: for (nh = (struct nlmsghdr *) buf; NLMSG_OK (nh, len); nh = NLMSG_NEXT (nh, len)) { /* The end of multipart message */ if (nh-E<gt>nlmsg_type == NLMSG_DONE) return;
ru: for (nh = (struct nlmsghdr *) buf; NLMSG_OK (nh, len); nh = NLMSG_NEXT (nh, len)) { /* конец сообщения из нескольких частей */ if (nh-E<gt>nlmsg_type == NLMSG_DONE) return;

source: if (nh-E<gt>nlmsg_type == NLMSG_ERROR) /* Do some error handling */ ...
ru: if (nh-E<gt>nlmsg_type == NLMSG_ERROR) /* выполняем обработку ошибок */ …

source: /* Continue with parsing payload */ ... }
ru: /* разбираем полезную нагрузку */ … }

source: E<.UR ftp://ftp.inr.ac.ru\:/ip-routing\:/iproute2*> information about libnetlink E<.UE>
ru: E<.UR ftp://ftp.inr.ac.ru\:/ip-routing\:/iproute2*> Информация о libnetlink E<.UE>

source: E<.UR http://www.infradead.org\:/~tgr\:/libnl/> information about libnl E<.UE>
ru: E<.UR http://www.infradead.org\:/~tgr\:/libnl/> Информация о libnl E<.UE>

source: numa - overview of Non-Uniform Memory Architecture
ru: numa - обзор архитектуры с неравномерной памятью (Non-Uniform Memory Architecture)

source: Non-Uniform Memory Access (NUMA) refers to multiprocessor systems whose memory is divided into multiple memory nodes. The access time of a memory node depends on the relative locations of the accessing CPU and the accessed node. (This contrasts with a symmetric multiprocessor system, where the access time for all of the memory is the same for all CPUs.) Normally, each CPU on a NUMA system has a local memory node whose contents can be accessed faster than the memory in the node local to another CPU or the memory on a bus shared by all CPUs.
ru: Неравномерный доступ к памяти (NUMA) приписывают микропроцессорным системам, у которых память разделяется на узлы. Время доступа к узлу памяти зависит от относительного расположения обращающегося ЦП к узлу (в этом отличие от симметричных мультипроцессорных систем, в которых время доступа ко всей памяти одинаково для всех ЦП). Обычно, каждый ЦП в системе NUMA имеет свой локальный узел памяти, чьё содержимое можно получить быстрее, чем из памяти локального узла другого ЦП или из памяти шины, которая доступна для всех ЦП.

source: NUMA system calls
ru: Системные вызовы NUMA

source: The Linux kernel implements the following NUMA-related system calls: B<get_mempolicy>(2), B<mbind>(2), B<migrate_pages>(2), B<move_pages>(2), and B<set_mempolicy>(2). However, applications should normally use the interface provided by I<libnuma>; see "Library Support" below.
ru: В ядре Linux реализованы следующие системные вызовы, относящиеся к NUMA: B<get_mempolicy>(2), B<mbind>(2), B<migrate_pages>(2), B<move_pages>(2) и B<set_mempolicy>(2). Однако, приложения, обычно, должны использовать интерфейс, предоставляемый библиотекой I<libnuma>; смотрите «Поддержка в библиотеках» далее.

source: /proc/[number]/numa_maps (since Linux 2.6.14)
ru: /proc/[число]/numa_maps (начиная с Linux 2.6.14)

source: This file displays information about a process's NUMA memory policy and allocation.
ru: В этом файле содержится информация о политике и выделении памяти NUMA для процесса.

source: Each line contains information about a memory range used by the process, displaying\(emamong other information\(emthe effective memory policy for that memory range and on which nodes the pages have been allocated.
ru: В каждой строке содержится информация области памяти, используемом процессом, отражающей, помимо прочего, применяемую политику памяти для этой области и какие страничные узлы были выделены.

source: I<numa_maps> is a read-only file. When I</proc/E<lt>pidE<gt>/numa_maps> is read, the kernel will scan the virtual address space of the process and report how memory is used. One line is displayed for each unique memory range of the process.
ru: Файл I<numa_maps> доступен только на чтение. При чтении I</proc/E<lt>pidE<gt>/numa_maps> ядро сканирует виртуальное адресное пространство процесса и выдаёт как используется память. Одна строка соответствует уникальной области памяти процесса.

source: The first field of each line shows the starting address of the memory range. This field allows a correlation with the contents of the I</proc/E<lt>pidE<gt>/maps> file, which contains the end address of the range and other information, such as the access permissions and sharing.
ru: В первом поле каждой строки содержится начальный адрес области памяти. Это поле позволяет провести параллель с файлом I</proc/E<lt>pidE<gt>/maps>, в котором содержится конечный адрес области и другая информация, такая как права доступа и данные о совместном использовании.

source: The second field shows the memory policy currently in effect for the memory range. Note that the effective policy is not necessarily the policy installed by the process for that memory range. Specifically, if the process installed a "default" policy for that range, the effective policy for that range will be the process policy, which may or may not be "default".
ru: Во втором поле показана политика памяти, которая применена к области в настоящее время. Заметим, что применённая политика необязательно является политикой, установленной процессом для этой области памяти. В частности, если для этой области процесс установил политику «default» (по умолчанию), то применяемая политика для этой области будет политикой процесса, которая может совпадать, а может и не совпадать с «default».

source: The rest of the line contains information about the pages allocated in the memory range, as follows:
ru: В оставшейся части строки содержится информация о страницах, выделенных в области памяти:

source: I<NE<lt>nodeE<gt>=E<lt>nr_pagesE<gt>>
ru: I<NE<lt>узелE<gt>=E<lt>кол-во_страницE<gt>>

source: The number of pages allocated on I<E<lt>nodeE<gt>>. I<E<lt>nr_pagesE<gt>> includes only pages currently mapped by the process. Page migration and memory reclaim may have temporarily unmapped pages associated with this memory range. These pages may show up again only after the process has attempted to reference them. If the memory range represents a shared memory area or file mapping, other processes may currently have additional pages mapped in a corresponding memory range.
ru: Количество страниц, выделенных на I<E<lt>узлеE<gt>>. В I<E<lt>кол-во_страницE<gt>> учитываются только страницы, отображённые процессом в настоящий момент. Перемещение (migration) страниц и возвращение памяти может приводить к временному неотображению страниц, связанных с этой областью памяти. Такие страницы могут появиться снова только после того, как процесс попытается обратиться к ним. Если область памяти считается общей или является отображением файла, то для других процессов в это же время могут быть показаны дополнительные страницы, отображённые в соответствующее адресное пространство.

source: I<file=E<lt>filenameE<gt>>
ru: I<file=E<lt>имя_файлаE<gt>>

source: The file backing the memory range. If the file is mapped as private, write accesses may have generated COW (Copy-On-Write) pages in this memory range. These pages are displayed as anonymous pages.
ru: Файл, отображаемый в область памяти. Если файл отображён как закрытый (private), попытка записи может сгенерировать страницы COW (копирование при записи) в этой области памяти. Эти страницы показываются как анонимные.

source: Memory range is used for the heap.
ru: Область памяти, используемая под кучу.

source: Memory range is used for the stack.
ru: Область памяти, используемая под стек.

source: Huge memory range. The page counts shown are huge pages and not regular sized pages.
ru: Область огромной памяти. Показывает количество огромных страниц, а не страниц обычного размера.

source: I<anon=E<lt>pagesE<gt>>
ru: I<anon=E<lt>страницE<gt>>

source: The number of anonymous page in the range.
ru: Количество анонимных страниц в области.

source: I<dirty=E<lt>pagesE<gt>>
ru: I<dirty=E<lt>страницE<gt>>

source: Number of dirty pages.
ru: Количество грязных (dirty) страниц.

source: I<mapped=E<lt>pagesE<gt>>
ru: I<mapped=E<lt>страницE<gt>>

source: Total number of mapped pages, if different from I<dirty> and I<anon> pages.
ru: Общее количество отображённых страниц, если оно отличается от количества страниц I<dirty> и I<anon>.

source: I<mapmax=E<lt>countE<gt>>
ru: I<mapmax=E<lt>количествоE<gt>>

source: Maximum mapcount (number of processes mapping a single page) encountered during the scan. This may be used as an indicator of the degree of sharing occurring in a given memory range.
ru: Максимальный mapcount (количество процессов, отображающих одну страницу) обнаруженный при сканировании. Может использоваться как индикатор степени совместного использования заданной области памяти.

source: I<swapcache=E<lt>countE<gt>>
ru: I<swapcache=E<lt>количествоE<gt>>

source: Number of pages that have an associated entry on a swap device.
ru: Количество страниц, связанных с участками на устройстве подкачки.

source: I<active=E<lt>pagesE<gt>>
ru: I<active=E<lt>страницE<gt>>

source: The number of pages on the active list. This field is shown only if different from the number of pages in this range. This means that some inactive pages exist in the memory range that may be removed from memory by the swapper soon.
ru: Количество страниц в активном списке. Это поле показывается только, если его значение отличается от количества страниц в этой области. Это означает, что в области памяти существует несколько неактивных страниц, которые могут быть скоро удалены swapper.

source: I<writeback=E<lt>pagesE<gt>>
ru: I<writeback=E<lt>страницE<gt>>
