Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: The B<nl_langinfo>() and B<nl_langinfo_l>() functions provide access to locale information in a more flexible way than B<localeconv>(3). B<nl_langinfo>() returns a string which is the value corresponding to I<item> in the program's current global locale. B<nl_langinfo>() returns a string which is the value corresponding to I<item> for the locale identified by the locale object I<locale>, which was previously created by B<newlocale>(1). Individual and additional elements of the locale categories can be queried.
ru: Функция B<nl_langinfo>() и B<nl_langinfo_l>() предоставляют более гибкий способ доступа к информации локали, нежели B<localeconv>(3). Функция B<nl_langinfo>() возвращает строку со значением, соответствующим I<item>, из текущей глобальной локали программы. Функциями B<nl_langinfo>() возвращает строку со значением, соответствующим I<item>, из локали, которая определена объектом локали I<locale> (ранее создан с помощью B<newlocale>(1)). Могут быть запрошены индивидуальные, либо дополнительные элементы категорий локали.

source: Examples for the locale elements that can be specified in I<item> using the constants defined in I<E<lt>langinfo.hE<gt>> are:
ru: В качестве запрашиваемых элементов локали в поле I<item> могут быть указаны определённые в I<E<lt>langinfo.hE<gt>> константы:

source: Return a string with the name of the character encoding used in the selected locale, such as "UTF-8", "ISO-8859-1", or "ANSI_X3.4-1968" (better known as US-ASCII). This is the same string that you get with "locale charmap". For a list of character encoding names, try "locale -m" (see B<locale>(1)).
ru: Возвращает строку с названием кодировки символов, используемой в выбранной локали, например «UTF-8», «ISO-8859-1» или «ANSI_X34-1968» (более известной, как US-ASCII). Это такая же строка, которую возвращает команда «locale charmap». Список названий кодировок символов можно получить по команде «locale -m» (смотрите B<locale>(1)).

source: Return a string that can be used as a format string for B<strftime>(3) to represent time and date in a locale-specific way.
ru: Возвращает строку, которую можно использовать как строку формата для функции B<strftime>(3) для представления времени и даты в формате данной локали.

source: Return a string that can be used as a format string for B<strftime>(3) to represent a date in a locale-specific way.
ru: Возвращает строку, которую можно использовать как строку формата для функции B<strftime>(3) для представления даты в формате данной локали.

source: Return a string that can be used as a format string for B<strftime>(3) to represent a time in a locale-specific way.
ru: Возвращает строку, которую можно использовать как строку формата для функции B<strftime>(3) для представления времени в формате данной локали.

source: Return name of the I<n>-th day of the week. [Warning: this follows the US convention DAY_1 = Sunday, not the international convention (ISO 8601) that Monday is the first day of the week.]
ru: Возвращает название I<n>-го дня недели. ПРЕДУПРЕЖДЕНИЕ: подразумевается формат США, в котором DAY_1 = воскресенье, а не интернациональный формат (ISO 8601), в котором первым днём недели является понедельник.

source: Return abbreviated name of the I<n>-th day of the week.
ru: Возвращает сокращённое название I<n>-го дня недели.

source: Return name of the I<n>-th month.
ru: Возвращает название I<n>-го месяца.

source: Return abbreviated name of the I<n>-th month.
ru: Возвращает сокращённое название I<n>-го месяца.

source: Return radix character (decimal dot, decimal comma, etc.).
ru: Возвращает символ разделителя целой и дробной части (десятичную точку, запятую и т. п.).

source: Return separator character for thousands (groups of three digits).
ru: Возвращает разделитель тысячных разрядов (групп по 3 цифры).

source: Return a regular expression that can be used with the B<regex>(3) function to recognize a positive response to a yes/no question.
ru: Возвращает регулярное выражение, которое может быть использовано в функции B<regex>(3) для распознания положительного ответа на вопрос да/нет.

source: Return a regular expression that can be used with the B<regex>(3) function to recognize a negative response to a yes/no question.
ru: Возвращает регулярное выражение, которое может быть использовано в функции B<regex>(3) для распознания отрицательного ответа на вопрос да/нет.

source: Return the currency symbol, preceded by "-" if the symbol should appear before the value, "+" if the symbol should appear after the value, or "." if the symbol should replace the radix character.
ru: Возвращает обозначение валюты, с предшествующими символами: «-», если знак валюты должен стоять перед числами, «+», если знак валюты должен стоять после чисел или «.», если знак валюты должен заменять разделитель целой и дробной части.

source: The above list covers just some examples of items that can be requested. For a more detailed list, consult I<The GNU C Library Reference Manual>.
ru: Список вышеперечисленных элементов — это всего лишь небольшая часть того, что может быть запрошено. Более подробный список приведён в справочном руководстве по библиотеке GNU C.

source: On success, these functions return a pointer to a string which is the value corresponding to I<item> in the specified locale.
ru: При успешном выполнении данные функции возвращают указатель на строку, которая содержит значение соответствующего I<item> из указанной локали.

source: If no locale has been selected by B<setlocale>(3) for the appropriate category, B<nl_langinfo>() return a pointer to the corresponding string in the "C" locale. The same is true of B<nl_langinfo_l>() if I<locale> specifies a locale where I<langinfo> data is not defined.
ru: Если с помощью B<setlocale>(3) не была выбрана локаль для соответствующей категории, то B<nl_langinfo> возвращает указатель на соответствующую строку локали «C». Это же верно и для B<nl_langinfo_l>(), если I<locale> задаёт локаль, в которой не определены данные I<langinfo>.

source: If I<item> is not valid, a pointer to an empty string is returned.
ru: Если задано неправильное значение I<item>, то возвращается указатель на пустую строку.

source: The pointer returned by these functions may point to static data that may be overwritten, or the pointer itself may be invalidated, by a subsequent call to B<nl_langinfo>(), B<nl_langinfo_l>(), or B<setlocale>(3). The same statements apply to B<nl_langinfo_l>() if the locale object referred to by I<locale> is freed or modified by B<freelocale>(3) or B<newlocale>(3).
ru: Указатель, возвращаемый этими функциями, может указывать на статические данные, которые могут быть перезаписаны, или сам указатель может стать некорректным при последующих вызовах B<nl_langinfo>, B<nl_langinfo_l>() или B<setlocale>(3). Это же утверждение применимо и к B<nl_langinfo_l>(), если объект локали, на которую указывает I<locale>, освобождается или изменяется функциями B<freelocale>(3) или B<newlocale>(3).

source: POSIX specifies that the application may not modify the string returned by these functions.
ru: В POSIX указано, что приложение не может изменить строку, возвращаемую этими функциями.

source: The behavior of B<nl_langinfo_l>() is undefined if I<locale> is the special locale object B<LC_GLOBAL_LOCALE> or is not a valid locale object handle.
ru: Поведение B<nl_langinfo_l>() не определено, если значение I<locale> равно специальному объекту локали B<LC_GLOBAL_LOCALE> или некорректному описателю объекта локали.

source: The following program sets the character type and the numeric locale according to the environment and queries the terminal character set and the radix character.
ru: Следующая программа настраивает кодировку символов и чисел локали в соответствии с окружением и запрашивает кодировку символов терминала и основание системы счисления.

source: The GNU C Library Reference Manual
ru: Справочное руководство по библиотеке GNU C (GNU C Library Reference Manual)

source: nextup, nextupf, nextupl, nextdown, nextdownf, nextdownl - return next floating-point number toward positive/negative infinity
ru: nextup, nextupf, nextupl, nextdown, nextdownf, nextdownl - возвращают следующее число с плавающей запятой, учитывая положительную/отрицательную бесконечность

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>math.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>math.hE<gt>>

source: The B<nextup>(), B<nextupf>(), and B<nextupl>() functions return the next representable floating-point number greater than I<x>.
ru: Функции B<nextup>(), B<nextupf>() и B<nextupl>() возвращают следующее представимое число с плавающей запятой, которое больше I<x>.

source: If I<x> is the smallest representable negative number in the corresponding type, these functions return -0. If I<x> is 0, the returned value is the smallest representable positive number of the corresponding type.
ru: Если I<x> — самое малое представимое отрицательное число соответствующего типа, то эти функции возвращают -0. Если I<x> равно 0, то возвращается самое малое представимое положительное число соответствующего типа.

source: If I<x> is positive infinity, the returned value is positive infinity. If I<x> is negative infinity, the returned value is the largest representable finite negative number of the corresponding type.
ru: Если I<x> равно положительной бесконечности, то возвращается положительная бесконечность. Если I<x> равно отрицательной бесконечности, то возвращается наибольшее представимое конечное отрицательное число соответствующего типа.

source: If I<x> is Nan, the returned value is NaN.
ru: Если значение I<x> равно NaN, то возвращается NaN.

source: The value returned by I<nextdown(x)> is I<-nextup(-x)>, and similarly for the other types.
ru: Значение, возвращаемое I<nextdown(x)>, равно I<-nextup(-x)> и похожее делается для других типов.

source: See DESCRIPTION.
ru: Смотрите ОПИСАНИЕ.

source: These functions first appeared in glibc in version 2.24.
ru: Эти функции впервые появились в glibc 2.24.

source: These functions are described in I<IEEE Std 754-2008 - Standard for Floating-Point Arithmetic> and I<ISO/IEC TS 18661>.
ru: Данные функции описаны в I<IEEE Std 754-2008 - Standard for Floating-Point Arithmetic> и I<ISO/IEC TS 18661>.
