Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: Bind mounting (see B<mount>(2)) one of the files in this directory to somewhere else in the filesystem keeps the corresponding namespace of the process specified by I<pid> alive even if all processes currently in the namespace terminate.
ru: При привязке монтирования (bind mounting) (смотрите B<mount>(2)) одного из файлов этого каталога в другое место в файловой системе данное пространство имён процесса с I<pid> не удаляется, даже если все процессы в пространстве имён завершились.

source: Opening one of the files in this directory (or a file that is bind mounted to one of these files) returns a file handle for the corresponding namespace of the process specified by I<pid>. As long as this file descriptor remains open, the namespace will remain alive, even if all processes in the namespace terminate. The file descriptor can be passed to B<setns>(2).
ru: При открытии одного из файлов этого каталога (или файла, который был привязан монтированием в один из этих файлов) возвращается файловый описатель соответствующего пространства имён процесса заданного I<pid>. Пока этот файловый дескриптор остаётся открытым, пространство имён будет оставаться действующим, даже если все процессы в пространстве имён завершились. Файловый дескриптор может быть передан в B<setns>(2).

source: In Linux 3.7 and earlier, these files were visible as hard links. Since Linux 3.8, they appear as symbolic links. If two processes are in the same namespace, then the device IDs and inode numbers of their I</proc/[pid]/ns/xxx> symbolic links will be the same; an application can check this using the I<stat.st_dev> and I<stat.st_ino> fields returned by B<stat>(2). The content of this symbolic link is a string containing the namespace type and inode number as in the following example:
ru: В Linux 3.7 и старее эти файлы видимы как жёсткие ссылки. Начиная с Linux 3.8 они представляются символьными ссылками. Если два процесса находятся в одном пространстве имён, то значения идентификаторов устройств и номера инод их символьных ссылок I</proc/[pid]/ns/xxx> одинаковы; приложение может проверить это через поля I<stat.st_dev> и I<stat.st_ino>, возвращаемые B<stat>(2). Содержимое этой символьной ссылки представляет собой строку с типом пространства имён и значением иноды:

source: The symbolic links in this subdirectory are as follows:
ru: В этом подкаталоге содержатся символические ссылки:

source: I</proc/[pid]/ns/cgroup> (since Linux 4.6)
ru: I</proc/[pid]/ns/cgroup> (начиная с Linux 4.6)

source: This file is a handle for the cgroup namespace of the process.
ru: Данный файл является описателем пространства имён cgroup этого процесса.

source: I</proc/[pid]/ns/ipc> (since Linux 3.0)
ru: I</proc/[pid]/ns/ipc> (начиная с Linux 3.0)

source: This file is a handle for the IPC namespace of the process.
ru: Данный файл является описателем пространства имён IPC этого процесса.

source: I</proc/[pid]/ns/mnt> (since Linux 3.8)
ru: I</proc/[pid]/ns/mnt> (начиная с Linux 3.8)

source: This file is a handle for the mount namespace of the process.
ru: Данный файл является описателем пространства имён mount этого процесса.

source: I</proc/[pid]/ns/net> (since Linux 3.0)
ru: I</proc/[pid]/ns/net> (начиная с Linux 3.0)

source: This file is a handle for the network namespace of the process.
ru: Данный файл является описателем пространства имён network этого процесса.

source: I</proc/[pid]/ns/pid> (since Linux 3.8)
ru: I</proc/[pid]/ns/pid> (начиная с Linux 3.8)

source: This file is a handle for the PID namespace of the process. This handle is permanent for the lifetime of the process (i.e., a process's PID namespace membership never changes).
ru: Этот является описателем пространства имён PID этого процесса. Данный описатель постоянен на протяжении всей жизни процесса (т. е., членство пространства имён PID процесса никогда не меняется).

source: I</proc/[pid]/ns/pid_for_children> (since Linux 4.12)
ru: I</proc/[pid]/ns/pid_for_children> (начиная с Linux 4.12)

source: This file is a handle for the PID namespace of child processes created by this process. This can change as a consequence of calls to B<unshare>(2) and B<setns>(2) (see B<pid_namespaces>(7)), so the file may differ from I</proc/[pid]/ns/pid>. The symbolic link gains a value only after the first child process is created in the namespace. (Beforehand, B<readlink>(2) of the symbolic link will return an empty buffer.)
ru: Этот файл является описателем пространства имён PID дочерних процессов, созданных этим процессом. Он может изменяться послевызовов B<unshare>(2) и B<setns>(2) (смотрите B<pid_namespaces>(7)), поэтому файл может отличаться от I</proc/[pid]/ns/pid>. Данные по символьной ссылке появляются только после создания в пространстве имён первого дочернего процесса (до этого вызов B<readlink>(2) с символьной ссылкой вернёт пустой буфер).

source: I</proc/[pid]/ns/user> (since Linux 3.8)
ru: I</proc/[pid]/ns/user> (начиная с Linux 3.8)

source: This file is a handle for the user namespace of the process.
ru: Данный файл является описателем пространства имён user этого процесса.

source: I</proc/[pid]/ns/uts> (since Linux 3.0)
ru: I</proc/[pid]/ns/uts> (начиная с Linux 3.0)

source: This file is a handle for the UTS namespace of the process.
ru: Данный файл является описателем пространства имён UTS этого процесса.

source: Permission to dereference or read (B<readlink>(2)) these symbolic links is governed by a ptrace access mode B<PTRACE_MODE_READ_FSCREDS> check; see B<ptrace>(2).
ru: Право разыменовывать или читать (B<readlink>(2)) данные символические ссылки определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_FSCREDS>; смотрите B<ptrace>(2).

source: The /proc/sys/user directory
ru: Каталог /proc/sys/user

source: The files in the I</proc/sys/user> directory (which is present since Linux 4.9) expose limits on the number of namespaces of various types that can be created. The files are as follows:
ru: Файлы в каталоге I</proc/sys/user> (появился в Linux начиная с версии 4.9) отражают ограничения на количество пространств имён различных типов, которые могут быть созданы. Файлы:

source: The value in this file defines a per-user limit on the number of cgroup namespaces that may be created in the user namespace.
ru: Значение в этом файле определяет ограничение по каждому пользователю на количество пространств имён cgroup, которые могут быть созданы в пространстве имён пользователя.

source: The value in this file defines a per-user limit on the number of ipc namespaces that may be created in the user namespace.
ru: Значение в этом файле определяет ограничение по каждому пользователю на количество пространств имён ipc, которые могут быть созданы в пространстве имён пользователя.

source: The value in this file defines a per-user limit on the number of mount namespaces that may be created in the user namespace.
ru: Значение в этом файле определяет ограничение по каждому пользователю на количество пространств имён монтирования, которые могут быть созданы в пространстве имён пользователя.

source: The value in this file defines a per-user limit on the number of network namespaces that may be created in the user namespace.
ru: Значение в этом файле определяет ограничение по каждому пользователю на количество сетевых пространств имён, которые могут быть созданы в пространстве имён пользователя.

source: The value in this file defines a per-user limit on the number of pid namespaces that may be created in the user namespace.
ru: Значение в этом файле определяет ограничение по каждому пользователю на количество пространств имён pid, которые могут быть созданы в пространстве имён пользователя.

source: The value in this file defines a per-user limit on the number of user namespaces that may be created in the user namespace.
ru: Значение в этом файле определяет ограничение по каждому пользователю на количество пользовательских пространств имён, которые могут быть созданы в пространстве имён пользователя.

source: The value in this file defines a per-user limit on the number of uts namespaces that may be created in the user namespace.
ru: Значение в этом файле определяет ограничение по каждому пользователю на количество пространств имён uts, которые могут быть созданы в пространстве имён пользователя.

source: Note the following details about these files:
ru: Замечания к этим файлам:

source: The values in these files are modifiable by privileged processes.
ru: Значения в этих файлам могут изменяться привилегированными процессами.

source: The values exposed by these files are the limits for the user namespace in which the opening process resides.
ru: Значения, отражаемые в этих файлах, являются ограничениями пользовательского пространства имён, в котором располагается открывающий процесс.

source: The limits are per-user. Each user in the same user namespace can create namespaces up to the defined limit.
ru: Ограничение устанавливается по каждому пользователю отдельно. Каждый пользователь в одном пространстве имён пользователя может создать столько пространств имён, сколько допускается это ограничение.

source: The limits apply to all users, including UID 0.
ru: Ограничения применяются ко всем пользователям, даже имеющим UID 0.

source: These limits apply in addition to any other per-namespace limits (such as those for PID and user namespaces) that may be enforced.
ru: Эти ограничения применяются в дополнении к другим накладываемым ограничениям, касающимся каждого пространства имён (например, для пользовательского пространства имён и пространства имён PID).

source: Upon encountering these limits, B<clone>(2) and B<unshare>(2) fail with the error B<ENOSPC>.
ru: При достижении этих ограничений вызовы B<clone>(2) и B<unshare>(2) завершаются ошибкой B<ENOSPC>.

source: For the initial user namespace, the default value in each of these files is half the limit on the number of threads that may be created (I</proc/sys/kernel/threads-max>). In all descendant user namespaces, the default value in each file is B<MAXINT>.
ru: Для первоначального пространства пользовательского пространства имён значение по умолчанию в каждом файле равно половине ограничения на количество нитей, которые могут быть созданы (I</proc/sys/kernel/threads-max>). В всех дочерних пользовательских пространств имён значение по умолчанию каждого файла равно B<MAXINT>.

source: When a namespace is created, the object is also accounted against ancestor namespaces. More precisely:
ru: Когда пространство имён создаётся, этот объект также учитывается в родительских пространствах имён. То есть:

source: Each user namespace has a creator UID.
ru: Каждое пользовательское пространство имён имен создателя UID.

source: When a namespace is created, it is accounted against the creator UIDs in each of the ancestor user namespaces, and the kernel ensures that the corresponding namespace limit for the creator UID in the ancestor namespace is not exceeded.
ru: Когда пространство имён создаётся, это учитывается в UID создателя в каждом родительском пользовательском пространстве имён, и ядро проверяет, что соответствующее ограничение на пространство имён для UID создателя не превысило значение в родительском пространстве имён.

source: The aforementioned point ensures that creating a new user namespace cannot be used as a means to escape the limits in force in the current user namespace.
ru: Это гарантирует, что созданием нового пользовательского пространства имён нельзя воспользоваться для выхода за ограничения, установленные для текущего пользователя.

source: Cgroup namespaces (CLONE_NEWCGROUP)
ru: Пространства имён cgroup (CLONE_NEWCGROUP)

source: See B<cgroup_namespaces>(7).
ru: Смотрите B<cgroup_namespaces>(7).

source: IPC namespaces (CLONE_NEWIPC)
ru: Пространства имён IPC (CLONE_NEWIPC)

source: IPC namespaces isolate certain IPC resources, namely, System V IPC objects (see B<svipc>(7)) and (since Linux 2.6.30) POSIX message queues (see B<mq_overview>(7)). The common characteristic of these IPC mechanisms is that IPC objects are identified by mechanisms other than filesystem pathnames.
ru: Пространства имён IPC изолируют определённые ресурсы IPC, а именно IPC-объекты System V (смотрите B<svipc>(7)) и (начиная с Linux 2.6.30) очереди сообщений POSIX (смотрите B<mq_overview>(7)). Общая характеристика этих механизмов IPC в том, что объекты IPC распознаются механизмами не как пути файловой системы.

source: Each IPC namespace has its own set of System V IPC identifiers and its own POSIX message queue filesystem. Objects created in an IPC namespace are visible to all other processes that are members of that namespace, but are not visible to processes in other IPC namespaces.
ru: Каждое пространство имён IPC имеет свой набор идентификаторов System V IPC и свою файловую систему для очереди сообщений POSIX. Объекты, созданные в пространстве имён IPC, видимы всем другим процессам, которые являются членами этого пространства имён, и невидимы процессам из других пространств имён IPC.

source: The following I</proc> interfaces are distinct in each IPC namespace:
ru: Следующие интерфейсы I</proc> отличаются в каждом пространстве имён IPC:

source: The POSIX message queue interfaces in I</proc/sys/fs/mqueue>.
ru: Интерфейсы очереди сообщений POSIX в I</proc/sys/fs/mqueue>.

source: The System V IPC interfaces in I</proc/sys/kernel>, namely: I<msgmax>, I<msgmnb>, I<msgmni>, I<sem>, I<shmall>, I<shmmax>, I<shmmni>, and I<shm_rmid_forced>.
ru: IPC-интерфейсы System V в I</proc/sys/kernel>, а именно: I<msgmax>, I<msgmnb>, I<msgmni>, I<sem>, I<shmall>, I<shmmax>, I<shmmni> и I<shm_rmid_forced>.

source: The System V IPC interfaces in I</proc/sysvipc>.
ru: IPC-интерфейсы System V в I</proc/sysvipc>.

source: When an IPC namespace is destroyed (i.e., when the last process that is a member of the namespace terminates), all IPC objects in the namespace are automatically destroyed.
ru: При уничтожении пространства имён IPC (т. е., когда завершается последний процесс из этого пространства имён), все объекты IPC из пространства имён автоматически уничтожаются.

source: Use of IPC namespaces requires a kernel that is configured with the B<CONFIG_IPC_NS> option.
ru: Для использования пространств имён IPC требуется, чтобы ядро было собрано с параметром B<CONFIG_IPC_NS>.

source: Network namespaces (CLONE_NEWNET)
ru: Пространства имён network (CLONE_NEWNET)

source: See B<network_namespaces>(7).
ru: Смотрите B<network_namespaces>(7).

source: Mount namespaces (CLONE_NEWNS)
ru: Пространства имён mount (CLONE_NEWNS)

source: See B<mount_namespaces>(7).
ru: Смотрите B<mount_namespaces>(7).

source: PID namespaces (CLONE_NEWPID)
ru: Пространства имён PID (CLONE_NEWPID)

source: See B<pid_namespaces>(7).
ru: Смотрите B<pid_namespaces>(7).

source: User namespaces (CLONE_NEWUSER)
ru: Пространства имён user (CLONE_NEWUSER)

source: See B<user_namespaces>(7).
ru: Смотрите B<user_namespaces>(7).

source: UTS namespaces (CLONE_NEWUTS)
ru: Пространства имён UTS (CLONE_NEWUTS)

source: UTS namespaces provide isolation of two system identifiers: the hostname and the NIS domain name. These identifiers are set using B<sethostname>(2) and B<setdomainname>(2), and can be retrieved using B<uname>(2), B<gethostname>(2), and B<getdomainname>(2).
ru: Пространства имён UTS изолируют два системных идентификатора: имя узла и доменное имя NIS. Эти идентификаторы задаются с помощью B<sethostname>(2) и B<setdomainname>(2), и могут быть получены с помощью B<uname>(2), B<gethostname>(2) и B<getdomainname>(2).

source: Use of UTS namespaces requires a kernel that is configured with the B<CONFIG_UTS_NS> option.
ru: Для использования пространств имён UTS требуется, чтобы ядро было собрано с параметром B<CONFIG_UTS_NS>.

source: Namespace lifetime
ru: Время жизни пространства имён

source: Absent any other factors, a namespace is automatically torn down when the last process in the namespace terminates or leaves the namespace. However, there are a number of other factors that may pin a namespace into existence even though it has no member processes. These factors include the following:
ru: При отсутствии других факторов, пространство имён автоматически удаляется, когда последний процесс в пространстве имён завершается или покидает его. Однако есть несколько факторов, которые могут задержать существование пространства имён даже при отсутствии процессов в нём. К таким факторам относятся следующие:

source: An open file descriptor or a bind mount exists for the corresponding I</proc/[pid]/ns/*> file.
ru: Существуют открытый дескриптор файла или привязанное монтирование для соответствующего файла I</proc/[pid]/ns/*>.

source: The namespace is hierarchical (i.e., a PID or user namespace), and has a child namespace.
ru: Пространство имён иерархично (т. е., пространство имён PID или пользовательское) и имеет дочернее пространство имён.

source: It is a user namespace that owns one or more nonuser namespaces.
ru: Это пользовательское пространство имен, которое владеет одним или несколькими непользовательскими пространствами имён.

source: It is a PID namespace, and there is a process that refers to the namespace via a I</proc/[pid]/ns/pid_for_children> symbolic link.
ru: Это пространство имён PID и существует процесс, который ссылается на пространство имён через символьную ссылку I</proc/[pid]/ns/pid_for_children>.

source: It is an IPC namespace, and a corresponding mount of an I<mqueue> filesystem (see B<mq_overview>(7)) refers to this namespace.
ru: Это пространство имён IPC и соответствующее монтирование файловой системы I<mqueue> (смотрите B<mq_overview>(7)) ссылается на это пространство имён.

source: It is a PID namespace, and a corresponding mount of a B<proc>(5) filesystem refers to this namespace.
ru: Это пространство имён PID и соответствующее монтирование файловой системы B<proc>(5) ссылается на это пространство имён.

source: See B<clone>(2) and B<user_namespaces>(7).
ru: Смотрите B<clone>(2) и B<user_namespaces>(7).

source: network_namespaces - overview of Linux network namespaces
ru: network_namespaces - обзор сетевых пространств имён Linux

source: Network namespaces provide isolation of the system resources associated with networking: network devices, IPv4 and IPv6 protocol stacks, IP routing tables, firewall rules, the I</proc/net> directory (which is a symbolic link to I</proc/PID/net>), the I</sys/class/net> directory, various files under I</proc/sys/net>, port numbers (sockets), and so on. In addition, network namespaces isolate the UNIX domain abstract socket namespace (see B<unix>(7)).
ru: Сетевые пространства имён позволяют изолировать системные ресурсы, связанные с сетью: сетевые устройства, стеки протоколов IPv4 и IPv6, таблицы IP-маршрутизации, правила межсетевых экранов, каталог I</proc/net> (символическая ссылка на I</proc/PID/net>), каталог I</sys/class/net>, различные файлы в I</proc/sys/net>, номера портов (сокеты) и т. п. Также сетевые пространства имён изолируют пространство имён абстрактных сокетов домена UNIX (смотрите B<unix>(7)).

source: A physical network device can live in exactly one network namespace. When a network namespace is freed (i.e., when the last process in the namespace terminates), its physical network devices are moved back to the initial network namespace (not to the parent of the process).
ru: Физическое сетевое устройство может находиться только в одном сетевом пространстве имён. Когда сетевое пространство имён высвобождается (т. е., когда завершается последний процесс в пространстве имён), его физические сетевые устройства перемещаются обратно в первоначальное сетевое пространство имён (не родительского процесса).

source: A virtual network (B<veth>(4)) device pair provides a pipe-like abstraction that can be used to create tunnels between network namespaces, and can be used to create a bridge to a physical network device in another namespace. When a namespace is freed, the B<veth>(4) devices that it contains are destroyed.
ru: Пара устройств виртуальной сети (B<veth>(4)) предоставляет подобную каналу абстракцию, которую можно использовать для создания туннелей между сетевыми пространствами имён, а также для создания мостов к физическому сетевому устройству в другом пространстве имён. Когда пространство имён освобождается, устройства B<veth>(4), содержащиеся в нём, уничтожаются.

source: Use of network namespaces requires a kernel that is configured with the B<CONFIG_NET_NS> option.
ru: Для использования пространств имён network требуется, чтобы ядро было собрано с параметром B<CONFIG_NET_NS>.

source: nanosleep - high-resolution sleep
ru: nanosleep - остановка работы процесса с более точным указанием периода

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: B<nanosleep>() suspends the execution of the calling thread until either at least the time specified in I<*req> has elapsed, or the delivery of a signal that triggers the invocation of a handler in the calling thread or that terminates the process.
ru: B<nanosleep>() приостанавливает работу вызывающей нити как минимум на время, заданное параметром I<*req>, или до получения сигнала, который вызовет обработчик в вызывающей нити, или приведёт к завершению процесса.

source: If the call is interrupted by a signal handler, B<nanosleep>() returns -1, sets I<errno> to B<EINTR>, and writes the remaining time into the structure pointed to by I<rem> unless I<rem> is NULL. The value of I<*rem> can then be used to call B<nanosleep>() again and complete the specified pause (but see NOTES).
ru: Если вызов прерван обработчиком сигнала, то B<nanosleep>() возвращает -1, устанавливает I<errno> в значение B<EINTR> и записывает оставшееся время в структуру, на которую указывает I<rem>, если значение I<rem> не равно NULL. Значение I<*rem> можно использовать для повторения вызова B<nanosleep>() и продления окончания ожидания интервала (но см. ЗАМЕЧАНИЯ).

source: The structure I<timespec> is used to specify intervals of time with nanosecond precision. It is defined as follows:
ru: Структура I<timespec> позволяет задавать интервалы времени с точностью до наносекунды. Она определена следующим образом:

source: struct timespec { time_t tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
ru: struct timespec { time_t tv_sec; /* секунды */ long tv_nsec; /* наносекунды */ };

source: The value of the nanoseconds field must be in the range 0 to 999999999.
ru: Значение поля наносекунд должно находиться в диапазоне от 0 до 999999999.

source: Compared to B<sleep>(3) and B<usleep>(3), B<nanosleep>() has the following advantages: it provides a higher resolution for specifying the sleep interval; POSIX.1 explicitly specifies that it does not interact with signals; and it makes the task of resuming a sleep that has been interrupted by a signal handler easier.
ru: По сравнению с B<sleep>(3) и B<usleep>(3), в B<nanosleep>() есть следующие достоинства: он позволяет задавать более точные интервалы времени, в POSIX.1 явно определено то, что он не влияет на сигналы, и позволяет более лёгким способом возобновить паузу после прерывания сигналом.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On successfully sleeping for the requested interval, B<nanosleep>() returns 0. If the call is interrupted by a signal handler or encounters an error, then it returns -1, with I<errno> set to indicate the error.
ru: При удачной остановке на заданное время возвращаемое B<nanosleep>() значение равно нулю. Если вызов прерван обработчиком сигнала или произошла ошибка, то возвращается -1, а переменной I<errno> присваивается номер ошибки.

source: ERRORS
ru: ОШИБКИ

source: Problem with copying information from user space.
ru: Проблема с копированием информации из пространства пользователя.
