Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: Number of pages that are currently being written out to disk.
ru: Количество страниц, которые в настоящий момент записываются на диск.

source: No standards govern NUMA interfaces.
ru: Интерфейсы NUMA не описаны в стандартах.

source: The Linux NUMA system calls and I</proc> interface are available only if the kernel was configured and built with the B<CONFIG_NUMA> option.
ru: Системные вызовы Linux NUMA и интерфейс I</proc> доступны только, если ядро было собрано с включённым параметром B<CONFIG_NUMA>.

source: Library support
ru: Поддержка в библиотеках

source: Link with I<-lnuma> to get the system call definitions. I<libnuma> and the required I<E<lt>numaif.hE<gt>> header are available in the I<numactl> package.
ru: Выполняйте компоновку с I<-lnuma>. Библиотека I<libnuma> и требуемый заголовочный файл I<E<lt>numaif.hE<gt>> доступны в пакете I<numactl>.

source: However, applications should not use these system calls directly. Instead, the higher level interface provided by the B<numa>(3) functions in the I<numactl> package is recommended. The I<numactl> package is available at E<.UR ftp://oss.sgi.com\:/www\:/projects\:/libnuma\:/download/> E<.UE .> The package is also included in some Linux distributions. Some distributions include the development library and header in the separate I<numactl-devel> package.
ru: Однако, приложения не должны использовать эти системные вызовы напрямую. Вместо этого, рекомендуется использовать интерфейс высокого уровня, предоставляемый функциями B<numa>(3) из пакета I<numactl>. Пакет I<numactl> доступен по адресу E<.UR ftp://oss.sgi.com\:/www\:/projects\:/libnuma\:/download/> E<.UE .>Пакет также включён в некоторые дистрибутивы Linux. Некоторые дистрибутивы помещают библиотеку для разработки и заголовочные файлы в пакет I<numactl-devel>.

source: netdevice - low-level access to Linux network devices
ru: netdevice - низкоуровневый доступ к сетевым устройствам Linux

source: This man page describes the sockets interface which is used to configure network devices.
ru: В этой справочной странице описан интерфейс сокетов, используемый для настройки сетевых устройств.

source: Linux supports some standard ioctls to configure network devices. They can be used on any socket's file descriptor regardless of the family or type. Most of them pass an I<ifreq> structure:
ru: Linux поддерживает несколько стандартных вызовов ioctl для настройки сетевых устройств. Они могут применяться для любого файлового дескриптора сокета независимо от семейства или типа сокета. В качестве параметра большинство из них передаёт структуру I<ifreq>:

source: struct ifreq { char ifr_name[IFNAMSIZ]; /* Interface name */ union { struct sockaddr ifr_addr; struct sockaddr ifr_dstaddr; struct sockaddr ifr_broadaddr; struct sockaddr ifr_netmask; struct sockaddr ifr_hwaddr; short ifr_flags; int ifr_ifindex; int ifr_metric; int ifr_mtu; struct ifmap ifr_map; char ifr_slave[IFNAMSIZ]; char ifr_newname[IFNAMSIZ]; char *ifr_data; }; };
ru: struct ifreq { char ifr_name[IFNAMSIZ]; /* имя интерфейса */ union { struct sockaddr ifr_addr; struct sockaddr ifr_dstaddr; struct sockaddr ifr_broadaddr; struct sockaddr ifr_netmask; struct sockaddr ifr_hwaddr; short ifr_flags; int ifr_ifindex; int ifr_metric; int ifr_mtu; struct ifmap ifr_map; char ifr_slave[IFNAMSIZ]; char ifr_newname[IFNAMSIZ]; char *ifr_data; }; };

source: Normally, the user specifies which device to affect by setting I<ifr_name> to the name of the interface. All other members of the structure may share memory.
ru: Обычно, пользователь указывает имя нужного устройства в I<ifr_name>. Все остальные поля структуры могут занимать единое пространство в памяти.

source: Ioctls
ru: Вызовы ioctl

source: If an ioctl is marked as privileged, then using it requires an effective user ID of 0 or the B<CAP_NET_ADMIN> capability. If this is not the case, B<EPERM> will be returned.
ru: Если указано, вызов ioctl считается привилегированным, то для его использования необходимо иметь эффективный идентификатор пользователя 0 или мандат B<CAP_NET_ADMIN>. В противном случае будет возвращено значение B<EPERM>.

source: Given the I<ifr_ifindex>, return the name of the interface in I<ifr_name>. This is the only ioctl which returns its result in I<ifr_name>.
ru: Возвращает в I<ifr_name> имя интерфейса для заданного индекса I<ifr_ifindex>. Это единственный вызов ioctl, возвращающий результат в I<ifr_name>.

source: Retrieve the interface index of the interface into I<ifr_ifindex>.
ru: Возвращает индекс интерфейса в I<ifr_ifindex>.

source: Get or set the active flag word of the device. I<ifr_flags> contains a bit mask of the following values:
ru: Считывает или устанавливает слово флагов устройства. В I<ifr_flags> содержится битовая маска из следующих значений:

source: Device flags
ru: Флаги устройства

source: Interface is running.
ru: Интерфейс активен.

source: Valid broadcast address set.
ru: Установлен правильный широковещательный адрес.

source: Internal debugging flag.
ru: Флаг внутренней отладки.

source: Interface is a loopback interface.
ru: Интерфейс является устройством обратной петли.

source: Interface is a point-to-point link.
ru: Интерфейс является соединением точка-точка.

source: Resources allocated.
ru: Ресурсы выделены.

source: No arp protocol, L2 destination address not set.
ru: Нет протокола arp, адрес назначения 2-ого уровня (L2) не установлен.

source: Interface is in promiscuous mode.
ru: Интерфейс в режиме прослушки (promiscuous).

source: Avoid use of trailers.
ru: Избегать использования концевиков (trailers).

source: Receive all multicast packets.
ru: Принимать все многоадресные пакеты.

source: Master of a load balancing bundle.
ru: Мастер в связке балансирования нагрузки.

source: Slave of a load balancing bundle.
ru: Подчинённый в связке балансирования нагрузки.

source: Supports multicast
ru: Поддержка многоадресной передачи.

source: Is able to select media type via ifmap.
ru: Может выбирать тип среды с помощью ifmap.

source: Auto media selection active.
ru: Запущен автоматический выбор среды.

source: The addresses are lost when the interface goes down.
ru: Адреса теряются, если интерфейс становится неактивным.

source: Driver signals L1 up (since Linux 2.6.17)
ru: Сигналы драйвера L1 указывают на включение интерфейса (начиная с Linux 2.6.17).

source: Driver signals dormant (since Linux 2.6.17)
ru: Сигналы драйвера указывают на неактивность интерфейса (начиная с Linux 2.6.17).

source: Echo sent packets (since Linux 2.6.25)
ru: Посылать пакеты echo (начиная с Linux 2.6.25).

source: Setting the active flag word is a privileged operation, but any process may read it.
ru: Установка флага в слове флагов является привилегированной операцией, но считывать его может любой процесс.

source: Get or set extended (private) flags for the device. I<ifr_flags> contains a bit mask of the following values:
ru: Считает или устанавливает (индивидуальные) флаги устройства. Значение I<ifr_flags> представляет собой битовую маску следующих значений:

source: Private flags
ru: Индивидуальные флаги

source: Interface is 802.1Q VLAN device.
ru: Интерфейс является устройством 802.1Q VLAN.

source: Interface is Ethernet bridging device.
ru: Интерфейс является устройством моста Ethernet.

source: Interface is inactive bonding slave.
ru: Интерфейс является неактивным подчинённым в связке балансирования нагрузки.

source: Interface is 802.3ad bonding master.
ru: Интерфейс является мастером в связке балансирования нагрузки 802.3ad.

source: Interface is balanced-alb bonding master.
ru: Интерфейс является мастером связки балансирования нагрузки в режиме balanced-alb.

source: Interface is a bonding master or slave.
ru: Интерфейс является мастером или подчинённым в связке балансирования нагрузки.

source: Interface needs ARPs for validation.
ru: Интерфейсу требуется ARP для проверки.

source: Interface is RFC4214 ISATAP interface.
ru: Интерфейс является интерфейсом RFC4214 ISATAP.

source: Setting the extended (private) interface flags is a privileged operation.
ru: Установка расширенных (индивидуальных) флагов интерфейса является привилегированной операцией.

source: Get or set the address of the device using I<ifr_addr>. Setting the interface address is a privileged operation. For compatibility, only B<AF_INET> addresses are accepted or returned.
ru: Назначает или получает адрес устройства с помощью I<ifr_addr>. Назначение адреса интерфейса является привилегированной операцией. Для совместимости, принимаются или возвращаются только адреса семейства B<AF_INET>.

source: Get or set the destination address of a point-to-point device using I<ifr_dstaddr>. For compatibility, only B<AF_INET> addresses are accepted or returned. Setting the destination address is a privileged operation.
ru: Назначает или получает адрес назначения устройства точка-точка с помощью I<ifr_dstaddr>. Для совместимости, принимаются или возвращаются только адреса семейства B<AF_INET>. Присвоение адреса назначения является привилегированной операцией.

source: Get or set the broadcast address for a device using I<ifr_brdaddr>. For compatibility, only B<AF_INET> addresses are accepted or returned. Setting the broadcast address is a privileged operation.
ru: Назначает или получает широковещательный адрес устройства с помощью I<ifr_brdaddr>. Для совместимости, принимаются или возвращаются только адреса семейства B<AF_INET>. Присвоение широковещательного адреса является привилегированной операцией.

source: Get or set the network mask for a device using I<ifr_netmask>. For compatibility, only B<AF_INET> addresses are accepted or returned. Setting the network mask is a privileged operation.
ru: Назначает или получает маску сети устройства с помощью I<ifr_netmask>. Для совместимости, принимаются или возвращаются только адреса семейства B<AF_INET>. Назначение маски сети адреса является привилегированной операцией.

source: Get or set the metric of the device using I<ifr_metric>. This is currently not implemented; it sets I<ifr_metric> to 0 if you attempt to read it and returns B<EOPNOTSUPP> if you attempt to set it.
ru: Считывает или устанавливает метрику устройства с помощью I<ifr_metric>. В данный момент возможность не реализована; при считывании I<ifr_metric> присваивается значение, равное нулю, а при попытке установки возвращается значение B<EOPNOTSUPP>.

source: Get or set the MTU (Maximum Transfer Unit) of a device using I<ifr_mtu>. Setting the MTU is a privileged operation. Setting the MTU to too small values may cause kernel crashes.
ru: Считывает или устанавливает MTU (Maximum Transfer Unit — максимальную порцию данных) с помощью I<ifr_mtu>. Установка MTU является привилегированной операцией. Установка слишком маленьких значений может привести к авариям в ядре.

source: Get or set the hardware address of a device using I<ifr_hwaddr>. The hardware address is specified in a struct I<sockaddr>. I<sa_family> contains the ARPHRD_* device type, I<sa_data> the L2 hardware address starting from byte 0. Setting the hardware address is a privileged operation.
ru: Считывает или устанавливает аппаратный адрес устройства с помощью I<ifr_hwaddr>. Аппаратный адрес задаётся в структуре I<sockaddr>. В I<sa_family> содержится тип устройства ARPHRD_*, в I<sa_data> содержится аппаратный адрес L2, начиная с байта 0. Установка аппаратного адреса является привилегированной операцией.

source: Set the hardware broadcast address of a device from I<ifr_hwaddr>. This is a privileged operation.
ru: Устанавливает аппаратный широковещательный адрес устройства с помощью I<ifr_hwaddr>. Это привилегированная операция.

source: Get or set the interface's hardware parameters using I<ifr_map>. Setting the parameters is a privileged operation.
ru: Считывает или устанавливает аппаратные параметры интерфейса с помощью I<ifr_map>. Установка параметров является привилегированной операцией.

source: The interpretation of the ifmap structure depends on the device driver and the architecture.
ru: Назначение структуры ifmap зависит от драйвера устройства и архитектуры системы.

source: Add an address to or delete an address from the device's link layer multicast filters using I<ifr_hwaddr>. These are privileged operations. See also B<packet>(7) for an alternative.
ru: Добавляет или удаляет адрес из фильтров многоадресной передачи уровня связи устройства с помощью I<ifr_hwaddr>. Это привилегированная операция. Альтернативный способ приведен в B<packet>(7).

source: Get or set the transmit queue length of a device using I<ifr_qlen>. Setting the transmit queue length is a privileged operation.
ru: Считывает или устанавливает размер очереди передачи устройства с помощью I<ifr_qlen>. Установка размера очереди передачи является привилегированной операцией.

source: Changes the name of the interface specified in I<ifr_name> to I<ifr_newname>. This is a privileged operation. It is allowed only when the interface is not up.
ru: Изменяет имя интерфейса, указанное в I<ifr_name>, на I<ifr_newname>. Это привилегированная операция. Она разрешена только тогда, когда интерфейс не активен.

source: Return a list of interface (transport layer) addresses. This currently means only addresses of the B<AF_INET> (IPv4) family for compatibility. Unlike the others, this ioctl passes an I<ifconf> structure:
ru: Возвращает список адресов (транспортного уровня) интерфейсов. В настоящее время, сюда входят только адреса семейства B<AF_INET> (IPv4), для совместимости. В отличии от других, данный ioctl передаёт структуру I<ifconf>:

source: struct ifconf { int ifc_len; /* size of buffer */ union { char *ifc_buf; /* buffer address */ struct ifreq *ifc_req; /* array of structures */ }; };
ru: struct ifconf { int ifc_len; /* размер буфера */ union { char *ifc_buf; /* адрес буфера */ struct ifreq *ifc_req; /* массив структур */ }; };

source: If I<ifc_req> is NULL, B<SIOCGIFCONF> returns the necessary buffer size in bytes for receiving all available addresses in I<ifc_len>. Otherwise, I<ifc_req> contains a pointer to an array of I<ifreq> structures to be filled with all currently active L3 interface addresses. I<ifc_len> contains the size of the array in bytes. Within each I<ifreq> structure, I<ifr_name> will receive the interface name, and I<ifr_addr> the address. The actual number of bytes transferred is returned in I<ifc_len>.
ru: Если I<ifc_req> равно NULL, то B<SIOCGIFCONF> возвращает необходимый размер буфера в байтах для приёма всех доступных адресов в I<ifc_len>. В противном случае I<ifc_req> содержит указатель на массив структур I<ifreq>, который будет заполнен адресами всех активных интерфейсов L3. В I<ifc_len> содержится размер массива в байтах. Внутри каждой структуры I<ifreq> в I<ifr_name> будет записано имя интерфейса, а в I<ifr_addr> — адрес. Реальное количество переданных байт возвращается в I<ifc_len>.

source: If the size specified by I<ifc_len> is insufficient to store all the addresses, the kernel will skip the exceeding ones and return success. There is no reliable way of detecting this condition once it has occurred. It is therefore recommended to either determine the necessary buffer size beforehand by calling B<SIOCGIFCONF> with I<ifc_req> set to NULL, or to retry the call with a bigger buffer whenever I<ifc_len> upon return differs by less than I<sizeof(struct ifreq)> from its original value.
ru: Если размера, указанного в I<ifc_len>, недостаточно для сохранения всех адресов, то ядро не запишет не поместившиеся и сообщит об успешном выполнении. Не существует надёжного способа обнаружения возникновения такой ситуации. Поэтому рекомендуется или сначала определить необходимый размер буфера вызовом B<SIOCGIFCONF> с значением I<ifc_req> равным NULL, или повторить вызов с большим буфером и проверить не отличается ли I<ifc_len> на менее чем I<sizeof(struct ifreq)> от первого значения.

source: If an error occurs accessing the I<ifconf> or I<ifreq> structures, B<EFAULT> will be returned.
ru: Если произошла ошибка доступа к структуре I<ifconf> или I<ifreq>, то возвращается B<EFAULT>.

source: Most protocols support their own ioctls to configure protocol-specific interface options. See the protocol man pages for a description. For configuring IP addresses, see B<ip>(7).
ru: Большинство протоколов поддерживают свои собственные вызовы ioctl для настройки предназначенных только для протокола параметров интерфейса. Подробности приведены в справочных страницах протоколов. Настройка адресов IP описывается в B<ip>(7).

source: In addition, some devices support private ioctls. These are not described here.
ru: В дополнение ко всему, некоторые устройства поддерживают индивидуальные (private) вызовы ioctl. Здесь они не описаны.

source: Strictly speaking, B<SIOCGIFCONF> and the other ioctls that accept or return only B<AF_INET> socket addresses, are IP-specific and belong in B<ip>(7).
ru: Строго говоря, B<SIOCGIFCONF> и другие вызовы ioctl, которые принимают или возвращают только адреса сокетов B<AF_INET>, работают только с IP и принадлежат B<ip>(7).

source: The names of interfaces with no addresses or that don't have the B<IFF_RUNNING> flag set can be found via I</proc/net/dev>.
ru: Имена интерфейсов, не имеющих адресов или установленного флага B<IFF_RUNNING>, можно определить с помощью I</proc/net/dev>.

source: Local IPv6 IP addresses can be found via I</proc/net> or via B<rtnetlink>(7).
ru: Локальные IP-адреса IPv6 можно найти в /proc/net или по B<rtnetlink>(7).

source: glibc 2.1 is missing the I<ifr_newname> macro in I<E<lt>net/if.hE<gt>>. Add the following to your program as a workaround:
ru: В glibc 2.1 отсутствует макрос I<ifr_newname> в файле I<E<lt>net/if.hE<gt>>. Добавьте следующие строки в вашу программу (чтобы обойти это):

source: namespaces - overview of Linux namespaces
ru: namespaces - обзор пространств имён Linux

source: A namespace wraps a global system resource in an abstraction that makes it appear to the processes within the namespace that they have their own isolated instance of the global resource. Changes to the global resource are visible to other processes that are members of the namespace, but are invisible to other processes. One use of namespaces is to implement containers.
ru: Пространства имён облекают глобальный системный ресурс в абстрактную форму, в которой он представляется процессам внутри пространства имён таким образом, что процессы имеют свои собственные изолированные экземпляры глобального ресурса. Изменения глобального ресурса видимы другим процессам, которые являются членами пространства имён, и невидимы остальным процессам. Одно из применений пространств имён — реализация контейнеров.

source: Linux provides the following namespaces:
ru: В Linux предоставляются следующие пространства имён:

source: Namespace
ru: Пространство имён

source: Constant
ru: Константа

source: Isolates
ru: Изоляция

source: Cgroup root directory
ru: корневой каталог cgroup

source: System V IPC, POSIX message queues
ru: System V IPC, очереди сообщений POSIX

source: Network devices, stacks, ports, etc.
ru: сетевые устройства, стеки, порты …

source: Mount points
ru: точки монтирования

source: Process IDs
ru: идентификаторы процессов

source: User and group IDs
ru: Идентификаторы пользователей и групп

source: Hostname and NIS domain name
ru: имя узла и доменное имя NIS

source: This page describes the various namespaces and the associated I</proc> files, and summarizes the APIs for working with namespaces.
ru: В этой странице описаны различные пространства имён и связанные с ними файлы в I</proc>, а также кратко представлен программный интерфейс.

source: The namespaces API
ru: Программный интерфейс пространств имён

source: As well as various I</proc> files described below, the namespaces API includes the following system calls:
ru: и различные файлы в I</proc> описаны далее. В API пространств имён имеются следующие системные вызовы:

source: The B<clone>(2) system call creates a new process. If the I<flags> argument of the call specifies one or more of the B<CLONE_NEW*> flags listed below, then new namespaces are created for each flag, and the child process is made a member of those namespaces. (This system call also implements a number of features unrelated to namespaces.)
ru: Системный вызов B<clone>(2) создаёт новый процесс. Если в аргументе I<flags> указан один или несколько флагов B<CLONE_NEW*>, перечисленных далее, то для каждого флага создаётся новое пространство имён, и дочерний процесс становится членом этих пространств имён (данный системный вызов также служит для других целей, не относящихся к пространствам имён).

source: The B<setns>(2) system call allows the calling process to join an existing namespace. The namespace to join is specified via a file descriptor that refers to one of the I</proc/[pid]/ns> files described below.
ru: Системный вызов B<setns>(2) позволяет вызывающему процессу присоединиться к существующему пространству имён. Требуемое пространство имён указывается через файловый дескриптор, который ссылается на один из файлов I</proc/[pid]/ns>, описанных далее.

source: The B<unshare>(2) system call moves the calling process to a new namespace. If the I<flags> argument of the call specifies one or more of the B<CLONE_NEW*> flags listed below, then new namespaces are created for each flag, and the calling process is made a member of those namespaces. (This system call also implements a number of features unrelated to namespaces.)
ru: Системный вызов B<unshare>(2) перемещает вызывающий процесс в новое пространство имён. Если в аргументе I<flags> указан один или несколько флагов B<CLONE_NEW*>, перечисленных далее, то для каждого флага создаётся новое пространство имён, и дочерний процесс становится членом этих пространств имён (данный системный вызов также служит для других целей, не относящихся к пространствам имён).

source: Various B<ioctl>(2) operations can be used to discover information about namespaces. These operations are described in B<ioctl_ns>(2).
ru: Для получения информации о пространствах имё можно использовать различные операции B<ioctl>(2). Их можно найти в B<ioctl_ns>(2).

source: Creation of new namespaces using B<clone>(2) and B<unshare>(2) in most cases requires the B<CAP_SYS_ADMIN> capability, since, in the new namespace, the creator will have the power to change global resources that are visible to other processes that are subsequently created in, or join the namespace. User namespaces are the exception: since Linux 3.8, no privilege is required to create a user namespace.
ru: Для создания новых пространств имён с помощью B<clone>(2) и B<unshare>(2), в большинстве случаев, требуется мандат B<CAP_SYS_ADMIN>, так как в новом пространстве имён создатель будет обладать возможностью изменять глобальные ресурсы, которые видимы другим процессам, создаваемым или присоединяемым к пространству имён со временем. Исключение составляют пользовательские пространства имён: начиная с Linux 3.8 для создания пользовательского пространства имён особых прав не требуется.

source: The /proc/[pid]/ns/ directory
ru: Каталог /proc/[pid]/ns/

source: Each process has a I</proc/[pid]/ns/> subdirectory containing one entry for each namespace that supports being manipulated by B<setns>(2):
ru: Для каждого процесса в I</proc/[pid]/ns/> есть подкаталог, в котором содержится по одной записи на каждое пространство имён, через которые ими можно управлять с помощью B<setns>().
