Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: The pause has been interrupted by a signal that was delivered to the thread (see B<signal>(7)). The remaining sleep time has been written into I<*rem> so that the thread can easily call B<nanosleep>() again and continue with the pause.
ru: Пауза была прервана сигналом, отправленным нити (смотрите B<signal>(7)). Оставшееся время записано в I<*rem> для того, чтобы нить могла вызвать B<nanosleep>() снова для возобновления паузы.

source: The value in the I<tv_nsec> field was not in the range 0 to 999999999 or I<tv_sec> was negative.
ru: Значение поля I<tv_nsec> не находится в интервале от 0 до 999999999 или I<tv_sec> содержит отрицательное число.

source: If the interval specified in I<req> is not an exact multiple of the granularity underlying clock (see B<time>(7)), then the interval will be rounded up to the next multiple. Furthermore, after the sleep completes, there may still be a delay before the CPU becomes free to once again execute the calling thread.
ru: Если интервал, указанный в I<req>, не кратен степени разрешения используемых часов (см. B<time>(7)), то интервал будет округлён до следующего кратного значения. Также, после окончания интервала приостановки может возникнуть задержка перед тем, как ЦП освободится снова для следующего выполнения вызывающей нити.

source: The fact that B<nanosleep>() sleeps for a relative interval can be problematic if the call is repeatedly restarted after being interrupted by signals, since the time between the interruptions and restarts of the call will lead to drift in the time when the sleep finally completes. This problem can be avoided by using B<clock_nanosleep>(2) with an absolute time value.
ru: Тот факт, что B<nanosleep>() вызывает приостановку на относительный интервал, может привести к проблемам, если вызов постоянно перезапускается после прерывания по сигналу, так как время между прерываниями и перезапуском вызова будет приводить к временному смещению полного завершения приостановки. Этой проблемы можно избежать, если использовать B<clock_nanosleep>(2) с абсолютными величинами времени.

source: POSIX.1 specifies that B<nanosleep>() should measure time against the B<CLOCK_REALTIME> clock. However, Linux measures the time using the B<CLOCK_MONOTONIC> clock. This probably does not matter, since the POSIX.1 specification for B<clock_settime>(2) says that discontinuous changes in B<CLOCK_REALTIME> should not affect B<nanosleep>():
ru: В POSIX.1 указано, что B<nanosleep>() должен измерять время по часам B<CLOCK_REALTIME>. Однако, в Linux время измеряется с помощью часов B<CLOCK_MONOTONIC>. Это, скорее всего, не важно, так как в спецификации POSIX.1 для B<clock_settime>(2) указано, что быстро происходящие изменения в B<CLOCK_REALTIME> не должны влиять на B<nanosleep>():

source: Setting the value of the B<CLOCK_REALTIME> clock via B<clock_settime>(2) shall have no effect on threads that are blocked waiting for a relative time service based upon this clock, including the B<nanosleep>() function; ... Consequently, these time services shall expire when the requested relative interval elapses, independently of the new or old value of the clock.
ru: Установка значения часов B<CLOCK_REALTIME> с помощью B<clock_settime>(2) не оказывает влияния на нити, которые находятся в состоянии простоя из-за служб, работа которых основана на этих часах, включая функцию B<nanosleep>(); ... В результате, интервал данных служб истечёт, когда истечёт запрошенный относительный интервал, независимо от нового или старого значения часов.

source: Old behavior
ru: Старое поведение

source: In order to support applications requiring much more precise pauses (e.g., in order to control some time-critical hardware), B<nanosleep>() would handle pauses of up to 2 milliseconds by busy waiting with microsecond precision when called from a thread scheduled under a real-time policy like B<SCHED_FIFO> or B<SCHED_RR>. This special extension was removed in kernel 2.5.39, and is thus not available in Linux 2.6.0 and later kernels.
ru: Для поддержки приложений, которым требуется указывать более точное время простоя (например, чтобы управлять оборудованием, критичным к временным интервалам), B<nanosleep>() выдерживает время простоя до 2\ мс с микросекундной точностью, если вызывается из нити, запланированной выполняться в реальном времени с помощью B<SCHED_FIFO> или B<SCHED_RR>. Это специальное расширение было удалено из ядра 2.5.39, и поэтому недоступно в Linux версии 2.6.0 и более новых ядрах.

source: If a program that catches signals and uses B<nanosleep>() receives signals at a very high rate, then scheduling delays and rounding errors in the kernel's calculation of the sleep interval and the returned I<remain> value mean that the I<remain> value may steadily I<increase> on successive restarts of the B<nanosleep>() call. To avoid such problems, use B<clock_nanosleep>(2) with the B<TIMER_ABSTIME> flag to sleep to an absolute deadline.
ru: Если программа, обрабатывающая сигналы и использующая B<nanosleep>(), принимает сигналы с очень высокой частотой, то возникают задержки планирования и ошибки округления в ядерных подсчётах интервала сна и возвращается значение I<остатка>, на которое можно уверенно I<увеличивать> интервал при последующем перезапуске вызова B<nanosleep>(). Чтобы избежать таких проблем используйте B<clock_nanosleep>(2) с флагом B<TIMER_ABSTIME>, чтобы спать до абсолютного конечного срока.

source: In Linux 2.4, if B<nanosleep>() is stopped by a signal (e.g., B<SIGTSTP>), then the call fails with the error B<EINTR> after the thread is resumed by a B<SIGCONT> signal. If the system call is subsequently restarted, then the time that the thread spent in the stopped state is I<not> counted against the sleep interval. This problem is fixed in Linux 2.6.0 and later kernels.
ru: В Linux 2.4, если B<nanosleep>() останавливается по сигналу (например, B<SIGTSTP>), то после того, как нить продолжит работу по сигналу B<SIGCONT>, вызов завершится неудачно с ошибкой B<EINTR>. Если системный вызов после этого перезапускается, то время, которое нить провела в остановленном состоянии, I<не> учитывается в интервале остановки. Эта проблема исправлена в Linux 2.6.0 и новее.

source: nfsservctl - syscall interface to kernel nfs daemon
ru: nfsservctl - интерфейс syscall к ядерной службе nfs

source: I<Note>: Since Linux 3.1, this system call no longer exists. It has been replaced by a set of files in the I<nfsd> filesystem; see B<nfsd>(7).
ru: I<Замечание>: Начиная с Linux 3.1, данный системный вызов больше не существует. Он был заменён набором файлов в файловой системе I<nfsd>; смотрите B<nfsd>(7).

source: /* * These are the commands understood by nfsctl(). */ #define NFSCTL_SVC 0 /* This is a server process. */ #define NFSCTL_ADDCLIENT 1 /* Add an NFS client. */ #define NFSCTL_DELCLIENT 2 /* Remove an NFS client. */ #define NFSCTL_EXPORT 3 /* Export a filesystem. */ #define NFSCTL_UNEXPORT 4 /* Unexport a filesystem. */ #define NFSCTL_UGIDUPDATE 5 /* Update a client's UID/GID map (only in Linux 2.4.x and earlier). */ #define NFSCTL_GETFH 6 /* Get a file handle (used by mountd) (only in Linux 2.4.x and earlier). */
ru: /* * Эти команды понимает nfsctl() */ #define NFSCTL_SVC 0 /* это серверный процесс */ #define NFSCTL_ADDCLIENT 1 /* добавить клиента NFS */ #define NFSCTL_DELCLIENT 2 /* удалить клиента NFS */ #define NFSCTL_EXPORT 3 /* экспортировать файловую систему */ #define NFSCTL_UNEXPORT 4 /* снять экспорт файловой системы */ #define NFSCTL_UGIDUPDATE 5 /* обновить карту клиентов UID/GID (только в Linux 2.4.x и старее) */ #define NFSCTL_GETFH 6 /* получить описатель файла (используется mountd) (только в Linux 2.4.x и старее). */

source: struct nfsctl_arg { int ca_version; /* safeguard */ union { struct nfsctl_svc u_svc; struct nfsctl_client u_client; struct nfsctl_export u_export; struct nfsctl_uidmap u_umap; struct nfsctl_fhparm u_getfh; unsigned int u_debug; } u; }
ru: struct nfsctl_arg { int ca_version; /* защитная мера */ union { struct nfsctl_svc u_svc; struct nfsctl_client u_client; struct nfsctl_export u_export; struct nfsctl_uidmap u_umap; struct nfsctl_fhparm u_getfh; unsigned int u_debug; } u; }

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: This system call was removed from the Linux kernel in version 3.1. Library support was removed from glibc in version 2.28.
ru: Данный системный вызов был удалён из ядра Linux в версии 3.1. Поддержка в библиотеке glibc была удалена в версии 2.28.

source: This call is Linux-specific.
ru: Данный вызов существует только в Linux.

source: nice - change process priority
ru: nice - изменяет приоритет процесса

source: B<nice>(): _XOPEN_SOURCE || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: B<nice>(): _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: B<nice>() adds I<inc> to the nice value for the calling thread. (A higher nice value means a low priority.)
ru: Вызов B<nice>() добавляет значение аргумента I<inc> к значению уступчивости (nice) вызвавшей нити (большее значение уступчивости означает меньший приоритет).

source: The range of the nice value is +19 (low priority) to -20 (high priority). Attempts to set a nice value outside the range are clamped to the range.
ru: Диапазон значений уступчивости: от +19 (низкий приоритет) до -20 (высокий приоритет). Попытки установить значение уступчивости вне этого диапазона срезаются до значения из этого диапазона.

source: Traditionally, only a privileged process could lower the nice value (i.e., set a higher priority). However, since Linux 2.6.12, an unprivileged process can decrease the nice value of a target process that has a suitable B<RLIMIT_NICE> soft limit; see B<getrlimit>(2) for details.
ru: Обычно, только привилегированный процесс может понижать значение уступчивости (т. е., повышать приоритет). Однако начиная с Linux 2.6.12 непривилегированный процесс может понизить значение уступчивости процесса назначения, у которого установлено подходящее мягкое ограничение B<RLIMIT_NICE>; подробности смотрите в B<getrlimit>(2).

source: On success, the new nice value is returned (but see NOTES below). On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается новое значение nice (но см. ЗАМЕЧАНИЯ далее). В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: A successful call can legitimately return -1. To detect an error, set I<errno> to 0 before the call, and check whether it is nonzero after B<nice>() returns -1.
ru: При успешном выполнении с полным основанием может вернуть -1. Для обнаружения ошибки перед вызовом присвойте I<errno> значение 0 и проверьте, что оно не равно нулю после возврата B<nice>() значения -1.

source: The calling process attempted to increase its priority by supplying a negative I<inc> but has insufficient privileges. Under Linux, the B<CAP_SYS_NICE> capability is required. (But see the discussion of the B<RLIMIT_NICE> resource limit in B<setrlimit>(2).)
ru: Вызывающий процесс пытается увеличить свой приоритет, указав отрицательное значение I<inc>, но не имеет для этого прав. В Linux для этого требуется мандат B<CAP_SYS_NICE> (но смотрите обсуждение ограничение ресурса B<RLIMIT_NICE> в B<setrlimit>(2)).

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. However, the raw system call and (g)libc (earlier than glibc 2.2.4) return value is nonstandard, see below.
ru: POSIX.1-2001, POSIX.1-2008, SVr, 43BSD. Однако системный вызов и функция (g)libc (до glibc 2.2.4) возвращали нестандартное значение, смотрите далее.

source: For further details on the nice value, see B<sched>(7).
ru: Дополнительную информацию о значении уступчивости смотрите в B<sched>(7).

source: I<Note>: the addition of the "autogroup" feature in Linux 2.6.38 means that the nice value no longer has its traditional effect in many circumstances. For details, see B<sched>(7).
ru: I<Замечание>: дополнительное свойство «autogroup» из Linux 2.6.38 означает, что значение уступчивости во многих случаях больше не работает как обычно. Подробней смотрите в B<sched>(7).

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: POSIX.1 specifies that B<nice>() should return the new nice value. However, the raw Linux system call returns 0 on success. Likewise, the B<nice>() wrapper function provided in glibc 2.2.3 and earlier returns 0 on success.
ru: В POSIX.1 указано, что B<nice>() должен возвращать новое значение уступчивости. Однако, системный вызов Linux при успешном выполнении возвращает 0. Таким же образом поступает обёрточная функция B<nice>() из glibc 2.2.3 и старее.

source: Since glibc 2.2.4, the B<nice>() wrapper function provided by glibc provides conformance to POSIX.1 by calling B<getpriority>(2) to obtain the new nice value, which is then returned to the caller.
ru: Начиная с glibc 2.2.4, обёрточная функция B<nice>() из glibc, поступает в соответствии с POSIX.1, вызывая B<getpriority>(2) для получения нового значения уступчивости, которое возвращается вызывающему.

source: nscd.conf - name service cache daemon configuration file
ru: nscd.conf - файл настройки службы кэширования имён

source: The file I</etc/nscd.conf> is read from B<nscd>(8) at startup. Each line specifies either an attribute and a value, or an attribute, service, and a value. Fields are separated either by SPACE or TAB characters. A \(aq#\(aq (number sign) indicates the beginning of a comment; following characters, up to the end of the line, are not interpreted by nscd.
ru: Файл I</etc/nscd.conf> читается службой B<nscd>(8) при запуске. Каждая строка задаёт либо атрибут и значение, либо атрибут, сервис и значение. Поля разделяются ПРОБЕЛАМИ или символами табуляции (TAB). Символом \(aq#\(aq (решётка) начинается строка комментария; всё, что располагается за этим символом, не обрабатывается nscd.

source: Valid services are I<passwd>, I<group>, I<hosts>, I<services>, or I<netgroup>.
ru: Названия служб: I<passwd>, I<group>, I<hosts>, I<services> или I<netgroup>.

source: B<logfile> I<debug-file-name>
ru: B<logfile> I<имя_файла_отладки>

source: Specifies name of the file to which debug info should be written.
ru: Задаёт имя файла, в который будет выдаваться информация об отладке.

source: B<debug-level> I<value>
ru: B<debug-level> I<значение>

source: Sets the desired debug level. The default is 0.
ru: Задаёт уровень отладки. По умолчанию 0.

source: B<threads> I<number>
ru: B<threads> I<число>

source: This is the number of threads that are started to wait for requests. At least five threads will always be created.
ru: Задаёт количество запускаемых нитей, ожидающих запросов. Всегда будет создано не менее пяти нитей.

source: B<max-threads> I<number>
ru: B<max-threads> I<число>

source: Specifies the maximum number of threads. The default is 32.
ru: Задаёт максимальное количество нитей. По умолчанию 32.

source: B<server-user> I<user>
ru: B<server-user> I<пользователь>

source: If this option is set, nscd will run as this user and not as root. If a separate cache for every user is used (-S parameter), this option is ignored.
ru: Если указан этот параметр, то nscd будет запущена с правами обычного пользователя, а не root. Если используется раздельное кэширование для каждого пользователя (параметр -S), то данный параметр игнорируется.

source: B<stat-user> I<user>
ru: B<stat-user> I<пользователь>

source: Specifies the user who is allowed to request statistics.
ru: Задаёт имя пользователя, которому разрешено запрашивать статистику.

source: B<reload-count> unlimited | I<number>
ru: B<reload-count> unlimited | I<число>

source: Limit on the number of times a cached entry gets reloaded without being used before it gets removed. The default is 5.
ru: Задаёт предельное количество раз, которое неиспользуемый кэшированный элемент будет перезагружаться перед тем как будет удалён. По умолчанию 5.

source: Enabling paranoia mode causes nscd to restart itself periodically. The default is no.
ru: Включает параноидальный режим, в котором nscd будет периодически самостоятельно перезапускаться. По умолчанию выключен.

source: B<restart-interval> I<time>
ru: B<restart-interval> I<время>

source: Sets the restart interval to I<time> seconds if periodic restart is enabled by enabling B<paranoia> mode. The default is 3600.
ru: Устанавливает интервал перезапуска равным I<времени> в секундах, если включён периодический перезапуск с помощью режима B<paranoia>. По умолчанию 3600.

source: B<enable-cache> I<service> I<E<lt>yes|noE<gt>>
ru: B<enable-cache> I<служба> I<E<lt>yes|noE<gt>>

source: Enables or disables the specified I<service> cache. The default is no.
ru: Включает или отключает кэширование указанной I<службы>. По умолчанию выключено.

source: B<positive-time-to-live> I<service> I<value>
ru: B<positive-time-to-live> I<служба> I<значение>

source: Sets the TTL (time-to-live) for positive entries (successful queries) in the specified cache for I<service>. I<Value> is in seconds. Larger values increase cache hit rates and reduce mean response times, but increase problems with cache coherence.
ru: Устанавливает время жизни (TTL \(em time-to-live) для положительных элементов (успешных запросов) в указанном кэше для I<службы>. I<Значение> указывается в секундах. Большие значения увеличивают частоту использования кэша и уменьшают время ответа, но при этом возникают проблемы с актуальностью содержимого кэша.

source: B<negative-time-to-live> I<service> I<value>
ru: B<negative-time-to-live> I<служба> I<значение>

source: Sets the TTL (time-to-live) for negative entries (unsuccessful queries) in the specified cache for I<service>. I<Value> is in seconds. Can result in significant performance improvements if there are several files owned by UIDs (user IDs) not in system databases (for example untarring the Linux kernel sources as root); should be kept small to reduce cache coherency problems.
ru: Устанавливает время жизни (TTL — time-to-live) для отрицательных элементов (безуспешных запросов) в указанном кэше для I<службы>. I<Значение> указывается в секундах. Может привести к значительному увеличению производительности, если существуют несколько файлов, идентификаторы владельцев которых (ID) не находятся в системной базе данных (например, выполнение распаковки tar исходного кода ядра Linux под пользователем root); значение должно быть небольшим чтобы не возникло проблем с актуальностью содержимого кэша.

source: B<suggested-size> I<service> I<value>
ru: B<suggested-size> I<служба> I<значение>

source: This is the internal hash table size, I<value> should remain a prime number for optimum efficiency. The default is 211.
ru: Размер внутренней хэш-таблицы кэша; I<значение> должно оставаться простым числом для оптимальной эффективности. По умолчанию 211.

source: B<check-files> I<service> I<E<lt>yes|noE<gt>>
ru: B<check-files> I<служба> I<E<lt>yes|noE<gt>>

source: Enables or disables checking the file belonging to the specified I<service> for changes. The files are I</etc/passwd>, I</etc/group>, I</etc/hosts>, I</etc/services> and I</etc/netgroup>. The default is yes.
ru: Включает или отключает проверку на принадлежность файла к указанной I<службе> для изменений. Файлами могут быть I</etc/passwd>, I</etc/group>, I</etc/hosts>, I</etc/services> и I</etc/netgroup>. По умолчанию включена.

source: B<persistent> I<service> I<E<lt>yes|noE<gt>>
ru: B<persistent> I<служба> I<E<lt>yes|noE<gt>>

source: Keep the content of the cache for I<service> over server restarts; useful when B<paranoia> mode is set. The default is no.
ru: Сохраняет содержимое кэша для I<службы> между перезапусками сервера; полезно при включённом режиме B<paranoia>. По умолчанию выключено.

source: B<shared> I<service> I<E<lt>yes|noE<gt>>
ru: B<shared> I<служба> I<E<lt>yes|noE<gt>>

source: The memory mapping of the nscd databases for I<service> is shared with the clients so that they can directly search in them instead of having to ask the daemon over the socket each time a lookup is performed. The default is no.
ru: Отражение в память баз данных nscd для I<службы> позволяет совместно использовать их из клиентов так, что они могут выполнять поиск самостоятельно, а не запрашивать службу через сокет каждый раз при выполнении просмотра. По умолчанию выключено.

source: B<max-db-size> I<service> I<bytes>
ru: B<max-db-size> I<служба> I<байты>

source: The maximum allowable size, in bytes, of the database files for the I<service>. The default is 33554432.
ru: Максимальный допустимый размер, в байтах, файлов баз данных I<службы>. По умолчанию 33554432.

source: B<auto-propagate> I<service> I<E<lt>yes|noE<gt>>
ru: B<auto-propagate> I<служба> I<E<lt>yes|noE<gt>>

source: When set to I<no> for I<passwd> or I<group> service, then the I<.byname> requests are not added to I<passwd.byuid> or I<group.bygid> cache. This can help with tables containing multiple records for the same ID. The default is yes. This option is valid only for services I<passwd> and I<group>.
ru: Если для службы I<passwd> или I<group> значение равно I<no>, то запросы I<.byname> не добавляются в кэш I<passwd.byuid> или I<group.bygid>. Это может помочь с таблицами, содержащими несколько записей с одинаковым ID. По умолчанию включено. Этот параметр допустим только для службы I<passwd> и I<group>.

source: The default values stated in this manual page originate from the source code of B<nscd>(8) and are used if not overridden in the configuration file. The default values used in the configuration file of your distribution might differ.
ru: Значения по умолчанию, указанные в этой справочной странице, взяты из исходного кода B<nscd>(8) и используются, если не были изменены через файл настройки. Значения по умолчанию, используемые в файле настройки, в разных дистрибутивах могут различаться.

source: Linux System Administration
ru: Системное администрирование Linux

source: networks - network name information
ru: networks - информация об имени сети

source: The file I</etc/networks> is a plain ASCII file that describes known DARPA networks and symbolic names for these networks. Each line represents a network and has the following structure:
ru: Файл I</etc/networks> представляет собой простой файл в формате ASCII и описывает известные сети DARPA и символические имена этих сетей. Каждая строка описывает одну сеть и имеет следующую структуру:

source: I<name number aliases ...>
ru: I<имя номер псевдонимы ...>

source: where the fields are delimited by spaces or tabs. Empty lines are ignored. The hash character (B<#>) indicates the start of a comment: this character, and the remaining characters up to the end of the current line, are ignored by library functions that process the file.
ru: Поля отделяются друг от друга пробелами или символами табуляции. Пустые строки игнорируются. Если строка содержит символ решётки (B<#>), то он сам и часть строки, которая следует за этим символом, игнорируется библиотечными функциями обработки данного файла.

source: The field descriptions are:
ru: Описание полей:

source: I<name>
ru: I<имя>

source: The symbolic name for the network. Network names can contain any printable characters except white-space characters or the comment character.
ru: Символическое имя сети. Имена сетей могут состоять из любых печатных символов за исключением пробельных или символа комментария.

source: I<number>
ru: I<номер>
