Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: null, zero - data sink
ru: null, zero - сток для данных

source: DESCRIPTION
ru: ОПИСАНИЕ

source: Data written to the I</dev/null> and I</dev/zero> special files is discarded.
ru: Любые данные, записанные в специальные файлы I</dev/null> или I</dev/zero>, отбрасываются.

source: Reads from I</dev/null> always return end of file (i.e., B<read>(2) returns 0), whereas reads from I</dev/zero> always return bytes containing zero (\(aq\e0\(aq characters).
ru: Считывание информации из специального файла I</dev/null> всегда возвращает конец файла (то есть B<read>(2) вернёт 0), а чтение из файла I</dev/zero> всегда возвращает байты, содержащие 0 (символы \(aq\e0\(aq).

source: These devices are typically created by:
ru: Эти устройства обычно создаются так:

source: FILES
ru: ФАЙЛЫ

source: NOTES
ru: ЗАМЕЧАНИЯ

source: If these devices are not writable and readable for all users, many programs will act strangely.
ru: Если эти файлы сделать недоступными для чтения и записи для всех пользователей, то многие программы станут работать непредсказуемо.

source: Since Linux 2.6.31, reads from I</dev/zero> are interruptible by signals. (This change was made to help with bad latencies for large reads from I</dev/zero>.)
ru: Начиная с Linux 2.6.31, чтение из I</dev/zero> может быть прервано сигналами (это изменение было сделано для того, чтобы помочь исправить большое время отклика при чтении больших объёмов из I</dev/zero>).

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: nscd - name service cache daemon
ru: nscd - программа кэширования службы имён

source: B<nscd> is a daemon that provides a cache for the most common name service requests. The default configuration file, I</etc/nscd.conf>, determines the behavior of the cache daemon. See B<nscd.conf>(5).
ru: B<nscd> — это служба, которая кэширует наиболее частые запросы службы имён. По умолчанию, поведение службы кэша определяет файл с настройками I</etc/nscd.conf>. Смотрите B<nscd.conf>(5).

source: B<nscd> provides caching for accesses of the B<passwd>(5), B<group>(5), B<hosts>(5) B<services>(5) and I<netgroup> databases through standard libc interfaces, such as B<getpwnam>(3), B<getpwuid>(3), B<getgrnam>(3), B<getgrgid>(3), B<gethostbyname>(3), and others.
ru: B<nscd> предоставляет кэшированный доступ к базам данных B<passwd>(5), B<group>(5), B<hosts>(5), B<services>(5) и I<netgroup> через стандартные интерфейсы libc, такие как B<getpwnam>(3), B<getpwuid>(3), B<getgrnam>(3), B<getgrgid>(3), B<gethostbyname>(3) и другие.

source: There are two caches for each database: a positive one for items found, and a negative one for items not found. Each cache has a separate TTL (time-to-live) period for its data. Note that the shadow file is specifically not cached. B<getspnam>(3) calls remain uncached as a result.
ru: Для каждой базы есть два кэша: попаданий (для найденных элементов) и промахов (для ненайденных элементов). Каждый кэш имеет для своих данных отдельное TTL (time-to-live — время жизни). Заметим, что файл теневых паролей (shadow) специально не кэшируется. Вызовы B<getspnam>(3) оставляют результат некэшированным.

source: OPTIONS
ru: ПАРАМЕТРЫ

source: will give you a list with all options and what they do.
ru: показать список всех параметров и для чего они предназначены.

source: The daemon will try to watch for changes in configuration files appropriate for each database (e.g., I</etc/passwd> for the I<passwd> database or I</etc/hosts> and I</etc/resolv.conf> for the I<hosts> database), and flush the cache when these are changed. However, this will happen only after a short delay (unless the B<inotify>(7) mechanism is available and glibc 2.9 or later is available), and this auto-detection does not cover configuration files required by nonstandard NSS modules, if any are specified in I</etc/nsswitch.conf>. In that case, you need to run the following command after changing the configuration file of the database so that B<nscd> invalidates its cache:
ru: Служба пытается отслеживать изменения в файлах настройки для каждой базы данных (например I</etc/passwd> для базы данных I<passwd> или I</etc/hosts> и I</etc/resolv.conf> базы данных I<hosts>), и очищает кэш при наличии изменений. Однако это происходит только после короткой задержки (если недоступен механизм B<inotify>(7) и glibc 2.9 или новее), и данное автоматическое слежение не распространяется на файлы настройки нестандартных модулей NSS, если они указаны в I</etc/nsswitch.conf>. В этом случае, вам нужно запустить следующую команду после изменения файла настройки базы данных для того, чтобы B<nscd> засчитал свой кэш недействительным:

source: $ B<nscd -i> I<E<lt>databaseE<gt>>
ru: $ B<nscd -i> I<E<lt>база данныхE<gt>>

source: nptl - Native POSIX Threads Library
ru: nptl - библиотека нитей POSIX

source: NPTL (Native POSIX Threads Library) is the GNU C library POSIX threads implementation that is used on modern Linux systems.
ru: NPTL (Native POSIX Threads Library — библиотека нитей POSIX) это библиотека GNU C, в которой реализованы нити POSIX, используется в современных версиях Linux.

source: NPTL and signals
ru: NPTL и сигналы

source: NPTL makes internal use of the first two real-time signals (signal numbers 32 and 33). One of these signals is used to support thread cancellation and POSIX timers (see B<timer_create>(2)); the other is used as part of a mechanism that ensures all threads in a process always have the same UIDs and GIDs, as required by POSIX. These signals cannot be used in applications.
ru: Внутри NPTL используются два первых сигнала реального времени (с номерами 32 и 33). Один из них служит для поддержки удаления (cancellation) нитей и таймеров POSIX (смотрите B<timer_create>(2)); второй используется как часть механизма обеспечения всех нитей в одном процессе единым UID и GID, как того требует POSIX. Данные сигналы нельзя использовать в приложениях.

source: To prevent accidental use of these signals in applications, which might interfere with the operation of the NPTL implementation, various glibc library functions and system call wrapper functions attempt to hide these signals from applications, as follows:
ru: Чтобы не допустить случайного использования этих сигналов в приложениях, что может помешать работе реализации NPTL, в различных функциях библиотеки glibc и обёрточных функциях системных вызовов добавлено сокрытие этих сигналов от приложений:

source: B<SIGRTMIN> is defined with the value 34 (rather than 32).
ru: Сигнал B<SIGRTMIN> определён со значением 34 (а не 32).

source: The B<sigwaitinfo>(2), B<sigtimedwait>(2), and B<sigwait>(3) interfaces silently ignore requests to wait for these two signals if they are specified in the signal set argument of these calls.
ru: Интерфейсы B<sigwaitinfo>(2), B<sigtimedwait>(2) и B<sigwait>(3) игнорируют запросы на ожидание этих сигналов, если но указаны в аргументе набора сигналов.

source: The B<sigprocmask>(2) and B<pthread_sigmask>(3) interfaces silently ignore attempts to block these two signals.
ru: Интерфейсы B<sigprocmask>(2) и B<pthread_sigmask>(3) игнорируют попытки блокировки этих сигналов.

source: The B<sigaction>(2), B<pthread_kill>(3), and B<pthread_sigqueue>(3) interfaces fail with the error B<EINVAL> (indicating an invalid signal number) if these signals are specified.
ru: Интерфейсы B<sigaction>(2), B<pthread_kill>(3) и B<pthread_sigqueue>(3) завершаются с ошибкой B<EINVAL> (указан некорректный номер сигнала), если заданы эти сигналы.

source: B<sigfillset>(3) does not include these two signals when it creates a full signal set.
ru: Функция B<sigfillset>(3) не включает эти сигналы при создании полного набора сигналов.

source: NPTL and process credential changes
ru: NPTL и изменение идентификаторов процесса

source: At the Linux kernel level, credentials (user and group IDs) are a per-thread attribute. However, POSIX requires that all of the POSIX threads in a process have the same credentials. To accommodate this requirement, the NPTL implementation wraps all of the system calls that change process credentials with functions that, in addition to invoking the underlying system call, arrange for all other threads in the process to also change their credentials.
ru: На уровне ядра Linux идентификаторы (пользовательский и групповой ID) являются атрибутов нити. Однако в POSIX требуется, чтобы все нити POSIX одного процесса имели одинаковые идентификаторы. Для удовлетворения этого требования в реализации NPTL для всех системных вызовов, изменяющих идентификаторы процесса, созданы обёрточные функции, которые при обращении к нижележащим вызовам, также изменяют идентификаторы и всем остальным нитям процесса.

source: The implementation of each of these system calls involves the use of a real-time signal that is sent (using B<tgkill>(2)) to each of the other threads that must change its credentials. Before sending these signals, the thread that is changing credentials saves the new credential(s) and records the system call being employed in a global buffer. A signal handler in the receiving thread(s) fetches this information and then uses the same system call to change its credentials.
ru: В реализации каждого из этих системных вызовов используется сигнал реального времени, который посылается (с помощью B<tgkill>(2)) всем остальным нитях, которым нужно изменить идентификаторы. Перед отправкой этих сигналов, нить, у которой изменяются идентификаторы, сохраняет новые идентификаторы и записывает использующийся системный вызов в глобальный буфер. Обработчик сигнала в принимающей нити извлекает эту информацию и использует тот же системный вызов для изменения своих идентификаторов.

source: Wrapper functions employing this technique are provided for B<setgid>(2), B<setuid>(2), B<setegid>(2), B<seteuid>(2), B<setregid>(2), B<setreuid>(2), B<setresgid>(2), B<setresuid>(2), and B<setgroups>(2).
ru: Обёрточные функции, использующие такую же технику: B<setgid>(2), B<setuid>(2), B<setegid>(2), B<seteuid>(2), B<setregid>(2), B<setreuid>(2), B<setresgid>(2), B<setresuid>(2) и B<setgroups>(2).

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: For details of the conformance of NPTL to the POSIX standard, see B<pthreads>(7).
ru: Дополнительную информацию о соответствии NPTL стандарту POSIX находится в B<pthreads>(7).

source: POSIX says that any thread in any process with access to the memory containing a process-shared (B<PTHREAD_PROCESS_SHARED>) mutex can operate on that mutex. However, on 64-bit x86 systems, the mutex definition for x86-64 is incompatible with the mutex definition for i386, meaning that 32-bit and 64-bit binaries can't share mutexes on x86-64 systems.
ru: В POSIX сказано, что всем нитям процесса с доступом к памяти, содержащей общие для процесса (B<PTHREAD_PROCESS_SHARED>) мьютексы, доступны эти мьютексы. Однако в 64-битных системах с архитектурой x86 определение мьютекса для x86-64 несовместимо с определением для i386, что означает, что исполняемые 32-битные и 64-битные файлы не могут иметь общих мьютексов в системах x86-64.

source: netlink - communication between kernel and user space (AF_NETLINK)
ru: netlink - обмен информацией между ядром и пользовательским пространством (AF_NETLINK)

source: SYNOPSIS
ru: ОБЗОР

source: Netlink is used to transfer information between the kernel and user-space processes. It consists of a standard sockets-based interface for user space processes and an internal kernel API for kernel modules. The internal kernel interface is not documented in this manual page. There is also an obsolete netlink interface via netlink character devices; this interface is not documented here and is provided only for backward compatibility.
ru: Протокол netlink используется для передачи информации между ядром и процессами в пользовательском пространстве. Он состоит из стандартного, основанного на сокетах, интерфейса для процессов пользователя и внутреннего API ядра, предназначенного для модулей ядра. Внутренний интерфейс ядра в этой странице не описан. Кроме того, существует устаревший интерфейс netlink, работающий через символьные устройства netlink. Этот интерфейс здесь также не описан; он предназначен только для обратной совместимости.

source: Netlink is a datagram-oriented service. Both B<SOCK_RAW> and B<SOCK_DGRAM> are valid values for I<socket_type>. However, the netlink protocol does not distinguish between datagram and raw sockets.
ru: Netlink обеспечивает для приложений сервис передачи датаграмм. В качестве I<socket_type> могут использоваться типы сокетов как B<SOCK_RAW>, так и B<SOCK_DGRAM>. Несмотря на это, протокол netlink не различает датаграмные и неструктурированные (raw) сокеты.

source: I<netlink_family> selects the kernel module or netlink group to communicate with. The currently assigned netlink families are:
ru: По значению I<netlink_family> выбирается модуль ядра или группа netlink для связи. В данный момент определены следующие семейства netlink:

source: Receives routing and link updates and may be used to modify the routing tables (both IPv4 and IPv6), IP addresses, link parameters, neighbor setups, queueing disciplines, traffic classes and packet classifiers (see B<rtnetlink>(7)).
ru: Получает обновления маршрутов и состояние подключений (link); может использоваться для изменения таблицы маршрутизации (IPv4 и IPv6), IP-адресов, параметров подключения, настроек взаимодействия с ответной стороной (neighbor), параметров работы очереди, классов трафика и классификаторов пакетов (см.B< rtnetlink>(7)).

source: B<NETLINK_W1> (Linux 2.6.13 to 2.16.17)
ru: B<NETLINK_W1> (начиная с Linux 2.6.13 до 2.16.17)

source: Messages from 1-wire subsystem.
ru: Сообщения из однопроводной подсистемы.

source: Reserved for user-mode socket protocols.
ru: Зарезервировано для будущих протоколов сокетов пространства пользователя.

source: B<NETLINK_FIREWALL> (up to and including Linux 3.4)
ru: B<NETLINK_FIREWALL> (существует до Linux 3.4 включительно)

source: Transport IPv4 packets from netfilter to user space. Used by I<ip_queue> kernel module. After a long period of being declared obsolete (in favor of the more advanced I<nfnetlink_queue> feature), B<NETLINK_FIREWALL> was removed in Linux 3.5.
ru: Переправляет пакеты IPv4 из netfilter в пространство пользователя. Используется модулем ядра I<ip_queue>. После долгого времени объявления устаревшим (предлагается использовать улучшенное свойство I<nfnetlink_queue>), B<NETLINK_FIREWALL> был удалён к Linux 3.5.

source: B<NETLINK_INET_DIAG> (since Linux 2.6.14)
ru: B<NETLINK_INET_DIAG> (начиная с Linux 2.6.14)

source: Query information about sockets of various protocol families from the kernel (see B<sock_diag>(7)).
ru: Запрашивает информации о сокетах различных семейств протоколов из ядра (смотрите B<sock_diag>(7)).

source: B<NETLINK_SOCK_DIAG> (since Linux 3.3)
ru: B<NETLINK_SOCK_DIAG> (начиная с Linux 3.3)

source: A synonym for B<NETLINK_INET_DIAG>.
ru: Синоним для B<NETLINK_INET_DIAG>.

source: B<NETLINK_NFLOG> (up to and including Linux 3.16)
ru: B<NETLINK_NFLOG> (существует до Linux 3.16 включительно)

source: B<NETLINK_SELINUX> (since Linux 2.6.4)
ru: B<NETLINK_SELINUX> (начиная с Linux 2.6.4)

source: SELinux event notifications.
ru: Уведомляет о событиях SELinux.

source: B<NETLINK_ISCSI> (since Linux 2.6.15)
ru: B<NETLINK_ISCSI> (начиная с Linux 2.6.15)

source: B<NETLINK_AUDIT> (since Linux 2.6.6)
ru: B<NETLINK_AUDIT> (начиная с Linux 2.6.6)

source: Auditing.
ru: Ведёт контроль за системой.

source: B<NETLINK_FIB_LOOKUP> (since Linux 2.6.13)
ru: B<NETLINK_FIB_LOOKUP> (начиная с Linux 2.6.13)

source: Access to FIB lookup from user space.
ru: Доступ к таблице FIB из пользовательского пространства.

source: B<NETLINK_CONNECTOR> (since Linux 2.6.14)
ru: B<NETLINK_CONNECTOR> (начиная с Linux 2.6.14)

source: Kernel connector. See I<Documentation/connector/*> in the Linux kernel source tree for further information.
ru: Точка связи с ядром. Дополнительную информацию смотрите в файле I<Documentation/connector/*> дерева исходного кода ядра Linux.

source: B<NETLINK_NETFILTER> (since Linux 2.6.14)
ru: B<NETLINK_NETFILTER> (начиная с Linux 2.6.14)

source: Netfilter subsystem.
ru: Подсистема netfilter.

source: B<NETLINK_SCSITRANSPORT> (since Linux 2.6.19)
ru: B<NETLINK_SCSITRANSPORT> (начиная с Linux 2.6.19)

source: SCSI Transports.
ru: Транспорты SCSI.

source: B<NETLINK_RDMA> (since Linux 3.0)
ru: B<NETLINK_RDMA> (начиная с Linux 3.0)

source: B<NETLINK_IP6_FW> (up to and including Linux 3.4)
ru: B<NETLINK_IP6_FW> (существует до Linux 3.4 включительно)

source: Transport IPv6 packets from netfilter to user space. Used by I<ip6_queue> kernel module.
ru: Переправляет пакеты IPv6 из netfilter в пространство пользователя. Используется модулем ядра I<ip6_queue>.

source: DECnet routing messages.
ru: Сообщения маршрутизации DECnet.

source: B<NETLINK_KOBJECT_UEVENT> (since Linux 2.6.10)
ru: B<NETLINK_KOBJECT_UEVENT> (начиная с Linux 2.6.10)

source: Kernel messages to user space.
ru: Сообщения ядра в пользовательском пространстве.

source: B<NETLINK_GENERIC> (since Linux 2.6.15)
ru: B<NETLINK_GENERIC> (начиная с Linux 2.6.15)

source: Generic netlink family for simplified netlink usage.
ru: Обобщённое семейство netlink для использования netlink.

source: B<NETLINK_CRYPTO> (since Linux 3.2)
ru: B<NETLINK_CRYPTO> (начиная с Linux 3.2)

source: Netlink interface to request information about ciphers registered with the kernel crypto API as well as allow configuration of the kernel crypto API.
ru: Интерфейс netlink для запроса информации о зарегистрированных алгоритмах шифрования с помощью программного интерфейса ядра шифрования, а также настройки программного интерфейса ядра шифрования.

source: Netlink messages consist of a byte stream with one or multiple I<nlmsghdr> headers and associated payload. The byte stream should be accessed only with the standard B<NLMSG_*> macros. See B<netlink>(3) for further information.
ru: Сообщения netlink состоят из потока байтов с одним или несколькими заголовками I<nlmsghdr> и присоединённой полезной нагрузкой. Доступ к потоку байтов нужно осуществлять только с помощью стандартных макросов B<NLMSG_*>. Подробности смотрите в B<netlink>(3).

source: In multipart messages (multiple I<nlmsghdr> headers with associated payload in one byte stream) the first and all following headers have the B<NLM_F_MULTI> flag set, except for the last header which has the type B<NLMSG_DONE>.
ru: В первом и всех последующих заголовках сообщений, состоящих из нескольких частей (несколько заголовков I<nlmsghdr> с полезной нагрузкой в одном потоке байт), установлен флаг B<NLM_F_MULTI>. Последний заголовок имеет тип B<NLMSG_DONE> и этот флаг не устанавливается.

source: After each I<nlmsghdr> the payload follows.
ru: После каждого I<nlmsghdr> следует полезная нагрузка:

source: struct nlmsghdr { __u32 nlmsg_len; /* Length of message including header */ __u16 nlmsg_type; /* Type of message content */ __u16 nlmsg_flags; /* Additional flags */ __u32 nlmsg_seq; /* Sequence number */ __u32 nlmsg_pid; /* Sender port ID */ };
ru: struct nlmsghdr { __u32 nlmsg_len; /* длина сообщения, включая заголовок */ __u16 nlmsg_type; /* тип содержимого сообщения */ __u16 nlmsg_flags; /* дополнительные флаги */ __u32 nlmsg_seq; /* номер в последовательности */ __u32 nlmsg_pid; /* ID порта отправителя */ };

source: I<nlmsg_type> can be one of the standard message types: B<NLMSG_NOOP> message is to be ignored, B<NLMSG_ERROR> message signals an error and the payload contains an I<nlmsgerr> structure, B<NLMSG_DONE> message terminates a multipart message.
ru: Значение I<nlmsg_type> может быть одним из стандартных типов сообщения: сообщения B<NLMSG_NOOP> должны игнорироваться, сообщение B<NLMSG_ERROR> сообщает об ошибке и в нагрузке содержится структура I<nlmsgerr>, сообщение B<NLMSG_DONE> заканчивает сообщение, состоящее из нескольких частей.

source: struct nlmsgerr { int error; /* Negative errno or 0 for acknowledgements */ struct nlmsghdr msg; /* Message header that caused the error */ };
ru: struct nlmsgerr { int error; /* отрицательный errno или 0 для подтверждений */ struct nlmsghdr msg; /* заголовок сообщения, вызвавшего ошибку */ };

source: A netlink family usually specifies more message types, see the appropriate manual pages for that, for example, B<rtnetlink>(7) for B<NETLINK_ROUTE>.
ru: Семейство netlink обычно определяет и другие типы сообщений (см. соответствующие справочные страницы, например, B<rtnetlink>(7) о B<NETLINK_ROUTE>).

source: Standard flag bits in I<nlmsg_flags>
ru: Стандартные биты флагов в I<nlmsg_flags>

source: Must be set on all request messages.
ru: Должен быть установлен у всех сообщений с запросами.

source: The message is part of a multipart message terminated by B<NLMSG_DONE>.
ru: Сообщение является одной из частей длинного сообщения, которое заканчивается B<NLMSG_DONE>.

source: Request for an acknowledgment on success.
ru: Запрашивать подтверждение при успешном выполнении.

source: Echo this request.
ru: Послать эхо этого запроса.

source: Additional flag bits for GET requests
ru: Дополнительные биты флагов для запросов GET

source: Return the complete table instead of a single entry.
ru: Вернуть полную таблицу вместо одной записи.

source: Return all entries matching criteria passed in message content. Not implemented yet.
ru: Вернуть все записи, подходящие под критерий, переданный в содержимом сообщения. Пока не реализовано.

source: Return an atomic snapshot of the table.
ru: Вернуть атомарный образ (snapshot) таблицы.

source: Convenience macro; equivalent to
ru: Макрос для удобства; эквивалентен

source: Note that B<NLM_F_ATOMIC> requires the B<CAP_NET_ADMIN> capability or an effective UID of 0.
ru: Заметим, что B<NLM_F_ATOMIC> требует мандата B<CAP_NET_ADMIN> или эффективного UID 0.

source: Additional flag bits for NEW requests
ru: Дополнительные биты флагов для запросов NEW

source: Replace existing matching object.
ru: Переписать существующий подходящий объект.

source: Don't replace if the object already exists.
ru: Не перезаписывать, если объект уже существует.

source: Create object if it doesn't already exist.
ru: Создать объект, если он ещё не существует.

source: Add to the end of the object list.
ru: Добавить в конец списка объектов.

source: I<nlmsg_seq> and I<nlmsg_pid> are used to track messages. I<nlmsg_pid> shows the origin of the message. Note that there isn't a 1:1 relationship between I<nlmsg_pid> and the PID of the process if the message originated from a netlink socket. See the B<ADDRESS FORMATS> section for further information.
ru: Поля I<nlmsg_seq> и I<nlmsg_pid> используются для отслеживания передачи сообщений. В I<nlmsg_pid> указывается источник сообщения. Заметим, что нет связи 1:1 между I<nlmsg_pid> и PID процесса, если сообщение возникло из сокета netlink. Дополнительную информацию ищите в разделе B<ФОРМАТЫ АДРЕСА>.

source: Both I<nlmsg_seq> and I<nlmsg_pid> are opaque to netlink core.
ru: Тип поля I<nlmsg_seq> и I<nlmsg_pid> скрыт в ядре netlink.
