Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: If I<x> equals I<y>, the functions return I<y>.
ru: Если I<x> = I<y>, то функции возвращают I<y>.

source: The B<nexttoward>(), B<nexttowardf>(), and B<nexttowardl>() functions do the same as the corresponding B<nextafter>() functions, except that they have a I<long double> second argument.
ru: Функции B<nexttoward>(), B<nexttowardf>() и B<nexttowardl>() делают то же, что и функции B<nextafter>(), за исключением того, что у них второй аргумент имеет тип I<long double>.

source: On success, these functions return the next representable floating-point value after I<x> in the direction of I<y>.
ru: При успешном выполнении данные функции возвращают представимое значение с плавающей запятой следующее за I<x> по направлению к I<y>.

source: If I<x> equals I<y>, then I<y> (cast to the same type as I<x>) is returned.
ru: Если I<x> = I<y>, то возвращается значение I<y> (приведённое к типу I<x>).

source: If I<x> or I<y> is a NaN, a NaN is returned.
ru: Если значение I<x> или I<y> равно NaN, то возвращается NaN.

source: If I<x> is finite, and the result would overflow, a range error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively, with the correct mathematical sign.
ru: Если I<x> имеет конечное значение и происходит переполнение результата, возникает ошибка диапазона, то функции возвращают B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, соответственно, с математически правильным знаком.

source: If I<x> is not equal to I<y>, and the correct function result would be subnormal, zero, or underflow, a range error occurs, and either the correct value (if it can be represented), or 0.0, is returned.
ru: Если I<x> не равно I<y>, и правильный результат функции был бы субнормальным, нулём или возникала бы исчерпание степени, ошибка диапазона, то возвращается любое правильное значение (если оно представимо) или 0,0.

source: See B<math_error>(7) for information on how to determine whether an error has occurred when calling these functions.
ru: Смотрите B<math_error>(7), чтобы определить, какие ошибки могут возникать при вызове этих функций.

source: The following errors can occur:
ru: Могут возникать следующие ошибки:

source: Range error: result overflow
ru: Ошибка диапазона: результат превысил разрядность

source: An overflow floating-point exception (B<FE_OVERFLOW>) is raised.
ru: Вызывается исключение переполнения плавающей запятой (B<FE_OVERFLOW>).

source: Range error: result is subnormal or underflows
ru: Ошибка диапазона: результат субнормальный или исчерпание степени

source: An underflow floating-point exception (B<FE_UNDERFLOW>) is raised.
ru: Возникает исключение исчерпание степени плавающей запятой (B<FE_UNDERFLOW>).

source: These functions do not set I<errno>.
ru: Эти функции не изменяют I<errno>.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: C99, POSIX.1-2001, POSIX.1-2008. This function is defined in IEC 559 (and the appendix with recommended functions in IEEE 754/IEEE 854).
ru: C99, POSIX.1-2001, POSIX.1-2008. Эта функция определена в IEC 559 (и в приложении с рекомендуемыми функциями IEEE 754/IEEE 854).

source: In glibc version 2.5 and earlier, these functions do not raise an underflow floating-point (B<FE_UNDERFLOW>) exception when an underflow occurs.
ru: В glibc 2.5 и младше данные функции не вызывают исключение исчерпания степени плавающей запятой (B<FE_UNDERFLOW>) при возникновении ошибки исчерпания степени.

source: ntp_gettime, ntp_gettimex - get time parameters (NTP daemon interface)
ru: ntp_gettime, ntp_gettimex - возвращает параметры времени (интерфейс службы NTP)

source: Both of these APIs return information to the caller via the I<ntv> argument, a structure of the following type:
ru: Эти функции возвращают информацию вызывающему через аргумент I<ntv>, структуру следующего вида:

source: struct ntptimeval { struct timeval time; /* Current time */ long int maxerror; /* Maximum error */ long int esterror; /* Estimated error */ long int tai; /* TAI offset */
ru: struct ntptimeval { struct timeval time; /* текущее время */ long int maxerror; /* максимальная ошибка */ long int esterror; /* расчётная ошибка */ long int tai; /* смещение TAI */

source: /* Further padding bytes allowing for future expansion */ };
ru: /* байты-заполнители под будущее расширение */ };

source: The fields of this structure are as follows:
ru: Поля этой структуры имеют следующее назначение:

source: The current time, expressed as a I<timeval> structure:
ru: Текущее время, представляется структурой I<timeval>:

source: struct timeval { time_t tv_sec; /* Seconds since the Epoch */ suseconds_t tv_usec; /* Microseconds */ };
ru: struct timeval { time_t tv_sec; /* кол-во секунд, начиная с Эпохи */ suseconds_t tv_usec; /* кол-во микросекунд */ };

source: Maximum error, in microseconds. This value can be initialized by B<ntp_adjtime>(3), and is increased periodically (on Linux: each second), but is clamped to an upper limit (the kernel constant B<NTP_PHASE_MAX>, with a value of 16,000).
ru: Максимальная ошибка, в микросекундах. Это значение может быть инициализировано B<ntp_adjtime>(3), и периодически увеличивается (в Linux каждую секунду), но не переходит верхний порог (константа ядра B<NTP_PHASE_MAX>, равная 16000).

source: Estimated error, in microseconds. This value can be set via B<ntp_adjtime>(3) to contain an estimate of the difference between the system clock and the true time. This value is not used inside the kernel.
ru: Расчётная ошибка, в микросекундах. Это значение может быть установлено с помощью B<ntp_adjtime>(3) и содержит расчётную разницу между системными часами и настоящим временем. Данное значение не используется внутри ядра.

source: TAI (Atomic International Time) offset.
ru: Смещение TAI (Atomic International Time, атомное международное время).

source: B<ntp_gettime>() returns an I<ntptimeval> structure in which the I<time>, I<maxerror>, and I<esterror> fields are filled in.
ru: Функция B<ntp_gettime>() возвращает структуру I<ntptimeval> с заполненными полями I<time>, I<maxerror> и I<esterror>.

source: B<ntp_gettimex>() performs the same task as B<ntp_gettime>(), but also returns information in the I<tai> field.
ru: Функция B<ntp_gettimex>() выполняет тоже что и B<ntp_gettime>() и дополнительно возвращает информацию в поле I<tai>.

source: The return values for B<ntp_gettime>() and B<ntp_gettimex>() are as for B<adjtimex>(2). Given a correct pointer argument, these functions always succeed.
ru: Возвращаемые значения B<ntp_gettime>() и B<ntp_gettimex>() такие же как у B<adjtimex>(2). При корректным переданном указателе эти функции всегда выполняются без ошибок.

source: The B<ntp_gettime>() function is available since glibc 2.1. The B<ntp_gettimex>() function is available since glibc 2.12.
ru: Функция B<ntp_gettime>() доступна в glibc с версии 2.1. Функция B<ntp_gettimex>() доступна в glibc с версии 2.12.

source: B<ntp_gettime>() is described in the NTP Kernel Application Program Interface. B<ntp_gettimex>() is a GNU extension.
ru: Функция B<ntp_gettime>() описана в интерфейсе NTP Kernel Application Program. Функция B<ntp_gettimex>() является расширением GNU.

source: newlocale, freelocale - create, modify, and free a locale object
ru: newlocale, freelocale - создаёт, изменяет и освобождает объект локали

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: The B<newlocale>() function creates a new locale object, or modifies an existing object, returning a reference to the new or modified object as the function result. Whether the call creates a new object or modifies an existing object is determined by the value of I<base>:
ru: Функция B<newlocale>() создаёт новый объект локали или изменяет существующий, возвращая ссылку на новый или изменённый объект. Значение I<base> определяет что именно делает вызов — создаёт или изменяет существующий объект:

source: If I<base> is I<(locale_t)\ 0>, a new object is created.
ru: Если I<base> равно I<(locale_t)\ 0>, то создаётся новый объект.

source: If I<base> refers to valid existing locale object (i.e., an object returned by a previous call to B<newlocale>() or B<duplocale>(3)), then that object is modified by the call. If the call is successful, the contents of I<base> are unspecified (in particular, the object referred to by I<base> may be freed, and a new object created). Therefore, the caller should ensure that it stops using I<base> before the call to B<newlocale>(), and should subsequently refer to the modified object via the reference returned as the function result. If the call fails, the contents of I<base> remain valid and unchanged.
ru: Если I<base> ссылается на корректный существующий объект локали (т. е., объект, полученный ранее от вызовов B<newlocale>() или B<duplocale>(3)), то этот объект изменяется при вызове. При успешном выполнении содержимое I<base> не определено (в частности, объект, на который ссылается I<base>, может быть освобождён и создан новый объект). Поэтому вызывающий должен понимать до вызова B<newlocale>(), что не использует I<base>, и, следовательно, ссылаться на изменённый объект через ссылку, возвращённую функцией. При ошибке вызова, содержимое I<base> остаётся корректным и не изменяется.

source: If I<base> is the special locale object B<LC_GLOBAL_LOCALE> (see B<duplocale>(3)), or is not I<(locale_t)\ 0> and is not a valid locale object handle, the behavior is undefined.
ru: Если значение I<base> равно специальному объекту локали B<LC_GLOBAL_LOCALE> (смотрите B<duplocale>(3)) или не равно I<(locale_t)\ 0> и это некорректный указатель объекта локали, то поведение не определено.

source: The I<category_mask> argument is a bit mask that specifies the locale categories that are to be set in a newly created locale object or modified in an existing object. The mask is constructed by a bitwise OR of the constants B<LC_ADDRESS_MASK>, B<LC_CTYPE_MASK>, B<LC_COLLATE_MASK>, B<LC_IDENTIFICATION_MASK>, B<LC_MEASUREMENT_MASK>, B<LC_MESSAGES_MASK>, B<LC_MONETARY_MASK>, B<LC_NUMERIC_MASK>, B<LC_NAME_MASK>, B<LC_PAPER_MASK>, B<LC_TELEPHONE_MASK>, and B<LC_TIME_MASK>. Alternatively, the mask can be specified as B<LC_ALL_MASK>, which is equivalent to ORing all of the preceding constants.
ru: Аргумент I<category_mask> представляет собой битовую маску, которая определяет категории локали, устанавливаемые в создаваемом объекте локали или в изменяемом существующем объекте. Маска создаёт побитовым OR из констант B<LC_ADDRESS_MASK>, B<LC_CTYPE_MASK>, B<LC_COLLATE_MASK>, B<LC_IDENTIFICATION_MASK>, B<LC_MEASUREMENT_MASK>, B<LC_MESSAGES_MASK>, B<LC_MONETARY_MASK>, B<LC_NUMERIC_MASK>, B<LC_NAME_MASK>, B<LC_PAPER_MASK>, B<LC_TELEPHONE_MASK> и B<LC_TIME_MASK>. Также значением маски может быть B<LC_ALL_MASK>, которая эквивалентна сложению всех указанных ранее констант.

source: For each category specified in I<category_mask>, the locale data from I<locale> will be used in the object returned by B<newlocale>(). If a new locale object is being created, data for all categories not specified in I<category_mask> is taken from the default ("POSIX") locale.
ru: Для каждой категории, указанной в I<category_mask>, данные локали из I<locale> будут использованы в объекте, возвращаемом B<newlocale>(). Если создаётся новый объект локали, то данные для всех категорий, не указанных в I<category_mask>, берутся из локали по умолчанию («POSIX»).

source: The following preset values of I<locale> are defined for all categories that can be specified in I<category_mask>:
ru: Для всех категорий, которые можно указать в I<category_mask>, уже определены следующие значения I<locale>:

source: A minimal locale environment for C language programs.
ru: Минимальное окружение локали для программ на языке Си.

source: Equivalent to "POSIX".
ru: Эквивалентно «POSIX».

source: An implementation-defined native environment corresponding to the values of the B<LC_*> and B<LANG> environment variables (see B<locale>(7)).
ru: Определяемое реализацией родное окружение соответствует значениям переменных окружения B<LC_*> и B<LANG> (смотрите B<locale>(7)).

source: The B<freelocale>() function deallocates the resources associated with I<locobj>, a locale object previously returned by a call to B<newlocale>() or B<duplocale>(3). If I<locobj> is B<LC_GLOBAL_LOCALE> or is not valid locale object handle, the results are undefined.
ru: Функция B<freelocale>() освобождает ресурсы, связанные с I<locobj>, объектом локали, ранее полученным из вызова B<newlocale>() или B<duplocale>(3). Если значение I<locobj> равно B<LC_GLOBAL_LOCALE> или не является корректным объектом локали, то результат не определён.

source: Once a locale object has been freed, the program should make no further use of it.
ru: После того, как объект локали освобождён, программа не должна больше его использовать.

source: On success, B<newlocale>() returns a handle that can be used in calls to B<duplocale>(3), B<freelocale>(), and other functions that take a I<locale_t> argument. On error, B<newlocale>() returns I<(locale_t)\ 0>, and sets I<errno> to indicate the cause of the error.
ru: При успешном выполнении B<newlocale>() возвращает описатель, который можно использовать в вызовах B<duplocale>(3), B<freelocale>() и других функциях, принимающих аргумент I<locale_t>. При ошибке B<newlocale>() возвращает I<(locale_t)\ 0> и присваивает I<errno> код ошибки.

source: One or more bits in I<category_mask> do not correspond to a valid locale category.
ru: Один или более бит в I<category_mask> не соответствуют корректной категории локали.

source: I<locale> is NULL.
ru: Значение I<locale> равно NULL.

source: I<locale> is not a string pointer referring to a valid locale.
ru: Значение I<locale> не является указателем на строку, ссылающуюся на корректную локаль.

source: Insufficient memory to create a locale object.
ru: Недостаточно памяти для создания объекта локали.

source: The B<newlocale>() and B<freelocale>() functions first appeared in version 2.3 of the GNU C library.
ru: Функции B<newlocale>() и B<freelocale>() впервые появились в версии 2.3 библиотеки GNU C.

source: Each locale object created by B<newlocale>() should be deallocated using B<freelocale>().
ru: Каждый объект локали, созданный B<newlocale>(), должен освобождаться с помощью B<freelocale>().

source: The program below takes up to two command-line arguments, which each identify locales. The first argument is required, and is used to set the B<LC_NUMERIC> category in a locale object created using B<newlocale>(). The second command-line argument is optional; if it is present, it is used to set the B<LC_TIME> category of the locale object.
ru: Следующая программа принимает два аргумента командной строки, каждый из которых описывает локаль. Первый аргумент обязателен и используется для назначения категории B<LC_NUMERIC> в объекте локали, создаваемой B<newlocale>(). Второй аргумент необязателен; если он задан, то используется для назначения категории B<LC_TIME> объекта локали.

source: Having created and initialized the locale object, the program then applies it using B<uselocale>(3), and then tests the effect of the locale changes by:
ru: После создания и инициализации объекта, программа применяет его с помощью B<uselocale>(3), а затем тестирует изменения локали:

source: Displaying a floating-point number with a fractional part. This output will be affected by the B<LC_NUMERIC> setting. In many European-language locales, the fractional part of the number is separated from the integer part using a comma, rather than a period.
ru: Выводит число с плавающей запятой с дробной частью. На результат будет влиять значение B<LC_NUMERIC>. Во многих локалях европейских языков дробная часть числа отделяется от целой запятой, а не точкой.

source: Displaying the date. The format and language of the output will be affected by the B<LC_TIME> setting.
ru: Выводит дату. На формат и язык влияет значение B<LC_TIME>.

source: The following shell sessions show some example runs of this program.
ru: В следующих сеансах работы показан пример запуска программы.

source: Set the B<LC_NUMERIC> category to I<fr_FR> (French):
ru: Категории B<LC_NUMERIC> присвоено I<fr_FR> (французская):

source: Set the B<LC_NUMERIC> category to I<fr_FR> (French), and the B<LC_TIME> category to I<it_IT> (Italian):
ru: Категории B<LC_NUMERIC> присвоено I<fr_FR> (французская), а категории B<LC_TIME> — I<it_IT> (итальянская):

source: Specify the B<LC_TIME> setting as an empty string, which causes the value to be taken from environment variable settings (which, here, specify I<mi_NZ>, New Zealand Māori):
ru: Значению B<LC_TIME> присвоена пустая строка, что приводит к получению настройки из переменных окружения (которые, в данном случае, равны I<mi_NZ>, новозеландская маори):

source: Program source
ru: Исходный код программы

source: if (argc E<lt> 2) { fprintf(stderr, "Usage: %s locale1 [locale2]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 2) { fprintf(stderr, "Использование: %s лок1 [лок2]\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Create a new locale object, taking the LC_NUMERIC settings from the locale specified in argv[1] */
ru: /* создание нового объекта локали, получение LC_NUMERIC из локали, указанной в argv[1] */

source: /* If a second command-line argument was specified, modify the locale object to take the LC_TIME settings from the locale specified in argv[2]. We assign the result of this newlocale() call to 'nloc' rather than 'loc', since in some cases, we might want to preserve 'loc' if this call fails. */
ru: /* Если в командной строке указан второй аргумент, то в объекте локали изменяется настройка LC_TIME, которая берётся из локали, указанной в argv[2]. Мы назначаем результат вызова newlocale() «nloc», а не «loc», так как в некоторых случаях может потребоваться сохранить «loc», если этот вызов завершится с ошибкой. */

source: /* Apply the newly created locale to this thread */
ru: /* Применение созданной локали к этой нити */

source: /* Test effect of LC_NUMERIC */
ru: /* Тест влияния LC_NUMERIC */

source: /* Test effect of LC_TIME */
ru: /* Тест влияния LC_TIME */

source: /* Free the locale object */
ru: /* Освобождение объекта локали */

source: netlink - Netlink macros
ru: netlink - макросы netlink

source: I<E<lt>linux/netlink.hE<gt>> defines several standard macros to access or create a netlink datagram. They are similar in spirit to the macros defined in B<cmsg>(3) for auxiliary data. The buffer passed to and from a netlink socket should be accessed using only these macros.
ru: В I<E<lt>linux/netlink.hE<gt>> описаны различные стандартные макросы для доступа или создания дейтаграмм netlink. По сути, они подобны макросам, определённым в B<cmsg>(3) для обычных данных. Работа с буфером, передаваемом или получаемом из сокета netlink, должна выполняться только с помощью этих макросов.

source: Round the length of a netlink message up to align it properly.
ru: Выравнивает длину сообщения netlink до корректного значения.

source: Given the payload length, I<len>, this macro returns the aligned length to store in the I<nlmsg_len> field of the I<nlmsghdr>.
ru: Рассматривает длину полезной нагрузки I<len> как аргумент и возвращает выравненную длину в поле I<nlmsg_len> структуры I<nlmsghdr>.

source: Return the number of bytes that a netlink message with payload of I<len> would occupy.
ru: Возвращает количество байтов сообщения netlink с полезной нагрузкой длинной I<len>.

source: Return a pointer to the payload associated with the passed I<nlmsghdr>.
ru: Возвращает указатель на полезную нагрузку, относящуюся к указанной структуре I<nlmsghdr>.

source: Get the next I<nlmsghdr> in a multipart message. The caller must check if the current I<nlmsghdr> didn't have the B<NLMSG_DONE> set\(emthis function doesn't return NULL on end. The I<len> argument is an lvalue containing the remaining length of the message buffer. This macro decrements it by the length of the message header.
ru: Получает следующую структуру I<nlmsghdr> в сообщении, состоящем из нескольких частей. При вызове необходимо убедиться, что в текущей структуре I<nlmsghdr> не установлен флаг B<NLMSG_DONE> — эта функция не возвращает NULL в конце. Параметр I<len> — это величина lvalue, указывающая на оставшуюся длину буфера сообщения. Этот макрос уменьшает её на размер заголовка сообщения.

source: Return true if the netlink message is not truncated and is in a form suitable for parsing.
ru: Возвращает значение «истина», если сообщение netlink не обрезано и готово к обработке.

source: Return the length of the payload associated with the I<nlmsghdr>.
ru: Возвращает длину полезной нагрузки, связанной с I<nlmsghdr>.

source: These macros are nonstandard Linux extensions.
ru: Эти макросы являются нестандартными расширениями Linux.

source: It is often better to use netlink via I<libnetlink> than via the low-level kernel interface.
ru: В большинстве случаев лучше использовать netlink с помощью функций библиотеки I<libnetlink>, а не через низкоуровневый интерфейс ядра.

source: nan, nanf, nanl - return 'Not a Number'
ru: nan, nanf, nanl - возвращает «Not a Number» (не является числом)

source: These functions return a representation (determined by I<tagp>) of a quiet NaN. If the implementation does not support quiet NaNs, these functions return zero.
ru: Данные функции возвращают представление (определённое в I<tagp>) тихого NaN. Если реализация не поддерживает тихие (quiet) NaN, данные функции возвращают ноль.

source: The call I<nan("char-sequence")> is equivalent to:
ru: Вызов I<nan("символьная последовательность")> равнозначен следующему:

source: strtod("NAN(char-sequence)", NULL);
ru: strtod("NAN(символьная последовательность)", NULL);

source: Similarly, calls to B<nanf>() and B<nanl>() are equivalent to analogous calls to B<strtof>(3) and B<strtold>(3).
ru: Вызовы B<nanf>() и B<nanl>() эквивалентны аналогичным вызовам B<strtof>(3) и B<strtold>(3).

source: The argument I<tagp> is used in an unspecified manner. On IEEE 754 systems, there are many representations of NaN, and I<tagp> selects one. On other systems it may do nothing.
ru: Использование аргумента I<tagp> не регламентировано. В системах, совместимых с IEEE 754, существует несколько реализаций NaN, и I<tagp> используется в одной из них. В других системах он может ничего не делать.

source: These functions first appeared in glibc in version 2.1.
ru: Эти функции впервые появились в glibc 2.1.

source: C99, POSIX.1-2001, POSIX.1-2008. See also IEC 559 and the appendix with recommended functions in IEEE 754/IEEE 854.
ru: C99, POSIX.1-2001, POSIX.1-2008. См. также IEC 559 и приложение с рекомендуемыми функциями в IEEE 754/IEEE 854.

source: nl_langinfo, nl_langinfo_l - query language and locale information
ru: nl_langinfo, nl_langinfo_l - запрашивает информацию о языке и локали

source: Since glibc 2.24: _POSIX_C_SOURCE\ E<gt>=\ 200809L
ru: начиная с glibc 2.24: _POSIX_C_SOURCE\ E<gt>=\ 200809L

source: Glibc 2.23 and earlier: _POSIX_C_SOURCE\ E<gt>=\ 200112L
ru: в glibc 2.23 и старее: _POSIX_C_SOURCE\ E<gt>=\ 200112L
