Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_n/*.po
Languages: ru

source: The official number for this network in numbers-and-dots notation (see B<inet>(3)). The trailing ".0" (for the host component of the network address) may be omitted.
ru: Официальный номер данной сети в цифро-точечной форме (см. B<inet>(3)). Завершающий ".0" (компонент узла в адресе сети) можно не указывать.

source: I<aliases>
ru: I<псевдонимы>

source: Optional aliases for the network.
ru: Необязательные псевдонимы сети.

source: This file is read by the B<route>(8) and B<netstat>(8) utilities. Only Class A, B or C networks are supported, partitioned networks (i.e., network/26 or network/28) are not supported by this facility.
ru: Этот файл используется программами B<route>(8) и B<netstat>(8). Поддерживаются только сети классов A, B или C, бесклассовая адресация (то есть, сеть/26 или сеть/28) не поддерживаются данным средством.

source: The networks definition file.
ru: Файл с именами сетей.

source: nologin - prevent unprivileged users from logging into the system
ru: nologin - отказывает во входе в систему непривилегированным пользователям

source: If the file I</etc/nologin> exists and is readable, B<login>(1) will allow access only to root. Other users will be shown the contents of this file and their logins will be refused. This provides a simple way of temporarily disabling all unprivileged logins.
ru: Если существует файл I</etc/nologin> и он доступен для чтения, то B<login>(1) будет разрешать доступ в систему только пользователю root. Остальным пользователям будет показано содержимое этого файла, а в доступе в систему будет отказано. Предоставляет простой способ временной блокировки входа всем непривилегированным пользователям.

source: nss - Name Service Switch configuration file
ru: nss - файл настройки диспетчера службы имён

source: Each call to a function which retrieves data from a system database like the password or group database is handled by the Name Service Switch implementation in the GNU C library. The various services provided are implemented by independent modules, each of which naturally varies widely from the other.
ru: Функции, возвращающие данные из системной базы данных паролей или групп, включены в реализацию диспетчера службы имён (Name Service Switch) библиотеки GNU C. Все службы реализованы в виде независимых модулей, значительно отличающихся друг от друга.

source: The default implementations coming with the GNU C library are by default conservative and do not use unsafe data. This might be very costly in some situations, especially when the databases are large. Some modules allow the system administrator to request taking shortcuts if these are known to be safe. It is then the system administrator's responsibility to ensure the assumption is correct.
ru: Реализация библиотеки GNU C стабильна и не использует небезопасных данных. В некоторых ситуациях это может оказаться затратным, особенно если базы данных очень велики. Некоторые модули позволяют системному администратору включить упрощённый поиск, если известно, что это безопасно.

source: There are other modules where the implementation changed over time. If an implementation used to sacrifice speed for memory consumption, it might create problems if the preference is switched.
ru: Есть несколько модулей, реализация которых изменилась после долгого времени. Если в реализации раньше жертвовали скоростью в угоду снижению потребления памяти, это может создать проблемы, если было важно обратное предпочтение.

source: The I</etc/default/nss> file contains a number of variable assignments. Each variable controls the behavior of one or more NSS modules. White spaces are ignored. Lines beginning with \(aq#\(aq are treated as comments.
ru: В файле I</etc/default/nss> нескольким переменным задаются значения. Каждая переменная управляет поведением одного или нескольких модулей NSS. Пробельные символы игнорируются. Строки, начинающиеся с \(aq#\(aq, считаются комментариями.

source: The variables currently recognized are:
ru: Действующие переменные:

source: If set to TRUE, the NIS backend for the B<initgroups>(3) function will accept the information from the I<netid.byname> NIS map as authoritative. This can speed up the function significantly if the I<group.byname> map is large. The content of the I<netid.byname> map is used B<as is>. The system administrator has to make sure it is correctly generated.
ru: Если значение равно TRUE, то реализация NIS для функции B<initgroups>(3) будет принимать информацию из карты NIS I<netid.byname> как достоверную (authoritative). Это может значительно увеличить скорость функции, если карта I<group.byname> очень велика. Содержимое карты I<netid.byname> используется B<как есть>. За корректность её данных ответственен системный администратор.

source: If set to TRUE, the NIS backend for the B<getservbyname>(3) and B<getservbyname_r>(3) functions will assume that the I<services.byservicename> NIS map exists and is authoritative, particularly that it contains both keys with /proto and without /proto for both primary service names and service aliases. The system administrator has to make sure it is correctly generated.
ru: Если значение равно TRUE, то реализация NIS для функций B<getservbyname>(3) и B<getservbyname_r>(3) будет предполагать, что карта NIS I<services.byservicename> существует и достоверна; что она содержит ключи с /proto и без /proto для главной (primary) службы имён и псевдонимов служб. За корректность её данных ответственен системный администратор.

source: If set to TRUE, the NIS backend for the B<setpwent>(3) and B<setgrent>(3) functions will read the entire database at once and then hand out the requests one by one from memory with every corresponding B<getpwent>(3) or B<getgrent>(3) call respectively. Otherwise, each B<getpwent>(3) or B<getgrent>(3) call might result in a network communication with the server to get the next entry.
ru: Если значение равно TRUE, то реализация NIS для функций B<setpwent>(3) и B<setgrent>(3) будет читать всю базу сразу, а затем, используя память, обрабатывать поступающие запросы друг за другом для каждого соответствующего вызова B<getpwent>(3) или B<getgrent>(3). В противном случае для получения следующей записи каждый вызов B<getpwent>(3) или B<getgrent>(3) может создавать сетевое обращение к серверу.

source: The default configuration corresponds to the following configuration file:
ru: Файл с настройками по умолчанию выглядит так:

source: nsswitch.conf - Name Service Switch configuration file
ru: nsswitch.conf - файл настроек диспетчера службы имён

source: The Name Service Switch (NSS) configuration file, I</etc/nsswitch.conf>, is used by the GNU C Library and certain other applications to determine the sources from which to obtain name-service information in a range of categories, and in what order. Each category of information is identified by a database name.
ru: Файл настроек диспетчера службы имён (Name Service Switch, (NSS)) I</etc/nsswitch.conf> используется библиотекой GNU C и другими приложениями для определения источников служб имён разных категорий и их очерёдности. Каждая категория информации обозначается по имени её базы данных.

source: The file is plain ASCII text, with columns separated by spaces or tab characters. The first column specifies the database name. The remaining columns describe the order of sources to query and a limited set of actions that can be performed by lookup result.
ru: Данный файл представляет собой простой текст в кодировке ASCII с колонками, разделёнными пробелами или символами табуляции. В первой колонке указывается имя базы данных. В оставшихся колонках задаётся порядок запросов к источникам и ограниченный набор действий, который может быть выполнен в зависимости от результата запроса.

source: The following databases are understood by the GNU C Library:
ru: Библиотека GNU C распознаёт следующие базы данных:

source: Mail aliases, used by B<getaliasent>(3) and related functions.
ru: Почтовые псевдонимы, используемые B<getaliasent>(3) и подобными функциями.

source: Ethernet numbers.
ru: Номера ethernet.

source: Groups of users, used by B<getgrent>(3) and related functions.
ru: Группы пользователей, используемые B<getgrent>(3) и подобными функциями.

source: Host names and numbers, used by B<gethostbyname>(3) and related functions.
ru: Имена узлов и номера, используемые B<gethostbyname>(3) и подобными функциями.

source: Supplementary group access list, used by B<getgrouplist>(3) function.
ru: Дополнительный список групп доступа, используется функцией B<getgrouplist>(3).

source: Network-wide list of hosts and users, used for access rules. C libraries before glibc 2.1 supported netgroups only over NIS.
ru: Список узлов и пользователей сети, используемый для правил доступа. Библиотеки C до версии glibc 2.1 поддерживают сетевые группы только посредством NIS.

source: Network names and numbers, used by B<getnetent>(3) and related functions.
ru: Имена сетей и номера, используемые B<getnetent>(3) и подобными функциями.

source: User passwords, used by B<getpwent>(3) and related functions.
ru: Пароли пользователей, используемые B<getpwent>(3) и подобными функциями.

source: Network protocols, used by B<getprotoent>(3) and related functions.
ru: Сетевые протоколы, используемые B<getprotoent>(3) и подобными функциями.

source: Public and secret keys for Secure_RPC used by NFS and NIS+.
ru: Открытые и секретные ключи для Secure_RPC, используемые в NFS и NIS+.

source: Remote procedure call names and numbers, used by B<getrpcbyname>(3) and related functions.
ru: Имена и номера вызовов удалённых процедур, используемые B<getrpcbyname>(3) и подобными функциями.

source: Network services, used by B<getservent>(3) and related functions.
ru: Сетевые службы, используемые B<getservent>(3) и подобными функциями.

source: Shadow user passwords, used by B<getspnam>(3) and related functions.
ru: Теневые пароли пользователей, используемые B<getspnam>(3) и подобными функциями.

source: The GNU C Library ignores databases with unknown names. Some applications use this to implement special handling for their own databases. For example, B<sudo>(8) consults the B<sudoers> database.
ru: Библиотека GNU C игнорирует базы данных с неизвестными именами. Некоторые приложения используют это для реализации обработки своих баз данных. Например, B<sudo>(8) обращается к базе данных B<sudoers>.

source: Here is an example I</etc/nsswitch.conf> file:
ru: Пример файла I</etc/nsswitch.conf>:

source: The first column is the database name. The remaining columns specify:
ru: В первой колонке содержится имя базы данных. В остальных колонках указывается:

source: One or more service specifications, for example, "files", "db", or "nis". The order of the services on the line determines the order in which those services will be queried, in turn, until a result is found.
ru: Одна или более служб, например, «files», «db» или «nis». Очерёдность служб в строке определяет порядок, в котором будут опрашиваться данные службы (пока не будет найден результат).

source: Optional actions to perform if a particular result is obtained from the preceding service, for example, "[NOTFOUND=return]".
ru: Необязательные действия для выполнения, если получен определённый результат от предыдущей службы, например «[NOTFOUND=return]».

source: The service specifications supported on your system depend on the presence of shared libraries, and are therefore extensible. Libraries called I</lib/libnss_SERVICE.so.>B<X> will provide the named I<SERVICE>. On a standard installation, you can use "files", "db", "nis", and "nisplus". For the B<hosts> database, you can additionally specify "dns". For the B<passwd>, B<group>, and B<shadow> databases, you can additionally specify "compat" (see B<Compatibility mode> below). The version number B<X> may be 1 for glibc 2.0, or 2 for glibc 2.1 and later. On systems with additional libraries installed, you may have access to further services such as "hesiod", "ldap", "winbind" and "wins".
ru: Список поддерживаемых системой служб зависит от наличия динамических библиотек (и, таким образом, расширяем). Библиотека с именем I</lib/libnss_СЛУЖБА.so.>B<X> предоставляет службу I<СЛУЖБА>. В стандартной установке вы можете использовать «files», «db», «nis» и «nisplus». Для базы данных B<hosts> вы можете дополнительно указать «dns». Для баз данных B<passwd>, B<group> и B<shadow> вы можете дополнительно указать «compat» (см. B<Режим совместимости> далее). Номер версии B<X> может быть равен 1 (для glibc 2.0) или 2 (для glibc 2.1 и новее). В системах с дополнительно установленными библиотеками могут быть другие службы, такие как «hesiod», «ldap», «winbind» и «wins».

source: An action may also be specified following a service specification. The action modifies the behavior following a result obtained from the preceding data source. Action items take the general form:
ru: Также, после указания службы может быть указано действие. Действие изменяет дальнейшее поведение в зависимости от результата, полученного из предыдущего источника данных. Действия задаются следующим образом:

source: [I<STATUS>=I<ACTION>]
ru: [I<СОСТОЯНИЕ>=I<ДЕЙСТВИЕ>]

source: [!I<STATUS>=I<ACTION>]
ru: [!I<СОСТОЯНИЕ>=I<ДЕЙСТВИЕ>]

source: where
ru: где

source: I<STATUS> =E<gt> B<success> | B<notfound> | B<unavail> | B<tryagain>
ru: I<СОСТОЯНИЕ> =E<gt> B<success> | B<notfound> | B<unavail> | B<tryagain>

source: I<ACTION> =E<gt> B<return> | B<continue> | B<merge>
ru: I<ДЕЙСТВИЕ> =E<gt> B<return> | B<continue> | B<merge>

source: The ! negates the test, matching all possible results except the one specified. The case of the keywords is not significant.
ru: Символ ! инвертирует результат теста, то есть совпадают все результаты, кроме указанного. Регистр символов ключевых слов не важен.

source: The I<STATUS> value is matched against the result of the lookup function called by the preceding service specification, and can be one of:
ru: Значение I<СОСТОЯНИЕ> — это результат вызова функции поиска заданной службы. Оно может принимать значения:

source: No error occurred and the requested entry is returned. The default action for this condition is "return".
ru: Запрашиваемая запись найдена и ошибок не произошло. Для этого состояния действием по умолчанию является «return».

source: The lookup succeeded, but the requested entry was not found. The default action for this condition is "continue".
ru: Поиск выполнен, но нужная запись не была найдена. Для этого состояния действием по умолчанию является «continue».

source: The service is permanently unavailable. This can mean either that the required file cannot be read, or, for network services, that the server is not available or does not allow queries. The default action for this condition is "continue".
ru: Служба постоянно недоступна. Это может означать, что недоступен для чтения нужный файл или, для сетевых служб, что сервер недоступен или не обслуживает запросы. Для этого состояния действием по умолчанию является «continue».

source: The service is temporarily unavailable. This could mean a file is locked or a server currently cannot accept more connections. The default action for this condition is "continue".
ru: Служба временно недоступна. Это может означать, что какой-либо файл заблокирован или что в данный момент сервер не может принять больше соединений. Для этого состояния действием по умолчанию является «continue».

source: The I<ACTION> value can be one of:
ru: Значением I<ДЕЙСТВИЕ> может быть одно из:

source: Return a result now. Do not call any further lookup functions. However, for compatibility reasons, if this is the selected action for the B<group> database and the B<notfound> status, and the configuration file does not contain the B<initgroups> line, the next lookup function is always called, without affecting the search result.
ru: Вернуть результат. Не вызывать функции для дальнейшего поиска. Однако, с целью совместимости, если это действие указывается для базы данных B<group> и состояние равно B<notfound>, и файл настройки не содержит строку B<initgroups>, то всегда вызывается следующая функция поиска, независимо от результата поиска.

source: Call the next lookup function.
ru: Вызвать следующую функцию поиска.

source: I<[SUCCESS=merge]> is used between two database entries. When a group is located in the first of the two group entries, processing will continue on to the next one. If the group is also found in the next entry (and the group name and GID are an exact match), the member list of the second entry will be added to the group object to be returned. Available since glibc 2.24. Note that merging will not be done for B<getgrent>(3) nor will duplicate members be pruned when they occur in both entries being merged.
ru: I<[SUCCESS=merge]> используется между двумя записями базы данных. Если группа расположена в первой из двух записей групп, то обработка будет продолжена со следующей. Если группа также присутствует в следующей записи (имя группы и GID совпадают полностью), то список членов второй записи будет добавлен к возвращаемому объекту группы. Доступно начиная с glibc 2.24. Заметим, что слияние не будет выполнено для B<getgrent>(3) повторяющиеся члены не будут удалены, если они присутствуют в обоих объединяемых записях.

source: Compatibility mode (compat)
ru: Режим совместимости (compat)

source: The NSS "compat" service is similar to "files" except that it additionally permits special entries in corresponding files for granting users or members of netgroups access to the system. The following entries are valid in this mode:
ru: Служба NSS «compat» подобна «files», за исключением того, что она позволяет иметь дополнительные специальные записи в соответствующих файлах для разграничения прав доступа пользователей и сетевых групп в системе. В этом режиме допустимы следующие записи:

source: For B<passwd> and B<shadow> databases:
ru: Для баз данных B<passwd> и B<shadow>:

source: B<+>I<user>
ru: B<+>I<пользователь>

source: Include the specified I<user> from the NIS passwd/shadow map.
ru: Включить указанного I<пользователя> в карту NIS passwd/shadow.

source: B<+@>I<netgroup>
ru: B<+@>I<сетевая группа>

source: Include all users in the given I<netgroup>.
ru: Включить всех пользователей в указанную I<сетевую группу>.

source: B<->I<user>
ru: B<->I<пользователь>

source: Exclude the specified I<user> from the NIS passwd/shadow map.
ru: Исключить указанного I<пользователя> из карты NIS passwd/shadow.

source: B<-@>I<netgroup>
ru: B<-@>I<сетевая группа>

source: Exclude all users in the given I<netgroup>.
ru: Исключить всех пользователей из указанной I<сетевой группы>.

source: Include every user, except previously excluded ones, from the NIS passwd/shadow map.
ru: Включить каждого пользователя, за исключением исключённых ранее, в карту NIS passwd/shadow.

source: For B<group> database:
ru: Для базы данных B<group>:

source: B<+>I<group>
ru: B<+>I<группа>

source: Include the specified I<group> from the NIS group map.
ru: Включить указанную I<группу> в карту NIS group.

source: B<->I<group>
ru: B<->I<группа>

source: Exclude the specified I<group> from the NIS group map.
ru: Исключить указанную I<группу> из карты NIS group.

source: Include every group, except previously excluded ones, from the NIS group map.
ru: Включить каждую группу, за исключением исключённых ранее, в карту NIS group.

source: By default, the source is "nis", but this may be overridden by specifying any NSS service except "compat" itself as the source for the pseudo-databases B<passwd_compat>, B<group_compat>, and B<shadow_compat>.
ru: По умолчанию источником является «nis», но это можно изменить, указав любую службу NSS, за исключением самого «compat» в качестве источника псевдо-базы данных B<passwd_compat>, B<group_compat> и B<shadow_compat>.

source: A service named I<SERVICE> is implemented by a shared object library named I<libnss_SERVICE.so.>B<X> that resides in I</lib>.
ru: Каждая I<СЛУЖБА> реализована в динамической объектной библиотеки с именем B<libnss_СЛУЖБА.so.>B<X>, которая находится в каталоге I</lib>.

source: NSS configuration file.
ru: файл настройки NSS

source: implements "compat" source.
ru: реализует источник «compat»

source: implements "db" source.
ru: реализует источник «db»

source: implements "dns" source.
ru: реализует источник «dns»

source: implements "files" source.
ru: реализует источник «files»

source: implements "hesiod" source.
ru: реализует источник «hesiod»

source: implements "nis" source.
ru: реализует источник «nis»

source: implements "nisplus" source.
ru: реализует источник «nisplus»

source: The following files are read when "files" source is specified for respective databases:
ru: При указании в соответствующих базах источника «files», читаются следующие файлы:

source: Within each process that uses B<nsswitch.conf>, the entire file is read only once. If the file is later changed, the process will continue using the old configuration.
ru: Внутри каждого процесса, который использует файл B<nsswitch.conf>, файл полностью читается только один раз. Если позднее файл был изменён, то процесс продолжит выполнение, используя старые настройки.

source: Traditionally, there was only a single source for service information, often in the form of a single configuration file (e.g., I</etc/passwd>). However, as other name services, such as the Network Information Service (NIS) and the Domain Name Service (DNS), became popular, a method was needed that would be more flexible than fixed search orders coded into the C library. The Name Service Switch mechanism, which was based on the mechanism used by Sun Microsystems in the Solaris 2 C library, introduced a cleaner solution to the problem.
ru: Изначально использовался только один источник служебной информации, часто в виде одного файла настройки (например, I</etc/passwd>). Однако, по мере того, как становились популярными другие службы, такие как служба сетевой информации (Network Information Service (NIS)) и служба доменных имён (Domain Name Service (DNS)), потребовался более гибкий способ определения порядка поиска вместо встроенного в библиотеку C. Для решения этой проблемы был создан диспетчер службы имён (Name Service Switch), основанный на механизме, использованном Sun Microsystems в C-библиотеке Solaris 2.

source: nextafter, nextafterf, nextafterl, nexttoward, nexttowardf, nexttowardl - floating-point number manipulation
ru: nextafter, nextafterf, nextafterl, nexttoward, nexttowardf, nexttowardl - операции над числами с плавающей запятой

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<nextafter>(), B<nextafterf>(), and B<nextafterl>() functions return the next representable floating-point value following I<x> in the direction of I<y>. If I<y> is less than I<x>, these functions will return the largest representable number less than I<x>.
ru: Функции B<nextafter>(), B<nextafterf>() и B<nextafterl>() возвращают следующее представимое значение с плавающей запятой после I<x> по направлению к I<y>. Если I<y> меньше I<x>, то эти функции возвращают наибольшее представимое число, которое меньше I<x>.
