Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: dsp56k - DSP56001 interface device
ru: dsp56k - устройство интерфейса DSP56001

source: SYNOPSIS
ru: ОБЗОР

source: CONFIGURATION
ru: НАСТРОЙКА

source: The dsp56k device is a character device with major number 55 and minor number 0.
ru: Устройство dsp56k является символьным устройством с старшим номером 55 и младшим номером 0.

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The Motorola DSP56001 is a fully programmable 24-bit digital signal processor found in Atari Falcon030-compatible computers. The I<dsp56k> special file is used to control the DSP56001, and to send and receive data using the bidirectional handshaked host port.
ru: Motorola DSP56001 \(em это полностью программируемый 24-битный цифровой сигнальный процессор, используемый в компьютерах Atari Falcon030 и совместимых с ними. Специальный файл I<dsp56k> используется для управления DSP56001 и для посылки и получения данных через выбранный на узле (host) двунаправленный порт.

source: To send a data stream to the signal processor, use B<write>(2) to the device, and B<read>(2) to receive processed data. The data can be sent or received in 8, 16, 24, or 32-bit quantities on the host side, but will always be seen as 24-bit quantities in the DSP56001.
ru: Для отправки потока данных сигнальному процессору, используйте B<write>(2), а для получения обработанных данных \(em B<read>(2). Данные могут быть посылаться и получаться узлом по 8, 16, 24 или 32 бита, а сигнальный процессор способен обрабатывать только по 24 бита.

source: The following B<ioctl>(2) calls are used to control the I<dsp56k> device:
ru: Для управления устройством I<dsp56k> используются следующие вызовы B<ioctl>(2):

source: resets the DSP56001 and uploads a program. The third B<ioctl>(2) argument must be a pointer to a I<struct dsp56k_binary> with members I<bin> pointing to a DSP56001 binary program, and I<len> set to the length of the program, counted in 24-bit words.
ru: Обнуляет DSP56001 и загружает в него программу. Третьим аргументом B<ioctl>(2) должен быть указатель на I<struct dsp56k_binary>, в которое поле I<bin> указывает на двоичную программу DSP56001, а в I<len> задаётся длина программы (значение должно быть кратно 24-битным словам).

source: sets the transmit word size. Allowed values are in the range 1 to 4, and is the number of bytes that will be sent at a time to the DSP56001. These data quantities will either be padded with zero bytes, or truncated to fit the native 24-bit data format of the DSP56001.
ru: Устанавливает размер передаваемых слов. Допустимое значение находится в пределах от 1 до 4, и является числом байт, посылаемых за один раз в DSP56001. Эти частички информации будут заполнены нулевыми байтами или преобразованы в формат 24-битных данных DSP56001.

source: sets the receive word size. Allowed values are in the range 1 to 4, and is the number of bytes that will be received at a time from the DSP56001. These data quantities will either truncated, or padded with a null byte (\(aq\e0\(aq) to fit the native 24-bit data format of the DSP56001.
ru: Устанавливает размер принимаемых слов. Допустимое значение находится в диапазоне от 1 до 4, и является числом байт, принимаемых за один раз от процессора DSP56001. Эти частички информации будут урезаны или дополнены байтом null (\(aq\e0\(aq), чтобы соответствовать 24-битному формату DSP56001.

source: read and write the host flags. The host flags are four general-purpose bits that can be read by both the hosting computer and the DSP56001. Bits 0 and 1 can be written by the host, and bits 2 and 3 can be written by the DSP56001.
ru: Считывает и записывает флаги узла. Флаги узла \(em это четыре бита общего назначения, они могут быть считаны как узлом, так и процессором DSP56001. Нулевой и первый биты могут записываться узлом, а второй и третий пишутся устройством DSP56001.

source: To access the host flags, the third B<ioctl>(2) argument must be a pointer to a I<struct dsp56k_host_flags>. If bit 0 or 1 is set in the I<dir> member, the corresponding bit in I<out> will be written to the host flags. The state of all host flags will be returned in the lower four bits of the I<status> member.
ru: Для получения доступа к флагам узла третий аргумент B<ioctl>(2) должен быть указателем на I<struct dsp56k_host_flags>. Если нулевой и первый поля I<dir> установлены в единичное значение, то соответствующий бит в поле I<out> будет записан в флаг узла. Состояние всех флагов узла будет возвращено в младших четырёх битах поля I<status>.

source: sends a host command. Allowed values are in the range 0 to 31, and is a user-defined command handled by the program running in the DSP56001.
ru: Посылает команды узла. Допустимые величины находятся в диапазоне от 0 до 31, это определяемые пользователем команды, обрабатываемые программой, выполняющейся на DSP56001.

source: FILES
ru: ФАЙЛЫ

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: ddp - Linux AppleTalk protocol implementation
ru: ddp - реализация протокола AppleTalk в Linux

source: Linux implements the AppleTalk protocols described in I<Inside AppleTalk>. Only the DDP layer and AARP are present in the kernel. They are designed to be used via the B<netatalk> protocol libraries. This page documents the interface for those who wish or need to use the DDP layer directly.
ru: В Linux реализованы протоколы AppleTalk, описанные в I<Inside AppleTalk>. В ядре есть лишь уровни DDP и AARP. Они проектировались с учётом того, что ими будут пользоваться через библиотеку протоколов B<netatalk>. В этой странице описан интерфейс для тех, кому требуется использовать уровень DDP напрямую.

source: The communication between AppleTalk and the user program works using a BSD-compatible socket interface. For more information on sockets, see B<socket>(7).
ru: Связь между AppleTalk и пользовательской программой реализована через интерфейс сокетов, совместимых с BSD. Дополнительную информацию о сокетах можно найти в B<socket>(7).

source: An AppleTalk socket is created by calling the B<socket>(2) function with a B<AF_APPLETALK> socket family argument. Valid socket types are B<SOCK_DGRAM> to open a B<ddp> socket or B<SOCK_RAW> to open a B<raw> socket. I<protocol> is the AppleTalk protocol to be received or sent. For B<SOCK_RAW> you must specify B<ATPROTO_DDP>.
ru: Сокет AppleTalk создаётся из вызова B<socket>(2), которому в качестве аргумента семейства указывается значение B<AF_APPLETALK>. Типом сокета может быть B<SOCK_DGRAM> (чтобы открыть сокет B<ddp>) или B<SOCK_RAW> (для открытия сокета B<raw>). Значением I<protocol> устанавливается протокол приема-передачи AppleTalk. При B<SOCK_RAW> необходимо указать значение B<ATPROTO_DDP>.

source: Raw sockets may be opened only by a process with effective user ID 0 or when the process has the B<CAP_NET_RAW> capability.
ru: Неструктурированные сокеты могут быть открыты только процессом с идентификатором эффективного пользователя, равным нулю, либо процессом, имеющим мандат B<CAP_NET_RAW>.

source: Address format
ru: Формат адреса

source: An AppleTalk socket address is defined as a combination of a network number, a node number, and a port number.
ru: Адрес сокета AppleTalk определяется как комбинация номера сети, номера узла и номера порта.

source: struct sockaddr_atalk { sa_family_t sat_family; /* address family */ unsigned char sat_port; /* port */ struct at_addr sat_addr; /* net/node */ };
ru: struct sockaddr_atalk { sa_family_t sat_family; /* адресное семейство */ unsigned char sat_port; /* порт */ struct at_addr sat_addr; /* сеть/узел */ };

source: I<sat_family> is always set to B<AF_APPLETALK>. I<sat_port> contains the port. The port numbers below 129 are known as I<reserved ports>. Only processes with the effective user ID 0 or the B<CAP_NET_BIND_SERVICE> capability may B<bind>(2) to these sockets. I<sat_addr> is the host address. The I<net> member of I<struct at_addr> contains the host network in network byte order. The value of B<AT_ANYNET> is a wildcard and also implies \(lqthis network.\(rq The I<node> member of I<struct at_addr> contains the host node number. The value of B<AT_ANYNODE> is a wildcard and also implies \(lqthis node.\(rq The value of B<ATADDR_BCAST> is a link local broadcast address.
ru: Значение I<sat_family> всегда устанавливается в B<AF_APPLETALK>. В I<sat_port> содержится номер порта. Порты с номерами меньше 129 называются I<зарезервированными портами>. Вызов B<bind>(2) для этих сокетов допустим только для процессов, у которых идентификатор эффективного пользователя равен нулю, либо имеется мандат B<CAP_NET_BIND_SERVICE>. В I<sat_addr> указан адрес машины (host). Поле I<net> структуры I<struct at_addr> содержит адрес сети машины в сетевом порядке расположения байт. Значение B<AT_ANYNET> является шаблоном, включающим в себя и \(lqэту сеть\(rq. Поле I<node> структуры I<struct at_addr> содержит номер узла машины. Значение B<AT_ANYNODE> является шаблоном, включающим в себя и \(lqэтот узел\(rq. Значение B<ATADDR_BCAST> является ссылкой на локальный широковещательный адрес.

source: Socket options
ru: Параметры сокета

source: No protocol-specific socket options are supported.
ru: Специальные параметры сокета для протокола не поддерживаются.

source: /proc interfaces
ru: Интерфейсы /proc

source: IP supports a set of I</proc> interfaces to configure some global AppleTalk parameters. The parameters can be accessed by reading or writing files in the directory I</proc/sys/net/atalk/>.
ru: IP поддерживает набор интерфейсов I</proc> для настройки некоторых общих параметров Appletalk. Доступ к параметрам можно получить путем чтения или записи файлов в каталоге I</proc/sys/net/atalk/>.

source: The time interval (in seconds) before an AARP cache entry expires.
ru: Временной интервал (в секундах) до момента устаревания записи в кэше AARP.

source: The time interval (in seconds) before an AARP cache entry is resolved.
ru: Временной интервал (в секундах) до определения записи в кэше AARP.

source: The number of retransmissions of an AARP query before the node is declared dead.
ru: Количество повторных передач запроса AARP до того, как запись будет объявлена недействительной.

source: The timer rate (in seconds) for the timer driving AARP.
ru: Скорость таймера управляющего AARP в секундах.

source: The default values match the specification and should never need to be changed.
ru: Значения по умолчанию соответствуют спецификации и никогда не должны меняться.

source: Ioctls
ru: Вызовы ioctl

source: All ioctls described in B<socket>(7) apply to DDP.
ru: Все вызовы ioctl, описанные в B<socket>(7), применимы к DDP.

source: ERRORS
ru: ОШИБКИ

source: The user tried to execute an operation without the necessary permissions. These include sending to a broadcast address without having the broadcast flag set, and trying to bind to a reserved port without effective user ID 0 or B<CAP_NET_BIND_SERVICE>.
ru: Пользователь попытался выполнить операцию, не имея на то соответствующих прав. Это относится к передаче информации по широковещательному адресу при сброшенном флаге широковещательной передачи, а также к попытке соединения с зарезервированным портом, когда идентификатор эффективного пользователя отличается от нуля или отсутствует мандат B<CAP_NET_BIND_SERVICE>.

source: Tried to bind to an address already in use.
ru: Попытка связать сокет с уже используемым адресом.

source: A nonexistent interface was requested or the requested source address was not local.
ru: Был запрошен несуществующий интерфейс или запрошенный исходящий адрес не является локальным.

source: Operation on a nonblocking socket would block.
ru: Действие над неблокирующим сокетом привело бы к его блокировке.

source: A connection operation on a nonblocking socket is already in progress.
ru: Операция соединения на неблокирующем сокете уже находится в процессе выполнения.

source: A connection was closed during an B<accept>(2).
ru: Соединение закрыто во время B<accept>(2).

source: No routing table entry matches the destination address.
ru: Нет записи в таблице маршрутизации, указывающей на адрес назначения.

source: Invalid argument passed.
ru: Передан неверный аргумент.

source: B<connect>(2) was called on an already connected socket.
ru: Вызов B<connect>(2) запущен для сокета, уже установившего соединение.

source: Datagram is bigger than the DDP MTU.
ru: Размер датаграммы больше размера DDP MTU.

source: Network device not available or not capable of sending IP.
ru: Сетевое устройство недоступно или неспособно посылать IP.

source: B<SIOCGSTAMP> was called on a socket where no packet arrived.
ru: Операция B<SIOCGSTAMP> вызвана для сокета, который ещё не получил ни одного пакета.

source: B<ENOMEM> and B<ENOBUFS>
ru: B<ENOMEM> и B<ENOBUFS>

source: Not enough memory available.
ru: Недостаточно памяти.

source: A kernel subsystem was not configured.
ru: Не настроена подсистема ядра.

source: B<ENOPROTOOPT> and B<EOPNOTSUPP>
ru: B<ENOPROTOOPT> и B<EOPNOTSUPP>

source: Invalid socket option passed.
ru: Передан недопустимый параметр сокета.

source: The operation is defined only on a connected socket, but the socket wasn't connected.
ru: Операция определена только для сокета, установившего соединение, а этот сокет не соединён.

source: User doesn't have permission to set high priority, make a configuration change, or send signals to the requested process or group.
ru: У пользователя нет достаточных полномочий, чтобы повысить приоритет, изменить настройку или послать сигнал запрашиваемому процессу или группе процессов.

source: The connection was unexpectedly closed or shut down by the other end.
ru: Соединение неожиданно закрылось или завершено (shut down) другой стороной.

source: The socket was unconfigured, or an unknown socket type was requested.
ru: Сокет не настроен или запрошен неизвестный тип сокета.

source: VERSIONS
ru: ВЕРСИИ

source: AppleTalk is supported by Linux 2.0 or higher. The I</proc> interfaces exist since Linux 2.2.
ru: AppleTalk поддерживается в Linux версии 2.0 и более поздних. Интерфейс I</proc> появился в Linux 2.2.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: Be very careful with the B<SO_BROADCAST> option; it is not privileged in Linux. It is easy to overload the network with careless sending to broadcast addresses.
ru: Будьте очень осторожны при работе с параметром B<SO_BROADCAST>: в Linux он не относится к привилегированным. Масштабная рассылка сообщений по широковещательному адресу может легко перегрузить сеть.

source: Compatibility
ru: Совместимость

source: The basic AppleTalk socket interface is compatible with B<netatalk> on BSD-derived systems. Many BSD systems fail to check B<SO_BROADCAST> when sending broadcast frames; this can lead to compatibility problems.
ru: Базовый интерфейс сокетов Appletalk совместим с B<netatalk> в BSD-подобных системах. Многие системы BSD не проверяют B<SO_BROADCAST> при посылке широковещательных кадров: это может привести к проблемам совместимости.

source: The raw socket mode is unique to Linux and exists to support the alternative CAP package and AppleTalk monitoring tools more easily.
ru: Режим неструктурированных сокетов поддерживается только в Linux и предназначен для облегчения поддержки альтернатив пакета CAP и утилит мониторинга AppleTalk.

source: BUGS
ru: ДЕФЕКТЫ

source: There are too many inconsistent error values.
ru: Слишком много противоречий в значениях ошибок.

source: The ioctls used to configure routing tables, devices, AARP tables, and other devices are not yet described.
ru: Вызовы ioctl для настройки таблиц маршрутизации, устройств, таблиц AARP и других устройств пока что не описаны.

source: dup, dup2, dup3 - duplicate a file descriptor
ru: dup, dup2, dup3 - создать дубликат файлового дескриптора

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>> /* Obtain O_* constant definitions */ B<#include E<lt>unistd.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>> /* Определение констант O_* */ B<#include E<lt>unistd.hE<gt>>

source: The B<dup>() system call creates a copy of the file descriptor I<oldfd>, using the lowest-numbered unused file descriptor for the new descriptor.
ru: Системный вызов B<dup>() создаёт копию файлового дескриптора I<oldfd>, используя для нового дескриптора самый маленький свободный номер файлового дескриптора.

source: After a successful return, the old and new file descriptors may be used interchangeably. They refer to the same open file description (see B<open>(2)) and thus share file offset and file status flags; for example, if the file offset is modified by using B<lseek>(2) on one of the file descriptors, the offset is also changed for the other.
ru: После успешного выполнения старый и новый файловые дескрипторы являются взаимозаменяемыми. Они указывают на одно и то же открытое файловое описание (смотрите B<open>(2)) и поэтому имеют общее файловое смещение и флаги состояния файла; например, если файловое смещение изменить с помощью B<lseek>(2) через один из файловых дескрипторов, то смещение изменится и для другого.

source: The two file descriptors do not share file descriptor flags (the close-on-exec flag). The close-on-exec flag (B<FD_CLOEXEC>; see B<fcntl>(2)) for the duplicate descriptor is off.
ru: Эти два файловых дескриптора имеют различные флаги дескриптора файла (флаг close-on-exec). Флаг close-on-exec (B<FD_CLOEXEC>; см. B<fcntl>(2)) у копии дескриптора сбрасывается.

source: The B<dup2>() system call performs the same task as B<dup>(), but instead of using the lowest-numbered unused file descriptor, it uses the file descriptor number specified in I<newfd>. If the file descriptor I<newfd> was previously open, it is silently closed before being reused.
ru: Системный вызов B<dup2>() выполняет ту же задачу, что и B<dup>(), но вместо использования самого маленького неиспользуемого номера файлового дескриптора, он использует номер файлового дескриптора, указанного в I<newfd>. Если файловый дескриптор I<newfd> уже открыт, то он закрывается перед повторным использованием.

source: The steps of closing and reusing the file descriptor I<newfd> are performed I<atomically>. This is important, because trying to implement equivalent functionality using B<close>(2) and B<dup>() would be subject to race conditions, whereby I<newfd> might be reused between the two steps. Such reuse could happen because the main program is interrupted by a signal handler that allocates a file descriptor, or because a parallel thread allocates a file descriptor.
ru: Шаги по закрытию и повторному использованию файлового дескриптора I<newfd> выполняются I<атомарно>. Это важно, так как попытка реализовать подобное с помощью B<close>(2) и B<dup>() привело бы к состязательности, в силу чего I<newfd> мог быть задействован повторно между этими двумя шагами. Такое повторное использование может произойти, из-за прерывания основной программы обработчиком сигналов, который выделяет файловый дескриптор, или из-за параллельной нити, выделяющей файловый дескриптор.

source: Note the following points:
ru: Также заметим следующее:

source: If I<oldfd> is not a valid file descriptor, then the call fails, and I<newfd> is not closed.
ru: Если I<oldfd> является некорректным файловым дескриптором, то вызов завершается с ошибкой, а I<newfd> не закрывается.

source: If I<oldfd> is a valid file descriptor, and I<newfd> has the same value as I<oldfd>, then B<dup2>() does nothing, and returns I<newfd>.
ru: Если I<oldfd> является корректным файловым дескриптором, а номер I<newfd> совпадает с I<oldfd>, то B<dup2>() не делает ничего и возвращает значение I<newfd>.

source: B<dup3>() is the same as B<dup2>(), except that:
ru: B<dup3>() похож на B<dup2>(). Отличия заключаются в следующем:

source: The caller can force the close-on-exec flag to be set for the new file descriptor by specifying B<O_CLOEXEC> in I<flags>. See the description of the same flag in B<open>(2) for reasons why this may be useful.
ru: Вызывающий может принудительно установить флаг close-on-exec flag у нового файлового дескриптора, указав B<O_CLOEXEC> в I<flags>. Зачем это может быть нужно смотрите в B<open>(2).

source: If I<oldfd> equals I<newfd>, then B<dup3>() fails with the error B<EINVAL>.
ru: Если I<oldfd> равно I<newfd>, то B<dup3>() выдает ошибку B<EINVAL>.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On success, these system calls return the new file descriptor. On error, -1 is returned, and I<errno> is set appropriately.
ru: В случае успеха данные системные вызовы возвращают новый файловый дескриптор или -1, если произошла ошибка (в этом случае I<errno> устанавливается должным образом).

source: I<oldfd> isn't an open file descriptor.
ru: Значение I<oldfd> не является открытым файловым дескриптором.

source: I<newfd> is out of the allowed range for file descriptors (see the discussion of B<RLIMIT_NOFILE> in B<getrlimit>(2)).
ru: Значение I<newfd> находится вне допустимого диапазона файловых дескрипторов (смотрите описание B<RLIMIT_NOFILE> в B<getrlimit>(2)).

source: (Linux only) This may be returned by B<dup2>() or B<dup3>() during a race condition with B<open>(2) and B<dup>().
ru: (только в Linux) Может случиться в B<dup2>() или B<dup3>() при возникновении состязательности вызовов B<open>(2) и B<dup>().

source: The B<dup2>() or B<dup3>() call was interrupted by a signal; see B<signal>(7).
ru: Вызов B<dup2>() или B<dup3>() был прерван каким-либо сигналом. Смотрите B<signal>(7).

source: (B<dup3>()) I<flags> contain an invalid value.
ru: (B<dup3>()) I<flags> содержит некорректное значение.

source: (B<dup3>()) I<oldfd> was equal to I<newfd>.
ru: (B<dup3>()) I<oldfd> было равно I<newfd>.

source: The per-process limit on the number of open file descriptors has been reached (see the discussion of B<RLIMIT_NOFILE> in B<getrlimit>(2)).
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс (смотрите описание B<RLIMIT_NOFILE> в B<getrlimit>(2)).

source: B<dup3>() was added to Linux in version 2.6.27; glibc support is available starting with version 2.9.
ru: Вызов B<dup3>() был добавлен в Linux версии 2.6.27; поддержка в glibc доступна с версии 2.9.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: B<dup3>() is Linux-specific.
ru: B<dup3>() есть только в Linux.

source: The error returned by B<dup2>() is different from that returned by B<fcntl(>..., B<F_DUPFD>, ...B<)> when I<newfd> is out of range. On some systems, B<dup2>() also sometimes returns B<EINVAL> like B<F_DUPFD>.
ru: Ошибка, которую возвращает B<dup2>(), отличается от той, что возвращает B<fcntl(>…, B<F_DUPFD>, …B<)>, когда I<newfd> находится вне допустимых пределов. На некоторых системах B<dup2>() также иногда возвращает B<EINVAL> — как B<F_DUPFD>.

source: If I<newfd> was open, any errors that would have been reported at B<close>(2) time are lost. If this is of concern, then\(emunless the program is single-threaded and does not allocate file descriptors in signal handlers\(emthe correct approach is I<not> to close I<newfd> before calling B<dup2>(), because of the race condition described above. Instead, code something like the following could be used:
ru: Если был открыт I<newfd>, то любые ошибки, о которых было бы сообщено B<close>(2), теряются. Если это важно, то (если программа однонитевая и не выделяет файловые дескрипторы в обработчиках сигналов) правильней будет I<не> закрывать I<newfd> перед вызовом B<dup2>(), из-за состязательности, описанной выше. Вместо этого можно использовать, например, такой код:
