Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: I<seq> routines return -1 on error (setting I<errno>), 0 on success and 1 if there are no key/data pairs less than or greater than the specified or current key. If the B<DB_RECNO> access method is being used, and if the database file is a character special file and no complete key/data pairs are currently available, the I<seq> routines return 2.
ru: Функция I<seq> возвращает -1 при ошибке (изменяя при этом значение переменной I<errno>), 0 при успешном выполнении и 1, если не обнаруживается пары ключ/данные, меньшей или большей по значению, чем указанный или текущий ключ. Если используется метод доступа B<DB_RECNO>, а файл базы данных представляет собой специальный символьный файл (и нет доступных полных пар ключ/данные), то функция I<seq> возвращает значение 2.

source: A pointer to a routine to flush any cached information to disk. If the database is in memory only, the I<sync> routine has no effect and will always succeed.
ru: Указатель на функцию, которая записывает любые кэшированные данные на диск. Если база данных находится только в памяти, функция I<sync> не выполняет никаких действий и всегда выполняется без ошибок.

source: The flag value may be set to the following value:
ru: Значение параметра I<flag> может быть следующим:

source: If the B<DB_RECNO> access method is being used, this flag causes the sync routine to apply to the btree file which underlies the recno file, not the recno file itself. (See the I<bfname> field of the B<recno>(3) manual page for more information.)
ru: При методе доступа B<DB_RECNO> этот флаг служит причиной применения функции I<sync> к файлу btree, лежащему в основе файла recno, а не к самому файлу recno (см. поле I<bfname> в справочной странице B<recno>(3)).

source: I<sync> routines return -1 on error (setting I<errno>) and 0 on success.
ru: Функция I<sync> возвращает -1 при ошибке (меняя при этом значение переменной I<errno>) или 0 при успешном выполнении.

source: Key/data pairs
ru: Пары ключ/данные

source: Access to all file types is based on key/data pairs. Both keys and data are represented by the following data structure:
ru: Доступ ко всем типам файлов основан на парах ключ/данные. Ключ и данные описываются следующей структурой данных:

source: The elements of the I<DBT> structure are defined as follows:
ru: Элементы структуры B<DBT> определяются так:

source: A pointer to a byte string.
ru: Указатель на строку байтов.

source: The length of the byte string.
ru: Размер строки байтов.

source: Key and data byte strings may reference strings of essentially unlimited length although any two of them must fit into available memory at the same time. It should be noted that the access methods provide no guarantees about byte string alignment.
ru: Байтовые строки ключа и данных могут ссылаться на строки практически неограниченной длины, хотя любые две из них должны помещаться в доступной памяти одновременно. Не забывайте, что методы доступа не гарантируют выравнивания байтовых строк.

source: The B<dbopen>() routine may fail and set I<errno> for any of the errors specified for the library routines B<open>(2) and B<malloc>(3) or the following:
ru: Функция B<dbopen>() может завершиться с ошибкой и присвоить переменной I<errno> значения, определённые в библиотечных функциях B<open>(2) и B<malloc>(3), а также дополнительно:

source: A file is incorrectly formatted.
ru: Файл неверного формата.

source: A parameter has been specified (hash function, pad byte, etc.) that is incompatible with the current file specification or which is not meaningful for the function (for example, use of the cursor without prior initialization) or there is a mismatch between the version number of file and the software.
ru: Указанный параметр (функция хэширования, байт заполнения и т. д.) не совместим с текущими установками файла, не имеет смысла для данной функции (например, использование курсора без его предварительной инициализации), или имеется несоответствие версии файла и программного обеспечения.

source: The I<close> routines may fail and set I<errno> for any of the errors specified for the library routines B<close>(2), B<read>(2), B<write>(2), B<free>(3), or B<fsync>(2).
ru: Функция I<close> может завершиться с ошибкой и присвоить переменной I<errno> любое значение из определённых в библиотечных функциях B<close>(2), B<read>(2), B<write>(2), B<free>(3) или B<fsync>(2).

source: The I<del>, I<get>, I<put>, and I<seq> routines may fail and set I<errno> for any of the errors specified for the library routines B<read>(2), B<write>(2), B<free>(3) or B<malloc>(3).
ru: Функции I<del>, I<get>, I<put> и I<seq> могут некорректно завершаться с ошибкой и присвоить переменной I<errno> любое значение из определённых в библиотечных функциях B<read>(2), B<write>(2), B<free>(3) или B<malloc>(3).

source: The I<fd> routines will fail and set I<errno> to B<ENOENT> for in memory databases.
ru: Функция I<fd> может завершиться с ошибкой и присвоить переменной I<errno> значение B<ENOENT> (для баз данных, находящихся в памяти).

source: The I<sync> routines may fail and set I<errno> for any of the errors specified for the library routine B<fsync>(2).
ru: Функции I<sync> могут завершиться с ошибкой и присвоить I<errno> любое значение из определённых для библиотеки функций B<fsync>(2).

source: The typedef I<DBT> is a mnemonic for "data base thang", and was used because no one could think of a reasonable name that wasn't already used.
ru: Название типа B<DBT> является сокращением от «data base thang» и используется в настоящее время, поскольку никто ещё не придумал подходящего для него имени, которое ранее нигде не применялось.

source: The file descriptor interface is a kludge and will be deleted in a future version of the interface.
ru: Доступ через дескриптор файла устарел и будет удалён в будущей версии интерфейса.

source: None of the access methods provide any form of concurrent access, locking, or transactions.
ru: Ни один из методов доступа не предоставляет пользователю каких-либо форм одновременного доступа, блокировок или транкзаций.

source: dlsym, dlvsym - obtain address of a symbol in a shared object or executable
ru: dlsym, dlvsym - возвращает адрес символа из общего объекта или исполняемого файла

source: Link with I<-ldl>.
ru: Компонуется при указании параметра I<-ldl>.

source: The function B<dlsym>() takes a "handle" of a dynamic loaded shared object returned by B<dlopen>(3) along with a null-terminated symbol name, and returns the address where that symbol is loaded into memory. If the symbol is not found, in the specified object or any of the shared objects that were automatically loaded by B<dlopen>(3) when that object was loaded, B<dlsym>() returns NULL. (The search performed by B<dlsym>() is breadth first through the dependency tree of these shared objects.)
ru: Функции B<dlsym>() передаётся «описатель» динамически загруженного объекта, возвращаемого B<dlopen>(3) и имя символа (с null в конце). В результате функция возвращает адрес, по которому символ расположен в памяти. Если символ не найден в указанном объекте или во всех общих объектах, которые были автоматически загружены B<dlopen>(3) на момент загрузки объекта, то B<dlsym>() возвращает NULL (поиск, выполняемый B<dlsym>(), охватывает всё дерево зависимостей этих общих объектов).

source: In unusual cases (see NOTES) the value of the symbol could actually be NULL. Therefore, a NULL return from B<dlsym>() need not indicate an error. The correct way to distinguish an error from a symbol whose value is NULL is to call B<dlerror>(3) to clear any old error conditions, then call B<dlsym>(), and then call B<dlerror>(3) again, saving its return value into a variable, and check whether this saved value is not NULL.
ru: В нестандартных ситуациях (смотрите ЗАМЕЧАНИЯ) в действительности значение символа может быть NULL. Поэтому NULL, возвращаемый B<dlsym>(), ненужно считать ошибкой. Правильным способом определения ошибки, если символ равен NULL, является вызов B<dlerror>(3) для сброса старого состояния ошибки, а затем вызов B<dlsym>(), и повторный вызов B<dlerror>(3), сохранение полученного значения в переменную и проверка этого значения на NULL.

source: There are two special pseudo-handles that may be specified in I<handle>:
ru: Существует два специальных псевдо-описателя, которые можно указать в I<handle>:

source: Find the first occurrence of the desired symbol using the default shared object search order. The search will include global symbols in the executable and its dependencies, as well as symbols in shared objects that were dynamically loaded with the B<RTLD_GLOBAL> flag.
ru: Найти первое появление нужного символа, используя порядок поиска по умолчанию для общего объекта. Поиск выполняется среди глобальных символов исполняемого файла и его зависимостям, а также по символам в общих объектах, которые были динамически загружены с флагом B<RTLD_GLOBAL>.

source: Find the next occurrence of the desired symbol in the search order after the current object. This allows one to provide a wrapper around a function in another shared object, so that, for example, the definition of a function in a preloaded shared object (see B<LD_PRELOAD> in B<ld.so>(8)) can find and invoke the "real" function provided in another shared object (or for that matter, the "next" definition of the function in cases where there are multiple layers of preloading).
ru: Найти следующее появление нужного символа, начиная поиск с текущего объекта. Это позволяет предоставить обёрточную функцию в другой общем объекте, таким образом, что например, определение функции в предварительно загружаемом общем объекте (смотрите B<LD_PRELOAD> в B<ld.so>(8)) может найти и вызвать «реальную» функцию, предоставленную в другом общем объекте (или, что важно, «следующее» определение функции в случаях, когда есть несколько уровней предварительной загрузки).

source: The B<_GNU_SOURCE> feature test macro must be defined in order to obtain the definitions of B<RTLD_DEFAULT> and B<RTLD_NEXT> from I<E<lt>dlfcn.hE<gt>>.
ru: Чтобы получить определения B<RTLD_DEFAULT> и B<RTLD_NEXT> из I<E<lt>dlfcn.hE<gt>>, нужно задать макрос тестирования свойств B<_GNU_SOURCE>.

source: The function B<dlvsym>() does the same as B<dlsym>() but takes a version string as an additional argument.
ru: Функция B<dlvsym>() делает то же самое что и B<dlsym>(), но в качестве дополнительного аргумента ожидает строку версии.

source: On success, these functions return the address associated with I<symbol>. On failure, they return NULL; the cause of the error can be diagnosed using B<dlerror>(3).
ru: При успешном выполнении эти функции возвращают адрес, связанный с I<symbol>. При ошибке возвращается NULL; причину ошибки можно определить с помощью B<dlerror>(3).

source: B<dlsym>() is present in glibc 2.0 and later. B<dlvsym>() first appeared in glibc 2.1.
ru: Функция B<dlsym>() есть в glibc 2.0 и новее. Функция B<dlvsym>() впервые появилась в glibc 2.1.

source: POSIX.1-2001 describes B<dlsym>(). The B<dlvsym>() function is a GNU extension.
ru: В POSIX.1-2001 есть описание B<dlsym>(). Функция B<dlvsym>() является расширением GNU.

source: The value of a symbol returned by B<dlsym>() will never be NULL if the shared object is the result of normal compilation, since a global symbol is never placed at the NULL address. There are nevertheless cases where a lookup using B<dlsym>() may return NULL as the value of a symbol. For example, the symbol value may be the result of a GNU indirect function (IFUNC) resolver function that returns NULL as the resolved value.
ru: Значение символа, возвращаемое B<dlsym>(), никогда не будет равно NULL, если общий объект является результатом нормальной компиляции, так как глобальный символ никогда не размещается по адресу NULL. Тем не менее, есть ситуации, при которых поиск с помощью B<dlsym>() может дать NULL в качестве значения символа. Например, значение символа может быть результатом неявной определительной функции GNU (IFUNC), которая возвращает NULL в качестве определённого значения.

source: History
ru: История

source: The B<dlsym>() function is part of the dlopen API, derived from SunOS. That system does not have B<dlvsym>().
ru: Функция B<dlsym>() является частью программного интерфейса dlopen, возникшего в SunOS. В этой системе нет B<dlvsym>().

source: See B<dlopen>(3).
ru: Смотрите B<dlopen>(3).

source: duplocale - duplicate a locale object
ru: duplocale - создаёт копию объекта локали

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: The B<duplocale>() function creates a duplicate of the locale object referred to by I<locobj>.
ru: Функция B<duplocale>() создаёт копию объекта локали, на которую указывает I<locobj>.

source: If I<locobj> is B<LC_GLOBAL_LOCALE>, B<duplocale>() creates a locale object containing a copy of the global locale determined by B<setlocale>(3).
ru: Если значение I<locobj> равно B<LC_GLOBAL_LOCALE>, то B<duplocale>() создаёт объект локали, содержащий копию глобальной локали, задаваемой B<setlocale>(3).

source: On success, B<duplocale>() returns a handle for the new locale object. On error, it returns I<(locale_t)\ 0>, and sets I<errno> to indicate the cause of the error.
ru: При успешном выполнении B<duplocale>() возвращает описатель нового объекта локали. При ошибке возвращается I<(locale_t)\ 0>, а I<errno> присваивается код ошибки.

source: Insufficient memory to create the duplicate locale object.
ru: Недостаточно памяти для создания копии объекта локали.

source: The B<duplocale>() function first appeared in version 2.3 of the GNU C library.
ru: Функция B<duplocale>() впервые появилась в версии 2.3 библиотеки GNU C.

source: Duplicating a locale can serve the following purposes:
ru: Создание копии локали может пригодиться в следующих случаях:

source: To create a copy of a locale object in which one of more categories are to be modified (using B<newlocale>(3)).
ru: Для создания копии объекта локали, в которой одна или более категорий будут изменены (с помощью B<newlocale>(3)).

source: To obtain a handle for the current locale which can used in other functions that employ a locale handle, such as B<toupper_l>(3). This is done by applying B<duplocale>() to the value returned by the following call:
ru: Для получения описателя текущей локали, который может использоваться в других функциях, таких как B<toupper_l>(3). Для этого B<duplocale>() передаётся значение, полученное от следующего вызова:

source: This technique is necessary, because the above B<uselocale>(3) call may return the value B<LC_GLOBAL_LOCALE>, which results in undefined behavior if passed to functions such as B<toupper_l>(3). Calling B<duplocale>() can be used to ensure that the B<LC_GLOBAL_LOCALE> value is converted into a usable locale object. See EXAMPLE, below.
ru: Такая последовательность необходима, так как вызов B<uselocale>(3) может вернуть значение B<LC_GLOBAL_LOCALE>, которое вызовет непредсказуемое поведение, если будет передано в функции, подобные B<toupper_l>(3). Вызов B<duplocale>() можно использовать для проверки, что значение B<LC_GLOBAL_LOCALE> преобразуется в подходящий объект локали. Смотрите ПРИМЕР далее.

source: Each locale object created by B<duplocale>() should be deallocated using B<freelocale>(3).
ru: Каждый объект локали, созданный B<duplocale>(), должен освобождаться с помощью B<freelocale>(3).

source: The program below uses B<uselocale>(3) and B<duplocale>() to obtain a handle for the current locale which is then passed to B<toupper_l>(3). The program takes one command-line argument, a string of characters that is converted to uppercase and displayed on standard output. An example of its use is the following:
ru: Представленная ниже программа использует B<uselocale>(3) и B<duplocale>() для получения описателя текущей локали, который затем передаётся в B<toupper_l>(3). Программа распознаёт один аргумент командной строки, строку символов, которая приводится к верхнему регистру и выводится в стандартный вывод. Пример использования:

source: if (argc != 2) { fprintf(stderr, "Usage: %s string\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s строка\en", argv[0]); exit(EXIT_FAILURE); }

source: /* This sequence is necessary, because uselocale() might return the value LC_GLOBAL_LOCALE, which can\(aqt be passed as an argument to toupper_l() */
ru: /* Эта последовательность необходима, так как uselocale() может вернуть значение LC_GLOBAL_LOCALE, которое нельзя передавать как аргумент в toupper_l() */

source: drand48, erand48, lrand48, nrand48, mrand48, jrand48, srand48, seed48, lcong48 - generate uniformly distributed pseudo-random numbers
ru: drand48, erand48, lrand48, nrand48, mrand48, jrand48, srand48, seed48, lcong48 - генерация равномерно распределённых псевдослучайных чисел

source: All functions shown above: _XOPEN_SOURCE || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE
ru: Для всех вышеуказанных функций: _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версии Glibc E<lt>= 2.19: */ _SVID_SOURCE

source: These functions generate pseudo-random numbers using the linear congruential algorithm and 48-bit integer arithmetic.
ru: Данные функции генерируют псевдослучайные числа при помощи линейного конгруэнтного метода и арифметики на основе 48-битного целого.

source: The B<drand48>() and B<erand48>() functions return nonnegative double-precision floating-point values uniformly distributed over the interval [0.0,\ 1.0).
ru: Функции B<drand48>() и B<erand48>() возвращают неотрицательное значение в формате с плавающей запятой двойной точности, равномерно распределённые в диапазоне [0.0,\ 1.0).

source: The B<lrand48>() and B<nrand48>() functions return nonnegative long integers uniformly distributed over the interval [0,\ 2^31).
ru: Функции B<lrand48>() и B<nrand48>() возвращают неотрицательные целые числа типа long, равномерно распределённые в интервале [0,\ 2^31).

source: The B<mrand48>() and B<jrand48>() functions return signed long integers uniformly distributed over the interval [-2^31,\ 2^31).
ru: Функции B<mrand48>() и B<jrand48>() возвращают целые числа типа long со знаком, равномерно распределённые в интервале [-2^31,\ 2^31).

source: The B<srand48>(), B<seed48>() and B<lcong48>() functions are initialization functions, one of which should be called before using B<drand48>(), B<lrand48>() or B<mrand48>(). The functions B<erand48>(), B<nrand48>() and B<jrand48>() do not require an initialization function to be called first.
ru: Функции B<srand48>(), B<seed48>() и B<lcong48>() являются функциями-инициализаторами и должны быть вызваны до использования B<drand48>(), B<lrand48>() или B<mrand48>(). Функциям B<erand48>(), B<nrand48>() и B<jrand48>() для первого вызова инициализаторы не требуются.

source: All the functions work by generating a sequence of 48-bit integers, I<Xi>, according to the linear congruential formula:
ru: Все функции работают за счёт генерации последовательности 48-битных целых чисел I<Xi> согласно формуле линейного конгруэнтного метода:

source: B<Xn+1 = (aXn + c) mod m, where n E<gt>= 0>
ru: B<Xn+1 = (aXn + c) mod m, где n E<gt>= 0>

source: The parameter I<m> = 2^48, hence 48-bit integer arithmetic is performed. Unless B<lcong48>() is called, I<a> and I<c> are given by:
ru: Параметр I<m> = 2^48, поэтому в вычислениях используются 48-битные целые числа. Если B<lcong48>() не вызывалась, то I<a> и I<c> принимают следующие значения:

source: The value returned by any of the functions B<drand48>(), B<erand48>(), B<lrand48>(), B<nrand48>(), B<mrand48>() or B<jrand48>() is computed by first generating the next 48-bit I<Xi> in the sequence. Then the appropriate number of bits, according to the type of data item to be returned, is copied from the high-order bits of I<Xi> and transformed into the returned value.
ru: Для получения значения, возвращаемого любой из функций (B<drand48>(), B<erand48>(), B<lrand48>(), B<nrand48>(), B<mrand48>() или B<jrand48>()), сначала генерируется следующее 48-битное I<Xi> в последовательности. Затем подходящее число бит (согласно типу возвращаемых данных) копируется в верхние биты I<Xi> и трансформируется во возвращаемое значение.

source: The functions B<drand48>(), B<lrand48>() and B<mrand48>() store the last 48-bit I<Xi> generated in an internal buffer. The functions B<erand48>(), B<nrand48>() and B<jrand48>() require the calling program to provide storage for the successive I<Xi> values in the array argument I<xsubi>. The functions are initialized by placing the initial value of I<Xi> into the array before calling the function for the first time.
ru: Функции B<drand48>(), B<lrand48>() и B<mrand48>() сохраняют последнее сгенерированное 48-битное значение I<Xi> во внутреннем буфере. Для функций B<erand48>(), B<nrand48>() и B<jrand48>() требуется, чтобы вызывающая программа создавала хранилище для последующих значений I<Xi> и указывала его в аргументе-массиве I<xsubi>. Функции инициализируются путём помещения начального значения I<Xi> в массив до их первого вызова.

source: The initializer function B<srand48>() sets the high order 32-bits of I<Xi> to the argument I<seedval>. The low order 16-bits are set to the arbitrary value 0x330E.
ru: Функция инициализации B<srand48>() устанавливает верхние 32 бита I<Xi> в аргументе I<seedval>. Нижние 16 бит устанавливаются в обязательное значение 0x330E.

source: The initializer function B<seed48>() sets the value of I<Xi> to the 48-bit value specified in the array argument I<seed16v>. The previous value of I<Xi> is copied into an internal buffer and a pointer to this buffer is returned by B<seed48>().
ru: Функция инициализации B<seed48>() устанавливает I<Xi> в 48-битное значение, указанное в аргументе-массиве I<seed16v>. Предыдущее значение I<Xi> копируется во внутренний буфер, указатель на который возвращается B<seed48>().

source: The initialization function B<lcong48>() allows the user to specify initial values for I<Xi>, I<a> and I<c>. Array argument elements I<param[0-2]> specify I<Xi>, I<param[3-5]> specify I<a>, and I<param[6]> specifies I<c>. After B<lcong48>() has been called, a subsequent call to either B<srand48>() or B<seed48>() will restore the standard values of I<a> and I<c>.
ru: Функция инициализации B<lcong48>() позволяет пользователю указывать первоначальные значения для I<Xi>, I<a> и I<c>. Для I<Xi> используется аргумент массива I<param[0-2]>, для I<a> \(em I<param[3-5]>, а для I<c> \(em I<param[6]>. После вызова B<lcong48>() следующий вызов B<srand48>() или B<seed48>() восстановит стандартные значения I<a> и I<c>.

source: The above functions record global state information for the random number generator, so they are not thread-safe.
ru: Перечисленные выше функции записывают информацию о глобальном состоянии генератора случайных чисел, поэтому их нельзя использовать в нескольких нитях одновременно.

source: dlinfo - obtain information about a dynamically loaded object
ru: dlinfo - возвращает информацию о динамически загруженном объекте

source: Link with I<-ldl>.
ru: Компонуется при указании параметра I<-ldl>.
