Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: The I<st_info> field encodes the symbol's type and binding. The type can be extracted using the macro B<ELF64_ST_TYPE(st_info)> (or B<ELF32_ST_TYPE()> on 32-bit platforms), which yields one of the following values:
ru: В поле I<st_info> закодирован тип и привязка символа. Тип можно извлечь с помощью макроса B<ELF64_ST_TYPE(st_info)> (или B<ELF32_ST_TYPE()>, на 32-битных платформах), который возвращает одно из следующих значений:

source: Description
ru: Описание

source: Symbol type is unspecified
ru: тип символа не указан

source: Symbol is a data object
ru: символ является объектом данных

source: Symbol is a code object
ru: символ является объектом кода

source: Symbol associated with a section
ru: символ, связанный с разделом

source: Symbol's name is file name
ru: имя символа является именем файла

source: Symbol is a common data object
ru: символ является объектом общих данных

source: Symbol is thread-local data object
ru: символ является объектом локальных данных нити

source: Symbol is indirect code object
ru: символ является объектом скрытого кода

source: The symbol binding can be extracted from the I<st_info> field using the macro B<ELF64_ST_BIND(st_info)> (or B<ELF32_ST_BIND()> on 32-bit platforms), which yields one of the following values:
ru: Привязку символа можно извлечь из поля I<st_info> с помощью макроса B<ELF64_ST_BIND(st_info)> (или B<ELF32_ST_BIND()>, на 32-битных платформах), который возвращает одно из следующих значений:

source: Local symbol
ru: локальный символ

source: Global symbol
ru: глобальный символ

source: Weak symbol
ru: символ со слабой привязкой

source: Unique symbol
ru: уникальный символ

source: The I<st_other> field contains the symbol's visibility, which can be extracted using the macro B<ELF64_ST_VISIBILITY(st_info)> (or B<ELF32_ST_VISIBILITY()> on 32-bit platforms), which yields one of the following values:
ru: В поле I<st_other> содержится значение видимости символа, которую можно извлечь с помощью макроса B<ELF64_ST_VISIBILITY(st_info)> (или B<ELF32_ST_VISIBILITY()>, на 32-битных платформах), который возвращает одно из следующих значений:

source: Default symbol visibility rules
ru: правила видимости символов по умолчанию

source: Processor-specific hidden class
ru: скрытый класс, зависящий от процессора

source: Symbol unavailable in other modules
ru: Символ недоступен в других модулях

source: Not preemptible, not exported
ru: невыгружаемый, не экспортируется

source: On success, these functions return a nonzero value. If the address specified in I<addr> could be matched to a shared object, but not to a symbol in the shared object, then the I<info-E<gt>dli_sname> and I<info-E<gt>dli_saddr> fields are set to NULL.
ru: При успешном выполнении эти функции возвращают ненулевое значение. Если адрес, указанный в I<addr>, мог бы совпасть с общим объектом, но не с символом в общем объекте, то полям I<info-E<gt>dli_sname> и I<info-E<gt>dli_saddr> присваивается значение NULL.

source: If the address specified in I<addr> could not be matched to a shared object, then these functions return 0. In this case, an error message is I<not> available via B<dlerror>(3).
ru: Если адрес, указанный I<addr>, мог бы совпасть с общим объектом, то эти функции возвращают 0. В этом случае сообщение об ошибке I<не> доступно через B<dlerror>(3).

source: B<dladdr>() is present in glibc 2.0 and later. B<dladdr1>() first appeared in glibc 2.3.3.
ru: Функция B<dladdr>() есть в glibc 2.0 и новее. Функция B<dladdr1>() впервые появилась в glibc 2.3.3.

source: These functions are nonstandard GNU extensions that are also present on Solaris.
ru: Данные функции являются нестандартными расширениями GNU, которые также присутствуют в Solaris.

source: Sometimes, the function pointers you pass to B<dladdr>() may surprise you. On some architectures (notably i386 and x86-64), I<dli_fname> and I<dli_fbase> may end up pointing back at the object from which you called B<dladdr>(), even if the function used as an argument should come from a dynamically linked library.
ru: Иногда указатели на функции, передаваемые в B<dladdr>(), могут вас удивить. На некоторых архитектурах (в частности, i386- и x86-64), I<dli_fname> и I<dli_fbase> могут указывать на объект, из которого вызывалась функция B<dladdr>(), даже если функция, использовавшаяся как аргумент, должна быть из динамически скомпонованной библиотеки.

source: The problem is that the function pointer will still be resolved at compile time, but merely point to the I<plt> (Procedure Linkage Table) section of the original object (which dispatches the call after asking the dynamic linker to resolve the symbol). To work around this, you can try to compile the code to be position-independent: then, the compiler cannot prepare the pointer at compile time any more and B<gcc>(1) will generate code that just loads the final symbol address from the I<got> (Global Offset Table) at run time before passing it to B<dladdr>().
ru: Проблема в том, что указатель на функцию по прежнему ищется во время компиляции, но всего лишь указывает на раздел I<plt> (таблицу компоновки процедур) первоначального объекта (которая размещает вызов после запроса динамического компоновщика на поиск символа). Чтобы обойти это, вы можете попробовать скомпилировать независимый от размещения код: в этом случае компилятор больше не сможет подготовить указатель во время компиляции и B<gcc>(1) создаст код, который просто загрузит конечный адрес символа из I<got> (глобальной таблицы смещений) при запуске до передачи его в B<dladdr>().

source: dlerror - obtain error diagnostic for functions in the dlopen API
ru: dlerror - возвращает справку по ошибке для функций программного интерфейса dlopen

source: The B<dlerror>() function returns a human-readable, null-terminated string describing the most recent error that occurred from a call to one of the functions in the dlopen API since the last call to B<dlerror>(). The returned string does I<not> include a trailing newline.
ru: Функция B<dlerror>() возвращает понятную человеку, строку с null в конце, описывающую последнюю ошибку, которая произошла при вызове одной из функций программного интерфейса dlopen, произошедшего после последнего вызова B<dlerror>(). Возвращаемая строка I<не> содержит символа новой строки в конце.

source: B<dlerror>() returns NULL if no errors have occurred since initialization or since it was last called.
ru: Функция B<dlerror>() возвращает NULL, если ошибок не было с начала инициализации или с момента её последнего вызова.

source: B<dlerror>() is present in glibc 2.0 and later.
ru: Функция B<dlerror>() есть в glibc 2.0 и новее.

source: The message returned by B<dlerror>() may reside in a statically allocated buffer that is overwritten by subsequent B<dlerror>() calls.
ru: Сообщение, возвращаемое B<dlerror>(), может располагаться в статически выделяемом буфере, который перезаписывается последующими вызовами B<dlerror>().

source: This function is part of the dlopen API, derived from SunOS.
ru: Эта функция является частью программного интерфейса dlopen, возникшего в SunOS.

source: dirfd - get directory stream file descriptor
ru: dirfd - получение файлового дескриптора потока каталога

source: /* Since glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: /* начиная с glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* в версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The function B<dirfd>() returns the file descriptor associated with the directory stream I<dirp>.
ru: Функция B<dirfd>() возвращает файловый дескриптор, связанный с потоком каталога I<dirp>.

source: This file descriptor is the one used internally by the directory stream. As a result, it is useful only for functions which do not depend on or alter the file position, such as B<fstat>(2) and B<fchdir>(2). It will be automatically closed when B<closedir>(3) is called.
ru: Этот файловый дескриптор используется внутри функции потоком каталога. В результате он полезен только для функций, которые не зависят и не изменяют положение в файле, например B<fstat>(2) и B<fchdir>(2). Он автоматически закрывается при вызове B<closedir>(3).

source: On success, a nonnegative file descriptor is returned. On error, -1 is returned, and I<errno> is set to indicate the cause of the error.
ru: При успешном выполнении возвращается неотрицательный файловый дескриптор. При ошибке возвращается -1 и I<errno> устанавливается в соответствующее значение.

source: POSIX.1-2008 specifies two errors, neither of which is returned by the current implementation.
ru: В POSIX.1-2008 определены две ошибки, ни одна из которых не возвращается текущей реализацией.

source: I<dirp> does not refer to a valid directory stream.
ru: Значение I<dirp> не указывает на допустимый поток каталога.

source: The implementation does not support the association of a file descriptor with a directory.
ru: Реализация не поддерживает связь файлового дескриптора с каталогом.

source: POSIX.1-2008. This function was a BSD extension, present in 4.3BSD-Reno, not in 4.2BSD.
ru: POSIX.1-2008. Данная функция была расширением BSD, появилась в 4.3BSD-Reno, не в 4.2BSD.
