Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: The B<dlinfo>() function obtains information about the dynamically loaded object referred to by I<handle> (typically obtained by an earlier call to B<dlopen>(3) or B<dlmopen>(3)). The I<request> argument specifies which information is to be returned. The I<info> argument is a pointer to a buffer used to store information returned by the call; the type of this argument depends on I<request>.
ru: Функция B<dlinfo>() возвращает информацию о динамически загруженном объекте, на который указывает I<handle> (обычно полученный ранее вызовом B<dlopen>(3) или B<dlmopen>(3)). В аргументе I<request> указывается какую информацию нужно получить. Аргумент I<info> — указатель на буфер для хранения информации, возвращаемой вызовом; тип данного аргумента зависит от I<request>.

source: The following values are supported for I<request> (with the corresponding type for I<info> shown in parentheses):
ru: Для I<request> поддерживаются следующие значения (соответствующий тип I<info> показан в скобках):

source: Obtain the ID of the link-map list (namespace) in which I<handle> is loaded.
ru: Возвратить ID списка карты связи (link-map list, пространство имён), в который загружен I<handle>.

source: Obtain a pointer to the I<link_map> structure corresponding to I<handle>. The I<info> argument points to a pointer to a I<link_map> structure, defined in I<E<lt>link.hE<gt>> as:
ru: Возвратить указатель на структуру I<link_map>, соответствующую I<handle>. Аргумент I<info> указывает на указатель на структуру I<link_map>, определённую в I<E<lt>link.hE<gt>> следующим образом:

source: struct link_map { ElfW(Addr) l_addr; /* Difference between the address in the ELF file and the address in memory */ char *l_name; /* Absolute pathname where object was found */ ElfW(Dyn) *l_ld; /* Dynamic section of the shared object */ struct link_map *l_next, *l_prev; /* Chain of loaded objects */
ru: struct link_map { ElfW(Addr) l_addr; /* разница между адресом в файле ELF и адресом в памяти */ char *l_name; /* абсолютный путь, где был найден объект */ ElfW(Dyn) *l_ld; /* динамический раздел общего объекта */ struct link_map *l_next, *l_prev; /* цепочка загруженных объектов */

source: /* Plus additional fields private to the implementation */ };
ru: /* дополнительные поля, зависящие от реализации */ };

source: Copy the pathname of the origin of the shared object corresponding to I<handle> to the location pointed to by I<info>.
ru: Скопировать путь источника общего объекта соответствующего I<handle> в место, указанное I<info>.

source: Obtain the library search paths for the shared object referred to by I<handle>. The I<info> argument is a pointer to a I<Dl_serinfo> that contains the search paths. Because the number of search paths may vary, the size of the structure pointed to by I<info> can vary. The B<RTLD_DI_SERINFOSIZE> request described below allows applications to size the buffer suitably. The caller must perform the following steps:
ru: Возвратить пути поиска библиотек общего объекта, на который указывает I<handle>. Аргумент I<info> — указатель на I<Dl_serinfo> с путями поиска. Так как количество путей поиска может быть разным, то размер структуры, на которую указывает I<info>, может быть различным. Запрос B<RTLD_DI_SERINFOSIZE>, описанный далее, позволяет приложению установить подходящий размер. Вызывающий должен выполнить следующие шаги:

source: Use a B<RTLD_DI_SERINFOSIZE> request to populate a I<Dl_serinfo> structure with the size (I<dls_size>) of the structure needed for the subsequent B<RTLD_DI_SERINFO> request.
ru: Использовать запрос B<RTLD_DI_SERINFOSIZE> для заполнения структуры I<Dl_serinfo> размером (I<dls_size>) структуры, необходимой для последующего запроса B<RTLD_DI_SERINFO>.

source: Allocate a I<Dl_serinfo> buffer of the correct size (I<dls_size>).
ru: Выделить буфер I<Dl_serinfo> правильного размера (I<dls_size>).

source: Use a further B<RTLD_DI_SERINFOSIZE> request to populate the I<dls_size> and I<dls_cnt> fields of the buffer allocated in the previous step.
ru: Использовать запрос B<RTLD_DI_SERINFOSIZE> для заполнения полей I<dls_size> и I<dls_cnt> буфера, выделенного на предыдущем шаге.

source: Use a B<RTLD_DI_SERINFO> to obtain the library search paths.
ru: Использовать B<RTLD_DI_SERINFO> для получения путей поиска библиотек.

source: The I<Dl_serinfo> structure is defined as follows:
ru: Структура I<Dl_serinfo> определена следующим образом:

source: typedef struct { size_t dls_size; /* Size in bytes of the whole buffer */ unsigned int dls_cnt; /* Number of elements in 'dls_serpath' */ Dl_serpath dls_serpath[1]; /* Actually longer, 'dls_cnt' elements */ } Dl_serinfo;
ru: typedef struct { size_t dls_size; /* размер в байтах всего буфера */ unsigned int dls_cnt; /* количество элементов в «dls_serpath» */ Dl_serpath dls_serpath[1]; /* на самом деле больше, элементы «dls_cnt» */ } Dl_serinfo;

source: Each of the I<dls_serpath> elements in the above structure is a structure of the following form:
ru: Каждый из элементов I<dls_serpath>, в упомянутой выше структуре, представляет собой структуру следующего вида:

source: typedef struct { char *dls_name; /* Name of library search path directory */ unsigned int dls_flags; /* Indicates where this directory came from */ } Dl_serpath;
ru: typedef struct { char *dls_name; /* имя каталога в путях поиска библиотек */ unsigned int dls_flags; /* показывает, откуда возник каталог */ } Dl_serpath;

source: The I<dls_flags> field is currently unused, and always contains zero.
ru: Поле I<dls_flags> в настоящее время не используется и всегда равно нулю.

source: Populate the I<dls_size> and I<dls_cnt> fields of the I<Dl_serinfo> structure pointed to by I<info> with values suitable for allocating a buffer for use in a subsequent B<RTLD_DI_SERINFO> request.
ru: Заполнить поля I<dls_size> и I<dls_cnt> структуры I<Dl_serinfo>, на которую указывает I<info>, значениями, подходящими для выделения буфера, который будет использоваться в последующем запросе B<RTLD_DI_SERINFO>.

source: B<RTLD_DI_TLS_MODID> (I<size_t *>, since glibc 2.4)
ru: B<RTLD_DI_TLS_MODID> (I<size_t *>, начиная с glibc 2.4)

source: Obtain the module ID of this shared object's TLS (thread-local storage) segment, as used in TLS relocations. If this object does not define a TLS segment, zero is placed in I<*info>.
ru: Получить ID модуля сегмента TLS (локальное хранилище нити) общего объекта, которое используется в перемещениях TLS. Если этот объект не задаёт сегмент TLS, то в I<*info> помещается ноль.

source: B<RTLD_DI_TLS_DATA> (I<void **>, since glibc 2.4)
ru: B<RTLD_DI_TLS_DATA> (I<void **>, начиная с glibc 2.4)

source: Obtain a pointer to the calling thread's TLS block corresponding to this shared object's TLS segment. If this object does not define a PT_TLS segment, or if the calling thread has not allocated a block for it, NULL is placed in I<*info>.
ru: Получить указатель на блок TLS вызывающей нити, соответствующий этому сегменту TLS общего объекта. Если этот объект не задаёт сегмент PT_TLS, или если у вызывающей нити для этого не выделен блок, то в I<*info> помещается NULL.

source: On success, B<dlinfo>() returns 0. On failure, it returns -1; the cause of the error can be diagnosed using B<dlerror>(3).
ru: При успешном выполнении B<dlinfo>() возвращает 0. При ошибке возвращается -1; причину ошибки можно узнать с помощью B<dlerror>(3).

source: B<dlinfo>() first appeared in glibc 2.3.3.
ru: Функция B<dlinfo>() впервые появилась в glibc версии 2.3.3.

source: This function is a nonstandard GNU extension.
ru: Эта функция является нестандартным расширением GNU.

source: This function derives from the Solaris function of the same name and also appears on some other systems. The sets of requests supported by the various implementations overlaps only partially.
ru: Данная функция произошла от функции Solaris с тем же именем, а также есть в некоторых других системах. Набор запросов, поддерживаемых различными реализациями, перекрывается лишь частично.

source: The program below opens a shared objects using B<dlopen>(3) and then uses the B<RTLD_DI_SERINFOSIZE> and B<RTLD_DI_SERINFO> requests to obtain the library search path list for the library. Here is an example of what we might see when running the program:
ru: Программа, показанная ниже, открывает общие объекты с помощью B<dlopen>(3), а затем использует запросы B<RTLD_DI_SERINFOSIZE> и B<RTLD_DI_SERINFO> для получения библиотеки из списка путей поиска библиотек. Пример вывода работы программы:

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>libpathE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s E<lt>libpathE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Obtain a handle for shared object specified on command line */
ru: /* получаем описатель общего объекта, указанного в командной строке */

source: handle = dlopen(argv[1], RTLD_NOW); if (handle == NULL) { fprintf(stderr, "dlopen() failed: %s\en", dlerror()); exit(EXIT_FAILURE); }
ru: handle = dlopen(argv[1], RTLD_NOW); if (handle == NULL) { fprintf(stderr, "ошибка dlopen(): %s\en", dlerror()); exit(EXIT_FAILURE); }

source: /* Discover the size of the buffer that we must pass to RTLD_DI_SERINFO */
ru: /* определяем размер буфера, который мы должны передать RTLD_DI_SERINFO */

source: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, &serinfo) == -1) { fprintf(stderr, "RTLD_DI_SERINFOSIZE failed: %s\en", dlerror()); exit(EXIT_FAILURE); }
ru: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, &serinfo) == -1) { fprintf(stderr, "ошибка RTLD_DI_SERINFOSIZE: %s\en", dlerror()); exit(EXIT_FAILURE); }

source: /* Allocate the buffer for use with RTLD_DI_SERINFO */
ru: /* выделяем буфер для RTLD_DI_SERINFO */

source: /* Initialize the \(aqdls_size\(aq and \(aqdls_cnt\(aq fields in the newly allocated buffer */
ru: /* инициализируем поля \(aqdls_size\(aq и \(aqdls_cnt\(aq в только что выделенном буфере */

source: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, sip) == -1) { fprintf(stderr, "RTLD_DI_SERINFOSIZE failed: %s\en", dlerror()); exit(EXIT_FAILURE); }
ru: if (dlinfo(handle, RTLD_DI_SERINFOSIZE, sip) == -1) { fprintf(stderr, "ошибка RTLD_DI_SERINFOSIZE: %s\en", dlerror()); exit(EXIT_FAILURE); }

source: /* Fetch and print library search list */
ru: /* получаем и печатаем список поиска библиотек */

source: if (dlinfo(handle, RTLD_DI_SERINFO, sip) == -1) { fprintf(stderr, "RTLD_DI_SERINFO failed: %s\en", dlerror()); exit(EXIT_FAILURE); }
ru: if (dlinfo(handle, RTLD_DI_SERINFO, sip) == -1) { fprintf(stderr, "ошибка RTLD_DI_SERINFO: %s\en", dlerror()); exit(EXIT_FAILURE); }

source: difftime - calculate time difference
ru: difftime - вычисляет разницу во времени

source: The B<difftime>() function returns the number of seconds elapsed between time I<time1> and time I<time0>, represented as a I<double>. Each of the times is specified in calendar time, which means its value is a measurement (in seconds) relative to the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
ru: Функция B<difftime>() возвращает количество секунд, прошедших со времени I<time1> и до времени I<time0>, представленного типом I<double>. Оба времени должны быть календарным временем, т. е. временем (в секундах), прошедшем с начала эпохи (с 00:00:00 1 января 1970 года всеобщего скоординированного времени (UTC)).

source: On a POSIX system, I<time_t> is an arithmetic type, and one could just define
ru: В системе POSIX значение I<time_t> является числом и функция может быть просто определена как

source: when the possible overflow in the subtraction is not a concern.
ru: когда возможное переполнение при вычитании не проблема.

source: dysize - get number of days for a given year
ru: dysize - возвращает количество дней в указанном году

source: B<dysize>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<dysize>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: The function returns 365 for a normal year and 366 for a leap year. The calculation for leap year is based on:
ru: Функция возвращает 365 для обычного года и 366 — для високосного. Подсчёт високосного года основан на формуле:

source: The formula is defined in the macro I<__isleap(year)> also found in I<E<lt>time.hE<gt>>.
ru: Формула определена в макросе I<__isleap(year)>, также находящемся в I<E<lt>time.hE<gt>>.

source: This function occurs in SunOS 4.x.
ru: Функция появилась в SunOS 4.x.

source: This is a compatibility function only. Don't use it in new programs.
ru: Функция введена только для совместимости. Не используйте её в новых программах.

source: div, ldiv, lldiv, imaxdiv - compute quotient and remainder of an integer division
ru: div, ldiv, lldiv, imaxdiv - вычисляет частное и остаток деления целого числа

source: The B<div>() function computes the value I<numerator>/I<denominator> and returns the quotient and remainder in a structure named I<div_t> that contains two integer members (in unspecified order) named I<quot> and I<rem>. The quotient is rounded toward zero. The result satisfies I<quot>*I<denominator>+I<rem> = I<numerator>.
ru: Функция B<div>() вычисляет величину I<numerator>/I<denominator> и возвращает частное и остаток в структуре I<div_t>, которая содержит два целочисленных поля (в неопределённом порядке) I<quot> и I<rem>. Частное округляется до ближайшего нуля. Результат равняется I<quot>*I<denominator>+I<rem> = I<numerator>.

source: The B<ldiv>(), B<lldiv>(), and B<imaxdiv>() functions do the same, dividing numbers of the indicated type and returning the result in a structure of the indicated name, in all cases with fields I<quot> and I<rem> of the same type as the function arguments.
ru: Функции B<ldiv>(), B<lldiv>() и B<imaxdiv>() выполняют эту же функцию, деля числа соответствующего типа и возвращая результат в структуре с соответствующим именем, всегда с полями I<quot> и I<rem> того же типа, что и аргументы функции.

source: The I<div_t> (etc.) structure.
ru: Структура I<div_t> (и т. д.).

source: POSIX.1-2001, POSIX.1-2008, C89, C99, SVr4, 4.3BSD. The functions B<lldiv>() and B<imaxdiv>() were added in C99.
ru: POSIX.1-2001, POSIX.1-2008, C89, C99, SVr4, 4.3BSD. Функции B<lldiv>() и B<imaxdiv>() добавлены в C99.

source: After
ru: После

source: the values I<q.quot> and I<q.rem> are -1 and -2, respectively.
ru: значения I<q.quot> и I<q.rem> равны -1 и -2, соответственно.

source: dlclose, dlopen, dlmopen - open and close a shared object
ru: dlclose, dlopen, dlmopen - открывает и закрывает общий объект

source: The function B<dlopen>() loads the dynamic shared object (shared library) file named by the null-terminated string I<filename> and returns an opaque "handle" for the loaded object. This handle is employed with other functions in the dlopen API, such as B<dlsym>(3), B<dladdr>(3), B<dlinfo>(3), and B<dlclose>().
ru: Функция B<dlopen>() загружает динамический общий объект (общую библиотеку) из файла, имя которого указано в строке I<filename> (завершается null) и возвращает скрытный описатель на загруженный объект. Данный описатель используется другими функциями программного интерфейса dlopen, такими как B<dlsym>(3), B<dladdr>(3), B<dlinfo>(3) и B<dlclose>().

source: If I<filename> is NULL, then the returned handle is for the main program. If I<filename> contains a slash ("/"), then it is interpreted as a (relative or absolute) pathname. Otherwise, the dynamic linker searches for the object as follows (see B<ld.so>(8) for further details):
ru: Если I<filename> равно NULL, то возвращается описатель основной программы. Если I<filename> содержит косую черту («/»), то это воспринимается как имя с путём (относительным или абсолютным). Иначе динамический компоновщик ищет объект в следующих местах (подробности смотрите в B<ld.so>(8)):

source: (ELF only) If the executable file for the calling program contains a DT_RPATH tag, and does not contain a DT_RUNPATH tag, then the directories listed in the DT_RPATH tag are searched.
ru: (только в ELF) Если исполняемый файл вызывающей программы содержит метку DT_RPATH, т не содержит метки DT_RUNPATH, то производится поиск в каталогах, описанных в метке DT_RPATH.

source: If, at the time that the program was started, the environment variable B<LD_LIBRARY_PATH> was defined to contain a colon-separated list of directories, then these are searched. (As a security measure, this variable is ignored for set-user-ID and set-group-ID programs.)
ru: Если при запуске программы была определена переменная окружения B<LD_LIBRARY_PATH>, содержащая список каталогов через двоеточие, то производится поиск в этих каталогах (по соображениям безопасности эта переменная игнорируется для программ с установленными битами set-user-ID и set-group-ID).

source: (ELF only) If the executable file for the calling program contains a DT_RUNPATH tag, then the directories listed in that tag are searched.
ru: (только в ELF) Если исполняемый файл вызывающей программы содержит метку DT_RUNPATH, то производится поиск по каталогам, перечисленным в этой метке.

source: The cache file I</etc/ld.so.cache> (maintained by B<ldconfig>(8)) is checked to see whether it contains an entry for I<filename>.
ru: Производится проверка в кэширующем файле I</etc/ld.so.cache> (обслуживается B<ldconfig>(8)) на предмет наличия записи для I<filename>.

source: The directories I</lib> and I</usr/lib> are searched (in that order).
ru: Просматриваются каталоги I</lib> и I</usr/lib> (именно в таком порядке).

source: If the object specified by I<filename> has dependencies on other shared objects, then these are also automatically loaded by the dynamic linker using the same rules. (This process may occur recursively, if those objects in turn have dependencies, and so on.)
ru: Если объект, указанный I<filename>, зависит от других общих объектов, то они также автоматически загружаются динамическим компоновщиком согласно этим же правилам (процесс может выполняться рекурсивно, если эти объекты, в свою очередь, зависят от других, и так далее).

source: One of the following two values must be included in I<flags>:
ru: В I<flags> должно быть одно из двух следующих значений:

source: Perform lazy binding. Resolve symbols only as the code that references them is executed. If the symbol is never referenced, then it is never resolved. (Lazy binding is performed only for function references; references to variables are always immediately bound when the shared object is loaded.) Since glibc 2.1.1, this flag is overridden by the effect of the B<LD_BIND_NOW> environment variable.
ru: Выполнять позднее связывание (lazy binding). Выполняется поиск только тех символов, на которые есть ссылки из кода. Если на символ никогда не ссылаются, то он никогда не будет разрешён (позднее связывание выполняется только при ссылке на функции; ссылки на переменные всегда привязываются сразу при загрузке общего объекта). Начиная с libc 2.1.1, этот флаг заменяется на значение переменной окружения B<LD_BIND_NOW>.

source: If this value is specified, or the environment variable B<LD_BIND_NOW> is set to a nonempty string, all undefined symbols in the shared object are resolved before B<dlopen>() returns. If this cannot be done, an error is returned.
ru: Если указано данное значение или переменная окружения B<LD_BIND_NOW> не пуста, то все неопределённые символы в общем объекте ищутся до возврата из B<dlopen>(). Если этого сделать не удаётся, то возвращается ошибка.

source: Zero or more of the following values may also be ORed in I<flags>:
ru: Также в В I<flags> может быть ноль или более значение, объединяемых по ИЛИ:

source: The symbols defined by this shared object will be made available for symbol resolution of subsequently loaded shared objects.
ru: Символы, определённые в этом общем объекте, будут доступны при поиске символов, для общих объектов, загружаемых далее.

source: This is the converse of B<RTLD_GLOBAL>, and the default if neither flag is specified. Symbols defined in this shared object are not made available to resolve references in subsequently loaded shared objects.
ru: Противоположность B<RTLD_GLOBAL>, используется по умолчанию, если не задано ни одного флага. Символы, определённые в этом общем объекте, не будут доступны при разрешении ссылок для общих объектов, загружаемых далее.

source: B<RTLD_NODELETE> (since glibc 2.2)
ru: B<RTLD_NODELETE> (начиная с glibc 2.2)

source: Do not unload the shared object during B<dlclose>(). Consequently, the object's static and global variables are not reinitialized if the object is reloaded with B<dlopen>() at a later time.
ru: Не выгружать общий объект при B<dlclose>(). В результате статические и глобальные переменные объекта не инициализируются повторно, если объект загружается снова по B<dlopen>().

source: B<RTLD_NOLOAD> (since glibc 2.2)
ru: B<RTLD_NOLOAD> (начиная с glibc 2.2)

source: Don't load the shared object. This can be used to test if the object is already resident (B<dlopen>() returns NULL if it is not, or the object's handle if it is resident). This flag can also be used to promote the flags on a shared object that is already loaded. For example, a shared object that was previously loaded with B<RTLD_LOCAL> can be reopened with B<RTLD_NOLOAD\ |\ RTLD_GLOBAL>.
ru: Не загружать общий объект. Это можно использовать для тестирования того, что объект уже загружен (B<dlopen>() возвращает NULL, если нет, или описатель объекта в противном случае). Данный флаг также можно использовать для изменения флагов уже загруженного объекта. Например, общий объект, который был загружен ранее с B<RTLD_LOCAL>, можно открыть повторно с B<RTLD_NOLOAD\ |\ RTLD_GLOBAL>.

source: B<RTLD_DEEPBIND> (since glibc 2.3.4)
ru: B<RTLD_DEEPBIND> (начиная с glibc 2.3.4)

source: Place the lookup scope of the symbols in this shared object ahead of the global scope. This means that a self-contained object will use its own symbols in preference to global symbols with the same name contained in objects that have already been loaded.
ru: Задать объекта, в котором поиск символов будет осуществляться перед поиском в области глобальных символов. Это означает, что самодостаточный объект будет использовать свои собственные символы вместо глобальных символов с тем же именем, содержащихся в объектах, которые уже были загружены.

source: If I<filename> is NULL, then the returned handle is for the main program. When given to B<dlsym>(), this handle causes a search for a symbol in the main program, followed by all shared objects loaded at program startup, and then all shared objects loaded by B<dlopen>() with the flag B<RTLD_GLOBAL>.
ru: Если значение I<filename> равно NULL, то возвращается описатель для главной программы. При передаче в B<dlsym>(), этот описатель вызывает поиск символа в главной программе, затем во все общих объектах, загруженных при запуске программы, и затем во всех общих объектах, загруженных B<dlopen>() с флагом B<RTLD_GLOBAL>.

source: Symbol references in the shared object are resolved using (in order): symbols in the link map of objects loaded for the main program and its dependencies; symbols in shared objects (and their dependencies) that were previously opened with B<dlopen>() using the B<RTLD_GLOBAL> flag; and definitions in the shared object itself (and any dependencies that were loaded for that object).
ru: Поиск символьных ссылок общего объекта производится следующим образом (в таком порядке): символы в карте ссылок объектов, загруженных для главной программы и её зависимостей; символы в общих объектах (и их зависимостях), которые были открыты ранее с помощью B<dlopen>() и флага B<RTLD_GLOBAL>; определения в самом общем объекте (и любых зависимостях, которые были загружены для этого объекта).
