Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: Possible values for I<p_type> include the following (see I<E<lt>elf.hE<gt>> for further details):
ru: Возможными значениями I<p_type> поля могут быть (подробности смотрите в I<E<lt>elf.hE<gt>>):

source: #define PT_LOAD 1 /* Loadable program segment */ #define PT_DYNAMIC 2 /* Dynamic linking information */ #define PT_INTERP 3 /* Program interpreter */ #define PT_NOTE 4 /* Auxiliary information */ #define PT_SHLIB 5 /* Reserved */ #define PT_PHDR 6 /* Entry for header table itself */ #define PT_TLS 7 /* Thread-local storage segment */ #define PT_GNU_EH_FRAME 0x6474e550 /* GCC .eh_frame_hdr segment */ #define PT_GNU_STACK 0x6474e551 /* Indicates stack executability */ #define PT_GNU_RELRO 0x6474e552 /* Read-only after relocation */
ru: #define PT_LOAD 1 /* загружаемый сегмент программы */ #define PT_DYNAMIC 2 /* информация о динамической компоновке */ #define PT_INTERP 3 /* интерпретатор программы */ #define PT_NOTE 4 /* вспомогательная информация */ #define PT_SHLIB 5 /* зарезервировано */ #define PT_PHDR 6 /* сам элемент таблицы заголовков */ #define PT_TLS 7 /* сегмент локального хранилища нити */ #define PT_GNU_EH_FRAME 0x6474e550 /* сегмент GCC .eh_frame_hdr */ #define PT_GNU_STACK 0x6474e551 /* показывает, что стек — исполняемый */ #define PT_GNU_RELRO 0x6474e552 /* только чтения после перемещения */

source: The B<dl_iterate_phdr>() function returns whatever value was returned by the last call to I<callback>.
ru: Функция B<dl_iterate_phdr>() возвращает значение, которое было получено в результате последнего вызова I<callback>.

source: B<dl_iterate_phdr>() has been supported in glibc since version 2.2.4.
ru: Функция B<dl_iterate_phdr>() доступна в glibc начиная с версии 2.2.4.

source: The B<dl_iterate_phdr>() function is not specified in any standard. Various other systems provide a version of this function, although details of the returned I<dl_phdr_info> structure differ. On the BSDs and Solaris, the structure includes the fields I<dlpi_addr>, I<dlpi_name>, I<dlpi_phdr>, and I<dlpi_phnum> in addition to other implementation-specific fields.
ru: Функция B<dl_iterate_phdr>() не описана в каком-либо стандарте. Эта функция есть в некоторых других системах, при чём возвращаемая структура I<dl_phdr_info> имеет другой формат. В BSD и Solaris, в структуре есть поля I<dlpi_addr>, I<dlpi_name>, I<dlpi_phdr> и I<dlpi_phnum> (помимо других внесённых реализацией полей).

source: Future versions of the C library may add further fields to the I<dl_phdr_info> structure; in that event, the I<size> argument provides a mechanism for the callback function to discover whether it is running on a system with added fields.
ru: В будущих версиях библиотеки C в структуре I<dl_phdr_info> могут появиться дополнительные поля; для этого случая предусмотрен аргумент I<size>, который предоставляет вызываемой функции механизм обнаружения того, что она работает в системе с добавленными полями.

source: The first object visited by I<callback> is the main program. For the main program, the I<dlpi_name> field will be an empty string.
ru: Первый объект, просматриваемый I<callback>, это главная программа. У главной программы поле I<dlpi_name> будет содержать пустую строку.

source: EXAMPLE
ru: ПРИМЕР

source: The following program displays a list of pathnames of the shared objects it has loaded. For each shared object, the program lists some information (virtual address, size, flags, and type) for each of the objects ELF segments.
ru: Следующая программа выводит список путей общих объектов, из которых они были загружены. Для каждого общего объекта программа выводит информацию из каждого сегмента объектов ELF (виртуальный адрес, размер, флаги и тип).

source: The following shell session demonstrates the output produced by the program on an x86-64 system. The first shared object for which output is displayed (where the name is an empty string) is the main program.
ru: В следующем сеансе оболочки показан вывод программы, запущенной в системе с архитектурой x86-64. Первый показанный общий объект это основная программа (вместо имени пустая строка).

source: $ B<./a.out> Name: "" (9 segments) 0: [ 0x400040; memsz: 1f8] flags: 0x5; PT_PHDR 1: [ 0x400238; memsz: 1c] flags: 0x4; PT_INTERP 2: [ 0x400000; memsz: ac4] flags: 0x5; PT_LOAD 3: [ 0x600e10; memsz: 240] flags: 0x6; PT_LOAD 4: [ 0x600e28; memsz: 1d0] flags: 0x6; PT_DYNAMIC 5: [ 0x400254; memsz: 44] flags: 0x4; PT_NOTE 6: [ 0x400970; memsz: 3c] flags: 0x4; PT_GNU_EH_FRAME 7: [ (nil); memsz: 0] flags: 0x6; PT_GNU_STACK 8: [ 0x600e10; memsz: 1f0] flags: 0x4; PT_GNU_RELRO Name: "linux-vdso.so.1" (4 segments) 0: [0x7ffc6edd1000; memsz: e89] flags: 0x5; PT_LOAD 1: [0x7ffc6edd1360; memsz: 110] flags: 0x4; PT_DYNAMIC 2: [0x7ffc6edd17b0; memsz: 3c] flags: 0x4; PT_NOTE 3: [0x7ffc6edd17ec; memsz: 3c] flags: 0x4; PT_GNU_EH_FRAME Name: "/lib64/libc.so.6" (10 segments) 0: [0x7f55712ce040; memsz: 230] flags: 0x5; PT_PHDR 1: [0x7f557145b980; memsz: 1c] flags: 0x4; PT_INTERP 2: [0x7f55712ce000; memsz: 1b6a5c] flags: 0x5; PT_LOAD 3: [0x7f55716857a0; memsz: 9240] flags: 0x6; PT_LOAD 4: [0x7f5571688b80; memsz: 1f0] flags: 0x6; PT_DYNAMIC 5: [0x7f55712ce270; memsz: 44] flags: 0x4; PT_NOTE 6: [0x7f55716857a0; memsz: 78] flags: 0x4; PT_TLS 7: [0x7f557145b99c; memsz: 544c] flags: 0x4; PT_GNU_EH_FRAME 8: [0x7f55712ce000; memsz: 0] flags: 0x6; PT_GNU_STACK 9: [0x7f55716857a0; memsz: 3860] flags: 0x4; PT_GNU_RELRO Name: "/lib64/ld-linux-x86-64.so.2" (7 segments) 0: [0x7f557168f000; memsz: 20828] flags: 0x5; PT_LOAD 1: [0x7f55718afba0; memsz: 15a8] flags: 0x6; PT_LOAD 2: [0x7f55718afe10; memsz: 190] flags: 0x6; PT_DYNAMIC 3: [0x7f557168f1c8; memsz: 24] flags: 0x4; PT_NOTE 4: [0x7f55716acec4; memsz: 604] flags: 0x4; PT_GNU_EH_FRAME 5: [0x7f557168f000; memsz: 0] flags: 0x6; PT_GNU_STACK 6: [0x7f55718afba0; memsz: 460] flags: 0x4; PT_GNU_RELRO
ru: $ B<./a.out> Имя: "" (9 сегментов) 0: [ 0x400040; memsz: 1f8] flags: 0x5; PT_PHDR 1: [ 0x400238; memsz: 1c] flags: 0x4; PT_INTERP 2: [ 0x400000; memsz: ac4] flags: 0x5; PT_LOAD 3: [ 0x600e10; memsz: 240] flags: 0x6; PT_LOAD 4: [ 0x600e28; memsz: 1d0] flags: 0x6; PT_DYNAMIC 5: [ 0x400254; memsz: 44] flags: 0x4; PT_NOTE 6: [ 0x400970; memsz: 3c] flags: 0x4; PT_GNU_EH_FRAME 7: [ (nil); memsz: 0] flags: 0x6; PT_GNU_STACK 8: [ 0x600e10; memsz: 1f0] flags: 0x4; PT_GNU_RELRO Имя: "linux-vdso.so.1" (4 сегментов) 0: [0x7ffc6edd1000; memsz: e89] flags: 0x5; PT_LOAD 1: [0x7ffc6edd1360; memsz: 110] flags: 0x4; PT_DYNAMIC 2: [0x7ffc6edd17b0; memsz: 3c] flags: 0x4; PT_NOTE 3: [0x7ffc6edd17ec; memsz: 3c] flags: 0x4; PT_GNU_EH_FRAME Имя: "/lib64/libc.so.6" (10 сегментов) 0: [0x7f55712ce040; memsz: 230] flags: 0x5; PT_PHDR 1: [0x7f557145b980; memsz: 1c] flags: 0x4; PT_INTERP 2: [0x7f55712ce000; memsz: 1b6a5c] flags: 0x5; PT_LOAD 3: [0x7f55716857a0; memsz: 9240] flags: 0x6; PT_LOAD 4: [0x7f5571688b80; memsz: 1f0] flags: 0x6; PT_DYNAMIC 5: [0x7f55712ce270; memsz: 44] flags: 0x4; PT_NOTE 6: [0x7f55716857a0; memsz: 78] flags: 0x4; PT_TLS 7: [0x7f557145b99c; memsz: 544c] flags: 0x4; PT_GNU_EH_FRAME 8: [0x7f55712ce000; memsz: 0] flags: 0x6; PT_GNU_STACK 9: [0x7f55716857a0; memsz: 3860] flags: 0x4; PT_GNU_RELRO Имя: "/lib64/ld-linux-x86-64.so.2" (7 сегментов) 0: [0x7f557168f000; memsz: 20828] flags: 0x5; PT_LOAD 1: [0x7f55718afba0; memsz: 15a8] flags: 0x6; PT_LOAD 2: [0x7f55718afe10; memsz: 190] flags: 0x6; PT_DYNAMIC 3: [0x7f557168f1c8; memsz: 24] flags: 0x4; PT_NOTE 4: [0x7f55716acec4; memsz: 604] flags: 0x4; PT_GNU_EH_FRAME 5: [0x7f557168f000; memsz: 0] flags: 0x6; PT_GNU_STACK 6: [0x7f55718afba0; memsz: 460] flags: 0x4; PT_GNU_RELRO

source: Program source
ru: Исходный код программы

source: printf("Name: \e"%s\e" (%d segments)\en", info-E<gt>dlpi_name, info-E<gt>dlpi_phnum);
ru: printf("Имя: \e"%s\e" (%d сегментов)\en", info-E<gt>dlpi_name, info-E<gt>dlpi_phnum);

source: printf(" %2d: [%14p; memsz:%7lx] flags: 0x%x; ", j, (void *) (info-E<gt>dlpi_addr + info-E<gt>dlpi_phdr[j].p_vaddr), info-E<gt>dlpi_phdr[j].p_memsz, info-E<gt>dlpi_phdr[j].p_flags); if (type != NULL) printf("%s\en", type); else printf("[other (0x%x)]\en", p_type); }
ru: printf(" %2d: [%14p; memsz:%7lx] flags: 0x%x; ", j, (void *) (info-E<gt>dlpi_addr + info-E<gt>dlpi_phdr[j].p_vaddr), info-E<gt>dlpi_phdr[j].p_memsz, info-E<gt>dlpi_phdr[j].p_flags); if (type != NULL) printf("%s\en", type); else printf("[другой (0x%x)]\en", p_type); }

source: I<Executable and Linking Format Specification>, available at various locations online.
ru: I<Executable and Linking Format Specification> в веб.

source: dbopen - database access methods
ru: dbopen - методы доступа к базе данных

source: I<Note well>: This page documents interfaces provided in glibc up until version 2.1. Since version 2.2, glibc no longer provides these interfaces. Probably, you are looking for the APIs provided by the I<libdb> library instead.
ru: I<Примечание>: В этой странице описаны интерфейсы, предоставляемые glibc до версии 2.1. Начиная с версии 2.2, glibc больше не поддерживает эти интерфейсы. Вероятно, вы ищите API, предоставляемое библиотекой I<libdb>.

source: B<dbopen>() is the library interface to database files. The supported file formats are btree, hashed and UNIX file oriented. The btree format is a representation of a sorted, balanced tree structure. The hashed format is an extensible, dynamic hashing scheme. The flat-file format is a byte stream file with fixed or variable length records. The formats and file-format-specific information are described in detail in their respective manual pages B<btree>(3), B<hash>(3), and B<recno>(3).
ru: B<dbopen>() — это библиотека для взаимодействия с файлами баз данных. Поддерживаются форматы файлов btree, hashed и UNIX. Формат btree представляет собой отсортированную, сбалансированную древовидную структуру. Формат hashed — это гибкая, динамическая схема хэширования. Формат простого файла UNIX — поток байтов с записями постоянной или переменной длины. Сами форматы и формат файлов описываются детально в соответствующих справочных страницах B<btree>(3), B<hash>(3) и B<recno>(3).

source: B<dbopen>() opens I<file> for reading and/or writing. Files never intended to be preserved on disk may be created by setting the I<file> argument to NULL.
ru: B<dbopen>() открывает I<file> для чтения и/или записи. Файлы, не предназначенные для хранения на диске, могут быть созданы заданием параметру I<file> значения NULL.

source: The I<flags> and I<mode> arguments are as specified to the B<open>(2) routine, however, only the B<O_CREAT>, B<O_EXCL>, B<O_EXLOCK>, B<O_NONBLOCK>, B<O_RDONLY>, B<O_RDWR>, B<O_SHLOCK>, and B<O_TRUNC> flags are meaningful. (Note, opening a database file B<O_WRONLY> is not possible.)
ru: Значения аргументов I<flags> и I<mode> те же, что у вызова B<open>(2), однако имеют значение только флаги B<O_CREAT>, B<O_EXCL>, B<O_EXLOCK>, B<O_NONBLOCK>, B<O_RDONLY>, B<O_RDWR>, B<O_SHLOCK> и B<O_TRUNC>. Открытие файла базы данных с B<O_WRONLY> невозможно.

source: The I<type> argument is of type I<DBTYPE> (as defined in the I<E<lt>db.hE<gt>> include file) and may be set to B<DB_BTREE>, B<DB_HASH>, or B<DB_RECNO>.
ru: Аргумент I<type> имеет тип I<DBTYPE> (определён в файле заголовков I<E<lt>db.hE<gt>>) и может быть равен B<DB_BTREE>, B<DB_HASH> или B<DB_RECNO>.

source: The I<openinfo> argument is a pointer to an access-method-specific structure described in the access method's manual page. If I<openinfo> is NULL, each access method will use defaults appropriate for the system and the access method.
ru: Аргумент I<openinfo> является указателем на структуру метода доступа, описанную в справочной странице, посвящённой методам доступа. Если значение I<openinfo> равно NULL, то каждый метод доступа будет использовать установки по умолчанию для системы и метода доступа.

source: B<dbopen>() returns a pointer to a I<DB> structure on success and NULL on error. The I<DB> structure is defined in the I<E<lt>db.hE<gt>> include file, and contains at least the following fields:
ru: При успешном выполнении B<dbopen>() возвращает указатель на структуру I<DB> и NULL при ошибке. Структура I<DB> определена в файле I<E<lt>db.hE<gt>> и содержит, как минимум, следующие поля:

source: These elements describe a database type and a set of functions performing various actions. These functions take a pointer to a structure as returned by B<dbopen>(), and sometimes one or more pointers to key/data structures and a flag value.
ru: Эти элементы описывают тип базы данных и набор функций, выполняющих различные действия. Функции используют указатель на структуру, возвращаемый B<dbopen>(), и иногда один или несколько указателей на структуры ключ/данные и на значения флагов.

source: The type of the underlying access method (and file format).
ru: Тип лежащего в основе метода доступа (и формат файла).

source: A pointer to a routine to flush any cached information to disk, free any allocated resources, and close the underlying file(s). Since key/data pairs may be cached in memory, failing to sync the file with a I<close> or I<sync> function may result in inconsistent or lost information. I<close> routines return -1 on error (setting I<errno>) and 0 on success.
ru: Указатель на функцию, которая записывает любую кэшированную информацию на диск, освобождает занятые ресурсы и закрывает используемый файл(-ы). Так как пары ключ/данные могут быть кэшированы в памяти, ошибка синхронизации файла при функциях I<close> или I<sync> может привести к повреждению или потере данных. Функция I<close> возвращает -1 при ошибках (меняя при этом, соответственно, значение переменной I<errno>) и 0 при успешном выполнении.

source: A pointer to a routine to remove key/data pairs from the database.
ru: Указатель на функцию для удаления пар ключ/данные из базы данных.

source: The argument I<flag> may be set to the following value:
ru: Значение параметра I<flag> может быть следующим:

source: Delete the record referenced by the cursor. The cursor must have previously been initialized.
ru: Удаление записи, на которую ссылается курсор. Курсор предварительно должен быть инициализирован.

source: I<delete> routines return -1 on error (setting I<errno>), 0 on success, and 1 if the specified I<key> was not in the file.
ru: Функция I<delete> возвращает -1 при ошибке (изменяет I<errno>), 0 при успешном выполнении и 1, если указанного ключа I<key> нет в файле.

source: A pointer to a routine which returns a file descriptor representative of the underlying database. A file descriptor referencing the same file will be returned to all processes which call B<dbopen>() with the same I<file> name. This file descriptor may be safely used as an argument to the B<fcntl>(2) and B<flock>(2) locking functions. The file descriptor is not necessarily associated with any of the underlying files used by the access method. No file descriptor is available for in memory databases. I<fd> routines return -1 on error (setting I<errno>), and the file descriptor on success.
ru: Указатель на функцию, которая возвращает дескриптор файла, представляющий используемую базу данных. Дескриптор файла, ссылающийся на тот же файл, будет возвращаться всем процессам, которые вызывают B<dbopen>() с этим именем файла I<file>. Этот дескриптор файла может быть использован как аргумент для блокирующих функций B<fcntl>(2) и B<flock>(2). Файловый дескриптор необязательно связывать с какими-либо из файлов, лежащих в основе используемого метода доступа. Для баз данных в памяти файловые дескрипторы недоступны. Функция I<fd> возвращает -1 при ошибке (меняет при этом, соответственно, значение переменной I<errno>) или дескриптор файла при успешном выполнении.

source: A pointer to a routine which is the interface for keyed retrieval from the database. The address and length of the data associated with the specified I<key> are returned in the structure referenced by I<data>. I<get> routines return -1 on error (setting I<errno>), 0 on success, and 1 if the I<key> was not in the file.
ru: Указатель на функцию, которая является интерфейсом для поиска по ключу в базе данных. Адрес и размер данных, связанных с указанным ключом I<key>, возвращается в структуре, указываемой I<data>. Функция I<get> возвращает -1 при ошибке (меняя при этом, соответственно, значение переменной I<errno>), 0 при успешном выполнении и 1, если ключа I<key> нет в файле.

source: A pointer to a routine to store key/data pairs in the database.
ru: Указатель на функцию, сохраняющую пары ключ/данные в базе данных.

source: The argument I<flag> may be set to one of the following values:
ru: Значение параметра I<flag> может быть одним из следующих:

source: Replace the key/data pair referenced by the cursor. The cursor must have previously been initialized.
ru: Замена пары ключ/данные, на которую ссылается курсор. Курсор предварительно должен быть инициализирован.

source: Append the data immediately after the data referenced by I<key>, creating a new key/data pair. The record number of the appended key/data pair is returned in the I<key> structure. (Applicable only to the B<DB_RECNO> access method.)
ru: Добавление данных сразу после тех данных, которые связаны с ключом I<key>; создание новой пары ключ/данные. Номер записи добавленной пары ключ/данные возвращается в структуре I<key> (применимо только в случае метода доступа B<DB_RECNO>).

source: Insert the data immediately before the data referenced by I<key>, creating a new key/data pair. The record number of the inserted key/data pair is returned in the I<key> structure. (Applicable only to the B<DB_RECNO> access method.)
ru: Вставка данных перед данными, связанными с ключом I<key>; создание новой пары ключ/данные. Номер записи добавленной пары ключ/данные возвращается в структуре I<key> (применимо только в случае метода доступа B<DB_RECNO>).

source: Enter the new key/data pair only if the key does not previously exist.
ru: Добавление новой пары ключ/данные, только если ключ ещё не существовал.

source: Store the key/data pair, setting or initializing the position of the cursor to reference it. (Applicable only to the B<DB_BTREE> and B<DB_RECNO> access methods.)
ru: Сохранение пары ключ/данные, установка или инициализация позиции курсора для ссылки на неё (применимо только в случае метода доступа B<DB_BTREE> и B<DB_RECNO>).

source: B<R_SETCURSOR> is available only for the B<DB_BTREE> and B<DB_RECNO> access methods because it implies that the keys have an inherent order which does not change.
ru: Значение B<R_SETCURSOR> доступно только в случае методов доступа B<DB_BTREE> и B<DB_RECNO>, поскольку они предполагают, что ключи имеют определённый порядок, который не изменяется.

source: B<R_IAFTER> and B<R_IBEFORE> are available only for the B<DB_RECNO> access method because they each imply that the access method is able to create new keys. This is true only if the keys are ordered and independent, record numbers for example.
ru: Значения B<R_IAFTER> и B<R_IBEFORE> доступны только в случае метода доступа B<DB_RECNO>, поскольку предполагается, что метод доступа позволяет создавать новые ключи. Это возможно, только если ключи отсортированы и независимы, например, они могут представлять собой номера записей.

source: The default behavior of the I<put> routines is to enter the new key/data pair, replacing any previously existing key.
ru: Поведение по умолчанию функции I<put> предусматривает ввод новой пары ключ/данные, заменяя при этом уже существующий ключ.

source: I<put> routines return -1 on error (setting I<errno>), 0 on success, and 1 if the B<R_NOOVERWRITE> I<flag> was set and the key already exists in the file.
ru: Функция I<put> возвращает -1 при ошибке (меняя при этом, соответственно, значение переменной I<errno>), 0 при успешном выполнении и 1, если значение I<flag> равно B<R_NOOVERWRITE> и ключ в файле уже существует.

source: A pointer to a routine which is the interface for sequential retrieval from the database. The address and length of the key are returned in the structure referenced by I<key>, and the address and length of the data are returned in the structure referenced by I<data>.
ru: Указатель на функцию, которая является интерфейсом для последовательной выборки в базе данных. Адрес и размер ключа возвращается в структуре, определяемой I<key>, а адрес и размер данных — в структуре, определяемой I<data>.

source: Sequential key/data pair retrieval may begin at any time, and the position of the "cursor" is not affected by calls to the I<del>, I<get>, I<put>, or I<sync> routines. Modifications to the database during a sequential scan will be reflected in the scan, that is, records inserted behind the cursor will not be returned while records inserted in front of the cursor will be returned.
ru: Последовательная выборка пар ключ/данные может быть начата в любой момент, и позиция «курсора» не подвергнется изменениям при вызове функций I<del>, I<get>, I<put> или I<sync>. Изменение базы данных в процессе последовательного просмотра отразится на просмотре, т. е. запись, вставленная позади курсора, не будет возвращена, пока не будет возвращена запись, вставленная перед курсором.

source: The flag value B<must> be set to one of the following values:
ru: Значение флага B<должно> быть равно одному из следующих значений:

source: The data associated with the specified key is returned. This differs from the I<get> routines in that it sets or initializes the cursor to the location of the key as well. (Note, for the B<DB_BTREE> access method, the returned key is not necessarily an exact match for the specified key. The returned key is the smallest key greater than or equal to the specified key, permitting partial key matches and range searches.)
ru: Возвращаются данные, связанные с указанным ключом. Отличается от функции I<get> тем, что дополнительно происходит установка или инициализация курсора. Заметим, что при методе доступа B<DB_BTREE> необязательно, чтобы возвращаемый ключ в точности соответствовал указанному. Возвращаемый ключ — наименьший ключ из больших или равных указанному ключу. При этом допускается частичное соответствие ключей и поиск их в диапазонах.

source: The first key/data pair of the database is returned, and the cursor is set or initialized to reference it.
ru: Возвращается первая пара ключ/данные из базы данных, а курсор устанавливается или инициализируется для ссылки на него.

source: The last key/data pair of the database is returned, and the cursor is set or initialized to reference it. (Applicable only to the B<DB_BTREE> and B<DB_RECNO> access methods.)
ru: Возвращается последняя пара ключ/данные из базы данных, а курсор устанавливается или инициализируется для ссылки на него. Применимо только для методов доступа B<DB_BTREE> и B<DB_RECNO>.

source: Retrieve the key/data pair immediately after the cursor. If the cursor is not yet set, this is the same as the B<R_FIRST> flag.
ru: Возвращается пара ключ/данные, стоящая непосредственно после курсора. Если курсор ещё не был установлен, выполняется тоже, что при флаге B<R_FIRST>.

source: Retrieve the key/data pair immediately before the cursor. If the cursor is not yet set, this is the same as the B<R_LAST> flag. (Applicable only to the B<DB_BTREE> and B<DB_RECNO> access methods.)
ru: Возвращается пара ключ/данные, стоящая непосредственно перед курсором. Если курсор ещё не был установлен, выполняется тоже, что при флаге B<R_LAST>. Применимо только для методов доступа B<DB_BTREE> и B<DB_RECNO>.

source: B<R_LAST> and B<R_PREV> are available only for the B<DB_BTREE> and B<DB_RECNO> access methods because they each imply that the keys have an inherent order which does not change.
ru: Флаги B<R_LAST> и B<R_PREV> подходят только для методов доступа B<DB_BTREE> и B<DB_RECNO>, поскольку при этом предполагается, что ключи расположены в строгом неизменном порядке.
