Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: A few terminal programs do not recognize the default properly. If all text gets colorized after you do a directory listing, change the B<NORMAL> and B<FILE> codes to the numerical codes for your normal foreground and background colors.
ru: Некоторые терминальные программы неправильно распознают настройки цвета по умолчанию. Если весь текст становится расцвеченным после того, как вы просматриваете листинг каталога, измените коды B<NORMAL> и B<FILE> на цифровые коды для нормального цвета текста и фона.

source: Other terminal types (advanced configuration)
ru: Другие типы терминалов (расширенная настройка)

source: If you have a color-capable (or otherwise highlighting) terminal (or printer!) which uses a different set of codes, you can still generate a suitable setup. To do so, you will have to use the B<LEFTCODE>, B<RIGHTCODE>, and B<ENDCODE> definitions.
ru: Если у вас есть терминал (или принтер!) с поддержкой цвета (или другими возможностями выделения), который использует другой набор кодов, вы всё равно сможете создать подходящие настройки. Для этого нужно использовать операторы B<LEFTCODE>, B<RIGHTCODE> и B<ENDCODE>.

source: When writing out a filename, B<ls> generates the following output sequence: B<LEFTCODE> I<typecode> B<RIGHTCODE> I<filename> B<ENDCODE>, where the I<typecode> is the color sequence that depends on the type or name of file. If the B<ENDCODE> is undefined, the sequence B<LEFTCODE NORMAL RIGHTCODE> will be used instead. The purpose of the left- and rightcodes is merely to reduce the amount of typing necessary (and to hide ugly escape codes away from the user). If they are not appropriate for your terminal, you can eliminate them by specifying the respective keyword on a line by itself.
ru: При выводе имени файла B<ls> генерирует такую последовательность: B<LEFTCODE> I<кода_типа> B<RIGHTCODE> I<имя_файла> B<ENDCODE>, где I<код_типа> \(em цветовая последовательность, зависящая от типа или имени файла. Если B<ENDCODE> не определён, то вместо него будет использоваться последовательность B<LEFTCODE NORMAL RIGHTCODE>. Предназначением левого (LEFTCODE) и правого (RIGHTCODE) кодов является сокращение количества информации, которую нужно набирать (а также спрятать уродливые escape-последовательности от пользователя). Если они не подходят для вашего терминала, их можно выключить, поместив соответствующее ключевое слово на отдельной строке.

source: B<NOTE:> If the B<ENDCODE> is defined in the global section of the setup file, it I<cannot> be undefined in a terminal-specific section of the file. This means any B<NORMAL> definition will have no effect. A different B<ENDCODE> can, however, be specified, which would have the same effect.
ru: B<ЗАМЕЧАНИЕ:> Если B<ENDCODE> определён в глобальном разделе файла настроек, то его I<нельзя> переопределить в разделе определённого терминала. Это означает, что все определения B<NORMAL> не приведут ни к какому результату. Однако, можно использовать различные B<ENDCODE>, что и приведёт к нужному результату.

source: Escape sequences
ru: Экранированные последовательности

source: To specify control- or blank characters in the color sequences or filename extensions, either C-style \e-escaped notation or B<stty>-style ^-notation can be used. The C-style notation includes the following characters:
ru: Для того, чтобы указать в цветовых последовательностях или расширениях имён файлов управляющие символы или пробелы, можно использовать либо нотацию в стиле языка C с помощью обратной косой черты, либо нотацию в стиле программы B<stty> с помощью символа ^. Нотация в стиле языка C включает в себя такие символы:

source: Bell (ASCII 7)
ru: Звуковой сигнал (ASCII 7)

source: Backspace (ASCII 8)
ru: Забой (ASCII 8)

source: Escape (ASCII 27)
ru: Экранирующий символ (ASCII 27)

source: Form feed (ASCII 12)
ru: Прогон страницы (ASCII 12)

source: Newline (ASCII 10)
ru: Перевод строки (ASCII 10)

source: Carriage Return (ASCII 13)
ru: Возврат каретки (ASCII 13)

source: Tab (ASCII 9)
ru: Табуляция (ASCII 9)

source: Vertical Tab (ASCII 11)
ru: Вертикальная табуляция (ASCII 11)

source: Delete (ASCII 127)
ru: Удаление (ASCII 127)

source: I<Any character (octal notation)>
ru: I<Любой символ (восьмеричная запись)>

source: I<Any character (hexadecimal notation)>
ru: I<Любой символ (шестнадцатеричная запись)>

source: I<Space>
ru: I<Пробел>

source: I<Backslash (\e)>
ru: I<Обратная косая черта (\e)>

source: I<Caret (^)>
ru: I<Крышка (^)>

source: I<Hash mark (#)>
ru: I<Знак решетки (#)>

source: Note that escapes are necessary to enter a space, backslash, caret, or any control character anywhere in the string, as well as a hash mark as the first character.
ru: Заметьте, что экранирование необходимо, чтобы использовать пробел, обратную косую черту, крышку или управляющие символы в любом месте строки, а также символ решётки в качестве первого символа в строке.

source: System-wide configuration file.
ru: Общесистемный файл настройки

source: Per-user configuration file.
ru: Пользовательский файл настройки

source: This page describes the B<dir_colors> file format as used in the fileutils-4.1 package; other versions may differ slightly.
ru: Эта страница описывает формат файла B<dir_colors>, который можно найти в пакете fileutils-4.1; другие версии могут немного отличаться.

source: The default B<LEFTCODE> and B<RIGHTCODE> definitions, which are used by ISO 6429 terminals are:
ru: Значение B<LEFTCODE> и B<RIGHTCODE>, используемые по умолчанию терминалами ISO 6429:

source: The default B<ENDCODE> is undefined.
ru: По умолчанию значение B<ENDCODE> не определено.

source: des_crypt, ecb_crypt, cbc_crypt, des_setparity, DES_FAILED - fast DES encryption
ru: des_crypt, ecb_crypt, cbc_crypt, des_setparity, DES_FAILED - быстрое шифрование DES

source: B<ecb_crypt>() and B<cbc_crypt>() implement the NBS DES (Data Encryption Standard). These routines are faster and more general purpose than B<crypt>(3). They also are able to utilize DES hardware if it is available. B<ecb_crypt>() encrypts in ECB (Electronic Code Book) mode, which encrypts blocks of data independently. B<cbc_crypt>() encrypts in CBC (Cipher Block Chaining) mode, which chains together successive blocks. CBC mode protects against insertions, deletions and substitutions of blocks. Also, regularities in the clear text will not appear in the cipher text.
ru: В функциях B<ecb_crypt>() и B<cbc_crypt>() реализован стандарт шифрования данных NBS DES (Data Encryption Standard). Они более быстры и имеют более широкое предназначение, чем B<crypt>(3). Также они могут использовать (при наличии) оборудование DES. Функция B<ecb_crypt>() шифрует данные в режиме ECB (Electronic Code Book), при котором блоки данных шифруются независимо друг от друга. Функция B<cbc_crypt>() шифрует данные в режиме CBC (Cipher Block Chaining), при котором вместе связываются рядом стоящие блоки. Режим CBC защищает от вставки, удаления или подмены блоков. Также повторяющиеся отрезки простого текста не появятся в зашифрованном в таком режиме коде.

source: Here is how to use these routines. The first argument, I<key>, is the 8-byte encryption key with parity. To set the key's parity, which for DES is in the low bit of each byte, use B<des_setparity>(). The second argument, I<data>, contains the data to be encrypted or decrypted. The third argument, I<datalen>, is the length in bytes of I<data>, which must be a multiple of 8. The fourth argument, I<mode>, is formed by ORing together some things. For the encryption direction OR in either B<DES_ENCRYPT> or B<DES_DECRYPT>. For software versus hardware encryption, OR in either B<DES_HW> or B<DES_SW>. If B<DES_HW> is specified, and there is no hardware, then the encryption is performed in software and the routine returns B<DESERR_NOHWDEVICE>. For B<cbc_crypt>(), the argument I<ivec> is the 8-byte initialization vector for the chaining. It is updated to the next initialization vector upon return.
ru: Рассмотрим применение этих функций. Первый параметр, I<key>, является 8-байтным ключом шифрования с чётностью. Для установки чётности ключа, которая для DES находится в младшем бите каждого байта, используйте B<des_setparity>. Второй параметр, I<data>, содержит данные для шифрования или расшифровки. Третий параметр, I<datalen>, задаёт длину блока данных I<data> в байтах, длина должна быть кратна 8. Четвертый параметр, I<mode>, формируется через логическое сложение (OR) нескольких вещей. Чтобы указать тип операции добавляется либо B<DES_ENCRYPT>, либо B<DES_DECRYPT>. Чтобы применить программное шифрование или использовать специальное оборудование, добавляется либо B<DES_HW>, либо B<DES_SW>. Если указано B<DES_HW> и оборудование не обнаружено, то шифрование выполняется в программном режиме, а функция возвращает B<DESERR_NOHWDEVICE>. В B<cbc_crypt>() параметр I<ivec> используется как 8-байтовый вектор инициализации для шифрования цепочек. Он обновляется на следующий вектор инициализации при возврате.

source: No error.
ru: Нет ошибок.

source: Encryption succeeded, but done in software instead of the requested hardware.
ru: Шифрование выполнено, но использовался программный метод, так как не было обнаружено запрошенное оборудование шифрования.

source: An error occurred in the hardware or driver.
ru: Ошибка в оборудовании или драйвере.

source: Bad argument to routine.
ru: Некорректный параметр функции.

source: Given a result status I<stat>, the macro B<DES_FAILED(>I<stat>B<)> is false only for the first two statuses.
ru: Указывая итоговое состояние I<stat>, значение макроса B<DES_FAILED(>I<stat>B<)> будет ложно только для первых двух состояний.

source: These functions are present in glibc 2.1 and later.
ru: Эти функции присутствуют в glibc 2.1 и более новых.

source: Because they employ the DES block cipher, which is no longer considered secure, B<ecb_crypt>(), B<ecb_crypt>(), B<crypt_r>(), and B<des_setparity>() were removed in glibc 2.28. Applications should switch to a modern cryptography library, such as B<libgcrypt>.
ru: Функции B<ecb_crypt>(), B<ecb_crypt>(), B<crypt_r>() и B<des_setparity>() удалены из glibc 2.28, так как они используют блочный шифр DES, который теперь считается небезопасным. В приложениях следует использовать современную библиотеку шифрования, например B<libgcrypt>.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: 4.3BSD. Not in POSIX.1.
ru: 4.3BSD. Отсутствует в POSIX-1.

source: drand48_r, erand48_r, lrand48_r, nrand48_r, mrand48_r, jrand48_r, srand48_r, seed48_r, lcong48_r - generate uniformly distributed pseudo-random numbers reentrantly
ru: drand48_r, erand48_r, lrand48_r, nrand48_r, mrand48_r, jrand48_r, srand48_r, seed48_r, lcong48_r - генерация равномерно распределённых псевдослучайных чисел реентерабельным способом

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: All functions shown above: /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: Для всех вышеуказанных функций: /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версии glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: These functions are the reentrant analogs of the functions described in B<drand48>(3). Instead of modifying the global random generator state, they use the supplied data I<buffer>.
ru: Данные функции являются реентерабельными аналогами функций, описанных в B<drand48>(3). Вместо изменения состояния глобального генератора произвольных чисел, в них используется передаваемый буфер данных I<buffer>.

source: Before the first use, this struct must be initialized, for example, by filling it with zeros, or by calling one of the functions B<srand48_r>(), B<seed48_r>(), or B<lcong48_r>().
ru: Перед первым использованием эта структура должна быть инициализирована, например, заполнена нулями или посредством вызова функции B<srand48_r>(), B<seed48_r>() или B<lcong48_r>().

source: The return value is 0.
ru: Возвращаемое значение равно 0.

source: These functions are GNU extensions and are not portable.
ru: Эти функции являются расширениями GNU и не переносимы.

source: daemon - run in the background
ru: daemon - выполнение в фоновом режиме

source: Since glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 and 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Up to and including glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)
ru: начиная с glibc 2.21: _DEFAULT_SOURCE в glibc 2.19 и 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) до glibc 2.19, включительно: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)

source: The B<daemon>() function is for programs wishing to detach themselves from the controlling terminal and run in the background as system daemons.
ru: Функция B<daemon>() необходима для того, чтобы отключить программу от управляющего терминала и запустить её в фоновом режиме подобно тому, как выполняются системные службы.

source: If I<nochdir> is zero, B<daemon>() changes the process's current working directory to the root directory ("/"); otherwise, the current working directory is left unchanged.
ru: Если аргумент I<nochdir> равен нулю, то B<daemon>() изменяет текущий рабочий каталог процесса на корневой («/»); в противном случае текущий рабочий каталог не изменяется.

source: If I<noclose> is zero, B<daemon>() redirects standard input, standard output and standard error to I</dev/null>; otherwise, no changes are made to these file descriptors.
ru: Если аргумент I<noclose> равен нулю, то B<daemon>() перенаправляет стандартный поток ввода, вывода и ошибок в I</dev/null>; в противном случае данные файловые дескрипторы не изменяется.

source: (This function forks, and if the B<fork>(2) succeeds, the parent calls B<_exit>(2), so that further errors are seen by the child only.) On success B<daemon>() returns zero. If an error occurs, B<daemon>() returns -1 and sets I<errno> to any of the errors specified for the B<fork>(2) and B<setsid>(2).
ru: Эта функция порождает новый процесс и, если B<fork>(2) завершается без ошибок, родительский процесс вызывает B<_exit>(2), чтобы дальнейшие ошибки воспринимались только дочерним процессом. В случае успешного выполнения B<daemon>() возвращается ноль. Если возникла ошибка, то B<daemon>() возвращает -1 и присваивает глобальной переменной I<errno> одно из значений, указанных для B<fork>(2) и B<setsid>(2).

source: Not in POSIX.1. A similar function appears on the BSDs. The B<daemon>() function first appeared in 4.4BSD.
ru: Отсутствует в POSIX.1. Подобная функция есть в BSD. Впервые функция B<daemon>() появилась в 4.4BSD.

source: The glibc implementation can also return -1 when I</dev/null> exists but is not a character device with the expected major and minor numbers. In this case, I<errno> need not be set.
ru: Реализация в glibc может также возвращать -1 в случаях, когда I</dev/null> существует, но не является файлом символьного устройства с ожидаемыми основным и вспомогательным номерами. В этом случае нет необходимости устанавливать I<errno>.

source: The GNU C library implementation of this function was taken from BSD, and does not employ the double-fork technique (i.e., B<fork>(2), B<setsid>(2), B<fork>(2)) that is necessary to ensure that the resulting daemon process is not a session leader. Instead, the resulting daemon I<is> a session leader. On systems that follow System V semantics (e.g., Linux), this means that if the daemon opens a terminal that is not already a controlling terminal for another session, then that terminal will inadvertently become the controlling terminal for the daemon.
ru: Для библиотеки GNU C реализация этой функции была взята из BSD, и в ней не применяется техника двойного fork (т. е., B<fork>(2), B<setsid>(2), B<fork>(2)), поэтому необходимо проверить, что полученный процесс службы не является лидером сеанса. Вместо этого полученная служба I<является> лидером сеанса. В системах, следующих семантике System V (например, Linux), это означает, что если служба открывает терминал, которой пока не является управляющим для другого сеанса, то этот терминал непреднамеренно станет управляющим терминалом для службы.

source: dl_iterate_phdr - walk through list of shared objects
ru: dl_iterate_phdr - обход списка общих объектов

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>link.hE<gt>>
ru: B<#define _GNU_SOURCE> /* см. feature_test_macros(7) */ B<#include E<lt>link.hE<gt>>

source: The B<dl_iterate_phdr>() function allows an application to inquire at run time to find out which shared objects it has loaded, and the order in which they were loaded.
ru: Функция B<dl_iterate_phdr>() позволяет приложению во время выполнения узнать, какие общие объекты были загружены и их порядок загрузки.

source: The B<dl_iterate_phdr>() function walks through the list of an application's shared objects and calls the function I<callback> once for each object, until either all shared objects have been processed or I<callback> returns a nonzero value.
ru: Функция B<dl_iterate_phdr>() обходит список общих объектов приложения и однократно вызывает функцию I<callback> для каждого объекта до тех пор, пока или все общие объекты не будут просмотрены, или функция I<callback> не вернёт ненулевое значение.

source: Each call to I<callback> receives three arguments: I<info>, which is a pointer to a structure containing information about the shared object; I<size>, which is the size of the structure pointed to by I<info>; and I<data>, which is a copy of whatever value was passed by the calling program as the second argument (also named I<data>) in the call to B<dl_iterate_phdr>().
ru: При каждом вызове в I<callback> передаётся три параметра: I<info> (указатель на структуру с информацией об общем объекте), I<size> (размер структуры, на которую указывает I<info>) и I<data> (копия любого значения, переданного вызывающей программой во втором параметре (также называемом I<data>) в вызов B<dl_iterate_phdr>().

source: The I<info> argument is a structure of the following type:
ru: Параметр I<info> представляет собой структуру следующего вида:

source: struct dl_phdr_info { ElfW(Addr) dlpi_addr; /* Base address of object */ const char *dlpi_name; /* (Null-terminated) name of object */ const ElfW(Phdr) *dlpi_phdr; /* Pointer to array of ELF program headers for this object */ ElfW(Half) dlpi_phnum; /* # of items in I<dlpi_phdr> */
ru: struct dl_phdr_info { ElfW(Addr) dlpi_addr; /* базовый адрес объекта */ const char *dlpi_name; /* имя объекта (оканчивается Null) */ const ElfW(Phdr) *dlpi_phdr; /* указатель на массив программных заголовков ELF этого объекта */ ElfW(Half) dlpi_phnum; /* кол-во элементов в I<dlpi_phdr> */

source: /* The following fields were added in glibc 2.4, after the first version of this structure was available. Check the I<size> argument passed to the dl_iterate_phdr callback to determine whether or not each later member is available. */
ru: /* Следующие поля были добавлены в glibc 2.4, после опубликования первой версии этой структуры. Из аргумента I<size>, передаваемом в dl_iterate_phdr, можно определить были ли добавлены новые члены. */

source: unsigned long long int dlpi_adds; /* Incremented when a new object may have been added */ unsigned long long int dlpi_subs; /* Incremented when an object may have been removed */ size_t dlpi_tls_modid; /* If there is a PT_TLS segment, its module ID as used in TLS relocations, else zero */ void *dlpi_tls_data; /* The address of the calling thread's instance of this module's PT_TLS segment, if it has one and it has been allocated in the calling thread, otherwise a null pointer */ };
ru: unsigned long long int dlpi_adds; /* увеличивается, когда мог быть добавлен новый объект */ unsigned long long int dlpi_subs; /* увеличивается, когда мог быть удалён новый объект */ size_t dlpi_tls_modid; /* если существует сегмент PT_TLS, это его ID модуля, используемый в перестановках TLS, иначе 0 */ void *dlpi_tls_data; /* адрес экземпляра вызывающей нити сегмента PT_TLS этого модуля, если он есть и был выделен в вызывающей нити, иначе указатель null */ };

source: (The I<ElfW>() macro definition turns its argument into the name of an ELF data type suitable for the hardware architecture. For example, on a 32-bit platform, I<ElfW(Addr)> yields the data type name I<Elf32_Addr>. Further information on these types can be found in the I<E<lt>elf.hE<gt>> and I<E<lt>link.hE<gt>> header files.)
ru: (Макрос I<ElfW>() преобразует свой аргумент в имя типа данных ELF, подходящее для аппаратной архитектуры. Например, на 32-битной платформе I<ElfW(Addr)> вернёт имя типа данных I<Elf32_Addr>. Дополнительную информацию можно найти в заголовочных файлах I<E<lt>elf.hE<gt>> и I<E<lt>link.hE<gt>>.)

source: The I<dlpi_addr> field indicates the base address of the shared object (i.e., the difference between the virtual memory address of the shared object and the offset of that object in the file from which it was loaded). The I<dlpi_name> field is a null-terminated string giving the pathname from which the shared object was loaded.
ru: В поле I<dlpi_addr> указывается базовый адрес общего объекта (т. е., разница между виртуальным адресом памяти общего объекта и смещением до этого объекта в файле, из которого он был загружен). Поле I<dlpi_name> представляет собой строку с null на конце, определяющую путь, из которого был загружен общий объект.

source: To understand the meaning of the I<dlpi_phdr> and I<dlpi_phnum> fields, we need to be aware that an ELF shared object consists of a number of segments, each of which has a corresponding program header describing the segment. The I<dlpi_phdr> field is a pointer to an array of the program headers for this shared object. The I<dlpi_phnum> field indicates the size of this array.
ru: Чтобы понять назначение полей I<dlpi_phdr> и I<dlpi_phnum>, нам необходимо представлять, что общий объект ELF состоит из набора сегментов, каждый из которых имеет соответствующий программный заголовок, описывающий сегмент. Поле I<dlpi_phdr> представляет собой указатель на массив программных заголовков этого общего объекта. В поле I<dlpi_phnum> задаётся размер этого массива.

source: These program headers are structures of the following form:
ru: Программные заголовки представляют собой структуры следующего вида:

source: typedef struct { Elf32_Word p_type; /* Segment type */ Elf32_Off p_offset; /* Segment file offset */ Elf32_Addr p_vaddr; /* Segment virtual address */ Elf32_Addr p_paddr; /* Segment physical address */ Elf32_Word p_filesz; /* Segment size in file */ Elf32_Word p_memsz; /* Segment size in memory */ Elf32_Word p_flags; /* Segment flags */ Elf32_Word p_align; /* Segment alignment */ } Elf32_Phdr;
ru: typedef struct { Elf32_Word p_type; /* тип сегмента */ Elf32_Off p_offset; /* смещение сегмента в файле */ Elf32_Addr p_vaddr; /* виртуальный адрес сегмента */ Elf32_Addr p_paddr; /* физический адрес сегмента */ Elf32_Word p_filesz; /* размер сегмента в файле */ Elf32_Word p_memsz; /* размер сегмента в памяти */ Elf32_Word p_flags; /* флаги сегмента */ Elf32_Word p_align; /* выравнивание сегмента */ } Elf32_Phdr;

source: Note that we can calculate the location of a particular program header, I<x>, in virtual memory using the formula:
ru: Заметим, что мы можем вычислить расположение определённого программного заголовка I<x> в виртуальной памяти по следующей формуле:
