Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: /* Obtain a duplicate of 'newfd' that can subsequently be used to check for close() errors; an EBADF error means that 'newfd' was not open. */
ru: /* Получить копию «newfd», которую затем можно использовать для проверки ошибок close(); ошибка EBADF означает, что «newfd» не открыт. */

source: tmpfd = dup(newfd); if (tmpfd == -1 && errno != EBADF) { /* Handle unexpected dup() error */ }
ru: tmpfd = dup(newfd); if (tmpfd == -1 && errno != EBADF) { /* обработка неожидаемой ошибки dup() */ }

source: /* Atomically duplicate 'oldfd' on 'newfd' */
ru: /* атомарное копирование «oldfd» в «newfd» */

source: if (dup2(oldfd, newfd) == -1) { /* Handle dup2() error */ }
ru: if (dup2(oldfd, newfd) == -1) { /* обработка ошибки dup2() */ }

source: /* Now check for close() errors on the file originally referred to by 'newfd' */
ru: /* теперь проверим ошибки close() у файла, на который изначально ссылался «newfd» */

source: if (tmpfd != -1) { if (close(tmpfd) == -1) { /* Handle errors from close */ } }
ru: if (tmpfd != -1) { if (close(tmpfd) == -1) { /* обработка ошибок закрытия */ } }

source: delete_module - unload a kernel module
ru: delete_module - выгружает модуль ядра

source: I<Note>: No declaration of this system call is provided in glibc headers; see NOTES.
ru: I<Замечание>: В заголовочных файлах glibc этой системный вызов отсутствует; смотрите ЗАМЕЧАНИЯ.

source: The B<delete_module>() system call attempts to remove the unused loadable module entry identified by I<name>. If the module has an I<exit> function, then that function is executed before unloading the module. The I<flags> argument is used to modify the behavior of the system call, as described below. This system call requires privilege.
ru: Вызов B<delete_module>() пытается удалить неиспользуемый загруженный модуль с именем I<name>. Если у модуля есть функция I<exit>, то она выполняется перед выгрузкой. Аргумент I<flags> используется для изменения поведения системного вызова — это описано далее. Данный системный вызов требует особых прав.

source: Module removal is attempted according to the following rules:
ru: Удаление модуля выполняется по следующим правилам:

source: If there are other loaded modules that depend on (i.e., refer to symbols defined in) this module, then the call fails.
ru: Если какой-то другой модуль зависит от выгружаемого (т.е., использует его символы), то вызов завершается с ошибкой.

source: Otherwise, if the reference count for the module (i.e., the number of processes currently using the module) is zero, then the module is immediately unloaded.
ru: В противном случае, если счётчик ссылок на модуль (т.е. количество процессов, использующих модуль в данный момент) равно нулю, то модуль немедленно выгружается.

source: If a module has a nonzero reference count, then the behavior depends on the bits set in I<flags>. In normal usage (see NOTES), the B<O_NONBLOCK> flag is always specified, and the B<O_TRUNC> flag may additionally be specified.
ru: Если у модуля ненулевой счётчик ссылок, то поведение зависит от битов, установленных в I<flags>. Обычно (смотрите ЗАМЕЧАНИЯ) всегда указывается флаг B<O_NONBLOCK>, а иногда добавляется B<O_TRUNC>.

source: The various combinations for I<flags> have the following effect:
ru: Различные комбинации значений в I<flags> дают разный эффект:

source: The call returns immediately, with an error.
ru: Вызов сразу завершается с ошибкой.

source: The module is unloaded immediately, regardless of whether it has a nonzero reference count.
ru: Модуль немедленно выгружается, независимо от того, равен счётчик ссылок 0 или нет.

source: If I<flags> does not specify B<O_NONBLOCK>, the following steps occur:
ru: Если в I<flags> не указан B<O_NONBLOCK>, то выполняются следующие шаги:

source: The module is marked so that no new references are permitted.
ru: Модуль помечается, что больше ссылаться на него запрещается.

source: If the module's reference count is nonzero, the caller is placed in an uninterruptible sleep state (B<TASK_UNINTERRUPTIBLE>) until the reference count is zero, at which point the call unblocks.
ru: Если счётчик ссылок модуля не равен нулю, то вызывающий переходит в непрерываемое состояние сна (B<TASK_UNINTERRUPTIBLE>) до тех пор, пока счётчик ссылок не станет равным 0 — в этот момент вызов разблокируется.

source: The module is unloaded in the usual way.
ru: Модуль выгружается как обычно.

source: The B<O_TRUNC> flag has one further effect on the rules described above. By default, if a module has an I<init> function but no I<exit> function, then an attempt to remove the module fails. However, if B<O_TRUNC> was specified, this requirement is bypassed.
ru: Флаг B<O_TRUNC> имеет ещё один эффект на правила, описанные выше. По умолчанию, если модуль имеет функцию I<init>, но не имеет функции I<exit>, то попытка удаления модуля завершается с ошибкой. Однако, если указан B<O_TRUNC>, то это требование не учитывается.

source: Using the B<O_TRUNC> flag is dangerous! If the kernel was not built with B<CONFIG_MODULE_FORCE_UNLOAD>, this flag is silently ignored. (Normally, B<CONFIG_MODULE_FORCE_UNLOAD> is enabled.) Using this flag taints the kernel (TAINT_FORCED_RMMOD).
ru: Использовать флаг B<O_TRUNC> опасно! Если ядро не собрано с параметром B<CONFIG_MODULE_FORCE_UNLOAD>, то этот флаг просто игнорируется (обычно параметр B<CONFIG_MODULE_FORCE_UNLOAD> включают). Использование этого флага приводит к примешиванию (taints) в ядре (TAINT_FORCED_RMMOD).

source: On success, zero is returned. On error, -1 is returned and I<errno> is set appropriately.
ru: При успешном выполнении возвращается ноль. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The module is not "live" (i.e., it is still being initialized or is already marked for removal); or, the module has an I<init> function but has no I<exit> function, and B<O_TRUNC> was not specified in I<flags>.
ru: Модуль не «живой» (т.е., он всё ещё инициализируется или уже помечен для удаления); или модуль имеет функцию I<init>, но не имеет функции I<exit> и в I<flags> не указан флаг B<O_TRUNC>.

source: I<name> refers to a location outside the process's accessible address space.
ru: Значение I<name> указывает на расположение вне доступного адресного пространства процесса.

source: No module by that name exists.
ru: Модуль с таким именем не существует.

source: The caller was not privileged (did not have the B<CAP_SYS_MODULE> capability), or module unloading is disabled (see I</proc/sys/kernel/modules_disabled> in B<proc>(5)).
ru: Вызывающий не имеет прав (не имеет мандата B<CAP_SYS_MODULE>), или отключена выгрузка модулей (смотрите I</proc/sys/kernel/modules_disabled> в B<proc>(5)).

source: Other modules depend on this module; or, B<O_NONBLOCK> was specified in I<flags>, but the reference count of this module is nonzero and B<O_TRUNC> was not specified in I<flags>.
ru: Другие модули зависят от этого модуля; или в I<flags> указан флаг B<O_NONBLOCK>, но счётчик ссылок модуля не равен 0 и в I<flags> не указан флаг B<O_TRUNC>.

source: B<delete_module>() is Linux-specific.
ru: Вызов B<delete_module>() есть только в Linux.

source: The B<delete_module>() system call is not supported by glibc. No declaration is provided in glibc headers, but, through a quirk of history, glibc versions before 2.23 did export an ABI for this system call. Therefore, in order to employ this system call, it is (before glibc 2.23) sufficient to manually declare the interface in your code; alternatively, you can invoke the system call using B<syscall>(2).
ru: Системный вызов B<delete_module>() не поддерживается glibc. В заголовочных файлах glibc он не объявлен, но в недавнем прошлом glibc до версии 2.23 экспортировал ABI для этого системного вызова. Поэтому чтобы получить данный системный вызов достаточно вручную объявить интерфейс в своём коде; или же вы можете вызвать его через B<syscall>(2).

source: The uninterruptible sleep that may occur if B<O_NONBLOCK> is omitted from I<flags> is considered undesirable, because the sleeping process is left in an unkillable state. As at Linux 3.7, specifying B<O_NONBLOCK> is optional, but in future kernels it is likely to become mandatory.
ru: Непрерываемый сон, который может начаться, если в I<flags> не указан флаг B<O_NONBLOCK>, считается нежелательным, так как спящий процесс находится в неубиваемом состоянии. В Linux 3.7 указание B<O_NONBLOCK> необязательно, но в будущих ядрах, он, вероятно, станет обязательным.

source: Linux 2.4 and earlier
ru: Linux версии 2.4 и более ранние

source: In Linux 2.4 and earlier, the system call took only one argument:
ru: В Linux версии 2.4 и более ранних системный вызов принимал один аргумент:

source: If I<name> is NULL, all unused modules marked auto-clean are removed.
ru: Если значение I<name> равно NULL, то все неиспользуемые модули, помеченные для автоматической вычистки, удаляются.

source: Some further details of differences in the behavior of B<delete_module>() in Linux 2.4 and earlier are I<not> currently explained in this manual page.
ru: Есть и некоторые другие отличия в поведении B<delete_module>() в Linux 2.4 и более ранних, I<но> они пока не описаны в этой справочной странице.

source: Linux User Manual
ru: Руководство пользователя Linux

source: dir_colors - configuration file for dircolors(1)
ru: dir_colors - файл настроек для утилиты dircolors(1)

source: The program B<ls>(1) uses the environment variable B<LS_COLORS> to determine the colors in which the filenames are to be displayed. This environment variable is usually set by a command like
ru: Программа B<ls>(1) использует переменную окружения B<LS_COLORS> для определения цветов, которыми должны отображаться имена файлов. Эта переменная окружения обычно устанавливается командой типа:

source: eval \`dircolors some_path/dir_colors\`
ru: eval \`dircolors некий_путь/dir_colors\`

source: found in a system default shell initialization file, like I</etc/profile> or I</etc/csh.cshrc>. (See also B<dircolors>(1).) Usually, the file used here is I</etc/DIR_COLORS> and can be overridden by a I<.dir_colors> file in one's home directory.
ru: Эта команда обычно находится в стандартном файле начальных настроек оболочки командной строки, например в I</etc/profile> или I</etc/csh.cshrc>. (Смотрите также B<dircolors>(1).) Обычно здесь используется файл I</etc/DIR_COLORS>, и его настройки могут быть изменены файлом I<.dir_colors> из каталога пользователя.

source: This configuration file consists of several statements, one per line. Anything right of a hash mark (#) is treated as a comment, if the hash mark is at the beginning of a line or is preceded by at least one whitespace. Blank lines are ignored.
ru: Данный файл настройки состоит из нескольких операторов, по одному в строке. Всё, что находится после символа решётки (#), считается комментарием (если этот символ находится в начале строки или перед ним находится как минимум один пробел). Пустые строки игнорируются.

source: The I<global> section of the file consists of any statement before the first B<TERM> statement. Any statement in the global section of the file is considered valid for all terminal types. Following the global section is one or more I<terminal-specific> sections, preceded by one or more B<TERM> statements which specify the terminal types (as given by the B<TERM> environment variable) the following declarations apply to. It is always possible to override a global declaration by a subsequent terminal-specific one.
ru: Все операторы, появившиеся до первого оператора B<TERM>, составляют I<глобальный> раздел. Они действуют для всех типов терминалов. После глобального раздела находится один или более разделов, описывающих определённые I<терминалы>. Он начинается с одного или более операторов B<TERM>, который задаёт тип терминала (то же имя, что указывается в переменной окружения B<TERM>). Для любого терминала глобальные настройки всегда можно перекрыть терминал-специфичными.

source: The following statements are recognized; case is insignificant:
ru: Распознаются следующие операторы (регистр букв неважен):

source: B<TERM >I<terminal-type>
ru: B<TERM >I<тип_терминала>

source: Starts a terminal-specific section and specifies which terminal it applies to. Multiple B<TERM> statements can be used to create a section which applies for several terminal types.
ru: Начинает раздел, специфичный для терминала, и указывает, к какому типу терминала он применим. Можно указывать несколько операторов B<TERM>, чтобы создать раздел, применимый к нескольким типам терминалов.

source: (Slackware only; ignored by GNU B<dircolors>(1).) Specifies that colorization should always be enabled (I<yes> or I<all>), never enabled (I<no> or I<none>), or enabled only if the output is a terminal (I<tty>). The default is I<no>.
ru: (Только для Slackware; игнорируется GNU B<dircolors>(1).) Указывает, что расцветка должна быть всегда разрешена (I<yes> или I<all>), никогда не разрешена (I<no> или I<none>), или разрешена, только если вывод происходит на терминальное устройство (I<tty>). По умолчанию I<no>.

source: (Slackware only; ignored by GNU B<dircolors>(1).) Specifies that eight-bit ISO 8859 characters should be enabled by default. For compatibility reasons, this can also be specified as 1 for I<yes> or 0 for I<no>. The default is I<no>.
ru: (Только для Slackware; игнорируется GNU B<dircolors>(1).) Указывает, разрешены ли по умолчанию восьмибитные символы ISO 8859. Из соображений совместимости можно также указывать 1 вместо I<yes> или 0 вместо I<no>. По умолчанию I<no>.

source: B<OPTIONS >I<options>
ru: B<OPTIONS >I<параметры>

source: (Slackware only; ignored by GNU B<dircolors>(1).) Adds command-line options to the default B<ls> command line. The options can be any valid B<ls> command-line options, and should include the leading minus sign. Note that B<dircolors> does not verify the validity of these options.
ru: (Только для Slackware; игнорируется GNU B<dircolors>(1).) Добавляет параметры по умолчанию к командной строке B<ls>. Здесь можно указать любой разрешённый параметр команды B<ls>, причем нужно указывать начальный знак минус. Заметьте, что B<dircolors> не проверяет, допустимы ли эти параметры.

source: B<NORMAL >I<color-sequence>
ru: B<NORMAL >I<цвет>

source: Specifies the color used for normal (nonfilename) text.
ru: Задаёт цвет, используемый для нормального (не имя файла) текста.

source: Synonym: B<NORM>.
ru: Синоним B<NORM>.

source: B<FILE >I<color-sequence>
ru: B<FILE >I<цвет>

source: Specifies the color used for a regular file.
ru: Задаёт цвет, используемый для обычных файлов.

source: B<DIR >I<color-sequence>
ru: B<DIR >I<цвет>

source: Specifies the color used for directories.
ru: Задаёт цвет, используемый для каталогов.

source: B<LINK >I<color-sequence>
ru: B<LINK >I<цвет>

source: Specifies the color used for a symbolic link.
ru: Задаёт цвет, используемый для символьных ссылок.

source: Synonyms: B<LNK>, B<SYMLINK>.
ru: Синонимы: B<LNK>, B<SYMLINK>.

source: B<ORPHAN >I<color-sequence>
ru: B<ORPHAN >I<цвет>

source: Specifies the color used for an orphaned symbolic link (one which points to a nonexistent file). If this is unspecified, B<ls> will use the B<LINK> color instead.
ru: Задаёт цвет, используемый для нерабочих символьных ссылок (указывающих на несуществующие файлы). Если этот цвет не задан, то B<ls> будет использовать вместо него цвет B<LINK>.

source: B<MISSING >I<color-sequence>
ru: B<MISSING >I<цвет>

source: Specifies the color used for a missing file (a nonexistent file which nevertheless has a symbolic link pointing to it). If this is unspecified, B<ls> will use the B<FILE> color instead.
ru: Задаёт цвет, используемый для отсутствующих файлов (несуществующих файлов, на которые указывают символьные ссылки). Если этот цвет не задан, то B<ls> будет использовать вместо него цвет B<FILE>.

source: B<FIFO >I<color-sequence>
ru: B<FIFO >I<цвет>

source: Specifies the color used for a FIFO (named pipe).
ru: Задаёт цвет, используемый для FIFO (именованных каналов).

source: Synonym: B<PIPE>.
ru: Синоним B<PIPE>.

source: B<SOCK >I<color-sequence>
ru: B<SOCK >I<цвет>

source: Specifies the color used for a socket.
ru: Задаёт цвет, используемый для сокетов.

source: B<DOOR >I<color-sequence>
ru: B<DOOR >I<цвет>

source: (Supported since fileutils 4.1) Specifies the color used for a door (Solaris 2.5 and later).
ru: (Поддерживается, начиная с fileutils 4.1) Задаёт цвет, используемый для файлов типа door (Solaris 2.5 и выше).

source: B<BLK >I<color-sequence>
ru: B<BLK >I<цвет>

source: Specifies the color used for a block device special file.
ru: Задаёт цвет, используемый для специальных файлов блочных устройств.

source: Synonym: B<BLOCK>.
ru: Синоним B<BLOCK>.

source: B<CHR >I<color-sequence>
ru: B<CHR >I<цвет>

source: Specifies the color used for a character device special file.
ru: Задаёт цвет, используемый для специальных файлов символьных устройств.

source: Synonym: B<CHAR>.
ru: Синоним B<CHAR>.

source: B<EXEC >I<color-sequence>
ru: B<EXEC >I<цвет>

source: Specifies the color used for a file with the executable attribute set.
ru: Задаёт цвет, используемый для файлов с установленным атрибутом выполнения.

source: B<SUID >I<color-sequence>
ru: B<SUID >I<цвет>

source: Specifies the color used for a file with the set-user-ID attribute set.
ru: Задаёт цвет, используемый для файлов с установленным битом set-user-ID.

source: Synonym: B<SETUID>.
ru: Синоним B<SETUID>.

source: B<SGID >I<color-sequence>
ru: B<SGID >I<цвет>

source: Specifies the color used for a file with the set-group-ID attribute set.
ru: Задаёт цвет, используемый для файлов с установленным битом set-group-ID.

source: Synonym: B<SETGID>.
ru: Синоним B<SETGID>.

source: B<STICKY >I<color-sequence>
ru: B<STICKY >I<цвет>

source: Specifies the color used for a directory with the sticky attribute set.
ru: Задаёт цвет, используемый для файлов с установленным закрепляющим (sticky) битом.

source: B<STICKY_OTHER_WRITABLE >I<color-sequence>
ru: B<STICKY_OTHER_WRITABLE >I<цвет>

source: Specifies the color used for an other-writable directory with the executable attribute set.
ru: Задаёт цвет, используемый для каталогов с установленным атрибутом выполнения и доступный на запись другим.

source: Synonym: B<OWT>.
ru: Синоним B<OWT>.

source: B<OTHER_WRITABLE >I<color-sequence>
ru: B<OTHER_WRITABLE >I<цвет>

source: Specifies the color used for an other-writable directory without the executable attribute set.
ru: Задаёт цвет, используемый для каталогов без установленного атрибута выполнения и доступный на запись другим.

source: Synonym: B<OWR>.
ru: Синоним B<OWR>.

source: B<LEFTCODE >I<color-sequence>
ru: B<LEFTCODE >I<цвет>

source: Specifies the I<left code> for non-ISO\ 6429 terminals (see below).
ru: Задаёт I<левый код> для не-ISO\ 6429 терминалов (см. ниже).

source: Synonym: B<LEFT>.
ru: Синоним B<LEFT>.

source: B<RIGHTCODE >I<color-sequence>
ru: B<RIGHTCODE >I<цвет>

source: Specifies the I<right code> for non-ISO\ 6429 terminals (see below).
ru: Задаёт I<правый код> для не-ISO\ 6429 терминалов (см. ниже).

source: Synonym: B<RIGHT>.
ru: Синоним B<RIGHT>.

source: B<ENDCODE >I<color-sequence>
ru: B<ENDCODE >I<цвет>

source: Specifies the I<end code> for non-ISO\ 6429 terminals (see below).
ru: Задаёт I<конечный код> для не-ISO\ 6429 терминалов (см. ниже).

source: Synonym: B<END>.
ru: Синоним B<END>.

source: B<*>I<extension> I<color-sequence>
ru: B<*>I<расширение> I<цвет>

source: Specifies the color used for any file that ends in I<extension>.
ru: Задаёт цвет, используемый для файлов, чьи имена заканчиваются на заданное I<расширение>.

source: B<.>I<extension> I<color-sequence>
ru: B<.>I<расширение> I<цвет>

source: Same as B<*>.I<extension>. Specifies the color used for any file that ends in .I<extension>. Note that the period is included in the extension, which makes it impossible to specify an extension not starting with a period, such as B<~> for B<emacs> backup files. This form should be considered obsolete.
ru: То же самое, что и B<*>.I<расширение>. Задаёт цвет, используемый для файлов, чьи имена заканчиваются указанным .I<расширением>. Заметьте, что точка входит в состав расширения, и из-за этого невозможно указать расширение, не начинающееся с точки, например B<~> для резервных копий редактора B<emacs>. Эта форма записи считается устаревшей.

source: ISO 6429 (ANSI) color sequences
ru: Цветовые последовательности ISO 6429 (ANSI)

source: Most color-capable ASCII terminals today use ISO 6429 (ANSI) color sequences, and many common terminals without color capability, including B<xterm> and the widely used and cloned DEC VT100, will recognize ISO 6429 color codes and harmlessly eliminate them from the output or emulate them. B<ls> uses ISO 6429 codes by default, assuming colorization is enabled.
ru: Большинство цветных ASCII-терминалов в настоящее время используют цветовые последовательности ISO 6429 (ANSI), а многие распространённые терминалы, не поддерживающие цвет, включая B<xterm> и широко используемый и клонируемый DEC VT100, распознают цветовые коды ISO 6429 и без последствий удаляют их из выходного потока или же эмулируют их. B<ls> по умолчанию использует коды ISO 6429, если включена расцветка.

source: ISO 6429 color sequences are composed of sequences of numbers separated by semicolons. The most common codes are:
ru: Цветовые последовательности ISO 6429 представляют собой последовательность чисел, разделённых точками с запятой. Самые распространенные коды:

source: to restore default color
ru: восстановить цвет по умолчанию

source: for brighter colors
ru: яркие цвета

source: for underlined text
ru: подчёркнутый текст

source: for flashing text
ru: мигающий текст

source: for black foreground
ru: чёрные символы

source: for red foreground
ru: красные символы

source: for green foreground
ru: зелёные символы

source: for yellow (or brown) foreground
ru: жёлтые (или коричневые) символы

source: for blue foreground
ru: синие символы

source: for purple foreground
ru: пурпурные символы

source: for cyan foreground
ru: бирюзовые символы

source: for white (or gray) foreground
ru: белые (или серые) символы

source: for black background
ru: чёрный фон

source: for red background
ru: красный фон

source: for green background
ru: зелёный фон

source: for yellow (or brown) background
ru: жёлтый (или коричневый) фон

source: for blue background
ru: синий фон

source: for purple background
ru: пурпурный фон

source: for cyan background
ru: бирюзовый фон

source: for white (or gray) background
ru: белый (или серый) фон

source: Not all commands will work on all systems or display devices.
ru: Не все команды будут работать на любой системе или устройстве отображения.

source: B<ls> uses the following defaults:
ru: B<ls> использует следующие значения по умолчанию:

source: Normal (nonfilename) text
ru: обычный (не имя файла) текст

source: Regular file
ru: обычный файл

source: Directory
ru: каталог

source: Symbolic link
ru: символьная ссылка

source: undefined
ru: не определено

source: Orphaned symbolic link
ru: сломанная символьная ссылка

source: Missing file
ru: отсутствующий файл

source: Named pipe (FIFO)
ru: именованный канал (FIFO)

source: Socket
ru: сокет

source: Block device
ru: блочное устройство

source: Character device
ru: символьное устройство

source: Executable file
ru: исполняемый файл
