Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_d/*.po
Languages: ru

source: Any global symbols in the executable that were placed into its dynamic symbol table by B<ld>(1) can also be used to resolve references in a dynamically loaded shared object. Symbols may be placed in the dynamic symbol table either because the executable was linked with the flag "-rdynamic" (or, synonymously, "--export-dynamic"), which causes all of the executable's global symbols to be placed in the dynamic symbol table, or because B<ld>(1) noted a dependency on a symbol in another object during static linking.
ru: Все глобальные символы в исполняемом файле, которые были помещены в его таблицу динамических символов посредством B<ld>(1), также могут быть использованы при поиске ссылок динамически загружаемого общего объекта. Символы могут попасть в таблицу динамических символов из-за того, что исполняемый файл был скомпонован с флагом «-rdynamic» (или его синонимом «--export-dynamic»), который помещает что все глобальные символы исполняемого файла в таблицу динамических символов, или из-за того, что B<ld>(1) определил зависимость от символа из другого объекта при статической компоновке.

source: If the same shared object is opened again with B<dlopen>(), the same object handle is returned. The dynamic linker maintains reference counts for object handles, so a dynamically loaded shared object is not deallocated until B<dlclose>() has been called on it as many times as B<dlopen>() has succeeded on it. Constructors (see below) are called only when the object is actually loaded into memory (i.e., when the reference count increases to 1).
ru: Если общий объект загружается с помощью B<dlopen>() повторно, то возвращается тот же описатель на объект. Динамический компоновщик ведёт счётчик ссылок для описателей объектов, поэтому динамически загруженный общий объект не высвобождается B<dlclose>() до тех пор, пока он не будет вызвана столько же раз сколько и B<dlopen>(). Процедуры инициализации (смотрите ниже) вызываются только когда объект действительно загружается в память (т. е., когда счётчик ссылок увеличивается на 1).

source: A subsequent B<dlopen>() call that loads the same shared object with B<RTLD_NOW> may force symbol resolution for a shared object earlier loaded with B<RTLD_LAZY>. Similarly, an object that was previously opened with B<RTLD_LOCAL> can be promoted to B<RTLD_GLOBAL> in a subsequent B<dlopen>().
ru: Последующий вызов B<dlopen>(), загружающий тот же общий объект с флагом B<RTLD_NOW>, может привести к поиску символов для общего объекта ранее загруженного с флагом B<RTLD_LAZY>. Схожим образом объект, открытый ранее с флагом B<RTLD_LOCAL>, в последующем вызове B<dlopen>() может быть преобразован в B<RTLD_GLOBAL>.

source: If B<dlopen>() fails for any reason, it returns NULL.
ru: Если по какой-то причине B<dlopen>() завершается неудачно, то возвращается NULL.

source: This function performs the same task as B<dlopen>()\(emthe I<filename> and I<flags> arguments, as well as the return value, are the same, except for the differences noted below.
ru: Данная функция делает то же самое что и B<dlopen>(), аргументы I<filename> и I<flags>, а также возвращаемое значение — такие же, отличия описаны далее.

source: The B<dlmopen>() function differs from B<dlopen>() primarily in that it accepts an additional argument, I<lmid>, that specifies the link-map list (also referred to as a I<namespace>) in which the shared object should be loaded. (By comparison, B<dlopen>() adds the dynamically loaded shared object to the same namespace as the shared object from which the B<dlopen>() call is made.) The I<Lmid_t> type is an opaque handle that refers to a namespace.
ru: Функция B<dlmopen>() отличается от B<dlopen>(), главным образом в том, что имеет дополнительный аргумент I<lmid>, в котором задаётся список карт связей (link-map list, ещё называемый I<пространством имён>), в который должен быть загружен общий объект (B<dlopen>() добавляет динамически загружаемый общий объект в тоже пространство имён, в котором находится общий объект, из которого был вызван B<dlopen>()). Тип I<Lmid_t> является скрытым описателем, который ссылается на пространство имён.

source: The I<lmid> argument is either the ID of an existing namespace (which can be obtained using the B<dlinfo>(3) B<RTLD_DI_LMID> request) or one of the following special values:
ru: В аргументе I<lmid> может быть указан ID существующего пространства имён (который может быть получен с помощью B<dlinfo>(3) с запросом B<RTLD_DI_LMID>) или одно из следующих специальных значений:

source: Load the shared object in the initial namespace (i.e., the application's namespace).
ru: Загрузить общий объект в начальное пространство имён (т. е., в пространство имён приложения).

source: Create a new namespace and load the shared object in that namespace. The object must have been correctly linked to reference all of the other shared objects that it requires, since the new namespace is initially empty.
ru: Создать новое пространство имён и загрузить в него общий объект. Объект должен быть корректно скомпонован с ссылками на все остальные общие объекты, которые ему требуются, так как новое пространство имён изначально пустое.

source: If I<filename> is NULL, then the only permitted value for I<lmid> is B<LM_ID_BASE>.
ru: Если I<filename> равно NULL, то для I<lmid> разрешено только значение B<LM_ID_BASE>.

source: The function B<dlclose>() decrements the reference count on the dynamically loaded shared object referred to by I<handle>.
ru: Функция B<dlclose>() уменьшает счётчик ссылок на динамически загружаемый общий объект, на который ссылается I<handle>.

source: If the object's reference count drops to zero and no symbols in this object are required by other objects, then the object is unloaded after first calling any destructors defined for the object. (Symbols in this object might be required in another object because this object was opened with the B<RTLD_GLOBAL> flag and one of its symbols satisfied a relocation in another object.)
ru: Если счётчик ссылок достигает нуля и символы этого объекта не нужны другим объектам, то объект выгружается после первого вызова любого деструктора, определённого в объекте (символы в этом объекте могут требоваться в другом объекте из-за того, что этот объект был открыт с флагом B<RTLD_GLOBAL> и один из его символов совпадает с расположением из другого объекта).

source: All shared objects that were automatically loaded when B<dlopen>() was invoked on the object referred to by I<handle> are recursively closed in the same manner.
ru: Все общие объекты, которые были автоматически загружены при вызове B<dlopen>() для объекта, на который ссылается I<handle>, рекурсивно закрываются таким же способом.

source: A successful return from B<dlclose>() does not guarantee that the symbols associated with I<handle> are removed from the caller's address space. In addition to references resulting from explicit B<dlopen>() calls, a shared object may have been implicitly loaded (and reference counted) because of dependencies in other shared objects. Only when all references have been released can the shared object be removed from the address space.
ru: Успешный возврат из B<dlclose>() не гарантирует, что символы, связанные с I<handle> удалятся из адресного пространства вызывающего. В дополнении к ссылкам, полученным из-за явного вызова B<dlopen>(), общий объект может быть загружен неявно (и увеличится счётчик ссылок), так как от него зависят другие общие объекты. Общий объект будет удалён из адресного пространства только когда будут удалены все ссылки на него.

source: On success, B<dlopen>() and B<dlmopen>() return a non-NULL handle for the loaded object. On error (file could not be found, was not readable, had the wrong format, or caused errors during loading), these functions return NULL.
ru: При успешном выполнении B<dlopen>() и B<dlmopen>() для загруженного объекта возвращают описатель не равный NULL. При ошибке (файл не найден, недоступен для чтения, имеет неправильный формат или возникли ошибке при загрузке) эти функции возвращают NULL.

source: On success, B<dlclose>() returns 0; on error, it returns a nonzero value.
ru: При успешном выполнении B<dlclose>() возвращает 0; при ошибке возвращается ненулевое значение.

source: Errors from these functions can be diagnosed using B<dlerror>(3).
ru: Ошибки, возникшие в этих функциях, можно определить с помощью B<dlerror>(3).

source: B<dlopen>() and B<dlclose>() are present in glibc 2.0 and later. B<dlmopen>() first appeared in glibc 2.3.4.
ru: Функции B<dlopen>() и B<dlclose>() имеются в glibc 2.0 и новее. Функция B<dlmopen>() впервые появилась в glibc 2.3.4.

source: POSIX.1-2001 describes B<dlclose>() and B<dlopen>(). The B<dlmopen>() function is a GNU extension.
ru: В POSIX.1-2001 описаны B<dlclose>() и B<dlopen>(). Функция B<dlmopen>() является расширением GNU.

source: The B<RTLD_NOLOAD>, B<RTLD_NODELETE>, and B<RTLD_DEEPBIND> flags are GNU extensions; the first two of these flags are also present on Solaris.
ru: Флаги B<RTLD_NOLOAD>, B<RTLD_NODELETE> и B<RTLD_DEEPBIND> являются расширением GNU; первые два этих флага есть также в Solaris.

source: dlmopen() and namespaces
ru: Функция dlmopen() и пространства имён

source: A link-map list defines an isolated namespace for the resolution of symbols by the dynamic linker. Within a namespace, dependent shared objects are implicitly loaded according to the usual rules, and symbol references are likewise resolved according to the usual rules, but such resolution is confined to the definitions provided by the objects that have been (explicitly and implicitly) loaded into the namespace.
ru: Списком карты связей задаётся изолированное пространство имён для определения символов динамическим компоновщиком. Внутри пространства имён зависимые общие объекты неявно загружаются по обычным правилам, символьные ссылки разрешаются подобным образом, но при этом учитываются только те объекты, которые были загружены (явно и неявно) в пространство имён.

source: The B<dlmopen>() function permits object-load isolation\(emthe ability to load a shared object in a new namespace without exposing the rest of the application to the symbols made available by the new object. Note that the use of the B<RTLD_LOCAL> flag is not sufficient for this purpose, since it prevents a shared object's symbols from being available to I<any> other shared object. In some cases, we may want to make the symbols provided by a dynamically loaded shared object available to (a subset of) other shared objects without exposing those symbols to the entire application. This can be achieved by using a separate namespace and the B<RTLD_GLOBAL> flag.
ru: Функция B<dlmopen>() позволяет достичь изоляции загружаемых объектов — загружает общий объект в новое пространство имён без показа символов всему приложению, а только новому объекту. Заметим, что использование флага B<RTLD_LOCAL> недостаточно для этой цели, так как он делает недоступным символы общего объекта I<любому> другому общему объекту. В некоторых случаях может понадобиться, чтобы символы динамически загружаемого общего объекта были доступны другим общим объектам (но не всем объектам) без показа этих символов всему приложению. Этого можно достичь используя отдельное пространство имён и флаг B<RTLD_GLOBAL>.

source: The B<dlmopen>() function also can be used to provide better isolation than the B<RTLD_LOCAL> flag. In particular, shared objects loaded with B<RTLD_LOCAL> may be promoted to B<RTLD_GLOBAL> if they are dependencies of another shared object loaded with B<RTLD_GLOBAL>. Thus, B<RTLD_LOCAL> is insufficient to isolate a loaded shared object except in the (uncommon) case where one has explicit control over all shared object dependencies.
ru: Функцию B<dlmopen>() также можно использовать для получения изолированности, большей чем с флагом B<RTLD_LOCAL>. В частности, общие объекты, загруженные с B<RTLD_LOCAL>, могут быть видимы при флаге B<RTLD_GLOBAL>, если они зависят от другого общего объекта, загруженного с флагом B<RTLD_GLOBAL>. То есть, B<RTLD_LOCAL> недостаточно изолирует загружаемый общий объект, за исключением случая (редкого), где он явно контролирует зависимости всех загружаемых общих объектов.

source: Possible uses of B<dlmopen>() are plugins where the author of the plugin-loading framework can't trust the plugin authors and does not wish any undefined symbols from the plugin framework to be resolved to plugin symbols. Another use is to load the same object more than once. Without the use of B<dlmopen>(), this would require the creation of distinct copies of the shared object file. Using B<dlmopen>(), this can be achieved by loading the same shared object file into different namespaces.
ru: Возможный случай применения B<dlmopen>() — модули, где автор инфраструктуры модулей не может доверять авторам модулей и не хочет, чтобы все неопределённые символы инфраструктуры модулей определялись из модулей. Другой случай использования — загрузка одного объекта несколько раз. Без B<dlmopen>() это потребовало бы создание отдельных копий файлов общего объекта. С помощью B<dlmopen>() можно загрузить один файл общего объекта в разные пространства имён.

source: The glibc implementation supports a maximum of 16 namespaces.
ru: В реализации glibc поддерживается до 16 пространств имён.

source: Initialization and finalization functions
ru: Функции инициализации и завершения

source: Shared objects may export functions using the B<__attribute__((constructor))> and B<__attribute__((destructor))> function attributes. Constructor functions are executed before B<dlopen>() returns, and destructor functions are executed before B<dlclose>() returns. A shared object may export multiple constructors and destructors, and priorities can be associated with each function to determine the order in which they are executed. See the B<gcc> info pages (under "Function attributes") for further information.
ru: Общие объекты могут экспортировать с помощью атрибутов функций B<__attribute__((constructor))> и B<__attribute__((destructor))>. Функции-конструкторы выполняются перед возвратом из B<dlopen>(), а функции-деструкторы выполняются перед возвратом из B<dlclose>(). Общий объект может экспортировать несколько конструкторов и деструкторов, с каждой функцией может быть связан приоритет, которым определяется порядок выполнения функций. Подробней смотрите info-страницу B<gcc> (раздел «Атрибуты функции»).

source: An older method of (partially) achieving the same result is via the use of two special symbols recognized by the linker: B<_init> and B<_fini>. If a dynamically loaded shared object exports a routine named B<_init>(), then that code is executed after loading a shared object, before B<dlopen>() returns. If the shared object exports a routine named B<_fini>(), then that routine is called just before the object is unloaded. In this case, one must avoid linking against the system startup files, which contain default versions of these files; this can be done by using the B<gcc>(1) I<-nostartfiles> command-line option.
ru: Старым способом достижения того же (частично) результата является использование двух специальных символов, распознаваемых компоновщиком: B<_init> и B<_fini>. Если динамически загружаемый общий объект экспортирует процедуру с именем B<_init>(), то её код выполняется после загрузки общего объекта, но возвращения из B<dlopen>(). Если общий объект экспортирует процедуру с именем B<_fini>(), то её код выполняется перед выгрузкой объекта. В этом случае не должна выполняться компоновка с системными файлами начального запуска, в которых содержатся версии по умолчанию этих файлов; для этого нужно вызывать B<gcc>(1) с параметром командной строки I<-nostartfiles>.

source: Use of B<_init> and B<_fini> is now deprecated in favor of the aforementioned constructors and destructors, which among other advantages, permit multiple initialization and finalization functions to be defined.
ru: Использование B<_init> и B<_fini> теперь не рекомендуется, используйте упомянутые конструкторы и деструкторы, которые, среди прочих преимуществ, позволяют определять многократно вызываемые функции инициализации и завершения.

source: Since glibc 2.2.3, B<atexit>(3) can be used to register an exit handler that is automatically called when a shared object is unloaded.
ru: Начиная с glibc 2.2.3, B<atexit>(3) может использоваться для регистрации обработчика завершения работы, который автоматически вызывается при выгрузке общего объекта.

source: These functions are part of the dlopen API, derived from SunOS.
ru: Эти функции являются часть программного интерфейса dlopen, возникшего в SunOS.

source: As at glibc 2.24, specifying the B<RTLD_GLOBAL> flag when calling B<dlmopen>() generates an error. Furthermore, specifying B<RTLD_GLOBAL> when calling B<dlopen>() results in a program crash (B<SIGSEGV>) if the call is made from any object loaded in a namespace other than the initial namespace.
ru: В glibc 2.24 указание флага B<RTLD_GLOBAL> при вызове B<dlmopen>() приводит к ошибке. Кроме этого, указание B<RTLD_GLOBAL> при вызове B<dlopen>() приводит к падению программы (B<SIGSEGV>), если вызов делается из любого объекта, загруженного в пространство имён, отличное от начального пространства имён.

source: The program below loads the (glibc) math library, looks up the address of the B<cos>(3) function, and prints the cosine of 2.0. The following is an example of building and running the program:
ru: Программа, представленная ниже, загружает библиотеку math (glibc), ищет адрес функции B<cos>(3) и печатает косинус 2.0. Пример сборки и выполнения программы:

source: #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>dlfcn.hE<gt> #include E<lt>gnu/lib-names.hE<gt> /* Defines LIBM_SO (which will be a string such as "libm.so.6") */ int main(void) { void *handle; double (*cosine)(double); char *error;
ru: #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>dlfcn.hE<gt> #include E<lt>gnu/lib-names.hE<gt> /* определение LIBM_SO (который является строкой вида libm.so.6») */ int main(void) { void *handle; double (*cosine)(double); char *error;

source: dlerror(); /* Clear any existing error */
ru: dlerror(); /* Очистка всех результатов ошибок */

source: /* According to the ISO C standard, casting between function pointers and 'void *', as done above, produces undefined results. POSIX.1-2003 and POSIX.1-2008 accepted this state of affairs and proposed the following workaround:
ru: /* Согласно стандарту ISO C, преобразование между указателями на функции и «void *», использовавшемуся выше, приводит к неопределённым результатам. В POSIX.1-2003 и POSIX.1-2008 принимается такое поведение и предлагается следующий обходной вариант:

source: This (clumsy) cast conforms with the ISO C standard and will avoid any compiler warnings.
ru: Такое (топорное) преобразование удовлетворяет стандарту ISO C и предупреждений компилятора не будет.

source: The 2013 Technical Corrigendum to POSIX.1-2008 (a.k.a. POSIX.1-2013) improved matters by requiring that conforming implementations support casting 'void *' to a function pointer. Nevertheless, some compilers (e.g., gcc with the '-pedantic' option) may complain about the cast used in this program. */
ru: Список опечаток 2013 к POSIX.1-2008 (т.н. POSIX.1-2013) улучшает состояние, требуя от реализаций поддержки преобразования «void *» в указатель на функцию. Тем не менее, некоторые компиляторы (например, gcc с параметром «-pedantic») могут выдавать предупреждение о преобразовании в этой программе. */

source: gcc info pages, ld info pages
ru: Страницы в формате Info для gcc и ld

source: dladdr, dladdr1 - translate address to symbolic information
ru: dladdr, dladdr1 - транслирует адрес в информацию о символе

source: The function B<dladdr>() determines whether the address specified in I<addr> is located in one of the shared objects loaded by the calling application. If it is, then B<dladdr>() returns information about the shared object and symbol that overlaps I<addr>. This information is returned in a I<Dl_info> structure:
ru: Функция B<dladdr>() определяет, в каком из загруженных общих объектов приложения расположен адрес, указанный в I<addr>. Если объект находится, то B<dladdr>() возвращает информацию об общем объекте и символе, который относится к адресу I<addr>. Данная информация возвращается в виде структуры I<Dl_info>:

source: typedef struct { const char *dli_fname; /* Pathname of shared object that contains address */ void *dli_fbase; /* Base address at which shared object is loaded */ const char *dli_sname; /* Name of symbol whose definition overlaps I<addr> */ void *dli_saddr; /* Exact address of symbol named in I<dli_sname> */ } Dl_info;
ru: typedef struct { const char *dli_fname; /* путь к общему объекту, который содержит адрес */ void *dli_fbase; /* начальный адрес, по которому расположен общий объект */ const char *dli_sname; /* имя символа, к которому относится адрес I<addr> */ void *dli_saddr; /* точный адрес символа с именем I<dli_sname> */ } Dl_info;

source: If no symbol matching I<addr> could be found, then I<dli_sname> and I<dli_saddr> are set to NULL.
ru: Если символ, соответствующий адресу I<addr>, не найден, то I<dli_sname> и I<dli_saddr> устанавливаются в NULL.

source: The function B<dladdr1>() is like B<dladdr>(), but returns additional information via the argument I<extra_info>. The information returned depends on the value specified in I<flags>, which can have one of the following values:
ru: Функция B<dladdr1>() подобна B<dladdr>(), но возвращает дополнительную информацию в аргументе I<extra_info>. Возвращаемая информация зависит от значения, указанного в I<flags>, которое может быть одним из:

source: Obtain a pointer to the link map for the matched file. The I<extra_info> argument points to a pointer to a I<link_map> structure (i.e., I<struct link_map\ **>), defined in I<E<lt>link.hE<gt>> as:
ru: Возвратить указатель на карту ссылок для совпадающего файла. Аргумент I<extra_info> указывает на указатель на структуру I<link_map> (т. е., I<struct link_map\ **>), определённую в I<E<lt>link.hE<gt>> так:

source: Obtain a pointer to the ELF symbol table entry of the matching symbol. The I<extra_info> argument is a pointer to a symbol pointer: I<const ElfW(Sym) **>. The I<ElfW>() macro definition turns its argument into the name of an ELF data type suitable for the hardware architecture. For example, on a 64-bit platform, I<ElfW(Sym)> yields the data type name I<Elf64_Sym>, which is defined in I<E<lt>elf.hE<gt>> as:
ru: Возвращает указатель на элемент символьной таблицы ELF с совпадающим символом. Аргумент I<extra_info> — указатель на символьный указатель: I<const ElfW(Sym) **>. Макрос I<ElfW>() преобразует этот аргумент в имя типа данных ELF, подходящее для аппаратной архитектуры. Например, на 64-битной платформе I<ElfW(Sym)> возвращает имя типа данных I<Elf64_Sym>, которое определено в I<E<lt>elf.hE<gt>> так:

source: typedef struct { Elf64_Word st_name; /* Symbol name */ unsigned char st_info; /* Symbol type and binding */ unsigned char st_other; /* Symbol visibility */ Elf64_Section st_shndx; /* Section index */ Elf64_Addr st_value; /* Symbol value */ Elf64_Xword st_size; /* Symbol size */ } Elf64_Sym;
ru: typedef struct { Elf64_Word st_name; /* имя символа */ unsigned char st_info; /* тип символа и привязка */ unsigned char st_other; /* видимость символа */ Elf64_Section st_shndx; /* номер раздела */ Elf64_Addr st_value; /* значение символа */ Elf64_Xword st_size; /* размер символа */ } Elf64_Sym;

source: The I<st_name> field is an index into the string table.
ru: Поле I<st_name> — номер в строковой таблице.
