Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The caller tried to increase the hard B<RLIMIT_NOFILE> limit above the maximum defined by I</proc/sys/fs/nr_open> (see B<proc>(5))
ru: Вызывающий пытался увеличить жёсткое ограничение B<RLIMIT_NOFILE>, превышая максимум, заданный в I</proc/sys/fs/nr_open> (смотрите B<proc>(5)).

source: (B<prlimit>()) The calling process did not have permission to set limits for the process specified by I<pid>.
ru: Вызывающий процесс не имеет прав для назначения ограничений процессу, указанному в I<pid>.

source: Could not find a process with the ID specified in I<pid>.
ru: Не удалось найти процесс с идентификатором, указанном в I<pid>.

source: The B<prlimit>() system call is available since Linux 2.6.36. Library support is available since glibc 2.13.
ru: Системный вызов B<prlimit>() появился в Linux 2.6.36. Поддержка в glibc доступна начиная с версии 2.13.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: B<prlimit>(): Linux-specific.
ru: B<prlimit>(): только в Linux.

source: B<RLIMIT_MEMLOCK> and B<RLIMIT_NPROC> derive from BSD and are not specified in POSIX.1; they are present on the BSDs and Linux, but on few other implementations. B<RLIMIT_RSS> derives from BSD and is not specified in POSIX.1; it is nevertheless present on most implementations. B<RLIMIT_MSGQUEUE>, B<RLIMIT_NICE>, B<RLIMIT_RTPRIO>, B<RLIMIT_RTTIME>, and B<RLIMIT_SIGPENDING> are Linux-specific.
ru: Ограничение B<RLIMIT_MEMLOCK> и B<RLIMIT_NPROC> появились из BSD и их нет в POSIX.1; они есть в BSD и Linux, но реализации несколько различны. Ограничение B<RLIMIT_RSS> появилось из BSD и его нет в POSIX.1; тем не менее оно есть в большинстве реализаций. Ограничения B<RLIMIT_MSGQUEUE>, B<RLIMIT_NICE>, B<RLIMIT_RTPRIO>, B<RLIMIT_RTTIME> и B<RLIMIT_SIGPENDING> есть только в Linux.

source: A child process created via B<fork>(2) inherits its parent's resource limits. Resource limits are preserved across B<execve>(2).
ru: Дочерний процесс, созданный B<fork>(2), наследует ограничения ресурсов родителя. Ограничения ресурсов сохраняются при B<execve>(2).

source: Resource limits are per-process attributes that are shared by all of the threads in a process.
ru: Атрибуты ограничения ресурсов есть у каждого процесса, они являются общими для всех нитей процесса.

source: Lowering the soft limit for a resource below the process's current consumption of that resource will succeed (but will prevent the process from further increasing its consumption of the resource).
ru: Уменьшение мягкого ограничения ресурса ниже текущего потребления процесса будет выполнено (но в дальнейшем процесс не сможет увеличить потребление ресурса).

source: One can set the resource limits of the shell using the built-in I<ulimit> command (I<limit> in B<csh>(1)). The shell's resource limits are inherited by the processes that it creates to execute commands.
ru: Ограничения ресурсов интерпретатора командной строки можно устанавливать с помощью встроенной команды I<ulimit> (I<limit> в B<csh>(1)). Ограничения ресурсов интерпретатора наследуются дочерними процессами, которые он создаёт при выполнении команд.

source: Since Linux 2.6.24, the resource limits of any process can be inspected via I</proc/[pid]/limits>; see B<proc>(5).
ru: Начиная с Linux 2.6.24, ограничения ресурсов любого процесса можно узнать с помощью I</proc/[pid]/limits>; смотрите B<proc>(5).

source: Ancient systems provided a B<vlimit>() function with a similar purpose to B<setrlimit>(). For backward compatibility, glibc also provides B<vlimit>(). All new applications should be written using B<setrlimit>().
ru: В старых системах была функция B<vlimit>() с подобным B<setrlimit>() назначением. Для обратной совместимости в glibc также есть функция B<vlimit>(). Во всех новых приложениях должен быть использован B<setrlimit>().

source: C library/kernel ABI differences
ru: Отличия между библиотекой C и ABI ядра

source: Since version 2.13, the glibc B<getrlimit>() and B<setrlimit>() wrapper functions no longer invoke the corresponding system calls, but instead employ B<prlimit>(), for the reasons described in BUGS.
ru: Начиная с версии 2.13, обёрточные функции glibc B<getrlimit>() и B<setrlimit>() больше не вызывают соответствующие системные вызовы, вместо этого вызывается B<prlimit>() по причинам, описанным в разделе ДЕФЕКТЫ.

source: The name of the glibc wrapper function is B<prlimit>(); the underlying system call is B<prlimit64>().
ru: Обёрточная функция в glibc называется B<prlimit>(); нижележащий системный вызов называется B<prlimit64>().

source: In older Linux kernels, the B<SIGXCPU> and B<SIGKILL> signals delivered when a process encountered the soft and hard B<RLIMIT_CPU> limits were delivered one (CPU) second later than they should have been. This was fixed in kernel 2.6.8.
ru: В старых ядрах Linux сигналы B<SIGXCPU> и B<SIGKILL>, посылаемые когда у процесса обнаруживается достижение мягкого и жёсткого ограничения B<RLIMIT_CPU>, доставляются на одну секунду (ЦП) позднее чем это должно быть. Это исправлено в ядре версии 2.6.8.

source: In 2.6.x kernels before 2.6.17, a B<RLIMIT_CPU> limit of 0 is wrongly treated as "no limit" (like B<RLIM_INFINITY>). Since Linux 2.6.17, setting a limit of 0 does have an effect, but is actually treated as a limit of 1 second.
ru: В ядрах 2.6.x до версии 2.6.17, ограничение B<RLIMIT_CPU> равное 0, неправильно воспринималось как «без ограничения» (подобно B<RLIM_INFINITY>). Начиная с Linux 2.6.17, установка ограничения в 0 действует, но реально обрабатывается как ограничение в 1 секунду.

source: A kernel bug means that B<RLIMIT_RTPRIO> does not work in kernel 2.6.12; the problem is fixed in kernel 2.6.13.
ru: Из-за дефекта ядра B<RLIMIT_RTPRIO> не работает в версии 2.6.12; это исправлено в ядре 2.6.13.

source: In kernel 2.6.12, there was an off-by-one mismatch between the priority ranges returned by B<getpriority>(2) and B<RLIMIT_NICE>. This had the effect that the actual ceiling for the nice value was calculated as I<19\ -\ rlim_cur>. This was fixed in kernel 2.6.13.
ru: В ядре 2.6.12 было несоответствие в единицу между диапазонами приоритетов, возвращаемых B<getpriority>(2) и B<RLIMIT_NICE>. Это приводило к тому, что реальный максимум значения nice вычислялся как I<19\ - \ rlim_cur>. Исправлено в ядре 2.6.13.

source: Since Linux 2.6.12, if a process reaches its soft B<RLIMIT_CPU> limit and has a handler installed for B<SIGXCPU>, then, in addition to invoking the signal handler, the kernel increases the soft limit by one second. This behavior repeats if the process continues to consume CPU time, until the hard limit is reached, at which point the process is killed. Other implementations do not change the B<RLIMIT_CPU> soft limit in this manner, and the Linux behavior is probably not standards conformant; portable applications should avoid relying on this Linux-specific behavior. The Linux-specific B<RLIMIT_RTTIME> limit exhibits the same behavior when the soft limit is encountered.
ru: Начиная с Linux 2.6.12, если процесс имеет мягкое ограничение B<RLIMIT_CPU> и установлен обработчик для B<SIGXCPU>, то, помимо вызова обработчика сигнала, ядро увеличивает мягкое ограничение на одну секунду. Такое поведение повторяется, если процесс продолжает потреблять процессорное время, и происходит это до тех пор, пока не будет достигнуто жёсткое ограничение, после чего процесс будет завершён. В других реализациях мягкое ограничение B<RLIMIT_CPU> не меняется подобным образом, и поведение Linux, вероятно, нестандартно; переносимые приложения не должны полагаться на данную специфику Linux. Ограничение Linux B<RLIMIT_RTTIME> демонстрирует такое же поведение, при исчерпании мягкого ограничения.

source: Kernels before 2.4.22 did not diagnose the error B<EINVAL> for B<setrlimit>() when I<rlim-E<gt>rlim_cur> was greater than I<rlim-E<gt>rlim_max>.
ru: В ядрах до 2.4.22 не определялась ошибка B<EINVAL> в B<setrlimit>(), если значение I<rlim-E<gt>rlim_cur> было больше I<rlim-E<gt>rlim_max>.

source: Linux doesn't return an error when an attempt to set B<RLIMIT_CPU> has failed, for compatibility reasons.
ru: В целях совместимости, Linux не возвращает ошибку при неудачной попытке назначения B<RLIMIT_CPU>.

source: Representation of "large" resource limit values on 32-bit platforms
ru: Представление «больших» значений ограничений ресурсов на 32-битных платформах

source: The glibc B<getrlimit>() and B<setrlimit>() wrapper functions use a 64-bit I<rlim_t> data type, even on 32-bit platforms. However, the I<rlim_t> data type used in the B<getrlimit>() and B<setrlimit>() system calls is a (32-bit) I<unsigned long>. Furthermore, in Linux, the kernel represents resource limits on 32-bit platforms as I<unsigned long>. However, a 32-bit data type is not wide enough. The most pertinent limit here is B<RLIMIT_FSIZE>, which specifies the maximum size to which a file can grow: to be useful, this limit must be represented using a type that is as wide as the type used to represent file offsets\(emthat is, as wide as a 64-bit B<off_t> (assuming a program compiled with I<_FILE_OFFSET_BITS=64>).
ru: В обёрточных функциях glibc B<getrlimit>() и B<setrlimit>() используется 64-битный тип данных I<rlim_t>, даже на 32-битных платформах. Однако в системных вызовах B<getrlimit>() и B<setrlimit>() тип данных I<rlim_t> приводится к I<unsigned long> (32-битному). Кроме этого, в ядре Linux ограничители ресурсов на 32-битных платформах представлены типом I<unsigned long>. Однако 32-битный тип данных недостаточно велик. Для этого больше подходит B<RLIMIT_FSIZE>, который определяет максимальный размер на который можно увеличить файл; чтобы его можно было использовать, данное ограничение должно быть представлено типом, соразмерным с типом, используемым для представления файловых смещений — 64-битным B<off_t> (предполагается, что программа компилируется в параметром I<_FILE_OFFSET_BITS=64>).

source: To work around this kernel limitation, if a program tried to set a resource limit to a value larger than can be represented in a 32-bit I<unsigned long>, then the glibc B<setrlimit>() wrapper function silently converted the limit value to B<RLIM_INFINITY>. In other words, the requested resource limit setting was silently ignored.
ru: Если программа пытается задать ограничение ресурса значением, большим чем можно представить 32-битным I<unsigned long>, то, чтобы обойти это ограничение ядра, обёрточная функция glibc B<setrlimit>() просто преобразует значение ограничения в B<RLIM_INFINITY>. Иначе говоря, запрашиваемое назначение ограничения ресурса просто игнорируется.

source: Since version 2.13, glibc works around the limitations of the B<getrlimit>() and B<setrlimit>() system calls by implementing B<setrlimit>() and B<getrlimit>() as wrapper functions that call B<prlimit>().
ru: Начиная с версии 2.13, в glibc для обхода ограничений системных вызовов B<getrlimit>() и B<setrlimit>() для реализации обёрточных функций B<setrlimit>() и B<getrlimit>() используется вызов B<prlimit>().

source: The program below demonstrates the use of B<prlimit>().
ru: Представленная ниже программа показывает использование B<prlimit>().

source: if (!(argc == 2 || argc == 4)) { fprintf(stderr, "Usage: %s E<lt>pidE<gt> [E<lt>new-soft-limitE<gt> " "E<lt>new-hard-limitE<gt>]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (!(argc == 2 || argc == 4)) { fprintf(stderr, "Использование: %s E<lt>pidE<gt> [E<lt>новое-мягкое-ограничениеE<gt> " "E<lt>новое-жёсткое-ограничениеE<gt>]\en", argv[0]); exit(EXIT_FAILURE); }

source: pid = atoi(argv[1]); /* PID of target process */
ru: pid = atoi(argv[1]); /* PID процесса назначения */

source: /* Set CPU time limit of target process; retrieve and display previous limit */
ru: /* Установить ограничение на время ЦП процесса назначения; получить и показать предыдущее ограничение */

source: /* Retrieve and display new CPU time limit */
ru: /* Получить и показать новое ограничение времени ЦП */

source: if (prlimit(pid, RLIMIT_CPU, NULL, &old) == -1) errExit("prlimit-2"); printf("New limits: soft=%lld; hard=%lld\en", (long long) old.rlim_cur, (long long) old.rlim_max);
ru: if (prlimit(pid, RLIMIT_CPU, NULL, &old) == -1) errExit("prlimit-2"); printf("Новые ограничения: мягкое=%lld; жёсткое=%lld\en", (long long) old.rlim_cur, (long long) old.rlim_max);

source: getitimer, setitimer - get or set value of an interval timer
ru: getitimer, setitimer - считывает или устанавливает значение таймера интервалов

source: These system calls provide access to interval timers, that is, timers that initially expire at some point in the future, and (optionally) at regular intervals after that. When a timer expires, a signal is generated for the calling process, and the timer is reset to the specified interval (if the interval is nonzero).
ru: Данные системные вызовы предоставляют доступ к интервальным таймерам, то есть таймерам, у которых изначально истекает срок в будущем, и (необязательно) с регулярными интервалами после. Когда у таймера истекает срок, вызвавшему процессу отправляется сигнал и таймер перезапускается с задаваемым интервалом (если интервал не равен нулю).

source: Three types of timers\(emspecified via the I<which> argument\(emare provided, each of which counts against a different clock and generates a different signal on timer expiration:
ru: В аргументе I<which> можно задать три типа таймеров, каждый выполняет отсчёт по разным часам и генерирует разный сигнал по истечении срока:

source: This timer counts down in real (i.e., wall clock) time. At each expiration, a B<SIGALRM> signal is generated.
ru: Этот таймер отсчитывается по реальному времени (то есть обычному). По каждому истечению выдаёт сигнал B<SIGALRM>.

source: This timer counts down against the user-mode CPU time consumed by the process. (The measurement includes CPU time consumed by all threads in the process.) At each expiration, a B<SIGVTALRM> signal is generated.
ru: Этот таймер отсчитывается по времени ЦП в пользовательском режиме, проведённым процессом (учёт включает время ЦП, потреблённое всеми нитями процесса). По каждому истечению выдаёт сигнал B<SIGVTALRM>.

source: This timer counts down against the total (i.e., both user and system) CPU time consumed by the process. (The measurement includes CPU time consumed by all threads in the process.) At each expiration, a B<SIGPROF> signal is generated.
ru: Этот таймер отсчитывается по полному времени ЦП, потраченному процессом (учёт включает время ЦП, потреблённое всеми нитями процесса). По каждому истечению выдаёт сигнал B<SIGPROF>.

source: In conjunction with B<ITIMER_VIRTUAL>, this timer can be used to profile user and system CPU time consumed by the process.
ru: Данный таймер вместе с B<ITIMER_VIRTUAL> можно использовать для профилирования затрат процессом системного и пользовательского времени ЦП.

source: A process has only one of each of the three types of timers.
ru: Процесс может иметь только по одному таймеру каждого типа.

source: Timer values are defined by the following structures:
ru: Величина, на которую устанавливается таймер, определяется следующими структурами:

source: struct itimerval { struct timeval it_interval; /* Interval for periodic timer */ struct timeval it_value; /* Time until next expiration */ };
ru: struct itimerval { struct timeval it_interval; /* интервал для периодического таймера */ struct timeval it_value; /* время до следующего окончания */ };

source: struct timeval { time_t tv_sec; /* seconds */ suseconds_t tv_usec; /* microseconds */ };
ru: struct timeval { time_t tv_sec; /* секунды */ suseconds_t tv_usec; /* микросекунды */ };

source: The function B<getitimer>() places the current value of the timer specified by I<which> in the buffer pointed to by I<curr_value>.
ru: Функция B<getitimer>() помещает текущее значение таймера, указанного в I<which>, в буфер, указанный в I<curr_value>.

source: The I<it_value> substructure is populated with the amount of time remaining until the next expiration of the specified timer. This value changes as the timer counts down, and will be reset to I<it_interval> when the timer expires. If both fields of I<it_value> are zero, then this timer is currently disarmed (inactive).
ru: Вложенная структура I<it_value> содержит количество оставшегося времени до следующего истечения таймера. Это значение изменяется после начала отсчёта таймера и будет сброшено в I<it_interval> при истечении таймера. Если оба поля I<it_value> равны нулю, то это означает что таймер выключен (неактивен).

source: The I<it_interval> substructure is populated with the timer interval. If both fields of I<it_interval> are zero, then this is a single-shot timer (i.e., it expires just once).
ru: Вложенная структура I<it_interval> содержит интервал таймера. Если оба поля I<it_interval>равны нулю, то это указывает на одноразовый таймер (то срабатывающий один раз).

source: The function B<setitimer>() arms or disarms the timer specified by I<which>, by setting the timer to the value specified by I<new_value>. If I<old_value> is non-NULL, the buffer it points to is used to return the previous value of the timer (i.e., the same information that is returned by B<getitimer>()).
ru: Функция B<setitimer>() настраивает таймер I<which> значением I<new_value>. Если значение I<old_value> не NULL, то оно указывает на буфер, в который сохраняется предыдущее значение таймера (т. е., информация, возвращаемая B<getitimer>()).

source: If either field in I<new_value.it_value> is nonzero, then the timer is armed to initially expire at the specified time. If both fields in I<new_value.it_value> are zero, then the timer is disarmed.
ru: Если какое-то из полей в I<new_value.it_value> не равно нулю, то таймер изначально включается как просроченный на указанное время. Если оба поля в I<new_value.it_value> равны нулю, то таймер отключён.

source: The I<new_value.it_interval> field specifies the new interval for the timer; if both of its subfields are zero, the timer is single-shot.
ru: Поле I<new_value.it_interval> задаёт новый интервал таймера;если оба поля равны нулю, то таймер будет одноразовым.

source: I<new_value>, I<old_value>, or I<curr_value> is not valid a pointer.
ru: Указатели I<new_value>, I<old_value> или I<curr_value> являются некорректными.

source: I<which> is not one of B<ITIMER_REAL>, B<ITIMER_VIRTUAL>, or B<ITIMER_PROF>; or (since Linux 2.6.22) one of the I<tv_usec> fields in the structure pointed to by I<new_value> contains a value outside the range 0 to 999999.
ru: Значение I<which> не равно B<ITIMER_REAL>, B<ITIMER_VIRTUAL> или B<ITIMER_PROF>; или (начиная с Linux 2.6.22) одно из полей структуры I<tv_usec>, указанной в I<new_value>, содержит значение вне диапазона от 0 до 999999.

source: POSIX.1-2001, SVr4, 4.4BSD (this call first appeared in 4.2BSD). POSIX.1-2008 marks B<getitimer>() and B<setitimer>() obsolete, recommending the use of the POSIX timers API (B<timer_gettime>(2), B<timer_settime>(2), etc.) instead.
ru: POSIX.1-2001, SVr4, 4.4BSD (впервые этот вызов появился в 4.2BSD). В POSIX.1-2008 вызовы B<getitimer>() и B<setitimer>() помечены как устаревшие, и вместо них рекомендуется использовать программный интерфейс таймеров POSIX (B<timer_gettime>(2), B<timer_settime>(2) и т.д.).

source: Timers will never expire before the requested time, but may expire some (short) time afterward, which depends on the system timer resolution and on the system load; see B<time>(7). (But see BUGS below.) If the timer expires while the process is active (always true for B<ITIMER_VIRTUAL>), the signal will be delivered immediately when generated.
ru: Срок на таймерах никогда не заканчивается ранее указанного времени, но может (чуть-чуть) опоздать, что зависит от степени разрешения системного таймера и загрузки системы; смотрите B<time>(7) (но смотрите ДЕФЕКТЫ далее). Если время таймера истекает во время работы процесса (всегда, если используется B<ITIMER_VIRTUAL>), то сигнал после создания будет доставлен немедленно.

source: A child created via B<fork>(2) does not inherit its parent's interval timers. Interval timers are preserved across an B<execve>(2).
ru: Потомок, созданный через B<fork>(2), не наследует таймеры интервалов родителя. При вызове B<execve>(2) таймеры интервалов сохраняются.

source: POSIX.1 leaves the interaction between B<setitimer>() and the three interfaces B<alarm>(2), B<sleep>(3), and B<usleep>(3) unspecified.
ru: В POSIX.1 не определено взаимодействие между B<setitimer>() и тремя интерфейсами: B<alarm>(2), B<sleep>(3) и B<usleep>(3).

source: The standards are silent on the meaning of the call:
ru: В стандартах ничего не говорится о значении вызова:

source: Many systems (Solaris, the BSDs, and perhaps others) treat this as equivalent to:
ru: В многих системах (Solaris, BSD и, возможно, другие) он считается эквивалентом:

source: In Linux, this is treated as being equivalent to a call in which the I<new_value> fields are zero; that is, the timer is disabled. I<Don't use this Linux misfeature>: it is nonportable and unnecessary.
ru: В Linux это эквивалентно вызову, в котором поля I<new_value> равны 0, то есть таймер выключен. I<Не используйте это особенность Linux>: это непереносимо и нецелесообразно.

source: The generation and delivery of a signal are distinct, and only one instance of each of the signals listed above may be pending for a process. Under very heavy loading, an B<ITIMER_REAL> timer may expire before the signal from a previous expiration has been delivered. The second signal in such an event will be lost.
ru: Генерирование и доставка сигнала разделены, и только один экземпляр каждого сигнала, которые описаны выше, может ожидать передачи в процесс. При очень большой нагрузке, ожидание таймера B<ITIMER_REAL> может завершиться раньше чем будет доставлен сигнал о предыдущем завершении. Второй сигнал об этом событии будет потерян.

source: On Linux kernels before 2.6.16, timer values are represented in jiffies. If a request is made set a timer with a value whose jiffies representation exceeds B<MAX_SEC_IN_JIFFIES> (defined in I<include/linux/jiffies.h>), then the timer is silently truncated to this ceiling value. On Linux/i386 (where, since Linux 2.6.13, the default jiffy is 0.004 seconds), this means that the ceiling value for a timer is approximately 99.42 days. Since Linux 2.6.16, the kernel uses a different internal representation for times, and this ceiling is removed.
ru: В ядрах Linux до версии 2.6.16, значения таймеров указывались в мигах. Если запрашивалась установка таймера в значение, представление в мигах которого превышало B<MAX_SEC_IN_JIFFIES> (определено в I<include/linux/jiffies.h>), то значение таймера просто урезалось до этого максимального значения. На Linux/i386 (где, начиная с Linux 2.6.13, по умолчанию миг равен 0.004 секунды), это означало, что максимальное значение таймера приблизительно равнялось 99.42 дня. Начиная с Linux 2.6.16, в ядрах стали использовать другое внутреннее представление времени, и этот предел был снят.

source: On certain systems (including i386), Linux kernels before version 2.6.12 have a bug which will produce premature timer expirations of up to one jiffy under some circumstances. This bug is fixed in kernel 2.6.12.
ru: В некоторых системах (включая i386), ядра Linux до версии 2.6.12 содержали дефект, который при определённых условиях приводил к преждевременному завершению за один миг (jiffy). Этот дефект исправлен в ядре 2.6.12.
