Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The addresses returned on Linux will usually be the IPv4 and IPv6 addresses assigned to the interface, but also one B<AF_PACKET> address per interface containing lower-level details about the interface and its physical layer. In this case, the I<ifa_data> field may contain a pointer to a I<struct rtnl_link_stats>, defined in I<E<lt>linux/if_link.hE<gt>> (in Linux 2.4 and earlier, I<struct net_device_stats>, defined in I<E<lt>linux/netdevice.hE<gt>>), which contains various interface attributes and statistics.
ru: Адреса, возвращаемые в Linux, обычно, являются адресами IPv4 и IPv6, назначенными интерфейсу, но также есть один адрес B<AF_PACKET> на интерфейс, содержащий канальные настройки интерфейса и его физический уровень. В этом случае поле I<ifa_data> может содержать указатель на I<struct rtnl_link_stats>, определённую в I<E<lt>linux/if_link.hE<gt>> (в Linux 2.4 и ранее — I<struct net_device_stats>, определена в I<E<lt>linux/netdevice.hE<gt>>), которая содержит различные атрибуты интерфейса и статистику.

source: The program below demonstrates the use of B<getifaddrs>(), B<freeifaddrs>(), and B<getnameinfo>(3). Here is what we see when running this program on one system:
ru: В программе, показанной далее, демонстрируется использование B<getifaddrs>(), B<freeifaddrs>(), и B<getnameinfo>(3). Вот результат запуска этой программы:

source: $ B<./a.out> lo AF_PACKET (17) tx_packets = 524; rx_packets = 524 tx_bytes = 38788; rx_bytes = 38788 wlp3s0 AF_PACKET (17) tx_packets = 108391; rx_packets = 130245 tx_bytes = 30420659; rx_bytes = 94230014 em1 AF_PACKET (17) tx_packets = 0; rx_packets = 0 tx_bytes = 0; rx_bytes = 0 lo AF_INET (2) address: E<lt>127.0.0.1E<gt> wlp3s0 AF_INET (2) address: E<lt>192.168.235.137E<gt> lo AF_INET6 (10) address: E<lt>::1E<gt> wlp3s0 AF_INET6 (10) address: E<lt>fe80::7ee9:d3ff:fef5:1a91%wlp3s0E<gt>
ru: $ B<./a.out> lo AF_PACKET (17) tx_packets = 524; rx_packets = 524 tx_bytes = 38788; rx_bytes = 38788 wlp3s0 AF_PACKET (17) tx_packets = 108391; rx_packets = 130245 tx_bytes = 30420659; rx_bytes = 94230014 em1 AF_PACKET (17) tx_packets = 0; rx_packets = 0 tx_bytes = 0; rx_bytes = 0 lo AF_INET (2) адрес: E<lt>127.0.0.1E<gt> wlp3s0 AF_INET (2) адрес: E<lt>192.168.235.137E<gt> lo AF_INET6 (10) адрес: E<lt>::1E<gt> wlp3s0 AF_INET6 (10) адрес: E<lt>fe80::7ee9:d3ff:fef5:1a91%wlp3s0E<gt>

source: #define _GNU_SOURCE /* To get defns of NI_MAXSERV and NI_MAXHOST */ #include E<lt>arpa/inet.hE<gt> #include E<lt>sys/socket.hE<gt> #include E<lt>netdb.hE<gt> #include E<lt>ifaddrs.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>linux/if_link.hE<gt>
ru: #define _GNU_SOURCE /* чтобы получить NI_MAXSERV и NI_MAXHOST */ #include E<lt>arpa/inet.hE<gt> #include E<lt>sys/socket.hE<gt> #include E<lt>netdb.hE<gt> #include E<lt>ifaddrs.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>linux/if_link.hE<gt>

source: /* Walk through linked list, maintaining head pointer so we can free list later */
ru: /* обходим связный список, сохраняя начальный указатель, чтобы освободить список позже */

source: /* Display interface name and family (including symbolic form of the latter for the common families) */
ru: /* вывод имени интерфейса и семейства (включая символический вид для общих семейств) */

source: /* For an AF_INET* interface address, display the address */
ru: /* для адресов интерфейса AF_INET* показываем адрес */

source: if (family == AF_INET || family == AF_INET6) { s = getnameinfo(ifa-E<gt>ifa_addr, (family == AF_INET) ? sizeof(struct sockaddr_in) : sizeof(struct sockaddr_in6), host, NI_MAXHOST, NULL, 0, NI_NUMERICHOST); if (s != 0) { printf("getnameinfo() failed: %s\en", gai_strerror(s)); exit(EXIT_FAILURE); }
ru: if (family == AF_INET || family == AF_INET6) { s = getnameinfo(ifa-E<gt>ifa_addr, (family == AF_INET) ? sizeof(struct sockaddr_in) : sizeof(struct sockaddr_in6), host, NI_MAXHOST, NULL, 0, NI_NUMERICHOST); if (s != 0) { printf("ошибка getnameinfo(): %s\en", gai_strerror(s)); exit(EXIT_FAILURE); }

source: printf("\et\etaddress: E<lt>%sE<gt>\en", host);
ru: printf("\et\etадрес: E<lt>%sE<gt>\en", host);

source: getline, getdelim - delimited string input
ru: getline, getdelim - разделяет входные данные на строки

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: B<getline>() reads an entire line from I<stream>, storing the address of the buffer containing the text into I<*lineptr>. The buffer is null-terminated and includes the newline character, if one was found.
ru: Функция B<getline>() считывает целую строку из I<stream>, сохраняет адрес буфера с текстом в I<*lineptr>. Буфер завершается null и включает символ новой строки, если был найден разделитель для новой строки.

source: If I<*lineptr> is set to NULL and I<*n> is set 0 before the call, then B<getline>() will allocate a buffer for storing the line. This buffer should be freed by the user program even if B<getline>() failed.
ru: Если I<*lineptr> равно NULL и I<*n> равно 0 перед вызовом, то B<getline>() выделит буфер для хранения строки. Этот буфер должен быть высвобожден программой пользователя, даже если B<getline>() завершилась с ошибкой.

source: Alternatively, before calling B<getline>(), I<*lineptr> can contain a pointer to a B<malloc>(3)-allocated buffer I<*n> bytes in size. If the buffer is not large enough to hold the line, B<getline>() resizes it with B<realloc>(3), updating I<*lineptr> and I<*n> as necessary.
ru: Как альтернатива, перед вызовом B<getline>(), I<*lineptr> может содержать указатель на буфер, выделенный с помощью B<malloc>(3) размером I<*n> байтов. Если буфер недостаточно велик для размещения строки, то B<getline>() изменяет размер буфера с помощью B<realloc>(3), обновляя I<*lineptr> и I<*n> при необходимости.

source: In either case, on a successful call, I<*lineptr> and I<*n> will be updated to reflect the buffer address and allocated size respectively.
ru: В любом случае при успешном выполнении вызова I<*lineptr> и I<*n> будут содержать правильный адрес буфера и его размер, соответственно.

source: B<getdelim>() works like B<getline>(), except that a line delimiter other than newline can be specified as the I<delimiter> argument. As with B<getline>(), a delimiter character is not added if one was not present in the input before end of file was reached.
ru: Функция B<getdelim>() работает аналогично B<getline>(), за исключением того, что в аргументе I<delimiter> можно задать разделитель строки, отличный от символа новой строки. Как и с B<getline>(), символ-разделитель не добавляется, если его было в входных данных до конца файла.

source: On success, B<getline>() and B<getdelim>() return the number of characters read, including the delimiter character, but not including the terminating null byte (\(aq\e0\(aq). This value can be used to handle embedded null bytes in the line read.
ru: При успешном выполнении B<getline>() и B<getdelim>() возвращают количество считанных символов, включая символ разделителя, но не включая завершающий байт null (\(aq\e0\(aq). Это значение может использоваться для обработки встроенных байтов null при чтении строки.

source: Both functions return -1 on failure to read a line (including end-of-file condition). In the event of an error, I<errno> is set to indicate the cause.
ru: Обе функции возвращают -1 при ошибках чтения строки (включая условие достижения конца файла). При возникновении ошибки в I<errno> сохраняется её значение.

source: Bad arguments (I<n> or I<lineptr> is NULL, or I<stream> is not valid).
ru: Некорректные параметры (I<n> или I<lineptr> равно NULL или неправильное значение I<stream>).

source: Allocation or reallocation of the line buffer failed.
ru: Не удалось выделить или переместить строчный буфер.

source: Both B<getline>() and B<getdelim>() were originally GNU extensions. They were standardized in POSIX.1-2008.
ru: Изначально, функции B<getline>() и B<getdelim>() были расширениями GNU. Позднее они были стандартизированы в POSIX.1-2008.

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>fileE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s E<lt>файлE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: glob, globfree - find pathnames matching a pattern, free memory from glob()
ru: glob, globfree - ищет имена путей по шаблону, освобождает память после glob()

source: The B<glob>() function searches for all the pathnames matching I<pattern> according to the rules used by the shell (see B<glob>(7)). No tilde expansion or parameter substitution is done; if you want these, use B<wordexp>(3).
ru: Функция B<glob>() ищет все совпадения имён путей с заданным шаблоном I<pattern>, согласно правилам, используемым оболочкой (смотрите B<glob>(7)). Расширения тильды или подстановка параметров не выполняется; если это нужно, то используйте B<wordexp>(3).

source: The B<globfree>() function frees the dynamically allocated storage from an earlier call to B<glob>().
ru: Функция B<globfree>() освобождает динамически выделенное хранилище, полученное в последнем вызове B<glob>().

source: The results of a B<glob>() call are stored in the structure pointed to by I<pglob>. This structure is of type I<glob_t> (declared in I<E<lt>glob.hE<gt>>) and includes the following elements defined by POSIX.2 (more may be present as an extension):
ru: Результаты вызова B<glob>() сохраняются в структуре, на которую указывает I<pglob>. Эта структура имеет тип I<glob_t> (объявлен в I<E<lt>glob.hE<gt>>) и содержит следующие элементы, определённые в POSIX.2 (их может быть и больше, в виде расширений):

source: typedef struct { size_t gl_pathc; /* Count of paths matched so far */ char **gl_pathv; /* List of matched pathnames. */ size_t gl_offs; /* Slots to reserve in I<gl_pathv>. */ } glob_t;
ru: typedef struct { size_t gl_pathc; /* количество совпавших путей */ char **gl_pathv; /* список совпавших имён путей. */ size_t gl_offs; /* зарезервированные в I<gl_pathv> слоты. */ } glob_t;

source: Results are stored in dynamically allocated storage.
ru: Результаты размещаются в динамически выделяемом хранилище.

source: The argument I<flags> is made up of the bitwise OR of zero or more the following symbolic constants, which modify the behavior of B<glob>():
ru: Значение параметра I<flags> формируется побитовым сложением нуля или более следующих символических констант, которые меняют ход работы B<glob>():

source: Return upon a read error (because a directory does not have read permission, for example). By default, B<glob>() attempts carry on despite errors, reading all of the directories that it can.
ru: Выполнять возврат при ошибке чтения (например, нет прав для чтения каталога). По умолчанию B<glob>() пытается продолжить работу не смотря на ошибки, читая все каталоги, которые может.

source: Append a slash to each path which corresponds to a directory.
ru: Добавлять косую черту к каждому пути, который соответствует каталогу.

source: Don't sort the returned pathnames. The only reason to do this is to save processing time. By default, the returned pathnames are sorted.
ru: Не сортировать возвращаемые имена. Это экономит процессорное время. По умолчанию имена сортируются.

source: Reserve I<pglob-E<gt>gl_offs> slots at the beginning of the list of strings in I<pglob-E<gt>pathv>. The reserved slots contain null pointers.
ru: Резервировать слоты I<pglob-E<gt>gl_offs> у начала списка строк в I<pglob-E<gt>pathv>. Зарезервированные слоты содержат указатели null.

source: If no pattern matches, return the original pattern. By default, B<glob>() returns B<GLOB_NOMATCH> if there are no matches.
ru: Если не найдено совпадений по шаблону, возвращать в качестве результата заданный шаблон. По умолчанию при отсутствии совпадений B<glob>() возвращает B<GLOB_NOMATCH>.

source: Append the results of this call to the vector of results returned by a previous call to B<glob>(). Do not set this flag on the first invocation of B<glob>().
ru: Добавлять результаты вызова к вектору результатов, полученному от предыдущего вызова B<glob>(). Не следует включать этот флаг при первом вызове B<glob>().

source: Don't allow backslash (\(aq\e\(aq) to be used as an escape character. Normally, a backslash can be used to quote the following character, providing a mechanism to turn off the special meaning metacharacters.
ru: Не использовать символы обратной косой черты (\(aq\e\(aq) в качестве экранирующего символа. Обычно, обратная косая черта может использоваться для экранирования следующего символа, таким образом предоставляя механизм для выключения специального значения метасимволов.

source: I<flags> may also include any of the following, which are GNU extensions and not defined by POSIX.2:
ru: В I<flags> также могу быть включены следующие флаги, которые являются расширениями GNU и отсутствуют в POSIX.2:

source: Allow a leading period to be matched by metacharacters. By default, metacharacters can't match a leading period.
ru: Разрешить начальной точке соответствовать метасимволам. По умолчанию метасимволы не считаются совпадающими с начальной точкой.

source: Use alternative functions I<pglob-E<gt>gl_closedir>, I<pglob-E<gt>gl_readdir>, I<pglob-E<gt>gl_opendir>, I<pglob-E<gt>gl_lstat>, and I<pglob-E<gt>gl_stat> for filesystem access instead of the normal library functions.
ru: Для доступа к файловой системе использовать функции I<pglob-E<gt>gl_closedir>, I<pglob-E<gt>gl_readdir>, I<pglob-E<gt>gl_opendir>, I<pglob-E<gt>gl_lstat> и I<pglob-E<gt>gl_stat> вместо стандартных библиотечных функций.

source: Expand B<csh>(1) style brace expressions of the form B<{a,b}>. Brace expressions can be nested. Thus, for example, specifying the pattern "{foo/{,cat,dog},bar}" would return the same results as four separate B<glob>() calls using the strings: "foo/", "foo/cat", "foo/dog", and "bar".
ru: Раскрывать выражения в фигурных скобках B<{a,b}> аналогичны используемым в B<csh>(1). Выражения могут быть вложенными. То есть, например, по шаблону "{foo/{,cat,dog},bar}" возвращаются те же результаты что и при четырёх отдельных вызовах B<glob>() со строками: "foo/", "foo/cat", "foo/dog" и "bar".

source: If the pattern contains no metacharacters, then it should be returned as the sole matching word, even if there is no file with that name.
ru: Возвращать сам шаблон, если в нём не содержатся метасимволы, даже при отсутствии файла с таким именем.

source: Carry out tilde expansion. If a tilde (\(aq~\(aq) is the only character in the pattern, or an initial tilde is followed immediately by a slash (\(aq/\(aq), then the home directory of the caller is substituted for the tilde. If an initial tilde is followed by a username (e.g., "~andrea/bin"), then the tilde and username are substituted by the home directory of that user. If the username is invalid, or the home directory cannot be determined, then no substitution is performed.
ru: Выполнять расширения тильды. Если тильда (\(aq~\(aq) — единственный символ в шаблоне или после начальной тильды сразу указана косая черта (\(aq/\(aq), то вместо тильды подставляется домашний каталог вызывающего Если после начальной тильды указано имя пользователя (например, "~andrea/bin"), то вместо тильды и имени пользователя подставляется домашний каталог этого пользователя. Если имя пользователя некорректно или домашний каталог невозможно определить, то подстановка не выполняется.

source: This provides behavior similar to that of B<GLOB_TILDE>. The difference is that if the username is invalid, or the home directory cannot be determined, then instead of using the pattern itself as the name, B<glob>() returns B<GLOB_NOMATCH> to indicate an error.
ru: Поведение подобно B<GLOB_TILDE>. Отличие в том, что если имя пользователя некорректно или домашний каталог невозможно определить, то вместо использования самого шаблона как имени, B<glob>() возвращает B<GLOB_NOMATCH> для указания на ошибку.

source: This is a I<hint> to B<glob>() that the caller is interested only in directories that match the pattern. If the implementation can easily determine file-type information, then nondirectory files are not returned to the caller. However, the caller must still check that returned files are directories. (The purpose of this flag is merely to optimize performance when the caller is interested only in directories.)
ru: Это только I<указание> B<glob>() на то, что вызывающего интересуют только каталоги, соответствующие шаблону. Если реализация может легко определить информацию о типе файла, то файлы не каталоги не возвращаются вызывающему. Однако, вызывающий всё равно должен проверять, что полученные файлы — каталоги (назначение этого флага — все лишь оптимизация производительности в случае, когда вызывающему нужны только каталоги).

source: If I<errfunc> is not NULL, it will be called in case of an error with the arguments I<epath>, a pointer to the path which failed, and I<eerrno>, the value of I<errno> as returned from one of the calls to B<opendir>(3), B<readdir>(3), or B<stat>(2). If I<errfunc> returns nonzero, or if B<GLOB_ERR> is set, B<glob>() will terminate after the call to I<errfunc>.
ru: Если I<errfunc> не равно NULL, то в случае ошибки она будет вызвана с параметрами I<epath> (указатель на путь, в котором произошла ошибка) и I<eerrno> (полученное значение I<errno> после вызова одной из функций B<opendir>(3), B<readdir>(3) или B<stat>(2)).Если I<errfunc> вернёт ненулевое значение или если флаг B<GLOB_ERR> установлен, то B<glob>() закончит работу после вызова I<errfunc>.

source: Upon successful return, I<pglob-E<gt>gl_pathc> contains the number of matched pathnames and I<pglob-E<gt>gl_pathv> contains a pointer to the list of pointers to matched pathnames. The list of pointers is terminated by a null pointer.
ru: При успешном выполнении в I<pglob-E<gt>gl_pathc> содержится количество совпадающих имён, а I<pglob-E<gt>gl_pathv> содержит указатель на список указателей на найденные имена. Список указателей завершается указателем null.

source: It is possible to call B<glob>() several times. In that case, the B<GLOB_APPEND> flag has to be set in I<flags> on the second and later invocations.
ru: Вызов B<glob>() может выполняться несколько раз. В этом случае флаг B<GLOB_APPEND> должен быть включён в I<flags> при втором и последующих вызовах.

source: As a GNU extension, I<pglob-E<gt>gl_flags> is set to the flags specified, B<or>ed with B<GLOB_MAGCHAR> if any metacharacters were found.
ru: Как расширение GNU, при обнаружении метасимволов I<pglob-E<gt>gl_flags> — набор задаваемых флагов, сложенный с B<GLOB_MAGCHAR> (с помощью операции ИЛИ).

source: On successful completion, B<glob>() returns zero. Other possible returns are:
ru: При успешном выполнении B<glob>() возвращает ноль. Другие возможные возвращаемые значения:

source: for running out of memory,
ru: занята вся свободная память

source: for a read error, and
ru: ошибка чтения

source: for no found matches.
ru: не найдено совпадений с шаблоном

source: In the above table, I<utent> in I<race:utent> signifies that if any of the functions B<setutent>(3), B<getutent>(3), or B<endutent>(3) are used in parallel in different threads of a program, then data races could occur. B<glob>() calls those functions, so we use race:utent to remind users.
ru: В приведённой выше таблице I<utent> в I<race:utent> означает, что если любая из функций B<setutent>(3), B<getutent>(3) или B<endutent>(3) используется одновременно в нескольких нитях программы, то может возникнуть состязательность по данным. Эти функции вызываются из B<glob>(), поэтому мы используем race:utent для напоминания.

source: The structure elements I<gl_pathc> and I<gl_offs> are declared as I<size_t> in glibc 2.1, as they should be according to POSIX.2, but are declared as I<int> in glibc 2.0.
ru: Элементы структуры I<gl_pathc> и I<gl_offs> объявлены с типом I<size_t> в glibc 2.1 (как и должны указываться, согласно POSIX.2), но указаны как I<int> в glibc 2.0.

source: The B<glob>() function may fail due to failure of underlying function calls, such as B<malloc>(3) or B<opendir>(3). These will store their error code in I<errno>.
ru: Функция B<glob>() может завершиться с ошибкой из-за ошибок в используемых её функций: B<malloc>(3) или B<opendir>(3). Эти функции записывают коды своих ошибок в переменную I<errno>.

source: One example of use is the following code, which simulates typing
ru: Пример использования приводится ниже, в нём имитируется набор строки

source: in the shell:
ru: в оболочке:

source: getaddrinfo_a, gai_suspend, gai_error, gai_cancel - asynchronous network address and service translation
ru: getaddrinfo_a, gai_suspend, gai_error, gai_cancel - асинхронная трансляция сетевого адреса и службы

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>netdb.hE<gt>>
ru: B<#define _GNU_SOURCE> /* См. feature_test_macros(7) */ B<#include E<lt>netdb.hE<gt>>

source: Link with I<-lanl>.
ru: Компонуется при указании параметра I<-lanl>.

source: The B<getaddrinfo_a>() function performs the same task as B<getaddrinfo>(3), but allows multiple name look-ups to be performed asynchronously, with optional notification on completion of look-up operations.
ru: Функция B<getaddrinfo_a>() выполняет ту же задачу что и B<getaddrinfo>(3), но позволяет выполнять поиск нескольких имён асинхронно, с дополнительным уведомлением о завершении операций поиска.

source: The I<mode> argument has one of the following values:
ru: В аргументе I<mode> указывается одно из следующих значений:

source: Perform the look-ups synchronously. The call blocks until the look-ups have completed.
ru: Выполнять поиск синхронно. Вызов блокирует выполнение пока поиск не завершится.

source: Perform the look-ups asynchronously. The call returns immediately, and the requests are resolved in the background. See the discussion of the I<sevp> argument below.
ru: Выполнять поиск асинхронно. Вызов сразу завершается и запросы обрабатываются в фоновом режиме. Смотрите далее описание параметра I<sevp>.

source: The array I<list> specifies the look-up requests to process. The I<nitems> argument specifies the number of elements in I<list>. The requested look-up operations are started in parallel. NULL elements in I<list> are ignored. Each request is described by a I<gaicb> structure, defined as follows:
ru: В массиве I<list> задаются запросы на обработку. В аргументе I<nitems> задаётся количество элементов в I<list>. Запрашиваемые операции поиска начинаются параллельно. Элементы NULL в списке I<list> игнорируются. Каждый запрос описывается структурой I<gaicb>, которая определена следующим образом:
