Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: POSIX.1-2001 says that B<setitimer>() should fail if a I<tv_usec> value is specified that is outside of the range 0 to 999999. However, in kernels up to and including 2.6.21, Linux does not give an error, but instead silently adjusts the corresponding seconds value for the timer. From kernel 2.6.22 onward, this nonconformance has been repaired: an improper I<tv_usec> value results in an B<EINVAL> error.
ru: В POSIX.1-2001 сказано, что B<setitimer>() должен завершаться с ошибкой, если значение I<tv_usec> лежит вне диапазона от 0 до 999999. Однако, в ядрах до версии 2.6.21 включительно, в Linux ошибка не выдаётся, а вместо этого значение таймера просто подгоняется под соответствующие секунды. Начиная с ядра 2.6.22, это несоответствие убрано: некорректное значение I<tv_usec> приводит к ошибке B<EINVAL>.

source: getgroups, setgroups - get/set list of supplementary group IDs
ru: getgroups, setgroups - получить/установить список дополнительных идентификаторов групп

source: B<setgroups>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<setgroups>(): Начиная с glibc 2.19: _DEFAULT_SOURCE В версии Glibc 2.19 и более ранних: _BSD_SOURCE

source: B<getgroups>() returns the supplementary group IDs of the calling process in I<list>. The argument I<size> should be set to the maximum number of items that can be stored in the buffer pointed to by I<list>. If the calling process is a member of more than I<size> supplementary groups, then an error results. It is unspecified whether the effective group ID of the calling process is included in the returned list. (Thus, an application should also call B<getegid>(2) and add or remove the resulting value.)
ru: Вызов B<getgroups>() возвращает идентификаторы дополнительных групп вызывающего процесса в списке I<list>. В аргументе I<size> должно быть указано максимальное количество элементов, которые можно сохранить в буфер, указанный I<list>. Если вызывающий процесс является членом в более чем I<size> дополнительных групп, то возвращается ошибка. an error results. Для него не определено, будет ли в этот список включён эффективный идентификатор группы вызывающего процесса. (То есть приложение также должно вызвать B<getegid>(2) и добавить или удалить полученное значение.)

source: If I<size> is zero, I<list> is not modified, but the total number of supplementary group IDs for the process is returned. This allows the caller to determine the size of a dynamically allocated I<list> to be used in a further call to B<getgroups>().
ru: Если размер I<size> равен нулю, то список I<list> не изменяется, а просто возвращается общее количество идентификаторов дополнительных групп процесса. Это позволяет вызывающему определить размер динамически выделяемого списка I<list>, который будет использоваться при повторном вызове B<getgroups>().

source: B<setgroups>() sets the supplementary group IDs for the calling process. Appropriate privileges are required (see the description of the B<EPERM> error, below). The I<size> argument specifies the number of supplementary group IDs in the buffer pointed to by I<list>. A process can drop all of its supplementary groups with the call:
ru: Вызов B<setgroups>() устанавливает идентификаторы дополнительных групп для вызывающего процесса. Для работы требуются права (смотрите описание ошибки B<EPERM> ниже). В аргументе I<size> задаётся количество дополнительных идентификаторов групп в буфере, указанном I<list>. Процесс может выйти из всех дополнительных группы вызвав:

source: On success, B<getgroups>() returns the number of supplementary group IDs. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<getgroups>() возвращается количество дополнительных идентификаторов. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: On success, B<setgroups>() returns 0. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<setgroups>() возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: I<list> has an invalid address.
ru: Значение I<list> является неправильным адресом.

source: B<getgroups>() can additionally fail with the following error:
ru: Вызов B<getgroups>() также может завершиться со следующей ошибкой:

source: I<size> is less than the number of supplementary group IDs, but is not zero.
ru: Значение I<size> меньше чем количество дополнительных идентификаторов групп, но не ноль.

source: B<setgroups>() can additionally fail with the following errors:
ru: Вызов B<setgroups>() также может завершиться со следующими ошибками:

source: I<size> is greater than B<NGROUPS_MAX> (32 before Linux 2.6.4; 65536 since Linux 2.6.4).
ru: Значение I<size> больше чем B<NGROUPS_MAX> (32, до Linux 2.6.4; 65536, начиная с Linux 2.6.4).

source: Out of memory.
ru: Не хватает памяти.

source: The calling process has insufficient privilege (the caller does not have the B<CAP_SETGID> capability in the user namespace in which it resides).
ru: Вызывающий процесс не имеет достаточно прав (вызывающий не имеет мандата B<CAP_SETGID> в пользовательском пространстве имён, в котором он находится).

source: B<EPERM> (since Linux 3.19)
ru: B<EPERM> (начиная с Linux 3.19)

source: The use of B<setgroups>() is denied in this user namespace. See the description of I</proc/[pid]/setgroups> in B<user_namespaces>(7).
ru: Использование B<setgroups>() запрещено в этом пространстве имён user. Смотрите описание I</proc/[pid]/setgroups> в B<user_namespaces>(7).

source: B<setgroups>(): SVr4, 4.3BSD. Since B<setgroups>() requires privilege, it is not covered by POSIX.1.
ru: B<setgroups>(): SVr4, 4.3BSD. Так как для B<setgroups>() требуются права, она не описана в POSIX.1.

source: A process can have up to B<NGROUPS_MAX> supplementary group IDs in addition to the effective group ID. The constant B<NGROUPS_MAX> is defined in I<E<lt>limits.hE<gt>>. The set of supplementary group IDs is inherited from the parent process, and preserved across an B<execve>(2).
ru: Процесс может иметь, как минимум, B<NGROUPS_MAX> дополнительных идентификаторов групп в дополнении к эффективному идентификатору группы. Константа B<NGROUPS_MAX> определена в I<E<lt>limits.hE<gt>>. Список дополнительных идентификаторов групп наследуется из родительского процесса и сохраняется при вызове B<execve>(2).

source: The maximum number of supplementary group IDs can be found at run time using B<sysconf>(3):
ru: Максимальное количество дополнительных идентификаторов групп можно выяснить с помощью B<sysconf>(3):

source: The maximum return value of B<getgroups>() cannot be larger than one more than this value. Since Linux 2.6.4, the maximum number of supplementary group IDs is also exposed via the Linux-specific read-only file, I</proc/sys/kernel/ngroups_max>.
ru: Максимальное значение, возвращаемое B<getgroups>(), не может быть больше чем на единицу значения, полученного данным способом. Начиная с Linux 2.6.4, максимальное количество идентификаторов дополнительных групп также видимо через специальный файл Linux, доступный только для чтения — I</proc/sys/kernel/ngroups_max>.

source: The original Linux B<getgroups>() system call supported only 16-bit group IDs. Subsequently, Linux 2.4 added B<getgroups32>(), supporting 32-bit IDs. The glibc B<getgroups>() wrapper function transparently deals with the variation across kernel versions.
ru: Первоначальная версия системного вызова B<getgroups>() в Linux поддерживала только 16-битные идентификаторы групп. Позднее в Linux 2.4 был добавлен вызов B<getgroups32>(), поддерживающий 32-битные идентификаторы. В glibc обёрточная функция B<getgroups>() работает одинаково вне зависимости от версий ядра.

source: At the kernel level, user IDs and group IDs are a per-thread attribute. However, POSIX requires that all threads in a process share the same credentials. The NPTL threading implementation handles the POSIX requirements by providing wrapper functions for the various system calls that change process UIDs and GIDs. These wrapper functions (including the one for B<setgroups>()) employ a signal-based technique to ensure that when one thread changes credentials, all of the other threads in the process also change their credentials. For details, see B<nptl>(7).
ru: На уровне ядра ID пользователя и группы являются атрибутами нити. Однако в POSIX требуется, чтобы все нити в процессе имели одинаковые права. В реализации нитей NPTL требования POSIX реализованы через обёрточные функции для различных системных вызовов, которые изменяют UID и GID процесса. В этих функциях (включая и для B<setgroups>()) используется алгоритмы на основе сигналов, которые следят за тем, что когда у одной нити изменяются права, эти изменения выполняются и для остальных нитей процесса. Подробное описание смотрите в B<nptl>(7).

source: gethostname, sethostname - get/set hostname
ru: gethostname, sethostname - получить/установить имя узла

source: Since glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500
ru: Начиная с glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500

source: || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
ru: || /* начиная с glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: Since glibc 2.21: _DEFAULT_SOURCE In glibc 2.19 and 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) Up to and including glibc 2.19: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)
ru: начиная с glibc 2.21: _DEFAULT_SOURCE в glibc 2.19 и 2.20: _DEFAULT_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500) до glibc 2.19, включительно: _BSD_SOURCE || (_XOPEN_SOURCE && _XOPEN_SOURCE\ E<lt>\ 500)

source: These system calls are used to access or to change the hostname of the current processor.
ru: Эти системные вызовы используются для доступа или изменения имени узла текущего процессора.

source: B<sethostname>() sets the hostname to the value given in the character array I<name>. The I<len> argument specifies the number of bytes in I<name>. (Thus, I<name> does not require a terminating null byte.)
ru: Вызов B<sethostname>() устанавливает имя узла равны значению, указанному в массиве символов I<name>. Аргумент I<len> определяет количество байт в I<name>. (Таким образом, I<name> не требует наличия завершающего байта с null.)

source: B<gethostname>() returns the null-terminated hostname in the character array I<name>, which has a length of I<len> bytes. If the null-terminated hostname is too large to fit, then the name is truncated, and no error is returned (but see NOTES below). POSIX.1 says that if such truncation occurs, then it is unspecified whether the returned buffer includes a terminating null byte.
ru: B<gethostname>() возвращает имя узла с null на конце в массиве символов I<name> длиной I<len> байт. Если имя узла, оканчивающееся null, не помещается, то имя обрезается и ошибки не происходит (но смотрите ЗАМЕЧАНИЯ далее). В POSIX.1 сказано, что если обрезание произошло, то неясно, будет ли буфер содержать завершающий байт с null.

source: I<name> is an invalid address.
ru: I<name> является неправильным адресом.

source: I<len> is negative or, for B<sethostname>(), I<len> is larger than the maximum allowed size.
ru: I<len> имеет отрицательное значение или для B<sethostname>() длина I<len> больше, чем максимально допустимое значение.

source: (glibc B<gethostname>()) I<len> is smaller than the actual size. (Before version 2.1, glibc uses B<EINVAL> for this case.)
ru: (B<gethostname>() из glibc) I<len> меньше чем реальный размер. (До версии 2.1, glibc возвращала в этом случае B<EINVAL>.)

source: For B<sethostname>(), the caller did not have the B<CAP_SYS_ADMIN> capability in the user namespace associated with its UTS namespace (see B<namespaces>(7)).
ru: Для работы с B<sethostname>() у вызывающего нет мандата B<CAP_SYS_ADMIN> в пользовательском пространстве имён, связанном с его пространством имён UTS (смотрите B<namespaces>(7)).

source: SVr4, 4.4BSD (these interfaces first appeared in 4.2BSD). POSIX.1-2001 and POSIX.1-2008 specify B<gethostname>() but not B<sethostname>().
ru: SVr4, 4.4BSD (данная функция впервые появилась в 4.2BSD). В POSIX.1-2001 и POSIX.1-2008 определена B<gethostname>(), но нет B<sethostname>().

source: SUSv2 guarantees that "Host names are limited to 255 bytes". POSIX.1 guarantees that "Host names (not including the terminating null byte) are limited to B<HOST_NAME_MAX> bytes". On Linux, B<HOST_NAME_MAX> is defined with the value 64, which has been the limit since Linux 1.0 (earlier kernels imposed a limit of 8 bytes).
ru: SUSv2 гарантирует, что «Длина имени узла ограничена 255-ю байтами». POSIX.1 гарантирует, что «Длина имени узла (не включая завершающий нулевой символ) ограничена B<HOST_NAME_MAX> байтами». В Linux значение B<HOST_NAME_MAX> равно 64, которое было урезано начиная с Linux 1.0 (ранние версии имели предел в 8 байт).

source: The GNU C library does not employ the B<gethostname>() system call; instead, it implements B<gethostname>() as a library function that calls B<uname>(2) and copies up to I<len> bytes from the returned I<nodename> field into I<name>. Having performed the copy, the function then checks if the length of the I<nodename> was greater than or equal to I<len>, and if it is, then the function returns -1 with I<errno> set to B<ENAMETOOLONG>; in this case, a terminating null byte is not included in the returned I<name>.
ru: Библиотека GNU C library не использует системный вызов B<gethostname>(); вместо этого B<gethostname>() в ней реализован в виде библиотечной функции, которая вызывает B<uname>(2) и копирует до I<len> байт в I<name> из возвращаемого поля I<nodename>. Выполнив копирование, функция проверяет, что длина I<nodename> не больше или равна I<len>, и если это обнаруживается, то функция возвращает -1, устанавливая значение I<errno> равным B<ENAMETOOLONG>; в этом случае в возвращаемое значение I<name> завершающий null не добавляется.

source: Versions of glibc before 2.2 handle the case where the length of the I<nodename> was greater than or equal to I<len> differently: nothing is copied into I<name> and the function returns -1 with I<errno> set to B<ENAMETOOLONG>.
ru: Версии glibc до 2.2 обрабатывали случай превышения длины I<nodename> по другому: ничего не копировалось в I<name> и функция возвращала -1, устанавливая I<errno> равным B<ENAMETOOLONG>.

source: getpagesize - get memory page size
ru: getpagesize - определяет размер страницы памяти

source: Since glibc 2.19:
ru: Начиная с glibc 2.19:

source: From glibc 2.12 to 2.19:
ru: В glibc с 2.12 по 2.19:

source: Before glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500
ru: До glibc 2.12: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500

source: The function B<getpagesize>() returns the number of bytes in a memory page, where "page" is a fixed-length block, the unit for memory allocation and file mapping performed by B<mmap>(2).
ru: Вызов B<getpagesize>() возвращает количество байтов в странице памяти, где «страница» представляет собой блок фиксированной длины, единица измерения при выделения памяти и файлового отображения, выполняемого с помощью B<mmap>(2).

source: SVr4, 4.4BSD, SUSv2. In SUSv2 the B<getpagesize>() call is labeled LEGACY, and in POSIX.1-2001 it has been dropped; HP-UX does not have this call.
ru: SVr4, 4.4BSD, SUSv2. В SUSv2 вызов B<getpagesize>() отмечен как УСТАРЕВШИЙ, и был удалён из POSIX.1-2001; в HP-UX такого вызова нет.

source: Portable applications should employ I<sysconf(_SC_PAGESIZE)> instead of B<getpagesize>():
ru: В переносимых программах вместо B<getpagesize>() следует использовать I<sysconf(_SC_PAGESIZE)>:

source: (Most systems allow the synonym B<_SC_PAGE_SIZE> for B<_SC_PAGESIZE>.)
ru: (большинство систем позволяют использовать B<_SC_PAGE_SIZE> вместо B<_SC_PAGESIZE>.)

source: Whether B<getpagesize>() is present as a Linux system call depends on the architecture. If it is, it returns the kernel symbol B<PAGE_SIZE>, whose value depends on the architecture and machine model. Generally, one uses binaries that are dependent on the architecture but not on the machine model, in order to have a single binary distribution per architecture. This means that a user program should not find B<PAGE_SIZE> at compile time from a header file, but use an actual system call, at least for those architectures (like sun4) where this dependency exists. Here glibc 2.0 fails because its B<getpagesize>() returns a statically derived value, and does not use a system call. Things are OK in glibc 2.1.
ru: В Linux системный вызов B<getpagesize>() есть не на всех архитектурах. Если он есть, то он возвращает символ ядра B<PAGE_SIZE>, чьё значение зависит от архитектуры и модели компьютера. Как правило, создаваемые двоичные файлы используются для всей архитектуры, а не для конкретной одной модели. Поэтому рекомендуется определять B<PAGE_SIZE> не на стадии компиляции из файла заголовка, а при выполнении программы с помощью данной функции, по крайней мере на тех архитектурах (таких как sun), где зависимость от модели существует. В этом случае в библиотечные вызовы glibc 2.0 завершатся неудачно, так как её B<getpagesize>() возвращает статически определённое значение и не использует системный вызов. В glibc 2.1 это исправлено.

source: getrusage - get resource usage
ru: getrusage - считывает использованные ресурсы

source: B<getrusage>() returns resource usage measures for I<who>, which can be one of the following:
ru: B<getrusage>() возвращает текущие ограничения на ресурсы для значения I<who>, которое может быть:

source: Return resource usage statistics for the calling process, which is the sum of resources used by all threads in the process.
ru: Возвращает статистику по использованию ресурсов вызывающим процессом (суммируются значения всех нитей процесса).

source: Return resource usage statistics for all children of the calling process that have terminated and been waited for. These statistics will include the resources used by grandchildren, and further removed descendants, if all of the intervening descendants waited on their terminated children.
ru: Возвращает статистику по использованию ресурсов всех потомков вызывающего процесса, которые завершились или завершение которых ожидается. Эта статистика включает в себя ресурсы, использованные внучками и дальнейшими потомками, если все промежуточные потомки завершились или их завершение ожидается.

source: B<RUSAGE_THREAD> (since Linux 2.6.26)
ru: B<RUSAGE_THREAD> (начиная с Linux 2.6.26)

source: Return resource usage statistics for the calling thread. The B<_GNU_SOURCE> feature test macro must be defined (before including I<any> header file) in order to obtain the definition of this constant from I<E<lt>sys/resource.hE<gt>>.
ru: Возвращает статистику по использованию ресурсов вызывающей нити. Чтобы получить определение этой константы из I<E<lt>sys/resource.hE<gt>> должен быть определён макрос тестирования свойств B<_GNU_SOURCE> (до включения всех заголовочных файлов).

source: The resource usages are returned in the structure pointed to by I<usage>, which has the following form:
ru: Данные по использованным ресурсам возвращаются в структуре, на которую указывает I<usage>; она имеет следующий вид:

source: struct rusage { struct timeval ru_utime; /* user CPU time used */ struct timeval ru_stime; /* system CPU time used */ long ru_maxrss; /* maximum resident set size */ long ru_ixrss; /* integral shared memory size */ long ru_idrss; /* integral unshared data size */ long ru_isrss; /* integral unshared stack size */ long ru_minflt; /* page reclaims (soft page faults) */ long ru_majflt; /* page faults (hard page faults) */ long ru_nswap; /* swaps */ long ru_inblock; /* block input operations */ long ru_oublock; /* block output operations */ long ru_msgsnd; /* IPC messages sent */ long ru_msgrcv; /* IPC messages received */ long ru_nsignals; /* signals received */ long ru_nvcsw; /* voluntary context switches */ long ru_nivcsw; /* involuntary context switches */ };
ru: struct rusage { struct timeval ru_utime; /* время ЦП, исполь. в режиме пользователя */ struct timeval ru_stime; /* время ЦП, исполь. в режиме системы */ long ru_maxrss; /* максимальный rss */ long ru_ixrss; /* полный объём общей памяти */ long ru_idrss; /* полный объём собственной памяти */ long ru_isrss; /* полный объём собственного стека */ long ru_minflt; /* количество восстановленных страниц (мягких отказов) */ long ru_majflt; /* количество отказавших страниц (жёстких отказов) */ long ru_nswap; /* количество обращений при подкачке */ long ru_inblock; /* количество операций блокового ввода */ long ru_oublock; /* количество операций блокового вывода */ long ru_msgsnd; /* количество посланных сообщений IPC */ long ru_msgrcv; /* количество принятых сообщений IPC */ long ru_nsignals; /* количество принятых сигналов */ long ru_nvcsw; /* количество переключений контекста */ long ru_nivcsw; /* кол-во принудительных переключений контекста */ };

source: Not all fields are completed; unmaintained fields are set to zero by the kernel. (The unmaintained fields are provided for compatibility with other systems, and because they may one day be supported on Linux.) The fields are interpreted as follows:
ru: Не все поля заполняются; несопровождаемые поля устанавливаются ядром в ноль. (Несопровождаемые поля предоставляются для совместимости с другими системами, и когда-нибудь станут поддерживаться в Linux.) Поля следует понимать так:

source: This is the total amount of time spent executing in user mode, expressed in a I<timeval> structure (seconds plus microseconds).
ru: Общее количество времени, проведённое в режиме пользователя, выражается структурой I<timeval> (секунды и микросекунды).

source: This is the total amount of time spent executing in kernel mode, expressed in a I<timeval> structure (seconds plus microseconds).
ru: Общее количество времени, проведённое в режиме ядра, выражается структурой I<timeval> (секунды и микросекунды).

source: I<ru_maxrss> (since Linux 2.6.32)
ru: I<ru_maxrss> (начиная с Linux 2.6.32)

source: This is the maximum resident set size used (in kilobytes). For B<RUSAGE_CHILDREN>, this is the resident set size of the largest child, not the maximum resident set size of the process tree.
ru: Максимальный используемый размер постоянно занимаемый в памяти (в килобайтах). Для B<RUSAGE_CHILDREN> определяется наибольший размер постоянной памяти среди потомков, а не максимальный размер постоянной памяти всего дерева процесса.

source: I<ru_ixrss> (unmaintained)
ru: I<ru_ixrss> (не ведётся)

source: This field is currently unused on Linux.
ru: В настоящее время в Linux не учитывается.

source: I<ru_idrss> (unmaintained)
ru: I<ru_idrss> (не ведётся)

source: I<ru_isrss> (unmaintained)
ru: I<ru_isrss> (не ведётся)

source: The number of page faults serviced without any I/O activity; here I/O activity is avoided by ``reclaiming'' a page frame from the list of pages awaiting reallocation.
ru: Количество сбойных страниц, обслуженных без операций ввода-вывода; в данном случае страницы «восстановлены» из списка страниц, ожидающих перемещения.

source: The number of page faults serviced that required I/O activity.
ru: Количество сбойных страниц, обслуженных с помощью операций ввода-вывода.

source: I<ru_nswap> (unmaintained)
ru: I<ru_nswap> (не ведётся)

source: I<ru_inblock> (since Linux 2.6.22)
ru: I<ru_inblock> (начиная с Linux 2.6.22)

source: The number of times the filesystem had to perform input.
ru: Количество обращений на чтение из файловой системы.

source: I<ru_oublock> (since Linux 2.6.22)
ru: I<ru_oublock> (начиная с Linux 2.6.22)

source: The number of times the filesystem had to perform output.
ru: Количество обращений на запись в файловую систему.

source: I<ru_msgsnd> (unmaintained)
ru: I<ru_msgsnd> (не ведётся)
