Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: B<getdtablesize>() returns the maximum number of files a process can have open, one more than the largest possible value for a file descriptor.
ru: B<getdtablesize>() возвращает максимальное количество файлов, которое может быть открыто в процессе, на единицу больше, чем наибольшее возможное значение для дескриптора файла.

source: The current limit on the number of open files per process.
ru: Текущее ограничение на количество открытых файлов для процесса.

source: On Linux, B<getdtablesize>() can return any of the errors described for B<getrlimit>(2); see NOTES below.
ru: В Linux, B<getdtablesize>() может вернуть любую ошибку из описанных в B<getrlimit>(2); см. ЗАМЕЧАНИЯ далее.

source: SVr4, 4.4BSD (the B<getdtablesize>() function first appeared in 4.2BSD). It is not specified in POSIX.1; portable applications should employ I<sysconf(_SC_OPEN_MAX)> instead of this call.
ru: SVr4, 4.4BSD (функция B<getdtablesize>() впервые появилась в 4.2BSD). Она отсутствует в POSIX.1; переносимые приложения вместо неё должны применять I<sysconf(_SC_OPEN_MAX)>.

source: B<getdtablesize>() is implemented as a libc library function. The glibc version calls B<getrlimit>(2) and returns the current B<RLIMIT_NOFILE> limit, or B<OPEN_MAX> when that fails.
ru: Функция B<getdtablesize>() реализована в виде библиотечной функции libc. Версия glibc вызывает B<getrlimit>(2) и возвращает текущее ограничение B<RLIMIT_NOFILE>; при ошибке возвращается B<OPEN_MAX>.

source: getcwd, getwd, get_current_dir_name - get current working directory
ru: getcwd, getwd, get_current_dir_name - возвращают текущий рабочий каталог

source: (_XOPEN_SOURCE\ E<gt>=\ 500) && ! (_POSIX_C_SOURCE\ E<gt>=\ 200809L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: (_XOPEN_SOURCE\ E<gt>=\ 500) && ! (_POSIX_C_SOURCE\ E<gt>=\ 200809L) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE

source: These functions return a null-terminated string containing an absolute pathname that is the current working directory of the calling process. The pathname is returned as the function result and via the argument I<buf>, if present.
ru: Данные функции возвращают строку (с null в конце), содержащую абсолютный путь текущего рабочего каталога вызывающего процесса. Путь возвращается как результат функции или в аргументе I<buf>, если он есть.

source: The B<getcwd>() function copies an absolute pathname of the current working directory to the array pointed to by I<buf>, which is of length I<size>.
ru: Функция B<getcwd>() копирует абсолютный путь текущего рабочего каталога в массив, на который указывает I<buf>, имеющий длину I<size>.

source: If the length of the absolute pathname of the current working directory, including the terminating null byte, exceeds I<size> bytes, NULL is returned, and I<errno> is set to B<ERANGE>; an application should check for this error, and allocate a larger buffer if necessary.
ru: Если длина абсолютного пути, включая конечный байт null, превышает I<size> байт, то возвращается NULL, а I<errno> принимает значение B<ERANGE>; приложение должно проверить, возникла эта ошибка или нет и, если необходимо, выделить буфер большего размера.

source: As an extension to the POSIX.1-2001 standard, glibc's B<getcwd>() allocates the buffer dynamically using B<malloc>(3) if I<buf> is NULL. In this case, the allocated buffer has the length I<size> unless I<size> is zero, when I<buf> is allocated as big as necessary. The caller should B<free>(3) the returned buffer.
ru: Согласно расширению стандарта POSIX.1-2001 в glibc предусмотрено следующее: если I<buf> равно NULL, то при вызове B<getcwd>() буфер выделяется динамически с помощью функции B<malloc>(3). В этом случае выделенный буфер имеет размер I<size>; если I<size> равно нулю, то выделяется I<buf> необходимого размера. Вызывающий после использования должен освободить выделенный буфер с помощью B<free>(3).

source: B<get_current_dir_name>() will B<malloc>(3) an array big enough to hold the absolute pathname of the current working directory. If the environment variable B<PWD> is set, and its value is correct, then that value will be returned. The caller should B<free>(3) the returned buffer.
ru: Функция B<get_current_dir_name>() выделит с помощью B<malloc>(3) массив, достаточно большой для помещения в него абсолютного пути имени текущего каталога. Если существует и имеет правильное значение переменная окружения B<PWD>, то будет возвращено её значение. Вызывающий после использования должен освободить выделенный буфер с помощью B<free>(3).

source: B<getwd>() does not B<malloc>(3) any memory. The I<buf> argument should be a pointer to an array at least B<PATH_MAX> bytes long. If the length of the absolute pathname of the current working directory, including the terminating null byte, exceeds B<PATH_MAX> bytes, NULL is returned, and I<errno> is set to B<ENAMETOOLONG>. (Note that on some systems, B<PATH_MAX> may not be a compile-time constant; furthermore, its value may depend on the filesystem, see B<pathconf>(3).) For portability and security reasons, use of B<getwd>() is deprecated.
ru: Функция B<getwd>() не выделяет память с помощью B<malloc>(3). Аргумент I<buf> должен быть указателем на массив длиной не менее B<PATH_MAX> байтов. Если длина абсолютного пути текущего рабочего каталога, включая конечный байт null, превышает B<PATH_MAX> байт, то возвращается NULL и I<errno> присваивается значение B<ENAMETOOLONG> (заметим, что в некоторых системах B<PATH_MAX> может не являться константой времени компиляции; более того, её значение может зависеть от файловой системы, смотрите B<pathconf>(3)). Для переносимости и безопасности использование B<getwd>() не рекомендуется.

source: On success, these functions return a pointer to a string containing the pathname of the current working directory. In the case B<getcwd>() and B<getwd>() this is the same value as I<buf>.
ru: При успешном выполнении эти функции возвращают указатель на строку, содержащую пути текущего рабочего каталога. У B<getcwd>() и B<getwd>() это значение совпадает с I<buf>.

source: On failure, these functions return NULL, and I<errno> is set to indicate the error. The contents of the array pointed to by I<buf> are undefined on error.
ru: При ошибках эти функции возвращают NULL и в I<errno> помещают причину ошибки. Содержимое массива I<buf> в этом случае не определено.

source: Permission to read or search a component of the filename was denied.
ru: Нет прав на чтение или поиск одного из компонентов пути файла.

source: I<buf> points to a bad address.
ru: Значение I<buf> указывает на неправильный адрес.

source: The I<size> argument is zero and I<buf> is not a null pointer.
ru: Аргумент I<size> равен нулю, а I<buf> не является указателем null.

source: B<getwd>(): I<buf> is NULL.
ru: B<getwd>(): I<buf> равно NULL.

source: B<getwd>(): The size of the null-terminated absolute pathname string exceeds B<PATH_MAX> bytes.
ru: B<getwd>(): Размер строки абсолютного пути, включая конечный null, превышает B<PATH_MAX> байт.

source: The current working directory has been unlinked.
ru: Текущий рабочий каталог был удалён.

source: The I<size> argument is less than the length of the absolute pathname of the working directory, including the terminating null byte. You need to allocate a bigger array and try again.
ru: Аргумент I<size> меньше длины абсолютного пути рабочего каталога, включая конечный байт null. Вам нужно выделить массив большего размера попробовать ещё раз.

source: B<getcwd>() conforms to POSIX.1-2001. Note however that POSIX.1-2001 leaves the behavior of B<getcwd>() unspecified if I<buf> is NULL.
ru: Функция B<getcwd>() соответствует POSIX.1-2001. Однако заметим, что в POSIX.1-2001 не описано поведение B<getcwd>(), если I<buf> равно NULL.

source: B<getwd>() is present in POSIX.1-2001, but marked LEGACY. POSIX.1-2008 removes the specification of B<getwd>(). Use B<getcwd>() instead. POSIX.1-2001 does not define any errors for B<getwd>().
ru: Функция B<getwd>() описана в POSIX.1-2001, но помечена как УСТАРЕВШАЯ. В POSIX.1-2008 B<getwd>() удалена. Вместо неё используйте B<getcwd>(). В POSIX.1-2001 не определены ошибки, возвращаемые B<getwd>().

source: B<get_current_dir_name>() is a GNU extension.
ru: Функция B<get_current_dir_name>() является расширением GNU.

source: Under Linux, these functions make use of the B<getcwd>() system call (available since Linux 2.1.92). On older systems they would query I</proc/self/cwd>. If both system call and proc filesystem are missing, a generic implementation is called. Only in that case can these calls fail under Linux with B<EACCES>.
ru: В Linux, эти функции используют системный вызов B<getcwd>() (доступен в Linux, начиная с версии 2.1.92). В старых системах они опрашивают I</proc/self/cwd>. Если в системе отсутствует системный вызов и файловая система proc, то задействуется обобщённая реализация. Только в этом случает данные вызовы в Linux могут завершиться с ошибкой B<EACCES>.

source: These functions are often used to save the location of the current working directory for the purpose of returning to it later. Opening the current directory (".") and calling B<fchdir>(2) to return is usually a faster and more reliable alternative when sufficiently many file descriptors are available, especially on platforms other than Linux.
ru: Данные функции часто используются для сохранения расположения текущего рабочего каталога с целью возврата в него позднее. Открытие текущего каталога («.») и вызов B<fchdir>(2) для возврата, обычно, более быстрая и надёжная альтернатива при наличии достаточного количества файловых дескрипторов, особенно на платформах, отличных от Linux.

source: On Linux, the kernel provides a B<getcwd>() system call, which the functions described in this page will use if possible. The system call takes the same arguments as the library function of the same name, but is limited to returning at most B<PATH_MAX> bytes. (Before Linux 3.12, the limit on the size of the returned pathname was the system page size. On many architectures, B<PATH_MAX> and the system page size are both 4096 bytes, but a few architectures have a larger page size.) If the length of the pathname of the current working directory exceeds this limit, then the system call fails with the error B<ENAMETOOLONG>. In this case, the library functions fall back to a (slower) alternative implementation that returns the full pathname.
ru: Ядро Linux предоставляет системный вызов B<getcwd>(), который, если возможно, будут использовать описываемые на этой страницы функции. Системный вызов имеет такие же параметры как и библиотечная функция с тем же именем, но возвращает не более B<PATH_MAX> байт (до Linux 3.12 размер возвращаемого пути ограничивался размером системной страницы. На многих архитектурах B<PATH_MAX> и размер системной страницы равны 4096 байтам, но у некоторых архитектур размер страницы больше этого значения). Если длина пути текущего рабочего каталога превышает это ограничение, то системный вызов возвращает ошибку B<ENAMETOOLONG>. В этом случае библиотечные функции переходят к использованию альтернативной (медленной) реализации, которая возвращает полный путь.

source: Following a change in Linux 2.6.36, the pathname returned by the B<getcwd>() system call will be prefixed with the string "(unreachable)" if the current directory is not below the root directory of the current process (e.g., because the process set a new filesystem root using B<chroot>(2) without changing its current directory into the new root). Such behavior can also be caused by an unprivileged user by changing the current directory into another mount namespace. When dealing with pathname from untrusted sources, callers of the functions described in this page should consider checking whether the returned pathname starts with '/' or '(' to avoid misinterpreting an unreachable path as a relative pathname.
ru: После внесения изменения в Linux 2.6.36, путь, возвращаемый системным вызовом B<getcwd>(), будет начинаться со строки «(unreachable)», если текущий каталог не ниже корневого каталога текущего процесса (например, из-за того, что процесс установил новую корневую файловую систему с помощью B<chroot>(2) без изменения своего текущего каталога в новый корень). Такое поведение также проявляется у непривилегированного пользователя текущий каталог переводится в другое пространство имён монтирования. При работе с путём из недоверенных источников вызывающие описанные на этой странице функции должны учитывать, что возвращаемый путь может начинаться с «/» или «(», и не принимать недоступный путь за относительный.

source: Since the Linux 2.6.36 change that added "(unreachable)" in the circumstances described above, the glibc implementation of B<getcwd>() has failed to conform to POSIX and returned a relative pathname when the API contract requires an absolute pathname. With glibc 2.27 onwards this is corrected; calling B<getcwd>() from such a pathname will now result in failure with B<ENOENT>.
ru: Так как изменения в Linux 2.6.36 добавляет при описанных выше определённых обстоятельствах «(unreachable)», реализация B<getcwd>() в glibc нарушает POSIX и возвращает относительный путь, в то время как по соглашению API требуется абсолютный путь. В glibc 2.27 и новее это исправлено; вызов B<getcwd>() из такого пути приводит к ошибке B<ENOENT>.

source: get_phys_pages, get_avphys_pages - get total and available physical page counts
ru: get_phys_pages, get_avphys_pages - возвращает количество физических страниц, а также количество доступных страниц

source: The function B<get_phys_pages>() returns the total number of physical pages of memory available on the system.
ru: Функция B<get_phys_pages>() возвращает общее количество физических страниц памяти, доступных в системе.

source: The function B<get_avphys_pages>() returns the number of currently available physical pages of memory on the system.
ru: Функция B<get_avphys_pages>() возвращает количество доступных в данный момент физических страниц памяти в системе.

source: On success, these functions return a nonnegative value as given in DESCRIPTION. On failure, they return -1 and set I<errno> to indicate the cause of the error.
ru: При успешном выполнении эти функции возвращают значение согласно ОПИСАНИЮ. При ошибке возвращается -1 и в I<errno> записывается номер ошибки.

source: The system could not provide the required information (possibly because the I</proc> filesystem was not mounted).
ru: Система не может предоставить требуемую информацию (возможно, из-за того, что не смонтирована файловая система I</proc>).

source: These functions obtain the required information by scanning the I<MemTotal> and I<MemFree> fields of I</proc/meminfo>.
ru: Эти функции получают требуемую информацию из полей I<MemTotal> и I<MemFree> файла I</proc/meminfo>.

source: The following B<sysconf>(3) calls provide a portable means of obtaining the same information as the functions described on this page.
ru: Следующие вызовы B<sysconf>(3) предоставляют переносимый способ получения информации, возвращаемой этими функциями.

source: total_pages = sysconf(_SC_PHYS_PAGES); /* total pages */ avl_pages = sysconf(_SC_AVPHYS_PAGES); /* available pages */
ru: total_pages = sysconf(_SC_PHYS_PAGES); /* общее количество страниц */ avl_pages = sysconf(_SC_AVPHYS_PAGES); /* количество доступных страниц */

source: The following example shows how B<get_phys_pages>() and B<get_avphys_pages>() can be used.
ru: В следующем примере показано использование B<get_phys_pages>() и B<get_avphys_pages>().

source: int main(int argc, char *argv[]) { printf("This system has %ld pages of physical memory and " "%ld pages of physical memory available.\en", get_phys_pages(), get_avphys_pages()); exit(EXIT_SUCCESS); }
ru: int main(int argc, char *argv[]) { printf("В этой системе %ld страниц физической памяти и " "доступно %ld страниц физической памяти.\en", get_phys_pages(), get_avphys_pages()); exit(EXIT_SUCCESS); }

source: getpt - open the pseudoterminal master (PTM)
ru: getpt - открывает основной псевдотерминал (PTM)

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>stdlib.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>stdlib.hE<gt>>

source: B<getpt>() opens a pseudoterminal master and returns its file descriptor. It is equivalent to
ru: Функция B<getpt>() открывает основной псевдотерминал и возвращает его файловый дескриптор. Она эквивалентна

source: on Linux systems, though the pseudoterminal master is located elsewhere on some systems that use GNU Libc.
ru: в системах Linux, хотя основной псевдотерминал в других системах, использующих библиотеку GNU Libc, может быть расположен в другом месте.

source: B<getpt>() returns an open file descriptor upon successful completion. Otherwise, it returns -1 and sets I<errno> to indicate the error.
ru: При успешном выполнении функция B<getp>t() возвращает открытый файловых дескриптор. В противном случае возвращается -1 и переменной I<errno> присваивается код ошибки.

source: B<getpt>() can fail with various errors described in B<open>(2).
ru: Функция B<getpt>() может завершаться с ошибками, описанными в B<open>(2).

source: B<getpt>() is provided in glibc since version 2.1.
ru: Функция B<getpt>() появилась в glibc начиная с версии 2.1.

source: B<getpt>() is glibc-specific; use B<posix_openpt>(3) instead.
ru: Функция B<getpt>() есть только в glibc; вместо неё используйте B<posix_openpt>(3).

source: getloadavg - get system load averages
ru: getloadavg - возвращает среднее значение загруженности системы

source: Since glibc 2.19: _DEFAULT_SOURCE In glibc up to and including 2.19: _BSD_SOURCE
ru: начиная с glibc 2.19: _DEFAULT_SOURCE в glibc до версии 2.19 включительно: _BSD_SOURCE

source: The B<getloadavg>() function returns the number of processes in the system run queue averaged over various periods of time. Up to I<nelem> samples are retrieved and assigned to successive elements of I<loadavg>[]. The system imposes a maximum of 3 samples, representing averages over the last 1, 5, and 15 minutes, respectively.
ru: Функция B<getloadavg>() возвращает количество процессов в системной очереди выполнения, усреднённое в разных периодах времени. Воспринимается до I<nelem> образцов и они последовательно назначаются в элементы I<loadavg>[]. Система максимально выводит 3 образца, представляющие средние данные за последние 1, 5 и 15 минут, соответственно.

source: If the load average was unobtainable, -1 is returned; otherwise, the number of samples actually retrieved is returned.
ru: Если невозможно получить данные о средней загруженности системы, то возвращается -1; иначе возвращается количество полученных образов.

source: This function is available in glibc since version 2.2.
ru: Эта функция доступна в glibc начиная с версии 2.2.

source: Not in POSIX.1. Present on the BSDs and Solaris.
ru: Не является частью POSIX.1. Имеется в BSD и Solaris.

source: getprotoent_r, getprotobyname_r, getprotobynumber_r - get protocol entry (reentrant)
ru: getprotoent_r, getprotobyname_r, getprotobynumber_r - возвращают запись о протоколе (реентерабельные версии)

source: B<getprotoent_r>(), B<getprotobyname_r>(), B<getprotobynumber_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getprotoent_r>(), B<getprotobyname_r>(), B<getprotobynumber_r>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: The B<getprotoent_r>(), B<getprotobyname_r>(), and B<getprotobynumber_r>() functions are the reentrant equivalents of, respectively, B<getprotoent>(3), B<getprotobyname>(3), and B<getprotobynumber>(3). They differ in the way that the I<protoent> structure is returned, and in the function calling signature and return value. This manual page describes just the differences from the nonreentrant functions.
ru: Функции B<getprotoent_r>(), B<getprotobyname_r>() и B<getprotobynumber_r>() являются реентерабельными эквивалентами B<getprotoent>(3), B<getprotobyname>(3) и B<getprotobynumber>(3), соответственно. Они отличаются способом возврата структуры I<protoent>, списком параметров и типом возвращаемого значения. В этой справочной странице описаны только различия с нереентерабельными функциями.

source: Instead of returning a pointer to a statically allocated I<protoent> structure as the function result, these functions copy the structure into the location pointed to by I<result_buf>.
ru: Вместо возврата указателя на статически выделенную структуру I<protoent> в качестве результата эти функции копируют структуру в расположение, указанное I<result_buf>.

source: The I<buf> array is used to store the string fields pointed to by the returned I<protoent> structure. (The nonreentrant functions allocate these strings in static storage.) The size of this array is specified in I<buflen>. If I<buf> is too small, the call fails with the error B<ERANGE>, and the caller must try again with a larger buffer. (A buffer of length 1024 bytes should be sufficient for most applications.)
ru: Массив I<buf> используется для хранения строковых полей из возвращаемой структуры I<protoent> (нереентерабельные функции выделяют эти строки из статического хранилища). Размер данного массива задаётся в I<buflen>. Если I<buf> слишком мал, то вызов завершается с ошибкой B<ERANGE>, вызывающий должен его повторить с большим буфером (для большинства приложений должно быть достаточно буфера длиной 1024 байт).

source: If the function call successfully obtains a protocol record, then I<*result> is set pointing to I<result_buf>; otherwise, I<*result> is set to NULL.
ru: Если вызов получил запись о протоколе, то I<*result> указывает на I<result_buf>; в противном случае I<*result> устанавливается в NULL.

source: On error, record not found (B<getprotobyname_r>(), B<getprotobynumber_r>()), or end of input (B<getprotoent_r>()) I<result> is set to NULL.
ru: При ошибке, отсутствии записи (B<getprotobyname_r>(), B<getprotobynumber_r>()) или конце данных (B<getprotoent_r>()) значение I<result> равно NULL.

source: (B<getprotoent_r>()) No more records in database.
ru: (B<getprotoent_r>()) Больше нет записей в базе данных.

source: The program below uses B<getprotobyname_r>() to retrieve the protocol record for the protocol named in its first command-line argument. If a second (integer) command-line argument is supplied, it is used as the initial value for I<buflen>; if B<getprotobyname_r>() fails with the error B<ERANGE>, the program retries with larger buffer sizes. The following shell session shows a couple of sample runs:
ru: Программа, представленная ниже, использует B<getprotobyname_r>() для получения записи о протоколе с именем, указанным в командной строке. Если задан второй параметр (целое), то он используется как начальное значение I<buflen>; если B<getprotobyname_r>() завершается с ошибкой B<ERANGE>, то программа повторяет попытки с большими значениями буфера. Пара примеров работы в сеансовой оболочке:

source: $B< ./a.out tcp 1> ERANGE! Retrying with larger buffer getprotobyname_r() returned: 0 (success) (buflen=78) p_name=tcp; p_proto=6; aliases=TCP $B< ./a.out xxx 1> ERANGE! Retrying with larger buffer getprotobyname_r() returned: 0 (success) (buflen=100) Call failed/record not found
ru: $B< ./a.out tcp 1> ERANGE! Повтор с большим буфером результат getprotobyname_r(): 0 (успешно) (buflen=78) p_name=tcp; p_proto=6; aliases=TCP $B< ./a.out xxx 1> ERANGE! Повтор с большим буфером результат getprotobyname_r(): 0 (успешно) (buflen=100) Ошибка вызова/запись не найдена

source: if (argc E<lt> 2) { printf("Usage: %s proto-name [buflen]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 2) { printf("Использование: %s имя-протокола [длина-буф]\en", argv[0]); exit(EXIT_FAILURE); }
