Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The elements of this structure correspond to the arguments of B<getaddrinfo>(3). Thus, I<ar_name> corresponds to the I<node> argument and I<ar_service> to the I<service> argument, identifying an Internet host and a service. The I<ar_request> element corresponds to the I<hints> argument, specifying the criteria for selecting the returned socket address structures. Finally, I<ar_result> corresponds to the I<res> argument; you do not need to initialize this element, it will be automatically set when the request is resolved. The I<addrinfo> structure referenced by the last two elements is described in B<getaddrinfo>(3).
ru: Элементы данной структуры совпадают с аргументами B<getaddrinfo>(3). То есть I<ar_name> соответствует аргументу I<node>, а I<ar_service> аргументу I<service> (определяют узел Интернета и службу). Элемент I<ar_request> соответствует аргументу I<hints>; им задаётся критерий выбора структуры возвращаемого адреса сокета. И, наконец, I<ar_result> соответствует аргументу I<res>; вам не нужно инициализировать этот элемент, он будет заполнен автоматически в результате запроса. Структура I<addrinfo>, на которую ссылаются последние два элемента, описана в B<getaddrinfo>(3).

source: When I<mode> is specified as B<GAI_NOWAIT>, notifications about resolved requests can be obtained by employing the I<sigevent> structure pointed to by the I<sevp> argument. For the definition and general details of this structure, see B<sigevent>(7). The I<sevp-E<gt>sigev_notify> field can have the following values:
ru: Если значение I<mode> равно B<GAI_NOWAIT>, то уведомления о обработанных запросах можно получить из структуры I<sigevent>, на которую указывает аргумент I<sevp>. Определение и описание данной структуры приведено в B<sigevent>(7). Поле I<sevp-E<gt>sigev_notify> может иметь следующие значения:

source: Don't provide any notification.
ru: Отключить уведомление.

source: When a look-up completes, generate the signal I<sigev_signo> for the process. See B<sigevent>(7) for general details. The I<si_code> field of the I<siginfo_t> structure will be set to B<SI_ASYNCNL>.
ru: При завершении поиска послать процессу сигнал I<sigev_signo>. Подробности смотрите в B<sigevent>(7). Полю I<si_code> структуры I<siginfo_t> присваивается значение B<SI_ASYNCNL>.

source: When a look-up completes, invoke I<sigev_notify_function> as if it were the start function of a new thread. See B<sigevent>(7) for details.
ru: При завершении поиска вызвать I<sigev_notify_function>, как если бы с этой функции начиналась бы новая нить. Подробности смотрите в B<sigevent>(7).

source: For B<SIGEV_SIGNAL> and B<SIGEV_THREAD>, it may be useful to point I<sevp-E<gt>sigev_value.sival_ptr> to I<list>.
ru: При B<SIGEV_SIGNAL> и B<SIGEV_THREAD>, может быть полезно, чтобы I<sevp-E<gt>sigev_value.sival_ptr> указывала на I<list>.

source: The B<gai_suspend>() function suspends execution of the calling thread, waiting for the completion of one or more requests in the array I<list>. The I<nitems> argument specifies the size of the array I<list>. The call blocks until one of the following occurs:
ru: Функция B<gai_suspend>() приостанавливает выполнение вызывающей нити, ожидая завершения поиска одного или более запросов из массива I<list>. В аргументе I<nitems> задаётся размер массива I<list>. Вызов блокирует выполнение пока не произойдёт одно из следующего:

source: One or more of the operations in I<list> completes.
ru: Завершится операция для одного или более запросов из I<list>.

source: The call is interrupted by a signal that is caught.
ru: Вызов прервётся пойманным сигналом.

source: The time interval specified in I<timeout> elapses. This argument specifies a timeout in seconds plus nanoseconds (see B<nanosleep>(2) for details of the I<timespec> structure). If I<timeout> is NULL, then the call blocks indefinitely (until one of the events above occurs).
ru: Временной интервал ожидания задаётся в I<timeout>. В данном аргумента указывается промежуток в секундах плюс наносекундах (о структуре I<timespec> смотрите B<nanosleep>(2)). Если I<timeout> равно NULL, то вызов блокирует выполнение навсегда (пока не произойдёт одно из событий выше).

source: No explicit indication of which request was completed is given; you must determine which request(s) have completed by iterating with B<gai_error>() over the list of requests.
ru: При выполнении явно не указывается какие запросы завершены; для определения вам нужно обойти весь список запросов с помощью B<gai_error>().

source: The B<gai_error>() function returns the status of the request I<req>: either B<EAI_INPROGRESS> if the request was not completed yet, 0 if it was handled successfully, or an error code if the request could not be resolved.
ru: Функция B<gai_error>() возвращает состояние запроса I<req>: B<EAI_INPROGRESS> — запрос пока не выполнен, 0 — обработан успешно, код ошибки — запрос невозможно обработать.

source: The B<gai_cancel>() function cancels the request I<req>. If the request has been canceled successfully, the error status of the request will be set to B<EAI_CANCELED> and normal asynchronous notification will be performed. The request cannot be canceled if it is currently being processed; in that case, it will be handled as if B<gai_cancel>() has never been called. If I<req> is NULL, an attempt is made to cancel all outstanding requests that the process has made.
ru: Функция B<gai_cancel>() отменяет запрос I<req>. При успешной отмене состояние ошибки устанавливается в B<EAI_CANCELED> и выполняется обычное асинхронное уведомление. Запрос не может быть отменён, если он начал обрабатываться; в этом случае действие будет доведено до конца, как если бы вызова B<gai_cancel>() не происходило. Если I<req> равно NULL, то будет предпринята попытка отменить все имеющиеся запросы.

source: The B<getaddrinfo_a>() function returns 0 if all of the requests have been enqueued successfully, or one of the following nonzero error codes:
ru: Функция B<getaddrinfo_a>() возвращает 0, если все запросы были успешно обработаны или один из следующих ненулевых кодов ошибки:

source: The resources necessary to enqueue the look-up requests were not available. The application may check the error status of each request to determine which ones failed.
ru: Недоступны ресурсы, необходимые, чтобы постановки запросов поиска в очередь. Для нахождения проблемного приложение может проверить состояние ошибки каждого запроса.

source: I<mode> is invalid.
ru: Неверное значение I<mode>.

source: The B<gai_suspend>() function returns 0 if at least one of the listed requests has been completed. Otherwise, it returns one of the following nonzero error codes:
ru: Функция B<gai_suspend>() возвращает 0, если завершён хотя бы один из запросов. В противном случае возвращается один из следующих ненулевых кодов ошибки:

source: The given timeout expired before any of the requests could be completed.
ru: Указанный интервал истёк до завершения хотят бы одного из запросов.

source: There were no actual requests given to the function.
ru: В функцию не было передано никаких фактических запросов.

source: A signal has interrupted the function. Note that this interruption might have been caused by signal notification of some completed look-up request.
ru: Функция прервана сигналом. Заметим, что такое прерывание может быть вызвано сигналом уведомления о каком-то выполненном запросе.

source: The B<gai_error>() function can return B<EAI_INPROGRESS> for an unfinished look-up request, 0 for a successfully completed look-up (as described above), one of the error codes that could be returned by B<getaddrinfo>(3), or the error code B<EAI_CANCELED> if the request has been canceled explicitly before it could be finished.
ru: Функция B<gai_error>() может вернуть B<EAI_INPROGRESS> для незаконченных запросов поиска, 0 при успешном поиске (как описано выше), один из кодов ошибок, которые может вернуть B<getaddrinfo>(3) или код ошибки B<EAI_CANCELED>, если запрос был отменён явно до завершения.

source: The B<gai_cancel>() function can return one of these values:
ru: Функция B<gai_cancel>() может вернуть одно из следующих значений:

source: The request has been canceled successfully.
ru: Запрос успешно отменён.

source: The request has not been canceled.
ru: Запрос не был отменён.

source: The request has already completed.
ru: Запрос уже выполнен.

source: These functions are GNU extensions; they first appeared in glibc in version 2.2.3.
ru: Эти функции являются расширениями GNU, доступными в glibc начиная с версии 2.2.3.

source: The interface of B<getaddrinfo_a>() was modeled after the B<lio_listio>(3) interface.
ru: Интерфейс B<getaddrinfo_a>() был создан после интерфейса B<lio_listio>(3).

source: Two examples are provided: a simple example that resolves several requests in parallel synchronously, and a complex example showing some of the asynchronous capabilities.
ru: Вот два примера: простой пример выполнения нескольких запросов синхронно одновременно, и сложный пример, показывающий асинхронные возможности.

source: Synchronous example
ru: Синхронный пример

source: The program below simply resolves several hostnames in parallel, giving a speed-up compared to resolving the hostnames sequentially using B<getaddrinfo>(3). The program might be used like this:
ru: Эта программа определяет несколько имён узлов параллельно, что быстрее по сравнению с определением имён последовательно с помощью B<getaddrinfo>(3). Результат работы программы:

source: Here is the program source code
ru: Исходный код программы

source: if (argc E<lt> 2) { fprintf(stderr, "Usage: %s HOST...\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 2) { fprintf(stderr, "Использование: %s УЗЕЛ...\en", argv[0]); exit(EXIT_FAILURE); }

source: ret = getaddrinfo_a(GAI_WAIT, reqs, argc - 1, NULL); if (ret != 0) { fprintf(stderr, "getaddrinfo_a() failed: %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); }
ru: ret = getaddrinfo_a(GAI_WAIT, reqs, argc - 1, NULL); if (ret != 0) { fprintf(stderr, "ошибка getaddrinfo_a(): %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); }

source: ret = getnameinfo(res-E<gt>ai_addr, res-E<gt>ai_addrlen, host, sizeof(host), NULL, 0, NI_NUMERICHOST); if (ret != 0) { fprintf(stderr, "getnameinfo() failed: %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); } puts(host);
ru: ret = getnameinfo(res-E<gt>ai_addr, res-E<gt>ai_addrlen, host, sizeof(host), NULL, 0, NI_NUMERICHOST); if (ret != 0) { fprintf(stderr, "ошибка getnameinfo(): %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); } puts(host);

source: Asynchronous example
ru: Асинхронный пример

source: This example shows a simple interactive B<getaddrinfo_a>() front-end. The notification facility is not demonstrated.
ru: Данный пример — простая интерактивная оболочка к B<getaddrinfo_a>(). Возможности уведомления не используются.

source: An example session might look like this:
ru: Результат работы программы:

source: $ B<./a.out> E<gt> a ftp.us.kernel.org enoent.linuxfoundation.org gnu.cz E<gt> c 2 [2] gnu.cz: Request not canceled E<gt> w 0 1 [00] ftp.us.kernel.org: Finished E<gt> l [00] ftp.us.kernel.org: 216.165.129.139 [01] enoent.linuxfoundation.org: Processing request in progress [02] gnu.cz: 87.236.197.13 E<gt> l [00] ftp.us.kernel.org: 216.165.129.139 [01] enoent.linuxfoundation.org: Name or service not known [02] gnu.cz: 87.236.197.13
ru: $ B<./a.out> E<gt> a ftp.us.kernel.org enoent.linuxfoundation.org gnu.cz E<gt> c 2 [2] gnu.cz: Request not canceled E<gt> w 0 1 [00] ftp.us.kernel.org: Выполнено E<gt> l [00] ftp.us.kernel.org: 216.165.129.139 [01] enoent.linuxfoundation.org: Processing request in progress [02] gnu.cz: 87.236.197.13 E<gt> l [00] ftp.us.kernel.org: 216.165.129.139 [01] enoent.linuxfoundation.org: Name or service not known [02] gnu.cz: 87.236.197.13

source: The program source is as follows:
ru: Исходный код программы:

source: /* Add requests for specified hostnames */ static void add_requests(void) { int nreqs_base = nreqs; char *host; int ret;
ru: /* добавление запросов задаваемых имён */ static void add_requests(void) { int nreqs_base = nreqs; char *host; int ret;

source: /* Queue nreqs_base..nreqs requests. */
ru: /* очередь запросов nreqs_base..nreqs. */

source: ret = getaddrinfo_a(GAI_NOWAIT, &reqs[nreqs_base], nreqs - nreqs_base, NULL); if (ret) { fprintf(stderr, "getaddrinfo_a() failed: %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); } }
ru: ret = getaddrinfo_a(GAI_NOWAIT, &reqs[nreqs_base], nreqs - nreqs_base, NULL); if (ret) { fprintf(stderr, "ошибка getaddrinfo_a(): %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); } }

source: /* Wait until at least one of specified requests completes */ static void wait_requests(void) { char *id; int i, ret, n; struct gaicb const **wait_reqs = calloc(nreqs, sizeof(*wait_reqs)); /* NULL elements are ignored by gai_suspend(). */
ru: /* ждём, пока один из запросов не выполнится */ static void wait_requests(void) { char *id; int i, ret, n; struct gaicb const **wait_reqs = calloc(nreqs, sizeof(*wait_reqs)); /* элементы NULL игнорируются gai_suspend(). */

source: if (n E<gt>= nreqs) { printf("Bad request number: %s\en", id); return; }
ru: if (n E<gt>= nreqs) { printf("Неправильный номер запроса: %s\en", id); return; }

source: printf("[%02d] %s: %s\en", i, reqs[i]-E<gt>ar_name, ret == 0 ? "Finished" : gai_strerror(ret)); } }
ru: printf("[%02d] %s: %s\en", i, reqs[i]-E<gt>ar_name, ret == 0 ? "Выполнено" : gai_strerror(ret)); } }

source: /* Cancel specified requests */ static void cancel_requests(void) { char *id; int ret, n;
ru: /* отменяет заданные запросы */ static void cancel_requests(void) { char *id; int ret, n;

source: /* List all requests */ static void list_requests(void) { int i, ret; char host[NI_MAXHOST]; struct addrinfo *res;
ru: /* перечислим все запросы */ static void list_requests(void) { int i, ret; char host[NI_MAXHOST]; struct addrinfo *res;

source: ret = getnameinfo(res-E<gt>ai_addr, res-E<gt>ai_addrlen, host, sizeof(host), NULL, 0, NI_NUMERICHOST); if (ret) { fprintf(stderr, "getnameinfo() failed: %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); } puts(host); } else { puts(gai_strerror(ret)); } } }
ru: ret = getnameinfo(res-E<gt>ai_addr, res-E<gt>ai_addrlen, host, sizeof(host), NULL, 0, NI_NUMERICHOST); if (ret) { fprintf(stderr, "ошибка getnameinfo(): %s\en", gai_strerror(ret)); exit(EXIT_FAILURE); } puts(host); } else { puts(gai_strerror(ret)); } } }

source: if (cmd == NULL) { list_requests(); } else { switch (cmd[0]) { case \(aqa\(aq: add_requests(); break; case \(aqw\(aq: wait_requests(); break; case \(aqc\(aq: cancel_requests(); break; case \(aql\(aq: list_requests(); break; default: fprintf(stderr, "Bad command: %c\en", cmd[0]); break; } } } exit(EXIT_SUCCESS); }
ru: if (cmd == NULL) { list_requests(); } else { switch (cmd[0]) { case \(aqa\(aq: add_requests(); break; case \(aqw\(aq: wait_requests(); break; case \(aqc\(aq: cancel_requests(); break; case \(aql\(aq: list_requests(); break; default: fprintf(stderr, "Неверная команда: %c\en", cmd[0]); break; } } } exit(EXIT_SUCCESS); }

source: getnetent, getnetbyname, getnetbyaddr, setnetent, endnetent - get network entry
ru: getnetent, getnetbyname, getnetbyaddr, setnetent, endnetent - получить запись сети

source: The B<getnetent>() function reads the next entry from the networks database and returns a I<netent> structure containing the broken-out fields from the entry. A connection is opened to the database if necessary.
ru: Функция B<getnetent>() считывает следующую запись из файла, содержащего базу сетей, и возвращает структуру I<netent>, содержащую поля из этой записи. При необходимости будет открыто подключение к базе.

source: The B<getnetbyname>() function returns a I<netent> structure for the entry from the database that matches the network I<name>.
ru: Функция B<getnetbyname>() возвращает структуру I<netent> для записи из базы, соответствующей сети I<name>.

source: The B<getnetbyaddr>() function returns a I<netent> structure for the entry from the database that matches the network number I<net> of type I<type>. The I<net> argument must be in host byte order.
ru: Функция B<getnetbyaddr>() возвращает структуру I<netent> для записи из базы, которая соответствует номеру сети I<net> типа I<type>. Аргумент I<net> должен использовать порядок байтов, использующийся на машине.

source: The B<setnetent>() function opens a connection to the database, and sets the next entry to the first entry. If I<stayopen> is nonzero, then the connection to the database will not be closed between calls to one of the B<getnet*>() functions.
ru: Функция B<setnetent>() открывает соединение к базе и устанавливает следующую запись к первой записи. Если I<stayopen> не равен нулю, то подключение к базе между вызовами нескольких функций B<getnet*>() не будет закрыто.

source: The B<endnetent>() function closes the connection to the database.
ru: Функция B<endnetent>() закрывает подключение к базе.

source: The I<netent> structure is defined in I<E<lt>netdb.hE<gt>> as follows:
ru: Структура I<netent> определена в I<E<lt>netdb.hE<gt>> таким образом:

source: struct netent { char *n_name; /* official network name */ char **n_aliases; /* alias list */ int n_addrtype; /* net address type */ uint32_t n_net; /* network number */ }
ru: struct netent { char *n_name; /* официальное имя сети */ char **n_aliases; /* список псевдонимов */ int n_addrtype; /* тип сетевого адреса */ uint32_t n_net; /* номер сети */ }

source: The members of the I<netent> structure are:
ru: Члены структуры I<netent>:

source: The official name of the network.
ru: Официальное название сети.

source: A NULL-terminated list of alternative names for the network.
ru: Список альтернативных имён сети, завершающийся NULL.

source: The type of the network number; always B<AF_INET>.
ru: Тип номера сети, всегда равно B<AF_INET>.

source: The network number in host byte order.
ru: Номер сети в порядке байтов, использующемся на машине.

source: The B<getnetent>(), B<getnetbyname>() and B<getnetbyaddr>() functions return a pointer to a statically allocated I<netent> structure, or a null pointer if an error occurs or the end of the file is reached.
ru: Функции B<getnetent>(), B<getnetbyname>() и B<getnetbyaddr>() возвращают указатель на статически выделенную структуру I<netent> или указатель null при ошибке или достижении конца файла.

source: networks database file
ru: файл, содержащий базу сетей

source: In the above table, I<netent> in I<race:netent> signifies that if any of the functions B<setnetent>(), B<getnetent>(), or B<endnetent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<netent> в I<race:netent> означает, что если в нескольких нитях программы одновременно используются функции B<setnetent>(), B<getnetent>() или B<endnetent>(), то может возникнуть состязательность по данным.

source: In glibc versions before 2.2, the I<net> argument of B<getnetbyaddr>() was of type I<long>.
ru: В версия glibc ниже 2.2 аргумент I<net> из B<getnetbyaddr>() имел тип I<long>.

source: getgrent_r, fgetgrent_r - get group file entry reentrantly
ru: getgrent_r, fgetgrent_r - возвращает запись из файла групп (реентерабельные версии)

source: B<fgetgrent_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _SVID_SOURCE
ru: B<fgetgrent_r>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _SVID_SOURCE

source: The functions B<getgrent_r>() and B<fgetgrent_r>() are the reentrant versions of B<getgrent>(3) and B<fgetgrent>(3). The former reads the next group entry from the stream initialized by B<setgrent>(3). The latter reads the next group entry from I<stream>.
ru: Функции B<getgrent_r>() и B<fgetgrent_r>() являются реентерабельными версиями B<getgrent>(3) и B<fgetgrent>(3). Первая читает следующую запись группы из потока, инициализированного B<setgrent>(3). Последняя читает следующую запись группы из I<stream>.

source: The nonreentrant functions return a pointer to static storage, where this static storage contains further pointers to group name, password and members. The reentrant functions described here return all of that in caller-provided buffers. First of all there is the buffer I<gbuf> that can hold a I<struct group>. And next the buffer I<buf> of size I<buflen> that can hold additional strings. The result of these functions, the I<struct group> read from the stream, is stored in the provided buffer I<*gbuf>, and a pointer to this I<struct group> is returned in I<*gbufp>.
ru: Нереентерабельные версии возвращают указатель на статическое хранилище, в котором хранятся другие указатели на имя группы, пароль и список членов. Реентерабельные функции, описанные здесь, возвращают всю информацию в буферах, предоставленных вызывающим. Основным буфером является I<gbuf>, в котором может храниться I<struct group>. В дополнительном буфере I<buf> размера I<buflen> могут храниться дополнительные строки. Результат этих функций, прочитанная из потока I<struct group>, сохраняется в предоставляемый буфер I<*gbuf>, и указатель на эту I<struct group> возвращается в I<*gbufp>.

source: On success, these functions return 0 and I<*gbufp> is a pointer to the I<struct group>. On error, these functions return an error value and I<*gbufp> is NULL.
ru: При успешном выполнении эти функции возвращают 0 и I<*gbufp> указывает на I<struct group>. При ошибке возвращается значение ошибки и I<*gbufp> равен NULL.

source: In the above table, I<grent> in I<race:grent> signifies that if any of the functions B<setgrent>(), B<getgrent>(), B<endgrent>(), or B<getgrent_r>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<grent> в I<race:grent> означает, что если в нескольких нитях программы одновременно используются функции B<setgrent>(), B<getgrent>(), B<endgrent>() или B<getgrent_r>(), то может возникнуть состязательность по данным.

source: The function B<getgrent_r>() is not really reentrant since it shares the reading position in the stream with all other threads.
ru: Функция B<getgrent_r>() не совсем реентерабельна, так как она использует общую позицию чтения в потоке с другими нитями.

source: getspnam, getspnam_r, getspent, getspent_r, setspent, endspent, fgetspent, fgetspent_r, sgetspent, sgetspent_r, putspent, lckpwdf, ulckpwdf - get shadow password file entry
ru: getspnam, getspnam_r, getspent, getspent_r, setspent, endspent, fgetspent, fgetspent_r, sgetspent, sgetspent_r, putspent, lckpwdf, ulckpwdf - получение записи из теневого файла паролей

source: /* General shadow password file API */ B<#include E<lt>shadow.hE<gt>>
ru: /* Основной API теневого файла паролей */ B<#include E<lt>shadow.hE<gt>>

source: /* GNU extension */ B<#include E<lt>shadow.hE<gt>>
ru: /* Расширение GNU */ B<#include E<lt>shadow.hE<gt>>

source: B<getspent_r>(), B<getspnam_r>(), B<fgetspent_r>(), B<sgetspent_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getspent_r>(), B<getspnam_r>(), B<fgetspent_r>(), B<sgetspent_r>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE
