Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: If set, then the numeric form of the service address is returned. (When not set, this will still happen in case the service's name cannot be determined.)
ru: Если этот флаг установлен, тогда имя службы возвращается в числовой форме (если этот флаг не установлен, то это также произойдёт в случае, когда имя узла невозможно определить).

source: Extensions to getnameinfo() for Internationalized Domain Names
ru: Расширения getnameinfo() для интернациональных доменных имён

source: Starting with glibc 2.3.4, B<getnameinfo>() has been extended to selectively allow hostnames to be transparently converted to and from the Internationalized Domain Name (IDN) format (see RFC 3490, I<Internationalizing Domain Names in Applications (IDNA)>). Three new flags are defined:
ru: Начиная с glibc 2.3.4, B<getnameinfo>() была расширена для выборочного прозрачного разрешения имён для формата интернациональных доменных имён (IDN) (смотрите RFC 3490, I<Internationalizing Domain Names in Applications (IDNA)>). Было определено четыре новых флага:

source: If this flag is used, then the name found in the lookup process is converted from IDN format to the locale's encoding if necessary. ASCII-only names are not affected by the conversion, which makes this flag usable in existing programs and environments.
ru: Если этот флаг установлен, то при необходимости искомое имя преобразуется из формата IDN в кодировку локали. Имена из только ASCI-символов не меняются при преобразовании, из-за чего данный флаг можно использовать в существующих программах и средах.

source: Setting these flags will enable the IDNA_ALLOW_UNASSIGNED (allow unassigned Unicode code points) and IDNA_USE_STD3_ASCII_RULES (check output to make sure it is a STD3 conforming hostname) flags respectively to be used in the IDNA handling.
ru: Установка этих флагов включает IDNA_ALLOW_UNASSIGNED (разрешать не назначенные кодовые точки Юникода) и IDNA_USE_STD3_ASCII_RULES (проверять вывод на соответствие имени узла STD3) соответственно для возможности работы с IDNA.

source: On success, 0 is returned, and node and service names, if requested, are filled with null-terminated strings, possibly truncated to fit the specified buffer lengths. On error, one of the following nonzero error codes is returned:
ru: При успешном выполнении возвращается 0, а строки (оканчивающееся null) имени узла и службы (если запрашивались) записываются в соответствующий буфер заданной длины. При ошибке возвращается одно из следующих ненулевых значений ошибки:

source: The name could not be resolved at this time. Try again later.
ru: Имя не может быть определено в настоящий момент. Попробуйте повторить попытку позже.

source: The I<flags> argument has an invalid value.
ru: Параметр I<flags> имеет неверное значение.

source: A nonrecoverable error occurred.
ru: Произошла неисправимая ошибка.

source: The address family was not recognized, or the address length was invalid for the specified family.
ru: Не распознано семейство адресов, или для данного семейства была указана неверно длина адреса.

source: The name does not resolve for the supplied arguments. B<NI_NAMEREQD> is set and the host's name cannot be located, or neither hostname nor service name were requested.
ru: Имя не может быть определено для указанных параметров. Установлен флаг B<NI_NAMEREQD> и имя машины не может быть определено, или не было запрошено не имя машины и не имя службы.

source: The buffer pointed to by I<host> or I<serv> was too small.
ru: Размер буфера, на который указывает I<host> или I<serv> слишком мал.

source: A system error occurred. The error code can be found in I<errno>.
ru: Произошла системная ошибка. Код системной ошибки можно найти в переменной I<errno>.

source: The B<gai_strerror>(3) function translates these error codes to a human readable string, suitable for error reporting.
ru: Функция B<gai_strerror>(3) транслирует эти коды ошибок в читаемый формат, подходящий для сообщений об ошибке.

source: B<getnameinfo>() is provided in glibc since version 2.1.
ru: Функция B<getnameinfo>() появилась в glibc начиная с версии 2.1.

source: In order to assist the programmer in choosing reasonable sizes for the supplied buffers, I<E<lt>netdb.hE<gt>> defines the constants
ru: Чтобы помочь программисту выбрать нужный размер буферов в I<E<lt>netdb.hE<gt>> определены константы

source: Since glibc 2.8, these definitions are exposed only if suitable feature test macros are defined, namely: B<_GNU_SOURCE>, B<_DEFAULT_SOURCE> (since glibc 2.19), or (in glibc versions up to and including 2.19) B<_BSD_SOURCE> or B<_SVID_SOURCE>.
ru: Начиная с glibc 2.8, эти определения доступны только, если определён подходящий макрос тестирования свойств: B<_GNU_SOURCE>, B<_DEFAULT_SOURCE> (начиная с glibc 2.19) или (в версиях glibc с 2.19 включительно) B<_BSD_SOURCE> или B<_SVID_SOURCE>.

source: The former is the constant B<MAXDNAME> in recent versions of BIND's I<E<lt>arpa/nameser.hE<gt>> header file. The latter is a guess based on the services listed in the current Assigned Numbers RFC.
ru: Первая — это константа B<MAXDNAME> из новых версий заголовочного файла I<E<lt>arpa/nameser.hE<gt>> BIND. Последняя — вычислена на основе служб, перечисленных в текущем RFC «Assigned Numbers».

source: Before glibc version 2.2, the I<hostlen> and I<servlen> arguments were typed as I<size_t>.
ru: В glibc до версии 2.2 аргументы I<hostlen> и I<servlen> имели тип I<size_t>.

source: The following code tries to get the numeric hostname and service name, for a given socket address. Note that there is no hardcoded reference to a particular address family.
ru: Следующий код пытается получить имя машины и службы в числовой форме для указанного адреса сокета. Обратите внимание, что здесь нет прямых упоминаний определённого семейства адресов.

source: struct sockaddr *addr; /* input */ socklen_t addrlen; /* input */ char hbuf[NI_MAXHOST], sbuf[NI_MAXSERV];
ru: struct sockaddr *addr; /* входные */ socklen_t addrlen; /* входные */ char hbuf[NI_MAXHOST], sbuf[NI_MAXSERV];

source: The following version checks if the socket address has a reverse address mapping.
ru: Следующая версия проверяет, имеет ли адрес сокета обратное отображение адреса.

source: struct sockaddr *addr; /* input */ socklen_t addrlen; /* input */ char hbuf[NI_MAXHOST];
ru: struct sockaddr *addr; /* входные */ socklen_t addrlen; /* входные */ char hbuf[NI_MAXHOST];

source: if (getnameinfo(addr, addrlen, hbuf, sizeof(hbuf), NULL, 0, NI_NAMEREQD)) printf("could not resolve hostname"); else printf("host=%s\en", hbuf);
ru: if (getnameinfo(addr, addrlen, hbuf, sizeof(hbuf), NULL, 0, NI_NAMEREQD)) printf("не удалось определить имя узла"); else printf("host=%s\en", hbuf);

source: An example program using B<getnameinfo>() can be found in B<getaddrinfo>(3).
ru: Пример программы, использующей B<getnameinfo>(), можно найти в B<getaddrinfo>(3).

source: Tatsuya Jinmei and Atsushi Onoe, I<An Extension of Format for IPv6 Scoped Addresses>, internet draft, work in progress E<.UR ftp://ftp.ietf.org\:/internet-drafts\:/draft-ietf-ipngwg-scopedaddr-format-02.txt> E<.UE .>
ru: Tatsuya Jinmei and Atsushi Onoe, I<An Extension of Format for IPv6 Scoped Addresses>, черновик E<.UR ftp://ftp.ietf.org\:/internet-drafts\:/draft-ietf-ipngwg-scopedaddr-format-02.txt> E<.UE .>

source: Craig Metz, I<Protocol Independence Using the Sockets API>, Proceedings of the freenix track: 2000 USENIX annual technical conference, June 2000
ru: Craig Metz, I<Protocol Independence Using the Sockets API>, Продолжение темы freenix: 2000 USENIX ежегодной технической конференции, июнь 2000

source: getgrent, setgrent, endgrent - get group file entry
ru: getgrent, setgrent, endgrent - возвращает запись из файла групп

source: Since glibc 2.22: _XOPEN_SOURCE\ E<gt>=\ 500 || _DEFAULT_SOURCE
ru: начиная с glibc 2.22: _XOPEN_SOURCE\ E<gt>=\ 500 || _DEFAULT_SOURCE

source: Glibc 2.21 and earlier _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: в glibc 2.21 и старее _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<getgrent>() function returns a pointer to a structure containing the broken-out fields of a record in the group database (e.g., the local group file I</etc/group>, NIS, and LDAP). The first time B<getgrent>() is called, it returns the first entry; thereafter, it returns successive entries.
ru: Функция B<getgrent>() возвращает указатель на структуру, содержащую разделённую на поля запись базы данных групп (например, локального файла групп I</etc/group>, NIS и LDAP). При первом вызове B<getgrent>() возвращает первую запись; при следующих последовательно возвращаются остальные записи.

source: The B<setgrent>() function rewinds to the beginning of the group database, to allow repeated scans.
ru: Функция B<setgrent>() возвращается к началу базы данных групп, позволяя выполнять повторное сканирование.

source: The B<endgrent>() function is used to close the group database after all processing has been performed.
ru: Функция B<endgrent>() используется для закрытия базы данных групп при завершении процесса обработки.

source: The I<group> structure is defined in I<E<lt>grp.hE<gt>> as follows:
ru: Структура I<group> определена в I<E<lt>grp.hE<gt>> следующим образом:

source: struct group { char *gr_name; /* group name */ char *gr_passwd; /* group password */ gid_t gr_gid; /* group ID */ char **gr_mem; /* NULL-terminated array of pointers to names of group members */ };
ru: struct group { char *gr_name; /* имя группы */ char *gr_passwd; /* пароль группы */ gid_t gr_gid; /* ID группы */ char **gr_mem; /* массив, указателей имён членов группы, оканчивающийся NULL */ };

source: For more information about the fields of this structure, see B<group>(5).
ru: Подробней о полях этой структуры смотрите в B<group>(5).

source: The B<getgrent>() function returns a pointer to a I<group> structure, or NULL if there are no more entries or an error occurs.
ru: Функция B<getgrent>() возвращает указатель на структуру I<group> или NULL, если записи закончились или произошла ошибка.

source: Upon error, I<errno> may be set. If one wants to check I<errno> after the call, it should be set to zero before the call.
ru: При ошибке может измениться значение I<errno>. Если нужно проверять переменную I<errno> после вызова, то перед этим нужно присвоить ей нулевое значение.

source: The return value may point to a static area, and may be overwritten by subsequent calls to B<getgrent>(), B<getgrgid>(3), or B<getgrnam>(3). (Do not pass the returned pointer to B<free>(3).)
ru: Возвращаемое значение может указывать на статическую область и может быть перезаписано при последующих вызовах B<getgrent>(), B<getgrgid>(3) или B<getgrnam>(3) (не передавайте полученный указатель B<free>(3)).

source: The service was temporarily unavailable; try again later. For NSS backends in glibc this indicates a temporary error talking to the backend. The error may correct itself, retrying later is suggested.
ru: Служба временно недоступна; попробуйте позднее. Для NSS из glibc это указывает на временную ошибку обмена с сервером. Ошибка может исчезнуть самостоятельно, предлагается попробовать повторить вызов позднее.

source: A necessary input file cannot be found. For NSS backends in glibc this indicates the backend is not correctly configured.
ru: Необходимый входной файл не найден. Для NSS в glibc это указывает на то, что служба некорректно настроена.

source: Insufficient memory to allocate I<group> structure.
ru: Недостаточно памяти для структуры I<group>.

source: local group database file
ru: локальный файл базы данных групп

source: In the above table, I<grent> in I<race:grent> signifies that if any of the functions B<setgrent>(), B<getgrent>(), or B<endgrent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<grent> в I<race:grent> означает, что если в нескольких нитях программы одновременно используются функции B<setgrent>(), B<getgrent>() или B<endgrent>(), то может возникнуть состязательность по данным.

source: getauxval - retrieve a value from the auxiliary vector
ru: getauxval - возвращает значение из вспомогательного вектора

source: The B<getauxval>() function retrieves values from the auxiliary vector, a mechanism that the kernel's ELF binary loader uses to pass certain information to user space when a program is executed.
ru: Функция B<getauxval>() возвращает значения из вспомогательного вектора — механизма, с помощью которого ядерный загрузчик двоичных файлов ELF передаёт информацию в пользовательское пространство при выполнении программы.

source: Each entry in the auxiliary vector consists of a pair of values: a type that identifies what this entry represents, and a value for that type. Given the argument I<type>, B<getauxval>() returns the corresponding value.
ru: Каждая запись в вспомогательном векторе состоит из пары значений: типа — которым определяется смысл записи и значением этого типа. Согласно аргументу I<type>, B<getauxval>() возвращает соответствующее значение.

source: The value returned for each I<type> is given in the following list. Not all I<type> values are present on all architectures.
ru: Значения для типов для I<type> представлены в списке далее. Не все значения I<type> есть для всех архитектур.

source: The base address of the program interpreter (usually, the dynamic linker).
ru: Основной (base) адрес программного интерпретатора (обычно, динамического компоновщика).

source: A string identifying the real platform; may differ from B<AT_PLATFORM> (PowerPC only).
ru: Строка, определяющая реальную платформу; может отличаться от B<AT_PLATFORM> (только для PowerPC).

source: The frequency with which B<times>(2) counts. This value can also be obtained via I<sysconf(_SC_CLK_TCK)>.
ru: Частота, с которой считает B<times>(2). Это значение также может быть получено с помощью I<sysconf(_SC_CLK_TCK)>.

source: The data cache block size.
ru: Размер блока кэша данных.

source: The effective group ID of the thread.
ru: Эффективный идентификатор группы нити.

source: The entry address of the executable.
ru: Адрес точки старта (entry address) исполняемого файла.

source: The effective user ID of the thread.
ru: Эффективный идентификатор пользователя нити.

source: File descriptor of program.
ru: Файловый дескриптор программы.

source: Pathname used to execute program.
ru: Путь, использованный для запуска программы.

source: Flags (unused).
ru: Флаги (не используется).

source: Used FPU control word (SuperH architecture only). This gives some information about the FPU initialization performed by the kernel.
ru: Используемое слово управления FPU (только для SuperH). Оно даёт некоторую информацию о нагрузке FPU, выполняемой ядром.

source: The real group ID of the thread.
ru: Реальный идентификатор группы нити.

source: An architecture and ABI dependent bit-mask whose settings indicate detailed processor capabilities. The contents of the bit mask are hardware dependent (for example, see the kernel source file I<arch/x86/include/asm/cpufeature.h> for details relating to the Intel x86 architecture; the value returned is the first 32-bit word of the array described there). A human-readable version of the same information is available via I</proc/cpuinfo>.
ru: Битовая маска, зависящая от архитектуры и двоичного программного интерфейса, подробно описывает возможности процессора. Содержимое битовой маски зависит от аппаратуры (например, в файле исходного кода ядра I<arch/x86/include/asm/cpufeature.h> описана маска для архитектуры Intel x86; возвращаемое значение — первое 32-битное слово описываемого здесь массива). Эта же информация в формате, понятном человеку, доступна в файле I</proc/cpuinfo>.

source: B<AT_HWCAP2> (since glibc 2.18)
ru: B<AT_HWCAP2> (начиная с glibc 2.18)

source: Further machine-dependent hints about processor capabilities.
ru: Дополнительные упоминания о возможностях процессора.

source: The instruction cache block size.
ru: Размер блока кэша инструкций.

source: The system page size (the same value returned by I<sysconf(_SC_PAGESIZE)>).
ru: Размер системной страницы (это же значение возвращается I<sysconf(_SC_PAGESIZE)>).

source: The address of the program headers of the executable.
ru: Адрес заголовков программы исполняемого файла.

source: The size of program header entry.
ru: Размер элемента заголовка программы.

source: The number of program headers.
ru: Количество заголовков программы.

source: A pointer to a string that identifies the hardware platform that the program is running on. The dynamic linker uses this in the interpretation of I<rpath> values.
ru: Указатель на строку, описывающую аппаратную платформу, на которой выполняется программа. Динамический компоновщик использует её при рассмотрении значений I<rpath>.

source: The address of sixteen bytes containing a random value.
ru: Адрес 16 байт, содержащих произвольное значение.

source: Has a nonzero value if this executable should be treated securely. Most commonly, a nonzero value indicates that the process is executing a set-user-ID or set-group-ID binary (so that its real and effective UIDs or GIDs differ from one another), or that it gained capabilities by executing a binary file that has capabilities (see B<capabilities>(7)). Alternatively, a nonzero value may be triggered by a Linux Security Module. When this value is nonzero, the dynamic linker disables the use of certain environment variables (see B<ld-linux.so>(8)) and glibc changes other aspects of its behavior. (See also B<secure_getenv>(3).)
ru: Содержит ненулевое значение, если исполняемый файл должен считаться безопасным. Чаще всего, ненулевое значение означает, что процесс выполняет программу с установленным set-user-ID или set-group-ID битом (то есть его реальный и эффективный UID или GID отличаются от начального) или же он получает мандаты, запуская двоичный файл с другими мандатами (смотрите B<capabilities>(7)). Также ненулевое значение может выставляться Linux Security Module. Если значение не ноль, то динамический компоновщик прекращает использовать определённые переменные окружения (смотрите B<ld-linux.so>(8)) и изменяется некоторое поведение glibc (также смотрите B<secure_getenv>(3)).

source: The entry point to the system call function in the vDSO. Not present/needed on all architectures (e.g., absent on x86-64).
ru: Точка входа в функцию системного вызова в vDSO. Отсутствует/не нужна для всех архитектур (например, отсутствует на x86-64).

source: The address of a page containing the virtual Dynamic Shared Object (vDSO) that the kernel creates in order to provide fast implementations of certain system calls.
ru: Адрес страницы, содержащий виртуальный Динамический Общий Объект (Dynamic Shared Object, vDSO), который ядро создаёт для предоставления более быстрой реализации некоторых системных вызовов.

source: The unified cache block size.
ru: Размер блока универсального кэша.

source: The real user ID of the thread.
ru: Реальный идентификатор пользователя нити.

source: On success, B<getauxval>() returns the value corresponding to I<type>. If I<type> is not found, 0 is returned.
ru: При успешном выполнении B<getauxval>() возвращает значение, соответствующее I<type>.Если I<type> не найден, то возвращается 0.

source: B<ENOENT> (since glibc 2.19)
ru: B<ENOENT> (начиная с glibc 2.19)

source: No entry corresponding to I<type> could be found in the auxiliary vector.
ru: В вспомогательном векторе не найдено значение, соответствующее I<type>.

source: The B<getauxval>() function was added to glibc in version 2.16.
ru: Функция B<getauxval>() впервые появилась в glibc 2.16.

source: This function is a nonstandard glibc extension.
ru: Эта функция является нестандартным расширением glibc.

source: The primary consumer of the information in the auxiliary vector is the dynamic linker B<ld-linux.so>(8). The auxiliary vector is a convenient and efficient shortcut that allows the kernel to communicate a certain set of standard information that the dynamic linker usually or always needs. In some cases, the same information could be obtained by system calls, but using the auxiliary vector is cheaper.
ru: Основным пользователем информации из вспомогательного вектора является динамический компоновщик B<ld-linux.so>(8). Вспомогательный вектор удобное и эффективное средство для предоставления ядром некоторого набора стандартной информации, которая обычно или всегда требуется динамическому компоновщику. В некоторых случаях эта информация может быть получена через системные вызовы, но использование вспомогательного вектора экономичней.

source: The auxiliary vector resides just above the argument list and environment in the process address space. The auxiliary vector supplied to a program can be viewed by setting the B<LD_SHOW_AUXV> environment variable when running a program:
ru: Вспомогательный вектор располагается выше списка аргументов и окружения в адресном пространстве процесса. Переданный программе вектор можно просмотреть установив переменную окружения B<LD_SHOW_AUXV> и запустив программу:

source: The auxiliary vector of any process can (subject to file permissions) be obtained via I</proc/[pid]/auxv>; see B<proc>(5) for more information.
ru: Вспомогательный вектор любого процесса может быть получен (при наличии прав доступа) через I</proc/[pid]/auxv>; подробней смотрите в B<proc>(5).

source: Before the addition of the B<ENOENT> error in glibc 2.19, there was no way to unambiguously distinguish the case where I<type> could not be found from the case where the value corresponding to I<type> was zero.
ru: До того как ошибка B<ENOENT> не была добавлена в glibc 2.19, не было способа достоверно определить, что I<type> не найден, если значение I<type> равно нулю.

source: getpass - get a password
ru: getpass - запрашивает пароль

source: Since glibc 2.2.2:
ru: Начиная с glibc 2.2.2:

source: _XOPEN_SOURCE && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: _XOPEN_SOURCE && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версии glibc E<lt>= 2.19: */ _BSD_SOURCE

source: Before glibc 2.2.2:
ru: До glibc 2.2.2:

source: This function is obsolete. Do not use it. If you want to read input without terminal echoing enabled, see the description of the I<ECHO> flag in B<termios>(3).
ru: Эта функция устарела. Не используйте её. Если вы хотите читать вводимые данные без вывода на терминал, смотрите описание флага I<ECHO> в B<termios>(3).

source: The B<getpass>() function opens I</dev/tty> (the controlling terminal of the process), outputs the string I<prompt>, turns off echoing, reads one line (the "password"), restores the terminal state and closes I</dev/tty> again.
ru: Функция B<getpass>() открывает I</dev/tty> (управляющий терминал процесса), выводит строку I<prompt>, выключает показ выводимых символов, читает одну строку («пароль»), восстанавливает состояние терминала и закрывает I</dev/tty>.
