Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: B<getlogin>() returns a pointer to the username when successful, and NULL on failure, with I<errno> set to indicate the cause of the error. B<getlogin_r>() returns 0 when successful, and nonzero on failure.
ru: При успешном выполнении функция B<getlogin>() возвращает указатель на имя пользователя и NULL при ошибке, устанавливая в I<errno> значение ошибки. При успешном выполнении B<getlogin_r>() возвращается 0 и не ноль при ошибке.

source: POSIX specifies
ru: В POSIX определены

source: The calling process has no controlling terminal.
ru: У вызывающего процесса нет управляющего терминала.

source: (getlogin_r) The length of the username, including the terminating null byte (\(aq\e0\(aq), is larger than I<bufsize>.
ru: (getlogin_r) Длина имени пользователя, включая завершающий байт null (\(aq\e0\(aq), больше чем I<bufsize>.

source: Linux/glibc also has
ru: В Linux/glibc также есть

source: There was no corresponding entry in the utmp-file.
ru: Нет соответствующей записи в файле utmp.

source: Insufficient memory to allocate passwd structure.
ru: Недостаточно памяти для выделения под структуру passwd.

source: Standard input didn't refer to a terminal. (See BUGS.)
ru: Стандартный ввод не ссылается на терминал (смотрите ДЕФЕКТЫ).

source: password database file
ru: файл, содержащий базу паролей

source: (traditionally I</etc/utmp>; some libc versions used I</var/adm/utmp>)
ru: (обычно, I</etc/utmp>; в некоторых версиях libc используется I</var/adm/utmp>)

source: In the above table, I<utent> in I<race:utent> signifies that if any of the functions B<setutent>(3), B<getutent>(3), or B<endutent>(3) are used in parallel in different threads of a program, then data races could occur. B<getlogin>() and B<getlogin_r>() call those functions, so we use race:utent to remind users.
ru: В приведённой выше таблице I<utent> в I<race:utent> означает, что если любая из функций B<setutent>(3), B<getutent>(3) или B<endutent>(3) используется одновременно в нескольких нитях программы, то может возникнуть состязательность по данным. Эти функции вызываются из B<getlogin>() и B<getlogin_r>() поэтому мы используем race:utent для напоминания.

source: B<getlogin>() and B<getlogin_r>(): POSIX.1-2001, POSIX.1-2008.
ru: B<getlogin>() и B<getlogin_r>(): POSIX.1-2001, POSIX.1-2008.

source: System V has a B<cuserid>() function which uses the real user ID rather than the effective user ID. The B<cuserid>() function was included in the 1988 version of POSIX, but removed from the 1990 version. It was present in SUSv2, but removed in POSIX.1-2001.
ru: В System V имеется функция B<cuserid>(), использующая идентификатор реального пользователя вместо идентификатора эффективного пользователя. Функция B<cuserid>() была включена в версию POSIX 1988 года, но удалена из версии 1990 года. Она имеется в SUSv2, но удалена из POSIX.1-2001.

source: OpenBSD has B<getlogin>() and B<setlogin>(), and a username associated with a session, even if it has no controlling terminal.
ru: В OpenBSD имеются B<getlogin>() и B<setlogin>(), а имя пользователя связывается с сеансом даже если не имеется управляющего терминала.

source: Unfortunately, it is often rather easy to fool B<getlogin>(). Sometimes it does not work at all, because some program messed up the utmp file. Often, it gives only the first 8 characters of the login name. The user currently logged in on the controlling terminal of our program need not be the user who started it. Avoid B<getlogin>() for security-related purposes.
ru: К сожалению, зачастую довольно просто «обмануть» B<getlogin>(). Иногда она вообще не работает из-за того, что какая-то программа испортила содержимое файла utmp. Часто функция возвращает только первые 8 символов имени. Пользователь, вошедший в систему с терминала, который является управляющим для нашей программы, необязательно будет пользователем, запустившим программу. Избегайте использования B<getlogin>() из соображений безопасности.

source: Note that glibc does not follow the POSIX specification and uses I<stdin> instead of I</dev/tty>. A bug. (Other recent systems, like SunOS 5.8 and HP-UX 11.11 and FreeBSD 4.8 all return the login name also when I<stdin> is redirected.)
ru: Заметим, что glibc не следует спецификации POSIX и использует I<stdin> вместо I</dev/tty>. Дефект ( в других современных системах, например SunOS 5.8, HP-UX 11.11 и FreeBSD 4.8, также возвращают имя пользователя если было перенаправление I<stdin>).

source: Nobody knows precisely what B<cuserid>() does; avoid it in portable programs. Or avoid it altogether: use I<getpwuid(geteuid())> instead, if that is what you meant. B<Do not use> B<cuserid>().
ru: Никто точно не знает что делает B<cuserid>(), поэтому не используйте её в переносимых программах. Вместо неё используйте I<getpwuid(geteuid())>, если это необходимо. B<Не используйте> B<cuserid>().

source: getutmp, getutmpx - copy utmp structure to utmpx, and vice versa
ru: getutmp, getutmpx - копирование структуры utmp в utmpx и наоборот

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>utmpx.hE<gt>>
ru: B<#define _GNU_SOURCE> /* См. feature_test_macros(7) */ B<#include E<lt>utmpx.hE<gt>>

source: The B<getutmp>() function copies the fields of the I<utmpx> structure pointed to by I<ux> to the corresponding fields of the I<utmp> structure pointed to by I<u>. The B<getutmpx>() function performs the converse operation.
ru: Функция B<getutmp>() копирует поля структуры I<utmpx>, указанной в I<ux> в соответствующие поля структуры I<utmp>, указанной в I<u>. Функция B<getutmpx>() выполняет обратное действие.

source: These functions do not return a value.
ru: Данные функции не возвращают никаких значений.

source: These functions first appeared in glibc in version 2.1.1.
ru: Эти функции впервые появились в glibc 2.1.1.

source: These functions are nonstandard, but appear on a few other systems, such as Solaris and NetBSD.
ru: Эти функции являются нестандартными, но имеются в некоторых системах, например в Solaris и NetBSD.

source: These functions exist primarily for compatibility with other systems where the I<utmp> and I<utmpx> structures contain different fields, or the size of corresponding fields differs. On Linux, the two structures contain the same fields, and the fields have the same sizes.
ru: В первую очередь, эти функции существуют для совместимости с другими системами, в которых структуры I<utmp> и I<utmpx> содержат разные поля или они разного размера. В Linux эти структуры содержат одинаковые поля и они одного размера.

source: gnu_get_libc_version, gnu_get_libc_release - get glibc version and release
ru: gnu_get_libc_version, gnu_get_libc_release - возвращают идентификатор версии и выпуска glibc

source: The function B<gnu_get_libc_version>() returns a string that identifies the glibc version available on the system.
ru: Функция B<gnu_get_libc_version>() возвращает строку, которая описывает версию glibc, установленную в системе.

source: The function B<gnu_get_libc_release>() returns a string indicates the release status of the glibc version available on the system. This will be a string such as I<stable>.
ru: Функция B<gnu_get_libc_release>() возвращает строку, которая описывает состояние выпуска версии glibc, установленной в системе. Обычно, возвращается строка I<stable>.

source: These functions first appeared in glibc in version 2.1.
ru: Эти функции впервые появились в glibc 2.1.

source: These functions are glibc-specific.
ru: Эти функции есть только в glibc.

source: When run, the program below will produce output such as the following:
ru: Нижеследующая программа выдает такие результаты:

source: $B< ./a.out> GNU libc version: 2.8 GNU libc release: stable
ru: $B< ./a.out> Версия GNU libc: 2.8 Выпуск GNU libc: stable

source: int main(int argc, char *argv[]) { printf("GNU libc version: %s\en", gnu_get_libc_version()); printf("GNU libc release: %s\en", gnu_get_libc_release()); exit(EXIT_SUCCESS); }
ru: int main(int argc, char *argv[]) { printf("Версия GNU libc: %s\en", gnu_get_libc_version()); printf("Выпуск GNU libc: %s\en", gnu_get_libc_release()); exit(EXIT_SUCCESS); }

source: getttyent, getttynam, setttyent, endttyent - get ttys file entry
ru: getttyent, getttynam, setttyent, endttyent - возвращает запись из файла ttys

source: These functions provide an interface to the file B<_PATH_TTYS> (e.g., I</etc/ttys>).
ru: Эти функции предоставляют интерфейс к файлу из B<_PATH_TTYS> (например, I</etc/ttys>).

source: The function B<setttyent>() opens the file or rewinds it if already open.
ru: Функция B<setttyent>() открывает файл или сбрасывает указатель чтения на начало, если он уже открыт.

source: The function B<endttyent>() closes the file.
ru: Функция B<endttyent>() закрывает файл.

source: The function B<getttynam>() searches for a given terminal name in the file. It returns a pointer to a I<ttyent> structure (description below).
ru: Функция B<getttynam>() ищет заданное имя терминала в файле. Возвращается указатель на структуру I<ttyent> (описана далее).

source: The function B<getttyent>() opens the file B<_PATH_TTYS> (if necessary) and returns the first entry. If the file is already open, the next entry. The I<ttyent> structure has the form:
ru: Функция B<getttyent>() открывает файл из переменной B<_PATH_TTYS> (если требуется) и возвращает его первую запись. Если файл уже открыт, то возвращается его следующая запись. Структура I<ttyent>:

source: struct ttyent { char *ty_name; /* terminal device name */ char *ty_getty; /* command to execute, usually getty */ char *ty_type; /* terminal type for termcap */ int ty_status; /* status flags */ char *ty_window; /* command to start up window manager */ char *ty_comment; /* comment field */ };
ru: struct ttyent { char *ty_name; /* имя устройства терминала */ char *ty_getty; /* команда для исполнения, обычно getty */ char *ty_type; /* тип терминала для termcap */ int ty_status; /* флаги состояния */ char *ty_window; /* команда для запуска менеджера окон */ char *ty_comment; /* поле комментария */ };

source: I<ty_status> can be:
ru: Значением I<ty_status> может быть:

source: #define TTY_ON 0x01 /* enable logins (start ty_getty program) */ #define TTY_SECURE 0x02 /* allow UID 0 to login */
ru: #define TTY_ON 0x01 /* разрешить регистрации (запускаемые программой ty_getty) */ #define TTY_SECURE 0x02 /* разрешить регистрацию с UID 0 */

source: Not in POSIX.1. Present on the BSDs, and perhaps other systems.
ru: Нет в POSIX.1. Присутствует в BSD и, возможно, во многих других системах.

source: Under Linux, the file I</etc/ttys>, and the functions described above, are not used.
ru: В Linux файл I</etc/ttys> и описанные выше функции не используются.

source: group_member - test whether a process is in a group
ru: group_member - проверяет присутствие процесса в группе

source: The B<group_member>() function tests whether any of the caller's supplementary group IDs (as returned by B<getgroups>(2)) matches I<gid>.
ru: Функция B<group_member>() проверяет, совпадает ли какой-либо ID дополнительных групп вызывающего (возвращаемые B<getgroups>(2)) с I<gid>.

source: The B<group_member>() function returns nonzero if any of the caller's supplementary group IDs matches I<gid>, and zero otherwise.
ru: Функция B<group_member>() возвращает не ноль, если какой-либо ID дополнительных групп совпал с I<gid>, и ноль в противном случае.

source: This function is a nonstandard GNU extension.
ru: Эта функция является нестандартным расширением GNU.

source: getrpcent, getrpcbyname, getrpcbynumber, setrpcent, endrpcent - get RPC entry
ru: getrpcent, getrpcbyname, getrpcbynumber, setrpcent, endrpcent - возвращают запись RPC

source: The B<getrpcent>(), B<getrpcbyname>(), and B<getrpcbynumber>() functions each return a pointer to an object with the following structure containing the broken-out fields of an entry in the RPC program number data base.
ru: Функции B<getrpcent>(), B<getrpcbyname>() и B<getrpcbynumber>() возвращают указатель на объект с описанной ниже структурой, содержащую разделённую на поля запись из базы данных номеров программы RPC.

source: struct rpcent { char *r_name; /* name of server for this RPC program */ char **r_aliases; /* alias list */ long r_number; /* RPC program number */ };
ru: struct rpcent { char *r_name; /* имя сервера для этой программы RPC */ char **r_aliases; /* список псевдонимов */ long r_number; /* номер программы RPC */ };

source: The members of this structure are:
ru: Члены структуры:

source: The name of the server for this RPC program.
ru: Имя сервера для этой программы RPC.

source: A NULL-terminated list of alternate names for the RPC program.
ru: Список альтернативных имён программы RPC, завершающийся NULL.

source: The RPC program number for this service.
ru: Номер программы RPC для этой службы.

source: The B<getrpcent>() function reads the next entry from the database. A connection is opened to the database if necessary.
ru: Функция B<getrpcent>() считывает следующую запись из базы данных. При необходимости будет открыто подключение к базе.

source: The B<setrpcent>() function opens a connection to the database, and sets the next entry to the first entry. If I<stayopen> is nonzero, then the connection to the database will not be closed between calls to one of the B<getrpc*>() functions.
ru: Функция B<setrpcent>() открывает соединение к базе и устанавливает следующую запись к первой записи. Если I<stayopen> не равен нулю, то подключение к базе между вызовами нескольких функций B<getrpc*>() не будет закрыто.

source: The B<endrpcent>() function closes the connection to the database.
ru: Функция B<endrpcent>() закрывает подключение к базе.

source: The B<getrpcbyname>() and B<getrpcbynumber>() functions sequentially search from the beginning of the file until a matching RPC program name or program number is found, or until end-of-file is encountered.
ru: Функции B<getrpcbyname>() и B<getrpcbynumber>() выполняют последовательный поиск от начала файла до нахождения имени программы RPC, её номера или конца файла.

source: On success, B<getrpcent>(), B<getrpcbyname>(), and B<getrpcbynumber>() return a pointer to a statically allocated I<rpcent> structure. NULL is returned on EOF or error.
ru: При успешном выполнении B<getrpcent>(), B<getrpcbyname>() и B<getrpcbynumber>() возвращают указатель на статически выделенную структуру I<rpcent>. При ошибке или EOF возвращается NULL.

source: RPC program number database.
ru: база данных программных номеров RPC

source: All information is contained in a static area so it must be copied if it is to be saved.
ru: Вся информация располагается в статической области, поэтому для сохранения должна быть скопирована.

source: get_nprocs, get_nprocs_conf - get number of processors
ru: get_nprocs, get_nprocs_conf - возвращает количество процессоров

source: The function B<get_nprocs_conf>() returns the number of processors configured by the operating system.
ru: Функция B<get_nprocs_conf>() возвращает количество процессоров, настроенных операционной системой.

source: The function B<get_nprocs>() returns the number of processors currently available in the system. This may be less than the number returned by B<get_nprocs_conf>() because processors may be offline (e.g., on hotpluggable systems).
ru: Функция B<get_nprocs>() возвращает количество процессоров, доступных в системе. Это значение может быть меньше чем возвращаемое B<get_nprocs_conf>(), так как процессоры могут быть выключены (например, в системах с подключением на ходу).

source: As given in DESCRIPTION.
ru: Как указано в ОПИСАНИИ.

source: The current implementation of these functions is rather expensive, since they open and parse files in the I</sys> filesystem each time they are called.
ru: Текущая реализация этих функций не оптимальна, так как при каждом вызове открываются и обрабатываются файлы в файловой системе I</sys>.

source: The following B<sysconf>(3) calls make use of the functions documented on this page to return the same information.
ru: Следующие вызовы B<sysconf>(3) возвращают тоже что и описанные здесь функции.

source: np = sysconf(_SC_NPROCESSORS_CONF); /* processors configured */ np = sysconf(_SC_NPROCESSORS_ONLN); /* processors available */
ru: np = sysconf(_SC_NPROCESSORS_CONF); /* настроенных процессоров */ np = sysconf(_SC_NPROCESSORS_ONLN); /* доступных процессоров */

source: The following example shows how B<get_nprocs>() and B<get_nprocs_conf>() can be used.
ru: В следующем примере показано использование B<get_nprocs>() и B<get_nprocs_conf>().

source: int main(int argc, char *argv[]) { printf("This system has %d processors configured and " "%d processors available.\en", get_nprocs_conf(), get_nprocs()); exit(EXIT_SUCCESS); }
ru: int main(int argc, char *argv[]) { printf("В системе настроено %d процессоров и " "%d процессоров доступно.\en", get_nprocs_conf(), get_nprocs()); exit(EXIT_SUCCESS); }

source: getifaddrs, freeifaddrs - get interface addresses
ru: getifaddrs, freeifaddrs - возвращают адреса интерфейса

source: The B<getifaddrs>() function creates a linked list of structures describing the network interfaces of the local system, and stores the address of the first item of the list in I<*ifap>. The list consists of I<ifaddrs> structures, defined as follows:
ru: Функция B<getifaddrs>() создаёт связный список структур, описывающих сетевые интерфейсы локальной системы, и сохраняет адрес первого элемента списка в I<*ifap>. Список состоит из структур I<ifaddrs>:

source: struct ifaddrs { struct ifaddrs *ifa_next; /* Next item in list */ char *ifa_name; /* Name of interface */ unsigned int ifa_flags; /* Flags from SIOCGIFFLAGS */ struct sockaddr *ifa_addr; /* Address of interface */ struct sockaddr *ifa_netmask; /* Netmask of interface */ union { struct sockaddr *ifu_broadaddr; /* Broadcast address of interface */ struct sockaddr *ifu_dstaddr; /* Point-to-point destination address */ } ifa_ifu; #define ifa_broadaddr ifa_ifu.ifu_broadaddr #define ifa_dstaddr ifa_ifu.ifu_dstaddr void *ifa_data; /* Address-specific data */ };
ru: struct ifaddrs { struct ifaddrs *ifa_next; /* след. элемент в списке */ char *ifa_name; /* имя интерфейса */ unsigned int ifa_flags; /* флаги из SIOCGIFFLAGS */ struct sockaddr *ifa_addr; /* адрес интерфейса */ struct sockaddr *ifa_netmask; /* сетевая маска интерфейса */ union { struct sockaddr *ifu_broadaddr; /* широковещательный адрес интерфейса */ struct sockaddr *ifu_dstaddr; /* адрес назначения точка-точка */ } ifa_ifu; #define ifa_broadaddr ifa_ifu.ifu_broadaddr #define ifa_dstaddr ifa_ifu.ifu_dstaddr void *ifa_data; /* спец. данные для адреса */ };

source: The I<ifa_next> field contains a pointer to the next structure on the list, or NULL if this is the last item of the list.
ru: В поле I<ifa_next> содержится указатель на следующую структуру в списке или NULL, если это последний элемент в списке.

source: The I<ifa_name> points to the null-terminated interface name.
ru: Поле I<ifa_name> указывает на имя интерфейса (заканчивающееся null).

source: The I<ifa_flags> field contains the interface flags, as returned by the B<SIOCGIFFLAGS> B<ioctl>(2) operation (see B<netdevice>(7) for a list of these flags).
ru: В поле I<ifa_flags> содержатся флаги интерфейса, полученные операцией B<SIOCGIFFLAGS> B<ioctl>(2) (список флагов приведён в B<netdevice>(7)).

source: The I<ifa_addr> field points to a structure containing the interface address. (The I<sa_family> subfield should be consulted to determine the format of the address structure.) This field may contain a null pointer.
ru: Поле I<ifa_addr> указывает на структуру, содержащую адрес интерфейса (для определения формата структуры адреса обратитесь к подполю I<sa_family>). Это поле может содержать указатель null.

source: The I<ifa_netmask> field points to a structure containing the netmask associated with I<ifa_addr>, if applicable for the address family. This field may contain a null pointer.
ru: Поле I<ifa_netmask> указывает на структуру, содержащую маску сети для I<ifa_addr> (если она используется в адресном семействе). Это поле может содержать указатель null.

source: Depending on whether the bit B<IFF_BROADCAST> or B<IFF_POINTOPOINT> is set in I<ifa_flags> (only one can be set at a time), either I<ifa_broadaddr> will contain the broadcast address associated with I<ifa_addr> (if applicable for the address family) or I<ifa_dstaddr> will contain the destination address of the point-to-point interface.
ru: В зависимости от наличия флага B<IFF_BROADCAST> или B<IFF_POINTOPOINT> в I<ifa_flags> (может быть установлен какой-то один), в I<ifa_broadaddr> будет содержаться широковещательный адрес I<ifa_addr> (если он используется в адресном семействе) или I<ifa_dstaddr> будет содержать адрес назначения интерфейса типа точка-точка.

source: The I<ifa_data> field points to a buffer containing address-family-specific data; this field may be NULL if there is no such data for this interface.
ru: Поле I<ifa_data> указывает на буфер, содержащий данные, присущие адресному семейству; это поле может быть равно NULL, если данных для этого интерфейса нет.

source: The data returned by B<getifaddrs>() is dynamically allocated and should be freed using B<freeifaddrs>() when no longer needed.
ru: Память под структуру данных, возвращаемая B<getifaddrs>(), выделяется динамически и должна освобождаться с помощью B<freeifaddrs>(), когда больше не нужна.

source: On success, B<getifaddrs>() returns zero; on error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<getifaddrs>() возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: B<getifaddrs>() may fail and set I<errno> for any of the errors specified for B<socket>(2), B<bind>(2), B<getsockname>(2), B<recvmsg>(2), B<sendto>(2), B<malloc>(3), or B<realloc>(3).
ru: Функция B<getifaddrs>() может завершиться с ошибками и назначить переменной I<errno> значения, перечисленные в B<socket>(2), B<bind>(2), B<getsockname>(2), B<recvmsg>(2), B<sendto>(2), B<malloc>(3) или B<realloc>(3).

source: The B<getifaddrs>() function first appeared in glibc 2.3, but before glibc 2.3.3, the implementation supported only IPv4 addresses; IPv6 support was added in glibc 2.3.3. Support of address families other than IPv4 is available only on kernels that support netlink.
ru: Впервые функция B<getifaddrs>() появилась в glibc 2.3, но до glibc 2.3.3 реализация поддерживала только интерфейсы с адресами IPv4; поддержка IPv6 добавлена в glibc 2.3.3. Поддержка семейств адресов не IPv4 доступна только в ядрах, поддерживающих netlink.

source: Not in POSIX.1. This function first appeared in BSDi and is present on the BSD systems, but with slightly different semantics documented\(emreturning one entry per interface, not per address. This means I<ifa_addr> and other fields can actually be NULL if the interface has no address, and no link-level address is returned if the interface has an IP address assigned. Also, the way of choosing either I<ifa_broadaddr> or I<ifa_dstaddr> differs on various systems.
ru: Нет в POSIX.1. Данная функция впервые появилась в BSDi и существует в системах BSD, но со слегка другой семантикой — возвращается одна запись на интерфейс, а не на адрес. Это означает, что I<ifa_addr> и другие поля могут быть равны NULL, если интерфейс не имеет адресов, и адрес канального уровня не возвращается, если интерфейсу назначен IP-адрес. Также в разных системах различается способ выбора между I<ifa_broadaddr> и I<ifa_dstaddr>.
