Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The function B<getpass>() returns a pointer to a static buffer containing (the first B<PASS_MAX> bytes of) the password without the trailing newline, terminated by a null byte (\(aq\e0\(aq). This buffer may be overwritten by a following call. On error, the terminal state is restored, I<errno> is set appropriately, and NULL is returned.
ru: Функция B<getpass>() возвращает указатель на статический буфер, содержащий (первые B<PASS_MAX> байтов) пароль без символа новой строки, оканчивающийся нулевым байтом («\e0»). Этот буфер может быть перезаписан следующим вызовом. При ошибке, состояние терминала восстанавливается, значение I<errno> устанавливается соответствующим образом и возвращается NULL.

source: The function may fail if
ru: Эта функция может завершаться с ошибками:

source: The process does not have a controlling terminal.
ru: Процесс не имеет управляющего терминала.

source: Present in SUSv2, but marked LEGACY. Removed in POSIX.1-2001.
ru: Есть в SUSv2, но помечена как УСТАРЕВШАЯ. Удалена из POSIX.1-2001.

source: In the GNU C library implementation, if I</dev/tty> cannot be opened, the prompt is written to I<stderr> and the password is read from I<stdin>. There is no limit on the length of the password. Line editing is not disabled.
ru: В реализации библиотеки GNU C, если файл I</dev/tty> не может быть открыт, то строка приглашения выводится в поток ошибок I<stderr>, а пароль читается из стандартного потока ввода I<stdin>. Ограничения на длину пароля нет и строку можно редактировать.

source: According to SUSv2, the value of B<PASS_MAX> must be defined in I<E<lt>limits.hE<gt>> in case it is smaller than 8, and can in any case be obtained using I<sysconf(_SC_PASS_MAX)>. However, POSIX.2 withdraws the constants B<PASS_MAX> and B<_SC_PASS_MAX>, and the function B<getpass>(). The glibc version accepts B<_SC_PASS_MAX> and returns B<BUFSIZ> (e.g., 8192).
ru: Согласно SUSv2 значение B<PASS_MAX> должно быть определено в I<E<lt>limits.hE<gt>>, если оно меньше 8, и в любом случае может быть получено с помощью I<sysconf(_SC_PASS_MAX)>. Однако, из стандарта POSIX.2 константы B<PASS_MAX>, B<_SC_PASS_MAX> и функция B<getpass>() убраны. В glibc учитывается B<_SC_PASS_MAX> и возвращается B<BUFSIZ> (например, 8192).

source: The calling process should zero the password as soon as possible to avoid leaving the cleartext password visible in the process's address space.
ru: Вызывающий процесс должен как можно скорее обнулить пароль во избежание возможности просмотра незашифрованного пароля в адресном пространстве процесса.

source: getpwent_r, fgetpwent_r - get passwd file entry reentrantly
ru: getpwent_r, fgetpwent_r - получает запись из файла паролей (реентерабельные версии)

source: B<getpwent_r>(), Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getpwent_r>(), начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: B<fgetpwent_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _SVID_SOURCE
ru: B<fgetpwent_r>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _SVID_SOURCE

source: The functions B<getpwent_r>() and B<fgetpwent_r>() are the reentrant versions of B<getpwent>(3) and B<fgetpwent>(3). The former reads the next passwd entry from the stream initialized by B<setpwent>(3). The latter reads the next passwd entry from I<stream>.
ru: Функции B<getpwent_r>() и B<fgetpwent_r>() являются реентерабельными версиями B<getpwent>(3) и B<fgetpwent>(3). Первая читает следующую запись паролей из потока, инициализированного B<setpwent>(3). Последняя читает следующую запись паролей из потока I<stream>.

source: struct passwd { char *pw_name; /* username */ char *pw_passwd; /* user password */ uid_t pw_uid; /* user ID */ gid_t pw_gid; /* group ID */ char *pw_gecos; /* user information */ char *pw_dir; /* home directory */ char *pw_shell; /* shell program */ };
ru: struct passwd { char *pw_name; /* имя пользователя */ char *pw_passwd; /* пароль пользователя */ uid_t pw_uid; /* идентификатор пользователя */ gid_t pw_gid; /* идентификатор группы */ char *pw_gecos; /* информация о пользователе */ char *pw_dir; /* домашний каталог */ char *pw_shell; /* программная оболочка */ };

source: The nonreentrant functions return a pointer to static storage, where this static storage contains further pointers to user name, password, gecos field, home directory and shell. The reentrant functions described here return all of that in caller-provided buffers. First of all there is the buffer I<pwbuf> that can hold a I<struct passwd>. And next the buffer I<buf> of size I<buflen> that can hold additional strings. The result of these functions, the I<struct passwd> read from the stream, is stored in the provided buffer I<*pwbuf>, and a pointer to this I<struct passwd> is returned in I<*pwbufp>.
ru: Нереентерабельные версии возвращают указатель на статическое хранилище, в котором хранятся другие указатели на имя пользователя, пароль, поле gecos, домашний каталог и оболочку. Реентерабельные функции, описанные здесь, возвращают всю информацию в буферах, предоставленных вызывающим. Основным буфером является I<pwbuf>, в котором может храниться I<struct passwd>. В дополнительном буфере I<buf> размера I<buflen> могут храниться дополнительные строки. Результат этих функций, прочитанная из потока I<struct passwd>, сохраняется в предоставляемый буфер I<*pwbuf>, и указатель на эту I<struct passwd> возвращается в I<*pwbufp>.

source: On success, these functions return 0 and I<*pwbufp> is a pointer to the I<struct passwd>. On error, these functions return an error value and I<*pwbufp> is NULL.
ru: При успешном выполнении эти функции возвращают 0 и I<*pwbufp> указывает на I<struct passwd>. При ошибке возвращается значение ошибки и I<*pwbufp> равен NULL.

source: No more entries.
ru: Больше записей нет.

source: Insufficient buffer space supplied. Try again with larger buffer.
ru: Недостаточно места в буфере. Попробуйте ещё раз с большим буфером.

source: In the above table, I<pwent> in I<race:pwent> signifies that if any of the functions B<setpwent>(), B<getpwent>(), B<endpwent>(), or B<getpwent_r>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<pwent> в I<race:pwent> означает, что если в нескольких нитях программы одновременно используются функции B<setpwent>(), B<getpwent>(), B<endpwent>() или B<getpwent_r>(), то может возникнуть состязательность по данным.

source: These functions are GNU extensions, done in a style resembling the POSIX version of functions like B<getpwnam_r>(3). Other systems use the prototype
ru: Эти функции являются расширениями GNU; они выполнены похожими на POSIX-версию функции B<getpwnam_r>(3). В других системах используется прототип

source: or, better,
ru: или, лучше,

source: The function B<getpwent_r>() is not really reentrant since it shares the reading position in the stream with all other threads.
ru: Функция B<getpwent_r>() не совсем реентерабельна, так как она использует общую позицию чтения в потоке с другими нитями.

source: getservent, getservbyname, getservbyport, setservent, endservent - get service entry
ru: getservent, getservbyname, getservbyport, setservent, endservent - возвращают запись о службе

source: The B<getservent>() function reads the next entry from the services database (see B<services>(5)) and returns a I<servent> structure containing the broken-out fields from the entry. A connection is opened to the database if necessary.
ru: Функция B<getservent>() считывает следующую запись из файла, содержащего базу служб (смотрите B<services>(5)), и возвращает структуру I<servent>, содержащую поля из этой записи. При необходимости будет открыто подключение к базе.

source: The B<getservbyname>() function returns a I<servent> structure for the entry from the database that matches the service I<name> using protocol I<proto>. If I<proto> is NULL, any protocol will be matched. A connection is opened to the database if necessary.
ru: Функция B<getservbyname>() возвращает структуру I<servent> элемента из базы данных, который совпадает со службой I<name> и использующей протокол I<proto>. Если значение I<proto> равно NULL, то подойдёт любой протокол. При необходимости будет открыто подключение к базе.

source: The B<getservbyport>() function returns a I<servent> structure for the entry from the database that matches the port I<port> (given in network byte order) using protocol I<proto>. If I<proto> is NULL, any protocol will be matched. A connection is opened to the database if necessary.
ru: Функция B<getservbyport>() возвращает структуру I<servent> элемента из базы данных, который совпадает с портом I<port> (значение имеет сетевой порядок байт) и использующей протокол I<proto>. Если значение I<proto> равно NULL, то подойдёт любой протокол. При необходимости будет открыто подключение к базе.

source: The B<setservent>() function opens a connection to the database, and sets the next entry to the first entry. If I<stayopen> is nonzero, then the connection to the database will not be closed between calls to one of the B<getserv*>() functions.
ru: Функция B<setservent>() открывает соединение к базе и устанавливает следующую запись к первой записи. Если I<stayopen> не равен нулю, то подключение к базе между вызовами нескольких функций B<getserv*>() не будет закрыто.

source: The B<endservent>() function closes the connection to the database.
ru: Функция B<endservent>() закрывает подключение к базе.

source: The I<servent> structure is defined in I<E<lt>netdb.hE<gt>> as follows:
ru: Структура I<servent> определена в I<E<lt>netdb.hE<gt>> таким образом:

source: struct servent { char *s_name; /* official service name */ char **s_aliases; /* alias list */ int s_port; /* port number */ char *s_proto; /* protocol to use */ }
ru: struct servent { char *s_name; /* официальное имя службы */ char **s_aliases; /* список псевдонимов */ int s_port; /* номер порта */ char *s_proto; /* используемый протокол */ }

source: The members of the I<servent> structure are:
ru: Члены структуры I<servent>:

source: The official name of the service.
ru: Официальное название службы.

source: A NULL-terminated list of alternative names for the service.
ru: Список альтернативных имён службы, завершающийся NULL.

source: The port number for the service given in network byte order.
ru: Номер порта службы, задаваемый в сетевом порядке байт.

source: The name of the protocol to use with this service.
ru: Имя протокола, используемого с данной службой.

source: The B<getservent>(), B<getservbyname>() and B<getservbyport>() functions return a pointer to a statically allocated I<servent> structure, or NULL if an error occurs or the end of the file is reached.
ru: Функции B<getservent>(), B<getservbyname>() и B<getservbyport>() возвращают указатель на статически выделенную структуру I<servent> или NULL при ошибке или достижении конца файла.

source: services database file
ru: файл базы данных служб

source: In the above table, I<servent> in I<race:servent> signifies that if any of the functions B<setservent>(), B<getservent>(), or B<endservent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<servent> в I<race:servent> означает, что если в нескольких нитях программы одновременно используются функции B<setservent>(), B<getservent>() или B<endservent>(), то может возникнуть состязательность по данным.

source: getfsent, getfsspec, getfsfile, setfsent, endfsent - handle fstab entries
ru: getfsent, getfsspec, getfsfile, setfsent, endfsent - для работы с записями fstab

source: These functions read from the file I</etc/fstab>. The I<struct fstab> is defined by:
ru: Эти функции читают файл I</etc/fstab>. Структура I<struct fstab> определена следующим образом:

source: struct fstab { char *fs_spec; /* block device name */ char *fs_file; /* mount point */ char *fs_vfstype; /* file-system type */ char *fs_mntops; /* mount options */ const char *fs_type; /* rw/rq/ro/sw/xx option */ int fs_freq; /* dump frequency, in days */ int fs_passno; /* pass number on parallel dump */ };
ru: struct fstab { char *fs_spec; /* имя блочного устройства */ char *fs_file; /* точка монтирования */ char *fs_vfstype; /* тип файловой системы */ char *fs_mntops; /* параметры монтирования */ const char *fs_type; /* параметр rw/rq/ro/sw/xx */ int fs_freq; /* периодичность запуска dump, в днях */ int fs_passno; /* номер прохода при параллельном dump */ };

source: Here the field I<fs_type> contains (on a *BSD system) one of the five strings "rw", "rq", "ro", "sw", "xx" (read-write, read-write with quota, read-only, swap, ignore).
ru: Здесь поле I<fs_type> содержит (в системах *BSD) одну из пяти строк: «rw», «rq», «ro», «sw», «xx» (чтение-запись, чтение-запись с квотами, только-чтение, подкачка, игнорировать).

source: The function B<setfsent>() opens the file when required and positions it at the first line.
ru: Функция B<setfsent>() открывает файл при необходимости и устанавливает указатель на первую строку.

source: The function B<getfsent>() parses the next line from the file. (After opening it when required.)
ru: Функция B<getfsent>() обрабатывает следующую строку из файла (открыв файл, если требуется).

source: The function B<endfsent>() closes the file when required.
ru: Функция B<endfsent>() закрывает файл, если требуется.

source: The function B<getfsspec>() searches the file from the start and returns the first entry found for which the I<fs_spec> field matches the I<special_file> argument.
ru: Функция B<getfsspec>() ищет с начала файла запись, для которой поле I<fs_spec> соответствует аргументу I<special_file> и возвращает её.

source: The function B<getfsfile>() searches the file from the start and returns the first entry found for which the I<fs_file> field matches the I<mount_point> argument.
ru: Функция B<getfsfile>() ищет с начала файла запись, для которой поле I<fs_file> соответствует аргументу I<mount_point> и возвращает её.

source: Upon success, the functions B<getfsent>(), B<getfsfile>(), and B<getfsspec>() return a pointer to a I<struct fstab>, while B<setfsent>() returns 1. Upon failure or end-of-file, these functions return NULL and 0, respectively.
ru: При успешном выполнении функции B<getfsent>(), B<getfsfile>() и B<getfsspec>() возвращают указатель на структуру I<struct fstab>, а B<setfsent>() возвращает 1. При ошибке или обнаружении конца файла эти функции возвращают, соответственно, NULL или 0.

source: These functions are not in POSIX.1. Several operating systems have them, for example, *BSD, SunOS, Digital UNIX, AIX (which also has a B<getfstype>()). HP-UX has functions of the same names, that however use a I<struct checklist> instead of a I<struct fstab>, and calls these functions obsolete, superseded by B<getmntent>(3).
ru: Эти функции не включены в POSIX.1. Они имеются в некоторых операционных системах, например *BSD, SunOS, Digital UNIX, AIX (в котором также есть B<getfstype>()). В HP-UX есть функции с тем же именем, но вместо структуры I<struct fstab> они используют структуру I<struct checklist>, и вызовы этих функций устарели, они заменены на B<getmntent>(3).

source: These functions are not thread-safe.
ru: Эти функции нельзя использовать в нескольких нитях одновременно.

source: Since Linux allows mounting a block special device in several places, and since several devices can have the same mount point, where the last device with a given mount point is the interesting one, while B<getfsfile>() and B<getfsspec>() only return the first occurrence, these two functions are not suitable for use under Linux.
ru: Так как Linux позволяет монтировать специальное блочное устройство в несколько разных точек, а также так как несколько устройств могут иметь одну точку монтирования, то неясно, будет ли результат (первая запись), возвращенный функциями B<getfsfile>() и B<getfsspec>() именно тем, что и ожидался. Поэтому эти две функции не подходят для использования под Linux.

source: getumask - get file creation mask
ru: getumask - возвращает маску создания файла

source: This function returns the current file creation mask. It is equivalent to
ru: Функция возвращает текущую маску создания файла. Она эквивалентна

source: except that it is documented to be thread-safe (that is, shares a lock with the B<umask>(2) library call).
ru: за исключением того, что без проблем может использоваться нитях (то есть использует общую блокировку с библиотечным вызовом B<umask>(2)).

source: This is a vaporware GNU extension.
ru: Это «дутое» расширение GNU.

source: This function is documented in the glibc manual, but, as at glibc version 2.24, it is not implemented on Linux. (See B<umask>(2) for a thread-safe method of discovering a process's umask.)
ru: Эта функция описана в руководстве glibc, но на момент версии glibc 2.24, оно не реализовано для Linux (смотрите в B<umask>(2) нитебезопасный метод определения umask процесса).

source: getdate, getdate_r - convert a date-plus-time string to broken-down time
ru: getdate, getdate_r - разделяет строку дата+время на отдельные части

source: The function B<getdate>() converts a string representation of a date and time, contained in the buffer pointed to by I<string>, into a broken-down time. The broken-down time is stored in a I<tm> structure, and a pointer to this structure is returned as the function result. This I<tm> structure is allocated in static storage, and consequently it will be overwritten by further calls to B<getdate>().
ru: Функция B<getdate>() преобразует строковое представление даты и времени из буфера, на который указывает I<string> в разделённое на компоненты время. Разделённое время сохраняется в структуре I<tm> и указатель на неё возвращается в качестве результата. Структура I<tm> находится в статической области и, таким образом, будет перезаписана при следующих вызовах B<getdate>().

source: In contrast to B<strptime>(3), (which has a I<format> argument), B<getdate>() uses the formats found in the file whose full pathname is given in the environment variable B<DATEMSK>. The first line in the file that matches the given input string is used for the conversion.
ru: В отличие от B<strptime>(3), (которая имеет аргумент I<format>), функция B<getdate>() использует форматы, содержащиеся в файле, полный путь к которому содержится в переменной окружения B<DATEMSK>. Первая строка файла, которая совпадает с полученной входной строкой, будет использована для преобразования.

source: The matching is done case insensitively. Superfluous whitespace, either in the pattern or in the string to be converted, is ignored.
ru: Проверка на совпадение производится без учета регистра. Лишние пробелы как в шаблоне, так и в преобразуемой строке игнорируются.

source: The conversion specifications that a pattern can contain are those given for B<strptime>(3). One more conversion specification is specified in POSIX.1-2001:
ru: Описатели преобразования, которые могут быть указаны в шаблоне, соответствуют используемым в B<strptime>(3). Кроме того, понимается ещё один описатель POSIX.1-2001:

source: Timezone name. This is not implemented in glibc.
ru: Имя часового пояса. Не реализован в glibc.

source: When B<%Z> is given, the structure containing the broken-down time is initialized with values corresponding to the current time in the given timezone. Otherwise, the structure is initialized to the broken-down time corresponding to the current local time (as by a call to B<localtime>(3)).
ru: Если указан B<%Z>, то структура с разделённым временем инициализируется значениями в соответствие с текущим временем указанного часового пояса. В противном случае, структура инициализируется разделённым временем в соответствии с текущим местным временем (как при вызове B<localtime>(3)).

source: When only the day of the week is given, the day is taken to be the first such day on or after today.
ru: Если указан только день недели, то берётся ближайший день или завтрашний.

source: When only the month is given (and no year), the month is taken to be the first such month equal to or after the current month. If no day is given, it is the first day of the month.
ru: Если указан только месяц (и не указан год), то берётся первый месяц, эквивалентный заданному, или следующий. Если не указан день, то это будет первый день месяца.

source: When no hour, minute and second are given, the current hour, minute and second are taken.
ru: Если не указаны часы, минуты и секунды, то берётся текущий час, минута и секунда.

source: If no date is given, but we know the hour, then that hour is taken to be the first such hour equal to or after the current hour.
ru: Если не указана дата, но мы знаем час, то будет взят первый час, равный заданному, начиная с текущего часа.

source: B<getdate_r>() is a GNU extension that provides a reentrant version of B<getdate>(). Rather than using a global variable to report errors and a static buffer to return the broken down time, it returns errors via the function result value, and returns the resulting broken-down time in the caller-allocated buffer pointed to by the argument I<res>.
ru: Функция B<getdate_r>() является расширением GNU и предоставляет реентерабельную версию B<getdate>(). Она не использует глобальную переменную для сообщения об ошибках и статический буфер для возвращаемого разделённого времени, она возвращает ошибки как результат функции, а разделённое время возвращается в выделенном вызывающем буфере, на который указывает аргумент I<res>.

source: When successful, B<getdate>() returns a pointer to a I<struct tm>. Otherwise, it returns NULL and sets the global variable I<getdate_err> to one of the error numbers shown below. Changes to I<errno> are unspecified.
ru: При успешном выполнении B<getdate>() возвращает указатель на I<struct tm>. В противном случае возвращается NULL, а глобальная переменная I<getdate_err> содержит один из номеров ошибок, перечисленных ниже. Изменения I<errno> не определены.

source: On success B<getdate_r>() returns 0; on error it returns one of the error numbers shown below.
ru: При успешном выполнении B<getdate_r>() возвращает 0; при ошибке возвращается одно из значений ошибки, перечисленных далее.

source: The following errors are returned via I<getdate_err> (for B<getdate>()) or as the function result (for B<getdate_r>()):
ru: Следующие ошибки возвращаются в I<getdate_err> (для B<getdate>()) или как результат функции (для B<getdate_r>()):

source: The B<DATEMSK> environment variable is not defined, or its value is an empty string.
ru: Переменная окружения B<DATEMSK> не определена или её значение — пустая строка.

source: The template file specified by B<DATEMSK> cannot be opened for reading.
ru: Файл шаблонов, заданный B<DATEMSK>, не может быть открыт на чтение.

source: Failed to get file status information.
ru: Не удалось получить информацию о состоянии файла.

source: The template file is not a regular file.
ru: Файл шаблонов не является обычным файлом.

source: An error was encountered while reading the template file.
ru: Произошла ошибка при чтении файла шаблонов.

source: Memory allocation failed (not enough memory available).
ru: Не удалось выделить память (недостаточно памяти).

source: There is no line in the file that matches the input.
ru: В файле нет строки, совпавшей с входной.

source: Invalid input specification.
ru: Неверный формат входной строки.

source: ENVIRONMENT
ru: ОКРУЖЕНИЕ

source: File containing format patterns.
ru: Файл, содержащий шаблоны форматирования.

source: Variables used by B<strptime>(3).
ru: Переменные, используемые B<strptime>(3).
