Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: (v) Collating symbols, like "I<[.ch.]>" or "I<[.a-acute.]>", where the string between "I<[.>" and "I<.]>" is a collating element defined for the current locale. Note that this may be a multicharacter element.
ru: (v) Сортировочные символы, такие, как «I<[.ch.]>» или «I<[.a-acute.]>», строка которых, лежащая между «I<[.>» и «I<.]>», является элементом сортировки, определённым для текущей локали. Заметим, что это может быть многосимвольный элемент.

source: (vi) Equivalence class expressions, like "I<[=a=]>", where the string between "I<[=>" and "I<=]>" is any collating element from its equivalence class, as defined for the current locale. For example, "I<[[=a=]]>" might be equivalent to "I<[a\('a\(`a\(:a\(^a]>", that is, to "I<[a[.a-acute.][.a-grave.][.a-umlaut.][.a-circumflex.]]>".
ru: (vi) Классы эквивалентности, такие, как «I<[=a=]>», где строка между «I<[=>» и «I<=]>» является любым элементом сортировки из своего класса эквивалентности, определённого в текущей локали. Например, «I<[[=a=]]>» может быть эквивалентно «I<[a\('a\(`a\(:a\(^a]>», то есть «I<[a[.a-acute.][.a-grave.][.a-umlaut.][.a-circumflex.]]>».

source: getsid - get session ID
ru: getsid - получить ID сеанса

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L
ru: || /* начиная с glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L

source: I<getsid(0)> returns the session ID of the calling process. B<getsid>() returns the session ID of the process with process ID I<pid>. If I<pid> is 0, B<getsid>() returns the session ID of the calling process.
ru: Вызов I<getsid(0)> возвращает идентификатор (ID) сеанса вызвавшего процесса. Вызов B<getsid>() возвращает идентификатор сеанса процесса с ID равным I<pid>. Если I<pid> равно 0, то B<getsid>() возвращает идентификатор сеанса вызвавшего процесса.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On success, a session ID is returned. On error, I<(pid_t)\ -1> will be returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается идентификатор сеанса. В случае ошибки возвращается I<(pid_t)\ -1>, а I<errno> устанавливается в соответствующее значение.

source: ERRORS
ru: ОШИБКИ

source: A process with process ID I<pid> exists, but it is not in the same session as the calling process, and the implementation considers this an error.
ru: Процесс с идентификатором I<pid> существует, но не находится в том же сеансе что и вызвавший процесс; в данной реализации это считается ошибкой.

source: No process with process ID I<pid> was found.
ru: Процесс с идентификатором I<pid> не найден.

source: VERSIONS
ru: ВЕРСИИ

source: This system call is available on Linux since version 2.0.
ru: Данный системный вызов доступен в Linux начиная с версии 2.0.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: Linux does not return B<EPERM>.
ru: Linux не возвращает B<EPERM>.

source: See B<credentials>(7) for a description of sessions and session IDs.
ru: На странице B<credentials>(7) есть описание сеансов и их идентификаторов.

source: getpid, getppid - get process identification
ru: getpid, getppid - получение идентификатора процесса

source: B<getpid>() returns the process ID (PID) of the calling process. (This is often used by routines that generate unique temporary filenames.)
ru: Вызов B<getpid>() возвращает идентификатор (PID) вызвавшего процесса (часто используется функциями, которые генерируют уникальные имена временных файлов).

source: B<getppid>() returns the process ID of the parent of the calling process. This will be either the ID of the process that created this process using B<fork>(), or, if that process has already terminated, the ID of the process to which this process has been reparented (either B<init>(1) or a "subreaper" process defined via the B<prctl>(2) B<PR_SET_CHILD_SUBREAPER> operation).
ru: Вызов B<getppid>() возвращает идентификатор процесса, являющегося родительским по отношению к вызвавшему процессу. Результат равен идентификатору процесса, который создал этот процесс с помощью B<fork>(), или идентификатору процесса, который заместил родителя (или B<init>(1), или процесс «сборщик», определённый с помощью операции B<PR_SET_CHILD_SUBREAPER> вызовом B<prctl>(2)), если этот процесс уже завершён.

source: These functions are always successful.
ru: Функции всегда завершаются успешно.

source: If the caller's parent is in a different PID namespace (see B<pid_namespaces>(7)), B<getppid>() returns 0.
ru: Если родитель вызывающего находит в другом пространстве имён PID (смотрите B<pid_namespaces>(7)), то B<getppid>() возвращает 0.

source: From a kernel perspective, the PID (which is shared by all of the threads in a multithreaded process) is sometimes also known as the thread group ID (TGID). This contrasts with the kernel thread ID (TID), which is unique for each thread. For further details, see B<gettid>(2) and the discussion of the B<CLONE_THREAD> flag in B<clone>(2).
ru: Со стороны ядра PID (одинаков у всех нитей в многонитевом процессе) иногда называют идентификатором группы нитей (TGID). Он отличается от идентификатора нити (TID), который является уникальным для каждой нити. Подробней смотрите в B<gettid>(2) и описание флага B<CLONE_THREAD> в B<clone>(2).

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: From glibc version 2.3.4 up to and including version 2.24, the glibc wrapper function for B<getpid>() cached PIDs, with the goal of avoiding additional system calls when a process calls B<getpid>() repeatedly. Normally this caching was invisible, but its correct operation relied on support in the wrapper functions for B<fork>(2), B<vfork>(2), and B<clone>(2): if an application bypassed the glibc wrappers for these system calls by using B<syscall>(2), then a call to B<getpid>() in the child would return the wrong value (to be precise: it would return the PID of the parent process). In addition, there were cases where B<getpid>() could return the wrong value even when invoking B<clone>(2) via the glibc wrapper function. (For a discussion of one such case, see BUGS in B<clone>(2).) Furthermore, the complexity of the caching code had been the source of a few bugs within glibc over the years.
ru: В версиях glibc с 2.3.4 по 2.24 включительно обёрточная функция glibc для B<getpid>() кэширует PID, чтобы не делать дополнительных системных вызовов, когда процесс систематически вызывает B<getpid>(). Обычно, это кэширование незаметно, но его корректность работы полагается на поддержку в обёрточных функциях для B<fork>(2), B<vfork>(2) и B<clone>(2): если приложение не воспользуется обёртками glibc для этих системных вызовов, а вызовет из через B<syscall>(2), то вызов B<getpid>() в потомке вернёт неправильное значение (точнее, вернёт PID родительского процесса). Также, бывают случаи, когда B<getpid>() может вернуть неверное значение даже при вызове B<clone>(2) через обёрточную функцию glibc (описание одного из них смотрите в разделе ДЕФЕКТЫ в B<clone>(2)). Кроме того, сложность кэширующего кода была источником нескольких дефектов в glibc многие годы.

source: Because of the aforementioned problems, since glibc version 2.25, the PID cache is removed: calls to B<getpid>() always invoke the actual system call, rather than returning a cached value.
ru: Из-за вышеперечисленных проблем начиная с glibc версии 2.25 кэширование PID было удалено: вызов B<getpid>() всегда вызывает реальный системный вызов, а не возвращает значение из кэша.

source: On Alpha, instead of a pair of B<getpid>() and B<getppid>() system calls, a single B<getxpid>() system call is provided, which returns a pair of PID and parent PID. The glibc B<getpid>() and B<getppid>() wrapper functions transparently deal with this. See B<syscall>(2) for details regarding register mapping.
ru: На Alpha вместо пары системных вызовов B<getpid>() и B<getppid>() предоставляется один B<getxpid>(), который возвращает пару PID и родительский PID. Обёрточные функции glibc B<getpid>() и B<getppid>() скрывают это. Подробности об отображении регистров смотрите в B<syscall>(2).

source: getpriority, setpriority - get/set program scheduling priority
ru: getpriority, setpriority - получить/установить приоритет планирования программы

source: The scheduling priority of the process, process group, or user, as indicated by I<which> and I<who> is obtained with the B<getpriority>() call and set with the B<setpriority>() call. The process attribute dealt with by these system calls is the same attribute (also known as the "nice" value) that is dealt with by B<nice>(2).
ru: С помощью вызова B<getpriority>() можно получить приоритет планирования (scheduling priority) процесса, группы процессов или пользователя, которые заданы в аргументах I<which> и I<who>, а с помощью вызова B<setpriority>() назначить его. Атрибут процесса этих системных вызовов тот же самый что атрибут (так называемое значение уступчивости «nice»), с которым работает вызов B<nice>(2).

source: The value I<which> is one of B<PRIO_PROCESS>, B<PRIO_PGRP>, or B<PRIO_USER>, and I<who> is interpreted relative to I<which> (a process identifier for B<PRIO_PROCESS>, process group identifier for B<PRIO_PGRP>, and a user ID for B<PRIO_USER>). A zero value for I<who> denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process.
ru: Значением I<which> может быть одно из: B<PRIO_PROCESS>, B<PRIO_PGRP> или B<PRIO_USER>, а значение I<who> рассматривается относительно I<which> (идентификатор процесса, если B<PRIO_PROCESS>; группы процесса, если B<PRIO_PGRP>; идентификатор пользователя, если B<PRIO_USER>). Нулевое значение I<who> означает (соответственно) вызывающий процесс, группу вызывающего процесса или реальный идентификатор пользователя вызывающего процесса.

source: The I<prio> argument is a value in the range -20 to 19 (but see NOTES below). with -20 being the highest priority and 19 being the lowest priority. Attempts to set a priority outside this range are silently clamped to the range. The default priority is 0; lower values give a process a higher scheduling priority.
ru: Аргумент I<prio> — это значение в диапазоне от -20 до 19 (смотрите ЗАМЕЧАНИЯ ниже), где -20 это наивысший приоритет, а 19 — наинизший. Попытка задать приоритет вне этого диапазона просто подгоняется под диапазон. По умолчанию приоритет равен 0; низкие значения дают процессу больший приоритет при планировании.

source: The B<getpriority>() call returns the highest priority (lowest numerical value) enjoyed by any of the specified processes. The B<setpriority>() call sets the priorities of all of the specified processes to the specified value.
ru: Вызов B<getpriority>() возвращает наивысший приоритет (наименьшее числовое значение) из приоритетов всех указанных процессов. Вызов B<setpriority>() устанавливает приоритеты всех указанных процессов в заданное значение.

source: Traditionally, only a privileged process could lower the nice value (i.e., set a higher priority). However, since Linux 2.6.12, an unprivileged process can decrease the nice value of a target process that has a suitable B<RLIMIT_NICE> soft limit; see B<getrlimit>(2) for details.
ru: Обычно, только привилегированный процесс может понижать значение уступчивости (т. е., повышать приоритет). Однако начиная с Linux 2.6.12 непривилегированный процесс может понизить значение уступчивости процесса назначения, у которого установлено подходящее мягкое ограничение B<RLIMIT_NICE>; подробности смотрите в B<getrlimit>(2).

source: On success, B<getpriority>() returns the calling thread's nice value, which may be a negative number. On error, it returns -1 and sets I<errno> to indicate the cause of the error. Since a successful call to B<getpriority>() can legitimately return the value -1, it is necessary to clear the external variable I<errno> prior to the call, then check it afterward to determine if -1 is an error or a legitimate value.
ru: При успешном выполнении B<getpriority>() возвращает значение уступчивости вызывающей нити, которое может быть отрицательным. При ошибке возвращается -1 и изменяется значение I<errno>, указывающее код ошибки. Так как B<getpriority>() в качестве результата может вернуть -1, то перед вызовом необходимо очищать значение внешней переменной I<errno>, а затем проверять его после вызова, чтобы определить, является ли -1 ошибкой или результатом вызова.

source: B<setpriority>() returns 0 on success. On error, it returns -1 and sets I<errno> to indicate the cause of the error.
ru: При нормальном завершении работы B<setpriority>() возвращает 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: I<which> was not one of B<PRIO_PROCESS>, B<PRIO_PGRP>, or B<PRIO_USER>.
ru: Значение I<which> не равно B<PRIO_PROCESS>, B<PRIO_PGRP> или B<PRIO_USER>.

source: No process was located using the I<which> and I<who> values specified.
ru: Не найдено процессов, которые заданы значениями I<which> и I<who>.

source: In addition to the errors indicated above, B<setpriority>() may fail if:
ru: В дополнение к вышеуказанным ошибкам, B<setpriority>() может завершиться неудачно:

source: The caller attempted to set a lower nice value (i.e., a higher process priority), but did not have the required privilege (on Linux: did not have the B<CAP_SYS_NICE> capability).
ru: Вызывающий пытается понизить значение уступчивости (то есть повысить приоритет процесса), но он не имеет на это прав (в Linux: не имеет мандата B<CAP_SYS_NICE>).

source: A process was located, but its effective user ID did not match either the effective or the real user ID of the caller, and was not privileged (on Linux: did not have the B<CAP_SYS_NICE> capability). But see NOTES below.
ru: Процесс был найден, но эффективному идентификатору пользователя этого процесса не соответствует заданный в вызове эффективный (или реальный) идентификатор вызывающего и у вызывающего нет прав (в Linux: не имеет мандата B<CAP_SYS_NICE>). Смотрите ЗАМЕЧАНИЯ далее.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD (these interfaces first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD (эти интерфейсы впервые появились в 4.2BSD).

source: For further details on the nice value, see B<sched>(7).
ru: Дополнительную информацию о значении уступчивости смотрите в B<sched>(7).

source: I<Note>: the addition of the "autogroup" feature in Linux 2.6.38 means that the nice value no longer has its traditional effect in many circumstances. For details, see B<sched>(7).
ru: I<Замечание>: дополнительное свойство «autogroup» из Linux 2.6.38 означает, что значение уступчивости во многих случаях больше не работает как обычно. Подробней смотрите в B<sched>(7).

source: A child created by B<fork>(2) inherits its parent's nice value. The nice value is preserved across B<execve>(2).
ru: Потомок, созданный с помощью B<fork>(2), наследует значение nice родителя. При вызове B<execve>(2) значение nice сохраняется.

source: The details on the condition for B<EPERM> depend on the system. The above description is what POSIX.1-2001 says, and seems to be followed on all System\ V-like systems. Linux kernels before 2.6.12 required the real or effective user ID of the caller to match the real user of the process I<who> (instead of its effective user ID). Linux 2.6.12 and later require the effective user ID of the caller to match the real or effective user ID of the process I<who>. All BSD-like systems (SunOS 4.1.3, Ultrix 4.2, 4.3BSD, FreeBSD 4.3, OpenBSD-2.5, ...) behave in the same manner as Linux 2.6.12 and later.
ru: Детали условия возникновения ошибки B<EPERM> зависят от системы. Описание, приведённое выше, соответствует POSIX.1-2001, и, кажется, ему удовлетворяют все System\ V-подобные системы. Ядра Linux до версии 2.6.12 требуют, чтобы эффективный идентификатор пользователя вызывающего совпадал с реальным идентификатором пользователя процесса I<who> (вместо его эффективного идентификатора пользователя). В Linux 2.6.12 и новее требуется, чтобы эффективный идентификатор пользователя вызывающего совпадал с реальным или эффективным идентификатором пользователя процесса I<who>. Все системы BSD (SunOS 4.1.3, Ultrix 4.2, 4.3BSD, FreeBSD 4.3, OpenBSD-2.5, …) действуют также как Linux 2.6.12 и новее.

source: Including I<E<lt>sys/time.hE<gt>> is not required these days, but increases portability. (Indeed, I<E<lt>sys/resource.hE<gt>> defines the I<rusage> structure with fields of type I<struct timeval> defined in I<E<lt>sys/time.hE<gt>>.)
ru: Включать I<E<lt>sys/time.hE<gt>> в настоящее время не требуется, но это увеличивает переносимость (безусловно, в I<E<lt>sys/resource.hE<gt>> определена структура I<rusage> с полями типа I<struct timeval>, которая определена в I<E<lt>sys/time.hE<gt>>).

source: Within the kernel, nice values are actually represented using the range 40..1 (since negative numbers are error codes) and these are the values employed by the B<setpriority>() and B<getpriority>() system calls. The glibc wrapper functions for these system calls handle the translations between the user-land and kernel representations of the nice value according to the formula I<unice\ =\ 20\ -\ knice>. (Thus, the kernel's 40..1 range corresponds to the range -20..19 as seen by user space.)
ru: Внутри ядра значения nice на самом деле представлены как диапазон (так как отрицательными числами задаются коды ошибок) и эти значения возвращаются системными вызовами B<setpriority>() и B<getpriority>(). Обёрточные функции glibc для этих системных вызовов преобразуют значение между пользовательским и ядерным диапазонами по формуле I<unice\ =\ 20\ -\ knice> (таким образом, ядерный диапазон 40..1 соответствует диапазону -20..19, видимый в пользовательском пространстве).

source: BUGS
ru: ДЕФЕКТЫ

source: According to POSIX, the nice value is a per-process setting. However, under the current Linux/NPTL implementation of POSIX threads, the nice value is a per-thread attribute: different threads in the same process can have different nice values. Portable applications should avoid relying on the Linux behavior, which may be made standards conformant in the future.
ru: Согласно POSIX, значение nice — свойство процесса. Однако в текущей реализации Linux/NPTL нитей POSIX значение nice — атрибут нити: различные нити в одном процессе могут иметь разные значения nice. Переносимые приложения не должны полагаться на поведение Linux, которое может стать стандартом в будущем.

source: I<Documentation/scheduler/sched-nice-design.txt> in the Linux kernel source tree (since Linux 2.6.23)
ru: Файл I<Documentation/scheduler/sched-nice-design.txt> из дерева исходного кода ядра Linux (начиная с Linux 2.6.23)

source: getpeername - get name of connected peer socket
ru: getpeername - получает имя подключившегося сокета

source: B<getpeername>() returns the address of the peer connected to the socket I<sockfd>, in the buffer pointed to by I<addr>. The I<addrlen> argument should be initialized to indicate the amount of space pointed to by I<addr>. On return it contains the actual size of the name returned (in bytes). The name is truncated if the buffer provided is too small.
ru: B<getpeername>() возвращает адрес машины, подключившейся к сокету I<sockfd>, в буфер, указанный I<addr>. В параметре I<addrlen> должно быть указано, сколько места выделено, на которое указывает I<addr>. По возвращении он содержит реальный размер памяти, занимаемый возвращаемым именем (в байтах). Имя обрезается, если буфер окажется слишком мал.

source: The returned address is truncated if the buffer provided is too small; in this case, I<addrlen> will return a value greater than was supplied to the call.
ru: Возвращаемый адрес урежется, если предоставленный буфер окажется слишком маленьким; в этом случае в I<addrlen> будет возвращено значение большее чем было в вызове.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The argument I<sockfd> is not a valid file descriptor.
ru: Аргумент I<sockfd> не является допустимым файловым дескриптором.

source: The I<addr> argument points to memory not in a valid part of the process address space.
ru: Аргумент I<addr> указывает на память в недопустимой части адресуемого пространства процесса.

source: I<addrlen> is invalid (e.g., is negative).
ru: Неправильное значение аргумента I<addrlen> (например, отрицательное).

source: Insufficient resources were available in the system to perform the operation.
ru: Недостаточно ресурсов в системе для выполнения операции.

source: The socket is not connected.
ru: Сокет не подключён.

source: The file descriptor I<sockfd> does not refer to a socket.
ru: Файловый дескриптор I<sockfd> указывает не на каталог.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD (B<getpeername>() first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD, (B<getpeername>() впервые появился в 4.2BSD).

source: For background on the I<socklen_t> type, see B<accept>(2).
ru: Описание типа I<socklen_t> смотрите в B<accept>(2).

source: For stream sockets, once a B<connect>(2) has been performed, either socket can call B<getpeername>() to obtain the address of the peer socket. On the other hand, datagram sockets are connectionless. Calling B<connect>(2) on a datagram socket merely sets the peer address for outgoing datagrams sent with B<write>(2) or B<recv>(2). The caller of B<connect>(2) can use B<getpeername>() to obtain the peer address that it earlier set for the socket. However, the peer socket is unaware of this information, and calling B<getpeername>() on the peer socket will return no useful information (unless a B<connect>(2) call was also executed on the peer). Note also that the receiver of a datagram can obtain the address of the sender when using B<recvfrom>(2).
ru: Для потоковых сокетов после выполнения B<connect>(2) любой сокет может вызвать B<getpeername>() для получения адреса соседа (peer). С другой стороны, дейтаграмные сокеты не устанавливают соединения. Вызов B<connect>(2) для дейтаграмного сокета просто задаст адрес соседа в исходящих дейтаграммах, посылаемых с помощью B<write>(2) или B<recv>(2). Вызывающий B<connect>(2) может использовать B<getpeername>() для получения адреса соседа., который был установлен у сокета ранее. Однако, сокет соседа не знает про это и вызов B<getpeername>() для сокета соседа не вернёт полезной информации (если сосед также не вызвал B<connect>(2)). Заметим, что получатель дейтаграммы может получить адрес отправителя, если использует B<recvfrom>(2).

source: getgid, getegid - get group identity
ru: getgid, getegid - получить идентификатор группы процесса

source: B<getgid>() returns the real group ID of the calling process.
ru: B<getgid>() возвращает действительный идентификатор группы вызывающего процесса.

source: B<getegid>() returns the effective group ID of the calling process.
ru: B<getegid>() возвращает эффективный идентификатор группы вызывающего процесса.
