Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: Long ago it was considered safe to have encrypted passwords openly visible in the password file. When computers got faster and people got more security-conscious, this was no longer acceptable. Julianne Frances Haugh implemented the shadow password suite that keeps the encrypted passwords in the shadow password database (e.g., the local shadow password file I</etc/shadow>, NIS, and LDAP), readable only by root.
ru: В давние времена считалось, что хранить зашифрованные пароли в открытом доступе достаточно безопасно. Со временем компьютеры стали быстрее, а люди - более обеспокоенными проблемами безопасности, и данный подход стал неприемлемым. Джулиан Франс Хог (Julianne Frances Haugh) реализовал набор программ для теневых паролей, который хранит зашифрованные пароли в базе данных теневых паролей (например в локальном файле теневых паролей I</etc/shadow>, NIS или LDAP), доступной для чтения только root.

source: The functions described below resemble those for the traditional password database (e.g., see B<getpwnam>(3) and B<getpwent>(3)).
ru: Описанные ниже функции соответствуют аналогами для традиционной базы паролей (см. B<getpwnam>(3) and B<getpwent>(3)).

source: The B<getspnam>() function returns a pointer to a structure containing the broken-out fields of the record in the shadow password database that matches the username I<name>.
ru: Функция B<getspnam>() возвращает указатель на структуру, содержащую разделённую на поля запись из базы данных теневых паролей, которая соответствует имени пользователя I<name>.

source: The B<getspent>() function returns a pointer to the next entry in the shadow password database. The position in the input stream is initialized by B<setspent>(). When done reading, the program may call B<endspent>() so that resources can be deallocated.
ru: Функция B<getspent>() возвращает указатель на следующую запись в базе данных теневых паролей. Положение во входном потоке инициализируется с помощью B<setspent>(). После выполнения чтения программа может вызвать B<endspent>() для освобождения ресурсов.

source: The B<fgetspent>() function is similar to B<getspent>() but uses the supplied stream instead of the one implicitly opened by B<setspent>().
ru: Функция B<fgetspent>() подобна B<getspent>() но использует заданный поток вместо неявного открытия с помощью B<setspent>().

source: The B<sgetspent>() function parses the supplied string I<s> into a struct I<spwd>.
ru: Функция B<sgetspent>() разбирает передаваемую строку I<s> в структуру I<spwd>.

source: The B<putspent>() function writes the contents of the supplied struct I<spwd> I<*p> as a text line in the shadow password file format to I<stream>. String entries with value NULL and numerical entries with value -1 are written as an empty string.
ru: Функция B<putspent>() записывает в I<stream> содержимое передаваемой структуры I<spwd> I<*p> в виде текстовой строки в формате файла теневых паролей. Строковые записи со значением NULL и числовые записи со значением -1 записываются как пустые строки.

source: The B<lckpwdf>() function is intended to protect against multiple simultaneous accesses of the shadow password database. It tries to acquire a lock, and returns 0 on success, or -1 on failure (lock not obtained within 15 seconds). The B<ulckpwdf>() function releases the lock again. Note that there is no protection against direct access of the shadow password file. Only programs that use B<lckpwdf>() will notice the lock.
ru: Функция B<lckpwdf>() предназначена для защиты базы данных теневых паролей при одновременном многочисленном доступе. Она пытается захватить блокировку и возвращает 0 при успешном выполнении и -1 при ошибке (блокировка не получена в течении 15 секунд). Функция B<ulckpwdf>() освобождает блокировку. Заметим, что это не защищает при прямом доступе к файлу теневых паролей. О блокировке будут уведомлены только программы, использующие B<lckpwdf>().

source: These were the functions that formed the original shadow API. They are widely available.
ru: Эти функции возникли в исходном программном интерфейсе. Они широко используются.

source: Reentrant versions
ru: Реентерабельные версии

source: Analogous to the reentrant functions for the password database, glibc also has reentrant functions for the shadow password database. The B<getspnam_r>() function is like B<getspnam>() but stores the retrieved shadow password structure in the space pointed to by I<spbuf>. This shadow password structure contains pointers to strings, and these strings are stored in the buffer I<buf> of size I<buflen>. A pointer to the result (in case of success) or NULL (in case no entry was found or an error occurred) is stored in I<*spbufp>.
ru: По аналогии с реентерабельными функциями для базы данных паролей, в glibc также есть реентерабельные функции для базы данных теневых паролей. Функция B<getspnam_r>() подобна B<getspnam>(), но хранит выбранную структуру теневого пароля в пространстве, на которое указывает I<spbuf>. Данная структура теневого пароля содержит указатели на строки и эти строки хранятся в буфере I<buf> размером I<buflen>. Указатель на результат (при успешном выполнении) или NULL (в случае отсутствия записи или ошибки) сохраняется в I<*spbufp>.

source: The functions B<getspent_r>(), B<fgetspent_r>(), and B<sgetspent_r>() are similarly analogous to their nonreentrant counterparts.
ru: Функции B<getspent_r>(), B<fgetspent_r>() и B<sgetspent_r>() подобны их нереентерабельным аналогам.

source: Some non-glibc systems also have functions with these names, often with different prototypes.
ru: Некоторые не-glibc системы также содержат функции с такими именами, но, чаще всего, с другими прототипами.

source: Structure
ru: Структура

source: The shadow password structure is defined in I<E<lt>shadow.hE<gt>> as follows:
ru: Структура теневого пароля определена в I<E<lt>shadow.hE<gt>>:

source: struct spwd { char *sp_namp; /* Login name */ char *sp_pwdp; /* Encrypted password */ long sp_lstchg; /* Date of last change (measured in days since 1970-01-01 00:00:00 +0000 (UTC)) */ long sp_min; /* Min # of days between changes */ long sp_max; /* Max # of days between changes */ long sp_warn; /* # of days before password expires to warn user to change it */ long sp_inact; /* # of days after password expires until account is disabled */ long sp_expire; /* Date when account expires (measured in days since 1970-01-01 00:00:00 +0000 (UTC)) */ unsigned long sp_flag; /* Reserved */ };
ru: struct spwd { char *sp_namp; /* имя пользователя */ char *sp_pwdp; /* зашифрованный пароль */ long sp_lstchg; /* дата последнего изменения в днях начиная с 1970-01-01 00:00:00 +0000 (UTC)) */ long sp_min; /* мин. кол-во дней между сменой */ long sp_max; /* макс. кол-во дней между сменой */ long sp_warn; /* кол-во дней до истечения срока действия пароля для предупреждения пользователя */ long sp_inact; /* кол-во дней до истечения срока действия пароля, после запись блокируется */ long sp_expire; /* дата устаревания учётной записи в днях начиная с 1970-01-01 00:00:00 +0000 (UTC)) */ unsigned long sp_flag; /* зарезервировано */ };

source: The functions that return a pointer return NULL if no more entries are available or if an error occurs during processing. The functions which have I<int> as the return value return 0 for success and -1 for failure, with I<errno> set to indicate the cause of the error.
ru: Функции, которые возвращают указатель, возвращают NULL, если элементы закончились или произошла ошибка во время обработки. Функции, которые возвращают значение с типом I<int>, возвращают 0 при успешном выполнении и -1 при ошибке, записывая в I<errno> причину ошибки.

source: For the nonreentrant functions, the return value may point to static area, and may be overwritten by subsequent calls to these functions.
ru: У нереентерабельных функций возвращаемое значение может указывать на статическую область и может быть перезаписано последующими вызовами этих функций.

source: The reentrant functions return zero on success. In case of error, an error number is returned.
ru: При успешном выполнении реентерабельные функции возвращают 0. В случае ошибки возвращается номер ошибки.

source: The caller does not have permission to access the shadow password file.
ru: Вызывающий не имеет прав доступа к файлу теневых паролей.

source: Supplied buffer is too small.
ru: Указанный буфер слишком мал.

source: local shadow password database file
ru: файл, содержащий базу локальных теневых паролей

source: lock file
ru: файл блокировки

source: The include file I<E<lt>paths.hE<gt>> defines the constant B<_PATH_SHADOW> to the pathname of the shadow password file.
ru: При включении файла I<E<lt>paths.hE<gt>> определяется константа B<_PATH_SHADOW>, в которой хранится путь к файлу теневых паролей.

source: In the above table, I<getspent> in I<race:getspent> signifies that if any of the functions B<setspent>(), B<getspent>(), B<getspent_r>(), or B<endspent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<getspent> в I<race:getspent> означает, что если в нескольких нитях программы одновременно используются функции B<setspent>(), B<getspent>(), B<getspent_r>() или B<endspent>(), то может возникнуть состязательность по данным.

source: The shadow password database and its associated API are not specified in POSIX.1. However, many other systems provide a similar API.
ru: База данных теневых паролей и её программный интерфейс не описаны в POSIX.1. Однако, во многих системах есть похожий программный интерфейс.

source: getaddrinfo, freeaddrinfo, gai_strerror - network address and service translation
ru: getaddrinfo, freeaddrinfo, gai_strerror - трансляция сетевого адреса и службы

source: B<getaddrinfo>(), B<freeaddrinfo>(), B<gai_strerror>(): Since glibc 2.22: _POSIX_C_SOURCE E<gt>= 200112L Glibc 2.21 and earlier: _POSIX_C_SOURCE
ru: B<getaddrinfo>(), B<freeaddrinfo>(), B<gai_strerror>(): начиная c glibc 2.22: _POSIX_C_SOURCE E<gt>= 200112L в glibc 2.21 и старее: _POSIX_C_SOURCE

source: Given I<node> and I<service>, which identify an Internet host and a service, B<getaddrinfo>() returns one or more I<addrinfo> structures, each of which contains an Internet address that can be specified in a call to B<bind>(2) or B<connect>(2). The B<getaddrinfo>() function combines the functionality provided by the B<gethostbyname>(3) and B<getservbyname>(3) functions into a single interface, but unlike the latter functions, B<getaddrinfo>() is reentrant and allows programs to eliminate IPv4-versus-IPv6 dependencies.
ru: По заданным I<node> и I<service>, определяющим узел и службу Интернета, B<getaddrinfo>() возвращает одну или несколько структур I<addrinfo>, каждая из которых содержит Интернет-адрес, который можно передавать в вызов B<bind>(2) или B<connect>(2). Функция B<getaddrinfo>() объединяет возможности, предоставляемые функциями B<gethostbyname>(3) и B<getservbyname>(3) в одном интерфейсе, но в отличие от этих функций, B<getaddrinfo>() реентерабельна и позволяет программам не зависеть от IPv4 или IPv6.

source: The I<addrinfo> structure used by B<getaddrinfo>() contains the following fields:
ru: Структура I<addrinfo>, используемая в B<getaddrinfo>(), содержит следующие поля:

source: The I<hints> argument points to an I<addrinfo> structure that specifies criteria for selecting the socket address structures returned in the list pointed to by I<res>. If I<hints> is not NULL it points to an I<addrinfo> structure whose I<ai_family>, I<ai_socktype>, and I<ai_protocol> specify criteria that limit the set of socket addresses returned by B<getaddrinfo>(), as follows:
ru: Аргумент I<hints> указывает на структуру I<addrinfo>, которая определяет критерии выбора структур адреса сокета, возвращаемых в списке, указанном в I<res>. Если I<hints> не является NULL, то он указывает на структуру I<addrinfo>. В ней с помощью I<ai_family>, I<ai_socktype> и I<ai_protocol> определяются критерии, ограничивающие набор адресов сокета, возвращаемых B<getaddrinfo>():

source: This field specifies the desired address family for the returned addresses. Valid values for this field include B<AF_INET> and B<AF_INET6>. The value B<AF_UNSPEC> indicates that B<getaddrinfo>() should return socket addresses for any address family (either IPv4 or IPv6, for example) that can be used with I<node> and I<service>.
ru: Это поле определяет предпочитаемое семейство адресов для возвращаемых адресов. Правильными значениями для данного поля могут быть B<AF_INET> и B<AF_INET6>. Значение B<AF_UNSPEC> отображает, что B<getaddrinfo>() должна возвращать адреса сокета для любого семейства адресов (например, либо IPv4, либо IPv6), которые в дальнейшем могут быть использованы вместе с I<node> и I<service>.

source: This field specifies the preferred socket type, for example B<SOCK_STREAM> or B<SOCK_DGRAM>. Specifying 0 in this field indicates that socket addresses of any type can be returned by B<getaddrinfo>().
ru: Это поле определяет предпочитаемы тип сокета, например, B<SOCK_STREAM> или B<SOCK_DGRAM>. Если в этом поле указан 0, то это означает, что B<getaddrinfo>() может вернуть адреса сокета любого типа.

source: This field specifies the protocol for the returned socket addresses. Specifying 0 in this field indicates that socket addresses with any protocol can be returned by B<getaddrinfo>().
ru: Это поле определяет протокол для возвращаемых адресов сокета. Если в этом поле указан 0, то это означает, что B<getaddrinfo>() может вернуть адрес сокета с любым протоколом.

source: This field specifies additional options, described below. Multiple flags are specified by bitwise OR-ing them together.
ru: В этом поле задаются дополнительные параметры, описываемые ниже. Несколько флагов указываются с логическим ИЛИ.

source: All the other fields in the structure pointed to by I<hints> must contain either 0 or a null pointer, as appropriate.
ru: Все остальные поля структуры, указываемой I<hints>, должны содержать 0 или указатель null, соответственно.

source: Specifying I<hints> as NULL is equivalent to setting I<ai_socktype> and I<ai_protocol> to 0; I<ai_family> to B<AF_UNSPEC>; and I<ai_flags> to B<(AI_V4MAPPED\ |\ AI_ADDRCONFIG)>. (POSIX specifies different defaults for I<ai_flags>; see NOTES.) I<node> specifies either a numerical network address (for IPv4, numbers-and-dots notation as supported by B<inet_aton>(3); for IPv6, hexadecimal string format as supported by B<inet_pton>(3)), or a network hostname, whose network addresses are looked up and resolved. If I<hints.ai_flags> contains the B<AI_NUMERICHOST> flag, then I<node> must be a numerical network address. The B<AI_NUMERICHOST> flag suppresses any potentially lengthy network host address lookups.
ru: Указание в I<hints> значения NULL эквивалентно установке I<ai_socktype> и I<ai_protocol> равными 0; I<ai_family> присваивается B<AF_UNSPEC>; I<ai_flags> присваивается B<(AI_V4MAPPED\ |\ AI_ADDRCONFIG)> (в POSIX указаны другие значения по умолчанию для I<ai_flags>; смотрите ЗАМЕЧАНИЯ). В I<node> задаётся либо числовой сетевой адрес (для IPv4 это цифро-точечная нотация, которую поддерживает B<inet_aton>(3); для IPv6 это строка в шестнадцатеричном формате, который поддерживает B<inet_pton>(3)), либо сетевое имя узла, для которого в дальнейшем определяется адрес. Если в I<hints.ai_flags> содержится флаг B<AI_NUMERICHOST>, тогда I<node> должен иметь цифровой формат сетевого адреса. При B<AI_NUMERICHOST> любые возможные преобразования сетевого адреса узла подавляются.

source: If the B<AI_PASSIVE> flag is specified in I<hints.ai_flags>, and I<node> is NULL, then the returned socket addresses will be suitable for B<bind>(2)ing a socket that will B<accept>(2) connections. The returned socket address will contain the "wildcard address" (B<INADDR_ANY> for IPv4 addresses, B<IN6ADDR_ANY_INIT> for IPv6 address). The wildcard address is used by applications (typically servers) that intend to accept connections on any of the host's network addresses. If I<node> is not NULL, then the B<AI_PASSIVE> flag is ignored.
ru: Если в I<hints.ai_flags> указан флаг B<AI_PASSIVE> и I<node> равно NULL, то возвращаемые адреса сокета будут пригодны для B<bind>(2) сокета, который принимает соединение с помощью B<accept>(2). Возвращаемый адрес сокета будет содержать «шаблонный адрес» (B<INADDR_ANY> для адресов IPv4, B<IN6ADDR_ANY_INIT> для адреса IPv6). Шаблонный адрес используется в приложениях (обычно, серверах), которым нужно принимать подключения с любых сетевых адресов узлов. Если I<node> не равно NULL, то флаг B<AI_PASSIVE> игнорируется.

source: If the B<AI_PASSIVE> flag is not set in I<hints.ai_flags>, then the returned socket addresses will be suitable for use with B<connect>(2), B<sendto>(2), or B<sendmsg>(2). If I<node> is NULL, then the network address will be set to the loopback interface address (B<INADDR_LOOPBACK> for IPv4 addresses, B<IN6ADDR_LOOPBACK_INIT> for IPv6 address); this is used by applications that intend to communicate with peers running on the same host.
ru: Если флаг B<AI_PASSIVE> отсутствует в I<hints.ai_flags>, то возвращаемые адреса сокета будут пригодны для использоваться в B<connect>(2), B<sendto>(2), или B<sendmsg>(2). Если I<node> равно NULL, то сетевому адресу будет назначен адрес кольцевого интерфейса (loopback) (B<INADDR_LOOPBACK> для адресов IPv4, B<IN6ADDR_LOOPBACK_INIT> для адреса IPv6); это используется в приложениях, которым нужно связываться с партнёрами, запущенными на том же узле.

source: I<service> sets the port in each returned address structure. If this argument is a service name (see B<services>(5)), it is translated to the corresponding port number. This argument can also be specified as a decimal number, which is simply converted to binary. If I<service> is NULL, then the port number of the returned socket addresses will be left uninitialized. If B<AI_NUMERICSERV> is specified in I<hints.ai_flags> and I<service> is not NULL, then I<service> must point to a string containing a numeric port number. This flag is used to inhibit the invocation of a name resolution service in cases where it is known not to be required.
ru: В I<service> задаётся порт для каждой возвращаемой адресной структуры. Если этот аргумент — имя службы (смотрите B<services>(5)), то он транслируется в соответствующий номер порта. Также, данный параметр может быть указан в виде десятичного числа, которое просто преобразуется в двоичную форму. Если I<service> равно NULL, то номер порта возвращаемых сокетных адресов остаётся неинициализированным. Если в I<hints.ai_flags> указан флаг B<AI_NUMERICSERV> и I<service> не равно NULL, то значение I<service> должно указывать на строку с числовым номером порта. Данный флаг используется для запрета вызова службы определения имён, если известно, что она не требуется.

source: Either I<node> or I<service>, but not both, may be NULL.
ru: Либо I<node>, либо I<service> (но не оба одновременно) могут быть равны NULL.

source: The B<getaddrinfo>() function allocates and initializes a linked list of I<addrinfo> structures, one for each network address that matches I<node> and I<service>, subject to any restrictions imposed by I<hints>, and returns a pointer to the start of the list in I<res>. The items in the linked list are linked by the I<ai_next> field.
ru: Функция B<getaddrinfo>() выделяет место и инициализирует связный список структур I<addrinfo>, по одной на каждый сетевой адрес, который совпадает с I<node> и I<service>, в соответствии с любыми ограничениями, наложенными I<hints>, и возвращает указатель на начало списка в I<res>. Элементы в связном списке связаны через поле I<ai_next>.

source: There are several reasons why the linked list may have more than one I<addrinfo> structure, including: the network host is multihomed, accessible over multiple protocols (e.g., both B<AF_INET> and B<AF_INET6>); or the same service is available from multiple socket types (one B<SOCK_STREAM> address and another B<SOCK_DGRAM> address, for example). Normally, the application should try using the addresses in the order in which they are returned. The sorting function used within B<getaddrinfo>() is defined in RFC\ 3484; the order can be tweaked for a particular system by editing I</etc/gai.conf> (available since glibc 2.5).
ru: Существует несколько причин того, почему связный список может содержать более одной структуры I<addrinfo>: сетевой узел имеет несколько адресов, доступен по нескольким протоколам (например, B<AF_INET> и B<AF_INET6>); служба доступна через несколько типов сокетов (например, один её адрес — B<SOCK_STREAM>, а второй — B<SOCK_DGRAM>). Обычно, приложение должно стараться использовать адреса в том порядке, в котором они получены. Функция сортировки, используемая в B<getaddrinfo>(), определена в RFC\ 3484; в системе порядок может быть изменён через файл I</etc/gai.conf> (доступен, начиная с glibc 2.5).

source: If I<hints.ai_flags> includes the B<AI_CANONNAME> flag, then the I<ai_canonname> field of the first of the I<addrinfo> structures in the returned list is set to point to the official name of the host.
ru: Если в I<hints.ai_flags> выставлен флаг B<AI_CANONNAME>, то в поле I<ai_canonname> первой из структур I<addrinfo> возвращаемого списка задаётся указатель официального имени узла.

source: The remaining fields of each returned I<addrinfo> structure are initialized as follows:
ru: Остальные поля каждой возвращаемой структуры I<addrinfo> инициализируются следующим образом:

source: The I<ai_family>, I<ai_socktype>, and I<ai_protocol> fields return the socket creation parameters (i.e., these fields have the same meaning as the corresponding arguments of B<socket>(2)). For example, I<ai_family> might return B<AF_INET> or B<AF_INET6>; I<ai_socktype> might return B<SOCK_DGRAM> or B<SOCK_STREAM>; and I<ai_protocol> returns the protocol for the socket.
ru: В полях I<ai_family>, I<ai_socktype> и I<ai_protocol> возвращаются параметры создания сокета (т. е., эти поля имеют те же значения, что и соответствующие аргументы в B<socket>(2)). Например, в I<ai_family> может вернуться B<AF_INET> или B<AF_INET6>; в I<ai_socktype> может вернуться B<SOCK_DGRAM> или B<SOCK_STREAM>; в I<ai_protocol> возвращается протокол сокета.

source: A pointer to the socket address is placed in the I<ai_addr> field, and the length of the socket address, in bytes, is placed in the I<ai_addrlen> field.
ru: Указатель на адрес сокета помещается в поле I<ai_addr>, а длина адреса сокета (в байтах) помещается в поле I<ai_addrlen>.

source: If I<hints.ai_flags> includes the B<AI_ADDRCONFIG> flag, then IPv4 addresses are returned in the list pointed to by I<res> only if the local system has at least one IPv4 address configured, and IPv6 addresses are returned only if the local system has at least one IPv6 address configured. The loopback address is not considered for this case as valid as a configured address. This flag is useful on, for example, IPv4-only systems, to ensure that B<getaddrinfo>() does not return IPv6 socket addresses that would always fail in B<connect>(2) or B<bind>(2).
ru: Если в I<hints.ai_flags> содержится флаг B<AI_ADDRCONFIG>, то адреса IPv4, возвращаются в списке, на который указывает I<res>, только, если в локальной системе настроен, как минимум, один адрес IPv4, и адреса IPv6 возвращаются только, если в локальной системе настроен, как минимум, один адрес IPv6. Кольцевой (loopback) адрес в этом случае не учитывается как настроенный. Этот флаг полезен, например в только IPv4-системах, чтобы B<getaddrinfo>() не возвращал сокетные адреса IPv6, с которыми невозможно выполнить B<connect>(2) или B<bind>(2).
