Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: In a new thread group created by a B<clone>(2) call that does not specify the B<CLONE_THREAD> flag (or, equivalently, a new process created by B<fork>(2)), the new process is a thread group leader, and its thread group ID (the value returned by B<getpid>(2)) is the same as its thread ID (the value returned by B<gettid>()).
ru: В новой группе нитей, созданной вызовом B<clone>(2) без флага B<CLONE_THREAD> (или новый процесс, созданный B<fork>(2)), новый процесс является лидером группы нитей, и ID этой группы нитей (значение, возвращаемое B<getpid>(2)) совпадает с ID этой нити (значение, возвращаемое B<gettid>()).

source: getrandom - obtain a series of random bytes
ru: getrandom - возвращает серию произвольных байт

source: The B<getrandom>() system call fills the buffer pointed to by I<buf> with up to I<buflen> random bytes. These bytes can be used to seed user-space random number generators or for cryptographic purposes.
ru: Системный вызов B<getrandom>() заполняет буфер, указанный в I<buf>, произвольными байтами в количестве до I<buflen>. Эти байты можно использовать как начальные значения в генераторах произвольных чисел пространства пользователя или с целями шифрования.

source: By default, B<getrandom>() draws entropy from the I<urandom> source (i.e., the same source as the I</dev/urandom> device). This behavior can be changed via the I<flags> argument.
ru: По умолчанию, B<getrandom>() забирает энтропию из источника I<urandom> (т. е., того же источника что и устройство I</dev/urandom>). Это поведение можно изменить через параметр I<flags>.

source: If the I<urandom> source has been initialized, reads of up to 256 bytes will always return as many bytes as requested and will not be interrupted by signals. No such guarantees apply for larger buffer sizes. For example, if the call is interrupted by a signal handler, it may return a partially filled buffer, or fail with the error B<EINTR>.
ru: Если источник I<urandom> инициализирован, то из него можно прочитать не более 256 байт, но всегда возвращается столько байт, сколько запрошено и это не будет прерываться сигналами. Для буферов большего размера это не гарантируется. Например, если вызов прерывается обработчиком сигнала, то он может вернуть частично заполненный буфер или завершиться с ошибкой B<EINTR>.

source: If the I<urandom> source has not yet been initialized, then B<getrandom>() will block, unless B<GRND_NONBLOCK> is specified in I<flags>.
ru: Если источник I<urandom> ещё не инициализирован, то вызов B<getrandom>() блокируется, если в I<flags> не указано значение B<GRND_NONBLOCK>.

source: The I<flags> argument is a bit mask that can contain zero or more of the following values ORed together:
ru: Аргумент I<flags> является битовой маской, которая может содержать ноль или более следующих флагов:

source: If this bit is set, then random bytes are drawn from the I<random> source (i.e., the same source as the I</dev/random> device) instead of the I<urandom> source. The I<random> source is limited based on the entropy that can be obtained from environmental noise. If the number of available bytes in the I<random> source is less than requested in I<buflen>, the call returns just the available random bytes. If no random bytes are available, the behavior depends on the presence of B<GRND_NONBLOCK> in the I<flags> argument.
ru: Если этот бит установлен, то произвольные байты берутся из источника I<random> (т. е., того же источника что и устройство I</dev/urandom>), а не из источника I<urandom>. Ограничение источника I<random> следует из энтропии, которую можно получить из окружающего шума. Если количество доступных байт в I<random> меньше запрашиваемых в I<buflen>, то вызов завершается сразу после выдачи всех доступных произвольных байт. Если произвольных байт нет, то поведение зависит от наличия флага B<GRND_NONBLOCK> в параметре I<flags>.

source: By default, when reading from the I<random> source, B<getrandom>() blocks if no random bytes are available, and when reading from the I<urandom> source, it blocks if the entropy pool has not yet been initialized. If the B<GRND_NONBLOCK> flag is set, then B<getrandom>() does not block in these cases, but instead immediately returns -1 with I<errno> set to B<EAGAIN>.
ru: По умолчанию, при чтении из источника I<random> вызов B<getrandom>() блокируется, если произвольные байты недоступны, и а при чтении из источника I<urandom> блокируется, если ещё не инициализирован пул энтропии. Если указан флаг B<GRND_NONBLOCK>, то в этих случаях B<getrandom>() не блокируется, а сразу возвращает -1 и присваивает I<errno> значение B<EAGAIN>.

source: On success, B<getrandom>() returns the number of bytes that were copied to the buffer I<buf>. This may be less than the number of bytes requested via I<buflen> if either B<GRND_RANDOM> was specified in I<flags> and insufficient entropy was present in the I<random> source or the system call was interrupted by a signal.
ru: При успешном выполнении B<getrandom>() возвращает количество скопированных в буфер I<buf> байт. Это значение может быть меньше, чем количество запрашиваемых в I<buflen> байт, если в I<flags> был указан B<GRND_RANDOM> и нет достаточного количества энтропии в источнике I<random>, или если системный вызов был прерван сигналом.

source: On error, -1 is returned, and I<errno> is set appropriately.
ru: В случае ошибки возвращается -1 и значение I<errno> устанавливается соответствующим образом.

source: The requested entropy was not available, and B<getrandom>() would have blocked if the B<GRND_NONBLOCK> flag was not set.
ru: Запрошенное количество энтропии недоступно, и B<getrandom>() заблокировался бы, если бы отсутствовал флаг B<GRND_NONBLOCK>.

source: The address referred to by I<buf> is outside the accessible address space.
ru: Адрес, указанный в I<buf>, лежит вне доступного адресного пространства.

source: The call was interrupted by a signal handler; see the description of how interrupted B<read>(2) calls on "slow" devices are handled with and without the B<SA_RESTART> flag in the B<signal>(7) man page.
ru: Вызов был прерван обработчиком сигнала; смотрите описание о прерывании вызовов B<read>(2) при работе с «медленными» устройствами и при отсутствии флага B<SA_RESTART> в справочной странице B<signal>(7).

source: An invalid flag was specified in I<flags>.
ru: В I<flags> указан неверный флаг.

source: The glibc wrapper function for B<getrandom>() determined that the underlying kernel does not implement this system call.
ru: Обёрточная функция в glibc для B<getrandom>() определила, что используемое ядро не поддерживает данный системный вызов.

source: B<getrandom>() was introduced in version 3.17 of the Linux kernel. Support was added to glibc in version 2.25.
ru: Вызов B<getrandom>() появился в версии ядра Linux 3.17. Поддержка в glibc добавлена в версии 2.5.

source: This system call is Linux-specific.
ru: Данный вызов есть только в Linux.

source: For an overview and comparison of the various interfaces that can be used to obtain randomness, see B<random>(7).
ru: Обзор и сравнение возможных интерфейсов, через которые можно получать случайные данные, смотрите в B<random>(7).

source: Unlike I</dev/random> and I</dev/urandom>, B<getrandom>() does not involve the use of pathnames or file descriptors. Thus, B<getrandom>() can be useful in cases where B<chroot>(2) makes I</dev> pathnames invisible, and where an application (e.g., a daemon during start-up) closes a file descriptor for one of these files that was opened by a library.
ru: В отличие от I</dev/random> и I</dev/urandom>, в вызове B<getrandom>() не используются пути или файловые дескрипторы. Таким образом, B<getrandom>() полезен в случаях, когда B<chroot>(2) делает пути I</dev> невидимыми и приложение (например, служба во время загрузки) закрывает файловый дескриптор одного из этих файлов, которые были открыты библиотекой.

source: Maximum number of bytes returned
ru: Возвращается максимальное количество байтов

source: As of Linux 3.19 the following limits apply:
ru: На момент Linux 3.19 существуют следующие ограничения:

source: When reading from the I<urandom> source, a maximum of 33554431 bytes is returned by a single call to B<getrandom>() on systems where I<int> has a size of 32 bits.
ru: При чтении из источника I<urandom> в системах, где размер I<int> равен 32 битам, один вызов B<getrandom>() возвращает максимум 33554431 байт.

source: When reading from the I<random> source, a maximum of 512 bytes is returned.
ru: При чтении из источника I<random> возвращается максимум 512 байт.

source: Interruption by a signal handler
ru: Прерывание обработчиком сигнала

source: When reading from the I<urandom> source (B<GRND_RANDOM> is not set), B<getrandom>() will block until the entropy pool has been initialized (unless the B<GRND_NONBLOCK> flag was specified). If a request is made to read a large number of bytes (more than 256), B<getrandom>() will block until those bytes have been generated and transferred from kernel memory to I<buf>. When reading from the I<random> source (B<GRND_RANDOM> is set), B<getrandom>() will block until some random bytes become available (unless the B<GRND_NONBLOCK> flag was specified).
ru: При чтении из источника I<urandom> (B<GRND_RANDOM> не указан), B<getrandom>() блокируется до тех пор, пока не специализируется пул энтропии (если не указан флаг B<GRND_NONBLOCK>). Если запрос требует большого количества байт (больше 256), B<getrandom>() будет заблокирован до тех пор, пока байты не будут сгенерированы и переданы из памяти ядра в I<buf>. При чтении из I<random> (указан B<GRND_RANDOM>), B<getrandom>() будет заблокирован до тех пор, пока какое-то количество произвольных байт не станет доступно (если не указан флаг B<GRND_NONBLOCK>).

source: The behavior when a call to B<getrandom>() that is blocked while reading from the I<urandom> source is interrupted by a signal handler depends on the initialization state of the entropy buffer and on the request size, I<buflen>. If the entropy is not yet initialized, then the call fails with the B<EINTR> error. If the entropy pool has been initialized and the request size is large (I<buflen>\ E<gt>\ 256), the call either succeeds, returning a partially filled buffer, or fails with the error B<EINTR>. If the entropy pool has been initialized and the request size is small (I<buflen>\ E<lt>=\ 256), then B<getrandom>() will not fail with B<EINTR>. Instead, it will return all of the bytes that have been requested.
ru: Поведение при прерывании обработчиком сигнала вызова B<getrandom>(), заблокированного чтением источника I<urandom>, зависит от состояния инициализации буфера энтропии и от запрашиваемого объёма I<buflen>. Если энтропия ещё не инициализирована, то вызов завершается ошибкой B<EINTR>. Если пул энтропии инициализирован и запрашиваемый объём большой (I<buflen>\ E<gt>\ 256), то вызов или завершится успешно, вернув частично заполненный буфер, или завершится с ошибкой B<EINTR>. Если пул энтропии инициализирован и запрашиваемый объём мал (I<buflen>\ E<lt>=\ 256), то B<getrandom>() завершится без ошибки B<EINTR>. Вместо этого, он вернёт все запрашиваемый байты.

source: When reading from the I<random> source, blocking requests of any size can be interrupted by a signal handler (the call fails with the error B<EINTR>).
ru: При чтении из источника I<random> блокирующие запросы на любой объём могут быть прерваны обработчиком сигналом (вызов завершается с ошибкой B<EINTR>).

source: Using B<getrandom>() to read small buffers (E<lt>=\ 256 bytes) from the I<urandom> source is the preferred mode of usage.
ru: Использование B<getrandom>() для чтения маленьких буферов (E<lt>=\ 256 байт) из источника I<urandom> — предпочтительный способ использования.

source: The special treatment of small values of I<buflen> was designed for compatibility with OpenBSD's B<getentropy>(3), which is nowadays supported by glibc.
ru: Специальный режим для маленького объёма I<buflen> был разработан для совместимости с системным вызовом B<getentropy>(3) из OpenBSD, который теперь поддерживается glibc.

source: The user of B<getrandom>() I<must> always check the return value, to determine whether either an error occurred or fewer bytes than requested were returned. In the case where B<GRND_RANDOM> is not specified and I<buflen> is less than or equal to 256, a return of fewer bytes than requested should never happen, but the careful programmer will check for this anyway!
ru: Пользователь B<getrandom>() всегда I<должен> проверять возвращаемое значение, чтобы определить что возникла ошибка или возвращено меньшее количество запрошенных байт. В случае когда флаг B<GRND_RANDOM> не указан и значение I<buflen> меньше или равно 256, возврат меньшего количества байт чем запрошено никогда не происходит, но осторожный программист всегда проверяет значение!

source: As of Linux 3.19, the following bug exists:
ru: В Linux 3.19 существуют следующие дефекты:

source: Depending on CPU load, B<getrandom>() does not react to interrupts before reading all bytes requested.
ru: В зависимости от загруженности ЦП, B<getrandom>() не реагирует на прерывания, пока не прочитает все запрашиваемые байты.

source: getxattr, lgetxattr, fgetxattr - retrieve an extended attribute value
ru: getxattr, lgetxattr, fgetxattr - получить расширенное значение атрибута

source: Extended attributes are I<name>:I<value> pairs associated with inodes (files, directories, symbolic links, etc.). They are extensions to the normal attributes which are associated with all inodes in the system (i.e., the B<stat>(2) data). A complete overview of extended attributes concepts can be found in B<xattr>(7).
ru: Расширенные атрибуты представляют собой пару I<имя>:I<значение> и связываются с записями inode (файлы, каталоги, символьные ссылки и т.п.). Они являются расширениями к обычным атрибутам, связанным со всеми записями inode в системе (например, данные B<stat>(2)). Полное описание модели расширенных атрибутов можно найти в B<xattr>(7).

source: B<getxattr>() retrieves the value of the extended attribute identified by I<name> and associated with the given I<path> in the filesystem. The attribute value is placed in the buffer pointed to by I<value>; I<size> specifies the size of that buffer. The return value of the call is the number of bytes placed in I<value>.
ru: B<getxattr>() возвращает значение расширенного атрибута с именем I<name> и связанного с указанным путем I<path> в файловой системе. Значение атрибута помещается в буфер, указанный в I<value>; в I<size> задаётся размер этого буфера. В качестве возвращаемого значения вызова возвращается количество байт, помещённых в I<value>.

source: B<lgetxattr>() is identical to B<getxattr>(), except in the case of a symbolic link, where the link itself is interrogated, not the file that it refers to.
ru: B<lgetxattr>() идентичен B<getxattr>(), за исключением указания символьной ссылки, когда рассматривается именно ссылка, а не файл, на который она указывает.

source: B<fgetxattr>() is identical to B<getxattr>(), only the open file referred to by I<fd> (as returned by B<open>(2)) is interrogated in place of I<path>.
ru: B<fgetxattr>() идентичен B<getxattr>(), только вместо I<path> берётся открытый файл, на который указывает I<fd> (возвращаемый B<open>(2)).

source: An extended attribute I<name> is a null-terminated string. The name includes a namespace prefix; there may be several, disjoint namespaces associated with an individual inode. The value of an extended attribute is a chunk of arbitrary textual or binary data that was assigned using B<setxattr>(2).
ru: Расширенный атрибут I<name> является строкой, заканчивающейся null. Имя включает префикс пространства имён; их может быть несколько, разрозненные пространства связаны с разными записями inode. Значением расширенного атрибута является произвольный кусок текстовых или двоичных данных, который был назначен с помощью B<setxattr>(2).

source: If I<size> is specified as zero, these calls return the current size of the named extended attribute (and leave I<value> unchanged). This can be used to determine the size of the buffer that should be supplied in a subsequent call. (But, bear in mind that there is a possibility that the attribute value may change between the two calls, so that it is still necessary to check the return status from the second call.)
ru: Если I<size> равно нулю, то эти вызовы возвращают текущий размер указанного расширенного атрибута (и не изменяют I<value>). Это можно использовать для определения размера буфера, который вместил бы всё значение, связанное с расширенным атрибутом (но учтите, есть вероятность, что значение атрибута может измениться между двумя вызовами, поэтому всё равно нужно проверять возвращаемое состояние после второго вызова).

source: On success, these calls return a nonnegative value which is the size (in bytes) of the extended attribute value. On failure, -1 is returned and I<errno> is set appropriately.
ru: При успешном выполнении эти вызовы возвращают неотрицательное число, обозначающее размер (в байтах) значения расширенного атрибута. При ошибке возвращается -1 и I<errno> устанавливается в соответствующее значение.

source: The size of the attribute value is larger than the maximum size allowed; the attribute cannot be retrieved. This can happen on filesystems that support very large attribute values such as NFSv4, for example.
ru: Размер значения атрибута больше максимально разрешённого размера; атрибут невозможно считать. Это может случиться в файловых системах (например NFSv4), которые поддерживают очень большие значения атрибутов.

source: The named attribute does not exist, or the process has no access to this attribute.
ru: Атрибут с таким именем не существует или процесс не имеет доступа к этому атрибуту.

source: Extended attributes are not supported by the filesystem, or are disabled.
ru: Расширенные атрибуты не поддерживаются файловой системой или отключены.

source: The I<size> of the I<value> buffer is too small to hold the result.
ru: Размер I<size> буфера I<value> слишком мал для хранения результата.

source: In addition, the errors documented in B<stat>(2) can also occur.
ru: Также могут возникать ошибки, описанные в B<stat>(2).

source: These system calls have been available on Linux since kernel 2.4; glibc support is provided since version 2.3.
ru: Данные системные вызовы доступны в Linux начиная с ядра версии 2.4; поддержка в glibc появилась в версии 2.3.

source: These system calls are Linux-specific.
ru: Данные системные вызовы есть только в Linux.

source: See B<listxattr>(2).
ru: Смотрите B<listxattr>(2).

source: getunwind - copy the unwind data to caller's buffer
ru: getunwind - копирует раскрученные данные в буфер вызывающего

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
ru: I<Замечание>: в glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: I<Note: this function is obsolete.>
ru: I<Замечание: этот вызов устарел.>

source: The IA-64-specific B<getunwind>() system call copies the kernel's call frame unwind data into the buffer pointed to by I<buf> and returns the size of the unwind data; this data describes the gate page (kernel code that is mapped into user space).
ru: Специальный системный вызов B<getunwind>() для IA-64 копирует раскрученные данные кадра вызова ядра в буфер, указанный в I<buf>, и возвращает размер раскрученных данных; эти данные описывают шлюзовую страницу (gate page, код ядра, который отображается в адресное пространство пользователя).

source: The size of the buffer I<buf> is specified in I<buf_size>. The data is copied only if I<buf_size> is greater than or equal to the size of the unwind data and I<buf> is not NULL; otherwise, no data is copied, and the call succeeds, returning the size that would be needed to store the unwind data.
ru: Размер буфера I<buf> задаётся в I<buf_size>. Данные копируются только, если значение I<buf_size> больше или равно размеру раскрученных данных и значение I<buf> не равно NULL; в противном случае, данные не копируются и вызов завершается без ошибки, возвращая размер, который необходим для хранения раскрученных данных.

source: The first part of the unwind data contains an unwind table. The rest contains the associated unwind information, in no particular order. The unwind table contains entries of the following form:
ru: В начале раскрученных данных содержится таблица раскрутки. После неё хранится связанная с раскруткой информация в произвольном порядке. В таблице раскрутки содержатся записи в следующем виде:

source: u64 start; (64-bit address of start of function) u64 end; (64-bit address of end of function) u64 info; (BUF-relative offset to unwind info)
ru: u64 start; (64-битный адрес начала функции) u64 end; (64-битный адрес конца функции) u64 info; (смещение относительно BUF на раскрученную информацию)

source: An entry whose I<start> value is zero indicates the end of the table. For more information about the format, see the I<IA-64 Software Conventions and Runtime Architecture> manual.
ru: Запись, у которой значение I<start> равно нулю, указывает на конец таблицы. Подробности формата смотрите в руководстве I<IA-64 Software Conventions and Runtime Architecture>.

source: On success, B<getunwind>() returns the size of the unwind data. On error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<getunwind>() возвращает размер раскрученных данных. При ошибке возвращается -1, а в I<errno> задаётся причина ошибки.

source: B<getunwind>() fails with the error B<EFAULT> if the unwind info can't be stored in the space specified by I<buf>.
ru: Вызов B<getunwind>() завершается с ошибкой B<EFAULT>, если раскрученную информацию невозможно сохранить в пространство, указанное I<buf>.

source: This system call is available since Linux 2.4.
ru: Данный системный вызов доступен в Linux начиная с версии 2.4.

source: This system call is Linux-specific, and is available only on the IA-64 architecture.
ru: Данный системный вызов есть только в Linux и доступен только на архитектуре IA-64.

source: This system call has been deprecated. The modern way to obtain the kernel's unwind data is via the B<vdso>(7).
ru: Данный системный вызов устарел. Современным способом получить раскрученные данные ядра является работа через B<vdso>(7).

source: Glibc does not provide a wrapper for this system call; in the unlikely event that you want to call it, use B<syscall>(2).
ru: В glibc нет обёрточной функции для данного системного вызова; в маловероятном случае, когда вам нужно использовать его, используйте B<syscall>(2).

source: getsockname - get socket name
ru: getsockname - получить имя сокета

source: B<getsockname>() returns the current address to which the socket I<sockfd> is bound, in the buffer pointed to by I<addr>. The I<addrlen> argument should be initialized to indicate the amount of space (in bytes) pointed to by I<addr>. On return it contains the actual size of the socket address.
ru: B<getsockname>() возвращает текущий адрес, к которому привязан сокет I<sockfd>, в буфере, указываемом I<addr>. В параметре I<addrlen> должно быть указано, сколько места выделено (в байтах), на которое указывает I<addr>. При возврате в этом параметре передается реальный размер адреса сокета.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD (B<getsockname>() first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD, (B<getsockname>() впервые появился в 4.2BSD).

source: getrlimit, setrlimit, prlimit - get/set resource limits
ru: getrlimit, setrlimit, prlimit - считывает/устанавливает ограничения использования ресурсов
