Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: getservent_r, getservbyname_r, getservbyport_r - get service entry (reentrant)
ru: getservent_r, getservbyname_r, getservbyport_r - возвращает запись о службе (реентерабельные версии)

source: B<getservent_r>(), B<getservbyname_r>(), B<getservbyport_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getservent_r>(), B<getservbyname_r>(), B<getservbyport_r>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: The B<getservent_r>(), B<getservbyname_r>(), and B<getservbyport_r>() functions are the reentrant equivalents of, respectively, B<getservent>(3), B<getservbyname>(3), and B<getservbyport>(3). They differ in the way that the I<servent> structure is returned, and in the function calling signature and return value. This manual page describes just the differences from the nonreentrant functions.
ru: Функции B<getservent_r>(), B<getservbyname_r>() и B<getservbyport_r>() являются реентерабельными эквивалентами B<getservent>(3), B<getservbyname>(3) и B<getservbyport>(3), соответственно. Они отличаются способом возврата структуры I<servent> и списком параметров и типом возвращаемого значения. В этой справочной странице описаны только различия с нереентерабельными функциями.

source: Instead of returning a pointer to a statically allocated I<servent> structure as the function result, these functions copy the structure into the location pointed to by I<result_buf>.
ru: Вместо возврата указателя на статически выделенную структуру I<servent> в качестве результата эти функции копируют структуру в расположение, указанное I<result_buf>.

source: The I<buf> array is used to store the string fields pointed to by the returned I<servent> structure. (The nonreentrant functions allocate these strings in static storage.) The size of this array is specified in I<buflen>. If I<buf> is too small, the call fails with the error B<ERANGE>, and the caller must try again with a larger buffer. (A buffer of length 1024 bytes should be sufficient for most applications.)
ru: Массив I<buf> используется для хранения строковых полей из возвращаемой структуры I<servent> (нереентерабельные функции выделяют эти строки из статического хранилища). Размер данного массива задаётся в I<buflen>. Если I<buf> слишком мал, то вызов завершается с ошибкой B<ERANGE>, вызывающий должен его повторить с большим буфером (для большинства приложений должно быть достаточно буфера длиной 1024 байт).

source: If the function call successfully obtains a service record, then I<*result> is set pointing to I<result_buf>; otherwise, I<*result> is set to NULL.
ru: Если вызов получил запись о службе, то I<*result> указывает на I<result_buf>; в противном случае I<*result> устанавливается в NULL.

source: On success, these functions return 0. On error, they return one of the positive error numbers listed in errors.
ru: При успешном выполнении эти функции возвращают 0. При ошибке возвращается одно из положительных значений ошибок.

source: On error, record not found (B<getservbyname_r>(), B<getservbyport_r>()), or end of input (B<getservent_r>()) I<result> is set to NULL.
ru: При ошибке, отсутствии записи (B<getservbyname_r>(), B<getservbyport_r>()) или конце данных (B<getservent_r>()) значение I<result> равно NULL.

source: (B<getservent_r>()) No more records in database.
ru: (B<getservent_r>()) Больше нет записей в базе данных.

source: I<buf> is too small. Try again with a larger buffer (and increased I<buflen>).
ru: Размер I<buf> слишком мал. Попробуйте ещё раз с большим буфером (и увеличенным значением I<buflen>).

source: These functions are GNU extensions. Functions with similar names exist on some other systems, though typically with different calling signatures.
ru: Эти функции являются расширениями GNU. Функции с похожими именами есть и в других системах, хотя и с другим набором параметров.

source: The program below uses B<getservbyport_r>() to retrieve the service record for the port and protocol named in its first command-line argument. If a third (integer) command-line argument is supplied, it is used as the initial value for I<buflen>; if B<getservbyport_r>() fails with the error B<ERANGE>, the program retries with larger buffer sizes. The following shell session shows a couple of sample runs:
ru: Программа, представленная ниже, использует B<getservbyport_r>() для получения записи о службе для заданного порта и протокола, указанных в командной строке. Если задан и третий параметр (целое), то он используется как начальное значение I<buflen>; если B<getservbyport_r>() завершается с ошибкой B<ERANGE>, то программа повторяет попытки с большими значениями буфера. Пара примеров работы в сеансовой оболочке:

source: $B< ./a.out 7 tcp 1> ERANGE! Retrying with larger buffer getservbyport_r() returned: 0 (success) (buflen=87) s_name=echo; s_proto=tcp; s_port=7; aliases= $B< ./a.out 77777 tcp> getservbyport_r() returned: 0 (success) (buflen=1024) Call failed/record not found
ru: $B< ./a.out 7 tcp 1> ERANGE! Повтор с большим буфером getservbyport_r() returned: 0 (success) (buflen=87) s_name=echo; s_proto=tcp; s_port=7; aliases= $B< ./a.out 77777 tcp> getservbyport_r() returned: 0 (success) (buflen=1024) Ошибка вызова/запись не найдена

source: if (argc E<lt> 3) { printf("Usage: %s port-num proto-name [buflen]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 3) { printf("Использование: %s ном-порта имя-прото [длина-буф]\en", argv[0]); exit(EXIT_FAILURE); }

source: if (buflen E<gt> MAX_BUF) { printf("Exceeded buffer limit (%d)\en", MAX_BUF); exit(EXIT_FAILURE); }
ru: if (buflen E<gt> MAX_BUF) { printf("Превышен размер буфера (%d)\en", MAX_BUF); exit(EXIT_FAILURE); }

source: erange_cnt = 0; do { s = getservbyport_r(port, protop, &result_buf, buf, buflen, &result); if (s == ERANGE) { if (erange_cnt == 0) printf("ERANGE! Retrying with larger buffer\en"); erange_cnt++;
ru: erange_cnt = 0; do { s = getservbyport_r(port, protop, &result_buf, buf, buflen, &result); if (s == ERANGE) { if (erange_cnt == 0) printf("ERANGE! Повтор с большим буфером\en"); erange_cnt++;

source: /* Increment a byte at a time so we can see exactly what size buffer was required */
ru: /* Увеличиваем по байту за раз для того, чтобы мы могли точно узнать какой размер буфера требуется */

source: if (buflen E<gt> MAX_BUF) { printf("Exceeded buffer limit (%d)\en", MAX_BUF); exit(EXIT_FAILURE); } } } while (s == ERANGE);
ru: if (buflen E<gt> MAX_BUF) { printf("Превышен размер буфера (%d)\en", MAX_BUF); exit(EXIT_FAILURE); } } } while (s == ERANGE);

source: if (s != 0 || result == NULL) { printf("Call failed/record not found\en"); exit(EXIT_FAILURE); }
ru: if (s != 0 || result == NULL) { printf("Ошибка вызова/запись не найдена\en"); exit(EXIT_FAILURE); }

source: gethostid, sethostid - get or set the unique identifier of the current host
ru: gethostid, sethostid - возвращает или назначает уникальный идентификатор текущего узла

source: B<gethostid>() and B<sethostid>() respectively get or set a unique 32-bit identifier for the current machine. The 32-bit identifier is intended to be unique among all UNIX systems in existence. This normally resembles the Internet address for the local machine, as returned by B<gethostbyname>(3), and thus usually never needs to be set.
ru: Функции B<gethostid>() и B<sethostid>(), соответственно, возвращают и устанавливают уникальный 32-битный идентификатор текущей машины. Данный 32-битный идентификатор считается уникальным среди всех существующих систем UNIX. Обычно это напоминает Интернет-адрес локальной машины, возвращаемый B<gethostbyname>(3), и поэтому, как правило, его не нужно изменять.

source: The B<sethostid>() call is restricted to the superuser.
ru: Только суперпользователь может вызывать B<sethostid>().

source: B<gethostid>() returns the 32-bit identifier for the current host as set by B<sethostid>().
ru: Функция B<gethostid>() возвращает 32-битный идентификатор текущего узла, установленный B<sethostid>().

source: On success, B<sethostid>() returns 0; on error, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<sethostid>() возвращает 0; при ошибке — -1, а в I<errno> задаётся код ошибки.

source: B<sethostid>() can fail with the following errors:
ru: Вызов B<sethostid>() может завершиться со следующими ошибками:

source: The caller did not have permission to write to the file used to store the host ID.
ru: Вызывающий не имеет прав на запись в файл, используемый для хранения ID узла.

source: The calling process's effective user or group ID is not the same as its corresponding real ID.
ru: Эффективный идентификатор пользователя или группы вызывающего процесса не совпадает с его соответствующим реальным идентификатором.

source: 4.2BSD; these functions were dropped in 4.4BSD. SVr4 includes B<gethostid>() but not B<sethostid>().
ru: 42BSD; эти функции удалены в 4.4BSD. В SVr4 содержится B<gethostid>(), но отсутствует B<sethostid>().

source: POSIX.1-2001 and POSIX.1-2008 specify B<gethostid>() but not B<sethostid>().
ru: В POSIX.1-2001 и POSIX.1-2008 определена B<gethostid>(), но отсутствует B<sethostid>().

source: In the glibc implementation, the I<hostid> is stored in the file I</etc/hostid>. (In glibc versions before 2.2, the file I</var/adm/hostid> was used.)
ru: В реализации glibc I<hostid> сохраняет значение в файле I</etc/hostid> (в glibc до версии 2.2 используется файл I</var/adm/hostid>).

source: In the glibc implementation, if B<gethostid>() cannot open the file containing the host ID, then it obtains the hostname using B<gethostname>(2), passes that hostname to B<gethostbyname_r>(3) in order to obtain the host's IPv4 address, and returns a value obtained by bit-twiddling the IPv4 address. (This value may not be unique.)
ru: В реализации glibc, если B<gethostid>() не может открыть файл, содержащий ID узла, она получает имя узла с помощью B<gethostname>(2), передаёт это имя B<gethostbyname_r>(3) для получения адреса IPv4 узла, и возвращает значение, получаемое преобразованием битов полученного адреса IPv4 (такое значение может быть не уникально).

source: It is impossible to ensure that the identifier is globally unique.
ru: Невозможно достоверно сказать, что идентификатор является глобально уникальным.

source: getgrouplist - get list of groups to which a user belongs
ru: getgrouplist - возвращает список групп, в которые входит пользователь

source: B<getgrouplist>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<getgrouplist>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE

source: The B<getgrouplist>() function scans the group database (see B<group>(5)) to obtain the list of groups that I<user> belongs to. Up to I<*ngroups> of these groups are returned in the array I<groups>.
ru: Функция B<getgrouplist>() просматривает базу данных групп (смотрите B<group>(5)) для составления списка групп, в которые входит пользователь I<user>. В возвращаемом массиве I<groups> может быть до I<*ngroups> групп.

source: If it was not among the groups defined for I<user> in the group database, then I<group> is included in the list of groups returned by B<getgrouplist>(); typically this argument is specified as the group ID from the password record for I<user>.
ru: Если в базе данных групп отсутствуют группы, определённые для I<user>, то в список групп, возвращаемый B<getgrouplist>(), включается I<group>; обычно, это аргумент задаётся в виде ID группы из записи пароля I<user>.

source: The I<ngroups> argument is a value-result argument: on return it always contains the number of groups found for I<user>, including I<group>; this value may be greater than the number of groups stored in I<groups>.
ru: Аргумент I<ngroups> является аргументом-результатом: при возврате в нём всегда содержится количество группы, найденных для I<user> включая I<group>; данное значение может быть больше, чем количество групп, хранящихся в I<groups>.

source: If the number of groups of which I<user> is a member is less than or equal to I<*ngroups>, then the value I<*ngroups> is returned.
ru: Если количество групп, в которых I<user> является членом, меньше или равно I<*ngroups>, то возвращается значение I<*ngroups>.

source: If the user is a member of more than I<*ngroups> groups, then B<getgrouplist>() returns -1. In this case, the value returned in I<*ngroups> can be used to resize the buffer passed to a further call B<getgrouplist>().
ru: Если пользователь является членом более чем I<*ngroups> групп, то B<getgrouplist>() возвращает -1. В этом случае значение, возвращаемое в I<*ngroups>, можно использовать для подстройки размера буфера, передаваемого в последующий вызов B<getgrouplist>().

source: This function is present since glibc 2.2.4.
ru: Эта функция доступна в glibc с версии 2.2.4.

source: This function is nonstandard; it appears on most BSDs.
ru: Эта функция является нестандартной; она присутствует в большинстве BSD.

source: In glibc versions before 2.3.3, the implementation of this function contains a buffer-overrun bug: it returns the complete list of groups for I<user> in the array I<groups>, even when the number of groups exceeds I<*ngroups>.
ru: В glibc до версии 2.3.3 в реализации этой функции содержится ошибка переполнения буфера: она возвращает полный список групп для I<user> в массиве I<groups> даже когда количество групп превышает I<*ngroups>.

source: The program below displays the group list for the user named in its first command-line argument. The second command-line argument specifies the I<ngroups> value to be supplied to B<getgrouplist>(). The following shell session shows examples of the use of this program:
ru: Программа, показанная далее, печатает список групп для пользователя из первого аргумента командной строки. Во втором аргументе задаётся значение I<ngroups>, передаваемое B<getgrouplist>(). Вот примеры работы этой программы:

source: $B< ./a.out cecilia 0> getgrouplist() returned -1; ngroups = 3 $B< ./a.out cecilia 3> ngroups = 3 16 (dialout) 33 (video) 100 (users)
ru: $B< ./a.out cecilia 0> getgrouplist() вернула -1; ngroups = 3 $B< ./a.out cecilia 3> ngroups = 3 16 (dialout) 33 (video) 100 (users)

source: if (argc != 3) { fprintf(stderr, "Usage: %s E<lt>userE<gt> E<lt>ngroupsE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 3) { fprintf(stderr, "Использование: %s E<lt>пользовательE<gt> E<lt>ngroupsE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Fetch passwd structure (contains first group ID for user) */
ru: /* получаем структуру passwd (содержит ID первичной группы пользователя) */

source: /* Retrieve group list */
ru: /* получаем список групп */

source: if (getgrouplist(argv[1], pw-E<gt>pw_gid, groups, &ngroups) == -1) { fprintf(stderr, "getgrouplist() returned -1; ngroups = %d\en", ngroups); exit(EXIT_FAILURE); }
ru: if (getgrouplist(argv[1], pw-E<gt>pw_gid, groups, &ngroups) == -1) { fprintf(stderr, "getgrouplist() вернула -1; ngroups = %d\en", ngroups); exit(EXIT_FAILURE); }

source: /* Display list of retrieved groups, along with group names */
ru: /* печатаем список полученных групп вместе с именами групп */

source: getw, putw - input and output of words (ints)
ru: getw, putw - ввод и вывод слов (int)

source: Since glibc 2.3.3:
ru: Начиная с glibc 2.3.3:

source: _XOPEN_SOURCE && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: Before glibc 2.3.3:
ru: До glibc 2.3.3:

source: B<getw>() reads a word (that is, an I<int>) from I<stream>. It's provided for compatibility with SVr4. We recommend you use B<fread>(3) instead.
ru: Функция B<getw>() читает слово (то есть, I<int>) из I<stream>. Она предоставляется для совместимости с SVr4. Вместо неё рекомендуется использовать B<fread>(3).

source: B<putw>() writes the word I<w> (that is, an I<int>) to I<stream>. It is provided for compatibility with SVr4, but we recommend you use B<fwrite>(3) instead.
ru: Функция B<putw>() записывает слово I<w> (то есть, I<int>) в I<stream>. Она предоставляется для совместимости с SVr4; вместо неё рекомендуется использовать B<fwrite>(3).

source: Normally, B<getw>() returns the word read, and B<putw>() returns 0. On error, they return B<EOF>.
ru: Обычно, B<getw>() возвращает прочитанное слово, а B<putw>() возвращает 0. При ошибках они возвращают B<EOF>.

source: SVr4, SUSv2. Not present in POSIX.1.
ru: SVr4, SUSv2. Отсутствуют в POSIX.1.

source: The value returned on error is also a legitimate data value. B<ferror>(3) can be used to distinguish between the two cases.
ru: Значение, возвращаемое при ошибке, также является корректным значением. Для точного определения ошибки можно использовать B<ferror>(3).

source: getpwent, setpwent, endpwent - get password file entry
ru: getpwent, setpwent, endpwent - получает запись из файла паролей

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии gibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<getpwent>() function returns a pointer to a structure containing the broken-out fields of a record from the password database (e.g., the local password file I</etc/passwd>, NIS, and LDAP). The first time B<getpwent>() is called, it returns the first entry; thereafter, it returns successive entries.
ru: Функция B<getpwent>() возвращает указатель на структуру, содержащую разделённую на поля запись базы данных паролей (например, локального файла паролей I</etc/passwd>, NIS и LDAP). При первом вызове B<getpwent>() возвращает первую запись; при следующих последовательно возвращаются остальные записи.

source: The B<setpwent>() function rewinds to the beginning of the password database.
ru: Функция B<setpwent>() возвращается к началу базы данных паролей.

source: The B<endpwent>() function is used to close the password database after all processing has been performed.
ru: Функция B<endpwent>() используется для закрытия базы данных паролей при завершении процесса обработки.

source: For more information about the fields of this structure, see B<passwd>(5).
ru: Подробней о полях этой структуры смотрите в B<passwd>(5).

source: The B<getpwent>() function returns a pointer to a I<passwd> structure, or NULL if there are no more entries or an error occurred. If an error occurs, I<errno> is set appropriately. If one wants to check I<errno> after the call, it should be set to zero before the call.
ru: Функция B<getpwent>() возвращает указатель на структуру I<passwd> или NULL, если подходящих записей не найдено или возникла ошибка. При ошибке I<errno> устанавливается в соответствующее значение. Если нужно проверять переменную I<errno> после вызова, то перед этим нужно присвоить ей нулевое значение.

source: The return value may point to a static area, and may be overwritten by subsequent calls to B<getpwent>(), B<getpwnam>(3), or B<getpwuid>(3). (Do not pass the returned pointer to B<free>(3).)
ru: Возвращаемое значение может указывать на статическую область и может быть перезаписано при последующих вызовах B<getpwent>(), B<getpwnam>(3) или B<getpwuid>(3) (не передавайте полученный указатель B<free>(3)).

source: In the above table, I<pwent> in I<race:pwent> signifies that if any of the functions B<setpwent>(), B<getpwent>(), or B<endpwent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<pwent> в I<race:pwgent> означает, что если в нескольких нитях программы одновременно используются функции B<setpwent>(), B<getpwent>() или B<endpwent>(), то может возникнуть состязательность по данным.

source: getnameinfo - address-to-name translation in protocol-independent manner
ru: getnameinfo - перевод адреса в имя не зависящим от протокола способом

source: B<getnameinfo>(): Since glibc 2.22: _POSIX_C_SOURCE E<gt>= 201112L Glibc 2.21 and earlier: _POSIX_C_SOURCE
ru: B<getnameinfo>(): начиная с glibc 2.22: _POSIX_C_SOURCE E<gt>= 201112L в glibc 2.21 и старее: _POSIX_C_SOURCE

source: The B<getnameinfo>() function is the inverse of B<getaddrinfo>(3): it converts a socket address to a corresponding host and service, in a protocol-independent manner. It combines the functionality of B<gethostbyaddr>(3) and B<getservbyport>(3), but unlike those functions, B<getnameinfo>() is reentrant and allows programs to eliminate IPv4-versus-IPv6 dependencies.
ru: Функция B<getnameinfo>() выполняет операцию, обратную B<getaddrinfo>(3); она преобразует адрес сокета в соответствующие узел и службу, способом, который не зависит от протокола. Она сочетает в себе действия функций B<gethostbyaddr>(3) и B<getservbyport>(3), но в отличии от этих функций B<getnameinfo>() реентерабельна и позволяет программам не зависеть от типа IPv4 и IPv6.

source: The I<addr> argument is a pointer to a generic socket address structure (of type I<sockaddr_in> or I<sockaddr_in6>) of size I<addrlen> that holds the input IP address and port number. The arguments I<host> and I<serv> are pointers to caller-allocated buffers (of size I<hostlen> and I<servlen> respectively) into which B<getnameinfo>() places null-terminated strings containing the host and service names respectively.
ru: Аргумент I<addr> — это указатель на обобщённую структуру адреса сокета (типа I<sockaddr_in> или I<sockaddr_in6>) размером I<addrlen>, которая содержит IP-адрес и номер порта. Аргументы I<host> и I<serv> указывают на выделенные вызывающим буферы (размером I<hostlen> и I<servlen>, соответственно), в которые B<getnameinfo>() помещает строки (заканчивающееся null), содержащие имя узла и службы, соответственно.

source: The caller can specify that no hostname (or no service name) is required by providing a NULL I<host> (or I<serv>) argument or a zero I<hostlen> (or I<servlen>) argument. However, at least one of hostname or service name must be requested.
ru: Вызывающий может указать, что имя узла (или службы) не требуется, указав в аргументе I<host> (или I<serv>) NULL или в I<hostlen> (или I<servlen>) значение 0. Однако, по крайней мере один параметр, имя узла или службы, должно быть запрошено.

source: The I<flags> argument modifies the behavior of B<getnameinfo>() as follows:
ru: Аргумент I<flags> меняет поведение функции B<getnameinfo>() следующим образом:

source: If set, then an error is returned if the hostname cannot be determined.
ru: Если этот флаг установлен, то возвращается ошибка, если имя машины не может быть определено.

source: If set, then the service is datagram (UDP) based rather than stream (TCP) based. This is required for the few ports (512\(en514) that have different services for UDP and TCP.
ru: Если этот флаг установлен, то сначала используется имя службы на основе дейтаграмм (UDP), а не потоков (TCP). Это требуется для немногих портов (512\(en514), которые имеют различные службы для UDP и TCP.

source: If set, return only the hostname part of the fully qualified domain name for local hosts.
ru: Если этот флаг установлен, то возвращается только часть имени машины от полностью определённого доменного имени (FQDN) для локальных машин.

source: If set, then the numeric form of the hostname is returned. (When not set, this will still happen in case the node's name cannot be determined.)
ru: Если этот флаг установлен, то имя узла возвращается в числовой форме (если этот флаг не установлен, то это также произойдёт в случае, когда имя узла невозможно определить).
