Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The original Linux B<getgid>() and B<getegid>() system calls supported only 16-bit group IDs. Subsequently, Linux 2.4 added B<getgid32>() and B<getegid32>(), supporting 32-bit IDs. The glibc B<getgid>() and B<getegid>() wrapper functions transparently deal with the variations across kernel versions.
ru: Первоначальные версии системных вызовов B<getgid>() и B<getegid>() в Linux поддерживали только 16-битные идентификаторы групп. Позднее в Linux 2.4 были добавлены вызовы B<getgid32>() и B<getegid32>(), поддерживающие 32-битные идентификаторы. В glibc обёрточные функции B<getgid>() и B<getegid>() работают одинаково вне зависимости от версий ядра.

source: On Alpha, instead of a pair of B<getgid>() and B<getegid>() system calls, a single B<getxgid>() system call is provided, which returns a pair of real and effective GIDs. The glibc B<getgid>() and B<getegid>() wrapper functions transparently deal with this. See B<syscall>(2) for details regarding register mapping.
ru: На Alpha вместо пары системных вызовов B<getgid>() и B<getegid>() предоставляется один B<getxgid>(), который возвращает пару реальный и эффективный GID. Обёрточные функции glibc B<getgid>() и B<getegid>() скрывают это. Подробности об отображении регистров смотрите в B<syscall>(2).

source: getdents, getdents64 - get directory entries
ru: getdents, getdents64 - возвращает записи каталога

source: I<Note>: There are no glibc wrappers for these system calls; see NOTES.
ru: I<Замечание>: В glibc нет обёрточных функций для этих системных вызовов; смотрите ЗАМЕЧАНИЯ.

source: These are not the interfaces you are interested in. Look at B<readdir>(3) for the POSIX-conforming C library interface. This page documents the bare kernel system call interfaces.
ru: Это не те функции, которые должны представлять для вас интерес. Смотрите описание функции B<readdir>(3), которая является интерфейсом библиотеки языка C, соответствующим стандарту POSIX. В этой странице описаны минимальные интерфейсы системных вызовов ядра.

source: The system call B<getdents>() reads several I<linux_dirent> structures from the directory referred to by the open file descriptor I<fd> into the buffer pointed to by I<dirp>. The argument I<count> specifies the size of that buffer.
ru: Системный вызов B<getdents>() читает несколько структур I<linux_dirent> из каталога, на который указывает открытый файловый дескриптор I<fd>, в буфер, указанный в I<dirp>. В аргументе I<count> задаётся размер этого буфера.

source: The I<linux_dirent> structure is declared as follows:
ru: Структура I<linux_dirent> определена следующим образом:

source: struct linux_dirent { unsigned long d_ino; /* Inode number */ unsigned long d_off; /* Offset to next I<linux_dirent> */ unsigned short d_reclen; /* Length of this I<linux_dirent> */ char d_name[]; /* Filename (null-terminated) */ /* length is actually (d_reclen - 2 - offsetof(struct linux_dirent, d_name)) */ /* char pad; // Zero padding byte char d_type; // File type (only since Linux // 2.6.4); offset is (d_reclen - 1) */ }
ru: struct linux_dirent { unsigned long d_ino; /* номер иноды */ unsigned long d_off; /* смещение до следующей I<linux_dirent> */ unsigned short d_reclen; /* длина этой I<linux_dirent> */ char d_name[]; /* имя файла (в конце null) */ /* реальная длина (d_reclen - 2 - offsetof(struct linux_dirent, d_name)) */ /* char pad; // нулевой байт заполнения char d_type; // тип файла (только начиная с Linux // 2.6.4); смещение (d_reclen - 1) */ }

source: I<d_ino> is an inode number. I<d_off> is the distance from the start of the directory to the start of the next I<linux_dirent>. I<d_reclen> is the size of this entire I<linux_dirent>. I<d_name> is a null-terminated filename.
ru: В I<d_ino> указан номер inode. В I<d_off> задаётся расстояние от начала каталога до начала следующей I<linux_dirent>. В I<d_reclen> указывается размер данного I<linux_dirent> целиком. В I<d_name> задаётся имя файла, завершающееся null.

source: I<d_type> is a byte at the end of the structure that indicates the file type. It contains one of the following values (defined in I<E<lt>dirent.hE<gt>>):
ru: I<d_type> \(em байт в конце структуры, которым определяется тип файла. В нём содержится одно из следующих значений (определённых в I<E<lt>dirent.hE<gt>>):

source: This is a block device.
ru: Блочное устройство.

source: This is a character device.
ru: Символьное устройство.

source: This is a directory.
ru: Каталог.

source: This is a named pipe (FIFO).
ru: Именованный канал (FIFO).

source: This is a symbolic link.
ru: Символическая ссылка.

source: This is a regular file.
ru: Обычный файл.

source: This is a UNIX domain socket.
ru: Доменный сокет UNIX.

source: The file type is unknown.
ru: Неизвестный тип.

source: The I<d_type> field is implemented since Linux 2.6.4. It occupies a space that was previously a zero-filled padding byte in the I<linux_dirent> structure. Thus, on kernels up to and including 2.6.3, attempting to access this field always provides the value 0 (B<DT_UNKNOWN>).
ru: Поле I<d_type> появилось начиная с Linux 2.6.4. Оно занимает пространство, которое раньше в структуре I<linux_dirent> было отведено для заполняющего байта с нулевым значением. Поэтому при работе с ядрами до версии 2.6.3 включительно при чтении значения этого поля всегда возвращается 0 (B<DT_UNKNOWN>).

source: Currently, only some filesystems (among them: Btrfs, ext2, ext3, and ext4) have full support for returning the file type in I<d_type>. All applications must properly handle a return of B<DT_UNKNOWN>.
ru: В настоящее время, только файловые системы (среди которых: Btrfs, ext2, ext3 и ext4) поддерживают возврат типа файла в I<d_type>. Все приложения должны правильно обрабатывать возвращаемое значение B<DT_UNKNOWN>.

source: The original Linux B<getdents>() system call did not handle large filesystems and large file offsets. Consequently, Linux 2.4 added B<getdents64>(), with wider types for the I<d_ino> and I<d_off> fields. In addition, B<getdents64>() supports an explicit I<d_type> field.
ru: Первоначальный системный вызов Linux B<getdents>() не работал с файловыми системами большого размера и большими смещениями файлов. В связи с этим, в Linux 2.4 была добавлен B<getdents64>(), с более широкими типами полей I<d_ino> и I<d_off>. Также B<getdents64>() поддерживает явно указанное поле I<d_type>.

source: The B<getdents64>() system call is like B<getdents>(), except that its second argument is a pointer to a buffer containing structures of the following type:
ru: Системный вызов B<getdents64>() подобен B<getdents>(), за исключением того, что второй аргумент является указателем на буфер, содержащий структуры следующего типа:

source: struct linux_dirent64 { ino64_t d_ino; /* 64-bit inode number */ off64_t d_off; /* 64-bit offset to next structure */ unsigned short d_reclen; /* Size of this dirent */ unsigned char d_type; /* File type */ char d_name[]; /* Filename (null-terminated) */ };
ru: struct linux_dirent64 { ino64_t d_ino; /* 64-битный номер иноды */ off64_t d_off; /* 64-битное смещение следующей структуры */ unsigned short d_reclen; /* размер этой dirent */ unsigned char d_type; /* тип файла */ char d_name[]; /* имя файла (в конце null) */ };

source: On success, the number of bytes read is returned. On end of directory, 0 is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При нормальном завершении работы возвращается количество прочитанных байт. При достижении конца каталога возвращается 0. В случае ошибки возвращается -1 и значение I<errno> устанавливается соответствующим образом.

source: Invalid file descriptor I<fd>.
ru: Неверный файловый дескриптор I<fd>.

source: Argument points outside the calling process's address space.
ru: Аргумент указывает за пределы адресного пространства вызывающего процесса.

source: Result buffer is too small.
ru: Буфер результата слишком мал.

source: No such directory.
ru: Заданный каталог не существует.

source: File descriptor does not refer to a directory.
ru: Файловый дескриптор указывает не на каталог.

source: Glibc does not provide a wrapper for these system calls; call them using B<syscall>(2). You will need to define the I<linux_dirent> or I<linux_dirent64> structure yourself. However, you probably want to use B<readdir>(3) instead.
ru: В glibc нет обёртки для данных системных вызовов; запускайте их с помощью B<syscall>(2). Структуру I<linux_dirent> или I<linux_dirent64> нужно определить самостоятельно. Однако лучше использовать B<readdir>(3).

source: These calls supersede B<readdir>(2).
ru: Данные системные вызовы заместил B<readdir>(2).

source: EXAMPLE
ru: ПРИМЕР

source: The program below demonstrates the use of B<getdents>(). The following output shows an example of what we see when running this program on an ext2 directory:
ru: В программе, показанной далее, демонстрируется использование B<getdents>(). В следующем выводе показан пример запуска этой программы с каталогом с ext2:

source: Program source
ru: Исходный код программы

source: #define _GNU_SOURCE #include E<lt>dirent.hE<gt> /* Defines DT_* constants */ #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/stat.hE<gt> #include E<lt>sys/syscall.hE<gt>
ru: #define _GNU_SOURCE #include E<lt>dirent.hE<gt> /* Определяет константы DT_* */ #include E<lt>fcntl.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/stat.hE<gt> #include E<lt>sys/syscall.hE<gt>

source: getsockopt, setsockopt - get and set options on sockets
ru: getsockopt, setsockopt - получить или установить флаги сокета

source: B<#include E<lt>sys/types.hE<gt>> /* See NOTES */ B<#include E<lt>sys/socket.hE<gt>>
ru: B<#include E<lt>sys/types.hE<gt>> /* смотрите ЗАМЕЧАНИЯ */ B<#include E<lt>sys/socket.hE<gt>>

source: B<getsockopt>() and B<setsockopt>() manipulate options for the socket referred to by the file descriptor I<sockfd>. Options may exist at multiple protocol levels; they are always present at the uppermost socket level.
ru: B<getsockopt>() и B<setsockopt>() управляют параметрами сокета, на который указывает файловый дескриптор I<sockfd>. Параметры могут быть из различных уровней протоколов; они всегда присутствуют на самом верхнем уровне сокета.

source: When manipulating socket options, the level at which the option resides and the name of the option must be specified. To manipulate options at the sockets API level, I<level> is specified as B<SOL_SOCKET>. To manipulate options at any other level the protocol number of the appropriate protocol controlling the option is supplied. For example, to indicate that an option is to be interpreted by the B<TCP> protocol, I<level> should be set to the protocol number of B<TCP>; see B<getprotoent>(3).
ru: При работе с параметрами сокета должен быть указан уровень, на котором находится этот параметр и его имя. Для работы с параметрами на уровне API сокета в I<level> указывается значение B<SOL_SOCKET>. Для работы с параметрами на любом другом уровне, этим вызовам передаётся номер соответствующего протокола, который они контролируют. Например, для указания, что параметр должен интерпретироваться протоколом B<TCP>, в I<level> нужно указать номер протокола B<TCP>; смотрите B<getprotoent>(3).

source: The arguments I<optval> and I<optlen> are used to access option values for B<setsockopt>(). For B<getsockopt>() they identify a buffer in which the value for the requested option(s) are to be returned. For B<getsockopt>(), I<optlen> is a value-result argument, initially containing the size of the buffer pointed to by I<optval>, and modified on return to indicate the actual size of the value returned. If no option value is to be supplied or returned, I<optval> may be NULL.
ru: Аргументы I<optval> и I<optlen> используются в B<setsockopt>() для доступа к значениям параметров. Для B<getsockopt>() они задают буфер, в который нужно поместить запрошенное значение параметра при возврате. У B<getsockopt>() в аргументе I<optlen> изначально содержится размер буфера, на который указывает I<optval>, а при завершении в нём содержится реальный размер возвращаемого значения. Если значение параметра не указывается или возвращается, то I<optval> может быть NULL.

source: I<Optname> and any specified options are passed uninterpreted to the appropriate protocol module for interpretation. The include file I<E<lt>sys/socket.hE<gt>> contains definitions for socket level options, described below. Options at other protocol levels vary in format and name; consult the appropriate entries in section 4 of the manual.
ru: Аргумент I<optname> и все указанные параметры без изменений передаются для интерпретации соответствующему модулю протоколов. Файл I<E<lt>sys/socket.hE<gt>> содержит определения параметров уровня сокета; их описание дано ниже. Параметры на других уровнях протоколов различаются по формату и по имени. Обращайтесь к соответствующим файлам раздела 4 справочных страниц.

source: Most socket-level options utilize an I<int> argument for I<optval>. For B<setsockopt>(), the argument should be nonzero to enable a boolean option, or zero if the option is to be disabled.
ru: Большинство параметров уровня сокета используют тип I<int> для аргумента I<optval>. Чтобы установить параметр логического типа аргумент B<setsockopt>() должен быть ненулевым, и ноль, если нужно отключить этот параметр.

source: For a description of the available socket options see B<socket>(7) and the appropriate protocol man pages.
ru: Описание доступных параметров сокетов находится в B<socket>(7) и соответствующих протоколам справочных страницах.

source: On success, zero is returned for the standard options. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении при стандартных параметрах возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Netfilter allows the programmer to define custom socket options with associated handlers; for such options, the return value on success is the value returned by the handler.
ru: Netfilter позволяет программисту определять собственные параметры сокетов со привязанными обработчиками; для таких параметров при успешном выполнении возвращается значение, полученное от обработчика.

source: The address pointed to by I<optval> is not in a valid part of the process address space. For B<getsockopt>(), this error may also be returned if I<optlen> is not in a valid part of the process address space.
ru: Адрес, на который указывает I<optval>, не находится в разрешённой части адресного пространства процесса. Для B<getsockopt>() эта ошибка может также появиться, если I<optlen> выходит за пределы адресного пространства процесса.

source: I<optlen> invalid in B<setsockopt>(). In some cases this error can also occur for an invalid value in I<optval> (e.g., for the B<IP_ADD_MEMBERSHIP> option described in B<ip>(7)).
ru: Неправильное значение I<optlen> в B<setsockopt>(). В некоторых случаях эта ошибка может возникать из-за неправильного значения в I<optval> (например, для параметра B<IP_ADD_MEMBERSHIP>, описанного в B<ip>(7)).

source: The option is unknown at the level indicated.
ru: Неизвестный параметр для указанного уровня.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD (these system calls first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD (данные системные вызовы впервые появились в 4.2BSD).

source: POSIX.1 does not require the inclusion of I<E<lt>sys/types.hE<gt>>, and this header file is not required on Linux. However, some historical (BSD) implementations required this header file, and portable applications are probably wise to include it.
ru: В POSIX.1 не требуется включение I<E<lt>sys/types.hE<gt>>, и этот заголовочный файл не требуется в Linux. Однако, для некоторых старых реализаций (BSD) требует данный файл, и в переносимых приложениях для предосторожности, вероятно, лучше его указать.

source: Several of the socket options should be handled at lower levels of the system.
ru: Некоторые параметры сокетов должны обрабатываться на более низких уровнях системы.

source: getcpu - determine CPU and NUMA node on which the calling thread is running
ru: getcpu - определяет ЦП и узел NUMA, на котором выполняется вызывающая нить

source: The B<getcpu>() system call identifies the processor and node on which the calling thread or process is currently running and writes them into the integers pointed to by the I<cpu> and I<node> arguments. The processor is a unique small integer identifying a CPU. The node is a unique small identifier identifying a NUMA node. When either I<cpu> or I<node> is NULL nothing is written to the respective pointer.
ru: Системный вызов B<getcpu>() определяет процессор и узел, на котором вызывающая нить или процесс выполняются в данный момент и записывает их в виде целых чисел в память, на которую указывают аргументы I<cpu> и I<node>. Процессор представляется в виде уникального малого целого числа, закреплённого за определённым ЦП. Узел представляется в виде уникального идентификатора, закреплённого за определённым узлом NUMA. Если значение I<cpu> или I<node> равно NULL, то по соответствующему указателю ничего не записывается.

source: The third argument to this system call is nowadays unused, and should be specified as NULL unless portability to Linux 2.6.23 or earlier is required (see NOTES).
ru: Третий аргумент этого системного вызова в настоящее время не используется и указываться как NULL, не требуется переносимость на Linux 2.6.23 или более младшие версии (смотрите ЗАМЕЧАНИЯ).

source: The information placed in I<cpu> is guaranteed to be current only at the time of the call: unless the CPU affinity has been fixed using B<sched_setaffinity>(2), the kernel might change the CPU at any time. (Normally this does not happen because the scheduler tries to minimize movements between CPUs to keep caches hot, but it is possible.) The caller must allow for the possibility that the information returned in I<cpu> and I<node> is no longer current by the time the call returns.
ru: Информация, помещаемая в I<cpu>, будет находиться там только на время вызова: unless the CPU affinity has been fixed using B<sched_setaffinity>(2), the kernel might change the CPU at any time. (Normally this does not happen because the scheduler tries to minimize movements between CPUs to keep caches hot, but it is possible.) Достоверность информации, помещаемой в I<cpu>, гарантируется только на момент вызова: если привязка ЦП не была изменена с помощью B<sched_setaffinity>(2), то ядро может сменить ЦП в любой момент (обычно этого не происходит, так как планировщик пытается минимизировать перемещения задач между процессорами для поддержания актуальности кэша,но всё же это возможно). Вызывающий должен быть готов к ситуации, что информация, возвращённая в I<cpu> и I<node>, может потерять актуальность уже после возврата из вызова.

source: On success, 0 is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Arguments point outside the calling process's address space.
ru: Аргументы указывают за пределы адресного пространства вызывающего процесса.

source: B<getcpu>() was added in kernel 2.6.19 for x86-64 and i386. Library support was added in glibc 2.29 (Earlier glibc versions did not provide a wrapper for this system call, necessitating the use of B<syscall>(2).)
ru: Системный вызов B<getcpu>() добавлен в ядре 2.6.19 для x86-64 и i386. Библиотечная поддержка добавлена в glibc 2.29 (ранние версии glibc не содержали обёрточную функцию для этого вызова, нужно было использовать B<syscall>(2)).

source: B<getcpu>() is Linux-specific.
ru: Вызов B<getcpu>() есть только в Linux.

source: Linux makes a best effort to make this call as fast as possible. (On some architectures, this is done via an implementation in the B<vdso>(7).) The intention of B<getcpu>() is to allow programs to make optimizations with per-CPU data or for NUMA optimization.
ru: Linux старается выполнить данный вызов как можно быстрее (на некоторых архитектурах это делается через реализацию в B<vdso>(7)). Предназначение B<getcpu>() — позволить программам оптимизировать обработку данных на разных ЦП или выполнить оптимизации NUMA.

source: The I<tcache> argument is unused since Linux 2.6.24. In earlier kernels, if this argument was non-NULL, then it specified a pointer to a caller-allocated buffer in thread-local storage that was used to provide a caching mechanism for B<getcpu>(). Use of the cache could speed B<getcpu>() calls, at the cost that there was a very small chance that the returned information would be out of date. The caching mechanism was considered to cause problems when migrating threads between CPUs, and so the argument is now ignored.
ru: Аргумент I<tcache> не используется начиная с Linux 2.6.24. В более старых ядрах, если этот аргумент не равнялся NULL, то в нём задавался указатель на буфер, выделяемый вызывающим в локальном хранилище нити, который использовался для работы механизма кэширования B<getcpu>(). Использование кэша могло бы увеличить скорость работы B<getcpu>(), и расплатой за это было бы возникновение очень маленькой вероятности, что возвращаемая информация устарела. Кэширующий механизм стал рассматриваться как вызывающий проблемы при перемещения нитей между ЦП, и поэтому теперь этот аргумент игнорируется.

source: gettid - get thread identification
ru: gettid - получить идентификатор нити

source: B<gettid>() returns the caller's thread ID (TID). In a single-threaded process, the thread ID is equal to the process ID (PID, as returned by B<getpid>(2)). In a multithreaded process, all threads have the same PID, but each one has a unique TID. For further details, see the discussion of B<CLONE_THREAD> in B<clone>(2).
ru: B<gettid>() возвращает идентификатор нити вызвавшего процесса (TID). В случае процесса с одной нитью он эквивалентен идентификатору процесса (PID, возвращаемому B<getpid>(2)). В случае процесса с множеством нитей все нити имеют одинаковый идентификатор процесса PID, но каждый из них имеет уникальный идентификатор нити TID. Для получения подробной информации см. обсуждение B<CLONE_THREAD> B<clone>(2).

source: On success, returns the thread ID of the calling thread.
ru: При успешном выполнении возвращается идентификатор вызывающей нити.

source: This call is always successful.
ru: Этот системный вызов всегда выполняется успешно.

source: The B<gettid>() system call first appeared on Linux in kernel 2.4.11. Library support was added in glibc 2.30. (Earlier glibc versions did not provide a wrapper for this system call, necessitating the use of B<syscall>(2).)
ru: Системный вызов B<gettid>() впервые появился в ядре Linux 2.4.11. Библиотечная поддержка добавлена в glibc 2.30. (ранние версии glibc не содержали обёрточную функцию для этого вызова, нужно было использовать B<syscall>(2)).

source: B<gettid>() is Linux-specific and should not be used in programs that are intended to be portable.
ru: Вызов B<gettid>() является специфичным для Linux и не должен использоваться в переносимых программах.

source: The thread ID returned by this call is not the same thing as a POSIX thread ID (i.e., the opaque value returned by B<pthread_self>(3)).
ru: Идентификатор нити, возвращаемый этим вызовом, не является идентификатором нити POSIX (т.е., значением с произвольной структурой, возвращаемым B<pthread_self>(3)).
