Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: User Commands
ru: Пользовательские команды

source: NAME
ru: ИМЯ

source: getent - get entries from Name Service Switch libraries
ru: getent - возвращает записи из библиотек диспетчера службы имён

source: SYNOPSIS
ru: ОБЗОР

source: B<getent\ [>I<option>B<]...\ >I<database>B<\ >I<key>B<...>
ru: B<getent\ [>I<параметр>B<]...\ >I<база_данных>B<\ >I<ключ>B<...>

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The B<getent> command displays entries from databases supported by the Name Service Switch libraries, which are configured in I</etc/nsswitch.conf>. If one or more I<key> arguments are provided, then only the entries that match the supplied keys will be displayed. Otherwise, if no I<key> is provided, all entries will be displayed (unless the database does not support enumeration).
ru: Команда B<getent> отображает записи из баз данных, поддерживаемых библиотеками диспетчера службы имён (Name Service Switch), которые настраиваются в I</etc/nsswitch.conf>. Если указан один или более аргументов I<ключ>, то отображаются только записи, совпадающие с заданными ключами. В противном случае, если I<ключ> не указан, то будут показаны все записи (если база данных поддерживает перечисление).

source: The I<database> may be any of those supported by the GNU C Library, listed below:
ru: Значение I<базы данных> может быть любым из поддерживаемых библиотекой GNU C:

source: When no I<key> is provided, use B<sethostent>(3), B<gethostent>(3), and B<endhostent>(3) to enumerate the hosts database. This is identical to using B<hosts>. When one or more I<key> arguments are provided, pass each I<key> in succession to B<getaddrinfo>(3) with the address family B<AF_UNSPEC>, enumerating each socket address structure returned.
ru: Если I<ключ> не указан, то используются B<sethostent>(3), B<gethostent>(3) и B<endhostent>(3) для перечисления базы данных hosts. Идентично использованию B<hosts>. Если указан один или более I<ключ>, то каждый I<ключ> последовательно передаётся в B<getaddrinfo>(3) с адресным семейством B<AF_UNSPEC>, которая возвращает каждую перечисляемую адресную структуру сокета.

source: Same as B<ahosts>, but use the address family B<AF_INET>.
ru: То же, что и B<ahosts>, но используется адресное семейство B<AF_INET>.

source: Same as B<ahosts>, but use the address family B<AF_INET6>. The call to B<getaddrinfo>(3) in this case includes the B<AI_V4MAPPED> flag.
ru: То же, что и B<ahosts>, но используется адресное семейство B<AF_INET6>. В этом случае при вызове B<getaddrinfo>(3) включается флаг B<AI_V4MAPPED>.

source: When no I<key> is provided, use B<setaliasent>(3), B<getaliasent>(3), and B<endaliasent>(3) to enumerate the aliases database. When one or more I<key> arguments are provided, pass each I<key> in succession to B<getaliasbyname>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setaliasent>(3), B<getaliasent>(3) и B<endaliasent>(3) для перечисления базы данных aliases. Если указан один или более I<ключ>, то каждый I<ключ> последовательно передаётся в B<getaliasbyname>(3) и показывается результат.

source: When one or more I<key> arguments are provided, pass each I<key> in succession to B<ether_aton>(3) and B<ether_hostton>(3) until a result is obtained, and display the result. Enumeration is not supported on B<ethers>, so a I<key> must be provided.
ru: Если указан один или более I<ключ>, то каждый I<ключ> последовательно передаётся в B<ether_aton>(3) и B<ether_hostton>(3), пока не будет возвращён результат, и показывается результат. Перечисление B<ethers> не поддерживается, поэтому I<ключ> обязателен.

source: When no I<key> is provided, use B<setgrent>(3), B<getgrent>(3), and B<endgrent>(3) to enumerate the group database. When one or more I<key> arguments are provided, pass each numeric I<key> to B<getgrgid>(3) and each nonnumeric I<key> to B<getgrnam>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setgrent>(3), B<getgrent>(3) и B<endgrent>(3) для перечисления базы данных group. Если указан один или более I<ключ>, то каждый числовой I<ключ> передаётся в B<getgrgid>(3) и каждый не числовой I<ключ> в B<getgrnam>(3) и показывается результат.

source: When no I<key> is provided, use B<setsgent>(3), B<getsgent>(3), and B<endsgent>(3) to enumerate the gshadow database. When one or more I<key> arguments are provided, pass each I<key> in succession to B<getsgnam>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setsgent>(3), B<getsgent>(3) и B<endsgent>(3) для перечисления базы данных gshadow. Если указан один или более I<ключ>, то каждый I<ключ> последовательно передаётся в B<getsgnam>(3) и показывается результат.

source: When no I<key> is provided, use B<sethostent>(3), B<gethostent>(3), and B<endhostent>(3) to enumerate the hosts database. When one or more I<key> arguments are provided, pass each I<key> to B<gethostbyaddr>(3) or B<gethostbyname2>(3), depending on whether a call to B<inet_pton>(3) indicates that the I<key> is an IPv6 or IPv4 address or not, and display the result.
ru: Если I<ключ> не указан, используется B<sethostent>(3), B<gethostent>(3) и B<endhostent>(3) для перечисления базы данных hosts. Если указан один или более I<ключ>, то каждый I<ключ> последовательно передаётся в B<gethostbyaddr>(3) или B<gethostbyname2>(3), в зависимости от результата вызова B<inet_pton>(3), определяющего, является ли I<ключ> адресом IPv6 или IPv4, и показывается результат.

source: When one or more I<key> arguments are provided, pass each I<key> in succession to B<getgrouplist>(3) and display the result. Enumeration is not supported on B<initgroups>, so a I<key> must be provided.
ru: Если указан один или более I<ключ>, то каждый I<ключ> последовательно передаётся в B<getgrouplist>(3) и показывается результат. Перечисление B<initgroups> не поддерживается, поэтому I<ключ> обязателен.

source: When one I<key> is provided, pass the I<key> to B<setnetgrent>(3) and, using B<getnetgrent>(3) display the resulting string triple (I<hostname>, I<username>, I<domainname>). Alternatively, three I<keys> may be provided, which are interpreted as the I<hostname>, I<username> and I<domainname> to match to a netgroup name via B<innetgr>(3). Enumeration is not supported on B<netgroup>, so either one or three I<keys> must be provided.
ru: Если указан один I<ключ>, то он передаётся в B<setnetgrent>(3) и, с помощью B<getnetgrent>(3), отображается полученная строковая тройка (I<hostname>, I<username>, I<domainname>). В противном случае могут быть указаны три I<ключа>, которые рассматриваются как I<hostname>, I<username> и I<domainname> для поиска имени netgroup посредством B<innetgr>(3). Перечисление B<netgroup> не поддерживается, поэтому должен быть указан либо один, либо три I<ключа>.

source: When no I<key> is provided, use B<setnetent>(3), B<getnetent>(3), and B<endnetent>(3) to enumerate the networks database. When one or more I<key> arguments are provided, pass each numeric I<key> to B<getnetbyaddr>(3) and each nonnumeric I<key> to B<getnetbyname>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setnetent>(3), B<getnetent>(3) и B<endnetent>(3) для перечисления базы данных networks. Если указан один или более I<ключ>, то каждый числовой I<ключ> передаётся в B<getnetbyaddr>(3) и каждый не числовой I<ключ> в B<getnetbyname>(3) и показывается результат.

source: When no I<key> is provided, use B<setpwent>(3), B<getpwent>(3), and B<endpwent>(3) to enumerate the passwd database. When one or more I<key> arguments are provided, pass each numeric I<key> to B<getpwuid>(3) and each nonnumeric I<key> to B<getpwnam>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setpwent>(3), B<getpwent>(3) и B<endpwent>(3) для перечисления базы данных passwd. Если указан один или более I<ключ>, то каждый числовой I<ключ> передаётся в B<getpwuid>(3) и каждый не числовой I<ключ> в B<getpwnam>(3) и показывается результат.

source: When no I<key> is provided, use B<setprotoent>(3), B<getprotoent>(3), and B<endprotoent>(3) to enumerate the protocols database. When one or more I<key> arguments are provided, pass each numeric I<key> to B<getprotobynumber>(3) and each nonnumeric I<key> to B<getprotobyname>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setprotoent>(3), B<getprotoent>(3) и B<endprotoent>(3) для перечисления базы данных protocols. Если указан один или более I<ключ>, то каждый числовой I<ключ> передаётся в B<getprotobynumber>(3) и каждый не числовой I<ключ> в B<getprotobyname>(3) и показывается результат.

source: When no I<key> is provided, use B<setrpcent>(3), B<getrpcent>(3), and B<endrpcent>(3) to enumerate the rpc database. When one or more I<key> arguments are provided, pass each numeric I<key> to B<getrpcbynumber>(3) and each nonnumeric I<key> to B<getrpcbyname>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setrpcent>(3), B<getrpcent>(3) и B<endrpcent>(3) для перечисления базы данных rpc. Если указан один или более I<ключ>, то каждый числовой I<ключ> передаётся в B<getrpcbynumber>(3) и каждый не числовой I<ключ> в B<getrpcbyname>(3) и показывается результат.

source: When no I<key> is provided, use B<setservent>(3), B<getservent>(3), and B<endservent>(3) to enumerate the services database. When one or more I<key> arguments are provided, pass each numeric I<key> to B<getservbynumber>(3) and each nonnumeric I<key> to B<getservbyname>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setservent>(3), B<getservent>(3) и B<endservent>(3) для перечисления базы данных services. Если указан один или более I<ключ>, то каждый числовой I<ключ> передаётся в B<getservbynumber>(3) и каждый не числовой I<ключ> в B<getservbyname>(3) и показывается результат.

source: When no I<key> is provided, use B<setspent>(3), B<getspent>(3), and B<endspent>(3) to enumerate the shadow database. When one or more I<key> arguments are provided, pass each I<key> in succession to B<getspnam>(3) and display the result.
ru: Если I<ключ> не указан, используется B<setspent>(3), B<getspent>(3) и B<endspent>(3) для перечисления базы данных shadow. Если указан один или более I<ключ>, то каждый I<ключ> последовательно передаётся в B<getspnam>(3) и показывается результат.

source: OPTIONS
ru: ПАРАМЕТРЫ

source: B<-s\ >I<service>, B<--service\ >I<service>
ru: B<-s\ >I<служба>, B<--service\ >I<служба>

source: Override all databases with the specified service. (Since glibc 2.2.5.)
ru: Заменить все базы данных с указанной службой (начиная с glibc 2.2.5).

source: B<-s\ >I<database>B<:>I<service>, B<--service\ >I<database>B<:>I<service>
ru: B<-s\ >I<база_данных>B<:>I<служба>, B<--service\ >I<база_данных>B<:>I<служба>

source: Override only specified databases with the specified service. The option may be used multiple times, but only the last service for each database will be used. (Since glibc 2.4.)
ru: Заменить только указанные базы данных с указанной службой. Параметр может указываться несколько раз, но будет использоваться только последняя служба для каждой базы данных (начиная с glibc 2.4).

source: Disables IDN encoding in lookups for B<ahosts>/B<getaddrinfo>(3) (Since glibc-2.13.)
ru: Отключить кодировку IDN в поиске B<ahosts>/B<getaddrinfo>(3) (начиная с glibc-2.13).

source: Print a usage summary and exit.
ru: Показать справку по использованию и завершить работу.

source: Print a short usage summary and exit.
ru: Показать краткую справку по использованию и завершить работу.

source: Print the version number, license, and disclaimer of warranty for B<getent>.
ru: Показать номер версии, лицензию и уведомление о гарантиях для B<getent>.

source: EXIT STATUS
ru: КОД РЕЗУЛЬТАТА

source: One of the following exit values can be returned by B<getent>:
ru: Программа B<getent> может возвращать один из следующих кодов завершения:

source: Command completed successfully.
ru: Команда успешно выполнена.

source: Missing arguments, or I<database> unknown.
ru: Отсутствуют аргументы или неизвестная I<база данных>.

source: One or more supplied I<key> could not be found in the I<database>.
ru: Один или более указанных I<ключей> невозможно найти в I<базе данных>.

source: Enumeration not supported on this I<database>.
ru: Перечисление не поддерживается в этой I<базе данных>.

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: glob - globbing pathnames
ru: glob - шаблоны полных имён файлов

source: Long ago, in UNIX\ V6, there was a program I</etc/glob> that would expand wildcard patterns. Soon afterward this became a shell built-in.
ru: Давным-давно, во времена UNIX\ V6, существовала программа I</etc/glob>, которая могла раскрывать шаблоны подстановки. Очень скоро она стала встроенной функцией командной оболочки.

source: These days there is also a library routine B<glob>(3) that will perform this function for a user program.
ru: В наши дни существует библиотечная функция B<glob>(3), которая выполняет эту задачу для пользовательских программ.

source: The rules are as follows (POSIX.2, 3.13).
ru: Следующие правила приведены в соответствии со стандартом POSIX.2, 3.13.

source: Wildcard matching
ru: Тип шаблона

source: A string is a wildcard pattern if it contains one of the characters \(aq?\(aq, \(aq*\(aq or \(aq[\(aq. Globbing is the operation that expands a wildcard pattern into the list of pathnames matching the pattern. Matching is defined by:
ru: Строка считается шаблоном подстановки, если содержит в себе один из символов \(aq?\(aq, \(aq*\(aq или \(aq[\(aq. Globbing — это операция, которая раскрывает шаблон подстановки в список имён путей, соответствующих данному шаблону. Соответствие определяется следующими правилами:

source: A \(aq?\(aq (not between brackets) matches any single character.
ru: \(aq?\(aq (без учета кавычек) соответствует любому одному символу.

source: A \(aq*\(aq (not between brackets) matches any string, including the empty string.
ru: \(aq*\(aq (без учета кавычек) соответствует любой строке, включая пустую строку.

source: B<Character classes>
ru: B<Классы символов>

source: An expression "I<[...]>" where the first character after the leading \(aq[\(aq is not an \(aq!\(aq matches a single character, namely any of the characters enclosed by the brackets. The string enclosed by the brackets cannot be empty; therefore \(aq]\(aq can be allowed between the brackets, provided that it is the first character. (Thus, "I<[][!]>" matches the three characters \(aq[\(aq, \(aq]\(aq and \(aq!\(aq.)
ru: Выражение «I<[...]>», где первый символ после открывающей \(aq[\(aq - не равен \(aq!\(aq, соответствует одному символу, который может быть любым символом из набора, находящегося внутри скобок. Строка внутри скобок не может быть пустой, таким образом, \(aq]\(aq также может находиться внутри скобок и выступать в качестве первого символа (то есть «I<[][!]>» будет соответствовать трем символам \(aq[\(aq, \(aq]\(aq и \(aq!\(aq).

source: B<Ranges>
ru: B<Диапазоны>

source: There is one special convention: two characters separated by \(aq-\(aq denote a range. (Thus, "I<[A-Fa-f0-9]>" is equivalent to "I<[ABCDEFabcdef0123456789]>".) One may include \(aq-\(aq in its literal meaning by making it the first or last character between the brackets. (Thus, "I<[]-]>" matches just the two characters \(aq]\(aq and \(aq-\(aq, and "I<[--0]>" matches the three characters \(aq-\(aq, \(aq.\(aq, \(aq0\(aq, since \(aq/\(aq cannot be matched.)
ru: Два символа, разделённые \(aq-\(aq, образуют особое выражение — диапазон (то есть «I<[A-Fa-f0-9]>» будет эквивалентен записи «I<[ABCDEFabcdef0123456789]>»). Сюда также может входить и сам \(aq-\(aq в качестве начального или конечного символа (то есть «I<[]-]>» будет соответствовать только двум символам - \(aq]\(aq и \(aq-\(aq, а «I<[--0]>» — трем символам: \(aq-\(aq, \(aq.\(aq, \(aq0\(aq, так как \(aq/\(aq не может быть использован).

source: B<Complementation>
ru: B<Разность множеств>

source: An expression "I<[!...]>" matches a single character, namely any character that is not matched by the expression obtained by removing the first \(aq!\(aq from it. (Thus, "I<[!]a-]>" matches any single character except \(aq]\(aq, \(aqa\(aq and \(aq-\(aq.)
ru: Выражение «I<[!...]>» соответствует одному любому символу, который не входит в множество, получаемое путем удаления первого \(aq!\(aq (то есть «I<[!]a-]>» будет соответствовать любому одному символу за исключением \(aq]\(aq, \(aqa\(aq и \(aq-\(aq).

source: One can remove the special meaning of \(aq?\(aq, \(aq*\(aq and \(aq[\(aq by preceding them by a backslash, or, in case this is part of a shell command line, enclosing them in quotes. Between brackets these characters stand for themselves. Thus, "I<[[?*\e]>" matches the four characters \(aq[\(aq, \(aq?\(aq, \(aq*\(aq and \(aq\e\(aq.
ru: Специальное значение \(aq?\(aq, \(aq*\(aq и \(aq[\(aq может быть аннулировано путём экранирования их обратной косой чертой или, в случае, когда они являются частью оболочки командной строки, путём заключения их в кавычки. Внутри квадратных скобок эти символы не имеют специального значения. Таким образом, «I<[[?*\e]>» совпадает с четырьмя символами \(aq[\(aq, \(aq?\(aq, \(aq*\(aq и \(aq\e\(aq.

source: Pathnames
ru: Полные составные пути

source: Globbing is applied on each of the components of a pathname separately. A \(aq/\(aq in a pathname cannot be matched by a \(aq?\(aq or \(aq*\(aq wildcard, or by a range like "I<[.-0]>". A range containing an explicit \(aq/\(aq character is syntactically incorrect. (POSIX requires that syntactically incorrect patterns are left unchanged.)
ru: Раскрытие (globbing) применяется к каждой части полного составного имени файла отдельно. Символ \(aq/\(aq в полном имени файла не может совпадать с шаблоном \(aq?\(aq или \(aq*\(aq, а только с диапазоном подобным «I<[.-0]>». Диапазон не может включать в себя символ \(aq/\(aq, поскольку это будет считаться синтаксической ошибкой (в POSIX требуется, чтобы синтаксически некорректные шаблоны не изменялись).

source: If a filename starts with a \(aq.\(aq, this character must be matched explicitly. (Thus, I<rm\ *> will not remove .profile, and I<tar\ c\ *> will not archive all your files; I<tar\ c\ .> is better.)
ru: Если имя файла начинается с \(aq.\(aq, то этот символ должен быть обязательно указан в шаблоне (таким образом, I<rm\ *> не удалит .profile, а I<tar\ c\ *> заархивирует не все файлы; лучше использовать I<tar\ c\ .>).

source: Empty lists
ru: Пустые списки

source: The nice and simple rule given above: "expand a wildcard pattern into the list of matching pathnames" was the original UNIX definition. It allowed one to have patterns that expand into an empty list, as in
ru: Выше было приведено простое и замечательное правило из оригинального определения UNIX: «раскрытие шаблона — это операция, преобразующая шаблон в список соответствующих ему полных имён файлов». Оно допускает существование шаблона, соответствующего пустому списку, например:

source: where perhaps no *.gif files are present (and this is not an error). However, POSIX requires that a wildcard pattern is left unchanged when it is syntactically incorrect, or the list of matching pathnames is empty. With I<bash> one can force the classical behavior using this command:
ru: где, возможно, файлы *.gif на самом деле отсутствуют (и это не ошибка). Несмотря на это, в POSIX требуется, чтобы шаблон, синтаксически неправильный или раскрывающийся в пустой список путей к файлам, оставался без изменений. В I<bash> можно принудительно включить классическое поведение с помощью команды:

source: (Similar problems occur elsewhere. For example, where old scripts have
ru: Подобная проблема может проявиться вновь. Например, там, где в старых сценариях использовалось

source: new scripts require
ru: в новых сценариях используется

source: to avoid error messages from I<rm> called with an empty argument list.)
ru: для избежания сообщений об ошибках I<rm>, вызванного с пустым списком аргументов.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: Regular expressions
ru: Регулярные выражения

source: Note that wildcard patterns are not regular expressions, although they are a bit similar. First of all, they match filenames, rather than text, and secondly, the conventions are not the same: for example, in a regular expression \(aq*\(aq means zero or more copies of the preceding thing.
ru: Заметим, что шаблоны не являются регулярными выражениями, хотя и похожи. Во-первых, они используются для выявления совпадений в именах файлов, а не в тексте. Во-вторых, используются разные соглашения: например, регулярное выражение \(aq*\(aq означает ноль или более копий предшествующему символу.

source: Now that regular expressions have bracket expressions where the negation is indicated by a \(aq^\(aq, POSIX has declared the effect of a wildcard pattern "I<[^...]>" to be undefined.
ru: Теперь, когда в квадратных скобках у регулярных выражений для отрицания используется \(aq^\(aq, в POSIX оговаривается, что эффект шаблона «I<[^...]>» не определён.

source: Character classes and internationalization
ru: Классы символов и интернационализация

source: Of course ranges were originally meant to be ASCII ranges, so that "I<[\ -%]>" stands for "I<[\ !"#$%]>" and "I<[a-z]>" stands for "any lowercase letter". Some UNIX implementations generalized this so that a range X-Y stands for the set of characters with code between the codes for X and for Y. However, this requires the user to know the character coding in use on the local system, and moreover, is not convenient if the collating sequence for the local alphabet differs from the ordering of the character codes. Therefore, POSIX extended the bracket notation greatly, both for wildcard patterns and for regular expressions. In the above we saw three types of items that can occur in a bracket expression: namely (i) the negation, (ii) explicit single characters, and (iii) ranges. POSIX specifies ranges in an internationally more useful way and adds three more types:
ru: Изначально диапазоны были определены для символов ASCII, так что «I<[\ -%]>» соответствует «I<[\ !"#$%]>», а «I<[a-z]>» соответствует «любому символу нижнего регистра». В некоторых реализациях UNIX это обобщено так, что диапазон X-Y соответствует всем символам, коды которых находятся между X и Y. Однако, это требует знания способа кодирования символов в локальной системе и, более того, не удобно, если последовательность сортировки для локального алфавита отличается от последовательности кодов символов. Поэтому в POSIX значительно расширено обозначение квадратных скобок как для шаблонов файлов, так и для регулярных выражений. Выше встретилось три типа выражений в скобках: отрицание (i), указанный явно символ (ii) и диапазон (iii). В POSIX диапазоны определены в более удобном с точки зрения интернационализации виде, а также добавлены три новых типа:

source: (iii) Ranges X-Y comprise all characters that fall between X and Y (inclusive) in the current collating sequence as defined by the B<LC_COLLATE> category in the current locale.
ru: (iii) Диапазоны X-Y включают в себя все символы, находящиеся между X и Y (включительно) в соответствии с текущей последовательностью сортировки, определённой в категории B<LC_COLLATE> текущей локали.

source: (iv) Named character classes, like
ru: (iv) Именованные классы символов, такие, как:

source: so that one can say "I<[[:lower:]]>" instead of "I<[a-z]>", and have things work in Denmark, too, where there are three letters past \(aqz\(aq in the alphabet. These character classes are defined by the B<LC_CTYPE> category in the current locale.
ru: Благодаря им можно указать значение «I<[[:lower:]]>» вместо «I<[a-z]>», и это будет работать для Дании, где в алфавите есть три буквы, стоящие после «z». Эти классы символов определяются категорией B<LC_CTYPE> текущей локали.
