Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The above functions are not thread-safe. Glibc adds reentrant versions
ru: Перечисленные выше функции нельзя использовать в нескольких нитях одновременно. В glibc добавлены реентерабельные версии.

source: _GNU_SOURCE || /* since glibc 2.19: */ _DEFAULT_SOURCE || /* glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: _GNU_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: These functions are GNU extensions, analogs of the functions of the same name without the _r suffix. The I<ubuf> argument gives these functions a place to store their result. On success, they return 0, and a pointer to the result is written in I<*ubufp>. On error, these functions return -1. There are no utmpx equivalents of the above functions. (POSIX.1 does not specify such functions.)
ru: Эти функции являются расширениями GNU, они аналогичны функциям с тем же именем без суффикса _r. В аргумент I<ubuf>, передаваемый этим функциям, помещается результат. При успешном выполнении они возвращают 0 и указатель на результат записывается в I<*ubufp>. При ошибке эти функции возвращают -1. Среди этих функций отсутствует эквиваленты utmpx (в POSIX.1 такие функции отсутствуют).

source: The following example adds and removes a utmp record, assuming it is run from within a pseudo terminal. For usage in a real application, you should check the return values of B<getpwuid>(3) and B<ttyname>(3).
ru: Нижеследующий пример добавляет и удаляет запись utmp, предполагается, что программа запущена с псевдотерминала. Для использования в реальном приложении необходимо проверять значения, возвращаемые B<getpwuid>(3) и B<ttyname>(3).

source: system("echo before adding entry:;who");
ru: system("echo перед добавлением записи:;who");

source: entry.ut_type = USER_PROCESS; entry.ut_pid = getpid(); strcpy(entry.ut_line, ttyname(STDIN_FILENO) + strlen("/dev/")); /* only correct for ptys named /dev/tty[pqr][0-9a-z] */ strcpy(entry.ut_id, ttyname(STDIN_FILENO) + strlen("/dev/tty")); time(&entry.ut_time); strcpy(entry.ut_user, getpwuid(getuid())-E<gt>pw_name); memset(entry.ut_host, 0, UT_HOSTSIZE); entry.ut_addr = 0; setutent(); pututline(&entry);
ru: entry.ut_type = USER_PROCESS; entry.ut_pid = getpid(); strcpy(entry.ut_line, ttyname(STDIN_FILENO) + strlen("/dev/")); /* правильные имена ptys только /dev/tty[pqr][0-9a-z] */ strcpy(entry.ut_id, ttyname(STDIN_FILENO) + strlen("/dev/tty")); time(&entry.ut_time); strcpy(entry.ut_user, getpwuid(getuid())-E<gt>pw_name); memset(entry.ut_host, 0, UT_HOSTSIZE); entry.ut_addr = 0; setutent(); pututline(&entry);

source: system("echo after adding entry:;who");
ru: system("echo после добавления записи:;who");

source: system("echo after removing entry:;who");
ru: system("echo после удаления записи:;who");

source: getrpcport - get RPC port number
ru: getrpcport - получение номера порта RPC

source: B<getrpcport>() returns the port number for version I<versnum> of the RPC program I<prognum> running on I<host> and using protocol I<proto>. It returns 0 if it cannot contact the portmapper, or if I<prognum> is not registered. If I<prognum> is registered but not with version I<versnum>, it will still return a port number (for some version of the program) indicating that the program is indeed registered. The version mismatch will be detected upon the first call to the service.
ru: Функция B<getrpcport>() возвращает номер порта для версии I<versnum> RPC-программы I<prognum>, работающей на I<host> и использующей протокол I<proto>. Она возвращает 0, если не может связаться с portmapper или если I<prognum> не зарегистрирована. Если же I<prognum> зарегистрирована, но не с версией I<versnum>, она все равно будет возвращать номер порта (с версией программы), указывая на то, что программа действительно зарегистрирована. Несоответствие версий будет зарегистрировано при первой попытке вызвать службу.

source: Not in POSIX.1. Present on the BSDs, Solaris, and many other systems.
ru: Нет в POSIX.1. Присутствует в BSD, Solaris и многих других системах.

source: gcvt - convert a floating-point number to a string
ru: gcvt - преобразовать число с плавающей точкой в строку

source: Since glibc 2.12:
ru: Начиная с glibc 2.12:

source: (_XOPEN_SOURCE\ E<gt>=\ 500) ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE
ru: (_XOPEN_SOURCE\ E<gt>=\ 500) ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версии glibc E<lt>= 2.19: */ _SVID_SOURCE

source: The B<gcvt>() function converts I<number> to a minimal length null-terminated ASCII string and stores the result in I<buf>. It produces I<ndigit> significant digits in either B<printf>(3) F format or E format.
ru: Функция B<gcvt>() преобразует I<number> в строку ASCII (с null в конце) минимальной длины и сохраняет результат в I<buf>. Она выдаёт I<ndigit> цифр со знаком в F или E формате, описанных в B<printf>(3).

source: The B<gcvt>() function returns the address of the string pointed to by I<buf>.
ru: Функция B<gcvt>() возвращает адрес строки, на которую указывает I<buf>.

source: Marked as LEGACY in POSIX.1-2001. POSIX.1-2008 removes the specification of B<gcvt>(), recommending the use of B<sprintf>(3) instead (though B<snprintf>(3) may be preferable).
ru: Отмечена в POSIX.1-2001 как УСТАРЕВШАЯ. В POSIX.1-2008 спецификация B<gcvt>() удалена, вместо них рекомендуется использовать B<sprintf>(3) (однако B<snprintf>(3) может быть предпочтительнее).

source: getcontext, setcontext - get or set the user context
ru: getcontext, setcontext - получить или установить пользовательский контекст

source: In a System V-like environment, one has the two types I<mcontext_t> and I<ucontext_t> defined in I<E<lt>ucontext.hE<gt>> and the four functions B<getcontext>(), B<setcontext>(), B<makecontext>(3), and B<swapcontext>(3) that allow user-level context switching between multiple threads of control within a process.
ru: В окружении, подобном SysV, существует два типа данных —I<mcontext_t> и I<ucontext_t>, которые определены в файле I<E<lt>ucontext.hE<gt>> и четыре функции — B<getcontext>(), B<setcontext>(), B<makecontext>(3) и B<swapcontext>(3), которые позволяют контексту пользовательского уровня переключаться между несколькими нитями внутри одного процесса.

source: The I<mcontext_t> type is machine-dependent and opaque. The I<ucontext_t> type is a structure that has at least the following fields:
ru: Тип I<mcontext_t> является машинно-зависимым и примитивным типом данных. Тип I<ucontext_t> является структурой, которая по крайней мере имеет следующие поля:

source: with I<sigset_t> and I<stack_t> defined in I<E<lt>signal.hE<gt>>. Here I<uc_link> points to the context that will be resumed when the current context terminates (in case the current context was created using B<makecontext>(3)), I<uc_sigmask> is the set of signals blocked in this context (see B<sigprocmask>(2)), I<uc_stack> is the stack used by this context (see B<sigaltstack>(2)), and I<uc_mcontext> is the machine-specific representation of the saved context, that includes the calling thread's machine registers.
ru: где I<sigset_t> и I<stack_t> определены в файле I<E<lt>signal.hE<gt>>. В этой структуре I<uc_link> указывает на контекст, к которому будет осуществлён переход, когда завершается текущий контекст (в случае, если текущий контекст был создан с помощью B<makecontext>(3)), в I<uc_sigmask> задаётся список сигналов, которые блокируются в этом контексте (см. B<sigprocmask>(2)), I<uc_stack> \(em это стек, который используется этим контекстом (см. B<sigaltstack>(2)), а I<uc_mcontext> является машинно-зависимым представлением сохранённого контекста, который содержит регистры вызываемой нити.

source: The function B<getcontext>() initializes the structure pointed at by I<ucp> to the currently active context.
ru: Функция B<getcontext>() инициализирует вышеописанную структуру, указывая через I<ucp> на текущий активный контекст.

source: The function B<setcontext>() restores the user context pointed at by I<ucp>. A successful call does not return. The context should have been obtained by a call of B<getcontext>(), or B<makecontext>(3), or passed as third argument to a signal handler.
ru: Функция B<setcontext>() восстанавливает пользовательский контекст, на который указывает I<ucp>. При успешном вызове управление не возвращается обратно. Контекст должен быть получен с помощью вызова B<getcontext>() или B<makecontext>(3) или передан как третий аргумент обработчика сигнала.

source: If the context was obtained by a call of B<getcontext>(), program execution continues as if this call just returned.
ru: Если контекст был получен через вызов B<getcontext>(), то выполнение программы продолжается как если бы этот вызов завершился простым возвратом.

source: If the context was obtained by a call of B<makecontext>(3), program execution continues by a call to the function I<func> specified as the second argument of that call to B<makecontext>(3). When the function I<func> returns, we continue with the I<uc_link> member of the structure I<ucp> specified as the first argument of that call to B<makecontext>(3). When this member is NULL, the thread exits.
ru: Если контекст был получен через вызов B<makecontext>(3), выполнение программы продолжается с помощью вызова функции I<func>, которая задаётся как второй аргумент вызова B<makecontext>(3). Когда происходит возврат из функции I<func>, выполнение продолжается с поля I<uc_link> структуры I<ucp>, которая задаётся как первый аргумент вызова B<makecontext>(3). Если это поле равно NULL, осуществляется выход из нити.

source: If the context was obtained by a call to a signal handler, then old standard text says that "program execution continues with the program instruction following the instruction interrupted by the signal". However, this sentence was removed in SUSv2, and the present verdict is "the result is unspecified".
ru: Если контекст был получен с помощью вызова обработчика сигнала, то старый текст стандарта говорит, что "выполнение программы продолжается с инструкции программы, которая следует за инструкцией, прерванной сигналом". Однако, этот текст был удалён в SUSv2 с вердиктом "результат не определён".

source: When successful, B<getcontext>() returns 0 and B<setcontext>() does not return. On error, both return -1 and set I<errno> appropriately.
ru: В случае успеха B<getcontext>() возвращает 0, а B<setcontext>() не возвращает ничего. В случае ошибки, возвращается -1 и значение I<errno> устанавливается соответствующим образом.

source: None defined.
ru: Не определены.

source: SUSv2, POSIX.1-2001. POSIX.1-2008 removes the specification of B<getcontext>(), citing portability issues, and recommending that applications be rewritten to use POSIX threads instead.
ru: SUSv2, POSIX.1-2001. В POSIX.1-2008 удалено определение B<getcontext>() со ссылкой на проблемы с переносимостью и рекомендацией переписать приложение с использование нитей POSIX.

source: The earliest incarnation of this mechanism was the B<setjmp>(3)/B<longjmp>(3) mechanism. Since that does not define the handling of the signal context, the next stage was the B<sigsetjmp>(3)/B<siglongjmp>(3) pair. The present mechanism gives much more control. On the other hand, there is no easy way to detect whether a return from B<getcontext>() is from the first call, or via a B<setcontext>() call. The user has to invent her own bookkeeping device, and a register variable won't do since registers are restored.
ru: В ранних версиях этого механизма использовался механизм B<setjmp>(3)/B<longjmp>(3). Так как в нём нет обработки контекста сигнала, было решено использовать следующий вариант пары B<sigsetjmp>(3)/B<siglongjmp>(3). Текущий механизм даёт много больше контроля. С другой стороны, не существует лёгкого способа определить какое из двух значений возвращает при первом запуске вызов B<getcontext>() или вызов B<setcontext>(). Пользователь должен придумать собственный способ и через регистровую переменную это сделать нельзя, так как значения регистров восстанавливаются.

source: When a signal occurs, the current user context is saved and a new context is created by the kernel for the signal handler. Do not leave the handler using B<longjmp>(3): it is undefined what would happen with contexts. Use B<siglongjmp>(3) or B<setcontext>() instead.
ru: Если возникнет сигнал, текущий пользовательский контекст сохраняется и для обработчика сигнала ядром создаётся новый контекст. Не выходите из этого обработчика, используя B<longjmp>(3) \(em неизвестно, что может случиться с контекстами. Вместо этого используйте вызовы B<siglongjmp>(3) или B<setcontext>().

source: grantpt - grant access to the slave pseudoterminal
ru: grantpt - разрешает доступ для подчинённому псевдотерминалу

source: Since glibc 2.24: _XOPEN_SOURCE\ E<gt>=\ 500 || (_XOPEN_SOURCE\ &&\ _XOPEN_SOURCE_EXTENDED)
ru: начиная с glibc 2.24: _XOPEN_SOURCE\ E<gt>=\ 500 || (_XOPEN_SOURCE\ &&\ _XOPEN_SOURCE_EXTENDED)

source: Glibc 2.23 and earlier: _XOPEN_SOURCE
ru: glibc 2.23 и старее: _XOPEN_SOURCE

source: The B<grantpt>() function changes the mode and owner of the slave pseudoterminal device corresponding to the master pseudoterminal referred to by I<fd>. The user ID of the slave is set to the real UID of the calling process. The group ID is set to an unspecified value (e.g., I<tty>). The mode of the slave is set to 0620 (crw--w----).
ru: Функция B<grantpt>() изменяет режим и владельца для устройства подчинённого псевдотерминала, соответствующего основному псевдотерминалу, на который ссылается I<fd>. Идентификатор пользователя подчинённого устанавливается в действительный UID вызывающего процесса. Идентификатор группы устанавливается в неопределенное значение (например, I<tty>). Права доступа к подчинённому псевдотерминала назначаются как 0620 (crw--w----).

source: The behavior of B<grantpt>() is unspecified if a signal handler is installed to catch B<SIGCHLD> signals.
ru: Поведение B<grantpt>() не определено, если установлен обработчик сигналов для перехвата сигналов B<SIGCHLD>.

source: When successful, B<grantpt>() returns 0. Otherwise, it returns -1 and sets I<errno> appropriately.
ru: При успешном выполнении B<grantpt>() возвращает 0. Иначе возвращается -1 и переменная I<errno> устанавливается соответствующим образом.

source: The corresponding slave pseudoterminal could not be accessed.
ru: Невозможно получить доступ к соответствующему подчинённому псевдотерминалу.

source: The I<fd> argument is not a valid open file descriptor.
ru: Аргумент I<fd> не является правильным открытым файловым дескриптором.

source: The I<fd> argument is valid but not associated with a master pseudoterminal.
ru: Значение I<fd> корректно, но не связано с основным псевдотерминалом.

source: B<grantpt>() is provided in glibc since version 2.1.
ru: Функция B<grantpt>() появилась в glibc начиная с версии 2.1.

source: This is part of the UNIX 98 pseudoterminal support, see B<pts>(4).
ru: Является частью поддержки псевдотерминалов UNIX 98 (смотрите B<pts>(4)).

source: Many systems implement this function via a set-user-ID helper binary called "pt_chown". On Linux systems with a devpts filesystem (present since Linux 2.2), the kernel normally sets the correct ownership and permissions for the pseudoterminal slave when the master is opened (B<posix_openpt>(3)), so that nothing must be done by B<grantpt>(). Thus, no such helper binary is required (and indeed it is configured to be absent during the glibc build that is typical on many systems).
ru: Многие системы реализуют эту функцию через вспомогательный исполняемый файл с установленным битом SUID, называемый «pt_chown». Благодаря файловой системе Linux devpts (начиная с Linux 2.2), ядро обычным образом устанавливает корректные значения владельца и права на подчинённый псевдотерминал когда открывается основной (B<posix_openpt>(3)), поэтому B<grantpt>() делать ничего не нужно. Таким образом, подобный вспомогательный файл не требуется ( и действительно, это значение пусто при сборке glibc, которая используется во многих системах).

source: getusershell, setusershell, endusershell - get permitted user shells
ru: getusershell, setusershell, endusershell - возвращают разрешённые оболочки пользователя

source: The B<getusershell>() function returns the next line from the file I</etc/shells>, opening the file if necessary. The line should contain the pathname of a valid user shell. If I</etc/shells> does not exist or is unreadable, B<getusershell>() behaves as if I</bin/sh> and I</bin/csh> were listed in the file.
ru: Функция B<getusershell>() возвращает следующую строку из файла I</etc/shells>, открывая его в случае необходимости. Строка должна содержать путь к допустимой оболочке пользователя.Если I</etc/shells> не существует или недоступен для чтения, то B<getusershell>() ведёт себя так, как если бы в файле были перечислены I</bin/sh> и I</bin/csh>.

source: The B<setusershell>() function rewinds I</etc/shells>.
ru: Функция B<setusershell>() переходит к началу I</etc/shells>.

source: The B<endusershell>() function closes I</etc/shells>.
ru: Функция B<endusershell>() закрывает I</etc/shells>.

source: The B<getusershell>() function returns NULL on end-of-file.
ru: Функция B<getusershell>() возвращает NULL или конец файла.

source: gsignal, ssignal - software signal facility
ru: gsignal, ssignal - программная фабрика сигналов

source: B<gsignal>(), B<ssignal>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _SVID_SOURCE
ru: B<gsignal>(), B<ssignal>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _SVID_SOURCE

source: Don't use these functions under Linux. Due to a historical mistake, under Linux these functions are aliases for B<raise>(3) and B<signal>(2), respectively.
ru: Не используйте эти функции в Linux. Из-за исторической ошибки, в Linux эти функции являются псевдонимами B<raise>(3) и B<signal>(2), соответственно.

source: Elsewhere, on System V-like systems, these functions implement software signaling, entirely independent of the classical B<signal>(2) and B<kill>(2) functions. The function B<ssignal>() defines the action to take when the software signal with number I<signum> is raised using the function B<gsignal>(), and returns the previous such action or B<SIG_DFL>. The function B<gsignal>() does the following: if no action (or the action B<SIG_DFL>) was specified for I<signum>, then it does nothing and returns 0. If the action B<SIG_IGN> was specified for I<signum>, then it does nothing and returns 1. Otherwise, it resets the action to B<SIG_DFL> and calls the action function with argument I<signum>, and returns the value returned by that function. The range of possible values I<signum> varies (often 1\(en15 or 1\(en17).
ru: В остальных, System V-подобных системах, эти функции реализуют программные сигналы, абсолютно отличающиеся от классических вызовов B<signal>(2) и B<kill>(2). Функция B<ssignal>() определяет действие при получении программного сигнала с номером I<signum>, выполняемое функцией B<gsignal>(), и возвращает предыдущее такое действие или B<SIG_DFL>. Функция B<gsignal>() делает следующее: если для сигнала I<signum> не было определено действие (или оно B<SIG_DFL>), то ничего не делается и возвращается 0. Если было определено действие B<SIG_IGN> для I<signum>, то ничего не делается и возвращается . Иначе, действие сбрасывается в B<SIG_DFL>, вызывается функция действия с параметром I<signum>, а также возвращается значение, возвращенное этой функцией. Диапазон возможных значений I<signum> различен (часто он равен 1\(en15 или 1\(en17).

source: These functions are available under AIX, DG/UX, HP-UX, SCO, Solaris, Tru64. They are called obsolete under most of these systems, and are broken under Linux libc and glibc. Some systems also have B<gsignal_r>() and B<ssignal_r>().
ru: Эти функции доступны в AIX, DG-UX, HP-UX, SCO, Solaris, Tru64. Они определены, как устаревшие в большинстве этих систем, и некорректны в Linux libc и glibc. В некоторых системах также есть функции B<gsignal_r>() и B<ssignal_r>().

source: getlogin, getlogin_r, cuserid - get username
ru: getlogin, getlogin_r, cuserid - возвращает имя пользователя

source: Since glibc 2.24: (_XOPEN_SOURCE && ! (_POSIX_C_SOURCE E<gt>= 200112L) || _GNU_SOURCE Up to and including glibc 2.23: _XOPEN_SOURCE
ru: Начиная с glibc 2.24: (_XOPEN_SOURCE && ! (_POSIX_C_SOURCE E<gt>= 200112L) || _GNU_SOURCE До glibc 2.23 включительно: _XOPEN_SOURCE

source: B<getlogin>() returns a pointer to a string containing the name of the user logged in on the controlling terminal of the process, or a null pointer if this information cannot be determined. The string is statically allocated and might be overwritten on subsequent calls to this function or to B<cuserid>().
ru: Функция B<getlogin>() возвращает указатель на строку, содержащую имя пользователя, вошедшего в систему c терминала, который является управляющим для процесса, или указатель null, если эта информация не может быть получена. Строка выделяется статически и может быть перезаписана при последующих вызовах этой функции или B<cuserid>().

source: B<getlogin_r>() returns this same username in the array I<buf> of size I<bufsize>.
ru: Функция B<getlogin_r>() возвращает то же имя пользователя, но в массиве I<buf> размером I<bufsize>.

source: B<cuserid>() returns a pointer to a string containing a username associated with the effective user ID of the process. If I<string> is not a null pointer, it should be an array that can hold at least B<L_cuserid> characters; the string is returned in this array. Otherwise, a pointer to a string in a static area is returned. This string is statically allocated and might be overwritten on subsequent calls to this function or to B<getlogin>().
ru: Функция B<cuserid>() возвращает указатель на строку, содержащую имя пользователя, связанное с идентификатором эффективного пользователя процесса. Если I<string> не равно указателю null, то значение должно быть массивом, который способен вместить как минимум B<L_cuserid> символов; строка возвращается в этом массиве. В противном случае возвращается указатель на строку в фиксированной области. Эта строка выделена статически и может быть перезаписана при последующих вызовах этой функции или функции B<getlogin>().

source: The macro B<L_cuserid> is an integer constant that indicates how long an array you might need to store a username. B<L_cuserid> is declared in I<E<lt>stdio.hE<gt>>.
ru: Макрос B<L_cuserid> является целочисленной константой, показывающей длину массива, который может понадобиться для хранения имени пользователя. B<L_cuserid> описан в I<E<lt>stdio.hE<gt>>.

source: These functions let your program identify positively the user who is running (B<cuserid>()) or the user who logged in this session (B<getlogin>()). (These can differ when set-user-ID programs are involved.)
ru: Эти функции позволяют программе точно определить работающего пользователя (B<cuserid>()) или пользователя этого сеанса (B<getlogin>()) (значения могут различаться, если у программы установлен бит set-user-ID).

source: For most purposes, it is more useful to use the environment variable B<LOGNAME> to find out who the user is. This is more flexible precisely because the user can set B<LOGNAME> arbitrarily.
ru: В большинстве случаев для определения пользователя полезнее использовать переменную окружения B<LOGNAME>, потому что пользователь может установить B<LOGNAME> каким угодно.
