Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: erange_cnt = 0; do { s = getprotobyname_r(argv[1], &result_buf, buf, buflen, &result); if (s == ERANGE) { if (erange_cnt == 0) printf("ERANGE! Retrying with larger buffer\en"); erange_cnt++;
ru: erange_cnt = 0; do { s = getprotobyname_r(argv[1], &result_buf, buf, buflen, &result); if (s == ERANGE) { if (erange_cnt == 0) printf("ERANGE! Повтор с большим буфером\en"); erange_cnt++;

source: printf("getprotobyname_r() returned: %s (buflen=%d)\en", (s == 0) ? "0 (success)" : (s == ENOENT) ? "ENOENT" : strerror(s), buflen);
ru: printf("результат getprotobyname_r(): %s (buflen=%d)\en", (s == 0) ? "0 (успешно)" : (s == ENOENT) ? "ENOENT" : strerror(s), buflen);

source: getenv, secure_getenv - get an environment variable
ru: getenv, secure_getenv - возвращают значения переменной окружения

source: The B<getenv>() function searches the environment list to find the environment variable I<name>, and returns a pointer to the corresponding I<value> string.
ru: Функция B<getenv>() ищет в списке окружения переменную окружения I<name> и возвращает указатель на соответствующую строку I<value>.

source: The GNU-specific B<secure_getenv>() function is just like B<getenv>() except that it returns NULL in cases where "secure execution" is required. Secure execution is required if one of the following conditions was true when the program run by the calling process was loaded:
ru: Специальная функция GNU B<secure_getenv>() работает также как B<getenv>(), но возвращает NULL, если требуется «безопасное выполнение». Безопасное выполнение требуется, если верно одно из следующих условий на момент загрузки программы вызывающего процесса:

source: the process's effective user ID did not match its real user ID or the process's effective group ID did not match its real group ID (typically this is the result of executing a set-user-ID or set-group-ID program);
ru: эффективный пользовательский ID процесса не совпадает с реальным пользовательским ID или эффективный групповой ID процесса не совпадает с реальным групповым ID (обычно в результате выполнения программы с установленным битом set-user-ID или set-group-ID);

source: the effective capability bit was set on the executable file; or
ru: у исполняемого файла установлен эффективный мандатный бит; или

source: the process has a nonempty permitted capability set.
ru: у процесса имеется непустой ограничивающий набор мандатов.

source: Secure execution may also be required if triggered by some Linux security modules.
ru: Безопасное выполнение также может требоваться некоторыми модулями безопасности Linux.

source: The B<secure_getenv>() function is intended for use in general-purpose libraries to avoid vulnerabilities that could occur if set-user-ID or set-group-ID programs accidentally trusted the environment.
ru: Функция B<secure_getenv>() предназначена для библиотек общего назначения с целью недопущения уязвимостей, которые могли бы возникнуть, если программы с битом set-user-ID или set-group-ID ненамеренно доверяли бы окружению.

source: The B<getenv>() function returns a pointer to the value in the environment, or NULL if there is no match.
ru: Функция B<getenv>() возвращает указатель на значение в окружении или NULL, если ничего не найдено.

source: B<secure_getenv>() first appeared in glibc 2.17.
ru: Функция B<secure_getenv>() впервые появилась в glibc версии 2.17.

source: B<secure_getenv>() is a GNU extension.
ru: Функция B<secure_getenv>() является расширением GNU.

source: The strings in the environment list are of the form I<name=value>.
ru: Строки в списке окружения имеют вид I<имя=значение>.

source: As typically implemented, B<getenv>() returns a pointer to a string within the environment list. The caller must take care not to modify this string, since that would change the environment of the process.
ru: В типичной реализации B<getenv>() возвращает указатель на строку в списке окружения. Вызывающий не должен изменять эту строку, так как это изменить окружение процесса.

source: The implementation of B<getenv>() is not required to be reentrant. The string pointed to by the return value of B<getenv>() may be statically allocated, and can be modified by a subsequent call to B<getenv>(), B<putenv>(3), B<setenv>(3), or B<unsetenv>(3).
ru: Реализации B<getenv>() не требуется быть реентерабельной. Строка, указанная в возвращаемом значение B<getenv>(), может быть выделена статически и может изменяться после вызова B<getenv>() с помощью B<putenv>(3), B<setenv>(3) или B<unsetenv>(3).

source: The "secure execution" mode of B<secure_getenv>() is controlled by the B<AT_SECURE> flag contained in the auxiliary vector passed from the kernel to user space.
ru: Режим «безопасного выполнения» в B<secure_getenv>() управляется флагом B<AT_SECURE> вспомогательного вектора, передаваемого из ядра в пользовательское пространство.

source: getpw - reconstruct password line entry
ru: getpw - восстанавливает строку пароля

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sys/types.hE<gt>> B<#include E<lt>pwd.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>sys/types.hE<gt>> B<#include E<lt>pwd.hE<gt>>

source: The B<getpw>() function reconstructs the password line entry for the given user ID I<uid> in the buffer I<buf>. The returned buffer contains a line of format
ru: Функция B<getpw>() заново создаёт в буфере строку пароля для пользователя с ID I<uid> в буфере I<buf>. Возвращаемый буфер содержит строку в формате

source: The B<getpw>() function returns 0 on success; on error, it returns -1, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<getpw>() возвращается 0; при ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: If I<uid> is not found in the password database, B<getpw>() returns -1, sets I<errno> to 0, and leaves I<buf> unchanged.
ru: Если I<uid> не найден в базе данных паролей, то B<getpw>() возвращает -1, присваивает I<errno> значение 0 и I<buf> не изменяется.

source: B<0> or B<ENOENT>
ru: B<0> или B<ENOENT>

source: No user corresponding to I<uid>.
ru: Отсутствует пользователь с соответствующим I<uid>.

source: I<buf> is NULL.
ru: Значение I<buf> равно NULL.

source: The B<getpw>() function is dangerous as it may overflow the provided buffer I<buf>. It is obsoleted by B<getpwuid>(3).
ru: Функция B<getpw>() является в каком-то смысле опасной, так как может переполнить предоставляемый ей буфер I<buf>. Она заменена на B<getpwuid>(3).

source: getipnodebyname, getipnodebyaddr, freehostent - get network hostnames and addresses
ru: getipnodebyname, getipnodebyaddr, freehostent - возвращают сетевые имена и адреса машины

source: These functions are deprecated (and unavailable in glibc). Use B<getaddrinfo>(3) and B<getnameinfo>(3) instead.
ru: Эти функции устарели (и недоступны в glibc). Используйте вместо них функции B<getaddrinfo>(3) и B<getnameinfo>(3).

source: The B<getipnodebyname>() and B<getipnodebyaddr>() functions return the names and addresses of a network host. These functions return a pointer to the following structure:
ru: Функции B<getipnodebyname>() и B<getipnodebyaddr>() возвращают имена и адреса машины в сети. Эти функции возвращают указатель на следующую структуру:

source: These functions replace the B<gethostbyname>(3) and B<gethostbyaddr>(3) functions, which could access only the IPv4 network address family. The B<getipnodebyname>() and B<getipnodebyaddr>() functions can access multiple network address families.
ru: Эти функции заменяют функции B<gethostbyname>(3) и B<gethostbyaddr>(3), которые могут возвращать только сетевые адреса семейства IPv4. Функции B<getipnodebyname>() и B<getipnodebyaddr>() могут осуществлять доступ к нескольким семействам сетевых адресов.

source: Unlike the B<gethostby> functions, these functions return pointers to dynamically allocated memory. The B<freehostent>() function is used to release the dynamically allocated memory after the caller no longer needs the I<hostent> structure.
ru: В отличие от функций B<gethostby> эти функции возвращают указатели на динамически выделяемую память. Функция B<freehostent>() используется для освобождения динамически выделенной памяти после того, как надобность в структуре I<hostent> отпадёт.

source: getipnodebyname() arguments
ru: Параметры getipnodebyname()

source: The B<getipnodebyname>() function looks up network addresses for the host specified by the I<name> argument. The I<af> argument specifies one of the following values:
ru: Функция B<getipnodebyname>() ищет сетевой адрес узла, указанного в параметре I<name>. В параметре I<af> указывается одно из следующих значений:

source: The I<name> argument points to a dotted-quad IPv4 address or a name of an IPv4 network host.
ru: Параметр I<name> указывает на адрес IPv4 в точечной нотации или на имя сетевого узла IPv4.

source: The I<name> argument points to a hexadecimal IPv6 address or a name of an IPv6 network host.
ru: Параметр I<name> указывает на шестнадцатеричный адрес IPv6 или на имя сетевого узла IPv6.

source: The I<flags> argument specifies additional options. More than one option can be specified by bitwise OR-ing them together. I<flags> should be set to 0 if no options are desired.
ru: В аргументе I<flags> указываются дополнительные параметры. Возможно указать более одного параметра с помощью логического сложения (OR). Если параметры не требуются, то значение I<flags> должно быть равно нулю.

source: This flag is used with B<AF_INET6> to request a query for IPv4 addresses instead of IPv6 addresses; the IPv4 addresses will be mapped to IPv6 addresses.
ru: Этот флаг используется с B<AF_INET6> для запроса адресов IPv4 вместо адресов IPv6; адрес IPv4 будет отображён в адрес IPv6.

source: This flag is used with B<AI_V4MAPPED> to request a query for both IPv4 and IPv6 addresses. Any IPv4 address found will be mapped to an IPv6 address.
ru: Это флаг используется с B<AI_V4MAPPED> для запроса одновременно адресов IPv4 и IPv6. Любой найденный адрес IPv4 будет отображён в адрес IPv6.

source: This flag is used with B<AF_INET6> to further request that queries for IPv6 addresses should not be made unless the system has at least one IPv6 address assigned to a network interface, and that queries for IPv4 addresses should not be made unless the system has at least one IPv4 address assigned to a network interface. This flag may be used by itself or with the B<AI_V4MAPPED> flag.
ru: Этот флаг используется с B<AF_INET6> и указывает, что запросы адресов IPv6 не должны производиться, если система не имеет хотя бы одного адреса IPv6, присвоенного сетевому интерфейсу, а также, что запросы адресов IPv4 не должны производиться, если система не имеет хотя бы одного адреса IPv4, присвоенного сетевому интерфейсу. Флаг может быть использован сам по себе или вместе с флагом B<AI_V4MAPPED>.

source: This flag is equivalent to B<(AI_ADDRCONFIG | AI_V4MAPPED)>.
ru: Этот флаг эквивалентен B<(AI_ADDRCONFIG | AI_V4MAPPED)>.

source: getipnodebyaddr() arguments
ru: Параметры getipnodebyaddr()

source: The B<getipnodebyaddr>() function looks up the name of the host whose network address is specified by the I<addr> argument. The I<af> argument specifies one of the following values:
ru: Функция B<getipnodebyaddr>() ищет имя узла, чей сетевой адрес указан в параметре I<addr>. В параметре I<af> указывается одно из следующих значений:

source: The I<addr> argument points to a I<struct in_addr> and I<len> must be set to I<sizeof(struct in_addr)>.
ru: Параметр I<addr> указывает на структуру I<struct in_addr> и значение I<len> должно быть равно I<sizeof(struct in_addr)>.

source: The I<addr> argument points to a I<struct in6_addr> and I<len> must be set to I<sizeof(struct in6_addr)>.
ru: Параметр I<addr> указывает на структуру I<struct in6_addr> и значение I<len> должно быть равно I<sizeof(struct in6_addr)>.

source: NULL is returned if an error occurred, and I<error_num> will contain an error code from the following list:
ru: При ошибке возвращается NULL, а в I<error_num> будет содержаться код ошибки из следующего списка:

source: The hostname or network address was not found.
ru: Имя узла или сетевой адрес не найдены.

source: The domain name server recognized the network address or name, but no answer was returned. This can happen if the network host has only IPv4 addresses and a request has been made for IPv6 information only, or vice versa.
ru: Сервер доменных имён распознал сетевой адрес или имя, но не ответил. Это может произойти, если сетевой узел имеет только адреса IPv4, а запрашивалась информация об IPv6, или наоборот.

source: The domain name server returned a permanent failure response.
ru: Сервер доменных имён возвратил сообщение о постоянной ошибке.

source: The domain name server returned a temporary failure response. You might have better luck next time.
ru: Сервер доменных имён возвратил сообщение о временной ошибке. Возможно, ответ может быть получен при повторной попытке.

source: A successful query returns a pointer to a I<hostent> structure that contains the following fields:
ru: При выполненном запросе возвращается указатель на структуру I<hostent>, содержащую следующие поля:

source: This is the official name of this network host.
ru: Официальное имя данного сетевого узла.

source: This is an array of pointers to unofficial aliases for the same host. The array is terminated by a null pointer.
ru: Массив указателей на неофициальные псевдонимы этого же узла. Массив оканчивается указателем null.

source: This is a copy of the I<af> argument to B<getipnodebyname>() or B<getipnodebyaddr>(). I<h_addrtype> will always be B<AF_INET> if the I<af> argument was B<AF_INET>. I<h_addrtype> will always be B<AF_INET6> if the I<af> argument was B<AF_INET6>.
ru: Копия параметра I<af> вызова B<getipnodebyname>() или B<getipnodebyaddr>(). Значение I<h_addrtype> всегда равно B<AF_INET>, если значение I<af> равно B<AF_INET>. Значение I<h_addrtype> всегда равно B<AF_INET6>, если значение I<af> равно B<AF_INET6>.

source: This field will be set to I<sizeof(struct in_addr)> if I<h_addrtype> is B<AF_INET>, and to I<sizeof(struct in6_addr)> if I<h_addrtype> is B<AF_INET6>.
ru: Это поле равно I<sizeof(struct in_addr)>, если I<h_addrtype> равно B<AF_INET>, и I<sizeof(struct in6_addr)>, если I<h_addrtype> равно B<AF_INET6>.

source: This is an array of one or more pointers to network address structures for the network host. The array is terminated by a null pointer.
ru: Массив из одного или нескольких указателей на структуры сетевого адреса для сетевого узла. Массив оканчивается указателем null.

source: These functions were present in glibc 2.1.91-95, but were removed again. Several UNIX-like systems support them, but all call them deprecated.
ru: Эти функции существовали в glibc 2.1.91-95, но были удалены. Некоторые UNIX-подобные системы поддерживают их, но все эти вызовы устарели.

source: getgrnam, getgrnam_r, getgrgid, getgrgid_r - get group file entry
ru: getgrnam, getgrnam_r, getgrgid, getgrgid_r - возвращают запись файла групп

source: The B<getgrnam>() function returns a pointer to a structure containing the broken-out fields of the record in the group database (e.g., the local group file I</etc/group>, NIS, and LDAP) that matches the group name I<name>.
ru: Функция B<getgrnam>() возвращает указатель на структуру, содержащую разделённую на поля запись из базы данных групп (например, из локального файла групп I</etc/group>, NIS и LDAP), которая соответствует имени группы I<name>.

source: The B<getgrgid>() function returns a pointer to a structure containing the broken-out fields of the record in the group database that matches the group ID I<gid>.
ru: Функция B<getgrgid>() возвращает указатель на структуру, содержащую разделённую на поля запись из базы данных групп, которая соответствует идентификатору группы I<gid>.

source: The B<getgrnam_r>() and B<getgrgid_r>() functions obtain the same information as B<getgrnam>() and B<getgrgid>(), but store the retrieved I<group> structure in the space pointed to by I<grp>. The string fields pointed to by the members of the I<group> structure are stored in the buffer I<buf> of size I<buflen>. A pointer to the result (in case of success) or NULL (in case no entry was found or an error occurred) is stored in I<*result>.
ru: Функции B<getgrnam_r>() и B<getgrgid_r>() принимают ту же информацию что и B<getgrnam>() и B<getgrgid>(), но сохраняют полученную структуру I<group> в пространство, указанное I<grp>. Строковые поля членов структуры I<group> сохраняются в буфере I<buf> размера I<buflen>. Указатель на результат (при успешном выполнении) или NULL (если записи отсутствуют или произошла ошибка) сохраняется в I<*result>.

source: The B<getgrnam>() and B<getgrgid>() functions return a pointer to a I<group> structure, or NULL if the matching entry is not found or an error occurs. If an error occurs, I<errno> is set appropriately. If one wants to check I<errno> after the call, it should be set to zero before the call.
ru: Функции B<getgrnam>() и B<getgrgid>() возвращают указатель на структуру I<group> или NULL, если подходящих записей не найдено или возникла ошибка. При ошибке I<errno> устанавливается в соответствующее значение. Если нужно проверять переменную I<errno> после вызова, то перед этим нужно присвоить ей нулевое значение.

source: The return value may point to a static area, and may be overwritten by subsequent calls to B<getgrent>(3), B<getgrgid>(), or B<getgrnam>(). (Do not pass the returned pointer to B<free>(3).)
ru: Возвращаемое значение может указывать на статическую область и может быть перезаписано при последующих вызовах B<getgrent>(3), B<getgrnam>() или B<getgrgid>() (не передавайте полученный указатель B<free>(3)).

source: On success, B<getgrnam_r>() and B<getgrgid_r>() return zero, and set I<*result> to I<grp>. If no matching group record was found, these functions return 0 and store NULL in I<*result>. In case of error, an error number is returned, and NULL is stored in I<*result>.
ru: При успешном выполнении B<getgrnam_r>() и B<getgrgid_r>() возвращают ноль, и устанавливают I<*result> в I<pwd>. Если совпадений не найдено, то эти функции возвращают 0 и сохраняют NULL в I<*result>. При ошибке возвращается её номер и в I<*result> сохраняется NULL.

source: The given I<name> or I<gid> was not found.
ru: Указанное значение I<name> или I<gid> не найдено.

source: The formulation given above under "RETURN VALUE" is from POSIX.1. It does not call "not found" an error, hence does not specify what value I<errno> might have in this situation. But that makes it impossible to recognize errors. One might argue that according to POSIX I<errno> should be left unchanged if an entry is not found. Experiments on various UNIX-like systems show that lots of different values occur in this situation: 0, ENOENT, EBADF, ESRCH, EWOULDBLOCK, EPERM, and probably others.
ru: Описание «ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ», приведённое выше, взято из POSIX.1. В нём «не найдено» не считается ошибкой и поэтому не указано, каким может быть значение I<errno> в этом случае. Но это делает невозможным определить тип ошибки. Из описание POSIX можно посчитать, что I<errno> не должно измениться, если запись не найдена. Эксперименты в различных UNIX-подобных системах показывают, что в этой ситуации возвращается много разных значений: 0, ENOENT, EBADF, ESRCH, EWOULDBLOCK, EPERM и, возможно, другие.

source: gamma, gammaf, gammal - (logarithm of the) gamma function
ru: gamma, gammaf, gammal - логарифм гамма-функции

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: _XOPEN_SOURCE || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: _XOPEN_SOURCE E<gt>= 600 || (_XOPEN_SOURCE && _ISOC99_SOURCE) || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE E<gt>= 600 || (_XOPEN_SOURCE && _ISOC99_SOURCE) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions are deprecated: instead, use either the B<tgamma>(3) or the B<lgamma>(3) functions, as appropriate.
ru: Данные функции устарели. Используйте вместо них, по возможности, B<tgamma>(3) либо B<lgamma>(3).

source: For the definition of the Gamma function, see B<tgamma>(3).
ru: Определение гамма-функции смотрите в B<tgamma>(3).

source: *BSD version
ru: Версия *BSD

source: The libm in 4.4BSD and some versions of FreeBSD had a B<gamma>() function that computes the Gamma function, as one would expect.
ru: В libm из 4.4BSD и некоторых версиях FreeBSD имеется функция B<gamma>(), которая вычисляет гамма-функцию, как и ожидается.

source: glibc version
ru: Версия glibc

source: Glibc has a B<gamma>() function that is equivalent to B<lgamma>(3) and computes the natural logarithm of the Gamma function.
ru: В glibc есть функция B<gamma>(), которая эквивалентна B<lgamma>(3) и вычисляет натуральный логарифм гамма-функции.

source: See B<lgamma>(3).
ru: Смотрите B<lgamma>(3).

source: Because of historical variations in behavior across systems, this function is not specified in any recent standard. It was documented in SVID 2.
ru: Из-за различий в поведении в различных системах эта функция не попала ни в один современный стандарт. Она описана в SVID 2.

source: 4.2BSD had a B<gamma>() that computed ln(|Gamma(|I<x>|)|), leaving the sign of Gamma(|I<x>|) in the external integer I<signgam>. In 4.3BSD the name was changed to B<lgamma>(3), and the man page promises
ru: В 4.2BSD функция B<gamma>() вычисляет ln(|Gamma(|I<x>|)|), записывая знак Gamma(|I<x>|) во внешнее целое I<signgam>. В 4.3BSD было изменено имя на B<lgamma>(3), и в справочной странице указано

source: At some time in the future the name gamma will be rehabilitated and used for the Gamma function
ru: Через некоторое время имя gamma было восстановлено и использовано для гаммы-функции

source: This did indeed happen in 4.4BSD, where B<gamma>() computes the Gamma function (with no effect on I<signgam>). However, this came too late, and we now have B<tgamma>(3), the "true gamma" function.
ru: В действительности это произошло в 4.4BSD, где B<gamma>() вычисляла гамма-функцию (без влияния на I<signgam>). Однако, это случилось слишком поздно и теперь мы имеем B<tgamma>(3), «настоящую» гамма-функцию.

source: getwchar - read a wide character from standard input
ru: getwchar - считывает широкий символ из стандартного ввода

source: The B<getwchar>() function is the wide-character equivalent of the B<getchar>(3) function. It reads a wide character from I<stdin> and returns it. If the end of stream is reached, or if I<ferror(stdin)> becomes true, it returns B<WEOF>. If a wide-character conversion error occurs, it sets I<errno> to B<EILSEQ> and returns B<WEOF>.
ru: Функция B<getwchar>() — это эквивалент функции B<getchar>(3), но для широких символов. Она читает широкий символ из I<stdin> и возвращает его. Если достигнут конец потока или значение I<ferror(stdin)> истинно, то функция возвращает B<WEOF>. Если при преобразовании в широкий символ возникает ошибка, то значение переменной I<errno> устанавливается равным B<EILSEQ> и возвращается B<WEOF>.

source: For a nonlocking counterpart, see B<unlocked_stdio>(3).
ru: Неблокирующий аналог смотрите в B<unlocked_stdio>(3).

source: The B<getwchar>() function returns the next wide-character from standard input, or B<WEOF>.
ru: Функция B<getwchar>() возвращает следующий широкий символ из стандартного ввода или B<WEOF>.

source: The behavior of B<getwchar>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<getwchar>() зависит от категории B<LC_CTYPE> текущей локали.
