Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: if (optind E<lt> argc) { printf("non-option ARGV-elements: "); while (optind E<lt> argc) printf("%s ", argv[optind++]); printf("\en"); }
ru: if (optind E<lt> argc) { printf("элементы ARGV не параметры: "); while (optind E<lt> argc) printf("%s ", argv[optind++]); printf("\en"); }

source: getnetent_r, getnetbyname_r, getnetbyaddr_r - get network entry (reentrant)
ru: getnetent_r, getnetbyname_r, getnetbyaddr_r - возвращают запись о сети (реентерабельные версии)

source: B<getnetent_r>(), B<getnetbyname_r>(), B<getnetbyaddr_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getnetent_r>(), B<getnetbyname_r>(), B<getnetbyaddr_r>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: The B<getnetent_r>(), B<getnetbyname_r>(), and B<getnetbyaddr_r>() functions are the reentrant equivalents of, respectively, B<getnetent>(3), B<getnetbyname>(3), and B<getnetbynumber>(3). They differ in the way that the I<netent> structure is returned, and in the function calling signature and return value. This manual page describes just the differences from the nonreentrant functions.
ru: Функции B<getnetent_r>(), B<getnetbyname_r>() и B<getnetbyaddr_r>() являются реентерабельными эквивалентами B<getnetent>(3), B<getnetbyname>(3) и B<getnetbynumber>(3), соответственно. Они отличаются способом возврата структуры I<netent> и списком параметров и типом возвращаемого значения. В этой справочной странице описаны только различия с нереентерабельными функциями.

source: Instead of returning a pointer to a statically allocated I<netent> structure as the function result, these functions copy the structure into the location pointed to by I<result_buf>.
ru: Вместо возврата указателя на статически выделенную структуру I<netent> в качестве результата эти функции копируют структуру в расположение, указанное I<result_buf>.

source: The I<buf> array is used to store the string fields pointed to by the returned I<netent> structure. (The nonreentrant functions allocate these strings in static storage.) The size of this array is specified in I<buflen>. If I<buf> is too small, the call fails with the error B<ERANGE>, and the caller must try again with a larger buffer. (A buffer of length 1024 bytes should be sufficient for most applications.)
ru: Массив I<buf> используется для хранения строковых полей из возвращаемой структуры I<netent> (нереентерабельные функции выделяют эти строки из статического хранилища). Размер данного массива задаётся в I<buflen>. Если I<buf> слишком мал, то вызов завершается с ошибкой B<ERANGE>, вызывающий должен его повторить с большим буфером (для большинства приложений должно быть достаточно буфера длиной 1024 байт).

source: If the function call successfully obtains a network record, then I<*result> is set pointing to I<result_buf>; otherwise, I<*result> is set to NULL.
ru: Если вызов получил запись о сети, то I<*result> указывает на I<result_buf>; в противном случае I<*result> устанавливается в NULL.

source: The buffer pointed to by I<h_errnop> is used to return the value that would be stored in the global variable I<h_errno> by the nonreentrant versions of these functions.
ru: Буфер, указанный I<h_errnop>, используется для возврата значения, которое бы сохранилось в глобальной переменной I<h_errno> нереентерабельными версиями этих функций.

source: On success, these functions return 0. On error, they return one of the positive error numbers listed in ERRORS.
ru: При успешном выполнении эти функции возвращают 0. При ошибке возвращается одно из положительных значений, перечисленных В разделе ОШИБКИ.

source: On error, record not found (B<getnetbyname_r>(), B<getnetbyaddr_r>()), or end of input (B<getnetent_r>()) I<result> is set to NULL.
ru: При ошибке, отсутствии записи (B<getnetbyname_r>(), B<getnetbyaddr_r>()) или конце данных (B<getnetent_r>()) значение I<result> равно NULL.

source: (B<getnetent_r>()) No more records in database.
ru: (B<getnetent_r>()) Больше нет записей в базе данных.

source: getmntent, setmntent, addmntent, endmntent, hasmntopt, getmntent_r - get filesystem descriptor file entry
ru: getmntent, setmntent, addmntent, endmntent, hasmntopt, getmntent_r - возвращают запись из файла описания файловых систем

source: /* GNU extension */ B<#include E<lt>mntent.hE<gt>>
ru: /* Расширение GNU */ B<#include E<lt>mntent.hE<gt>>

source: B<getmntent_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getmntent_r>(), начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: These routines are used to access the filesystem description file I</etc/fstab> and the mounted filesystem description file I</etc/mtab>.
ru: Эти функции используются для доступа к файлу описаний файловых систем I</etc/fstab> и к файлу описаний смонтированных файловых систем I</etc/mtab>.

source: The B<setmntent>() function opens the filesystem description file I<filename> and returns a file pointer which can be used by B<getmntent>(). The argument I<type> is the type of access required and can take the same values as the I<mode> argument of B<fopen>(3). The returned stream should be closed using B<endmntent>() rather than B<fclose>(3).
ru: Функция B<setmntent>() открывает файл описаний файловых систем I<filename> и возвращает указатель на файл, который может быть использован B<getmntent>(). В аргументе I<type> указывается требуемый тип доступа и и могут задаваться те же значения, что и в аргументе I<mode> функции B<fclose>(3). Возвращаемый поток должен закрываться с помощью B<endmntent>(), а не B<fclose>(3).

source: The B<getmntent>() function reads the next line of the filesystem description file from I<stream> and returns a pointer to a structure containing the broken out fields from a line in the file. The pointer points to a static area of memory which is overwritten by subsequent calls to B<getmntent>().
ru: Функция B<getmntent>() считывает следующую строку из файла описаний файловых систем I<stream> и возвращает указатель на структуру, содержащую поля строки файла. Указатель ссылается на статическую область памяти, которая перезаписывается последующими вызовами B<getmntent>().

source: The B<addmntent>() function adds the I<mntent> structure I<mnt> to the end of the open I<stream>.
ru: Функция B<addmntent>() добавляет структуру I<mnt> типа I<mntent> к концу открытого I<stream>.

source: The B<endmntent>() function closes the I<stream> associated with the filesystem description file.
ru: Функция B<endmntent>() закрывает I<stream>, связанный с файл описаний файловых систем.

source: The B<hasmntopt>() function scans the I<mnt_opts> field (see below) of the I<mntent> structure I<mnt> for a substring that matches I<opt>. See I<E<lt>mntent.hE<gt>> and B<mount>(8) for valid mount options.
ru: Функция B<hashmntopt>() ищет в полях I<mnt_opts> (смотрите ниже) структуры I<mnt> типа I<mntent> подстроку, совпадающую с I<opt>. Список возможных параметров монтирования приведён в I<E<lt>mntent.hE<gt>> и B<mount>(8).

source: The reentrant B<getmntent_r>() function is similar to B<getmntent>(), but stores the I<struct mount> in the provided I<*mntbuf> and stores the strings pointed to by the entries in that struct in the provided array I<buf> of size I<buflen>.
ru: Реентерабельная функция B<getmntent_r>() подобна B<getmntent>(), но сохраняет I<struct mount> в предоставляемом I<*mntbuf>, а строки элементов этой структуры — в предоставляемый массив I<buf> размера I<buflen>.

source: The I<mntent> structure is defined in I<E<lt>mntent.hE<gt>> as follows:
ru: Структура I<mntent> определена в I<E<lt>mntent.hE<gt>> следующим образом:

source: struct mntent { char *mnt_fsname; /* name of mounted filesystem */ char *mnt_dir; /* filesystem path prefix */ char *mnt_type; /* mount type (see mntent.h) */ char *mnt_opts; /* mount options (see mntent.h) */ int mnt_freq; /* dump frequency in days */ int mnt_passno; /* pass number on parallel fsck */ };
ru: struct mntent { char *mnt_fsname; /* название смонтированной файловой системы */ char *mnt_dir; /* префикс пути к файловой системе */ char *mnt_type; /* тип монтирования (смотрите mntent.h) */ char *mnt_opts; /* параметры монтирования (смотрите mntent.h) */ int mnt_freq; /* периодичность запуска dump, в днях */ int mnt_passno; /* номер прохода при параллельном fsck */ };

source: Since fields in the mtab and fstab files are separated by whitespace, octal escapes are used to represent the characters space (\e040), tab (\e011), newline (\e012), and backslash (\e\e) in those files when they occur in one of the four strings in a I<mntent> structure. The routines B<addmntent>() and B<getmntent>() will convert from string representation to escaped representation and back. When converting from escaped representation, the sequence \e134 is also converted to a backslash.
ru: Так как поля в файлах mtab и fstab разделяются пробельными символами, то для их записи в одной из четырёх строках структуры I<mntent> используются их экранированные последовательности в восьмеричном коде: пробел (\e040), табуляция (\e011), новая строка (\e012) и обратная косая черта (\e\e). Функции B<addmntent>() и B<getmntent>() выполнят преобразование экранированных строк и обратно. При преобразовании из экранированного представления, последовательность \e134 также преобразуется в символ обратной косой черты.

source: The B<getmntent>() and B<getmntent_r>() functions return a pointer to the I<mntent> structure or NULL on failure.
ru: Функции B<getmntent>() и B<getmntent_r>() возвращают указатель на структуру типа I<mntent> или NULL при ошибке.

source: The B<addmntent>() function returns 0 on success and 1 on failure.
ru: Функция B<addmntent>() возвращает 0 при успешном выполнении и 1 при ошибке.

source: The B<endmntent>() function always returns 1.
ru: Функция B<endmntent>() всегда возвращает 1.

source: The B<hasmntopt>() function returns the address of the substring if a match is found and NULL otherwise.
ru: Функция B<hasmntopt>() возвращает адрес подстроки, если она была найдена, в противном случае NULL.

source: filesystem description file
ru: файл описаний файловых систем

source: mounted filesystem description file
ru: файл описаний смонтированных файловых систем

source: The nonreentrant functions are from SunOS 4.1.3. A routine B<getmntent_r>() was introduced in HP-UX 10, but it returns an int. The prototype shown above is glibc-only.
ru: Нереентерабельные функции появились из SunOS 4.1.3. Функция B<getmntent_r>() появилась из HP-UX 10, но она возвращает int. Показанный здесь прототип есть только в glibc.

source: System V also has a B<getmntent>() function but the calling sequence differs, and the returned structure is different. Under System V I</etc/mnttab> is used. 4.4BSD and Digital UNIX have a routine B<getmntinfo>(), a wrapper around the system call B<getfsstat>().
ru: В System V также имеется функция B<getmntent>(), однако последовательность вызова и возвращаемая структура отличаются от остальных. В System V используется I</etc/mnttab>. В BSD 4.4 и Digital UNIX есть функция B<getmntinfo>(), обёртка над системным вызовом B<getfsstat>().

source: getprotoent, getprotobyname, getprotobynumber, setprotoent, endprotoent - get protocol entry
ru: getprotoent, getprotobyname, getprotobynumber, setprotoent, endprotoent - возвращают запись о протоколе

source: The B<getprotoent>() function reads the next entry from the protocols database (see B<protocols>(5)) and returns a I<protoent> structure containing the broken-out fields from the entry. A connection is opened to the database if necessary.
ru: Функция B<getprotoent>() считывает следующую запись из файла, содержащего базу протоколов (смотрите B<protocols>(5)), и возвращает структуру I<protoent>, содержащую поля из этой записи. При необходимости будет открыто подключение к базе.

source: The B<getprotobyname>() function returns a I<protoent> structure for the entry from the database that matches the protocol name I<name>. A connection is opened to the database if necessary.
ru: Функция B<getprotobyname>() возвращает структуру I<protoent> элемента из базы данных, который совпадает с именем протокола I<name>. При необходимости будет открыто подключение к базе.

source: The B<getprotobynumber>() function returns a I<protoent> structure for the entry from the database that matches the protocol number I<number>. A connection is opened to the database if necessary.
ru: Функция B<getprotobynumber>() возвращает структуру I<protoent> элемента из базы данных, который совпадает с номером протокола I<number>. При необходимости будет открыто подключение к базе.

source: The B<setprotoent>() function opens a connection to the database, and sets the next entry to the first entry. If I<stayopen> is nonzero, then the connection to the database will not be closed between calls to one of the B<getproto*>() functions.
ru: Функция B<setprotoent>() открывает соединение к базе и устанавливает следующую запись к первой записи. Если I<stayopen> не равен нулю, то подключение к базе между вызовами нескольких функций B<getproto*>() не будет закрыто.

source: The B<endprotoent>() function closes the connection to the database.
ru: Функция B<endprotoent>() закрывает подключение к базе.

source: The I<protoent> structure is defined in I<E<lt>netdb.hE<gt>> as follows:
ru: Структура I<protoent> определена в I<E<lt>netdb.hE<gt>> таким образом:

source: struct protoent { char *p_name; /* official protocol name */ char **p_aliases; /* alias list */ int p_proto; /* protocol number */ }
ru: struct protoent { char *p_name; /* официальное имя протокола */ char **p_aliases; /* список псевдонимов */ int p_proto; /* номер протокола */ }

source: The members of the I<protoent> structure are:
ru: Члены структуры I<protoent>:

source: The official name of the protocol.
ru: Официальное название протокола.

source: A NULL-terminated list of alternative names for the protocol.
ru: Список альтернативных имён протокола, завершающийся NULL.

source: The protocol number.
ru: Номер протокола.

source: The B<getprotoent>(), B<getprotobyname>() and B<getprotobynumber>() functions return a pointer to a statically allocated I<protoent> structure, or a null pointer if an error occurs or the end of the file is reached.
ru: Функции B<getprotoent>(), B<getprotobyname>() и B<getprotobynumber>() возвращают указатель на статически выделенную структуру I<protoent> или указатель null при ошибке или достижении конца файла.

source: protocol database file
ru: файл, содержащий базу протоколов

source: In the above table, I<protoent> in I<race:protoent> signifies that if any of the functions B<setprotoent>(), B<getprotoent>(), or B<endprotoent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<protoent> в I<race:protoent> означает, что если в нескольких нитях программы одновременно используются функции B<setprotoent>(), B<getprotoent>() или B<endprotoent>(), то может возникнуть состязательность по данным.

source: getutent, getutid, getutline, pututline, setutent, endutent, utmpname - access utmp file entries
ru: getutent, getutid, getutline, pututline, setutent, endutent, utmpname - доступ к записям файла utmp

source: New applications should use the POSIX.1-specified "utmpx" versions of these functions; see CONFORMING TO.
ru: В новых приложениях нужно использовать определённые в POSIX.1 «utmpx» версии этих функций; смотрите СООТВЕТСТВИЕ СТАНДАРТАМ.

source: B<utmpname>() sets the name of the utmp-format file for the other utmp functions to access. If B<utmpname>() is not used to set the filename before the other functions are used, they assume B<_PATH_UTMP>, as defined in I<E<lt>paths.hE<gt>>.
ru: Функция B<utmpname>() задаёт имя файла в формате utmp для других функций utmp. Если B<utmpname>() не используется для указания имени файла перед работой с другими функциями, то они будут использовать имя из B<_PATH_UTMP>, определённое в I<E<lt>paths.hE<gt>>.

source: B<setutent>() rewinds the file pointer to the beginning of the utmp file. It is generally a good idea to call it before any of the other functions.
ru: Функция B<setutent>() переносит указатель начало файла utmp. Вообще, оптимальным вариантом считается вызывать эту функцию перед вызовом остальных.

source: B<endutent>() closes the utmp file. It should be called when the user code is done accessing the file with the other functions.
ru: Функция B<endutent>() закрывает файл utmp. Она должна быть вызвана, когда будет завершена работа с файлом посредством других функций.

source: B<getutent>() reads a line from the current file position in the utmp file. It returns a pointer to a structure containing the fields of the line. The definition of this structure is shown in B<utmp>(5).
ru: Функция B<getutent>() считывает строку, начиная с текущей позиции файла в файле utmp. Она возвращает указатель на структуру, содержащую поля этой строки. Определение структуры приведено в B<utmp>(5).

source: B<getutid>() searches forward from the current file position in the utmp file based upon I<ut>. If I<ut-E<gt>ut_type> is one of B<RUN_LVL>, B<BOOT_TIME>, B<NEW_TIME>, or B<OLD_TIME>, B<getutid>() will find the first entry whose I<ut_type> field matches I<ut-E<gt>ut_type>. If I<ut-E<gt>ut_type> is one of B<INIT_PROCESS>, B<LOGIN_PROCESS>, B<USER_PROCESS>, or B<DEAD_PROCESS>, B<getutid>() will find the first entry whose I<ut_id> field matches I<ut-E<gt>ut_id>.
ru: Функция B<getutid>() производит прямой поиск, начиная с текущей позиции файла в файле utmp, основываясь на данных I<ut>. Если значение I<ut-E<gt>ut_type> равно B<RUN_LVL>, B<BOOT_TIME>, B<NEW_TIME> или B<OLD_TIME>, то B<getutid>() найдёт первую запись, поле I<ut_type> которой совпадает с I<ut-E<gt>ut_type>. Если I<ut-E<gt>ut_type> равно B<INIT_PROCESS>, B<LOGIN_PROCESS>, B<USER_PROCESS> или B<DEAD_PROCESS>, то B<getutid>() найдёт первую запись, поле I<ut_id> которой совпадает с I<ut-E<gt>ut_id>.

source: B<getutline>() searches forward from the current file position in the utmp file. It scans entries whose I<ut_type> is B<USER_PROCESS> or B<LOGIN_PROCESS> and returns the first one whose I<ut_line> field matches I<ut-E<gt>ut_line>.
ru: Функция B<getutline>() производит прямой поиск, начиная с текущей позиции файла в файле utmp. Она просматривает записи, у которых поле I<ut_type> совпадает с B<USER_PROCESS> или B<LOGIN_PROCESS>, и возвращает первую запись, поле I<ut_line> которой совпадает с I<ut-E<gt>ut_line>.

source: B<pututline>() writes the I<utmp> structure I<ut> into the utmp file. It uses B<getutid>() to search for the proper place in the file to insert the new entry. If it cannot find an appropriate slot for I<ut>, B<pututline>() will append the new entry to the end of the file.
ru: Функция B<pututline>() записывает структуру I<utmp> I<ut> в файл utmp. Для поиска места в файле, необходимого для вставки новой записи, используется B<getutid>() . Если такое место не найдено, то B<pututline>() добавит запись в конец файла.

source: B<getutent>(), B<getutid>(), and B<getutline>() return a pointer to a I<struct utmp> on success, and NULL on failure (which includes the "record not found" case). This I<struct utmp> is allocated in static storage, and may be overwritten by subsequent calls.
ru: При успешном выполнении функции B<getutent>(), B<getutid>() и B<getutline>() возвращают указатель на I<struct utmp> и NULL при ошибке (к ним относится и случай «запись не найдена»). Структура I<struct utmp> располагается в статическом хранилище и может быть изменена последующими вызовами.

source: On success B<pututline>() returns I<ut>; on failure, it returns NULL.
ru: При успешном выполнении B<pututline>() возвращает I<ut>; при ошибке возвращается NULL.

source: B<utmpname>() returns 0 if the new name was successfully stored, or -1 on failure.
ru: При успешном назначении нового имени функция B<utmpname>() возвращает 0 и -1 при ошибке.

source: In the event of an error, these functions I<errno> set to indicate the cause.
ru: В случае ошибки эти функции изменяют значение I<errno> соответствующим образом.

source: Record not found.
ru: Запись не найдена.

source: B<setutent>(), B<pututline>(), and the B<getut*>() functions can also fail for the reasons described in B<open>(2).
ru: Функции B<setutent>(), B<pututline>() и B<getut*>() также могут завершиться с ошибкой по причинам, описанным в B<open>(2).

source: database of currently logged-in users
ru: база данных пользователей, находящихся в системе в данный момент

source: database of past user logins
ru: база данных предыдущих пользовательских входов в систему

source: In the above table, I<utent> in I<race:utent> signifies that if any of the functions B<setutent>(), B<getutent>(), B<getutid>(), B<getutline>(), B<pututline>(), B<utmpname>(), or B<endutent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<utent> в I<race:utent> означает, что если в нескольких нитях программы одновременно используются функции B<setutent>(), B<getutent>(), B<getutid>(), B<getutline>(), B<pututline>(), B<utmpname>() или B<endutent>(), то может возникнуть состязательность по данным.

source: In XPG2 and SVID 2 the function B<pututline>() is documented to return void, and that is what it does on many systems (AIX, HP-UX). HP-UX introduces a new function B<_pututline>() with the prototype given above for B<pututline>().
ru: Согласно XPG2 и SVID 2 функция B<pututline>() возвращает тип void и такое поведение можно встретить во многих системах (AIX, HP-UX). В HP-UX представлена новая функция B<_pututline>() с прототипом приведённым выше для B<pututline>().

source: All these functions are obsolete now on non-Linux systems. POSIX.1-2001 and POSIX.1-2008, following SUSv1, does not have any of these functions, but instead uses
ru: Эти функции являются устаревшими в не Linux системах. POSIX.1-2001 и POSIX.1-2008, следуя SUSv1, не содержит эти функции, вместо них используются

source: These functions are provided by glibc, and perform the same task as their equivalents without the "x", but use I<struct utmpx>, defined on Linux to be the same as I<struct utmp>. For completeness, glibc also provides B<utmpxname>(), although this function is not specified by POSIX.1.
ru: Эти функции предоставляются glibc и выполняют те же задачи что и их аналоги без «x»", но используют I<struct utmpx>, определённую в Linux подобно I<struct utmp>. Для завершённости, в glibc также есть B<utmpxname>(), хотя эта функция отсутствует в POSIX.1.

source: On some other systems, the I<utmpx> structure is a superset of the I<utmp> structure, with additional fields, and larger versions of the existing fields, and parallel files are maintained, often I</var/*/utmpx> and I</var/*/wtmpx>.
ru: В некоторых других системах структура I<utmpx> представляет собой I<utmp> с дополнительными полями и увеличенными размерами одинаковых полей, а также параллельно обслуживаются обе версии файлов, часто I</var/*/utmpx> и I</var/*/wtmpx>.

source: Linux glibc on the other hand does not use a parallel I<utmpx> file since its I<utmp> structure is already large enough. The "x" functions listed above are just aliases for their counterparts without the "x" (e.g., B<getutxent>() is an alias for B<getutent>()).
ru: С другой стороны, в Linux glibc не используется второй файл I<utmpx>, так как её структура I<utmp> имеет достаточный размер. Функции с «x», перечисленные выше, являются просто псевдонимами их аналогов без «x» (например, B<getutxent>() псевдоним B<getutent>()).

source: Glibc notes
ru: Замечания по glibc
