Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: It is reasonable to expect that B<getwchar>() will actually read a multibyte sequence from standard input and then convert it to a wide character.
ru: Закономерно ожидать, что B<getwchar>() на самом деле читает мультибайтовую последовательность из стандартного потока, а затем преобразует её в широкий символ.

source: getentropy - fill a buffer with random bytes
ru: getentropy - заполнение буфера случайными байтами

source: The B<getentropy>() function writes I<length> bytes of high-quality random data to the buffer starting at the location pointed to by I<buffer>. The maximum permitted value for the I<length> argument is 256.
ru: Функция B<getentropy>() записывает I<length> байт высококачественных случайных данных в буфер, начинающийся в области, указанной в I<buffer>. Максимально разрешенное значение аргумента I<length> равно 256.

source: A successful call to B<getentropy>() always provides the requested number of bytes of entropy.
ru: Успешный вызов B<getentropy>() всегда предоставляет затребованное число байт энтропии.

source: On success, this function returns zero. On error, -1 is returned, and I<errno> is set appropriately.
ru: В случае успеха функция возвращает 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Part or all of the buffer specified by I<buffer> and I<length> is not in valid addressable memory.
ru: Часть или весь буфер, указанный в I<buffer> и I<length>, не является валидной адресуемой памятью.

source: I<length> is greater than 256.
ru: Значение I<length> больше 256.

source: An unspecified error occurred while trying to overwrite I<buffer> with random data.
ru: При попытке перезаписать I<buffer> случайными данными произошла ошибка.

source: This kernel version does not implement the B<getrandom>(2) system call required to implement this function.
ru: Данная версия ядра не имеет реализации системного вызова B<getrandom>(2), необходимого для реализации данной функции.

source: The B<getentropy>() function first appeared in glibc 2.25.
ru: Функция B<getentropy>() впервые появилась в glibc 2.25.

source: This function is nonstandard. It is also present on OpenBSD.
ru: Эта функция является нестандартной. Она также присутствует в OpenBSD.

source: The B<getentropy>() function is implemented using B<getrandom>(2).
ru: Функция B<getentropy>() реализована через вызов B<getrandom>(2).

source: Whereas the glibc wrapper makes B<getrandom>(2) a cancellation point, B<getentropy>() is not a cancellation point.
ru: Следует учитывать, что в glibc обертка делает B<getrandom>(2) точкой отмены, а точкой отмены B<getentropy>() не является.

source: B<getentropy>() is also declared in B<E<lt>sys/random.hE<gt>>. (No feature test macro need be defined to obtain the declaration from that header file.)
ru: Функция B<getentropy>() также объявлена в B<E<lt>sys/random.hE<gt>> (для получения этого объявления из заголовочного файла макроса тестирования свойств не требуется).

source: A call to B<getentropy>() may block if the system has just booted and the kernel has not yet collected enough randomness to initialize the entropy pool. In this case, B<getentropy>() will keep blocking even if a signal is handled, and will return only once the entropy pool has been initialized.
ru: Вызов B<getentropy>() может блокировать работу, если система только что загрузилась и ядро ещё не успело набрать достаточно случайных событий для инициализации пула энтропии. В этом случае B<getentropy>() продолжает блокировать работу даже при обработке сигнала и вернёт управление только после завершения инициализации пула энтропии.

source: getdirentries - get directory entries in a filesystem-independent format
ru: getdirentries - возвращает элементы каталога в формате, не зависящем от файловой системы

source: B<getdirentries>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getdirentries>(), начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: Read directory entries from the directory specified by I<fd> into I<buf>. At most I<nbytes> are read. Reading starts at offset I<*basep>, and I<*basep> is updated with the new position after reading.
ru: Данная функция считывает (не более I<nbytes> байтов) элементы каталога, указанного в I<fd>, в I<buf>. Чтение начинается со смещения I<*basep> и после чтения I<*basep> обновляется в соответствии с новой позицией.

source: B<getdirentries>() returns the number of bytes read or zero when at the end of the directory. If an error occurs, -1 is returned, and I<errno> is set appropriately.
ru: Функция B<getdirentries>() возвращает количество считанных байтов или ноль, если достигнут конец каталога. Если произошла ошибка, возвращается -1, и устанавливается, соответствующим образом, переменная I<errno>.

source: See the Linux library source code for details.
ru: Дополнительную информацию смотрите в исходном коде библиотеки Linux.

source: Not in POSIX.1. Present on the BSDs, and a few other systems. Use B<opendir>(3) and B<readdir>(3) instead.
ru: Нет в POSIX.1. Присутствует в BSD и многих других системах. Используйте вместо нее B<opendir>(3) и B<readdir>(3).

source: gets - get a string from standard input (DEPRECATED)
ru: gets - получает строку из стандартного потока ввода (УСТАРЕЛА)

source: I<Never use this function>.
ru: I<Никогда не используйте эту функцию>.

source: B<gets>() reads a line from I<stdin> into the buffer pointed to by I<s> until either a terminating newline or B<EOF>, which it replaces with a null byte (\(aq\e0\(aq). No check for buffer overrun is performed (see BUGS below).
ru: Функция B<gets>() считывает строку из I<stdin> и записывает её в буфер, на который указывает I<s>, пока не встретится символ новой строки или B<EOF>, которые заменяются байтом null (\(aq\e0\(aq). Проверка на переполнение буфера не производится (смотрите ДЕФЕКТЫ далее).

source: B<gets>() returns I<s> on success, and NULL on error or when end of file occurs while no characters have been read. However, given the lack of buffer overrun checking, there can be no guarantees that the function will even return.
ru: При успешном выполнении функция B<gets>() возвращает I<s> и NULL при ошибке или если достигнут конец файла, а символы остались несчитанными. Тем не менее, из-за невозможности проверить переполнение буфера, нет гарантии, что функция вообще что-нибудь сможет вернуть.

source: LSB deprecates B<gets>(). POSIX.1-2008 marks B<gets>() obsolescent. ISO C11 removes the specification of B<gets>() from the C language, and since version 2.16, glibc header files don't expose the function declaration if the B<_ISOC11_SOURCE> feature test macro is defined.
ru: В LSB функция B<gets>() указана как устаревшая. В POSIX.1-2008 функция B<gets>() как вышедшая из употребления. В ISO C11 описание B<gets>() удалено из языка Си, и начиная с версии 2.16, заголовочные файлы glibc не объявляют эту функцию, если не определён макрос тестирования свойств B<_ISOC11_SOURCE>.

source: Never use B<gets>(). Because it is impossible to tell without knowing the data in advance how many characters B<gets>() will read, and because B<gets>() will continue to store characters past the end of the buffer, it is extremely dangerous to use. It has been used to break computer security. Use B<fgets>() instead.
ru: Никогда не используйте B<gets>(), потому что без предварительного знакомства с данными невозможно узнать, какое количество символов считает B<gets>(), а также потому, что B<gets>() будет продолжать заносить символы в буфер даже по достижении его конца, что представляет собой большую опасность. Эта функция использовалась для взлома систем безопасности компьютера. Вместо этой функции используйте B<fgets>().

source: For more information, see CWE-242 (aka "Use of Inherently Dangerous Function") at http://cwe.mitre.org/data/definitions/242.html
ru: Подробное описание смотрите в CWE-242 (или «Use of Inherently Dangerous Function») на http://cwe.mitre.org/data/definitions/242.html
