Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The POSIX.1 specification for B<strptime>(3) contains conversion specifications using the B<%E> or B<%O> modifier, while such specifications are not given for B<getdate>(). In glibc, B<getdate>() is implemented using B<strptime>(3), so that precisely the same conversions are supported by both.
ru: В описании POSIX.1 для B<strptime>(3) содержится преобразуемые описатели использующие модификатор B<%E> или B<%O>, хотя эти описатели не указаны для B<getdate>(). В glibc, B<getdate>() реализована посредством B<strptime>(3), таким образом поддерживаются все возможные описатели.

source: The program below calls B<getdate>() for each of its command-line arguments, and for each call displays the values in the fields of the returned I<tm> structure. The following shell session demonstrates the operation of the program:
ru: Программа, представленная далее, вызывает B<getdate>() для каждого своего аргумента командной строки и при каждом вызове печатаются значения полей полученной структуры I<tm>. Следующий сеанс показывает работу программы:

source: $B< TFILE=$PWD/tfile> $B< echo \(aq%A\(aq E<gt> $TFILE > # Full name of the day of the week $B< echo \(aq%T\(aq E<gt>E<gt> $TFILE> # ISO date (YYYY-MM-DD) $B< echo \(aq%F\(aq E<gt>E<gt> $TFILE> # Time (HH:MM:SS) $B< date> $B< export DATEMSK=$TFILE> $B< ./a.out Tuesday \(aq2009-12-28\(aq \(aq12:22:33\(aq> Sun Sep 7 06:03:36 CEST 2008 Call 1 ("Tuesday") succeeded: tm_sec = 36 tm_min = 3 tm_hour = 6 tm_mday = 9 tm_mon = 8 tm_year = 108 tm_wday = 2 tm_yday = 252 tm_isdst = 1 Call 2 ("2009-12-28") succeeded: tm_sec = 36 tm_min = 3 tm_hour = 6 tm_mday = 28 tm_mon = 11 tm_year = 109 tm_wday = 1 tm_yday = 361 tm_isdst = 0 Call 3 ("12:22:33") succeeded: tm_sec = 33 tm_min = 22 tm_hour = 12 tm_mday = 7 tm_mon = 8 tm_year = 108 tm_wday = 0 tm_yday = 250 tm_isdst = 1
ru: $B< TFILE=$PWD/tfile> $B< echo \(aq%A\(aq E<gt> $TFILE > # полное название дня недели $B< echo \(aq%T\(aq E<gt>E<gt> $TFILE> # дата ISO (YYYY-MM-DD) $B< echo \(aq%F\(aq E<gt>E<gt> $TFILE> # время (HH:MM:SS) $B< date> $B< export DATEMSK=$TFILE> $B< ./a.out Tuesday \(aq2009-12-28\(aq \(aq12:22:33\(aq> Sun Sep 7 06:03:36 CEST 2008 Call 1 ("Tuesday"): tm_sec = 36 tm_min = 3 tm_hour = 6 tm_mday = 9 tm_mon = 8 tm_year = 108 tm_wday = 2 tm_yday = 252 tm_isdst = 1 Call 2 ("2009-12-28"): tm_sec = 36 tm_min = 3 tm_hour = 6 tm_mday = 28 tm_mon = 11 tm_year = 109 tm_wday = 1 tm_yday = 361 tm_isdst = 0 Call 3 ("12:22:33"): tm_sec = 33 tm_min = 22 tm_hour = 12 tm_mday = 7 tm_mon = 8 tm_year = 108 tm_wday = 0 tm_yday = 250 tm_isdst = 1

source: if (tmp == NULL) { printf("Call %d failed; getdate_err = %d\en", j, getdate_err); continue; }
ru: if (tmp == NULL) { printf("Ошибка вызова %d; getdate_err = %d\en", j, getdate_err); continue; }

source: printf("Call %d (\e"%s\e") succeeded:\en", j, argv[j]); printf(" tm_sec = %d\en", tmp-E<gt>tm_sec); printf(" tm_min = %d\en", tmp-E<gt>tm_min); printf(" tm_hour = %d\en", tmp-E<gt>tm_hour); printf(" tm_mday = %d\en", tmp-E<gt>tm_mday); printf(" tm_mon = %d\en", tmp-E<gt>tm_mon); printf(" tm_year = %d\en", tmp-E<gt>tm_year); printf(" tm_wday = %d\en", tmp-E<gt>tm_wday); printf(" tm_yday = %d\en", tmp-E<gt>tm_yday); printf(" tm_isdst = %d\en", tmp-E<gt>tm_isdst); }
ru: printf("Вызов %d (\e"%s\e"):\en", j, argv[j]); printf(" tm_sec = %d\en", tmp-E<gt>tm_sec); printf(" tm_min = %d\en", tmp-E<gt>tm_min); printf(" tm_hour = %d\en", tmp-E<gt>tm_hour); printf(" tm_mday = %d\en", tmp-E<gt>tm_mday); printf(" tm_mon = %d\en", tmp-E<gt>tm_mon); printf(" tm_year = %d\en", tmp-E<gt>tm_year); printf(" tm_wday = %d\en", tmp-E<gt>tm_wday); printf(" tm_yday = %d\en", tmp-E<gt>tm_yday); printf(" tm_isdst = %d\en", tmp-E<gt>tm_isdst); }

source: getopt, getopt_long, getopt_long_only, optarg, optind, opterr, optopt - Parse command-line options
ru: getopt, getopt_long, getopt_long_only, optarg, optind, opterr, optopt - разбираю параметры командной строки

source: The B<getopt>() function parses the command-line arguments. Its arguments I<argc> and I<argv> are the argument count and array as passed to the I<main>() function on program invocation. An element of I<argv> that starts with \(aq-\(aq (and is not exactly "-" or "--") is an option element. The characters of this element (aside from the initial \(aq-\(aq) are option characters. If B<getopt>() is called repeatedly, it returns successively each of the option characters from each of the option elements.
ru: Функция B<getopt>() разбирает аргументы командной строки. Её аргументы I<argc> и I<argv> являются счётчиком и массивом аргументов, которые передаются функции I<main>() при запуске программы. Элемент I<argv>, начинающийся с «-» (и не являющийся «-» или «--»), считается параметром. Символы этого элемента (не считая начального «-») являются символами параметра. При каждом повторном вызове B<getopt>() возвращают следующий символ параметра и так для каждого следующего параметра.

source: The variable I<optind> is the index of the next element to be processed in I<argv>. The system initializes this value to 1. The caller can reset it to 1 to restart scanning of the same I<argv>, or when scanning a new argument vector.
ru: Переменная I<optind> — это индекс следующего обрабатываемого элемента I<argv>. Система инициализирует это значение 1. Вызывающий может сбросить его в 1 для перезапуска сканирования того же I<argv>, или при сканировании нового вектора аргументов.

source: If B<getopt>() finds another option character, it returns that character, updating the external variable I<optind> and a static variable I<nextchar> so that the next call to B<getopt>() can resume the scan with the following option character or I<argv>-element.
ru: Если B<getopt>() встречает символ другого параметра, она возвращает этот символ, обновляя внешнюю переменную I<optind> и статическую переменную I<nextchar>, так что следующий вызов B<getopt>() может продолжить проверку с символа следующего параметра или элемента I<argv>.

source: If there are no more option characters, B<getopt>() returns -1. Then I<optind> is the index in I<argv> of the first I<argv>-element that is not an option.
ru: Если символов параметров больше нет, то B<getopt>() возвращает -1. При этом I<optind> станет индексом первого элемента I<argv>, не являющегося параметром.

source: I<optstring> is a string containing the legitimate option characters. If such a character is followed by a colon, the option requires an argument, so B<getopt>() places a pointer to the following text in the same I<argv>-element, or the text of the following I<argv>-element, in I<optarg>. Two colons mean an option takes an optional arg; if there is text in the current I<argv>-element (i.e., in the same word as the option name itself, for example, "-oarg"), then it is returned in I<optarg>, otherwise I<optarg> is set to zero. This is a GNU extension. If I<optstring> contains B<W> followed by a semicolon, then B<-W foo> is treated as the long option B<--foo>. (The B<-W> option is reserved by POSIX.2 for implementation extensions.) This behavior is a GNU extension, not available with libraries before glibc 2.
ru: Аргумент I<optstring> является строкой, содержащей допустимые символы параметров. Если за таким символом стоит двоеточие, то параметр требует указания аргумента. При этом B<getopt>() помещает указатель на следующий за символом параметра текст в тот же элемент I<argv>, или на текст следующего элемента I<argv> в I<optarg>. Два двоеточия означают, что параметр имеет необязательный аргумент; если текущий элемент I<argv> содержит текст (то есть в самом имени слова, например «-oarg»), то он возвращается в I<optarg>, в противном случае I<optarg> содержит ноль. Это является расширением GNU. Если I<optstring> содержит B<W>, за которой следует точка с запятой, то B<-W foo> рассматривается как длинный параметр B<--foo> (параметр B<-W> зарезервирован POSIX.2 для реализации расширений). Такое поведение является расширением GNU и недоступно в библиотеках до glibc 2.

source: By default, B<getopt>() permutes the contents of I<argv> as it scans, so that eventually all the nonoptions are at the end. Two other modes are also implemented. If the first character of I<optstring> is \(aq+\(aq or the environment variable B<POSIXLY_CORRECT> is set, then option processing stops as soon as a nonoption argument is encountered. If the first character of I<optstring> is \(aq-\(aq, then each nonoption I<argv>-element is handled as if it were the argument of an option with character code 1. (This is used by programs that were written to expect options and other I<argv>-elements in any order and that care about the ordering of the two.) The special argument "--" forces an end of option-scanning regardless of the scanning mode.
ru: По умолчанию B<getopt>() переставляет элементы содержимого I<argv> в процессе поиска, так что в конечном счёте все аргументы, не являющиеся параметрами, оказываются в конце. Реализованы также два других режима. Если первым символом I<optstring> является «+» или задана переменная окружения B<POSIXLY_CORRECT>, то обработка параметров прерывается сразу, как только находится символ не параметра. Если первым символом I<optstring> является «-», то каждый элемент I<argv>, не являющийся параметром, обрабатывается так, как если бы он был аргументом параметра с символом, имеющим код 1 (это используется программами, которые требуют параметры и другие элементы I<argv> в любом порядке и их порядок важен). Специальный аргумент «--» служит для обозначения конца параметров независимо от режима.

source: While processing the option list, B<getopt>() can detect two kinds of errors: (1) an option character that was not specified in I<optstring> and (2) a missing option argument (i.e., an option at the end of the command line without an expected argument). Such errors are handled and reported as follows:
ru: При обработке списка параметров B<getopt>() может определить два типа ошибок: (1) — символ параметра, не заданный в I<optstring> и (2) — отсутствующий аргумент параметра (т. е., параметра в конце командной строки без ожидаемого аргумента). Эти ошибки обрабатываются и о них сообщается следующем образом:

source: By default, B<getopt>() prints an error message on standard error, places the erroneous option character in I<optopt>, and returns \(aq?\(aq as the function result.
ru: По умолчанию, B<getopt>() печатает сообщение об ошибке в стандартный поток ошибок, помещает ошибочный символ параметра в I<optopt> и возвращает \(aq?\(aq как результат функции.

source: If the caller has set the global variable I<opterr> to zero, then B<getopt>() does not print an error message. The caller can determine that there was an error by testing whether the function return value is \(aq?\(aq. (By default, I<opterr> has a nonzero value.)
ru: Если вызывающий присвоил глобальной переменной I<opterr> значение 0, то B<getopt>() не печатает сообщение об ошибке. Вызывающий может определить, что произошла ошибка, сравнив возвращаемое значение функции с \(aq?\(aq (по умолчанию I<opterr> имеет ненулевое значение).

source: If the first character (following any optional \(aq+\(aq or \(aq-\(aq described above) of I<optstring> is a colon (\(aq:\(aq), then B<getopt>() likewise does not print an error message. In addition, it returns \(aq:\(aq instead of \(aq?\(aq to indicate a missing option argument. This allows the caller to distinguish the two different types of errors.
ru: Если первый символ (после необязательных \(aq+\(aq или \(aq-\(aq, описанных выше) I<optstring> — двоеточие (\(aq:\(aq), то B<getopt>() также не печатает сообщение об ошибке. При этом возвращается \(aq:\(aq вместо \(aq?\(aq, что показывает отсутствие аргумента параметра. Это позволяет вызывающему отличить один тип ошибок от другого.

source: getopt_long() and getopt_long_only()
ru: getopt_long() и getopt_long_only()

source: The B<getopt_long>() function works like B<getopt>() except that it also accepts long options, started with two dashes. (If the program accepts only long options, then I<optstring> should be specified as an empty string (""), not NULL.) Long option names may be abbreviated if the abbreviation is unique or is an exact match for some defined option. A long option may take a parameter, of the form B<--arg=param> or B<--arg param>.
ru: Функция B<getopt_long>() работает так же, как B<getopt>(), за исключением того, что она воспринимает и длинные параметры, начинающиеся с двух дефисов (если программа принимает только длинные параметры, то значение I<optstring> должно быть равно пустой строке (""), не NULL). Длинные параметры можно сокращать, если сокращение сохраняет уникальность параметра или полностью совпадает с одним из определённых параметров. Длинный параметр может иметь значение вида B<--параметр=значение> или B<--параметр значение>.

source: I<longopts> is a pointer to the first element of an array of I<struct option> declared in I<E<lt>getopt.hE<gt>> as
ru: Аргумент I<longopts> является указателем на первый элемент массива структур I<struct option>, объявленного в I<E<lt>getopt.hE<gt>> следующим образом

source: The meanings of the different fields are:
ru: Значения различных полей:

source: is the name of the long option.
ru: имя длинного параметра

source: is: B<no_argument> (or 0) if the option does not take an argument; B<required_argument> (or 1) if the option requires an argument; or B<optional_argument> (or 2) if the option takes an optional argument.
ru: может быть: B<no_argument> (или 0), если параметр не требует значения; B<required_argument> (или 1), если параметр требует значения; B<optional_argument> (или 2), если параметр может иметь необязательное значение.

source: specifies how results are returned for a long option. If I<flag> is NULL, then B<getopt_long>() returns I<val>. (For example, the calling program may set I<val> to the equivalent short option character.) Otherwise, B<getopt_long>() returns 0, and I<flag> points to a variable which is set to I<val> if the option is found, but left unchanged if the option is not found.
ru: способ возвращения результатов для длинного параметра. Если I<flag> равен NULL, то B<getopt_long>() возвращает I<val> (например, вызывающая программа может назначить I<val> эквивалентом символа короткого параметра). В противном случае B<getopt_long>() возвращает 0, а I<flag> указывает на переменную, устанавливаемое значение которой равно I<val>, если параметр найден; и оставляемую без изменений, если параметр не найден.

source: is the value to return, or to load into the variable pointed to by I<flag>.
ru: значение, которое возвращается или загружается в переменную, на которую указывает I<flag>.

source: The last element of the array has to be filled with zeros.
ru: Последний элемент массива должен быть заполнен нулями.

source: If I<longindex> is not NULL, it points to a variable which is set to the index of the long option relative to I<longopts>.
ru: Если I<longindex> не равен NULL, то он указывает на переменную, содержащую индекс длинного параметра в соответствии с I<longopts>.

source: B<getopt_long_only>() is like B<getopt_long>(), but \(aq-\(aq as well as "--" can indicate a long option. If an option that starts with \(aq-\(aq (not "--") doesn't match a long option, but does match a short option, it is parsed as a short option instead.
ru: Функция B<getopt_long_only>() работает так же, как B<getopt_long>(), но в качестве указателя длинного параметра может служить не только «--», но и «-». Если параметр, начинающийся с «-» (не с «--»), не совпадает с длинным параметром, но совпадает с коротким, то он обрабатывается как короткий параметр.

source: If an option was successfully found, then B<getopt>() returns the option character. If all command-line options have been parsed, then B<getopt>() returns -1. If B<getopt>() encounters an option character that was not in I<optstring>, then \(aq?\(aq is returned. If B<getopt>() encounters an option with a missing argument, then the return value depends on the first character in I<optstring>: if it is \(aq:\(aq, then \(aq:\(aq is returned; otherwise \(aq?\(aq is returned.
ru: Если параметр найден, то B<getopt>() возвращает символ параметра. Если все параметры командной строки обработаны, то B<getopt>() возвращает -1. Если B<getopt>() находит символ, которого нет в I<optstring>, то возвращается «?». Если B<getopt>() находит символ с отсутствующим аргументом, то возвращаемое значение зависит от первого символа I<optstring>: если это «:», то возвращается «:», в противном случае возвращается «?».

source: B<getopt_long>() and B<getopt_long_only>() also return the option character when a short option is recognized. For a long option, they return I<val> if I<flag> is NULL, and 0 otherwise. Error and -1 returns are the same as for B<getopt>(), plus \(aq?\(aq for an ambiguous match or an extraneous parameter.
ru: Функции B<getopt_long>() и B<getopt_long_only>() также возвращают символ параметра, если распознан короткий параметр. Для длинного параметра они возвращают I<val>, если I<flag> равен NULL, и 0 в противном случае. Возвращаемые ошибки и -1 имеют то же значение, что и для B<getopt>(), кроме того, «?» возвращается при двусмысленном толковании параметра.

source: If this is set, then option processing stops as soon as a nonoption argument is encountered.
ru: Если установлена эта переменная, то обработка параметров прерывается на первом аргументе, не являющемся параметром.

source: This variable was used by B<bash>(1) 2.0 to communicate to glibc which arguments are the results of wildcard expansion and so should not be considered as options. This behavior was removed in B<bash>(1) version 2.01, but the support remains in glibc.
ru: Эта переменная использовалась B<bash>(1) 2.0 для связи с glibc, аргументы которой являются результатом раскрытия шаблонов и, таким образом, не должны рассматриваться как параметры. Такое поведение было удалено из B<bash>(1) версии 2.01, но поддержка осталась в glibc.

source: POSIX.1-2001, POSIX.1-2008, and POSIX.2, provided the environment variable B<POSIXLY_CORRECT> is set. Otherwise, the elements of I<argv> aren't really I<const>, because we permute them. We pretend they're I<const> in the prototype to be compatible with other systems.
ru: В POSIX.1-2001, POSIX.1-2008 и POSIX.2 описана переменная окружения B<POSIXLY_CORRECT>. В противном случае элементы I<argv> на самом деле не являются I<const>, потому что мы изменяем их порядок. Мы будем считать их I<const> в прототипах для совместимости этих прототипов с другими операционными системами.

source: The use of \(aq+\(aq and \(aq-\(aq in I<optstring> is a GNU extension.
ru: Использование «+» и «-» в I<optstring> является расширением GNU.

source: On some older implementations, B<getopt>() was declared in I<E<lt>stdio.hE<gt>>. SUSv1 permitted the declaration to appear in either I<E<lt>unistd.hE<gt>> or I<E<lt>stdio.hE<gt>>. POSIX.1-1996 marked the use of I<E<lt>stdio.hE<gt>> for this purpose as LEGACY. POSIX.1-2001 does not require the declaration to appear in I<E<lt>stdio.hE<gt>>.
ru: В некоторых старых реализациях B<getopt>() объявлялась в I<E<lt>stdio.hE<gt>>. В SUSv1 разрешено её объявлять в I<E<lt>unistd.hE<gt>> или I<E<lt>stdio.hE<gt>>. В POSIX.1-1996 отмечено, что использование I<E<lt>stdio.hE<gt>> УСТАРЕЛО. В POSIX.1-2001 не требуется объявлять эту функцию в I<E<lt>stdio.hE<gt>>.

source: B<getopt_long>() and B<getopt_long_only>():
ru: B<getopt_long>() и B<getopt_long_only>():

source: These functions are GNU extensions.
ru: Эти функции являются расширениями GNU.

source: A program that scans multiple argument vectors, or rescans the same vector more than once, and wants to make use of GNU extensions such as \(aq+\(aq and \(aq-\(aq at the start of I<optstring>, or changes the value of B<POSIXLY_CORRECT> between scans, must reinitialize B<getopt>() by resetting I<optind> to 0, rather than the traditional value of 1. (Resetting to 0 forces the invocation of an internal initialization routine that rechecks B<POSIXLY_CORRECT> and checks for GNU extensions in I<optstring>.)
ru: В программе, где анализируется несколько векторов параметров, или разбирается один вектор более одного раза и нужно использовать расширения GNU «+» и «-» в начале I<optstring> или изменять значение B<POSIXLY_CORRECT> между разборами, должна повторно инициализировать B<getopt>() сбрасывая I<optind> в 0, а не в обычное значение 1 (сброс в 0 вызывает принудительный вызов внутренней процедуры, повторно проверяющей B<POSIXLY_CORRECT> и расширения GNU в I<optstring>).

source: The following trivial example program uses B<getopt>() to handle two program options: I<-n>, with no associated value; and I<-t val>, which expects an associated value.
ru: В приведённом ниже пример программы B<getopt>() используется два параметра программы: I<-n> без значения и I<-t значение> со значением.

source: nsecs = 0; tfnd = 0; flags = 0; while ((opt = getopt(argc, argv, "nt:")) != -1) { switch (opt) { case \(aqn\(aq: flags = 1; break; case \(aqt\(aq: nsecs = atoi(optarg); tfnd = 1; break; default: /* \(aq?\(aq */ fprintf(stderr, "Usage: %s [-t nsecs] [-n] name\en", argv[0]); exit(EXIT_FAILURE); } }
ru: nsecs = 0; tfnd = 0; flags = 0; while ((opt = getopt(argc, argv, "nt:")) != -1) { switch (opt) { case \(aqn\(aq: flags = 1; break; case \(aqt\(aq: nsecs = atoi(optarg); tfnd = 1; break; default: /* \(aq?\(aq */ fprintf(stderr, "Использование: %s [-t nsecs] [-n] имя\en", argv[0]); exit(EXIT_FAILURE); } }

source: if (optind E<gt>= argc) { fprintf(stderr, "Expected argument after options\en"); exit(EXIT_FAILURE); }
ru: if (optind E<gt>= argc) { fprintf(stderr, "После параметра требуется значение\en"); exit(EXIT_FAILURE); }

source: printf("name argument = %s\en", argv[optind]);
ru: printf("параметр = %s\en", argv[optind]);

source: /* Other code omitted */
ru: /* остальной код не показан */

source: The following example program illustrates the use of B<getopt_long>() with most of its features.
ru: Приведённый ниже пример программы иллюстрирует использование большинства возможностей B<getopt_long>().

source: #include E<lt>stdio.hE<gt> /* for printf */ #include E<lt>stdlib.hE<gt> /* for exit */ #include E<lt>getopt.hE<gt>
ru: #include E<lt>stdio.hE<gt> /* для printf */ #include E<lt>stdlib.hE<gt> /* для exit */ #include E<lt>getopt.hE<gt>

source: switch (c) { case 0: printf("option %s", long_options[option_index].name); if (optarg) printf(" with arg %s", optarg); printf("\en"); break;
ru: switch (c) { case 0: printf("параметр %s", long_options[option_index].name); if (optarg) printf(" со значением %s", optarg); printf("\en"); break;

source: case \(aq0\(aq: case \(aq1\(aq: case \(aq2\(aq: if (digit_optind != 0 && digit_optind != this_option_optind) printf("digits occur in two different argv-elements.\en"); digit_optind = this_option_optind; printf("option %c\en", c); break;
ru: case \(aq0\(aq: case \(aq1\(aq: case \(aq2\(aq: if (digit_optind != 0 && digit_optind != this_option_optind) printf("Встречена цифра в двух различных элементах argv.\en"); digit_optind = this_option_optind; printf("параметр %c\en", c); break;

source: case \(aqa\(aq: printf("option a\en"); break;
ru: case \(aqa\(aq: printf("параметр a\en"); break;

source: case \(aqb\(aq: printf("option b\en"); break;
ru: case \(aqb\(aq: printf("параметр b\en"); break;

source: case \(aqc\(aq: printf("option c with value \(aq%s\(aq\en", optarg); break;
ru: case \(aqc\(aq: printf("параметр c со значением «%s»\en", optarg); break;

source: case \(aqd\(aq: printf("option d with value \(aq%s\(aq\en", optarg); break;
ru: case \(aqd\(aq: printf("параметр d со значением «%s»\en", optarg); break;

source: default: printf("?? getopt returned character code 0%o ??\en", c); } }
ru: default: printf("?? getopt вернула код символа 0%o ??\en", c); } }
