Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: These system calls deal with per-thread robust futex lists. These lists are managed in user space: the kernel knows only about the location of the head of the list. A thread can inform the kernel of the location of its robust futex list using B<set_robust_list>(). The address of a thread's robust futex list can be obtained using B<get_robust_list>().
ru: Данные системные вызовы служат для ведения понетевых списков надёжных фьютексов. Данные списки управляются из пользовательского пространства: ядро знает только расположение начала списка. Нить может информировать ядро о расположении своего списка надёжных фьютексов с помощью B<set_robust_list>(). Адрес списка надёжных фьютексов нити можно получить с помощью B<get_robust_list>().

source: The purpose of the robust futex list is to ensure that if a thread accidentally fails to unlock a futex before terminating or calling B<execve>(2), another thread that is waiting on that futex is notified that the former owner of the futex has died. This notification consists of two pieces: the B<FUTEX_OWNER_DIED> bit is set in the futex word, and the kernel performs a B<futex>(2) B<FUTEX_WAKE> operation on one of the threads waiting on the futex.
ru: Предназначением списка надёжных фьютексов является гарантия того, что если нить неожиданно из-за ошибки не разблокирует фьютекс перед завершением или вызовом B<execve>(2), другая ожидающая этот фьютекс нить получит уведомление о том, что бывший владелец фьютекса прекратил работу. Данное уведомление состоит из двух частей: установленного бита B<FUTEX_OWNER_DIED> в слове фьютекса и выполнение ядром B<futex>(2) с операцией B<FUTEX_WAKE> для одной из нитей, ожидающих фьютекс.

source: The B<get_robust_list>() system call returns the head of the robust futex list of the thread whose thread ID is specified in I<pid>. If I<pid> is 0, the head of the list for the calling thread is returned. The list head is stored in the location pointed to by I<head_ptr>. The size of the object pointed to by I<**head_ptr> is stored in I<len_ptr>.
ru: Системный вызов B<get_robust_list>() возвращает начало списка надёжных фьютексов нити, идентификатор которой указан в I<pid>. Если значение I<pid> равно 0, то возвращается начало списка вызывающей нити. Начало списка сохраняется в расположение, указанное I<head_ptr>. Размер объекта, указываемый I<**head_ptr>, сохраняется в I<len_ptr>.

source: Permission to employ B<get_robust_list>() is governed by a ptrace access mode B<PTRACE_MODE_READ_REALCREDS> check; see B<ptrace>(2).
ru: Право вызывать B<get_robust_list>() определяется проверкой режима доступа ptrace B<PTRACE_MODE_READ_REALCREDS>; смотрите B<ptrace>(2).

source: The B<set_robust_list>() system call requests the kernel to record the head of the list of robust futexes owned by the calling thread. The I<head> argument is the list head to record. The I<len> argument should be I<sizeof(*head)>.
ru: Системный вызов B<set_robust_list>() запрашивает ядро записать начало списка надёжных фьютексов, принадлежащего вызывающей нити. Аргумент I<head> содержит начало списка для записи. Аргумент I<len> должен быть равен I<sizeof(*head)>.

source: The B<set_robust_list>() and B<get_robust_list>() system calls return zero when the operation is successful, an error code otherwise.
ru: Системные вызовы B<set_robust_list>() и B<get_robust_list>() возвращают ноль при успешном выполнении и код ошибки в противном случае.

source: The B<set_robust_list>() system call can fail with the following error:
ru: Системный вызов B<pthread_setcancelstate>() может завершиться со следующей ошибкой:

source: I<len> does not equal I<sizeof(struct\ robust_list_head)>.
ru: Значение I<len> не равно I<sizeof(struct\ robust_list_head)>.

source: The B<get_robust_list>() system call can fail with the following errors:
ru: Системный вызов B<get_robust_list>() может завершиться со следующими ошибками:

source: The calling process does not have permission to see the robust futex list of the thread with the thread ID I<pid>, and does not have the B<CAP_SYS_PTRACE> capability.
ru: Вызывающий процесс не имеет прав на просмотр списка надёжных фьютексов нити с идентификатором I<pid> и не имеет мандата B<CAP_SYS_PTRACE>.

source: No thread with the thread ID I<pid> could be found.
ru: Нить с идентификатором I<pid> не найдена.

source: The head of the robust futex list can't be stored at the location I<head>.
ru: Начало списка надёжных фьютексов невозможно сохранить в расположение I<head>.

source: These system calls were added in Linux 2.6.17.
ru: Данные системные вызовы были добавлены в Linux 2.6.17.

source: These system calls are not needed by normal applications. No support for them is provided in glibc. In the unlikely event that you want to call them directly, use B<syscall>(2).
ru: Эти системные вызовы не нужны обычным приложениям. Поддержка в glibc отсутствует. В маловероятном случае, когда вы хотите вызвать их напрямую, используйте B<syscall>(2).

source: A thread can have only one robust futex list; therefore applications that wish to use this functionality should use the robust mutexes provided by glibc.
ru: В нити может быть только один список надёжных фьютексов; поэтому приложения, которым требуется данное свойство, должны использовать мьютексы, предоставляемые glibc.

source: In the initial implementation, a thread waiting on a futex was notified that the owner had died only if the owner terminated. Starting with Linux 2.6.28, notification was extended to include the case where the owner performs an B<execve>(2).
ru: В первоначальной реализации нить, ожидающая фьютекс, уведомлялась о кончине владельца только, если владелец прекращал работу. Начиная с Linux 2.6.28 уведомление также посылается при выполнении владельцем B<execve>(2).

source: The thread IDs mentioned in the main text are I<kernel> thread IDs of the kind returned by B<clone>(2) and B<gettid>(2).
ru: Идентификаторы нитей, упоминаемые в основном тексте, являются I<ядерными> идентификаторами нити, которые возвращаются из B<clone>(2) и B<gettid>(2).

source: I<Documentation/robust-futexes.txt> and I<Documentation/robust-futex-ABI.txt> in the Linux kernel source tree
ru: Файлы I<Documentation/robust-futexes.txt> и I<Documentation/robust-futex-ABI.txt> в дереве исходного кода ядра Linux

source: getuid, geteuid - get user identity
ru: getuid, geteuid - получить идентификатор пользователя

source: B<getuid>() returns the real user ID of the calling process.
ru: B<getuid>() возвращает фактический идентификатор (ID) пользователя вызывающего процесса.

source: B<geteuid>() returns the effective user ID of the calling process.
ru: B<geteuid>() возвращает эффективный идентификатор пользователя вызывающего процесса.

source: History
ru: История

source: In UNIX\ V6 the B<getuid>() call returned I<(euid E<lt>E<lt> 8) + uid>. UNIX\ V7 introduced separate calls B<getuid>() and B<geteuid>().
ru: В UNIX\ V6 вызов B<getuid>() возвращал I<(euid E<lt>E<lt> 8) + uid>. В UNIX\ V7 появились отдельные вызовы B<getuid>() и B<geteuid>().

source: The original Linux B<getuid>() and B<geteuid>() system calls supported only 16-bit user IDs. Subsequently, Linux 2.4 added B<getuid32>() and B<geteuid32>(), supporting 32-bit IDs. The glibc B<getuid>() and B<geteuid>() wrapper functions transparently deal with the variations across kernel versions.
ru: Первоначальные версии системных вызовов B<getuid>() и B<geteuid>() в Linux поддерживали только 16-битные идентификаторы пользователей и групп. Позднее в Linux 2.4 были добавлены вызовы B<getuid32>() и B<geteuid32>(), поддерживающие 32-битные идентификаторы. В glibc обёрточные функции B<getuid>() и B<geteuid>() работают одинаково вне зависимости от версий ядра.

source: On Alpha, instead of a pair of B<getuid>() and B<geteuid>() system calls, a single B<getxuid>() system call is provided, which returns a pair of real and effective UIDs. The glibc B<getuid>() and B<geteuid>() wrapper functions transparently deal with this. See B<syscall>(2) for details regarding register mapping.
ru: На Alpha вместо пары системных вызовов B<getuid>() и B<geteuid>() предоставляется один B<getxuid>(), который возвращает пару реальный и эффективный UID. Обёрточные функции glibc B<getuid>() и B<geteuid>() скрывают это. Подробности об отображении регистров смотрите в B<syscall>(2).

source: getdomainname, setdomainname - get/set NIS domain name
ru: getdomainname, setdomainname - получить/установить имя домена NIS

source: These functions are used to access or to change the NIS domain name of the host system.
ru: Эти функции используются для доступа к имени узла домена NIS или для его изменения.

source: B<setdomainname>() sets the domain name to the value given in the character array I<name>. The I<len> argument specifies the number of bytes in I<name>. (Thus, I<name> does not require a terminating null byte.)
ru: B<setdomainname>() изменяет доменное имя на значение, указанное в массиве символов I<name>. В аргументе I<len> задаётся количество байт в I<name>. (То есть I<name> может не завершаться байтом с null.)

source: B<getdomainname>() returns the null-terminated domain name in the character array I<name>, which has a length of I<len> bytes. If the null-terminated domain name requires more than I<len> bytes, B<getdomainname>() returns the first I<len> bytes (glibc) or gives an error (libc).
ru: B<getdomainname>() возвращает доменное имя с null на конце в массиве символов I<name>, который имеет длину I<len> байт. Если для доменного имени с null на конце требуется больше чем I<len> байт, то B<getdomainname>() возвращает первые I<len> байт (glibc) или возвращает ошибку (libc).

source: B<setdomainname>() can fail with the following errors:
ru: B<setdomainname>() может завершиться со следующими ошибками:

source: I<name> pointed outside of user address space.
ru: I<name> указывает за пределы пользовательского адресного пространства.

source: I<len> was negative or too large.
ru: Значение I<len> отрицательно или слишком большое.

source: The caller did not have the B<CAP_SYS_ADMIN> capability in the user namespace associated with its UTS namespace (see B<namespaces>(7)).
ru: У вызывающего нет мандата B<CAP_SYS_ADMIN> в пользовательском пространстве имён, связанном с его пространством имён UTS (смотрите B<namespaces>(7)).

source: B<getdomainname>() can fail with the following errors:
ru: B<getdomainname>() может завершиться со следующими ошибками:

source: For B<getdomainname>() under libc: I<name> is NULL or I<name> is longer than I<len> bytes.
ru: Для B<getdomainname>() в libc: значение I<name> равно NULL или I<name> длиннее чем I<len> байт.

source: POSIX does not specify these calls.
ru: В POSIX нет этих вызовов.

source: Since Linux 1.0, the limit on the length of a domain name, including the terminating null byte, is 64 bytes. In older kernels, it was 8 bytes.
ru: Начиная с Linux 1.0, длина доменного имени, включая завершающий байт с null, ограничена 64 байтами. В более старых ядрах ограничение было 8 байт.

source: On most Linux architectures (including x86), there is no B<getdomainname>() system call; instead, glibc implements B<getdomainname>() as a library function that returns a copy of the I<domainname> field returned from a call to B<uname>(2).
ru: На большинстве архитектур Linux (включая x86), системный вызов B<getdomainname>() отсутствует; вместо него в библиотеке glibc реализована функция B<getdomainname>(), которая возвращает копию поля I<domainname>, которую возвращает вызов B<uname>(2).

source: get_kernel_syms - retrieve exported kernel and module symbols
ru: get_kernel_syms - получить экспортируемые символы ядра и модулей

source: I<Note>: No declaration of this system call is provided in glibc headers; see NOTES.
ru: I<Замечание>: В заголовочных файлах glibc этой системный вызов отсутствует; смотрите ЗАМЕЧАНИЯ.

source: B<Note>: This system call is present only in kernels before Linux 2.6.
ru: B<Замечание>: Данный системный вызов доступен только в ядрах до Linux 2.6.

source: If I<table> is NULL, B<get_kernel_syms>() returns the number of symbols available for query. Otherwise, it fills in a table of structures:
ru: Если I<table> равно NULL, то B<get_kernel_syms>() возвращает количество символов доступных для запроса. Иначе таблица заполняется структурами:

source: The symbols are interspersed with magic symbols of the form B<#>I<module-name> with the kernel having an empty name. The value associated with a symbol of this form is the address at which the module is loaded.
ru: Символы вида B<#>I<module-name> представляют собой ссылки на модули. Значение, связанное с таким символом, содержит адрес, по которому загружен модуль.

source: The symbols exported from each module follow their magic module tag and the modules are returned in the reverse of the order in which they were loaded.
ru: К символам, экспортируемым из модуля, добавляется метка модуля, а модули возвращаются в обратном порядке, в котором были загружены.

source: On success, returns the number of symbols copied to I<table>. On error, -1 is returned and I<errno> is set appropriately.
ru: При успешном выполнении возвращается количество символов, скопированных в I<table>. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: There is only one possible error return:
ru: Может возвращаться только одна ошибка:

source: B<get_kernel_syms>() is not supported in this version of the kernel.
ru: Вызов B<get_kernel_syms>() не поддерживается в этой версии ядра.

source: This system call is present on Linux only up until kernel 2.4; it was removed in Linux 2.6.
ru: Данный системный вызов есть только в Linux до версии 2.4; он был удалён в Linux 2.6.

source: B<get_kernel_syms>() is Linux-specific.
ru: Вызов B<get_kernel_syms>() есть только в Linux.

source: This obsolete system call is not supported by glibc. No declaration is provided in glibc headers, but, through a quirk of history, glibc versions before 2.23 did export an ABI for this system call. Therefore, in order to employ this system call, it was sufficient to manually declare the interface in your code; alternatively, you could invoke the system call using B<syscall>(2).
ru: Устаревший системный вызов, не поддерживается glibc. В заголовочных файлах glibc он не объявлен, но в недавнем прошлом версии glibc до 2.23 экспортировали ABI для этого системного вызова. Поэтому, чтобы получить данный системный вызов достаточно вручную объявить интерфейс в своём коде; или же можно вызвать его через B<syscall>(2).

source: There is no way to indicate the size of the buffer allocated for I<table>. If symbols have been added to the kernel since the program queried for the symbol table size, memory will be corrupted.
ru: Нет способа указать размер буфера, выделенного для I<table>. Если символы были добавлены в ядро после того, как программа запросила размер таблицы символов, то это вызовет повреждение данных в памяти.

source: The length of exported symbol names is limited to 59 characters.
ru: Длина имён экспортируемых символов ограничена 59 знаками.

source: Because of these limitations, this system call is deprecated in favor of B<query_module>(2) (which is itself nowadays deprecated in favor of other interfaces described on its manual page).
ru: Из-за этих ограничений вместо данного системного вызова рекомендуется использовать B<query_module>(2) (который, в настоящее время, тоже устарел и заменён на другие интерфейсы, перечисленные в конце этой справочной страницы).

source: group - user group file
ru: group - файл групп пользователей

source: The I</etc/group> file is a text file that defines the groups on the system. There is one entry per line, with the following format:
ru: В текстовом файле I</etc/group> описаны группы в системе. В каждой строке файла содержится одна запись следующего формата:

source: The fields are as follows:
ru: Поля:

source: the name of the group.
ru: имя группы

source: the (encrypted) group password. If this field is empty, no password is needed.
ru: пароль группы (в зашифрованном виде). Если это поле пустое, то пароль не нужен.

source: the numeric group ID.
ru: числовой идентификатор (ID) группы.

source: a list of the usernames that are members of this group, separated by commas.
ru: разделённые запятыми имена всех пользователей, которые являются членами данной группы.

source: FILES
ru: ФАЙЛЫ

source: As the 4.2BSD B<initgroups>(3) man page says: no one seems to keep I</etc/group> up-to-date.
ru: Согласно справочной страницы 4.2BSD B<initgroups>(3): похоже, никто не поддерживает актуальность I</etc/group>.

source: gai.conf - getaddrinfo(3) configuration file
ru: gai.conf - файл настройки getaddrinfo(3)

source: A call to B<getaddrinfo>(3) might return multiple answers. According to RFC\ 3484 these answers must be sorted so that the answer with the highest success rate is first in the list. The RFC provides an algorithm for the sorting. The static rules are not always adequate, though. For this reason, the RFC also requires that system administrators should have the possibility to dynamically change the sorting. For the glibc implementation, this can be achieved with the I</etc/gai.conf> file.
ru: Вызов B<getaddrinfo>(3) может вернуть несколько результатов. Согласно RFC\ 3484 эти результаты должны быть отсортированы так, что первым в списке будет ответ с высшим показателем достоверности (success rate). В RFC имеется алгоритм сортировки. Но статические правила не всегда приемлемы. По этой причине в RFC также требуется, чтобы системный администратор имел возможность динамически изменять сортировку. В реализации glibc это можно делать через файл I</etc/gai.conf>.

source: Each line in the configuration file consists of a keyword and its parameters. White spaces in any place are ignored. Lines starting with \(aq#\(aq are comments and are ignored.
ru: Каждая строка файла настройки состоит из ключевого слова и его параметров. Пробельные символы в любом месте игнорируются. Строки, начинающиеся с \(aq#\(aq, являются комментариями и игнорируются.

source: The keywords currently recognized are:
ru: Распознаваемые ключевые слова:

source: B<label> I<netmask> I<precedence>
ru: B<label> I<маска_сети> I<приоритет>

source: The value is added to the label table used in the RFC\ 3484 sorting. If any B<label> definition is present in the configuration file, the default table is not used. All the label definitions of the default table which are to be maintained have to be duplicated. Following the keyword, the line has to contain a network mask and a precedence value.
ru: Значение, добавляемое в таблицу ярлыков (label), используемую в RFC\ 3484 при сортировке. Если определение B<label>, имеющееся в файле настройке, существует, то таблица по умолчанию не используется. Все определения ярлыков таблицы по умолчанию, которые нужно поддерживать, будут являться дублями. За ключевым словом указывается маска сети и значение приоритета.

source: B<precedence> I<netmask> I<precedence>
ru: B<precedence> I<маска_сети> I<приоритет>

source: This keyword is similar to B<label>, but instead the value is added to the precedence table as specified in RFC\ 3484. Once again, the presence of a single B<precedence> line in the configuration file causes the default table to not be used.
ru: Данное ключевое слово подобно B<label>, но значение добавляется в таблицу приоритетов (precedence), как описано в RFC\ 3484. И здесь наличие единственной строки B<precedence> в файле настройки отключает использование таблицы по умолчанию.

source: This keyword controls whether a process checks whether the configuration file has been changed since the last time it was read. If the value is "B<yes>", the file is reread. This might cause problems in multithreaded applications and is generally a bad idea. The default is "B<no>".
ru: Данное ключевое слово определяет будет ли процесс проверять изменился ли файл настройки с момента последнего чтения. Если значение B<yes>, то файл перечитывается. Это может привести к проблемам в многонитевых приложениях. Значение по умолчанию B<no>.

source: B<scopev4> I<mask> I<value>
ru: B<scopev4> I<маска> I<значение>

source: Add another rule to the RFC\ 3484 scope table for IPv4 address. By default, the scope IDs described in section 3.2 in RFC\ 3438 are used. Changing these defaults should hardly ever be necessary.
ru: Добавляет новое правило в таблицу областей RFC\ 3484 для адресов IPv4. По умолчанию используются ID областей, описанные в разделе 3.2 RFC\ 3438. Изменять значения по умолчанию почти никогда не требуется.

source: The I<gai.conf> file is supported by glibc since version 2.5.
ru: Файл I<gai.conf> поддерживается glibc начиная с версии 2.5.

source: The default table according to RFC\ 3484 would be specified with the following configuration file:
ru: Таблица по умолчанию согласно RFC\ 3484 должна задаваться следующим файлом настройки:

source: gethostbyname, gethostbyaddr, sethostent, gethostent, endhostent, h_errno, herror, hstrerror, gethostbyaddr_r, gethostbyname2, gethostbyname2_r, gethostbyname_r, gethostent_r - get network host entry
ru: gethostbyname, gethostbyaddr, sethostent, gethostent, endhostent, h_errno, herror, hstrerror, gethostbyaddr_r, gethostbyname2, gethostbyname2_r, gethostbyname_r, gethostent_r - получение записи о сетевом узле

source: B<#include E<lt>sys/socket.hE<gt>> /* for AF_INET */ B<struct hostent *gethostbyaddr(const void *>I<addr>B<,> B< socklen_t >I<len>B<, int >I<type>B<);>
ru: B<#include E<lt>sys/socket.hE<gt>> /* для AF_INET */ B<struct hostent *gethostbyaddr(const void *>I<addr>B<,> B< socklen_t >I<len>B<, int >I<type>B<);>

source: /* System V/POSIX extension */ B<struct hostent *gethostent(void);>
ru: /* расширение System V/POSIX */ B<struct hostent *gethostent(void);>

source: /* GNU extensions */ B<struct hostent *gethostbyname2(const char *>I<name>B<, int >I<af>B<);>
ru: /* расширения GNU */ B<struct hostent *gethostbyname2(const char *>I<name>B<, int >I<af>B<);>

source: Glibc versions up to and including 2.19:
ru: Версии glibc по 2.19 включительно:

source: Glibc 2.8 to 2.19:
ru: Версии glibc с 2.8 по 2.19:

source: Before glibc 2.8:
ru: До glibc 2.8:

source: none
ru: ни одного

source: Since glibc 2.19
ru: Начиная с glibc 2.19

source: Glibc 2.12 to 2.19:
ru: Версии glibc с 2.12 по 2.19:

source: Before glibc 2.12:
ru: До glibc 2.12:

source: The B<gethostbyname*>(), B<gethostbyaddr*>(), B<herror>(), and B<hstrerror>() functions are obsolete. Applications should use B<getaddrinfo>(3), B<getnameinfo>(3), and B<gai_strerror>(3) instead.
ru: Функции B<gethostbyname*>(), B<gethostbyaddr*>(), B<herror>() и B<hstrerror>() являются устаревшими. Вместо них в приложениях следует использовать B<getaddrinfo>(3), B<getnameinfo>(3) и B<gai_strerror>(3).
