Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The B<gethostbyname>() function returns a structure of type I<hostent> for the given host I<name>. Here I<name> is either a hostname or an IPv4 address in standard dot notation (as for B<inet_addr>(3)). If I<name> is an IPv4 address, no lookup is performed and B<gethostbyname>() simply copies I<name> into the I<h_name> field and its I<struct in_addr> equivalent into the I<h_addr_list[0]> field of the returned I<hostent> structure. If I<name> doesn't end in a dot and the environment variable B<HOSTALIASES> is set, the alias file pointed to by B<HOSTALIASES> will first be searched for I<name> (see B<hostname>(7) for the file format). The current domain and its parents are searched unless I<name> ends in a dot.
ru: Функция B<gethostbyname>() возвращает структуру типа I<hostent> для узла I<name>. Значением I<name> может быть или имя узла, или адрес IPv4 в стандартной точечной записи (как в B<inet_addr>(3)). Если I<name> — адрес IPv4, то поиск не выполняется и B<gethostbyname>() просто копирует I<name> в поле I<h_name>, а его эквивалент I<struct in_addr> — в поле I<h_addr_list[0]> возвращаемой структуры I<hostent> Если I<name> не оканчивается точкой и установлена переменная окружения B<HOSTALIASES>, то I<name> сначала ищется в файле псевдонимов, указанном в B<HOSTALIASES> (формат файла описан в B<hostname>(7)). Если I<name> не оканчивается точкой, то поиск производится с текущем доменом и его предками.

source: The B<gethostbyaddr>() function returns a structure of type I<hostent> for the given host address I<addr> of length I<len> and address type I<type>. Valid address types are B<AF_INET> and B<AF_INET6>. The host address argument is a pointer to a struct of a type depending on the address type, for example a I<struct in_addr *> (probably obtained via a call to B<inet_addr>(3)) for address type B<AF_INET>.
ru: Функция B<gethostbyaddr>() возвращает структуру типа I<hostent> для адреса узла I<addr> длинной I<len> и типом адреса I<type>. Допустимые типы адресов — B<AF_INET> и B<AF_INET6>. Аргумент адреса узла — указатель на структуру с типом, зависящим от типа адреса, например для типа адреса B<AF_INET> используется I<struct in_addr *> (возможно, полученная из вызова B<inet_addr>(3)).

source: The B<sethostent>() function specifies, if I<stayopen> is true (1), that a connected TCP socket should be used for the name server queries and that the connection should remain open during successive queries. Otherwise, name server queries will use UDP datagrams.
ru: Функция B<sethostent>() задаёт (при I<stayopen> равным истине (1)), что для опроса сервера имён должен использоваться подключённый сокет TCP и что соединение должно остаться открытым для последующих запросов. В противном случае для опроса сервера имён будут использоваться дейтаграммы UDP.

source: The B<endhostent>() function ends the use of a TCP connection for name server queries.
ru: Функция B<endhostent>() закрывает использованное для опросов сервера имён соединение TCP.

source: The (obsolete) B<herror>() function prints the error message associated with the current value of I<h_errno> on I<stderr>.
ru: Функция B<herror>() (устарела) печатает в I<stderr> сообщение об ошибке в соответствии с текущим значением I<h_errno>.

source: The (obsolete) B<hstrerror>() function takes an error number (typically I<h_errno>) and returns the corresponding message string.
ru: Функция B<hstrerror>() (устарела) принимает номер ошибки (обычно, I<h_errno>) и возвращает соответствующую строку с сообщением об ошибке.

source: The domain name queries carried out by B<gethostbyname>() and B<gethostbyaddr>() rely on the Name Service Switch (B<nsswitch.conf>(5)) configured sources or a local name server (B<named>(8)). The default action is to query the Name Service Switch (B<nsswitch.conf(5))> configured sources, failing that, a local name server (B<named>(8)).
ru: Запросы доменного имени, выполняемые B<gethostbyname>() и B<gethostbyaddr>(), полагаются на настроенные источники диспетчера службы имён (B<nsswitch.conf>(5)) или локальный сервер имён (B<named>(8)). Действием по умолчанию является запрос к настроенным источникам диспетчера службы имён (B<nsswitch.conf(5))>, при ошибке — к локальному серверу имён (B<named>(8)).

source: Historical
ru: Историческая справка

source: The B<nsswitch.conf>(5) file is the modern way of controlling the order of host lookups.
ru: Современным способом управления порядком поиска узлов является файл B<nsswitch.conf>(5).

source: In glibc 2.4 and earlier, the I<order> keyword was used to control the order of host lookups as defined in I</etc/host.conf> (B<host.conf>(5)).
ru: В glibc 2.4 и старее, ключевое слово I<order> использовалось для управления порядком поиска узла в I</etc/host.conf> (B<host.conf>(5)).

source: The I<hostent> structure is defined in I<E<lt>netdb.hE<gt>> as follows:
ru: Структура I<hostent> определена в I<E<lt>netdb.hE<gt>> таким образом:

source: struct hostent { char *h_name; /* official name of host */ char **h_aliases; /* alias list */ int h_addrtype; /* host address type */ int h_length; /* length of address */ char **h_addr_list; /* list of addresses */ } #define h_addr h_addr_list[0] /* for backward compatibility */
ru: struct hostent { char *h_name; /* официальное имя узла */ char **h_aliases; /* список псевдонимов */ int h_addrtype; /* тип адреса узла */ int h_length; /* длина адреса */ char **h_addr_list; /* список адресов */ } #define h_addr h_addr_list[0] /* для обратной совместимости */

source: The members of the I<hostent> structure are:
ru: Члены структуры I<hostent>:

source: The official name of the host.
ru: Официальное имя узла.

source: An array of alternative names for the host, terminated by a null pointer.
ru: Массив альтернативных имён узла, заканчивается указателем null.

source: The type of address; always B<AF_INET> or B<AF_INET6> at present.
ru: Тип адреса; B<AF_INET> или B<AF_INET6>.

source: The length of the address in bytes.
ru: Длина адреса в байтах.

source: An array of pointers to network addresses for the host (in network byte order), terminated by a null pointer.
ru: Массив указателей сетевых адресов узла (в сетевом порядке байт), заканчивается указателем null.

source: The first address in I<h_addr_list> for backward compatibility.
ru: Первый адрес из I<h_addr_list>, для обратной совместимости.

source: The B<gethostbyname>() and B<gethostbyaddr>() functions return the I<hostent> structure or a null pointer if an error occurs. On error, the I<h_errno> variable holds an error number. When non-NULL, the return value may point at static data, see the notes below.
ru: Функции B<gethostbyname>() и B<gethostbyaddr>() возвращают структуру I<hostent> или указатель null при ошибке. При ошибке переменная I<h_errno> содержит номер ошибки. Если получен не NULL, то возвращаемое значение может указывать на статические данные, смотрите замечание далее.

source: The variable I<h_errno> can have the following values:
ru: Переменная I<h_errno> может содержать следующие значения:

source: The specified host is unknown.
ru: Заданный узел неизвестен.

source: The requested name is valid but does not have an IP address. Another type of request to the name server for this domain may return an answer. The constant B<NO_ADDRESS> is a synonym for B<NO_DATA>.
ru: Запрашиваемое имя корректно, но не имеет IP-адреса. При другом типе запроса для этого домена сервер имён может вернуть ответ. Синонимом B<NO_DATA> является константа B<NO_ADDRESS>.

source: A nonrecoverable name server error occurred.
ru: Произошла неисправимая ошибка сервера имён.

source: A temporary error occurred on an authoritative name server. Try again later.
ru: Произошла временная ошибка у авторитативного сервера имён. Попробуйте позже.

source: resolver configuration file
ru: файл с настройками резолвера

source: host database file
ru: файл базы данных узлов

source: name service switch configuration
ru: настройки диспетчера службы имён

source: In the above table, I<hostent> in I<race:hostent> signifies that if any of the functions B<sethostent>(), B<gethostent>(), B<gethostent_r>(), or B<endhostent>() are used in parallel in different threads of a program, then data races could occur.
ru: В приведённой выше таблице I<hostent> в I<race:hostent> означает, что если в нескольких нитях программы одновременно используются функции B<sethostent>(), B<gethostent>(), B<gethostent_r>() или B<endhostent>(), то может возникнуть состязательность по данным.

source: POSIX.1-2001 specifies B<gethostbyname>(), B<gethostbyaddr>(), B<sethostent>(), B<endhostent>(), B<gethostent>(), and I<h_errno>; B<gethostbyname>(), B<gethostbyaddr>(), and I<h_errno> are marked obsolescent in that standard. POSIX.1-2008 removes the specifications of B<gethostbyname>(), B<gethostbyaddr>(), and I<h_errno>, recommending the use of B<getaddrinfo>(3) and B<getnameinfo>(3) instead.
ru: В POSIX.1-2001 определены B<gethostbyname>(), B<gethostbyaddr>(), B<sethostent>(), B<endhostent>(), B<gethostent>() и I<h_errno>; функции B<gethostbyname>(), B<gethostbyaddr>() и I<h_errno> помечены как устаревшие. В POSIX.1-2008 удалены определения B<gethostbyname>(), B<gethostbyaddr>() и I<h_errno>; вместо них рекомендуется использовать B<getaddrinfo>(3) и B<getnameinfo>(3).

source: The functions B<gethostbyname>() and B<gethostbyaddr>() may return pointers to static data, which may be overwritten by later calls. Copying the I<struct hostent> does not suffice, since it contains pointers; a deep copy is required.
ru: Функции B<gethostbyname>() и B<gethostbyaddr>() могут возвращать указатели на статические данные, которые могут быть перезаписаны при последующих вызовах. Копирования I<struct hostent> недостаточно, так как она содержит указатели; требуется глубокое копирование.

source: In the original BSD implementation the I<len> argument of B<gethostbyname>() was an I<int>. The SUSv2 standard is buggy and declares the I<len> argument of B<gethostbyaddr>() to be of type I<size_t>. (That is wrong, because it has to be I<int>, and I<size_t> is not. POSIX.1-2001 makes it I<socklen_t>, which is OK.) See also B<accept>(2).
ru: В первой реализации BSD аргумент I<len> у B<gethostbyname>() имел тип I<int>. Стандарт SUSv2 содержит ошибку и объявляет аргумент I<len> у B<gethostbyaddr>() с типом I<size_t> (это неправильно, так как он должен быть I<int>, а не I<size_t>. В POSIX.1-2001 указанный тип — I<socklen_t>, который подходит). Смотрите также B<accept>(2).

source: The BSD prototype for B<gethostbyaddr>() uses I<const char\ *> for the first argument.
ru: У прототипа BSD B<gethostbyaddr>() первый аргумент имеет тип I<const char\ *>.

source: System V/POSIX extension
ru: Расширение System V/POSIX

source: POSIX requires the B<gethostent>() call, which should return the next entry in the host data base. When using DNS/BIND this does not make much sense, but it may be reasonable if the host data base is a file that can be read line by line. On many systems, a routine of this name reads from the file I</etc/hosts>. It may be available only when the library was built without DNS support. The glibc version will ignore ipv6 entries. This function is not reentrant, and glibc adds a reentrant version B<gethostent_r>().
ru: В POSIX требуется вызов B<gethostent>(), который должен возвращать следующий элемент из базы данных узлов. При использовании DNS/BIND это не имеет смысла, но допустимо, если база данных узлов — файл, который можно читать строку за строкой. На многих системах процедура с таким именем выполняет чтение из файла I</etc/hosts>. Она может быть доступна только когда библиотека собрана без поддержки DNS. Версия glibc игнорирует записи ipv6. Эта функция не реентерабельна; в glibc добавлена реентерабельная версия B<gethostent_r>().

source: GNU extensions
ru: Расширения GNU

source: Glibc2 also has a B<gethostbyname2>() that works like B<gethostbyname>(), but permits to specify the address family to which the address must belong.
ru: В glibc2 также имеется B<gethostbyname2>(), работающая подобно B<gethostbyname>(), но позволяющая задать адресное семейство, которому должен принадлежать адрес.

source: Glibc2 also has reentrant versions B<gethostent_r>(), B<gethostbyaddr_r>(), B<gethostbyname_r>() and B<gethostbyname2_r>(). The caller supplies a I<hostent> structure I<ret> which will be filled in on success, and a temporary work buffer I<buf> of size I<buflen>. After the call, I<result> will point to the result on success. In case of an error or if no entry is found I<result> will be NULL. The functions return 0 on success and a nonzero error number on failure. In addition to the errors returned by the nonreentrant versions of these functions, if I<buf> is too small, the functions will return B<ERANGE>, and the call should be retried with a larger buffer. The global variable I<h_errno> is not modified, but the address of a variable in which to store error numbers is passed in I<h_errnop>.
ru: В glibc2 также имеются реентерабельные версии B<gethostent_r>(), B<gethostbyaddr_r>(), B<gethostbyname_r>() и B<gethostbyname2_r>(). Вызывающий передаёт структуру I<hostent> I<ret>, которая будет заполнена, и временный рабочий буфер I<buf> размера I<buflen>. После вызова I<result> будет указывать на результат. В случае ошибки или при отсутствии записи I<result> будет NULL. При успешном выполнении функция возвращает 0 и ненулевой номер ошибки при сбое. Если I<buf> слишком мал, то кроме ошибок, возвращаемых нереентерабельными версиями этих функций, возвращается B<ERANGE>, и вызов нужно повторить с большим буфером. Глобальная переменная I<h_errno> не изменяется, но адрес переменной, в которой хранятся номера ошибок, передаётся в I<h_errnop>.

source: B<gethostbyname>() does not recognize components of a dotted IPv4 address string that are expressed in hexadecimal.
ru: Функция B<gethostbyname>() не работает с частями строки адреса IPv4 в точечном формате, если они записаны шестнадцатеричными числами.

source: getpwnam, getpwnam_r, getpwuid, getpwuid_r - get password file entry
ru: getpwnam, getpwnam_r, getpwuid, getpwuid_r - получает записи из файла паролей

source: _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _POSIX_C_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<getpwnam>() function returns a pointer to a structure containing the broken-out fields of the record in the password database (e.g., the local password file I</etc/passwd>, NIS, and LDAP) that matches the username I<name>.
ru: Функция B<getpwnam>() возвращает указатель на структуру, содержащую разделённую на поля запись из базы данных паролей (например, из локального файла паролей I</etc/passwd>, NIS и LDAP), которая соответствует имени пользователя I<name>.

source: The B<getpwuid>() function returns a pointer to a structure containing the broken-out fields of the record in the password database that matches the user ID I<uid>.
ru: Функция B<getpwuid>() возвращает указатель на структуру, содержащую разделённую на поля запись из базы данных паролей, которая соответствует идентификатору пользователя I<uid>.

source: The I<passwd> structure is defined in I<E<lt>pwd.hE<gt>> as follows:
ru: Структура I<passwd> определена в I<E<lt>pwd.hE<gt>> следующим образом:

source: struct passwd { char *pw_name; /* username */ char *pw_passwd; /* user password */ uid_t pw_uid; /* user ID */ gid_t pw_gid; /* group ID */ char *pw_gecos; /* user information */ char *pw_dir; /* home directory */ char *pw_shell; /* shell program */ };
ru: struct passwd { char *pw_name; /* имя пользователя */ char *pw_passwd; /* пароль пользователя */ uid_t pw_uid; /* идентификатор пользователя */ gid_t pw_gid; /* идентификатор группы */ char *pw_gecos; /* информация о пользователе */ char *pw_dir; /* домашний каталог */ char *pw_shell; /* программная оболочка */ };

source: See B<passwd>(5) for more information about these fields.
ru: Подробней об этих полях смотрите в B<passwd>(5).

source: The B<getpwnam_r>() and B<getpwuid_r>() functions obtain the same information as B<getpwnam>() and B<getpwuid>(), but store the retrieved I<passwd> structure in the space pointed to by I<pwd>. The string fields pointed to by the members of the I<passwd> structure are stored in the buffer I<buf> of size I<buflen>. A pointer to the result (in case of success) or NULL (in case no entry was found or an error occurred) is stored in I<*result>.
ru: Функции B<getpwnam_r>() и B<getpwuid_r>() принимают ту же информацию что и B<getpwnam>() и B<getpwuid>(), но сохраняют полученную структуру I<passwd> в пространство, указанное I<pwd>. Строковые поля членов структуры I<passwd> сохраняются в буфере I<buf> размера I<buflen>. Указатель на результат (при успешном выполнении) или NULL (если записи отсутствуют или произошла ошибка) сохраняется в I<*result>.

source: The call
ru: Вызов

source: returns either -1, without changing I<errno>, or an initial suggested size for I<buf>. (If this size is too small, the call fails with B<ERANGE>, in which case the caller can retry with a larger buffer.)
ru: возвращает или -1 без изменения I<errno> или начальный предполагаемый размер I<buf> (если этот размер мал, то вызов завершается B<ERANGE>; в этом случае вызывающий может повторить вызов с большим буфером).

source: The B<getpwnam>() and B<getpwuid>() functions return a pointer to a I<passwd> structure, or NULL if the matching entry is not found or an error occurs. If an error occurs, I<errno> is set appropriately. If one wants to check I<errno> after the call, it should be set to zero before the call.
ru: Функции B<getpwnam>() и B<getpwuid>() возвращают указатель на структуру I<passwd> или NULL, если подходящих записей не найдено или возникла ошибка. При ошибке I<errno> устанавливается в соответствующее значение. Если нужно проверять переменную I<errno> после вызова, то перед этим нужно присвоить ей нулевое значение.

source: The return value may point to a static area, and may be overwritten by subsequent calls to B<getpwent>(3), B<getpwnam>(), or B<getpwuid>(). (Do not pass the returned pointer to B<free>(3).)
ru: Возвращаемое значение может указывать на статическую область и может быть перезаписано при последующих вызовах B<getpwent>(3), B<getpwnam>() или B<getpwuid>() (не передавайте полученный указатель B<free>(3)).

source: On success, B<getpwnam_r>() and B<getpwuid_r>() return zero, and set I<*result> to I<pwd>. If no matching password record was found, these functions return 0 and store NULL in I<*result>. In case of error, an error number is returned, and NULL is stored in I<*result>.
ru: При успешном выполнении B<getpwnam_r>() и B<getpwuid_r>() возвращают ноль, и устанавливают I<*result> в I<pwd>. Если совпадений не найдено, то эти функции возвращают 0 и сохраняют NULL в I<*result>. При ошибке возвращается её номер и в I<*result> сохраняется NULL.

source: B<0> or B<ENOENT> or B<ESRCH> or B<EBADF> or B<EPERM> or ...
ru: B<0> или B<ENOENT> или B<ESRCH> или B<EBADF> или B<EPERM> или …

source: The given I<name> or I<uid> was not found.
ru: Указанное значение I<name> или I<uid> не найдено.

source: A signal was caught; see B<signal>(7).
ru: Поступил сигнал; смотрите B<signal>(7).

source: I/O error.
ru: Ошибка ввода-вывода.

source: The per-process limit on the number of open file descriptors has been reached.
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: The system-wide limit on the total number of open files has been reached.
ru: Достигнуто максимальное количество открытых файлов в системе.

source: Insufficient memory to allocate I<passwd> structure.
ru: Недостаточно памяти для структуры I<passwd>.

source: Insufficient buffer space supplied.
ru: Недостаточно места в буфере.

source: local password database file
ru: файл, содержащий локальную базу паролей

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. The I<pw_gecos> field is not specified in POSIX, but is present on most implementations.
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. Поле I<pw_gecos> не определено в стандарте POSIX, но присутствует в большинстве реализаций.

source: The formulation given above under "RETURN VALUE" is from POSIX.1-2001. It does not call "not found" an error, and hence does not specify what value I<errno> might have in this situation. But that makes it impossible to recognize errors. One might argue that according to POSIX I<errno> should be left unchanged if an entry is not found. Experiments on various UNIX-like systems show that lots of different values occur in this situation: 0, ENOENT, EBADF, ESRCH, EWOULDBLOCK, EPERM, and probably others.
ru: Описание «ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ», приведённого выше, взято из POSIX.1-2001. В нём «не найдено» не считается ошибкой и поэтому не указано, каким может быть значение I<errno> в этом случае. Но это делает невозможным определить тип ошибки. Из описание POSIX можно посчитать, что I<errno> не должно измениться, если запись не найдена. Эксперименты в различных UNIX-подобных системах показывают, что в этой ситуации возвращается много разных значений: 0, ENOENT, EBADF, ESRCH, EWOULDBLOCK, EPERM и, возможно, другие.

source: The I<pw_dir> field contains the name of the initial working directory of the user. Login programs use the value of this field to initialize the B<HOME> environment variable for the login shell. An application that wants to determine its user's home directory should inspect the value of B<HOME> (rather than the value I<getpwuid(getuid())-E<gt>pw_dir>) since this allows the user to modify their notion of "the home directory" during a login session. To determine the (initial) home directory of another user, it is necessary to use I<getpwnam("username")-E<gt>pw_dir> or similar.
ru: В поле I<pw_dir> содержится имя первого рабочего каталога пользователя. Программы входа используют это значение для инициализации переменной окружения B<HOME> для регистрационной оболочки. Приложение, которое хочет определить имя домашнего каталога пользователя должно проверять значение B<HOME> (а не значение I<getpwuid(getuid())-E<gt>pw_dir>), так как это позволяет пользователю изменять их понятие о «домашнем каталоге» в течении сеанса. Для определения (начального) домашнего каталога другого пользователя необходимо использовать I<getpwnam("имя пользователя")-E<gt>pw_dir> или похожий вызов.

source: The program below demonstrates the use of B<getpwnam_r>() to find the full username and user ID for the username supplied as a command-line argument.
ru: Представленная ниже программа использует B<getpwnam_r>() при поиске полного имени пользователя и его ID согласно указанному имени в аргументе командной строки.

source: if (argc != 2) { fprintf(stderr, "Usage: %s username\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s имя\en", argv[0]); exit(EXIT_FAILURE); }

source: bufsize = sysconf(_SC_GETPW_R_SIZE_MAX); if (bufsize == -1) /* Value was indeterminate */ bufsize = 16384; /* Should be more than enough */
ru: bufsize = sysconf(_SC_GETPW_R_SIZE_MAX); if (bufsize == -1) /* значение не указано */ bufsize = 16384; /* должно быть достаточно */

source: s = getpwnam_r(argv[1], &pwd, buf, bufsize, &result); if (result == NULL) { if (s == 0) printf("Not found\en"); else { errno = s; perror("getpwnam_r"); } exit(EXIT_FAILURE); }
ru: s = getpwnam_r(argv[1], &pwd, buf, bufsize, &result); if (result == NULL) { if (s == 0) printf("Не найдено\en"); else { errno = s; perror("getpwnam_r"); } exit(EXIT_FAILURE); }

source: printf("Name: %s; UID: %ld\en", pwd.pw_gecos, (long) pwd.pw_uid); exit(EXIT_SUCCESS); }
ru: printf("Имя: %s; UID: %ld\en", pwd.pw_gecos, (long) pwd.pw_uid); exit(EXIT_SUCCESS); }
