Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: The B<getrlimit>() and B<setrlimit>() system calls get and set resource limits. Each resource has an associated soft and hard limit, as defined by the I<rlimit> structure:
ru: Системные вызовы B<getrlimit>() и B<setrlimit>() получают и устанавливают ограничения использования ресурсов. Каждому ресурсу назначается мягкое и жёсткое ограничение, определяемое структурой I<rlimit>:

source: struct rlimit { rlim_t rlim_cur; /* Soft limit */ rlim_t rlim_max; /* Hard limit (ceiling for rlim_cur) */ };
ru: struct rlimit { rlim_t rlim_cur; /* мягкое ограничение */ rlim_t rlim_max; /* жёсткое ограничение (максимум для rlim_cur) */ };

source: The soft limit is the value that the kernel enforces for the corresponding resource. The hard limit acts as a ceiling for the soft limit: an unprivileged process may set only its soft limit to a value in the range from 0 up to the hard limit, and (irreversibly) lower its hard limit. A privileged process (under Linux: one with the B<CAP_SYS_RESOURCE> capability in the initial user namespace) may make arbitrary changes to either limit value.
ru: Мягким ограничением является значение, принудительно устанавливаемое ядром для соответствующего ресурса. Жёсткое ограничение работает как максимальное значение для мягкого ограничения: непривилегированные процессы могут определять только свои мягкие ограничения в диапазоне от 0 до жёсткого ограничения, то есть однозначно меньше жёсткого ограничения. Привилегированные процессы (в Linux: имеющие мандат B<CAP_SYS_RESOURCE> в начальном пространстве имён пользователя) могут устанавливать произвольные значения в любых пределах.

source: The value B<RLIM_INFINITY> denotes no limit on a resource (both in the structure returned by B<getrlimit>() and in the structure passed to B<setrlimit>()).
ru: Значение B<RLIM_INFINITY> означает отсутствие ограничений для ресурса (в структуре, возвращаемой B<getrlimit>() и в структуре, передаваемой в B<setrlimit>()).

source: The I<resource> argument must be one of:
ru: Значение I<resource> должно быть одним из:

source: This is the maximum size of the process's virtual memory (address space). The limit is specified in bytes, and is rounded down to the system page size. This limit affects calls to B<brk>(2), B<mmap>(2), and B<mremap>(2), which fail with the error B<ENOMEM> upon exceeding this limit. In addition, automatic stack expansion fails (and generates a B<SIGSEGV> that kills the process if no alternate stack has been made available via B<sigaltstack>(2)). Since the value is a I<long>, on machines with a 32-bit I<long> either this limit is at most 2\ GiB, or this resource is unlimited.
ru: Максимальный размер виртуальной памяти (адресного пространства) процесса. Данное ограничение задаётся в байтах и округляется в меньшую сторону к размеру системной страницы. Учитывается в вызовах B<brk>(2), B<mmap>(2) и B<mremap>(2), которые завершатся с ошибкой B<ENOMEM>, если будет превышено это ограничение. К тому же завершается ошибкой автоматическое расширение стека (и генерируется сигнал B<SIGSEGV>, по которому процесс завершится, если не было создано с помощью B<sigaltstack>(2) альтернативного стека). Так как значение имеет тип I<long>, на машинах с 32-битным I<long> максимальное значение ограничения будет около 2\ ГиБ, или этот ресурс не ограничивается.

source: This is the maximum size of a I<core> file (see B<core>(5)) in bytes that the process may dump. When 0 no core dump files are created. When nonzero, larger dumps are truncated to this size.
ru: Максимальный размер файла I<core> (смотрите B<core>(5)) в байтах, который может получиться из процесса. Если значение равно 0, то файлы core не создаются. Если значение больше нуля, то создаваемые дампы обрезаются до этого размера.

source: This is a limit, in seconds, on the amount of CPU time that the process can consume. When the process reaches the soft limit, it is sent a B<SIGXCPU> signal. The default action for this signal is to terminate the process. However, the signal can be caught, and the handler can return control to the main program. If the process continues to consume CPU time, it will be sent B<SIGXCPU> once per second until the hard limit is reached, at which time it is sent B<SIGKILL>. (This latter point describes Linux behavior. Implementations vary in how they treat processes which continue to consume CPU time after reaching the soft limit. Portable applications that need to catch this signal should perform an orderly termination upon first receipt of B<SIGXCPU>.)
ru: Ограничение времени выполнения процесса на ЦП в секундах. Когда процесс достигает своего мягкого ограничения, то ему отправляется сигнал B<SIGX CPU>. Действием по умолчанию для этого сигнала является завершение процесса. Однако, этот сигнал может быть перехвачен, и обработчик может передать управление в основную программу. Если процесс продолжает потреблять процессорное время, то ему будет отправляться B<SIGXCPU> раз в секунду до тех пор, пока не будет достигнуто жёсткое ограничение, и тогда процессу будет послан сигнал B<SIGKILL> (последний пункт описывает поведение Linux. В разных реализациях действия над потребляющими процессорное время после прохождения мягкого ограничения процессами различаются. Переносимые приложения, где требуется перехват сигнала, должны выполнять корректное завершение процесса после первого получения B<SIGXCPU>).

source: This is the maximum size of the process's data segment (initialized data, uninitialized data, and heap). The limit is specified in bytes, and is rounded down to the system page size. This limit affects calls to B<brk>(2), B<sbrk>(2), and (since Linux 4.7) B<mmap>(2), which fail with the error B<ENOMEM> upon encountering the soft limit of this resource.
ru: Максимальный размер сегмента данных процесса (инициализированные данные, неинициализированные данные, куча). Данное ограничение задаётся в байтах и округляется в меньшую сторону к размеру системной страницы. Это ограничение учитывается в вызовах B<brk>(2), B<sbrk>(2) и (начиная с Linux 4.7) B<mmap>(2), которые завершатся с ошибкой B<ENOMEM> при достижении мягкого ограничения этого ресурса.

source: This is the maximum size in bytes of files that the process may create. Attempts to extend a file beyond this limit result in delivery of a B<SIGXFSZ> signal. By default, this signal terminates a process, but a process can catch this signal instead, in which case the relevant system call (e.g., B<write>(2), B<truncate>(2)) fails with the error B<EFBIG>.
ru: Максимальный размер (в байтах) файлов, создаваемых процессом. Попытки расширить файл сверх этого ограничения приведёт к доставке сигнала B<SIGXFSZ>. По умолчанию по этому сигналу процесс завершается, но процесс может перехватить этот сигнал и в этом случае выполнявшийся системный вызов (например, B<write>(2), B<truncate>(2)) завершится с ошибкой B<EFBIG>.

source: B<RLIMIT_LOCKS> (early Linux 2.4 only)
ru: B<RLIMIT_LOCKS> (только в ранних версиях Linux 2.4)

source: This is a limit on the combined number of B<flock>(2) locks and B<fcntl>(2) leases that this process may establish.
ru: Ограничение на общее количество блокировок B<flock>(2) и аренд B<fcntl>(2), которое может установить процесс.

source: This is the maximum number of bytes of memory that may be locked into RAM. This limit is in effect rounded down to the nearest multiple of the system page size. This limit affects B<mlock>(2), B<mlockall>(2), and the B<mmap>(2) B<MAP_LOCKED> operation. Since Linux 2.6.9, it also affects the B<shmctl>(2) B<SHM_LOCK> operation, where it sets a maximum on the total bytes in shared memory segments (see B<shmget>(2)) that may be locked by the real user ID of the calling process. The B<shmctl>(2) B<SHM_LOCK> locks are accounted for separately from the per-process memory locks established by B<mlock>(2), B<mlockall>(2), and B<mmap>(2) B<MAP_LOCKED>; a process can lock bytes up to this limit in each of these two categories.
ru: Максимальное количество байт памяти, которое может быть заблокировано в ОЗУ. В целях эффективности это ограничение округляется в меньшую сторону до ближайшего значения, кратного размеру системной страницы. Это ограничение учитывается в B<mlock>(2), B<mlockall>(2) и в B<mmap>(2) при операции B<MAP_LOCKED>. Начиная с Linux 2.6.9, оно также учитывается в B<shmctl>(2) при операции B<SHM_LOCK>, где определяет максимальное количество байт всех общих сегментов памяти (смотрите B<shmget>(2)), которые могут быть заблокированы вызывающим процессом с реальным идентификатором пользователя. Блокировки по операции B<SHM_LOCK> у B<shmctl>(2) учитываются отдельно от попроцессных блокировок памяти, устанавливаемых B<mlock>(2), B<mlockall>(2) и B<mmap>(2) с операцией B<MAP_LOCKED>; процесс может заблокировать пространство до этого значения заданного ограничения байт в каждой из этих двух категорий.

source: In Linux kernels before 2.6.9, this limit controlled the amount of memory that could be locked by a privileged process. Since Linux 2.6.9, no limits are placed on the amount of memory that a privileged process may lock, and this limit instead governs the amount of memory that an unprivileged process may lock.
ru: В ядрах Linux до версии 2.6.9 этим ограничением контролировалось количество памяти, которое можно было блокировать привилегированному процессу. Начиная с Linux 2.6.9 привилегированный процесс не ограничен по количеству памяти, и теперь это ограничение управляет количеством памяти, которое может блокировать непривилегированный процесс.

source: B<RLIMIT_MSGQUEUE> (since Linux 2.6.8)
ru: B<RLIMIT_MSGQUEUE> (начиная с Linux 2.6.8)

source: This is a limit on the number of bytes that can be allocated for POSIX message queues for the real user ID of the calling process. This limit is enforced for B<mq_open>(3). Each message queue that the user creates counts (until it is removed) against this limit according to the formula:
ru: Ограничение на количество байт, которое может выделяться для очередей сообщений POSIX для вызывающего процесса с реальным идентификатором пользователя. Это ограничение учитывается в B<mq_open>(3). Каждая очередь сообщений, которую создаёт пользователь, учитывается (пока не будет удалена) в формуле:

source: Since Linux 3.5:
ru: Начиная Linux 3.5:

source: bytes = attr.mq_maxmsg * sizeof(struct msg_msg) + min(attr.mq_maxmsg, MQ_PRIO_MAX) * sizeof(struct posix_msg_tree_node)+ /* For overhead */ attr.mq_maxmsg * attr.mq_msgsize; /* For message data */
ru: bytes = attr.mq_maxmsg * sizeof(struct msg_msg) + min(attr.mq_maxmsg, MQ_PRIO_MAX) * sizeof(struct posix_msg_tree_node)+ /* издержки */ attr.mq_maxmsg * attr.mq_msgsize; /* данные из сообщения */

source: Linux 3.4 and earlier:
ru: Linux 3.4 и старше:

source: bytes = attr.mq_maxmsg * sizeof(struct msg_msg *) + /* For overhead */ attr.mq_maxmsg * attr.mq_msgsize; /* For message data */
ru: bytes = attr.mq_maxmsg * sizeof(struct msg_msg *) + /* издержки */ attr.mq_maxmsg * attr.mq_msgsize; /* данные из сообщения */

source: where I<attr> is the I<mq_attr> structure specified as the fourth argument to B<mq_open>(3), and the I<msg_msg> and I<posix_msg_tree_node> structures are kernel-internal structures.
ru: где I<attr> — структура I<mq_attr>, указанная в четвёртом аргументе B<mq_open>(3), а I<msg_msg> и I<posix_msg_tree_node> — внутренние структуры ядра.

source: The "overhead" addend in the formula accounts for overhead bytes required by the implementation and ensures that the user cannot create an unlimited number of zero-length messages (such messages nevertheless each consume some system memory for bookkeeping overhead).
ru: Дополнение «издержки» (overhead) в формуле нужно учитывает байты расходов требуемые в реализации на то, чтобы пользователь не смог создать бесконечное количество сообщений нулевой длины (для таких сообщений, тем не менее, потребляется системная память для учёта использования системных ресурсов).

source: B<RLIMIT_NICE> (since Linux 2.6.12, but see BUGS below)
ru: B<RLIMIT_NICE> (начиная с Linux 2.6.12, см. ДЕФЕКТЫ далее)

source: This specifies a ceiling to which the process's nice value can be raised using B<setpriority>(2) or B<nice>(2). The actual ceiling for the nice value is calculated as I<20\ -\ rlim_cur>. The useful range for this limit is thus from 1 (corresponding to a nice value of 19) to 40 (corresponding to a nice value of -20). This unusual choice of range was necessary because negative numbers cannot be specified as resource limit values, since they typically have special meanings. For example, B<RLIM_INFINITY> typically is the same as -1. For more detail on the nice value, see B<sched>(7).
ru: Определяет максимум, до которого может быть увеличено значение уступчивости процесса с помощью B<setpriority>(2) или B<nice>(2). Действительный максимум значения уступчивости высчитывается по формуле: I<20\ -\ rlim_cur>. Полезным диапазоном этого ограничения являются значения от 1 (соответствует значению уступчивости 19) до 40 (соответствует значению уступчивости -20). Так пришлось поступить из-за того, что отрицательные числа нельзя указывать в значениях ограничений ресурсов, так как они, обычно, имеют специальное предназначение. Например, B<RLIM_INFINITY>, обычно равно -1. Более подробно о значениях уступчивости описано в B<sched>(7).

source: This specifies a value one greater than the maximum file descriptor number that can be opened by this process. Attempts (B<open>(2), B<pipe>(2), B<dup>(2), etc.) to exceed this limit yield the error B<EMFILE>. (Historically, this limit was named B<RLIMIT_OFILE> on BSD.)
ru: Определяет значение, на 1 больше максимального количества дескрипторов файлов, которое может открыть этот процесс. Попытки (B<open>(2), B<pipe>(2), B<dup>(2) и т.п.) превысить это ограничение приведут к ошибке B<EMFILE> (раньше это ограничение в BSD называлось B<RLIMIT_OFILE>).

source: Since Linux 4.5, this limit also defines the maximum number of file descriptors that an unprivileged process (one without the B<CAP_SYS_RESOURCE> capability) may have "in flight" to other processes, by being passed across UNIX domain sockets. This limit applies to the B<sendmsg>(2) system call. For further details, see B<unix>(7).
ru: Начиная с Linux 4.5, это ограничение также определяет максимальное количество файловых дескрипторов, которое непривилегированный процесс (не имеющий мандата B<CAP_SYS_RESOURCE>) может держать «пересылать» (in flight) другим процессам через доменные сокеты UNIX. Данное ограничение применяется только к системному вызову B<sendmsg>(2). Дополнительную информацию смотрите в B<unix>(7).

source: This is a limit on the number of extant process (or, more precisely on Linux, threads) for the real user ID of the calling process. So long as the current number of processes belonging to this process's real user ID is greater than or equal to this limit, B<fork>(2) fails with the error B<EAGAIN>.
ru: Ограничивает количество живущих (extant) процессов (или, более точно для Linux, нитей), для реального идентификатора пользователя вызывающего процесса. Как только текущее количество процессов, принадлежащих реальному идентификатору пользователя вызывающего процесса, станет больше или равно этому ограничению B<fork>(2) начнёт завершаться с ошибкой B<EAGAIN>.

source: The B<RLIMIT_NPROC> limit is not enforced for processes that have either the B<CAP_SYS_ADMIN> or the B<CAP_SYS_RESOURCE> capability.
ru: Данное ограничение не учитываются процессы, имеющие мандат B<CAP_SYS_ADMIN> или B<CAP_SYS_RESOURCE>.

source: This is a limit (in bytes) on the process's resident set (the number of virtual pages resident in RAM). This limit has effect only in Linux 2.4.x, x E<lt> 30, and there affects only calls to B<madvise>(2) specifying B<MADV_WILLNEED>.
ru: Максимальное ограничение (в байтах) размера постоянного присутствия процесса (числа виртуальных страниц, постоянно присутствующих в ОЗУ). Это ограничение учитывается только начиная с версии Linux 2.4.x, x E<lt> 30, и только в вызовах B<madvise>(2) со значением B<MADV_WILLNEED>.

source: B<RLIMIT_RTPRIO> (since Linux 2.6.12, but see BUGS)
ru: B<RLIMIT_RTPRIO> (начиная с Linux 2.6.12, смотрите ДЕФЕКТЫ)

source: This specifies a ceiling on the real-time priority that may be set for this process using B<sched_setscheduler>(2) and B<sched_setparam>(2).
ru: Определяет максимум для приоритета реального времени, который можно установить для процесса с помощью B<sched_setscheduler>(2) и B<sched_setparam>(2).

source: For further details on real-time scheduling policies, see B<sched>(7)
ru: Дополнительную информацию об алгоритмах планирования реального времени смотрите в B<sched>(7).

source: B<RLIMIT_RTTIME> (since Linux 2.6.25)
ru: B<RLIMIT_RTTIME> (начиная с Linux 2.6.25)

source: This is a limit (in microseconds) on the amount of CPU time that a process scheduled under a real-time scheduling policy may consume without making a blocking system call. For the purpose of this limit, each time a process makes a blocking system call, the count of its consumed CPU time is reset to zero. The CPU time count is not reset if the process continues trying to use the CPU but is preempted, its time slice expires, or it calls B<sched_yield>(2).
ru: Определяет ограничение (в микросекундах) на количество времени ЦП, которое процесс может быть запланирован выполняться в условиях реального времени без выполнения блокирующего системного вызова. Для работы ограничения, всякий раз когда процесс делает блокирующий системный вызов счётчик использованного времени ЦП сбрасывается в ноль. Счётчик времени ЦП не сбрасывается, если процесс продолжает пытаться использовать ЦП, но был вытеснен, его выделенное время на исполнение истекло или он вызвал B<sched_yield>(2).

source: Upon reaching the soft limit, the process is sent a B<SIGXCPU> signal. If the process catches or ignores this signal and continues consuming CPU time, then B<SIGXCPU> will be generated once each second until the hard limit is reached, at which point the process is sent a B<SIGKILL> signal.
ru: При достижении мягкого ограничения процессу посылается сигнал B<SIGXCPU>. Если процесс перехватил сигнал, проигнорировал его и продолжает потреблять время ЦП, то раз в секунду будет генерироваться сигнал B<SIGXCPU> до тех пор, пока не будет достигнуто жёсткое ограничение, и процессу не будет послан сигнал B<SIGKILL>.

source: The intended use of this limit is to stop a runaway real-time process from locking up the system.
ru: Это ограничение предназначено для предотвращения блокировки системы вышедшими из под контроля процессами реального времени.

source: B<RLIMIT_SIGPENDING> (since Linux 2.6.8)
ru: B<RLIMIT_SIGPENDING> (начиная с Linux 2.6.8)

source: This is a limit on the number of signals that may be queued for the real user ID of the calling process. Both standard and real-time signals are counted for the purpose of checking this limit. However, the limit is enforced only for B<sigqueue>(3); it is always possible to use B<kill>(2) to queue one instance of any of the signals that are not already queued to the process.
ru: Определяет ограничение на количество сигналов, которые могут быть поставлены в очередь вызывающего процесса с реальным пользовательским идентификатором. При проверке ограничения учитываются обычные сигналы и сигналы реального времени. Однако ограничение учитывается только в B<sigqueue>(3); всегда возможно использовать B<kill>(2) для постановки в очередь любого сигнала, которого ещё нет в очереди процесса.

source: This is the maximum size of the process stack, in bytes. Upon reaching this limit, a B<SIGSEGV> signal is generated. To handle this signal, a process must employ an alternate signal stack (B<sigaltstack>(2)).
ru: Максимальный размер стека процесса в байтах. При достижении этого ограничения генерируется сигнал B<SIGSEGV>. Для обработки этого сигнала процесс должен использовать альтернативный стек сигналов (B<sigaltstack>(2)).

source: Since Linux 2.6.23, this limit also determines the amount of space used for the process's command-line arguments and environment variables; for details, see B<execve>(2).
ru: Начиная с Linux 2.6.23, это ограничение также определяет количество места, используемого для аргументов командной строки процесса и его переменных окружения; подробней об этом смотрите в B<execve>(2).

source: The Linux-specific B<prlimit>() system call combines and extends the functionality of B<setrlimit>() and B<getrlimit>(). It can be used to both set and get the resource limits of an arbitrary process.
ru: Системный вызов B<prlimit>(), который есть только в Linux объединяет и расширяет функции B<setrlimit>() и B<getrlimit>(). Он может использоваться для задания и получения ограничений ресурсов произвольного процесса.

source: The I<resource> argument has the same meaning as for B<setrlimit>() and B<getrlimit>().
ru: Аргумент I<resource> имеет тот же смысл что и в B<setrlimit>() и B<getrlimit>().

source: If the I<new_limit> argument is a not NULL, then the I<rlimit> structure to which it points is used to set new values for the soft and hard limits for I<resource>. If the I<old_limit> argument is a not NULL, then a successful call to B<prlimit>() places the previous soft and hard limits for I<resource> in the I<rlimit> structure pointed to by I<old_limit>.
ru: Если значение аргумента I<new_limit> не равно NULL, то структура I<rlimit>, на которую он указывает, используется для задания новых значений мягкий и жёстких ограничений для I<resource>. Если значение аргумента I<old_limit> не равно NULL, то успешный вызов B<prlimit>() помещает текущие значения мягких и жёстких ограничений для I<resource> в структуру I<rlimit>, на которую указывает I<old_limit>.

source: The I<pid> argument specifies the ID of the process on which the call is to operate. If I<pid> is 0, then the call applies to the calling process. To set or get the resources of a process other than itself, the caller must have the B<CAP_SYS_RESOURCE> capability in the user namespace of the process whose resource limits are being changed, or the real, effective, and saved set user IDs of the target process must match the real user ID of the caller I<and> the real, effective, and saved set group IDs of the target process must match the real group ID of the caller.
ru: В аргументе I<pid> задаётся идентификатор процесса с которым работает вызов. Если I<pid> равно 0, то вызов применяется к вызывающему процессу. Для установки и получения ресурсов не своего процесса, вызывающий должен иметь мандат B<CAP_SYS_RESOURCE> в пользовательском пространстве имён процесса, ограничения ресурсов которого изменяются или реальный, эффективный и сохранённый идентификатор пользователя процесса назначения должен совпадать с реальным идентификатором пользователя вызывающего I<и> реальный, эффективный и сохранённый идентификатор группы процесса назначения должны совпадать с реальным идентификатором группы вызывающего.

source: On success, these system calls return 0. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: A pointer argument points to a location outside the accessible address space.
ru: Аргумент-указатель указывает за пределы доступного адресного пространства.

source: The value specified in I<resource> is not valid; or, for B<setrlimit>() or B<prlimit>(): I<rlim-E<gt>rlim_cur> was greater than I<rlim-E<gt>rlim_max>.
ru: Указано некорректное значение I<resource>; или для B<setrlimit>() или B<prlimit>(): I<rlim-E<gt>rlim_cur> больше чем I<rlim-E<gt>rlim_max>.

source: An unprivileged process tried to raise the hard limit; the B<CAP_SYS_RESOURCE> capability is required to do this.
ru: Непривилегированный процесс пытался увеличить жёсткое ограничение; для этого требуется мандат B<CAP_SYS_RESOURCE>.
