Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: I<ru_msgrcv> (unmaintained)
ru: I<ru_msgrcv> (не ведётся)

source: I<ru_nsignals> (unmaintained)
ru: I<ru_nsignals> (не ведётся)

source: I<ru_nvcsw> (since Linux 2.6)
ru: I<ru_nvcsw> (начиная с Linux 2.6)

source: The number of times a context switch resulted due to a process voluntarily giving up the processor before its time slice was completed (usually to await availability of a resource).
ru: Количество переключений контекста в следствии добровольной отдачи процессом процессора до того, как истёк его рабочий временной интервал (обычно, из-за ожидания доступности ресурса).

source: I<ru_nivcsw> (since Linux 2.6)
ru: I<ru_nivcsw> (начиная с Linux 2.6)

source: The number of times a context switch resulted due to a higher priority process becoming runnable or because the current process exceeded its time slice.
ru: Количество переключений контекста в следствии вытеснения процессом с более высоким приоритетом или из-за истечения рабочего временного интервала процесса.

source: I<usage> points outside the accessible address space.
ru: I<usage> указывает за пределы доступного адресного пространства.

source: I<who> is invalid.
ru: Неверное значение I<who>.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. POSIX.1 specifies B<getrusage>(), but specifies only the fields I<ru_utime> and I<ru_stime>.
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. В POSIX.1 определён вызов B<getrusage>(), но указаны только поля I<ru_utime> и I<ru_stime>.

source: B<RUSAGE_THREAD> is Linux-specific.
ru: B<RUSAGE_THREAD> есть только в Linux.

source: Resource usage metrics are preserved across an B<execve>(2).
ru: Значения использованных ресурсов сохраняются при B<execve>(2).

source: Including I<E<lt>sys/time.hE<gt>> is not required these days, but increases portability. (Indeed, I<struct timeval> is defined in I<E<lt>sys/time.hE<gt>>.)
ru: Включать I<E<lt>sys/time.hE<gt>> в настоящее время не требуется, но это увеличивает переносимость. (Хотя I<struct timeval> определена в I<E<lt>sys/time.hE<gt>>.)

source: In Linux kernel versions before 2.6.9, if the disposition of B<SIGCHLD> is set to B<SIG_IGN> then the resource usages of child processes are automatically included in the value returned by B<RUSAGE_CHILDREN>, although POSIX.1-2001 explicitly prohibits this. This nonconformance is rectified in Linux 2.6.9 and later.
ru: В ядрах Linux до версии 2.6.9, если значение B<SIGCHLD> равно B<SIG_IGN>, то использованные ресурсы потомков процессов автоматически включаются в значение, возвращаемое B<RUSAGE_CHILDREN>, хотя в POSIX.1-2001 это явно запрещено. Это несоответствие исправлено в Linux 2.6.9 и более новых версиях.

source: The structure definition shown at the start of this page was taken from 4.3BSD Reno.
ru: Определение структуры, показанное в начале страницы, взято из 4.3BSD Reno.

source: Ancient systems provided a B<vtimes>() function with a similar purpose to B<getrusage>(). For backward compatibility, glibc also provides B<vtimes>(). All new applications should be written using B<getrusage>().
ru: В старых системах была функция B<vtimes>() с подобным B<getrusage>() назначением. Для обратной совместимости в glibc также есть функция B<vtimes>(). Во всех новых приложениях должен быть использован B<getrusage>().

source: See also the description of I</proc/[pid]/stat> in B<proc>(5).
ru: Смотрите также описание I</proc/[pid]/stat> в B<proc>(5).

source: gettimeofday, settimeofday - get / set time
ru: gettimeofday, settimeofday - получает/устанавливает время

source: B<settimeofday>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<settimeofday>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE

source: The functions B<gettimeofday>() and B<settimeofday>() can get and set the time as well as a timezone. The I<tv> argument is a I<struct timeval> (as specified in I<E<lt>sys/time.hE<gt>>):
ru: Функция B<gettimeofday>() и B<settimeofday>() позволяют получить и задать время, а также часовой пояс. Аргумент I<tv> имеет тип I<struct timeval> (определён в I<E<lt>sys/time.hE<gt>>):

source: struct timeval { time_t tv_sec; /* seconds */ suseconds_t tv_usec; /* microseconds */ };
ru: struct timeval { time_t tv_sec; /* секунды */ suseconds_t tv_usec; /* микросекунды */ };

source: and gives the number of seconds and microseconds since the Epoch (see B<time>(2)). The I<tz> argument is a I<struct timezone>:
ru: и задаёт количество секунд и микросекунд, прошедших с начала эпохи (см. B<time>(2)). Аргумент I<tz> имеет тип I<struct timezone>:

source: struct timezone { int tz_minuteswest; /* minutes west of Greenwich */ int tz_dsttime; /* type of DST correction */ };
ru: struct timezone { int tz_minuteswest; /* количество минут западнее Гринвича */ int tz_dsttime; /* тип корректировки DST */ };

source: If either I<tv> or I<tz> is NULL, the corresponding structure is not set or returned. (However, compilation warnings will result if I<tv> is NULL.)
ru: Если I<tv> или I<tz> имеют значение NULL, то соответствующая структура не задана и не будет возвращена (однако при компиляции будут выдаваться предупреждения, если I<tv> равно NULL).

source: The use of the I<timezone> structure is obsolete; the I<tz> argument should normally be specified as NULL. (See NOTES below.)
ru: Пользоваться структурой I<timezone> не рекомендуется; значением аргумента I<tz> в большинстве случаев должен быть NULL (см. ЗАМЕЧАНИЯ далее).

source: Under Linux, there are some peculiar "warp clock" semantics associated with the B<settimeofday>() system call if on the very first call (after booting) that has a non-NULL I<tz> argument, the I<tv> argument is NULL and the I<tz_minuteswest> field is nonzero. (The I<tz_dsttime> field should be zero for this case.) In such a case it is assumed that the CMOS clock is on local time, and that it has to be incremented by this amount to get UTC system time. No doubt it is a bad idea to use this feature.
ru: В Linux существует специфическое понятие «временной сдвиг» (warp clock), связанное с системным вызовом B<settimeofday>(), который образуется при самом первом вызове (после загрузки), если аргумент I<tz> не равен NULL, аргумент I<tv> равен NULL и поле I<tz_minuteswest> не равно нулю (в этом случае значение поля I<tz_dsttime> должно быть равно нулю). В этом случае предполагается, что время аппаратных часов (CMOS clock) местное и к нему должен быть добавлен этот параметр для того, чтобы получилось время UTC. Но, как мы и говорили, использовать этот метод не рекомендуется.

source: B<gettimeofday>() and B<settimeofday>() return 0 for success, or -1 for failure (in which case I<errno> is set appropriately).
ru: При успешном выполнении B<gettimeofday>() и B<settimeofday>() возвращают 0, или -1 в случае ошибки (I<errno> устанавливается в соответствующее значение).

source: One of I<tv> or I<tz> pointed outside the accessible address space.
ru: Одно из значений в I<tv> или I<tz> находится вне доступного адресного пространства.

source: (B<settimeofday>()): I<timezone> is invalid.
ru: (B<settimeofday>()): неверное значение I<timezone>.

source: (B<settimeofday>()): I<tv.tv_sec> is negative or I<tv.tv_usec> is outside the range [0..999,999].
ru: (B<settimeofday>()): I<tv.tv_sec> отрицательно или I<tv.tv_usec> вне диапазона [0..999,999].

source: B<EINVAL> (since Linux 4.3)
ru: B<EINVAL> (начиная с Linux 4.3)

source: (B<settimeofday>()): An attempt was made to set the time to a value less than the current value of the B<CLOCK_MONOTONIC> clock (see B<clock_gettime>(2)).
ru: (B<settimeofday>()): выполнялась попытка установки времени в значение меньше текущего значения часов B<CLOCK_MONOTONIC> (смотрите B<clock_gettime>(2)).

source: The calling process has insufficient privilege to call B<settimeofday>(); under Linux the B<CAP_SYS_TIME> capability is required.
ru: У вызывающего процесса недостаточно прав для вызова B<settimeofday>(); в Linux для этого требуется мандат B<CAP_SYS_TIME>.

source: SVr4, 4.3BSD. POSIX.1-2001 describes B<gettimeofday>() but not B<settimeofday>(). POSIX.1-2008 marks B<gettimeofday>() as obsolete, recommending the use of B<clock_gettime>(2) instead.
ru: SVr4, 4.3BSD. В POSIX.1-2001 описан B<gettimeofday>(), но нет B<settimeofday>(). В POSIX.1-2008 вызов B<gettimeofday>() помечен как устаревший, вместо него рекомендуется использовать B<clock_gettime>(2).

source: The time returned by B<gettimeofday>() I<is> affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the system time). If you need a monotonically increasing clock, see B<clock_gettime>(2).
ru: На время, возвращаемое B<gettimeofday>(), I<влияют> скачки в системном времени (например, если системный администратор вручную изменил системное время). Если вам требуются однообразно увеличивающееся время, смотрите B<clock_gettime>(2).

source: Macros for operating on I<timeval> structures are described in B<timeradd>(3).
ru: Для работы со структурой I<timeval> существуют макросы, описанные в B<timeradd>(3).

source: Traditionally, the fields of I<struct timeval> were of type I<long>.
ru: Обычно, поля I<struct timeval> имеют тип I<long>.

source: On some architectures, an implementation of B<gettimeofday>() is provided in the B<vdso>(7).
ru: На некоторых архитектурах реализация B<gettimeofday>() находится в B<vdso>(7).

source: The tz_dsttime field
ru: Поле tz_dsttime

source: On a non-Linux kernel, with glibc, the I<tz_dsttime> field of I<struct timezone> will be set to a nonzero value by B<gettimeofday>() if the current timezone has ever had or will have a daylight saving rule applied. In this sense it exactly mirrors the meaning of B<daylight>(3) for the current zone. On Linux, with glibc, the setting of the I<tz_dsttime> field of I<struct timezone> has never been used by B<settimeofday>() or B<gettimeofday>(). Thus, the following is purely of historical interest.
ru: В системах с не ядрами Linux, но с glibc, полю I<tz_dsttime> из I<struct timezone> вызов B<gettimeofday>() присвоит ненулевое значение, если в текущем часовом поясе уже применялось или будет применяться правило перехода на летнее время. В этом смысле это зеркально отражает назначение B<daylight>(3) для текущего пояса. В Linux с glibc значение поля I<tz_dsttime> из I<struct timezone> никогда не используется в B<settimeofday>() или B<gettimeofday>(). Таким образом, следующий абзац представляет только исторический интерес.

source: On old systems, the field I<tz_dsttime> contains a symbolic constant (values are given below) that indicates in which part of the year Daylight Saving Time is in force. (Note: this value is constant throughout the year: it does not indicate that DST is in force, it just selects an algorithm.) The daylight saving time algorithms defined are as follows:
ru: В старых системах поле I<tz_dsttime> содержит символьную константу (значения приведены ниже), которая включает в себя информацию о сезонной коррекции времени (Daylight Saving Time) (замечание: эта величина постоянна и указывает лишь на алгоритм коррекции). Существующие алгоритмы сезонной коррекции:

source: B<DST_NONE> /* not on DST */ B<DST_USA> /* USA style DST */ B<DST_AUST> /* Australian style DST */ B<DST_WET> /* Western European DST */ B<DST_MET> /* Middle European DST */ B<DST_EET> /* Eastern European DST */ B<DST_CAN> /* Canada */ B<DST_GB> /* Great Britain and Eire */ B<DST_RUM> /* Romania */ B<DST_TUR> /* Turkey */ B<DST_AUSTALT> /* Australian style with shift in 1986 */
ru: B<DST_NONE> /* нет DST */ B<DST_USA> /* американский DST */ B<DST_AUST> /* австралийский DST */ B<DST_WET> /* западноевропейский DST */ B<DST_MET> /* средневосточный DST */ B<DST_EET> /* восточноевропейский DST */ B<DST_CAN> /* Канада */ B<DST_GB> /* Великобритания и Ирландия */ B<DST_RUM> /* Румыния */ B<DST_TUR> /* Турция */ B<DST_AUSTALT> /* австралийский со сдвигом на 1986 год */

source: Of course it turned out that the period in which Daylight Saving Time is in force cannot be given by a simple algorithm, one per country; indeed, this period is determined by unpredictable political decisions. So this method of representing timezones has been abandoned.
ru: Разумеется, коррекцию для каждой страны нельзя описать простым алгоритмом, так как этот фактор может зависеть даже от непредсказуемых политических решений. Поэтому этот метод представления часовых поясов больше не используется.

source: getresuid, getresgid - get real, effective and saved user/group IDs
ru: getresuid, getresgid - получение действительного, эффективного и сохранённого идентификатора пользователя или группы

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */

source: B<getresuid>() returns the real UID, the effective UID, and the saved set-user-ID of the calling process, in the arguments I<ruid>, I<euid>, and I<suid>, respectively. B<getresgid>() performs the analogous task for the process's group IDs.
ru: B<getresuid>() возвращает действительный (real), эффективный (effective) и сохранённый (saved) set-user-ID идентификатор пользователя вызывающего процесса в аргументах I<ruid>, I<euid> и I<suid>, соответственно. B<getresgid>() выполняет аналогичную задачу для идентификаторов группы процесса.

source: One of the arguments specified an address outside the calling program's address space.
ru: В одном из аргументов задан адрес вне области адресного пространства вызывающей программы.

source: These system calls appeared on Linux starting with kernel 2.1.44.
ru: Данные системные вызовы появились в Linux, начиная с ядра версии 2.1.44.

source: The prototypes are given by glibc since version 2.3.2, provided B<_GNU_SOURCE> is defined.
ru: В glibc прототипы появились в версии 2.3.2, они предоставляются при определении B<_GNU_SOURCE>.

source: These calls are nonstandard; they also appear on HP-UX and some of the BSDs.
ru: Это нестандартные вызовы; также они есть в HP-UX и некоторых BSD.

source: The original Linux B<getresuid>() and B<getresgid>() system calls supported only 16-bit user and group IDs. Subsequently, Linux 2.4 added B<getresuid32>() and B<getresgid32>(), supporting 32-bit IDs. The glibc B<getresuid>() and B<getresgid>() wrapper functions transparently deal with the variations across kernel versions.
ru: Первоначальные версии системных вызовов B<getresuid>() и B<getresgid>() в Linux поддерживали только 16-битные идентификаторы пользователей и групп. Позднее в Linux 2.4 были добавлены вызовы B<getresuid32>() и B<getresgid32>(), поддерживающие 32-битные идентификаторы. В glibc обёрточные функции B<getresuid>() и B<getresgid>() работают одинаково вне зависимости от версий ядра.

source: get_mempolicy - retrieve NUMA memory policy for a thread
ru: get_mempolicy - возвращает политику работы с памятью NUMA для нити

source: Link with I<-lnuma>.
ru: Компонуется при указании параметра I<-lnuma>.

source: B<get_mempolicy>() retrieves the NUMA policy of the calling thread or of a memory address, depending on the setting of I<flags>.
ru: Вызов B<get_mempolicy>() возвращает политику NUMA вызывающей нити или адреса памяти (в зависимости от значения I<flags>).

source: A NUMA machine has different memory controllers with different distances to specific CPUs. The memory policy defines from which node memory is allocated for the thread.
ru: Машина с NUMA имеет различные контроллеры памяти с различными расстояниями до определённых ЦП. Политикой памяти задаётся узел, на котором выделяется память для нити.

source: If I<flags> is specified as 0, then information about the calling thread's default policy (as set by B<set_mempolicy>(2)) is returned, in the buffers pointed to by I<mode> and I<nodemask>. The value returned in these arguments may be used to restore the thread's policy to its state at the time of the call to B<get_mempolicy>() using B<set_mempolicy>(2). When I<flags> is 0, I<addr> must be specified as NULL.
ru: Если значение I<flags> равно 0, то в буферы, указанные в I<mode> и I<nodemask>, возвращается информация о политике по умолчанию для вызывающей нити (которая была задана с помощью B<set_mempolicy>(2)). Полученное значение может использоваться для восстановления политики нити в её состояние на время вызова B<get_mempolicy>() с помощью B<set_mempolicy>(2). Если значение I<flags> равно 0, то значение I<addr> должно быть равно NULL.

source: If I<flags> specifies B<MPOL_F_MEMS_ALLOWED> (available since Linux 2.6.24), the I<mode> argument is ignored and the set of nodes (memories) that the thread is allowed to specify in subsequent calls to B<mbind>(2) or B<set_mempolicy>(2) (in the absence of any I<mode flags>) is returned in I<nodemask>. It is not permitted to combine B<MPOL_F_MEMS_ALLOWED> with either B<MPOL_F_ADDR> or B<MPOL_F_NODE>.
ru: Если I<flags> равно B<MPOL_F_MEMS_ALLOWED> (доступно, начиная с Linux 2.6.24), то аргумент I<mode> игнорируется и набор узлов (их памяти), которые разрешено указывать нити в последующих вызовах B<mbind>(2) или B<set_mempolicy>(2) (в отсутствии любых значений I<флагов режима>), возвращается в I<nodemask>. Не разрешено объединять B<MPOL_F_MEMS_ALLOWED> с B<MPOL_F_ADDR> или B<MPOL_F_NODE>.

source: If I<flags> specifies B<MPOL_F_ADDR>, then information is returned about the policy governing the memory address given in I<addr>. This policy may be different from the thread's default policy if B<mbind>(2) or one of the helper functions described in B<numa>(3) has been used to establish a policy for the memory range containing I<addr>.
ru: Если I<flags> равно B<MPOL_F_ADDR>, то возвращается информация об управляющей политике адреса памяти, указанного в I<addr>. Эта политика может отличаться от политики нити по умолчанию, если B<mbind>(2) или одна из вспомогательных функций, описанных в B<numa>(3), были использованы при установлении политики для диапазона памяти, содержащего I<addr>.

source: If the I<mode> argument is not NULL, then B<get_mempolicy>() will store the policy mode and any optional I<mode flags> of the requested NUMA policy in the location pointed to by this argument. If I<nodemask> is not NULL, then the nodemask associated with the policy will be stored in the location pointed to by this argument. I<maxnode> specifies the number of node IDs that can be stored into I<nodemask>\(emthat is, the maximum node ID plus one. The value specified by I<maxnode> is always rounded to a multiple of I<sizeof(unsigned\ long)*8>.
ru: Если аргумент I<mode> не равен NULL, то B<get_mempolicy>() сохранит режим политики и все необязательные I<флаги режима> запрашиваемой политики NUMA в место, указанное этим аргументом. Если I<nodemask> не равно NULL, то значение nodemask, связанной с политикой, будет сохранено в место, указанное этим аргументом. В I<maxnode> задаётся количество идентификаторов узлов, которые могут быть сохранены в I<nodemask> \(em то есть, максимальный идентификатор узла плюс один. Значение, указанное в I<maxnode>, всегда округляется до кратного I<sizeof(unsigned\ long)*8>.

source: If I<flags> specifies both B<MPOL_F_NODE> and B<MPOL_F_ADDR>, B<get_mempolicy>() will return the node ID of the node on which the address I<addr> is allocated into the location pointed to by I<mode>. If no page has yet been allocated for the specified address, B<get_mempolicy>() will allocate a page as if the thread had performed a read (load) access to that address, and return the ID of the node where that page was allocated.
ru: Если в I<flags> указано B<MPOL_F_NODE> и B<MPOL_F_ADDR>, то B<get_mempolicy>() вернёт идентификатор узла, на котором расположен адрес I<addr> в расположение, заданное I<mode>. Если для указанного адреса страница ещё не выделена, то B<get_mempolicy>() выделит страницу, как если бы нить выполнила чтение (загрузку) по этому адресу, и вернёт идентификатор узла, на котором была размещена страница.

source: If I<flags> specifies B<MPOL_F_NODE>, but not B<MPOL_F_ADDR>, and the thread's current policy is B<MPOL_INTERLEAVE>, then B<get_mempolicy>() will return in the location pointed to by a non-NULL I<mode> argument, the node ID of the next node that will be used for interleaving of internal kernel pages allocated on behalf of the thread. These allocations include pages for memory-mapped files in process memory ranges mapped using the B<mmap>(2) call with the B<MAP_PRIVATE> flag for read accesses, and in memory ranges mapped with the B<MAP_SHARED> flag for all accesses.
ru: Если I<flags> содержит B<MPOL_F_NODE>, но не B<MPOL_F_ADDR>, и значение текущей политики нити равно B<MPOL_INTERLEAVE>, то B<get_mempolicy>() вернёт в расположение, указанное в аргументе I<mode> (не равно NULL), идентификатор узла следующего узла, который будет использован при чередовании внутренних страниц ядра, выделяемых для нити. Эти выделения содержат страницы памяти отображённых файлов в диапазоне памяти процесса, отображённых с помощью вызова B<mmap>(2) с флагом B<MAP_PRIVATE> для чтения, и в диапазонах памяти, отображённых с флагом B<MAP_SHARED>, для всех операций.

source: Other flag values are reserved.
ru: Другие значения флагов зарезервированы.

source: For an overview of the possible policies see B<set_mempolicy>(2).
ru: Обзор возможных политик смотрите в B<set_mempolicy>(2).

source: On success, B<get_mempolicy>() returns 0; on error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<get_mempolicy>() возвращает 0; при ошибке \(em -1, а в I<errno> задаётся причина ошибки.

source: Part of all of the memory range specified by I<nodemask> and I<maxnode> points outside your accessible address space.
ru: Часть всего диапазона памяти, заданная в I<nodemask> и I<maxnode>, указывает за пределы доступного адресного пространства.

source: The value specified by I<maxnode> is less than the number of node IDs supported by the system. Or I<flags> specified values other than B<MPOL_F_NODE> or B<MPOL_F_ADDR>; or I<flags> specified B<MPOL_F_ADDR> and I<addr> is NULL, or I<flags> did not specify B<MPOL_F_ADDR> and I<addr> is not NULL. Or, I<flags> specified B<MPOL_F_NODE> but not B<MPOL_F_ADDR> and the current thread policy is not B<MPOL_INTERLEAVE>. Or, I<flags> specified B<MPOL_F_MEMS_ALLOWED> with either B<MPOL_F_ADDR> or B<MPOL_F_NODE>. (And there are other B<EINVAL> cases.)
ru: Значение, указанное в I<maxnode>, меньше количества идентификаторов узлов, поддерживаемых системой. Или в I<flags> указаны значения, отличные от B<MPOL_F_NODE> или B<MPOL_F_ADDR>; или в I<flags> указано B<MPOL_F_ADDR> и I<addr> равно NULL, или в I<flags> не указано B<MPOL_F_ADDR> и I<addr> не равно NULL. Или в I<flags> указано B<MPOL_F_NODE>, но не B<MPOL_F_ADDR> и значение текущей политики нити не равно B<MPOL_INTERLEAVE>. Или в I<flags> указано B<MPOL_F_MEMS_ALLOWED> вместе с B<MPOL_F_ADDR> или B<MPOL_F_NODE> (и есть другие случаи возврата B<EINVAL>).

source: The B<get_mempolicy>() system call was added to the Linux kernel in version 2.6.7.
ru: Системный вызов B<get_mempolicy>() был добавлен в ядро Linux версии 2.6.7.

source: For information on library support, see B<numa>(7).
ru: Информация о библиотеке доступна в B<numa>(7).

source: Linux System Calls
ru: Системные вызовы Linux

source: get_robust_list, set_robust_list - get/set list of robust futexes
ru: get_robust_list, set_robust_list - возвращает/назначает список надёжных фьютексов (futexes)
