Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_g/*.po
Languages: ru

source: If I<hints.ai_flags> specifies the B<AI_V4MAPPED> flag, and I<hints.ai_family> was specified as B<AF_INET6>, and no matching IPv6 addresses could be found, then return IPv4-mapped IPv6 addresses in the list pointed to by I<res>. If both B<AI_V4MAPPED> and B<AI_ALL> are specified in I<hints.ai_flags>, then return both IPv6 and IPv4-mapped IPv6 addresses in the list pointed to by I<res>. B<AI_ALL> is ignored if B<AI_V4MAPPED> is not also specified.
ru: Если в I<hints.ai_flags> содержится флаг B<AI_V4MAPPED> и в I<hints.ai_family> задан B<AF_INET6>, и не найдено подходящих адресов IPv6, то в списке, на который указывает I<res>, возвращаются IPv6 адреса отображённых адресов IPv4. Если в I<hints.ai_flags> указаны и B<AI_V4MAPPED>, и B<AI_ALL>, то в списке, на который указывает I<res>, возвращаются и адреса IPv6 и IPv6 адреса отображённых адресов IPv4. Флаг B<AI_ALL> игнорируется, если с ним не задан B<AI_V4MAPPED>.

source: The B<freeaddrinfo>() function frees the memory that was allocated for the dynamically allocated linked list I<res>.
ru: Функция B<freeaddrinfo>() освобождает память, которая была выделена для динамического связного списка I<res>.

source: Extensions to getaddrinfo() for Internationalized Domain Names
ru: Расширения getaddrinfo() для интернациональных доменных имён

source: Starting with glibc 2.3.4, B<getaddrinfo>() has been extended to selectively allow the incoming and outgoing hostnames to be transparently converted to and from the Internationalized Domain Name (IDN) format (see RFC 3490, I<Internationalizing Domain Names in Applications (IDNA)>). Four new flags are defined:
ru: Начиная с glibc 2.3.4, B<getaddrinfo>() был расширен для выборочного прозрачного разрешения исходящих и входящих адресов в формате интернациональных доменных имен (IDN, см. RFC 3490, I<Internationalizing Domain Names in Applications (IDNA)>). Было определено четыре новых флага:

source: If this flag is specified, then the node name given in I<node> is converted to IDN format if necessary. The source encoding is that of the current locale.
ru: Если указан этот флаг, то, в случае необходимости, имя узла, указанного в I<node>, будет преобразовано в IDN-формат. Исходной кодировкой будет текущая локаль.

source: If the input name contains non-ASCII characters, then the IDN encoding is used. Those parts of the node name (delimited by dots) that contain non-ASCII characters are encoded using ASCII Compatible Encoding (ACE) before being passed to the name resolution functions.
ru: Если имя на входе содержит символы не-ASCII, то будет задействовано кодирование IDN. Части имени узла (разделенные точками), которые содержат символы не-ASCII, будут закодированы с помощью ASCII Compatible Encoding (ACE) прежде, чем будут переданы функциям преобразования имен

source: After a successful name lookup, and if the B<AI_CANONNAME> flag was specified, B<getaddrinfo>() will return the canonical name of the node corresponding to the I<addrinfo> structure value passed back. The return value is an exact copy of the value returned by the name resolution function.
ru: При указанном флаге B<AI_CANONNAME> после успешного преобразования имени B<getaddrinfo>() вернет каноничное имя узла согласно значению структуры I<addrinfo>. Возвращаемое значение будет точной копией значения, возвращенного функцией разрешения имени.

source: If the name is encoded using ACE, then it will contain the I<xn--> prefix for one or more components of the name. To convert these components into a readable form the B<AI_CANONIDN> flag can be passed in addition to B<AI_CANONNAME>. The resulting string is encoded using the current locale's encoding.
ru: Если имя закодировано с помощью ACE, то оно будет содержать префикс I<xn--> для каждого из закодированных компонентов имени. Чтобы преобразовать эти компоненты в читаемый вид, вместе с флагом B<AI_CANONNAME> следует передать B<AI_CANONIDN>. Итоговая строка будет кодирована при помощи текущей локали.

source: B<getaddrinfo>() returns 0 if it succeeds, or one of the following nonzero error codes:
ru: В случае успеха B<getaddrinfo>() возвращает 0, либо один из следующие ненулевых кодов ошибки:

source: The specified network host does not have any network addresses in the requested address family.
ru: У указанного сетевого узла нет сетевых адресов в запрашиваемом семействе адресов.

source: The name server returned a temporary failure indication. Try again later.
ru: Сервер имен вернул временную ошибку. Попробуйте позднее.

source: I<hints.ai_flags> contains invalid flags; or, I<hints.ai_flags> included B<AI_CANONNAME> and I<name> was NULL.
ru: В I<hints.ai_flags> содержатся неправильные флаги, либо I<hints.ai_flags> содержит B<AI_CANONNAME>, а I<name> - NULL.

source: The name server returned a permanent failure indication.
ru: Сервер имен вернул постоянную ошибку.

source: The requested address family is not supported.
ru: Запрашиваемое семейство адресов не поддерживается.

source: The specified network host exists, but does not have any network addresses defined.
ru: Указанный сетевой узел существует, однако не имеет ни одного определенного сетевого адреса.

source: The I<node> or I<service> is not known; or both I<node> and I<service> are NULL; or B<AI_NUMERICSERV> was specified in I<hints.ai_flags> and I<service> was not a numeric port-number string.
ru: I<node> или I<service> неизвестно; либо и I<node>, и I<service> равны NULL; либо в I<hints.ai_flags> указан флаг B<AI_NUMERICSERV>, а I<service> не является числовой строкой порта.

source: The requested service is not available for the requested socket type. It may be available through another socket type. For example, this error could occur if I<service> was "shell" (a service available only on stream sockets), and either I<hints.ai_protocol> was B<IPPROTO_UDP>, or I<hints.ai_socktype> was B<SOCK_DGRAM>; or the error could occur if I<service> was not NULL, and I<hints.ai_socktype> was B<SOCK_RAW> (a socket type that does not support the concept of services).
ru: Запрошенная служба не доступна для запрошенного типа сокета. Она может быть доступна через другой тип сокета. Например, эта ошибка может возникнуть, если в I<service> указан «shell» (служба, доступная только для потоковых сокетов) при указанном в I<hints.ai_protocol> B<IPPROTO_UDP>, либо указанном в I<hints.ai_socktype> B<SOCK_DGRAM>. Также ошибка может возникнуть, если I<service> не равно NULL, а в I<hints.ai_socktype> указано значение B<SOCK_RAW> (тип сокета, для которого концепция служб неприменима).

source: The requested socket type is not supported. This could occur, for example, if I<hints.ai_socktype> and I<hints.ai_protocol> are inconsistent (e.g., B<SOCK_DGRAM> and B<IPPROTO_TCP>, respectively).
ru: Запрашиваемый тип сокетов не поддерживается. Такая ошибка может возникнуть, если I<hints.ai_socktype> и I<hints.ai_protocol> противоречат друг другу (например, B<SOCK_DGRAM> и B<IPPROTO_TCP> соответственно).

source: Other system error, check I<errno> for details.
ru: Для других системных ошибок следует проверять I<errno>.

source: The B<gai_strerror>() function translates these error codes to a human readable string, suitable for error reporting.
ru: Функция B<gai_strerror>() транслирует эти коды ошибок в читаемый формат, подходящий для сообщений об ошибке.

source: POSIX.1-2001, POSIX.1-2008. The B<getaddrinfo>() function is documented in RFC\ 2553.
ru: POSIX.1-2001, POSIX.1-2008. Функция B<getaddrinfo>() описана в RFC\ 2553.

source: B<getaddrinfo>() supports the I<address>B<%>I<scope-id> notation for specifying the IPv6 scope-ID.
ru: B<getaddrinfo>() поддерживает нотацию I<address>B<%>I<scope-id> для указания IPv6 scope-ID.

source: B<AI_ADDRCONFIG>, B<AI_ALL>, and B<AI_V4MAPPED> are available since glibc 2.3.3. B<AI_NUMERICSERV> is available since glibc 2.3.4.
ru: B<AI_ADDRCONFIG>, B<AI_ALL> и B<AI_V4MAPPED> доступны, начиная с glibc 2.3.3. B<AI_NUMERICSERV> доступен, начиная с glibc 2.3.4.

source: According to POSIX.1, specifying I<hints> as NULL should cause I<ai_flags> to be assumed as 0. The GNU C library instead assumes a value of B<(AI_V4MAPPED\ |\ AI_ADDRCONFIG)> for this case, since this value is considered an improvement on the specification.
ru: Согласно POSIX.1, при указании I<hints> в NULL I<ai_flags> должен предполагаться как равный 0. Вместо этого библиотека GNU C в данном случае предполагает значение B<(AI_V4MAPPED\ |\ AI_ADDRCONFIG)>, так как данное значение было принято в качестве улучшения спецификации.

source: The following programs demonstrate the use of B<getaddrinfo>(), B<gai_strerror>(), B<freeaddrinfo>(), and B<getnameinfo>(3). The programs are an echo server and client for UDP datagrams.
ru: Следующие программы демонстрируют использование B<getaddrinfo>(), B<gai_strerror>(), B<freeaddrinfo>() и B<getnameinfo>(3). Это программы эхо-сервера и клиента UDP-дейтаграмм.

source: Server program
ru: Серверная программа

source: memset(&hints, 0, sizeof(struct addrinfo)); hints.ai_family = AF_UNSPEC; /* Allow IPv4 or IPv6 */ hints.ai_socktype = SOCK_DGRAM; /* Datagram socket */ hints.ai_flags = AI_PASSIVE; /* For wildcard IP address */ hints.ai_protocol = 0; /* Any protocol */ hints.ai_canonname = NULL; hints.ai_addr = NULL; hints.ai_next = NULL;
ru: memset(&hints, 0, sizeof(struct addrinfo)); hints.ai_family = AF_UNSPEC; /* Разрешены IPv4 и IPv6 */ hints.ai_socktype = SOCK_DGRAM; /* Сокет для дейтаграмм */ hints.ai_flags = AI_PASSIVE; /* Для wildcard IP-адреса */ hints.ai_protocol = 0; /* Любой протокол */ hints.ai_canonname = NULL; hints.ai_addr = NULL; hints.ai_next = NULL;

source: /* getaddrinfo() returns a list of address structures. Try each address until we successfully bind(2). If socket(2) (or bind(2)) fails, we (close the socket and) try the next address. */
ru: /* getaddrinfo() возвращает список структур адресов. Идет проверка каждого адреса до успешного bind(2). Если socket(2) (или bind(2)) терпит неудачу, мы (закрываем сокет и) пробуем следующий. */

source: if (bind(sfd, rp-E<gt>ai_addr, rp-E<gt>ai_addrlen) == 0) break; /* Success */
ru: if (bind(sfd, rp-E<gt>ai_addr, rp-E<gt>ai_addrlen) == 0) break; /* Успех */

source: if (rp == NULL) { /* No address succeeded */ fprintf(stderr, "Could not bind\en"); exit(EXIT_FAILURE); }
ru: if (rp == NULL) { /* Нет успешных адресов */ fprintf(stderr, "Could not bind\en"); exit(EXIT_FAILURE); }

source: freeaddrinfo(result); /* No longer needed */
ru: freeaddrinfo(result); /* Больше не нужен */

source: /* Read datagrams and echo them back to sender */
ru: /* Читаем дейтаграмму и пересылаем ее назад отправителю */

source: for (;;) { peer_addr_len = sizeof(struct sockaddr_storage); nread = recvfrom(sfd, buf, BUF_SIZE, 0, (struct sockaddr *) &peer_addr, &peer_addr_len); if (nread == -1) continue; /* Ignore failed request */
ru: for (;;) { peer_addr_len = sizeof(struct sockaddr_storage); nread = recvfrom(sfd, buf, BUF_SIZE, 0, (struct sockaddr *) &peer_addr, &peer_addr_len); if (nread == -1) continue; /* Игнорируем запрос с ошибкой */

source: s = getnameinfo((struct sockaddr *) &peer_addr, peer_addr_len, host, NI_MAXHOST, service, NI_MAXSERV, NI_NUMERICSERV); if (s == 0) printf("Received %zd bytes from %s:%s\en", nread, host, service); else fprintf(stderr, "getnameinfo: %s\en", gai_strerror(s));
ru: s = getnameinfo((struct sockaddr *) &peer_addr, peer_addr_len, host, NI_MAXHOST, service, NI_MAXSERV, NI_NUMERICSERV); if (s == 0) printf("Получено %zd байт из %s:%s\en", nread, host, service); else fprintf(stderr, "getnameinfo: %s\en", gai_strerror(s));

source: if (sendto(sfd, buf, nread, 0, (struct sockaddr *) &peer_addr, peer_addr_len) != nread) fprintf(stderr, "Error sending response\en"); } }
ru: if (sendto(sfd, buf, nread, 0, (struct sockaddr *) &peer_addr, peer_addr_len) != nread) fprintf(stderr, "Ошибка отправки ответа\en"); } }

source: Client program
ru: Клиентская программа

source: /* Obtain address(es) matching host/port */
ru: /* Получаем адрес(а), соответствующие узлу/порту */

source: memset(&hints, 0, sizeof(struct addrinfo)); hints.ai_family = AF_UNSPEC; /* Allow IPv4 or IPv6 */ hints.ai_socktype = SOCK_DGRAM; /* Datagram socket */ hints.ai_flags = 0; hints.ai_protocol = 0; /* Any protocol */
ru: memset(&hints, 0, sizeof(struct addrinfo)); hints.ai_family = AF_UNSPEC; /* Разрешены IPv4 и IPv6 */ hints.ai_socktype = SOCK_DGRAM; /* Сокет дейтаграмм */ hints.ai_flags = 0; hints.ai_protocol = 0; /* Любой протокол */

source: /* getaddrinfo() returns a list of address structures. Try each address until we successfully connect(2). If socket(2) (or connect(2)) fails, we (close the socket and) try the next address. */
ru: /* getaddrinfo() возвращает список структур адресов. Идет проверка каждого адреса до успешного connect(2). Если socket(2) (или connect(2)) терпит неудачу, мы (закрываем сокет и) пробуем следующий. */

source: if (connect(sfd, rp-E<gt>ai_addr, rp-E<gt>ai_addrlen) != -1) break; /* Success */
ru: if (connect(sfd, rp-E<gt>ai_addr, rp-E<gt>ai_addrlen) != -1) break; /* Успех */

source: if (rp == NULL) { /* No address succeeded */ fprintf(stderr, "Could not connect\en"); exit(EXIT_FAILURE); }
ru: if (rp == NULL) { /* Нет успешных адресов */ fprintf(stderr, "Could not connect\en"); exit(EXIT_FAILURE); }

source: /* Send remaining command-line arguments as separate datagrams, and read responses from server */
ru: /* Отправляем оставшиеся аргументы командной строки в виде отдельных дейтаграмм и ждем ответа от сервера */

source: for (j = 3; j E<lt> argc; j++) { len = strlen(argv[j]) + 1; /* +1 for terminating null byte */
ru: for (j = 3; j E<lt> argc; j++) { len = strlen(argv[j]) + 1; /* +1 для завершающего null-байта */

source: if (len E<gt> BUF_SIZE) { fprintf(stderr, "Ignoring long message in argument %d\en", j); continue; }
ru: if (len E<gt> BUF_SIZE) { fprintf(stderr, "Игнорируем длинное сообщение в аргументе %d\en", j); continue; }

source: printf("Received %zd bytes: %s\en", nread, buf); }
ru: printf("Получено %zd байт: %s\en", nread, buf); }

source: getsubopt - parse suboption arguments from a string
ru: getsubopt - анализирует подпараметры аргументов строки

source: B<getsubopt>() parses the list of comma-separated suboptions provided in I<optionp>. (Such a suboption list is typically produced when B<getopt>(3) is used to parse a command line; see for example the I<-o> option of B<mount>(8).) Each suboption may include an associated value, which is separated from the suboption name by an equal sign. The following is an example of the kind of string that might be passed in I<optionp>:
ru: Функция B<getsubopt>() анализирует список подпараметров, указываемых через запятую, заданный в I<optionp> (такой список подпараметров, обычно, создаётся при использовании B<getopt>(3) для разбора командной строки; например, смотрите параметр I<-o> в B<mount>(8)). Каждый подпараметр может содержать связанное с ним значение, которое отделяется от имени подпараметра знаком равно. Вот пример строки, которую можно передать в I<optionp>:

source: The I<tokens> argument is a pointer to a NULL-terminated array of pointers to the tokens that B<getsubopt>() will look for in I<optionp>. The tokens should be distinct, null-terminated strings containing at least one character, with no embedded equal signs or commas.
ru: Аргумент I<tokens> — указатель на массив (завершается NULL) указателей на токены, которые B<getsubopt>() будет просматривать при поиске в I<optionp>. Токены должны быть различающимися строками (завершающимися null), содержащими, как минимум, один символ и не содержащих знаков равно или запятых.

source: Each call to B<getsubopt>() returns information about the next unprocessed suboption in I<optionp>. The first equal sign in a suboption (if any) is interpreted as a separator between the name and the value of that suboption. The value extends to the next comma, or (for the last suboption) to the end of the string. If the name of the suboption matches a known name from I<tokens>, and a value string was found, B<getsubopt>() sets I<*valuep> to the address of that string. The first comma in I<optionp> is overwritten with a null byte, so I<*valuep> is precisely the "value string" for that suboption.
ru: При каждом вызове B<getsubopt>() возвращается информация о следующем необработанном подпараметре в I<optionp>. Первый знак равно в подпараметре (если есть) считается разделителем имени и значения в этом подпараметре. Значение длится до последующей запятой или (для последнего подпараметра) до конца строки. Если имя подпараметра совпадает с известным именем из I<tokens>, и найдено строка-значение, то B<getsubopt>() записывает в I<*valuep> адрес этой строки. Первая запятая в I<optionp> перезаписывается байтом null, поэтому I<*valuep> — точное «строка-значение» этого подпараметра.

source: If the suboption is recognized, but no value string was found, I<*valuep> is set to NULL.
ru: Если подпараметр распознан, но значение строки не найдено, то I<*valuep> присваивается NULL.

source: When B<getsubopt>() returns, I<optionp> points to the next suboption, or to the null byte (\(aq\e0\(aq) at the end of the string if the last suboption was just processed.
ru: При завершении работы B<getsubopt>() значение I<optionp> указывает на следующий подпараметр или на байт null (\(aq\e0\(aq) в конце строки (в случае, если последний подпараметр был только что обработан).

source: If the first suboption in I<optionp> is recognized, B<getsubopt>() returns the index of the matching suboption element in I<tokens>. Otherwise, -1 is returned and I<*valuep> is the entire I<name>B<[=>I<value>B<]> string.
ru: Если в I<optionp> распознан первый подпараметр, то B<getsubopt>() возвращает индекс элемента в I<tokens> найденного подпараметра. В противном случае возвращается -1 и значение I<*valuep> указывает на целую строку I<name>B<[=>I<value>B<]>.

source: Since I<*optionp> is changed, the first suboption before the call to B<getsubopt>() is not (necessarily) the same as the first suboption after B<getsubopt>().
ru: Так как I<*optionp> изменяется, первый подпараметр перед вызовом B<getsubopt>() не (не всегда) тот же самый, что и первый подпараметр после B<getsubopt>().

source: Since B<getsubopt>() overwrites any commas it finds in the string I<*optionp>, that string must be writable; it cannot be a string constant.
ru: Так как B<getsubopt>() заменяет запятые, найденные в строке I<*optionp>, то строка должна быть доступна на запись; она не может быть строковой константой.

source: The following program expects suboptions following a "-o" option.
ru: Следующая программа ожидает подпараметры после параметра «-o».

source: case NAME_OPT: if (value == NULL) { fprintf(stderr, "Missing value for " "suboption \(aq%s\(aq\en", token[NAME_OPT]); errfnd = 1; continue; }
ru: case NAME_OPT: if (value == NULL) { fprintf(stderr, "Отсутствует значение для " "подпараметра \(aq%s\(aq\en", token[NAME_OPT]); errfnd = 1; continue; }

source: default: fprintf(stderr, "No match found " "for token: /%s/\en", value); errfnd = 1; break; } } if (readwrite && readonly) { fprintf(stderr, "Only one of \(aq%s\(aq and \(aq%s\(aq can be " "specified\en", token[RO_OPT], token[RW_OPT]); errfnd = 1; } break;
ru: default: fprintf(stderr, "Совпадения не найдены " "для токена: /%s/\en", value); errfnd = 1; break; } } if (readwrite && readonly) { fprintf(stderr, "Может указываться только одно из \(aq%s\(aq " "и \(aq%s\(aq\en", token[RO_OPT], token[RW_OPT]); errfnd = 1; } break;

source: if (errfnd || argc == 1) { fprintf(stderr, "\enUsage: %s -o E<lt>suboptstringE<gt>\en", argv[0]); fprintf(stderr, "suboptions are \(aqro\(aq, \(aqrw\(aq, " "and \(aqname=E<lt>valueE<gt>\(aq\en"); exit(EXIT_FAILURE); }
ru: if (errfnd || argc == 1) { fprintf(stderr, "\enИспользование: %s -o E<lt>подпараметрE<gt>\en", argv[0]); fprintf(stderr, "возможны подпараметры: \(aqro\(aq, \(aqrw\(aq, " "и \(aqname=E<lt>значениеE<gt>\(aq\en"); exit(EXIT_FAILURE); }

source: /* Remainder of program... */
ru: /* Остальная часть программы… */

source: getrpcent_r, getrpcbyname_r, getrpcbynumber_r - get RPC entry (reentrant)
ru: getrpcent_r, getrpcbyname_r, getrpcbynumber_r - возвращают запись RPC (реентерабельные версии)

source: B<getrpcent_r>(), B<getrpcbyname_r>(), B<getrpcbynumber_r>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<getrpcent_r>(), B<getrpcbyname_r>(), B<getrpcbynumber_r>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: The B<getrpcent_r>(), B<getrpcbyname_r>(), and B<getrpcbynumber_r>() functions are the reentrant equivalents of, respectively, B<getrpcent>(3), B<getrpcbyname>(3), and B<getrpcbynumber>(3). They differ in the way that the I<rpcent> structure is returned, and in the function calling signature and return value. This manual page describes just the differences from the nonreentrant functions.
ru: Функции B<getrpcent_r>(), B<getrpcbyname_r>() и B<getrpcbynumber_r>() являются реентерабельными эквивалентами B<getrpcent>(3), B<getrpcbyname>(3) и B<getrpcbynumber>(3), соответственно. Они отличаются способом возврата структуры I<rpcent>, списком параметров и типом возвращаемого значения. В этой справочной странице описаны только различия с нереентерабельными функциями.

source: Instead of returning a pointer to a statically allocated I<rpcent> structure as the function result, these functions copy the structure into the location pointed to by I<result_buf>.
ru: Вместо возврата указателя на статически выделенную структуру I<rpcent> в качестве результата эти функции копируют структуру в расположение, указанное I<result_buf>.

source: The I<buf> array is used to store the string fields pointed to by the returned I<rpcent> structure. (The nonreentrant functions allocate these strings in static storage.) The size of this array is specified in I<buflen>. If I<buf> is too small, the call fails with the error B<ERANGE>, and the caller must try again with a larger buffer. (A buffer of length 1024 bytes should be sufficient for most applications.)
ru: Массив I<buf> используется для хранения строковых полей из возвращаемой структуры I<rpcent> (нереентерабельные функции выделяют эти строки из статического хранилища). Размер данного массива задаётся в I<buflen>. Если I<buf> слишком мал, то вызов завершается с ошибкой B<ERANGE>, вызывающий должен его повторить с большим буфером (для большинства приложений должно быть достаточно буфера длиной 1024 байт).

source: If the function call successfully obtains an RPC record, then I<*result> is set pointing to I<result_buf>; otherwise, I<*result> is set to NULL.
ru: Если вызов получил запись RPC, то I<*result> указывает на I<result_buf>; в противном случае I<*result> устанавливается в NULL.

source: On error, record not found (B<getrpcbyname_r>(), B<getrpcbynumber_r>()), or end of input (B<getrpcent_r>()) I<result> is set to NULL.
ru: При ошибке, отсутствии записи (B<getrpcbyname_r>(), B<getrpcbynumber_r>()) или конце данных (B<getrpcent_r>()) значение I<result> равно NULL.

source: (B<getrpcent_r>()) No more records in database.
ru: (B<getrpcent_r>()) Больше нет записей в базе данных.

source: getdtablesize - get file descriptor table size
ru: getdtablesize - возвращает размер таблицы файловых дескрипторов

source: /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L)
ru: /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L)
