Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_o/*.po
Languages: ru

source: A call to B<creat>() is equivalent to calling B<open>() with I<flags> equal to B<O_CREAT|O_WRONLY|O_TRUNC>.
ru: Вызов B<creat>() эквивалентен вызову B<open>() с значением I<flags> B<O_CREAT|O_WRONLY|O_TRUNC>.

source: The B<openat>() system call operates in exactly the same way as B<open>(), except for the differences described here.
ru: Системный вызов B<openat>() работает также как системный вызов B<open>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<open>() for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<open>()).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<open>()).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<open>()).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то I<dirfd> игнорируется.

source: B<open>(), B<openat>(), and B<creat>() return the new file descriptor, or -1 if an error occurred (in which case, I<errno> is set appropriately).
ru: Вызовы B<open>(), B<openat>() и B<creat>() возвращают новый дескриптор файла или -1 в случае ошибки (в этом случае I<errno> устанавливается в соответствующее значение).

source: B<open>(), B<openat>(), and B<creat>() can fail with the following errors:
ru: Вызовы B<open>(), B<openat>() и B<creat>() могут завершаться со следующими ошибками:

source: The requested access to the file is not allowed, or search permission is denied for one of the directories in the path prefix of I<pathname>, or the file did not exist yet and write access to the parent directory is not allowed. (See also B<path_resolution>(7).)
ru: Запрошенный доступ к файлу не разрешён, или один из каталогов в I<pathname> не позволяет поиск, файл ещё не существует, или доступ для записи в родительский каталог не разрешён (см. также B<path_resolution>(7)).

source: Where B<O_CREAT> is specified, the file does not exist, and the user's quota of disk blocks or inodes on the filesystem has been exhausted.
ru: Если указан флаг B<O_CREAT>, файл не существует и исчерпана пользовательская квота на дисковые блоки или inode файловой системы.

source: I<pathname> already exists and B<O_CREAT> and B<O_EXCL> were used.
ru: I<pathname> уже существует, то были указаны B<O_CREAT> и B<O_EXCL>.

source: I<pathname> points outside your accessible address space.
ru: Аргумент I<pathname> указывает за пределы доступного адресного пространства.

source: See B<EOVERFLOW>.
ru: Смотрите B<EOVERFLOW>.

source: While blocked waiting to complete an open of a slow device (e.g., a FIFO; see B<fifo>(7)), the call was interrupted by a signal handler; see B<signal>(7).
ru: При блокирующем ожидании завершения открытия медленного устройства (например, FIFO; см. B<fifo>(7)), вызов был прерван обработчиком сигнала; смотрите B<signal>(7).

source: The filesystem does not support the B<O_DIRECT> flag. See B<NOTES> for more information.
ru: Файловая система не поддерживает флаг B<O_DIRECT>. Подробности смотрите в B<ЗАМЕЧАНИЯ>.

source: Invalid value in I<flags>.
ru: Некорректное значение I<flags>.

source: B<O_TMPFILE> was specified in I<flags>, but neither B<O_WRONLY> nor B<O_RDWR> was specified.
ru: В I<flags> указан B<O_TMPFILE>, но не указан B<O_WRONLY> или B<O_RDWR>.

source: B<O_CREAT> was specified in I<flags> and the final component ("basename") of the new file's I<pathname> is invalid (e.g., it contains characters not permitted by the underlying filesystem).
ru: В I<flags> указан B<O_CREAT> и последний компонент («основная часть» (basename)) нового файла I<pathname> некорректен (например, содержит недопустимые в нижележащей файловой системе символы).

source: I<pathname> refers to a directory and the access requested involved writing (that is, B<O_WRONLY> or B<O_RDWR> is set).
ru: I<pathname> указывает на каталог и тип доступа подразумевает запись ( то есть установлен флаг B<O_WRONLY> или B<O_RDWR>).

source: I<pathname> refers to an existing directory, B<O_TMPFILE> and one of B<O_WRONLY> or B<O_RDWR> were specified in I<flags>, but this kernel version does not provide the B<O_TMPFILE> functionality.
ru: Значение I<pathname> ссылается на существующий каталог, в I<flags> указан B<O_TMPFILE> и один из B<O_WRONLY> или B<O_RDWR>, но версия ядра не предоставляет свойство B<O_TMPFILE>.

source: Too many symbolic links were encountered in resolving I<pathname>.
ru: Во время определения I<pathname> встретилось слишком много символьных ссылок.

source: I<pathname> was a symbolic link, and I<flags> specified B<O_NOFOLLOW> but not B<O_PATH>.
ru: Значение I<pathname> является символьной ссылкой и в I<flags> установлен B<O_NOFOLLOW>, но отсутствует B<O_PATH>.

source: The per-process limit on the number of open file descriptors has been reached (see the description of B<RLIMIT_NOFILE> in B<getrlimit>(2)).
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс (смотрите описание B<RLIMIT_NOFILE> в B<getrlimit>(2)).

source: I<pathname> was too long.
ru: I<pathname> слишком длинен.

source: The system-wide limit on the total number of open files has been reached.
ru: Достигнуто максимальное количество открытых файлов в системе.

source: I<pathname> refers to a device special file and no corresponding device exists. (This is a Linux kernel bug; in this situation B<ENXIO> must be returned.)
ru: I<pathname> ссылается на специальный файл устройства, но соответствующего устройства не существует (это ошибка в ядре Linux: должно возвращаться B<ENXIO>).

source: B<O_CREAT> is not set and the named file does not exist.
ru: Не задан B<O_CREAT> и файл с указанным именем не существует.

source: A directory component in I<pathname> does not exist or is a dangling symbolic link.
ru: Один из каталогов в I<pathname> не существует или является повисшей символьной ссылкой.

source: I<pathname> refers to a nonexistent directory, B<O_TMPFILE> and one of B<O_WRONLY> or B<O_RDWR> were specified in I<flags>, but this kernel version does not provide the B<O_TMPFILE> functionality.
ru: Значение I<pathname> ссылается на несуществующий каталог, в I<flags> указан B<O_TMPFILE> и один из B<O_WRONLY> или B<O_RDWR>, но версия ядра не предоставляет свойство B<O_TMPFILE>.

source: The named file is a FIFO, but memory for the FIFO buffer can't be allocated because the per-user hard limit on memory allocation for pipes has been reached and the caller is not privileged; see B<pipe>(7).
ru: Типом файла с именем является FIFO, но память для буфера FIFO невозможно выделить, так как достигнуто жёсткое пользовательское ограничение на выделение памяти для каналов и вызывающий не имеет дополнительных прав; смотрите B<pipe>(7).

source: Insufficient kernel memory was available.
ru: Недостаточное количество памяти ядра.

source: I<pathname> was to be created but the device containing I<pathname> has no room for the new file.
ru: Файл I<pathname> должен быть создан, но на устройстве его содержащем нет места для нового файла.

source: A component used as a directory in I<pathname> is not, in fact, a directory, or B<O_DIRECTORY> was specified and I<pathname> was not a directory.
ru: Компонент, который обозначен как каталог в I<pathname>, таковым не является, или был указан флаг B<O_DIRECTORY>, но I<pathname> не является каталогом.

source: B<O_NONBLOCK> | B<O_WRONLY> is set, the named file is a FIFO, and no process has the FIFO open for reading.
ru: Установлены B<O_NONBLOCK> | B<O_WRONLY> , именованный файл имеет тип FIFO и ни один процесс не открыл FIFO на чтение.

source: The file is a device special file and no corresponding device exists.
ru: Файл является специальным файлом устройства, но соответствующее устройство не существует.

source: The file is a UNIX domain socket.
ru: Файл является доменным сокетом UNIX.

source: The filesystem containing I<pathname> does not support B<O_TMPFILE>.
ru: Файловая система, содержащая I<pathname>, не поддерживает B<O_TMPFILE>.

source: I<pathname> refers to a regular file that is too large to be opened. The usual scenario here is that an application compiled on a 32-bit platform without I<-D_FILE_OFFSET_BITS=64> tried to open a file whose size exceeds I<(1E<lt>E<lt>31)-1> bytes; see also B<O_LARGEFILE> above. This is the error specified by POSIX.1; in kernels before 2.6.24, Linux gave the error B<EFBIG> for this case.
ru: I<pathname> ссылается на обычный файл, который слишком велик для открытия. Обычно, это случается когда приложение, скомпилированное на 31-битной платформе без I<-D_FILE_OFFSET_BITS=64>, пытается открыть файл размером более I<(1E<lt>E<lt>31)-1> байт; смотрите также описание B<O_LARGEFILE> ранее. Эта ошибка определена в POSIX.1; в ядрах до версии 2.6.24 Linux в этом случае выдавал ошибку B<EFBIG>.

source: The B<O_NOATIME> flag was specified, but the effective user ID of the caller did not match the owner of the file and the caller was not privileged.
ru: Задан флаг B<O_NOATIME>, но эффективный ID пользователя вызывающего процесса не совпадает с владельцем файла и вызывающий не имеет прав.

source: The operation was prevented by a file seal; see B<fcntl>(2).
ru: Выполнение операции предотвращено опечатыванием (file seal); смотрите B<fcntl>(2).

source: I<pathname> refers to a file on a read-only filesystem and write access was requested.
ru: I<pathname> указывает на файл на файловой системе, доступной только на чтение, но запрашивается доступ на запись.

source: I<pathname> refers to an executable image which is currently being executed and write access was requested.
ru: I<pathname> указывает на исполняемый файл, который запущен в данный момент, но запрашивается доступ на запись.

source: I<pathname> refers to a file that is currently in use as a swap file, and the B<O_TRUNC> flag was specified.
ru: I<pathname> указывает на файл, который в данный момент используется как файл подкачки и был указан флаг B<O_TRUNC>.

source: I<pathname> refers to a file that is currently being read by the kernel (e.g. for module/firmware loading), and write access was requested.
ru: I<pathname> указывает на файл, который в данный момент читается ядром (например, для загрузки модуля/микропрограммы) и запрашивается доступ на запись.

source: The B<O_NONBLOCK> flag was specified, and an incompatible lease was held on the file (see B<fcntl>(2)).
ru: Указан флаг B<O_NONBLOCK>, но несовместимая аренда (lease) удерживает файл (смотрите B<fcntl>(2)).

source: The following additional errors can occur for B<openat>():
ru: В B<openat>() дополнительно могут возникнуть следующие ошибки:

source: I<dirfd> is not a valid file descriptor.
ru: I<dirfd> не является правильным файловым дескриптором.

source: I<pathname> is a relative pathname and I<dirfd> is a file descriptor referring to a file other than a directory.
ru: Значение I<pathname> содержит относительный путь и I<dirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог.

source: B<openat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Вызов B<openat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: The B<O_DIRECT>, B<O_NOATIME>, B<O_PATH>, and B<O_TMPFILE> flags are Linux-specific. One must define B<_GNU_SOURCE> to obtain their definitions.
ru: Флаги B<O_DIRECT>, B<O_NOATIME>, B<O_PATH> и B<O_TMPFILE> есть только в Linux. Для их определения может потребоваться задать B<_GNU_SOURCE>.

source: The B<O_CLOEXEC>, B<O_DIRECTORY>, and B<O_NOFOLLOW> flags are not specified in POSIX.1-2001, but are specified in POSIX.1-2008. Since glibc 2.12, one can obtain their definitions by defining either B<_POSIX_C_SOURCE> with a value greater than or equal to 200809L or B<_XOPEN_SOURCE> with a value greater than or equal to 700. In glibc 2.11 and earlier, one obtains the definitions by defining B<_GNU_SOURCE>.
ru: Флаги B<O_CLOEXEC>, B<O_DIRECTORY> и B<O_NOFOLLOW> не указаны в POSIX.1-2001, но есть в POSIX.1-2008. Начиная с glibc 2.12, их определения можно получить определив или B<_POSIX_C_SOURCE> со значением большим и равным 200809L, или B<_XOPEN_SOURCE> со значением большим и равным 700. В glibc 2.11 и старее их определения можно получить определив B<_GNU_SOURCE>.

source: As noted in B<feature_test_macros>(7), feature test macros such as B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, and B<_GNU_SOURCE> must be defined before including I<any> header files.
ru: Как было отмечено в B<feature_test_macros>(7), такие макросы тестирования свойств как B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE> и B<_GNU_SOURCE>, должны быть определены до включения I<любых> заголовочных файлов.

source: Under Linux, the B<O_NONBLOCK> flag is sometimes used in cases where one wants to open but does not necessarily have the intention to read or write. For example, this may be used to open a device in order to get a file descriptor for use with B<ioctl>(2).
ru: В Linux флаг B<O_NONBLOCK> иногда используется в случаях, когда файл только открыть, и не обязательно будет производиться чтение или запись. Например, он может использоваться для открытия устройства, чтобы получить его файловый дескриптор для использования в B<ioctl>(2).

source: The (undefined) effect of B<O_RDONLY | O_TRUNC> varies among implementations. On many systems the file is actually truncated.
ru: Результат работы комбинации флагов B<O_RDONLY | O_TRUNC> в разных реализациях разный (нигде не определён). Во многих системах файл усекается.

source: Note that B<open>() can open device special files, but B<creat>() cannot create them; use B<mknod>(2) instead.
ru: Заметим, что B<open>() может открывать специальные файлы устройств, но B<creat>() не может их создавать; вместо этого используйте B<mknod>(2).

source: If the file is newly created, its I<st_atime>, I<st_ctime>, I<st_mtime> fields (respectively, time of last access, time of last status change, and time of last modification; see B<stat>(2)) are set to the current time, and so are the I<st_ctime> and I<st_mtime> fields of the parent directory. Otherwise, if the file is modified because of the B<O_TRUNC> flag, its I<st_ctime> and I<st_mtime> fields are set to the current time.
ru: Если файл только что был создан, его поля I<st_atime>, I<st_ctime>, I<st_mtime> (время последнего доступа, последней смены состояния и последнего изменения, соответственно; см. B<stat>(2)) устанавливаются в значение текущего времени, и оно совпадает с полями I<st_ctime> и I<st_mtime> родительского каталога. Или же, если файл изменяется из-за установленного флага B<O_TRUNC>, то его поля I<st_ctime> и I<st_mtime> устанавливаются в значение текущего времени.

source: The files in the I</proc/[pid]/fd> directory show the open file descriptors of the process with the PID I<pid>. The files in the I</proc/[pid]/fdinfo> directory show even more information about these file descriptors. See B<proc>(5) for further details of both of these directories.
ru: Файлы в каталоге I</proc/[pid]/fd> представляют открытые файловые дескрипторы процесса с PID равным I<pid>. Файлы в каталоге I</proc/[pid]/fdinfo> представляют дополнительную информацию об этих файловых дескрипторах. Подробное описание данных каталогов можно найти в B<proc>(5).

source: The Linux header file B<E<lt>asm/fcntl.hE<gt>> doesn't define B<O_ASYNC>; the (BSD-derived) B<FASYNC> synonym is defined instead.
ru: В заголовочном файле Linux B<E<lt>asm/fcntl.hE<gt>> не определён B<O_ASYNC>; вместо него определён синоним B<FASYNC> (как в BSD).

source: Open file descriptions
ru: Открытые файловые описания

source: The term open file description is the one used by POSIX to refer to the entries in the system-wide table of open files. In other contexts, this object is variously also called an "open file object", a "file handle", an "open file table entry", or\(emin kernel-developer parlance\(ema I<struct file>.
ru: Термин «открытое файловое описание» (open file description) используется в POSIX для указания на записи в системной таблице открытых файлов. В других контекстах, этот объект также называется «открытый файловый объект» (open file object), «описатель файла» (file handle), «»табличная запись открытого файла (open file table entry) или I<struct file> (с точки зрения разработчика ядра).

source: When a file descriptor is duplicated (using B<dup>(2) or similar), the duplicate refers to the same open file description as the original file descriptor, and the two file descriptors consequently share the file offset and file status flags. Such sharing can also occur between processes: a child process created via B<fork>(2) inherits duplicates of its parent's file descriptors, and those duplicates refer to the same open file descriptions.
ru: При создании копии файлового дескриптора (с помощью B<dup>(2) или подобного вызова), копия ссылается на то же открытое файловое описание что и изначальный файловый дескриптор, и, следовательно, два файловых дескриптора имеют общее файловое смещение и флаги состояния файла. Такая общность может также быть у двух процессов: процесс-потомок, создаваемый B<fork>(2), наследует копии файловых дескрипторов своего родителя и эти копии ссылаются на те же открытые файловые описания.

source: Each B<open>() of a file creates a new open file description; thus, there may be multiple open file descriptions corresponding to a file inode.
ru: При каждом B<open>() файла создаётся новое файловое описание; таким образом, может быть несколько открытых файловых описаний, соответствующих inode файла.

source: On Linux, one can use the B<kcmp>(2) B<KCMP_FILE> operation to test whether two file descriptors (in the same process or in two different processes) refer to the same open file description.
ru: Для проверки того, что два файловых дескриптора (одного процесса или разных) ссылаются на одно файловое описание, в Linux можно использовать вызов B<kcmp>(2) с операцией B<KCMP_FILE>.

source: Synchronized I/O
ru: Синхронизированный ввод-вывод

source: The POSIX.1-2008 "synchronized I/O" option specifies different variants of synchronized I/O, and specifies the B<open>() flags B<O_SYNC>, B<O_DSYNC>, and B<O_RSYNC> for controlling the behavior. Regardless of whether an implementation supports this option, it must at least support the use of B<O_SYNC> for regular files.
ru: В POSIX.1-2008 способность «синхронизированного ввода-вывода» описана в виде различных вариантов синхронизированного ввода-вывода и для B<open>() определяет флаги управления поведением B<O_SYNC>, B<O_DSYNC> и B<O_RSYNC>. Независимо от того, имеется ли в реализации данная способность, она должна, как минимум, поддерживать использование флага B<O_SYNC> для обычных файлов.

source: Linux implements B<O_SYNC> and B<O_DSYNC>, but not B<O_RSYNC>. Somewhat incorrectly, glibc defines B<O_RSYNC> to have the same value as B<O_SYNC>. (B<O_RSYNC> is defined in the Linux header file I<E<lt>asm/fcntl.hE<gt>> on HP PA-RISC, but it is not used.)
ru: В Linux реализованы B<O_RSYNC> и B<O_DSYNC>, но не B<O_RSYNC>. Несколько некорректно в glibc определён B<O_RSYNC> со значением как у B<O_SYNC> (B<O_RSYNC> определён в заголовочном файле Linux I<E<lt>asm/fcntl.hE<gt>> для HP PA-RISC, но не используется).

source: B<O_SYNC> provides synchronized I/O I<file> integrity completion, meaning write operations will flush data and all associated metadata to the underlying hardware. B<O_DSYNC> provides synchronized I/O I<data> integrity completion, meaning write operations will flush data to the underlying hardware, but will only flush metadata updates that are required to allow a subsequent read operation to complete successfully. Data integrity completion can reduce the number of disk operations that are required for applications that don't need the guarantees of file integrity completion.
ru: Флаг B<O_SYNC> предоставляет выполнение целостного синхронизованного ввод-вывода I<file>, то есть операции записи передают данные и все связанные метаданные в задействованное аппаратное обеспечение. Флаг B<O_DSYNC> предоставляет выполнение целостного синхронизованного ввод-вывода I<data>, то есть операции записи передают данные в задействованное аппаратное обеспечение, но обновляются только те метаданные, которые требуются для выполнения последующего чтения. Полнота целостности данных может сократить количество дисковых операций, которые требуются приложениям, не требующим гарантий целостности файлов.

source: To understand the difference between the two types of completion, consider two pieces of file metadata: the file last modification timestamp (I<st_mtime>) and the file length. All write operations will update the last file modification timestamp, but only writes that add data to the end of the file will change the file length. The last modification timestamp is not needed to ensure that a read completes successfully, but the file length is. Thus, B<O_DSYNC> would only guarantee to flush updates to the file length metadata (whereas B<O_SYNC> would also always flush the last modification timestamp metadata).
ru: Чтобы понять разницу между двумя типами обеспечения целостности рассмотрим две части метаданных файла: метка времени последнего изменения файла (I<st_mtime>) и длину файла. Все операции записи обновляют метку времени последнего изменения файла, но только при записи, которая добавляет данные в конец файла, будет изменена длина файла. Метка времени последнего изменения файла не требуется для корректного чтения файла, чего не скажешь о длине. Таким образом, B<O_DSYNC> гарантирует только запись обновлений о метаданных длины файла (в то время как B<O_SYNC> также всегда записывает метаданные о метки времени последнего изменения файла).

source: Before Linux 2.6.33, Linux implemented only the B<O_SYNC> flag for B<open>(). However, when that flag was specified, most filesystems actually provided the equivalent of synchronized I/O I<data> integrity completion (i.e., B<O_SYNC> was actually implemented as the equivalent of B<O_DSYNC>).
ru: До Linux версии 2.6.33 в Linux реализован только флаг B<O_SYNC> для B<open>(). Однако, когда этот флаг указан, большинство файловых систем в действительности предоставляют эквивалент выполнения целостности синхронизированного ввода-вывода I<data> (т. е., на самом деле B<O_SYNC> был реализован как эквивалент B<O_DSYNC>).

source: Since Linux 2.6.33, proper B<O_SYNC> support is provided. However, to ensure backward binary compatibility, B<O_DSYNC> was defined with the same value as the historical B<O_SYNC>, and B<O_SYNC> was defined as a new (two-bit) flag value that includes the B<O_DSYNC> flag value. This ensures that applications compiled against new headers get at least B<O_DSYNC> semantics on pre-2.6.33 kernels.
ru: Начиная с Linux 2.6.33, предоставляет корректная поддержка B<O_SYNC>. Однако для обеспечения обратной двоичной совместимости, B<O_DSYNC> был определён с тем же значением что и старый B<O_SYNC>, а B<O_SYNC> был определён как новое значение флага (два бита), которое включает значение флага B<O_DSYNC>. Это позволяет приложениям, скомпилированным с новыми заголовочными файлами получать, по крайней мере, семантику B<O_DSYNC> ядер pre-2.6.33.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром
