Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_o/*.po
Languages: ru

source: The B<login_tty>() function prepares for a login on the terminal I<fd> (which may be a real terminal device, or the slave of a pseudoterminal as returned by B<openpty>()) by creating a new session, making I<fd> the controlling terminal for the calling process, setting I<fd> to be the standard input, output, and error streams of the current process, and closing I<fd>.
ru: Функция B<login_tty>() подготавливает терминал I<fd> (который может быть реальным устройством терминала или подчинённым псевдотерминала, возвращаемым B<openpty>()) таким образом, чтобы через него можно было войти в систему; для этого создаётся новый сеанс, I<fd> делается управляющим терминалом для вызывающего процесса (при этом I<fd> служит в качестве стандартных ввода, вывода и потока ошибок текущего процесса) и закрывает I<fd>.

source: The B<forkpty>() function combines B<openpty>(), B<fork>(2), and B<login_tty>() to create a new process operating in a pseudoterminal. The file descriptor of the master side of the pseudoterminal is returned in I<amaster>. If I<name> is not NULL, the buffer it points to is used to return the filename of the slave. The I<termp> and I<winp> arguments, if not NULL, will determine the terminal attributes and window size of the slave side of the pseudoterminal.
ru: Функция B<forkpty>() объединяет B<openpty>(), B<fork>(2) и B<login_tty>() для создания нового процесса, работающего в псевдотерминале. Файловый дескриптор основной стороны псевдотерминала возвращается в I<amaster>. Если I<name> не равно NULL, то указанный в нём буфер используется для возврата имени файла подчинённого устройства. Если аргументы I<termp> и I<winp> не равны NULL, то в них задаются атрибуты терминала и размеры окна подчинённой стороны псевдотерминала.

source: If a call to B<openpty>(), B<login_tty>(), or B<forkpty>() is not successful, -1 is returned and I<errno> is set to indicate the error. Otherwise, B<openpty>(), B<login_tty>(), and the child process of B<forkpty>() return 0, and the parent process of B<forkpty>() returns the process ID of the child process.
ru: Если вызов B<openpty>(), B<login_tty>() или B<forkpty>() завершается с ошибкой, то возвращается -1 и I<errno> указывает на тип ошибки. Иначе, B<openpty>(), B<login_tty>() и дочерний процесс B<forkpty>() возвращают 0, и родительский процесс B<forkpty>() возвращает ID дочернего процесса.

source: B<openpty>() fails if:
ru: Вызов B<openpty>() завершается ошибкой если:

source: There are no available terminals.
ru: Нет доступных терминалов.

source: B<login_tty>() fails if B<ioctl>(2) fails to set I<fd> to the controlling terminal of the calling process.
ru: Завершается ошибкой функция B<login_tty>(), если B<ioctl>(2) не может назначить I<fd> управляющему терминалу вызываемого процесса.

source: B<forkpty>() fails if either B<openpty>() or B<fork>(2) fails.
ru: Завершается ошибкой функция B<forkpty>(), если не сработает хотя бы одна из функций B<openpty>() или B<fork>(2).

source: These are BSD functions, present in glibc. They are not standardized in POSIX.
ru: Данные функции BSD есть в glibc. Они не стандартизированы в POSIX.

source: The B<const> modifiers were added to the structure pointer arguments of B<openpty>() and B<forkpty>() in glibc 2.8.
ru: Модификаторы B<const> были добавлены в аргументы указателей на структуры B<openpty>() и B<forkpty>() в glibc 2.8.

source: In versions of glibc before 2.0.92, B<openpty>() returns file descriptors for a BSD pseudoterminal pair; since glibc 2.0.92, it first attempts to open a UNIX 98 pseudoterminal pair, and falls back to opening a BSD pseudoterminal pair if that fails.
ru: В версиях glibc до 2.0.92, B<openpty>() возвращает файловые дескрипторы для псевдотерминальной пары BSD; начиная с glibc 2.0.92, сначала производится попытка открыть псевдотерминальную пару UNIX 98, а если это не удаётся, то происходит возвращение к открытию псевдотерминальной пары BSD.

source: Nobody knows how much space should be reserved for I<name>. So, calling B<openpty>() or B<forkpty>() with non-NULL I<name> may not be secure.
ru: Невозможно определить сколько места должно быть зарезервировано для I<name>. Поэтому, вызов B<openpty>() или B<forkpty>() со значением I<name> не равным NULL может быть небезопасен.

source: on_exit - register a function to be called at normal process termination
ru: on_exit - регистрирует функцию для вызова в случае нормального завершения процесса

source: B<on_exit>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<on_exit>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: The B<on_exit>() function registers the given I<function> to be called at normal process termination, whether via B<exit>(3) or via return from the program's I<main>(). The I<function> is passed the status argument given to the last call to B<exit>(3) and the I<arg> argument from B<on_exit>().
ru: Функция B<on_exit>() регистрирует указанную I<function> для вызова в случае нормального завершения процесса с помощью B<exit>(3) или при выходе из функции I<main>(). Функции I<function> передаётся аргумент состояния, указанный в последнем вызове B<exit>(3), а также аргумент I<arg> из B<on_exit>().

source: The same function may be registered multiple times: it is called once for each registration.
ru: Одна функция может быть зарегистрирована несколько раз: она вызывается один раз для каждой регистрации.

source: When a child process is created via B<fork>(2), it inherits copies of its parent's registrations. Upon a successful call to one of the B<exec>(3) functions, all registrations are removed.
ru: Когда дочерний процесс создаётся через B<fork>(2), он наследует копии регистраций родителя. При успешном выполнении одной из функций B<exec>(3) все регистрации снимаются.

source: The B<on_exit>() function returns the value 0 if successful; otherwise it returns a nonzero value.
ru: Функция B<on_exit>() при успешном выполнении возвращает 0, в противном случае — ненулевое значение.

source: This function comes from SunOS 4, but is also present in glibc. It no longer occurs in Solaris (SunOS 5). Portable application should avoid this function, and use the standard B<atexit>(3) instead.
ru: Эта функция впервые появилась в SunOS 4, но также она присутствует в glibc. В Solaris (SunOS 5) её уже нет. Избегайте этой функции и используйте вместо нее стандартную B<atexit>(3).

source: open_memstream, open_wmemstream - open a dynamic memory buffer stream
ru: open_memstream, open_wmemstream - открывает динамический буфер памяти как поток

source: The B<open_memstream>() function opens a stream for writing to a memory buffer. The function dynamically allocates the buffer, and the buffer automatically grows as needed. Initially, the buffer has a size of zero. After closing the stream, the caller should B<free>(3) this buffer.
ru: Функция B<open_memstream>() открывает поток для записи в буфер памяти. Буфер выделяется динамически и при необходимости автоматически увеличивается. Первоначально размер буфера равен нулю.После закрытия потока вызывающий должен освободить буфер с помощью B<free>(3).

source: The locations pointed to by I<ptr> and I<sizeloc> are used to report, respectively, the current location and the size of the buffer. The locations referred to by these pointers are updated each time the stream is flushed (B<fflush>(3)) and when the stream is closed (B<fclose>(3)). These values remain valid only as long as the caller performs no further output on the stream. If further output is performed, then the stream must again be flushed before trying to access these values.
ru: Аргументы I<ptr> и I<sizeloc> используются для определения текущего положения и размера буфера, соответственно. Положение обновляется при каждом сбросе потока (B<fflush>(3)) и его закрытии (B<fclose>(3)). Эти значения остаются корректными, пока вызывающий не произведёт вывод в поток. После выполнения вывода, перед тем как обращаться к этим переменным, поток снова должен быть сброшен.

source: A null byte is maintained at the end of the buffer. This byte is I<not> included in the size value stored at I<sizeloc>.
ru: Байт null поддерживается в конце буфера. Этот байт I<не> учитывается в значении размера, хранящемся в I<sizeloc>.

source: The stream maintains the notion of a current position, which is initially zero (the start of the buffer). Each write operation implicitly adjusts the buffer position. The stream's buffer position can be explicitly changed with B<fseek>(3) or B<fseeko>(3). Moving the buffer position past the end of the data already written fills the intervening space with null characters.
ru: Для потока существует понятие текущего положения, которое изначально равно нулю (начало буфера). Каждая операция записи неявно изменяет положение буфера. Положение буфера потока можно изменить явно с помощью B<fseek>(3) или B<fseeko>(3). Перемещение положения буфера за конец уже записанных данных приводит к заполнению промежутка символами null.

source: The B<open_wmemstream>() is similar to B<open_memstream>(), but operates on wide characters instead of bytes.
ru: Функция B<open_wmemstream>() похожа на B<open_memstream>(), но работает с широкими символами, а не с байтами.

source: Upon successful completion, B<open_memstream>() and B<open_wmemstream>() return a I<FILE> pointer. Otherwise, NULL is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<open_memstream>() и B<open_wmemstream>() возвращается указатель I<FILE>. В противном случае возвращается NULL и I<errno> присваивается код ошибки.

source: B<open_memstream>() was already available in glibc 1.0.x. B<open_wmemstream>() is available since glibc 2.4.
ru: Функция B<open_memstream>() была доступны уже в glibc 1.0.x. Функция B<open_wmemstream>() доступна в glibc начиная с версии 2.4.

source: POSIX.1-2008. These functions are not specified in POSIX.1-2001, and are not widely available on other systems.
ru: POSIX.1-2008. Эти функции не определены в POSIX.1-2001 и не широко распространены в других системах.

source: There is no file descriptor associated with the file stream returned by these functions (i.e., B<fileno>(3) will return an error if called on the returned stream).
ru: У файлового потока, возвращаемого этими функциями, отсутствует файловый дескриптор (т. е., если файловый поток передать в B<fileno>(3), то произойдёт ошибка).

source: In glibc before version 2.7, seeking past the end of a stream created by B<open_memstream>() does not enlarge the buffer; instead the B<fseek>(3) call fails, returning -1.
ru: В glibc до версии 2.7 перемещение за конец потока, созданного B<open_memstream>(), не приводило к увеличению буфера; вместо этого вызов B<fseek>(3) завершался с ошибкой, возвращая -1.

source: See B<fmemopen>(3).
ru: Смотрите B<fmemopen>(3).
