Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_o/*.po
Languages: ru

source: For example, one can use the device name in the fifth field of the I<mountinfo> record to search for the corresponding device UUID via the symbolic links in I</dev/disks/by-uuid>. (A more comfortable way of obtaining the UUID is to use the B<libblkid>(3) library.) That process can then be reversed, using the UUID to look up the device name, and then obtaining the corresponding mount point, in order to produce the I<mount_fd> argument used by B<open_by_handle_at>().
ru: Например, можно использовать имя устройства в пятом поле записи I<mountinfo> для поиска соответствующего устройству UUID через символические ссылки в I</dev/disks/by-uuid> (более удобный способ получения UUID — использовать библиотеку B<libblkid>(3)). Этот процесс может быть и обратным — используя UUID найти имя устройства, и затем получить соответствующую точку монтирования, чтобы создать аргумент I<mount_fd>, используемый для B<open_by_handle_at>().

source: EXAMPLE
ru: ПРИМЕР

source: The two programs below demonstrate the use of B<name_to_handle_at>() and B<open_by_handle_at>(). The first program (I<t_name_to_handle_at.c>) uses B<name_to_handle_at>() to obtain the file handle and mount ID for the file specified in its command-line argument; the handle and mount ID are written to standard output.
ru: Две представленные далее программы демонстрируют использование B<name_to_handle_at>() и B<open_by_handle_at>(). Первая программа (I<t_name_to_handle_at.c>) использует B<name_to_handle_at>() для получения файлового описателя и идентификатора монтирования для файла, указанного в аргументе командной строки; описатель и идентификатор монтирования записываются в стандартный вывод.

source: The second program (I<t_open_by_handle_at.c>) reads a mount ID and file handle from standard input. The program then employs B<open_by_handle_at>() to open the file using that handle. If an optional command-line argument is supplied, then the I<mount_fd> argument for B<open_by_handle_at>() is obtained by opening the directory named in that argument. Otherwise, I<mount_fd> is obtained by scanning I</proc/self/mountinfo> to find a record whose mount ID matches the mount ID read from standard input, and the mount directory specified in that record is opened. (These programs do not deal with the fact that mount IDs are not persistent.)
ru: Вторая программа (I<t_open_by_handle_at.c>) читает идентификатор монтирования и файловый описатель из стандартного ввода. Затем программа, используя описатель, применяет B<open_by_handle_at>() для открытия файла. Если указан необязательный параметр командной строки, то аргумент I<mount_fd> для B<open_by_handle_at>() создаётся из открытия каталога, указанного в аргументе. В противном случае I<mount_fd> заполняется результатом сканированием I</proc/self/mountinfo> в целях найти запись, чей идентификатор монтирования совпадает с идентификатором монтирования из стандартного ввода, и открывается каталог монтирования, указанный в этой записи (эти программы не учитывают, что идентификатор монтирования не постоянен).

source: The following shell session demonstrates the use of these two programs:
ru: Следующий сеанс работы в оболочке показывает использование этих программ:

source: $ B<echo 'Can you please think about it?' E<gt> cecilia.txt> $ B<./t_name_to_handle_at cecilia.txt E<gt> fh> $ B<./t_open_by_handle_at E<lt> fh> open_by_handle_at: Operation not permitted $ B<sudo ./t_open_by_handle_at E<lt> fh> # Need CAP_SYS_ADMIN Read 31 bytes $ B<rm cecilia.txt>
ru: $ B<echo 'Can you please think about it?' E<gt> cecilia.txt> $ B<./t_name_to_handle_at cecilia.txt E<gt> fh> $ B<./t_open_by_handle_at E<lt> fh> open_by_handle_at: Operation not permitted $ B<sudo ./t_open_by_handle_at E<lt> fh> # требуется CAP_SYS_ADMIN Read 31 bytes $ B<rm cecilia.txt>

source: Now we delete and (quickly) re-create the file so that it has the same content and (by chance) the same inode. Nevertheless, B<open_by_handle_at>() recognizes that the original file referred to by the file handle no longer exists.
ru: Теперь мы удаляем и (быстро) пересоздаём файл с тем же содержимым и (если повезёт) с той же инодой. Не смотря на это, B<open_by_handle_at>() распознаёт, что первоначальный файл, на который указывал файловый описатель, больше не существует.

source: $ B<stat --printf="%i\en" cecilia.txt> # Display inode number 4072121 $ B<rm cecilia.txt> $ B<echo 'Can you please think about it?' E<gt> cecilia.txt> $ B<stat --printf="%i\en" cecilia.txt> # Check inode number 4072121 $ B<sudo ./t_open_by_handle_at E<lt> fh> open_by_handle_at: Stale NFS file handle
ru: $ B<stat --printf="%i\en" cecilia.txt> # вывести номер иноды 4072121 $ B<rm cecilia.txt> $ B<echo 'Can you please think about it?' E<gt> cecilia.txt> $ B<stat --printf="%i\en" cecilia.txt> # проверить номер иноды 4072121 $ B<sudo ./t_open_by_handle_at E<lt> fh> open_by_handle_at: Stale NFS file handle

source: Program source: t_name_to_handle_at.c
ru: Исходный код программы: t_name_to_handle_at.c

source: if (argc != 2) { fprintf(stderr, "Usage: %s pathname\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s путь\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Allocate file_handle structure */
ru: /* выделяем место под структуру file_handle */

source: /* Make an initial call to name_to_handle_at() to discover the size required for file handle */
ru: /* выполняем первоначальный вызов name_to_handle_at() для определения требуемого размера файлового описателя */

source: dirfd = AT_FDCWD; /* For name_to_handle_at() calls */ flags = 0; /* For name_to_handle_at() calls */ fhp-E<gt>handle_bytes = 0; if (name_to_handle_at(dirfd, pathname, fhp, &mount_id, flags) != -1 || errno != EOVERFLOW) { fprintf(stderr, "Unexpected result from name_to_handle_at()\en"); exit(EXIT_FAILURE); }
ru: dirfd = AT_FDCWD; /* для вызовов name_to_handle_at() */ flags = 0; /* для вызовов name_to_handle_at() */ fhp-E<gt>handle_bytes = 0; if (name_to_handle_at(dirfd, pathname, fhp, &mount_id, flags) != -1 || errno != EOVERFLOW) { fprintf(stderr, "Unexpected result from name_to_handle_at()\en"); exit(EXIT_FAILURE); }

source: /* Reallocate file_handle structure with correct size */
ru: /* перераспределяем структуру file_handle с правильным размером */

source: fhsize = sizeof(struct file_handle) + fhp-E<gt>handle_bytes; fhp = realloc(fhp, fhsize); /* Copies fhp-E<gt>handle_bytes */ if (fhp == NULL) errExit("realloc");
ru: fhsize = sizeof(struct file_handle) + fhp-E<gt>handle_bytes; fhp = realloc(fhp, fhsize); /* копируем fhp-E<gt>handle_bytes */ if (fhp == NULL) errExit("realloc");

source: /* Get file handle from pathname supplied on command line */
ru: /* получаем файловый описатель из пути, который указан в командной строке */

source: /* Write mount ID, file handle size, and file handle to stdout, for later reuse by t_open_by_handle_at.c */
ru: /* пишем идентификатор монтирования, размер файлового описателя и файловый описатель в stdout для повторного использования в t_open_by_handle_at.c */

source: Program source: t_open_by_handle_at.c
ru: Исходный код программы: t_open_by_handle_at.c

source: /* Scan /proc/self/mountinfo to find the line whose mount ID matches \(aqmount_id\(aq. (An easier way to do this is to install and use the \(aqlibmount\(aq library provided by the \(aqutil-linux\(aq project.) Open the corresponding mount path and return the resulting file descriptor. */
ru: /* сканируем /proc/self/mountinfo в поиске строки, чей идентификатор монтирования совпадает с \(aqmount_id\(aq (простейший способ, это установить и использовать библиотеку «libmount», предоставляемую проектом «util-linux»). Открываем соответствующий путь монтирования и возвращаем полученный файловый дескриптор. */

source: if ((argc E<gt> 1 && strcmp(argv[1], "--help") == 0) || argc E<gt> 2) { fprintf(stderr, "Usage: %s [mount-path]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if ((argc E<gt> 1 && strcmp(argv[1], "--help") == 0) || argc E<gt> 2) { fprintf(stderr, "Использование: %s [путь-монт.]\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Standard input contains mount ID and file handle information:
ru: /* Стандартный ввод содержит идентификатор монтирования и информацию о файловом описателе:

source: Line 1: E<lt>mount_idE<gt> Line 2: E<lt>handle_bytesE<gt> E<lt>handle_typeE<gt> E<lt>bytes of handle in hexE<gt> */
ru: Строка 1: E<lt>идентификатор монтированияE<gt> Строка 2: E<lt>handle_bytesE<gt> E<lt>handle_typeE<gt> E<lt>байты описателя в шестнад. системе счисленияE<gt> */

source: /* Given handle_bytes, we can now allocate file_handle structure */
ru: /* получаем handle_bytes, теперь мы можем выделить место под структуру file_handle */

source: /* Obtain file descriptor for mount point, either by opening the pathname specified on the command line, or by scanning /proc/self/mounts to find a mount that matches the \(aqmount_id\(aq that we received from stdin. */
ru: /* получаем файловый дескриптор для точки монтирования, или открываем путь, указанный в командной строке, или сканируем /proc/self/mounts в поиске монтирования, которое совпадает с «mount_id», который мы получили из stdin. */

source: /* Open file using handle and mount point */
ru: /* открываем файл, используя описатель и точку монтирования */

source: /* Try reading a few bytes from the file */
ru: /* пытаемся прочитать несколько байт из файла */

source: The I<libblkid> and I<libmount> documentation in the latest I<util-linux> release at E<.UR https://www.kernel.org/pub/linux/utils/util-linux/> E<.UE>
ru: Документация I<libblkid> и I<libmount> в последнем выпуске I<util-linux> E<.UR https://www.kernel.org/pub/linux/utils/util-linux/> E<.UE>

source: open, openat, creat - open and possibly create a file
ru: open, openat, creat - открывает и, возможно, создаёт файл

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: The B<open>() system call opens the file specified by I<pathname>. If the specified file does not exist, it may optionally (if B<O_CREAT> is specified in I<flags>) be created by B<open>().
ru: Системный вызов B<open>() открывает файл, на который указывает I<pathname>. Если заданный файл не существует, то он может быть создан B<open>() (если в I<flags> задан B<O_CREAT>).

source: The return value of B<open>() is a file descriptor, a small, nonnegative integer that is used in subsequent system calls (B<read>(2), B<write>(2), B<lseek>(2), B<fcntl>(2), etc.) to refer to the open file. The file descriptor returned by a successful call will be the lowest-numbered file descriptor not currently open for the process.
ru: Возвращаемым значением B<open>() является файловый дескриптор, указывающий на открытый файл — небольшое неотрицательное целое, которое используется в последующих системных вызовах (B<read>(2), B<write>(2), B<lseek>(2), B<fcntl>(2) и т. д.). Файловый дескриптор, возвращаемый при успешном выполнении вызова, будет самым маленьким числом из файловых дескрипторов, которые ещё не открыты процессом.

source: By default, the new file descriptor is set to remain open across an B<execve>(2) (i.e., the B<FD_CLOEXEC> file descriptor flag described in B<fcntl>(2) is initially disabled); the B<O_CLOEXEC> flag, described below, can be used to change this default. The file offset is set to the beginning of the file (see B<lseek>(2)).
ru: По умолчанию, новый файловый дескриптор остаётся открытым при вызове B<execve>(2) (т. е., флаг B<FD_CLOEXEC> файлового дескриптора, описанный в B<fcntl>(2), изначально сброшен; для изменения поведения по умолчанию можно использовать флаг B<O_CLOEXEC>, он описан далее). Файловое смещение устанавливается на начало файла (см. B<lseek>(2)).

source: A call to B<open>() creates a new I<open file description>, an entry in the system-wide table of open files. The open file description records the file offset and the file status flags (see below). A file descriptor is a reference to an open file description; this reference is unaffected if I<pathname> is subsequently removed or modified to refer to a different file. For further details on open file descriptions, see NOTES.
ru: Вызов B<open>() создаёт новое I<открытое файловое описание> — запись в системной таблице открытых файлов. В этой записи хранится смещение и флаги состояния файла (смотрите ниже). Файловый дескриптор — это ссылка на открытое файловое описание; с этой ссылкой ничего не происходит при последующем удалении I<pathname> или переуказании имени на другой файл. Дополнительную информацию об открытых файловых описаниях смотрите в разделе ЗАМЕЧАНИЯ.

source: The argument I<flags> must include one of the following I<access modes>: B<O_RDONLY>, B<O_WRONLY>, or B<O_RDWR>. These request opening the file read-only, write-only, or read/write, respectively.
ru: Параметр I<flags> должен содержать один из следующих I<режимов доступа>: B<O_RDONLY> (только для чтения), B<O_WRONLY> (только для записи) или B<O_RDWR> (для чтения и записи).

source: In addition, zero or more file creation flags and file status flags can be bitwise-I<or>'d in I<flags>. The I<file creation flags> are B<O_CLOEXEC>, B<O_CREAT>, B<O_DIRECTORY>, B<O_EXCL>, B<O_NOCTTY>, B<O_NOFOLLOW>, B<O_TMPFILE>, and B<O_TRUNC>. The I<file status flags> are all of the remaining flags listed below. The distinction between these two groups of flags is that the file creation flags affect the semantics of the open operation itself, while the file status flags affect the semantics of subsequent I/O operations. The file status flags can be retrieved and (in some cases) modified; see B<fcntl>(2) for details.
ru: Также в I<flags> можно указывать флаги создания и состояния файла, объединяя их битовой операцией I<ИЛИ>. I<Флаги создания файла>: B<O_CLOEXEC>, B<O_CREAT>, B<O_DIRECTORY>, B<O_EXCL>, B<O_NOCTTY>, B<O_NOFOLLOW>, B<O_TMPFILE> и B<O_TRUNC>. I<Флаги состояния файла> — все оставшиеся, перечислены ниже. Различие между двумя этими группами в том, что флаги создания влияют на работу самой операции открытия, а флаги состояния влияют на работу последующих операций ввода-вывода. Флаги состояния можно запросить и (в некоторых случаях) изменить; смотрите B<fcntl>(2).

source: The full list of file creation flags and file status flags is as follows:
ru: Полный список флагов создания и флагов состояния файла:

source: The file is opened in append mode. Before each B<write>(2), the file offset is positioned at the end of the file, as if with B<lseek>(2). The modification of the file offset and the write operation are performed as a single atomic step.
ru: Файл открывается в режиме добавления. Перед каждым вызовом B<write>(2), файловое смещение устанавливается в конец файла, как если бы это делалось с помощью B<lseek>(2). Изменение файлового смещения и операция записи выполняются атомарно, за один шаг.

source: B<O_APPEND> may lead to corrupted files on NFS filesystems if more than one process appends data to a file at once. This is because NFS does not support appending to a file, so the client kernel has to simulate it, which can't be done without a race condition.
ru: Указание флага B<O_APPEND> может приводить к повреждению файлов в файловых системах NFS, если одновременно добавляют данные в файл несколько процессов. Это происходит из-за того, что NFS не поддерживает добавление в файл, поэтому клиентское ядро имитирует такое поведение, но при этом нельзя избежать состязательности процессов.

source: Enable signal-driven I/O: generate a signal (B<SIGIO> by default, but this can be changed via B<fcntl>(2)) when input or output becomes possible on this file descriptor. This feature is available only for terminals, pseudoterminals, sockets, and (since Linux 2.6) pipes and FIFOs. See B<fcntl>(2) for further details. See also BUGS, below.
ru: Включает ввод-вывод, управляемый сигналом: генерирует сигнал (по умолчанию B<SIGIO>, но можно изменить с помощью B<fcntl>(2)), когда становится возможным ввод или вывод для этого файлового дескриптора. Эта возможность доступна только для терминалов, псевдотерминалов, сокетов, каналов (начиная с Linux 2.6) и FIFO. Подробней смотрите B<fcntl>(2). Также смотрите ДЕФЕКТЫ далее.

source: B<O_CLOEXEC> (since Linux 2.6.23)
ru: B<O_CLOEXEC> (начиная с Linux 2.6.23)

source: Enable the close-on-exec flag for the new file descriptor. Specifying this flag permits a program to avoid additional B<fcntl>(2) B<F_SETFD> operations to set the B<FD_CLOEXEC> flag.
ru: Устанавливает флаг close-on-exec на новом файловом дескрипторе. Указание данного флага позволяет программе избежать дополнительной операции B<fcntl>(2) B<F_SETFD> для установки флага B<FD_CLOEXEC>.

source: Note that the use of this flag is essential in some multithreaded programs, because using a separate B<fcntl>(2) B<F_SETFD> operation to set the B<FD_CLOEXEC> flag does not suffice to avoid race conditions where one thread opens a file descriptor and attempts to set its close-on-exec flag using B<fcntl>(2) at the same time as another thread does a B<fork>(2) plus B<execve>(2). Depending on the order of execution, the race may lead to the file descriptor returned by B<open>() being unintentionally leaked to the program executed by the child process created by B<fork>(2). (This kind of race is in principle possible for any system call that creates a file descriptor whose close-on-exec flag should be set, and various other Linux system calls provide an equivalent of the B<O_CLOEXEC> flag to deal with this problem.)
ru: Заметим, что использование этого флага обязательно для некоторых многонитиевых программ, так как использование отдельной операции B<fcntl>(2) B<F_SETFD> для установки флага B<FD_CLOEXEC> недостаточно для избежания состязательности, когда одна нить открывает файловый дескриптор, а в тоже время другая нить может выполнять B<fork>(2) и B<execve>(2). В зависимости от порядка выполнения, состязательность может привести к тому, что файловый дескриптор, возвращённый B<open>(), будет ненамеренно передан программе, выполняющейся в созданном с помощью B<fork>(2) потомке (такого рода состязательность, в принципе, возможна для любых системных вызовов, создающих файловый дескриптор, у которого должен быть установлен флаг close-on-exec, и различные другие системные вызовы Linux предоставляют эквивалент флагу B<O_CLOEXEC>, чтобы избежать этой проблемы).

source: If I<pathname> does not exist, create it as a regular file.
ru: Если I<pathname> не существует, то создать обычный файл.

source: The owner (user ID) of the new file is set to the effective user ID of the process.
ru: Владельцем (ID пользователя) нового файла назначается эффективный идентификатор пользователя процесса.

source: The group ownership (group ID) of the new file is set either to the effective group ID of the process (System V semantics) or to the group ID of the parent directory (BSD semantics). On Linux, the behavior depends on whether the set-group-ID mode bit is set on the parent directory: if that bit is set, then BSD semantics apply; otherwise, System V semantics apply. For some filesystems, the behavior also depends on the I<bsdgroups> and I<sysvgroups> mount options described in B<mount>(8)).
ru: Группой владельцев (ID группы) нового файла назначается эффективный идентификатор группы процесса (согласно System V) или ID группы родительского каталога (согласно BSD). В Linux это зависит от наличия бита режима set-group-ID на родительском каталоге: если этот бит установлен, то используется правило BSD; в противном случае применяется правило System V. В некоторых файловых системах поведение также зависит от параметров монтирования I<bsdgroups> и I<sysvgroups>, описанных в B<mount>(8)).

source: The I<mode> argument specifies the file mode bits be applied when a new file is created. This argument must be supplied when B<O_CREAT> or B<O_TMPFILE> is specified in I<flags>; if neither B<O_CREAT> nor B<O_TMPFILE> is specified, then I<mode> is ignored. The effective mode is modified by the process's I<umask> in the usual way: in the absence of a default ACL, the mode of the created file is I<(mode\ &\ ~umask)>. Note that this mode applies only to future accesses of the newly created file; the B<open>() call that creates a read-only file may well return a read/write file descriptor.
ru: В аргументе I<mode> указываются биты файлового режима, которые используются при создании нового файла. Этот параметр должен указываться, если в I<flags> устанавливается B<O_CREAT> или B<O_TMPFILE>; если B<O_CREAT> или B<O_TMPFILE> не указаны, то I<mode> игнорируется. Эффективный режим изменяется согласно I<umask> процесса как обычно: в случае отсутствия списков доступа по умолчанию режим созданного файла будет установлен согласно I<(mode\ &\ ~umask)>. Заметим, что этот режим будет учтён только при последующих обращениях к созданному файлу; вызов B<open>(), создающий файл только для чтения, может вернуть файловый дескриптор доступный на чтение и запись.

source: The following symbolic constants are provided for I<mode>:
ru: Символьные константы, используемые в I<mode>:

source: 00700 user (file owner) has read, write, and execute permission
ru: 00700 пользователь (владелец файла) имеет права на чтение, запись и выполнение файла

source: 00400 user has read permission
ru: 00400 пользователь имеет права на чтение файла

source: 00200 user has write permission
ru: 00200 пользователь имеет права на запись в файл

source: 00100 user has execute permission
ru: 00100 пользователь имеет права на выполнение файла

source: 00070 group has read, write, and execute permission
ru: 00070 группа имеет права на чтение, запись и выполнение файла

source: 00040 group has read permission
ru: 00040 группа имеет права на чтение файла

source: 00020 group has write permission
ru: 00020 группа имеет права на запись в файл

source: 00010 group has execute permission
ru: 00010 группа имеет права на выполнение файла

source: 00007 others have read, write, and execute permission
ru: 00007 все остальные имеют права на чтение, запись и выполнение файла

source: 00004 others have read permission
ru: 00004 все остальные имеют права на чтение файла

source: 00002 others have write permission
ru: 00002 все остальные имеют права на запись в файл

source: 00001 others have execute permission
ru: 00001 все остальные имеют права на выполнение файла

source: According to POSIX, the effect when other bits are set in I<mode> is unspecified. On Linux, the following bits are also honored in I<mode>:
ru: Согласно POSIX, в случае, если в I<mode> указаны другие биты, их воздействие не определено. В Linux для I<mode> также доступны следующие биты:

source: 0004000 set-user-ID bit
ru: 0004000 бит set-user-ID

source: 0002000 set-group-ID bit (see B<inode>(7)).
ru: 0002000 бит set-group-ID (смотрите B<inode>(7)).

source: 0001000 sticky bit (see B<inode>(7)).
ru: 0001000 закрепляющий бит bit (смотрите B<inode>(7)).

source: B<O_DIRECT> (since Linux 2.4.10)
ru: B<O_DIRECT> (начиная с Linux 2.4.10)
