Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_o/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: operator - C operator precedence and order of evaluation
ru: operator - приоритет и порядок вычисления операторов в Си

source: DESCRIPTION
ru: ОПИСАНИЕ

source: This manual page lists C operators and their precedence in evaluation.
ru: В данной справочной странице показан приоритет и порядок вычисления операторов в языке Си.

source: Operator
ru: Оператор

source: Associativity
ru: Ассоциативность

source: left to right
ru: слева направо

source: right to left
ru: справа налево

source: outb, outw, outl, outsb, outsw, outsl, inb, inw, inl, insb, insw, insl, outb_p, outw_p, outl_p, inb_p, inw_p, inl_p - port I/O
ru: outb, outw, outl, outsb, outsw, outsl, inb, inw, inl, insb, insw, insl, outb_p, outw_p, outl_p, inb_p, inw_p, inl_p - ввод/вывод в порт

source: SYNOPSIS
ru: ОБЗОР

source: This family of functions is used to do low-level port input and output. The out* functions do port output, the in* functions do port input; the b-suffix functions are byte-width and the w-suffix functions word-width; the _p-suffix functions pause until the I/O completes.
ru: Это семейство вызовов используется для низкоуровневой работы с портами ввода/вывода. Вызовы out* выполняют запись в порт, а вызовы in* выполняют чтение из порта; вызовы с суффиксом b работают с данными шириной один байт, а вызовы с суффиксом w работают с данными шириной в одно слово; вызовы с суффиксом _p ждут завершения операции ввода-вывода.

source: They are primarily designed for internal kernel use, but can be used from user space.
ru: В основном, они предназначены для использования внутри ядра, но могут быть вызваны и из пользовательского пространства.

source: You must compile with B<-O> or B<-O2> or similar. The functions are defined as inline macros, and will not be substituted in without optimization enabled, causing unresolved references at link time.
ru: Вы должны скомпилировать свою программу с флагами B<-O>, B<-O2> и им подобными. Данные вызовы определены в виде встроенных макросов и не будут подставляться без включённой оптимизации, что приводит к появлению неразрешаемых ссылок в процессе компоновки программы.

source: You use B<ioperm>(2) or alternatively B<iopl>(2) to tell the kernel to allow the user space application to access the I/O ports in question. Failure to do this will cause the application to receive a segmentation fault.
ru: Для того, чтобы запросить у ядра разрешение доступа к портам ввода-вывода из приложения, работающего в пользовательском пространстве, используйте B<ioperm>(2) или B<iopl>(2). Если этого не сделать, приложение получит сообщение об ошибке сегментации.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: B<outb>() and friends are hardware-specific. The I<value> argument is passed first and the I<port> argument is passed second, which is the opposite order from most DOS implementations.
ru: Вызовы B<outb>() и ему подобные зависят от конкретного оборудования. Аргумент I<value> передаётся первым, а I<port> \(em вторым, что является обратным порядком по сравнению с большинством реализаций этих вызовов в DOS.

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: name_to_handle_at, open_by_handle_at - obtain handle for a pathname and open file via a handle
ru: name_to_handle_at, open_by_handle_at - получение описателя для пути и открытие файла через описатель

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sys/types.hE<gt>> B<#include E<lt>sys/stat.hE<gt>> B<#include E<lt>fcntl.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>sys/types.hE<gt>> B<#include E<lt>sys/stat.hE<gt>> B<#include E<lt>fcntl.hE<gt>>

source: The B<name_to_handle_at>() and B<open_by_handle_at>() system calls split the functionality of B<openat>(2) into two parts: B<name_to_handle_at>() returns an opaque handle that corresponds to a specified file; B<open_by_handle_at>() opens the file corresponding to a handle returned by a previous call to B<name_to_handle_at>() and returns an open file descriptor.
ru: Функциональное назначение B<openat>(2) было разделено на две части и добавлено в системные вызовы B<name_to_handle_at>() и B<open_by_handle_at>(): B<name_to_handle_at>() возвращает описатель с произвольной формой(opaque), который соответствует указанному файлу; B<open_by_handle_at>() открывает файл по описателю, который был возвращён предыдущим вызовом B<name_to_handle_at>() и возвращает дескриптор открытого файла.

source: The B<name_to_handle_at>() system call returns a file handle and a mount ID corresponding to the file specified by the I<dirfd> and I<pathname> arguments. The file handle is returned via the argument I<handle>, which is a pointer to a structure of the following form:
ru: Системный вызов B<name_to_handle_at>() возвращает файловый описатель и идентификатор монтирования для файла, указанного в аргументах I<dirfd> и I<pathname>. Файловый описатель возвращается через аргумент I<handle>, который является указателем на следующую структуру:

source: struct file_handle { unsigned int handle_bytes; /* Size of f_handle [in, out] */ int handle_type; /* Handle type [out] */ unsigned char f_handle[0]; /* File identifier (sized by caller) [out] */ };
ru: struct file_handle { unsigned int handle_bytes; /* размер f_handle [in, out] */ int handle_type; /* тип описателя [out] */ unsigned char f_handle[0]; /* идентификатор файла (размер задаёт вызывающий) [out] */ };

source: It is the caller's responsibility to allocate the structure with a size large enough to hold the handle returned in I<f_handle>. Before the call, the I<handle_bytes> field should be initialized to contain the allocated size for I<f_handle>. (The constant B<MAX_HANDLE_SZ>, defined in I<E<lt>fcntl.hE<gt>>, specifies the maximum expected size for a file handle. It is not a guaranteed upper limit as future filesystems may require more space.) Upon successful return, the I<handle_bytes> field is updated to contain the number of bytes actually written to I<f_handle>.
ru: Вызывающий должен выделить память достаточного размера под структуру описателя, возвращаемого в I<f_handle>. Перед вызовом поле I<handle_bytes> должно содержать размер выделенной памяти для I<f_handle> (константа B<MAX_HANDLE_SZ>, определённая в I<E<lt>fcntl.hE<gt>>, равна максимально ожидаемому размеру описателя файла. Это не гарантированное верхнее ограничение, так как файловые системы в будущем могут потребовать больше места). При успешном выполнении поле I<handle_bytes> обновляется и содержит количество байт действительно занятых под I<f_handle>.

source: The caller can discover the required size for the I<file_handle> structure by making a call in which I<handle-E<gt>handle_bytes> is zero; in this case, the call fails with the error B<EOVERFLOW> and I<handle-E<gt>handle_bytes> is set to indicate the required size; the caller can then use this information to allocate a structure of the correct size (see EXAMPLE below). Some care is needed here as B<EOVERFLOW> can also indicate that no file handle is available for this particular name in a filesystem which does normally support file-handle lookup. This case can be detected when the B<EOVERFLOW> error is returned without I<handle_bytes> being increased.
ru: Вызывающий может определить требуемый размер структуры I<file_handle> указав при вызове значение I<handle-E<gt>handle_bytes> равное нулю; в этому случае вызов завершается с ошибкой B<EOVERFLOW>, а в поле I<handle-E<gt>handle_bytes> записывается требуемый размер; затем вызывающий может использовать эту информацию для выделения памяти под структуру правильного размера (смотрите ПРИМЕР ниже). Здесь нужно учесть, что B<EOVERFLOW> может указывать на то, что файловый описатель недоступен для этого заданного имени в файловой системе, которая, обычно, поддерживает поиск файловых описателей. На данный случай указывает то, что ошибка B<EOVERFLOW> возвращается без увеличившегося значения I<handle_bytes>.

source: Other than the use of the I<handle_bytes> field, the caller should treat the I<file_handle> structure as an opaque data type: the I<handle_type> and I<f_handle> fields are needed only by a subsequent call to B<open_by_handle_at>().
ru: Все остальные поля, кроме I<handle_bytes> структуры I<file_handle>, вызывающий должен считать неизвестными: поля I<handle_type> и I<f_handle> требуются только в последующих вызовах B<open_by_handle_at>().

source: The I<flags> argument is a bit mask constructed by ORing together zero or more of B<AT_EMPTY_PATH> and B<AT_SYMLINK_FOLLOW>, described below.
ru: Аргумент I<flags> представляет собой битовую маску (OR) из комбинации нуля или более флагов B<AT_EMPTY_PATH> и B<AT_SYMLINK_FOLLOW>, описанных ниже.

source: Together, the I<pathname> and I<dirfd> arguments identify the file for which a handle is to be obtained. There are four distinct cases:
ru: Аргументы I<pathname> и I<dirfd> вместе задают файл, для которого будет получен описатель. Есть четыре различных варианта:

source: If I<pathname> is a nonempty string containing an absolute pathname, then a handle is returned for the file referred to by that pathname. In this case, I<dirfd> is ignored.
ru: Если значение I<pathname> — непустая строка, содержащая абсолютный путь, то описатель возвращается для файла, на который указывает путь. В этом случае I<dirfd> игнорируется.

source: If I<pathname> is a nonempty string containing a relative pathname and I<dirfd> has the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the caller, and a handle is returned for the file to which it refers.
ru: Если значение I<pathname> — непустая строка, содержащая относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего и описатель возвращается для файла, на который он указывает.

source: If I<pathname> is a nonempty string containing a relative pathname and I<dirfd> is a file descriptor referring to a directory, then I<pathname> is interpreted relative to the directory referred to by I<dirfd>, and a handle is returned for the file to which it refers. (See B<openat>(2) for an explanation of why "directory file descriptors" are useful.)
ru: Если значение I<pathname> — непустая строка, содержащая относительный путь и I<dirfd> равно файловому дескриптору, указывающему на каталог, то I<pathname> рассматривается относительно каталога, на который указывает I<dirfd>, и описатель возвращается для файла, на который он указывает (смотрите в B<openat>(2) объяснение полезности «файловых дескрипторов каталогов»).

source: If I<pathname> is an empty string and I<flags> specifies the value B<AT_EMPTY_PATH>, then I<dirfd> can be an open file descriptor referring to any type of file, or B<AT_FDCWD>, meaning the current working directory, and a handle is returned for the file to which it refers.
ru: Если значение I<pathname> — пустая строка и значение I<flags> равно B<AT_EMPTY_PATH>, то I<dirfd> может быть открытым файловым дескриптором, указывающим на файл любого типа, или B<AT_FDCWD>, означающим текущий рабочий каталог, и описатель возвращается для файла, на который он указывает.

source: The I<mount_id> argument returns an identifier for the filesystem mount that corresponds to I<pathname>. This corresponds to the first field in one of the records in I</proc/self/mountinfo>. Opening the pathname in the fifth field of that record yields a file descriptor for the mount point; that file descriptor can be used in a subsequent call to B<open_by_handle_at>(). I<mount_id> is returned both for a successful call and for a call that results in the error B<EOVERFLOW>.
ru: В аргументе I<mount_id> возвращается идентификатор точки монтирования в файловой системе, соответствующий I<pathname>. Это значение соответствует первому полю одной из записей в I</proc/self/mountinfo>. Открытие пути из пятого поля этой записи возвращает файловый дескриптор этой точки монтирования; этот файловый дескриптор можно использовать в последующем вызове B<open_by_handle_at>(). Аргумент I<mount_id> возвращается при успешном выполнении, а также при ошибке B<EOVERFLOW>().

source: By default, B<name_to_handle_at>() does not dereference I<pathname> if it is a symbolic link, and thus returns a handle for the link itself. If B<AT_SYMLINK_FOLLOW> is specified in I<flags>, I<pathname> is dereferenced if it is a symbolic link (so that the call returns a handle for the file referred to by the link).
ru: По умолчанию, B<name_to_handle_at>() не разыменовывает I<pathname>, если это символическая ссылка, и поэтому возвращается описатель самой ссылки. Если в I<flags> указан B<AT_SYMLINK_FOLLOW>, то I<pathname> разыменовывается, если это символическая ссылка (то есть вызов возвращает описатель файла, на который указывает ссылка).

source: B<name_to_handle_at>() does not trigger a mount when the final component of the pathname is an automount point. When a filesystem supports both file handles and automount points, a B<name_to_handle_at>() call on an automount point will return with error B<EOVERFLOW> without having increased I<handle_bytes>. This can happen since Linux 4.13 with NFS when accessing a directory which is on a separate filesystem on the server. In this case, the automount can be triggered by adding a "/" to the end of the pathname.
ru: Системный вызов B<name_to_handle_at>() не вызывает монтирования, если конечная часть пути является автоматической точкой монтирования. Если файловая система поддерживает файловые описатели и автоматические точки монтирования, то вызов B<name_to_handle_at>() для автоматической точки монтирования завершится ошибкой B<EOVERFLOW> без увеличения значения I<handle_bytes>. Это может происходить с NFS начиная с версии Linux 4.13, когда задействованный каталог находится в отдельной файловой системе на сервере. В этом случае автомонтирование можно получить добавлением «/» в конец пути.

source: The B<open_by_handle_at>() system call opens the file referred to by I<handle>, a file handle returned by a previous call to B<name_to_handle_at>().
ru: Системный вызов B<open_by_handle_at>() открывает файл, на который указывает I<handle>, файловый описатель, полученный от предшествующего вызова B<name_to_handle_at>().

source: The I<mount_fd> argument is a file descriptor for any object (file, directory, etc.) in the mounted filesystem with respect to which I<handle> should be interpreted. The special value B<AT_FDCWD> can be specified, meaning the current working directory of the caller.
ru: Аргумент I<mount_fd> — это файловый дескриптор любого объекта (файла, каталога и т. д.) в смонтированной файловой системе, в которой должен находиться I<handle>. Может быть равен специальному значению B<AT_FDCWD>, которое обозначает текущий рабочий каталог вызывающего.

source: The I<flags> argument is as for B<open>(2). If I<handle> refers to a symbolic link, the caller must specify the B<O_PATH> flag, and the symbolic link is not dereferenced; the B<O_NOFOLLOW> flag, if specified, is ignored.
ru: Значение аргумента I<flags> как у B<open>(2). Если I<handle> указывает на символическую ссылку, то вызывающий должен указать флаг B<O_PATH>, и символическая ссылка не разыменовывается; флаг B<O_NOFOLLOW> игнорируется.

source: The caller must have the B<CAP_DAC_READ_SEARCH> capability to invoke B<open_by_handle_at>().
ru: Для вызова B<open_by_handle_at>() вызывающий должен иметь мандат B<CAP_DAC_READ_SEARCH>.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On success, B<name_to_handle_at>() returns 0, and B<open_by_handle_at>() returns a nonnegative file descriptor.
ru: При успешном выполнении B<name_to_handle_at>() возвращает 0, а B<open_by_handle_at>() возвращает неотрицательный файловый дескриптор.

source: In the event of an error, both system calls return -1 and set I<errno> to indicate the cause of the error.
ru: В случае ошибки системные вызовы возвращают -1, а в I<errno> записывается код ошибки.

source: ERRORS
ru: ОШИБКИ

source: B<name_to_handle_at>() and B<open_by_handle_at>() can fail for the same errors as B<openat>(2). In addition, they can fail with the errors noted below.
ru: Вызовы B<name_to_handle_at>() и B<open_by_handle_at>() могут завершиться с теми же ошибками что и B<openat>(2). Также могут возникать следующие ошибки:

source: B<name_to_handle_at>() can fail with the following errors:
ru: Вызов B<name_to_handle_at>() может завершиться со следующими ошибками:

source: I<pathname>, I<mount_id>, or I<handle> points outside your accessible address space.
ru: Значение I<pathname>, I<mount_id> или I<handle> указывает за пределы доступного адресного пространства.

source: I<flags> includes an invalid bit value.
ru: Значение I<flags> содержит некорректно установленный бит.

source: I<handle-E<gt>handle_bytes> is greater than B<MAX_HANDLE_SZ>.
ru: Значение I<handle-E<gt>handle_bytes> больше B<MAX_HANDLE_SZ>.

source: I<pathname> is an empty string, but B<AT_EMPTY_PATH> was not specified in I<flags>.
ru: Значение I<pathname> равно пустой строке, но в I<flags> не указано значение B<AT_EMPTY_PATH>.

source: The file descriptor supplied in I<dirfd> does not refer to a directory, and it is not the case that both I<flags> includes B<AT_EMPTY_PATH> and I<pathname> is an empty string.
ru: Файловый дескриптор, указанный в I<dirfd>, не ссылается на каталог и это не тот случай, когда I<flags> содержит B<AT_EMPTY_PATH> и I<pathname> равно пустой строке.

source: The filesystem does not support decoding of a pathname to a file handle.
ru: Файловая система не поддерживает преобразование пути в файловый описатель.

source: The I<handle-E<gt>handle_bytes> value passed into the call was too small. When this error occurs, I<handle-E<gt>handle_bytes> is updated to indicate the required size for the handle.
ru: Значение I<handle-E<gt>handle_bytes>, переданное в вызов, слишком мало. При этой ошибке I<handle-E<gt>handle_bytes> присваивается требуемый размер для описателя.

source: B<open_by_handle_at>() can fail with the following errors:
ru: Вызов B<open_by_handle_at>() может завершиться со следующими ошибками:

source: I<mount_fd> is not an open file descriptor.
ru: Значение I<mount_fd> не является открытым файловым дескриптором.

source: I<handle> points outside your accessible address space.
ru: Значение I<handle> указывает за пределы доступного адресного пространства.

source: I<handle-E<gt>handle_bytes> is greater than B<MAX_HANDLE_SZ> or is equal to zero.
ru: Значение I<handle-E<gt>handle_bytes> больше B<MAX_HANDLE_SZ> или равно нулю.

source: I<handle> refers to a symbolic link, but B<O_PATH> was not specified in I<flags>.
ru: Значение I<handle> указывает на символическую ссылку, но в I<flags> не указан B<O_PATH>.

source: The caller does not have the B<CAP_DAC_READ_SEARCH> capability.
ru: Вызывающий не имеет мандата B<CAP_DAC_READ_SEARCH>.

source: The specified I<handle> is not valid. This error will occur if, for example, the file has been deleted.
ru: Значение I<handle> некорректно. Эта ошибка возникает, например, из-за удаления файла.

source: VERSIONS
ru: ВЕРСИИ

source: These system calls first appeared in Linux 2.6.39. Library support is provided in glibc since version 2.14.
ru: Данные системные вызовы впервые появились в Linux 2.6.39. Поддержка в glibc появилась в версии 2.14.

source: These system calls are nonstandard Linux extensions.
ru: Данные системные вызовы являются нестандартными расширениями Linux.

source: FreeBSD has a broadly similar pair of system calls in the form of B<getfh>() and B<openfh>().
ru: В FreeBSD есть относительно похожая пара системных вызовов B<getfh>() и B<openfh>().

source: NOTES
ru: ЗАМЕЧАНИЯ

source: A file handle can be generated in one process using B<name_to_handle_at>() and later used in a different process that calls B<open_by_handle_at>().
ru: Файловый описатель может быть сгенерирован с помощью B<name_to_handle_at>() в одном процессе и использован в вызовах B<open_by_handle_at>() в другом.

source: Some filesystem don't support the translation of pathnames to file handles, for example, I</proc>, I</sys>, and various network filesystems.
ru: Некоторые файловые системы не поддерживают трансляцию путей в файловые описатели, например: I</proc>, I</sys> и различные сетевые файловые системы.

source: A file handle may become invalid ("stale") if a file is deleted, or for other filesystem-specific reasons. Invalid handles are notified by an B<ESTALE> error from B<open_by_handle_at>().
ru: Файловый описатель может стать некорректным («просроченным»), если файл удалён, или по другим причинам, относящимся к файловой системе. Для некорректных описателей B<open_by_handle_at>() возвращает ошибку B<ESTALE>.

source: These system calls are designed for use by user-space file servers. For example, a user-space NFS server might generate a file handle and pass it to an NFS client. Later, when the client wants to open the file, it could pass the handle back to the server. This sort of functionality allows a user-space file server to operate in a stateless fashion with respect to the files it serves.
ru: Данные системные вызовы предназначены для использования в файловых серверах пространства пользователя. Например, сервер пользовательского пространства NFS может генерировать файловый описатель и передавать его клиенту NFS. Позднее, когда клиент захочет открыть файл, он может передать описатель обратно серверу. Такого рода возможность позволяет файловому серверу пространства пользователя работать без формирования состояния (stateless fashion) для файлов, которые они обслуживают.

source: If I<pathname> refers to a symbolic link and I<flags> does not specify B<AT_SYMLINK_FOLLOW>, then B<name_to_handle_at>() returns a handle for the link (rather than the file to which it refers). The process receiving the handle can later perform operations on the symbolic link by converting the handle to a file descriptor using B<open_by_handle_at>() with the B<O_PATH> flag, and then passing the file descriptor as the I<dirfd> argument in system calls such as B<readlinkat>(2) and B<fchownat>(2).
ru: Если I<pathname> указывает на символическую ссылку и в I<flags> отсутствует B<AT_SYMLINK_FOLLOW>, то B<name_to_handle_at>() возвращает описатель ссылки (а не файла, на который она ссылается). Процесс, получивший описатель, может позднее выполнить операции над символической ссылкой, преобразовав описатель в файловый дескриптор, используя B<open_by_handle_at>() с флагом B<O_PATH>, и затем передав файловый дескриптор через аргумент I<dirfd> в системные вызовы B<readlinkat>(2) и B<fchownat>(2).

source: Obtaining a persistent filesystem ID
ru: Получение постоянного идентификатора файловой системы

source: The mount IDs in I</proc/self/mountinfo> can be reused as filesystems are unmounted and mounted. Therefore, the mount ID returned by B<name_to_handle_at>() (in I<*mount_id>) should not be treated as a persistent identifier for the corresponding mounted filesystem. However, an application can use the information in the I<mountinfo> record that corresponds to the mount ID to derive a persistent identifier.
ru: Идентификаторы монтирования в I</proc/self/mountinfo> могут быть использованы повторно после размонтирования и монтирования файловой системы. Поэтому, идентификатор монтирования, возвращаемый B<name_to_handle_at>() (в I<*mount_id>), не должен считаться постоянным идентификатором соответствующей файловой системы. Однако, приложение может использовать информацию в записи I<mountinfo>, которая соответствует идентификатору монтирования, для получения постоянного идентификатора.
