Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_o/*.po
Languages: ru

source: Since version 2.26, the glibc wrapper function for B<open>() employs the B<openat>() system call, rather than the kernel's B<open>() system call. For certain architectures, this is also true in glibc versions before 2.26.
ru: Начиная с версии 2.26, обёрточная функция glibc B<open>() используется системный вызов B<openat>(), а не системный вызов ядра B<open>(). На некоторых архитектурах это происходит в glibc с версиями ранее 2.26.

source: There are many infelicities in the protocol underlying NFS, affecting amongst others B<O_SYNC> and B<O_NDELAY>.
ru: В протоколе, по которому работает NFS, существует множество недоработок, оказывающих влияние на многое, в том числе на работу с B<O_SYNC> и B<O_NDELAY>.

source: On NFS filesystems with UID mapping enabled, B<open>() may return a file descriptor but, for example, B<read>(2) requests are denied with B<EACCES>. This is because the client performs B<open>() by checking the permissions, but UID mapping is performed by the server upon read and write requests.
ru: В файловых системах NFS с включённым проецированием UID, B<open>() может вернуть файловый дескриптор, но, например, запросы B<read>(2) будут отклонены с ошибкой B<EACCES>. Это происходит из-за того, что клиент выполняет B<open>() проверяя одни права, но сервер выполняет проецирование UID только при запросах чтения и записи.

source: FIFOs
ru: FIFO

source: Opening the read or write end of a FIFO blocks until the other end is also opened (by another process or thread). See B<fifo>(7) for further details.
ru: Открытие на чтение или запись конца FIFO приводит к блокировке то тех пор, пока другой конец не также не будет открыт (другим процессом или нитью). Подробности смотрите в B<fifo>(7).

source: File access mode
ru: Режим доступа к файлу

source: Unlike the other values that can be specified in I<flags>, the I<access mode> values B<O_RDONLY>, B<O_WRONLY>, and B<O_RDWR> do not specify individual bits. Rather, they define the low order two bits of I<flags>, and are defined respectively as 0, 1, and 2. In other words, the combination B<O_RDONLY | O_WRONLY> is a logical error, and certainly does not have the same meaning as B<O_RDWR>.
ru: В отличие от других значений, указываемых в I<flags>, значения I<режима доступа> B<O_RDONLY>, B<O_WRONLY> и B<O_RDWR>, не определяются отдельными битами. Точнее, они задаются двумя первыми битами I<flags>, и имеют значения 0, 1 и 2, соответственно. Другими словами, комбинация B<O_RDONLY | O_WRONLY> приводит к логической ошибке и точно не работает как B<O_RDWR>.

source: Linux reserves the special, nonstandard access mode 3 (binary 11) in I<flags> to mean: check for read and write permission on the file and return a file descriptor that can't be used for reading or writing. This nonstandard access mode is used by some Linux drivers to return a file descriptor that is to be used only for device-specific B<ioctl>(2) operations.
ru: В Linux зарезервирован специальный нестандартный режим доступа 3 (11 двоичное) в I<flags>, при котором: проверяются права на чтение и запись к файлу и возвращается файловый дескриптор, который не может использоваться для чтения или записи. Данный нестандартный режим доступа используется некоторыми драйверами Linux для получения файлового дескриптора, который будет использоваться в B<ioctl>(2) только для специальных операций с устройством.

source: Rationale for openat() and other directory file descriptor APIs
ru: Обоснование openat() и остального программного интерфейса файлового дескриптора каталога

source: B<openat>() and the other system calls and library functions that take a directory file descriptor argument (i.e., B<execveat>(2), B<faccessat>(2), B<fanotify_mark>(2), B<fchmodat>(2), B<fchownat>(2), B<fstatat>(2), B<futimesat>(2), B<linkat>(2), B<mkdirat>(2), B<mknodat>(2), B<name_to_handle_at>(2), B<readlinkat>(2), B<renameat>(2), B<statx>(2), B<symlinkat>(2), B<unlinkat>(2), B<utimensat>(2), B<mkfifoat>(3), and B<scandirat>(3)) address two problems with the older interfaces that preceded them. Here, the explanation is in terms of the B<openat>() call, but the rationale is analogous for the other interfaces.
ru: Вызов B<openat>() и другие системные вызовы и библиотечные функции, использующие файловый дескриптор каталога в качестве аргумента (т. е., B<execveat>(2), B<faccessat>(2), B<fanotify_mark>(2), B<fchmodat>(2), B<fchownat>(2), B<fstatat>(2), B<futimesat>(2), B<linkat>(2), B<mkdirat>(2), B<mknodat>(2), B<name_to_handle_at>(2), B<readlinkat>(2), B<renameat>(2), B<statx>(2), B<symlinkat>(2), B<unlinkat>(2), B<utimensat>(2), B<mkfifoat>(3) и B<scandirat>(3)) решают две проблемы старых интерфейсов, которые были до них. Вот объяснение, применимое к вызову B<openat>(), а объяснение для других интерфейсов аналогично.

source: First, B<openat>() allows an application to avoid race conditions that could occur when using B<open>() to open files in directories other than the current working directory. These race conditions result from the fact that some component of the directory prefix given to B<open>() could be changed in parallel with the call to B<open>(). Suppose, for example, that we wish to create the file I<dir1/dir2/xxx.dep> if the file I<dir1/dir2/xxx> exists. The problem is that between the existence check and the file-creation step, I<dir1> or I<dir2> (which might be symbolic links) could be modified to point to a different location. Such races can be avoided by opening a file descriptor for the target directory, and then specifying that file descriptor as the I<dirfd> argument of (say) B<fstatat>(2) and B<openat>(). The use of the I<dirfd> file descriptor also has other benefits:
ru: Во-первых, B<openat>() позволяет приложению избежать условий состязательности, которые могут возникнуть, когда B<open>() открывает файлы в каталогах, отличных от текущего рабочего каталога. Состязательность возникает из-за того, что один из компонентов префикса каталога, указанного B<open>(), может измениться одновременно с вызовом B<open>(). Например, предположим, что мы хотим создать файл I<dir1/dir2/xxx.dep> и существует файл I<dir1/dir2/xxx>. Проблема находится между шагами проверки существования и созданием файла, указываемые I<dir1> или I<dir2> (которые могут быть символическими ссылками) места могут измениться. Этой состязательности можно избежать открыв файловый дескриптор каталога назначения, и затем указав этот файловый дескриптор в аргументе I<dirfd> вызова (скажем) B<fstatat>(2) и B<openat>(). Также, использование файлового дескриптора I<dirfd> имеет другие преимущества:

source: the file descriptor is a stable reference to the directory, even if the directory is renamed; and
ru: файловый дескриптор — это стабильная ссылка на каталог, даже если каталог будет переименован; и

source: the open file descriptor prevents the underlying filesystem from being dismounted, just as when a process has a current working directory on a filesystem.
ru: открытый файловый дескриптор предотвращает размонтирование нижележащей файловой системы также, как если бы каталог являлся текущим рабочим каталогом процесса в файловой системе.

source: Second, B<openat>() allows the implementation of a per-thread "current working directory", via file descriptor(s) maintained by the application. (This functionality can also be obtained by tricks based on the use of I</proc/self/fd/>dirfd, but less efficiently.)
ru: Во-вторых, B<openat>() позволяет реализовать отдельный «текущий рабочий каталог» для каждой нити посредством файлового дескриптора, сопровождаемого приложением. Эта возможность также может быть получена с использованием I</proc/self/fd/>dirfd, но менее эффективно.

source: The B<O_DIRECT> flag may impose alignment restrictions on the length and address of user-space buffers and the file offset of I/Os. In Linux alignment restrictions vary by filesystem and kernel version and might be absent entirely. However there is currently no filesystem-independent interface for an application to discover these restrictions for a given file or filesystem. Some filesystems provide their own interfaces for doing so, for example the B<XFS_IOC_DIOINFO> operation in B<xfsctl>(3).
ru: Флаг B<O_DIRECT> может накладывать ограничения по выравниванию на длину и адрес буфера пользовательского пространства и смещения файла при вводе-выводе. В Linux ограничения по выравниванию различны у разных файловых систем и версий ядра, и даже могут отсутствовать. Однако сейчас не существует независимого от файловой системы интерфейса приложения для выявления этих ограничений на определённый файл или файловую систему. Некоторые файловые системы предоставляют свои собственные интерфейсы для этого, например, операция B<XFS_IOC_DIOINFO> в B<xfsctl>(3).

source: Under Linux 2.4, transfer sizes, and the alignment of the user buffer and the file offset must all be multiples of the logical block size of the filesystem. Since Linux 2.6.0, alignment to the logical block size of the underlying storage (typically 512 bytes) suffices. The logical block size can be determined using the B<ioctl>(2) B<BLKSSZGET> operation or from the shell using the command:
ru: В Linux 2.4 размеры передачи, выравнивание пользовательского буфера и файлового смещения должны быть кратны размеру логического блока файловой системы. Начиная с Linux 2.6 достаточно выравнивания по 512-байтовой границе. Размер логического блока можно определить с помощью B<ioctl>(2) и операции B<BLKSSZGET> или с помощью команды:

source: B<O_DIRECT> I/Os should never be run concurrently with the B<fork>(2) system call, if the memory buffer is a private mapping (i.e., any mapping created with the B<mmap>(2) B<MAP_PRIVATE> flag; this includes memory allocated on the heap and statically allocated buffers). Any such I/Os, whether submitted via an asynchronous I/O interface or from another thread in the process, should be completed before B<fork>(2) is called. Failure to do so can result in data corruption and undefined behavior in parent and child processes. This restriction does not apply when the memory buffer for the B<O_DIRECT> I/Os was created using B<shmat>(2) or B<mmap>(2) with the B<MAP_SHARED> flag. Nor does this restriction apply when the memory buffer has been advised as B<MADV_DONTFORK> with B<madvise>(2), ensuring that it will not be available to the child after B<fork>(2).
ru: Ввод-вывод с B<O_DIRECT> никогда не должен запускаться одновременно с системным вызовом B<fork>(2), если буфер памяти является закрытым отображением (т. е., любым отображениям, созданным с помощью B<mmap>(2) с флагом B<MAP_PRIVATE>; к ним относится память, выделенная под кучу и статически выделенные буферы). Любой подобный ввод-вывод, предоставленный через асинхронный интерфейс или из другой нити процесса, должен выполниться полностью до вызова B<fork>(2). В противном случае, может произойти повреждение данных и непредсказуемое поведение в процессе родителя и потомка.Данное ограничение не действует, если буфер памяти для ввода-вывода с B<O_DIRECT> был создан с помощью B<shmat>(2) или B<mmap>(2) с флагом B<MAP_SHARED>. И при этом это ограничение не действует, когда буфер памяти был помечен (advised) как B<MADV_DONTFORK> с помощью B<madvise>(2), если точно известно, что он не будет доступен потомку после B<fork>(2).

source: The B<O_DIRECT> flag was introduced in SGI IRIX, where it has alignment restrictions similar to those of Linux 2.4. IRIX has also a B<fcntl>(2) call to query appropriate alignments, and sizes. FreeBSD 4.x introduced a flag of the same name, but without alignment restrictions.
ru: Флаг B<O_DIRECT> появился в SGI IRIX, где ограничения на выравнивание подобны Linux 2.4. В IRIX также есть вызов B<fcntl>(2) для запроса значений соответствующего выравнивания и размеров. В FreeBSD 4.x появился флаг с таким же именем, но без ограничений на выравнивание.

source: B<O_DIRECT> support was added under Linux in kernel version 2.4.10. Older Linux kernels simply ignore this flag. Some filesystems may not implement the flag, in which case B<open>() fails with the error B<EINVAL> if it is used.
ru: Поддержка B<O_DIRECT> добавлена в ядро Linux версии 2.4.10. Более старые ядра Linux просто игнорируют этот флаг. В некоторых файловых системах этот флаг может быть не реализован и B<open>() завершается ошибкой B<EINVAL> при его использовании.

source: Applications should avoid mixing B<O_DIRECT> and normal I/O to the same file, and especially to overlapping byte regions in the same file. Even when the filesystem correctly handles the coherency issues in this situation, overall I/O throughput is likely to be slower than using either mode alone. Likewise, applications should avoid mixing B<mmap>(2) of files with direct I/O to the same files.
ru: Приложения должны избегать смешивания B<O_DIRECT> и обычных операций ввода-вывода в один файл и особенно перекрывать байтовые области. Даже когда файловая система правильно обрабатывает проблемы с когерентностью в такой ситуации, общая пропускная способность ввода-вывода, вероятно, будет медленнее чем при использовании какого-то одного из этих режимов отдельно. Аналогично приложения должны избегать смешивания B<mmap>(2) и прямого ввода-вывода для одинаковых файлов.

source: The behavior of B<O_DIRECT> with NFS will differ from local filesystems. Older kernels, or kernels configured in certain ways, may not support this combination. The NFS protocol does not support passing the flag to the server, so B<O_DIRECT> I/O will bypass the page cache only on the client; the server may still cache the I/O. The client asks the server to make the I/O synchronous to preserve the synchronous semantics of B<O_DIRECT>. Some servers will perform poorly under these circumstances, especially if the I/O size is small. Some servers may also be configured to lie to clients about the I/O having reached stable storage; this will avoid the performance penalty at some risk to data integrity in the event of server power failure. The Linux NFS client places no alignment restrictions on B<O_DIRECT> I/O.
ru: Поведение B<O_DIRECT> на NFS отличается от локальных файловых систем. Старые ядра и ядра, настроенные определёнными способами, могут не поддерживать такую комбинацию. Протокол NFS не поддерживает передачу флага на сервер, поэтому ввод-вывод с B<O_DIRECT> будет пропускать кэширование страниц только на клиенте; сервер всё равно может выполнить кэширование ввода-вывода. Клиент просит сервер выполнять операции ввода-вывода синхронно для сохранения синхронной семантики B<O_DIRECT>. Некоторые серверы будут выполнять это плохо при определённых условиях, особенно если размер данных ввода-вывода невелик. Некоторые серверы также могут быть настроены на отправку ложного ответа клиентам о том, что ввод-вывод произведён на носитель; это позволяет избежать потери производительности, но есть риск потери целостности данных в случае проблем с электропитанием сервера. В Linux клиент NFS не устанавливает ограничений по выравниванию при вводе-выводе с B<O_DIRECT>.

source: In summary, B<O_DIRECT> is a potentially powerful tool that should be used with caution. It is recommended that applications treat use of B<O_DIRECT> as a performance option which is disabled by default.
ru: Флаг B<O_DIRECT> является потенциально мощным инструментом, который нужно использовать с осторожностью. Рекомендуется, чтобы приложения считали использование B<O_DIRECT> как параметр производительности, который по умолчанию выключен.

source: BUGS
ru: ДЕФЕКТЫ

source: Currently, it is not possible to enable signal-driven I/O by specifying B<O_ASYNC> when calling B<open>(); use B<fcntl>(2) to enable this flag.
ru: На данный момент невозможно включить сигнальное управление вводом-выводом, указав B<O_ASYNC> при вызове B<open>(); чтобы установить этот флаг используйте B<fcntl>(2).

source: One must check for two different error codes, B<EISDIR> and B<ENOENT>, when trying to determine whether the kernel supports B<O_TMPFILE> functionality.
ru: Для определения поддержки ядром B<O_TMPFILE> нужно проверять два различных кода ошибок — B<EISDIR> и B<ENOENT>.

source: When both B<O_CREAT> and B<O_DIRECTORY> are specified in I<flags> and the file specified by I<pathname> does not exist, B<open>() will create a regular file (i.e., B<O_DIRECTORY> is ignored).
ru: При указании флагов B<O_CREAT> и B<O_DIRECTORY> в I<flags>, и при этом указанный в I<pathname> файл не существует, B<open>() создаст обычный файл (то есть флаг B<O_DIRECTORY> будет проигнорирован).

source: opendir, fdopendir - open a directory
ru: opendir, fdopendir - открывает каталог

source: The B<opendir>() function opens a directory stream corresponding to the directory I<name>, and returns a pointer to the directory stream. The stream is positioned at the first entry in the directory.
ru: Функция B<opendir>() открывает поток каталога, соответствующий каталогу с именем I<name>, и возвращает указатель на поток каталога. Поток устанавливается на первую запись в каталоге.

source: The B<fdopendir>() function is like B<opendir>(), but returns a directory stream for the directory referred to by the open file descriptor I<fd>. After a successful call to B<fdopendir>(), I<fd> is used internally by the implementation, and should not otherwise be used by the application.
ru: Функция B<fdopendir>() похожа на B<opendir>(), но возвращает поток каталога для каталога, на который ссылается открытый файловый дескриптор I<fd>. После успешного вызова B<fdopendir>(), дескриптор I<fd> используется только внутри реализации и не должен использоваться в приложении.

source: The B<opendir>() and B<fdopendir>() functions return a pointer to the directory stream. On error, NULL is returned, and I<errno> is set appropriately.
ru: Функции B<opendir>() и B<fdopendir>() возвращают указатель на поток каталога. В случае ошибки возвращается NULL, а I<errno> присваивается соответствующее значение.

source: Permission denied.
ru: Доступ запрещен.

source: I<fd> is not a valid file descriptor opened for reading.
ru: Значение I<fd> не является подходящим файловым дескриптором, открытым для чтения.

source: The per-process limit on the number of open file descriptors has been reached.
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: Directory does not exist, or I<name> is an empty string.
ru: Каталог не существует, либо I<name> содержит пустую строку.

source: Insufficient memory to complete the operation.
ru: Недостаточно памяти для завершения операции.

source: I<name> is not a directory.
ru: Значение I<name> не является каталогом.

source: B<fdopendir>() is available in glibc since version 2.4.
ru: Функция B<fdopendir>() доступна в glibc начиная с версии 2.4.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: B<opendir>() is present on SVr4, 4.3BSD, and specified in POSIX.1-2001. B<fdopendir>() is specified in POSIX.1-2008.
ru: Функция B<opendir>() присутствует в SVr4, 4.3BSD и описана в стандарте POSIX.1-2001. Функция B<fdopendir>() описана в POSIX.1-2008.

source: Filename entries can be read from a directory stream using B<readdir>(3).
ru: Записи имён файлов можно читать из потока каталога с помощью B<readdir>(3).

source: The underlying file descriptor of the directory stream can be obtained using B<dirfd>(3).
ru: Задействованный файловый дескриптор потока каталога может быть получен в помощью B<dirfd>(3).

source: The B<opendir>() function sets the close-on-exec flag for the file descriptor underlying the I<DIR *>. The B<fdopendir>() function leaves the setting of the close-on-exec flag unchanged for the file descriptor, I<fd>. POSIX.1-200x leaves it unspecified whether a successful call to B<fdopendir>() will set the close-on-exec flag for the file descriptor, I<fd>.
ru: Функция B<opendir>() устанавливает флаг close-on-exec для файлового дескриптора, указывающего на I<DIR *>. Функция B<fdopendir>() оставляет флаг close-on-exec не изменённым для файлового дескриптора I<fd>. В POSIX.1-200x нет точного определения на этот счет, хотя успешный вызов B<fdopendir>() установит флаг close-on-exec для файлового дескриптора I<fd>.

source: offsetof - offset of a structure member
ru: offsetof - смещение элемента структуры

source: The macro B<offsetof>() returns the offset of the field I<member> from the start of the structure I<type>.
ru: Макрокоманда B<offsetof>() возвращает смещение поля I<member> от начала структуры I<type>.

source: This macro is useful because the sizes of the fields that compose a structure can vary across implementations, and compilers may insert different numbers of padding bytes between fields. Consequently, an element's offset is not necessarily given by the sum of the sizes of the previous elements.
ru: Эта макрокоманда удобна, так как размеры полей, составляющих структуру, могут значительно изменяться в зависимости от реализаций, а компиляторы могут добавлять различное количество дополнительных байт между полями. Следовательно, смещение элемента не всегда является суммой размеров предыдущих элементов.

source: A compiler error will result if I<member> is not aligned to a byte boundary (i.e., it is a bit field).
ru: Если I<member> не выровнен по границе байта (т.е., если это битовое поле), то компилятор вернёт ошибку.

source: B<offsetof>() returns the offset of the given I<member> within the given I<type>, in units of bytes.
ru: Функция B<offsetof>() возвращает смещение в байтах указанного поля I<member> внутри указанного I<type>.

source: On a Linux/i386 system, when compiled using the default B<gcc>(1) options, the program below produces the following output:
ru: В системах Linux/i386 при использовании компилятора B<gcc>(1) с параметрами по умолчанию нижеследующая программа дает следующий результат:

source: Program source
ru: Исходный код программы

source: /* Output is compiler dependent */
ru: /* Вывод зависит от компилятора */

source: openpty, login_tty, forkpty - terminal utility functions
ru: openpty, login_tty, forkpty - функции для работы с терминалом

source: Link with I<-lutil>.
ru: Компонуется при указании параметра I<-lutil>.

source: The B<openpty>() function finds an available pseudoterminal and returns file descriptors for the master and slave in I<amaster> and I<aslave>. If I<name> is not NULL, the filename of the slave is returned in I<name>. If I<termp> is not NULL, the terminal parameters of the slave will be set to the values in I<termp>. If I<winp> is not NULL, the window size of the slave will be set to the values in I<winp>.
ru: Функция B<openpty>() ищет доступный псевдотерминал и возвращает файловые дескрипторы для его основного и подчинённого устройств в I<amaster> и I<aslave>. Если I<name> не равно NULL, то имя файла подчинённого устройства возвращается в I<name>. Если I<termp> не равно NULL, то параметры терминала подчинённого устройства будут установлены в значения, указанные в I<termp>. Если I<winp> не равно NULL, то размер окна подчинённого устройства будет установлен согласно значениям, указанным в I<winp>.
