Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_o/*.po
Languages: ru

source: Try to minimize cache effects of the I/O to and from this file. In general this will degrade performance, but it is useful in special situations, such as when applications do their own caching. File I/O is done directly to/from user-space buffers. The B<O_DIRECT> flag on its own makes an effort to transfer data synchronously, but does not give the guarantees of the B<O_SYNC> flag that data and necessary metadata are transferred. To guarantee synchronous I/O, B<O_SYNC> must be used in addition to B<O_DIRECT>. See NOTES below for further discussion.
ru: Попытаться минимизировать влияние кэширования ввода-вывода при чтении и записи в файл. Обычно, это ухудшает производительность, но полезно для особых случаев, например, когда приложение выполняет кэширование самостоятельно. Файловый ввод-вывод выполняется непосредственно в/из буферов пространства пользователя. При флаге B<O_DIRECT> предпринимаются все усилия для синхронной передачи данных, но это не гарантирует, как с флагом B<O_SYNC>, передачу данных и необходимых метаданных. Чтобы гарантировать синхронный ввод-вывод вместе с B<O_DIRECT> нужно использовать B<O_SYNC>. Дальнейшее описание смотрите далее в разделе ЗАМЕЧАНИЯ.

source: A semantically similar (but deprecated) interface for block devices is described in B<raw>(8).
ru: Семантически похожий интерфейс (но устаревший) для блочных устройств описан в B<raw>(8).

source: If I<pathname> is not a directory, cause the open to fail. This flag was added in kernel version 2.1.126, to avoid denial-of-service problems if B<opendir>(3) is called on a FIFO or tape device.
ru: Если I<pathname> не является каталогом, то завершить вызов с ошибкой. Этот флаг был добавлен в ядро версии 2.1.126, чтобы избежать проблем с «отказом в обслуживании», если B<opendir>(3) был вызван для канала FIFO или ленточного устройства.

source: Write operations on the file will complete according to the requirements of synchronized I/O I<data> integrity completion.
ru: Операции записи файла будут выполнены согласно требованиям целостности синхронизации ввода-вывода I<data>.

source: By the time B<write>(2) (and similar) return, the output data has been transferred to the underlying hardware, along with any file metadata that would be required to retrieve that data (i.e., as though each B<write>(2) was followed by a call to B<fdatasync>(2)). I<See NOTES below>.
ru: К времени возврата из B<write>(2) (и подобных) выходные данные уже переданы в задействованное аппаратное обеспечение вместе со всеми метаданными файла, которые бы потребовались для получения данных (т. е., как если бы за каждым B<write>(2) был выполнен вызов B<fdatasync>(2)). I<Смотрите ЗАМЕЧАНИЯ далее>.

source: Ensure that this call creates the file: if this flag is specified in conjunction with B<O_CREAT>, and I<pathname> already exists, then B<open>() fails with the error B<EEXIST>.
ru: Гарантирует, что вызов создаст файл: если этот флаг указан вместе с B<O_CREAT> и I<pathname> уже существует, то B<open>() завершается ошибкой B<EEXIST>().

source: When these two flags are specified, symbolic links are not followed: if I<pathname> is a symbolic link, then B<open>() fails regardless of where the symbolic link points.
ru: При использовании обоих флагов символьные ссылки не поддерживаются: если I<pathname> является символьной ссылкой, то B<open>() завершается с ошибкой независимо от того, куда указывает ссылка.

source: In general, the behavior of B<O_EXCL> is undefined if it is used without B<O_CREAT>. There is one exception: on Linux 2.6 and later, B<O_EXCL> can be used without B<O_CREAT> if I<pathname> refers to a block device. If the block device is in use by the system (e.g., mounted), B<open>() fails with the error B<EBUSY>.
ru: Вообще говоря, поведение с B<O_EXCL> не определено, если этот флаг используется без B<O_CREAT>. Есть одно исключение: в Linux 2.6 и более новых B<O_EXCL> можно использовать без B<O_CREAT>, если I<pathname> указывает на блочное устройство. Если блочное устройство используется в системе (например, смонтировано), то B<open>() завершится с ошибкой B<EBUSY>.

source: On NFS, B<O_EXCL> is supported only when using NFSv3 or later on kernel 2.6 or later. In NFS environments where B<O_EXCL> support is not provided, programs that rely on it for performing locking tasks will contain a race condition. Portable programs that want to perform atomic file locking using a lockfile, and need to avoid reliance on NFS support for B<O_EXCL>, can create a unique file on the same filesystem (e.g., incorporating hostname and PID), and use B<link>(2) to make a link to the lockfile. If B<link>(2) returns 0, the lock is successful. Otherwise, use B<stat>(2) on the unique file to check if its link count has increased to 2, in which case the lock is also successful.
ru: Флаг B<O_EXCL> поддерживается для NFS только, если используется NFSv3 или новее с ядром 2.6 или новее. В средах, где в NFS нет поддержки B<O_EXCL>, программы, которые полагаются на это для выполнения задач блокировок, будут создавать состязательность процессов. Переносимым программам, которым нужно произвести атомарную блокировку файла с помощь файла блокировки, необходимо избегать зависимости от поддержки в NFS флага B<O_EXCL>. В качестве решения можно создать уникальный файл в той же файловой системе (например, добавив имя узла и PID в название), чтобы создать ссылку на файл блокировки с помощью B<link>(2). Если B<link>(2) возвращает 0, то блокировка выполнена. В противном случае используйте B<stat>(2), чтобы убедиться, что количество ссылок на уникальный файл возросло до двух. Это также означает, что блокировка была успешной.

source: (LFS) Allow files whose sizes cannot be represented in an I<off_t> (but can be represented in an I<off64_t>) to be opened. The B<_LARGEFILE64_SOURCE> macro must be defined (before including I<any> header files) in order to obtain this definition. Setting the B<_FILE_OFFSET_BITS> feature test macro to 64 (rather than using B<O_LARGEFILE>) is the preferred method of accessing large files on 32-bit systems (see B<feature_test_macros>(7)).
ru: (LFS) Позволяет открывать файлы, чей размер нельзя представить типом I<off_t> (но можно представить типом I<off64_t>). Для получения этого определения должен быть указан макрос B<_LARGEFILE64_SOURCE> (до включения I<какого-либо> заголовочного файла). Установка макроса тестирования возможностей B<_FILE_OFFSET_BITS> в значение 64 (вместо использования B<O_LARGEFILE>) является предпочтительным методом доступа к большим файлам на 32-битных системах (см. B<feature_test_macros>(7)).

source: B<O_NOATIME> (since Linux 2.6.8)
ru: B<O_NOATIME> (начиная с Linux 2.6.8)

source: Do not update the file last access time (I<st_atime> in the inode) when the file is B<read>(2).
ru: Не обновлять время последнего доступа к файлу (I<st_atime> в иноде) при вызове B<read>(2) для файла.

source: This flag can be employed only if one of the following conditions is true:
ru: Этот флаг может использоваться только, если удовлетворяется одно из следующих условий:

source: The effective UID of the process matches the owner UID of the file.
ru: Эффективный пользовательский идентификатор процесса совпадает идентификатором владельца файла.

source: The calling process has the B<CAP_FOWNER> capability in its user namespace and the owner UID of the file has a mapping in the namespace.
ru: Вызывающий процесс имеет мандат B<CAP_FOWNER> в своём пользовательском пространстве имён и UID владельца файла отображён в пространстве имён.

source: This flag is intended for use by indexing or backup programs, where its use can significantly reduce the amount of disk activity. This flag may not be effective on all filesystems. One example is NFS, where the server maintains the access time.
ru: Этот флаг предназначен для использования в программах индексирования и резервного копирования; он позволяет значительно сократить количество обращений к диску. Флаг может быть не эффективен на некоторых файловых системах. Например, на NFS, где запись времени доступа выполняется сервером.

source: If I<pathname> refers to a terminal device\(emsee B<tty>(4)\(emit will not become the process's controlling terminal even if the process does not have one.
ru: Если I<pathname> указывает на терминальное устройство (см. B<tty>(4)), то оно не станет управляющим терминалом процесса, даже если процесс такового не имеет.

source: If I<pathname> is a symbolic link, then the open fails, with the error B<ELOOP>. Symbolic links in earlier components of the pathname will still be followed. (Note that the B<ELOOP> error that can occur in this case is indistinguishable from the case where an open fails because there are too many symbolic links found while resolving components in the prefix part of the pathname.)
ru: Если I<pathname> является символьной ссылкой, то открытие завершится с ошибкой B<ELOOP>. Символьные ссылки в ближайших частях имени будут обработаны как обычно (заметим, что ошибка B<ELOOP>, которая может возникнуть в данном случае, неотличима от ошибки, когда открытие завершается из-за обнаружения слишком большого количества символьных ссылок при определении частей в префиксе пути).

source: This flag is a FreeBSD extension, which was added to Linux in version 2.1.126, and has subsequently been standardized in POSIX.1-2008.
ru: Данный флаг является расширением FreeBSD, которое было добавлено в Linux версии 2.1.126, и в последствии был стандартизован в POSIX.1-2008.

source: See also B<O_PATH> below.
ru: Смотрите также далее B<O_PATH>.

source: B<O_NONBLOCK> or B<O_NDELAY>
ru: B<O_NONBLOCK> или B<O_NDELAY>

source: When possible, the file is opened in nonblocking mode. Neither the B<open>() nor any subsequent I/O operations on the file descriptor which is returned will cause the calling process to wait.
ru: Если возможно, файл открывается в неблокирующем режиме. Ни B<open>(), ни другие последующие операции ввода-вывода над возвращаемым дескриптором файла не заставят вызывающий процесс ждать.

source: Note that ithe setting of this flag has no effect on the operation of B<poll>(2), B<select>(2), B<epoll>(7), and similar, since those interfaces merely inform the caller about whether a file descriptor is "ready", meaning that an I/O operation performed on the file descriptor with the B<O_NONBLOCK> flag I<clear> would not block.
ru: Заметим, что установка этого флага не влияет на операции B<poll>(2), B<select>(2), B<epoll>(7) и подобные, так как их интерфейсы просто информируют вызывающего о том, что файловый дескриптор «ready», то есть операция ввода-вывода, выполняемая над файловым дескриптором с флагом B<O_NONBLOCK>, I<точно> не заблокируется.

source: Note that this flag has no effect for regular files and block devices; that is, I/O operations will (briefly) block when device activity is required, regardless of whether B<O_NONBLOCK> is set. Since B<O_NONBLOCK> semantics might eventually be implemented, applications should not depend upon blocking behavior when specifying this flag for regular files and block devices.
ru: Обратите внимание, что этот флаг не оказывает влияния на обычные файлы и блочные устройства, то есть операции ввода-вывода будут блокироваться на короткое время, если будет запрошено активность устройства, вне зависимости от установки флага B<O_NONBLOCK>. Семантика B<O_NONBLOCK> может быть когда-нибудь реализована, поэтому приложения не должны зависеть от блокировок при указании данного флага для обычных файлов и блочных устройств.

source: For the handling of FIFOs (named pipes), see also B<fifo>(7). For a discussion of the effect of B<O_NONBLOCK> in conjunction with mandatory file locks and with file leases, see B<fcntl>(2).
ru: Для работы с каналами FIFO также смотрите B<fifo>(7). Обсуждение влияния B<O_NONBLOCK> в сочетании с обязательной файловой блокировкой или арендой (lease) смотрите в B<fcntl>(2).

source: B<O_PATH> (since Linux 2.6.39)
ru: B<O_PATH> (начиная с Linux 2.6.39)

source: Obtain a file descriptor that can be used for two purposes: to indicate a location in the filesystem tree and to perform operations that act purely at the file descriptor level. The file itself is not opened, and other file operations (e.g., B<read>(2), B<write>(2), B<fchmod>(2), B<fchown>(2), B<fgetxattr>(2), B<ioctl>(2), B<mmap>(2)) fail with the error B<EBADF>.
ru: Получить файловый дескриптор, который можно использовать для двух целей: для указания положения в дереве файловой системы и для выполнения операций, работающих исключительно на уровне файловых дескрипторов. Сам файл не открывается и другие файловые операции (например, B<read>(2), B<write>(2), B<fchmod>(2), B<fchown>(2), B<fgetxattr>(2), B<ioctl>(2), B<mmap>(2)) завершатся с ошибкой B<EBADF>.

source: The following operations I<can> be performed on the resulting file descriptor:
ru: Следующие операции I<могут> выполняться над полученным файловым дескриптором:

source: B<fchdir>(2), if the file descriptor refers to a directory (since Linux 3.5).
ru: B<fchdir>(2), если файловый дескриптор указывает на каталог (начиная с Linux 3.5).

source: B<fstat>(2) (since Linux 3.6).
ru: B<fstat>(2) (начиная с Linux 3.6).

source: B<fstatfs>(2) (since Linux 3.12).
ru: B<fstatfs>(2) (начиная с Linux 3.12).

source: Duplicating the file descriptor (B<dup>(2), B<fcntl>(2) B<F_DUPFD>, etc.).
ru: Создание дубликата файлового дескриптора (B<dup>(2), B<fcntl>(2) B<F_DUPFD> и т.д.).

source: Getting and setting file descriptor flags (B<fcntl>(2) B<F_GETFD> and B<F_SETFD>).
ru: Получение и установка флагов файловых дескрипторов (B<fcntl>(2) B<F_GETFD> и B<F_SETFD>).

source: Retrieving open file status flags using the B<fcntl>(2) B<F_GETFL> operation: the returned flags will include the bit B<O_PATH>.
ru: Получение флагов состояния открытого файла с помощью операции B<fcntl>(2) B<F_GETFL>: в возвращаемые флаги будет включён бит B<O_PATH>.

source: Passing the file descriptor as the I<dirfd> argument of B<openat>() and the other "*at()" system calls. This includes B<linkat>(2) with B<AT_EMPTY_PATH> (or via procfs using B<AT_SYMLINK_FOLLOW>) even if the file is not a directory.
ru: Передача файлового дескриптора в аргументе I<dirfd> для B<openat>() и других системных вызовов «*at()». К ним относится B<linkat>(2) с флагом B<AT_EMPTY_PATH> (или через procfs с помощью B<AT_SYMLINK_FOLLOW>) даже, если файл не является каталогом.

source: Passing the file descriptor to another process via a UNIX domain socket (see B<SCM_RIGHTS> in B<unix>(7)).
ru: Передача файлового дескриптора в другой процесс через доменный сокет UNIX (смотрите B<SCM_RIGHTS> в B<unix>(7)).

source: When B<O_PATH> is specified in I<flags>, flag bits other than B<O_CLOEXEC>, B<O_DIRECTORY>, and B<O_NOFOLLOW> are ignored.
ru: Если в I<flags> указан B<O_PATH>, то биты флагов, отличные от B<O_CLOEXEC>, B<O_DIRECTORY>и B<O_NOFOLLOW>, игнорируются.

source: Opening a file or directory with the B<O_PATH> flag requires no permissions on the object itself (but does require execute permission on the directories in the path prefix). Depending on the subsequent operation, a check for suitable file permissions may be performed (e.g., B<fchdir>(2) requires execute permission on the directory referred to by its file descriptor argument). By contrast, obtaining a reference to a filesystem object by opening it with the B<O_RDONLY> flag requires that the caller have read permission on the object, even when the subsequent operation (e.g., B<fchdir>(2), B<fstat>(2)) does not require read permission on the object.
ru: Открытие файла или каталога при указании флага B<O_PATH> не требует прав на сам объект (но требует права на выполнение каталогов из префикса пути). В зависимости от последующей операции может выполняться проверка определённых прав на файл (например, B<fchdir>(2) требует права на выполнение у каталога, указанного в аргументе файлового дескриптора). Напротив, для получения ссылки на объект файловой системы при открытии с флагом B<O_RDONLY> от вызывающего требуется право на чтение объекта, даже если для последующей операции (например, B<fchdir>(2), B<fstat>(2)) не требуется права чтения объекта.

source: If I<pathname> is a symbolic link and the B<O_NOFOLLOW> flag is also specified, then the call returns a file descriptor referring to the symbolic link. This file descriptor can be used as the I<dirfd> argument in calls to B<fchownat>(2), B<fstatat>(2), B<linkat>(2), and B<readlinkat>(2) with an empty pathname to have the calls operate on the symbolic link.
ru: Если I<pathname> является символьной ссылкой и также указан флаг B<O_NOFOLLOW>, то вызов возвращает файловый дескриптор, указывающий на символьную ссылку. Этот файловый дескриптор можно использовать в аргументе I<dirfd> для вызовов B<fchownat>(2), B<fstatat>(2), B<linkat>(2) и B<readlinkat>(2) с пустым именем пути, чтобы выполнить операцию над символьной ссылкой.

source: If I<pathname> refers to an automount point that has not yet been triggered, so no other filesystem is mounted on it, then the call returns a file descriptor referring to the automount directory without triggering a mount. B<fstatfs>(2) can then be used to determine if it is, in fact, an untriggered automount point (B<.f_type == AUTOFS_SUPER_MAGIC>).
ru: Если I<pathname> ссылается на автоматическую точку монтирования, которая ещё не включилась, и поэтому к ней не примонтированы другие файловые системы, то вызов возвращает файловый дескриптор, указывающий на каталог автомонтирования, не вызывая запуск монтирования. Затем можно использовать вызов B<fstatfs>(2) для определения, является ли автоматическая точка монтирования включённой (B<.f_type == AUTOFS_SUPER_MAGIC>).

source: One use of B<O_PATH> for regular files is to provide the equivalent of POSIX.1's B<O_EXEC> functionality. This permits us to open a file for which we have execute permission but not read permission, and then execute that file, with steps something like the following:
ru: Одним из вариантов использования флага B<O_PATH> для обычных файлов — предоставление эквивалента функции B<O_EXEC>, описанной POSIX.1. Вызывающий может открыть файл, для которого имеется право на выполнение, но не права на чтение, и затем выполнить этот файл следующими действиями:

source: An B<O_PATH> file descriptor can also be passed as the argument of B<fexecve>(3).
ru: Файловый дескриптор с B<O_PATH> также может быть передан в качестве аргумента B<fexecve>(3).

source: Write operations on the file will complete according to the requirements of synchronized I/O I<file> integrity completion (by contrast with the synchronized I/O I<data> integrity completion provided by B<O_DSYNC>.)
ru: Операции записи файла будут выполнены согласно требованиям целостности синхронизации ввода-вывода I<file> (по сравнению с целостностью синхронизации ввода-вывода I<data>, предоставляемой B<O_DSYNC>).

source: By the time B<write>(2) (or similar) returns, the output data and associated file metadata have been transferred to the underlying hardware (i.e., as though each B<write>(2) was followed by a call to B<fsync>(2)). I<See NOTES below>.
ru: На момент возврата из B<write>(2) (или подобной функции) выходные данные и все метаданные файла уже переданы в задействованное аппаратное обеспечение (т. е., как если бы за каждым B<write>(2) был выполнен вызов B<fsync>(2)). I<Смотрите ЗАМЕЧАНИЯ далее>.

source: B<O_TMPFILE> (since Linux 3.11)
ru: B<O_TMPFILE> (начиная с Linux 3.11)

source: Create an unnamed temporary regular file. The I<pathname> argument specifies a directory; an unnamed inode will be created in that directory's filesystem. Anything written to the resulting file will be lost when the last file descriptor is closed, unless the file is given a name.
ru: Создание безымянного временного обычного файла. В аргументе I<pathname> указывается каталог; безымянная inode будет создана в файловой системе этого каталога. Всё записанное в полученный файл будет потеряно при закрытии последнего файлового дескриптора, если файлу не будет назначено имя.

source: B<O_TMPFILE> must be specified with one of B<O_RDWR> or B<O_WRONLY> and, optionally, B<O_EXCL>. If B<O_EXCL> is not specified, then B<linkat>(2) can be used to link the temporary file into the filesystem, making it permanent, using code like the following:
ru: Флаг B<O_TMPFILE> должен быть указан вместе с B<O_RDWR> или B<O_WRONLY> и, необязательно, B<O_EXCL>. Если B<O_EXCL> не указан, то можно использовать B<linkat>(2) для ссылки на временный файл в файловой системе, сделав его постоянным с помощью кода:

source: /* File I/O on 'fd'... */
ru: /* Файловый ввод-вывод в «fd»… */

source: In this case, the B<open>() I<mode> argument determines the file permission mode, as with B<O_CREAT>.
ru: В этом случае аргументом I<mode> у B<open>() определяется режим доступа к файлу как с B<O_CREAT>.

source: Specifying B<O_EXCL> in conjunction with B<O_TMPFILE> prevents a temporary file from being linked into the filesystem in the above manner. (Note that the meaning of B<O_EXCL> in this case is different from the meaning of B<O_EXCL> otherwise.)
ru: Указание B<O_EXCL> вместе с B<O_TMPFILE> отключает возможность создания символьной ссылки в файловой системе указанным ранее способом (заметим, что назначение B<O_EXCL> в этом случае отличается от обычного B<O_EXCL>).

source: There are two main use cases for B<O_TMPFILE>:
ru: Есть два основных случая использования B<O_TMPFILE>:

source: Improved B<tmpfile>(3) functionality: race-free creation of temporary files that (1) are automatically deleted when closed; (2) can never be reached via any pathname; (3) are not subject to symlink attacks; and (4) do not require the caller to devise unique names.
ru: Дополнительное свойство B<tmpfile>(3): свободное от состязательности создание временных файлов, которые: автоматически удаляются при закрытии; недоступны по имени; не подвержены атаке через символьные ссылки; не требуют от вызывающего подбирать уникальное имя.

source: Creating a file that is initially invisible, which is then populated with data and adjusted to have appropriate filesystem attributes (B<fchown>(2), B<fchmod>(2), B<fsetxattr>(2), etc.) before being atomically linked into the filesystem in a fully formed state (using B<linkat>(2) as described above).
ru: Создание файла, который изначально не видим, и который затем заполняется данными и позволяет изменять атрибуты в файловой системе (B<fchown>(2), B<fchmod>(2), B<fsetxattr>(2) и т. д.) до автоматического встраивания в файловую систему в полностью законченном виде (с помощью B<linkat>(2) как описано ранее).

source: B<O_TMPFILE> requires support by the underlying filesystem; only a subset of Linux filesystems provide that support. In the initial implementation, support was provided in the ext2, ext3, ext4, UDF, Minix, and shmem filesystems. Support for other filesystems has subsequently been added as follows: XFS (Linux 3.15); Btrfs (Linux 3.16); F2FS (Linux 3.16); and ubifs (Linux 4.9)
ru: Для B<O_TMPFILE> требуется поддержка в файловой системе; она есть только в нескольких файловых системах Linux. В первой реализации поддержка предоставлялась в файловых системах ext2, ext3, ext4, UDF, Minix и shmem. Поддержка других файловых систем появлялась так: XFS (Linux 3.15); Btrfs (Linux 3.16); F2FS (Linux 3.16); ubifs (Linux 4.9).

source: If the file already exists and is a regular file and the access mode allows writing (i.e., is B<O_RDWR> or B<O_WRONLY>) it will be truncated to length 0. If the file is a FIFO or terminal device file, the B<O_TRUNC> flag is ignored. Otherwise, the effect of B<O_TRUNC> is unspecified.
ru: Если файл уже существует и является обычным файлом и режим доступа позволяет писать в этот файл (т.е. установлен флаг B<O_RDWR> или B<O_WRONLY>), то его длина будет урезана до нуля. Если файл является FIFO или терминальным устройством, то этот флаг игнорируется. В других случаях действие флага B<O_TRUNC> не определено.
