Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: These functions round I<x> to the nearest integer value that is not larger in magnitude than I<x>.
ru: Данные функции округляют I<x> до ближайшего целого значения, которое не превышает I<x> по модулю.

source: These functions return the rounded integer value, in floating format.
ru: Данные функции возвращают округлённое целое значение в формате с плавающей запятой.

source: If I<x> is integral, infinite, or NaN, I<x> itself is returned.
ru: Если I<x> целое, стремится к бесконечности или является NaN, то буде возвращено I<x>.

source: No errors occur.
ru: Ошибки не возникают.

source: These functions first appeared in glibc in version 2.1.
ru: Эти функции впервые появились в glibc 2.1.

source: The integral value returned by these functions may be too large to store in an integer type (I<int>, I<long>, etc.). To avoid an overflow, which will produce undefined results, an application should perform a range check on the returned value before assigning it to an integer type.
ru: Целая часть, возвращаемая этими функциями, может быть слишком большой для целого типа (I<int>, I<long> и так далее). Чтобы избежать переполнения, которое может привести к неопределенным результатам, приложение должно осуществлять проверку возвращаемого размера значения до того, как присвоить его целому типу.

source: ttyslot - find the slot of the current user's terminal in some file
ru: ttyslot - поиск слота текущего терминала пользователя в определённом файле

source: B<#include E<lt>unistd.hE<gt>> /See NOTES */
ru: B<#include E<lt>unistd.hE<gt>> /* смотрите ЗАМЕЧАНИЯ */

source: Since glibc 2.24: _DEFAULT_SOURCE
ru: Начиная с glibc 2.24: _DEFAULT_SOURCE

source: From glibc 2.20 to 2.23: _DEFAULT_SOURCE || _XOPEN_SOURCE\ &&\ _XOPEN_SOURCE\ E<lt>\ 500
ru: Начиная с glibc 2.20 по 2.23: _DEFAULT_SOURCE || _XOPEN_SOURCE\ &&\ _XOPEN_SOURCE\ E<lt>\ 500

source: Glibc 2.19 and earlier: _BSD_SOURCE || _XOPEN_SOURCE\ &&\ _XOPEN_SOURCE\ E<lt>\ 500
ru: В Glibc 2.19 и старее: _BSD_SOURCE || _XOPEN_SOURCE\ &&\ _XOPEN_SOURCE\ E<lt>\ 500

source: The legacy function B<ttyslot>() returns the index of the current user's entry in some file.
ru: Исходная функция B<ttyslot>() возвращает индекс записи текущего пользователя в определённом файле.

source: Now "What file?" you ask. Well, let's first look at some history.
ru: «В каком файле?» \(em спросите вы. Что же, для начала обратимся к истории.

source: Ancient history
ru: Доисторические времена

source: There used to be a file I</etc/ttys> in UNIX\ V6, that was read by the B<init>(1) program to find out what to do with each terminal line. Each line consisted of three characters. The first character was either \(aq0\(aq or \(aq1\(aq, where \(aq0\(aq meant "ignore". The second character denoted the terminal: \(aq8\(aq stood for "/dev/tty8". The third character was an argument to B<getty>(8) indicating the sequence of line speeds to try (\(aq-\(aq was: start trying 110 baud). Thus a typical line was "18-". A hang on some line was solved by changing the \(aq1\(aq to a \(aq0\(aq, signaling init, changing back again, and signaling init again.
ru: В UNIX\ V6 использовался файл I</etc/ttys>, который читался программой B<init>(1) для определения того, что делать с каждым терминалом. Каждая строка содержала три символа. Первый символ мог быть \(aq0\(aq или \(aq1\(aq (где \(aq0\(aq означало «ignore»). Второй символ обозначал терминал: \(aq8\(aq означал «/dev/tty8». Третий символ был аргументом для B<getty>(8), обозначающим начальную скорость передачи символов (например, \(aq-\(aq означал начинать с 110 бод). Обычная строка в файле, таким образом, имела вид «18-». Зависание какого-либо терминала обычно решалось изменением \(aq1\(aq на \(aq0\(aq, подачей сигнала в init, возвращением исходного значения и ещё одной подачей сигнала в init.

source: In UNIX\ V7 the format was changed: here the second character was the argument to B<getty>(8) indicating the sequence of line speeds to try (\(aq0\(aq was: cycle through 300-1200-150-110 baud; \(aq4\(aq was for the on-line console DECwriter) while the rest of the line contained the name of the tty. Thus a typical line was "14console".
ru: В UNIX\ V7 формат изменился. Второй символ стал аргументом B<getty>(8) для определения последовательного перебора скоростей (\(aq0\(aq означал цикл 300-1200-150-110 бод; \(aq4\(aq предназначался для онлайн-консоли DECwriter), а оставшиеся символы содержали имя tty. Таким образом, обычная строка была «14console».

source: Later systems have more elaborate syntax. System V-like systems have I</etc/inittab> instead.
ru: В последующих системах синтаксис был ещё разнообразней. В системах, основанных на System V, использовался I</etc/inittab>.

source: Ancient history (2)
ru: Доисторические времена (2)

source: On the other hand, there is the file I</etc/utmp> listing the people currently logged in. It is maintained by B<login>(1). It has a fixed size, and the appropriate index in the file was determined by B<login>(1) using the B<ttyslot>() call to find the number of the line in I</etc/ttys> (counting from 1).
ru: С другой стороны, существовал файл I</etc/utmp>, в котором перечислены люди, вошедшие в систему. Этот файл управлялся с помощью B<login>(1). Он имел фиксированную длину, а соответствующий индекс в файле определялся B<login>(1) с помощью вызова B<ttyslot>() и нахождения номера строки в I</etc/ttys> (начиная с 1).

source: The semantics of ttyslot
ru: Семантика ttyslot

source: Thus, the function B<ttyslot>() returns the index of the controlling terminal of the calling process in the file I</etc/ttys>, and that is (usually) the same as the index of the entry for the current user in the file I</etc/utmp>. BSD still has the I</etc/ttys> file, but System V-like systems do not, and hence cannot refer to it. Thus, on such systems the documentation says that B<ttyslot>() returns the current user's index in the user accounting data base.
ru: Таким образом, функция B<ttyslot>() возвращает из файла I</etc/ttys> индекс управляющего терминала вызывающего процесса, который является таким же (обычно), что и индекс записи текущего пользователя в файле I</etc/utmp>. В BSD файл I</etc/ttys> все ещё был, однако в System V его уже не было, и из-за этого на него невозможно было ссылаться. Поэтому в подобных системах в документации указано, что B<ttyslot>() возвращает индекс текущего пользователя на основании базы данных пользователей.

source: If successful, this function returns the slot number. On error (e.g., if none of the file descriptors 0, 1 or 2 is associated with a terminal that occurs in this data base) it returns 0 on UNIX\ V6 and V7 and BSD-like systems, but -1 on System V-like systems.
ru: При успешном выполнении данная функция возвращает номер слота. В случает ошибки (то есть, когда ни один из файловых дескрипторов 0, 1 и 2 не связан с терминалом из базы данных) возвращается 0 (для систем UNIX\ V6, V7 и BSD) или -1 (для систем System\ V).

source: SUSv1; marked as LEGACY in SUSv2; removed in POSIX.1-2001. SUSv2 requires -1 on error.
ru: SUSv1; в SUSv2 отмечена как УСТАРЕВШАЯ; удалена в POSIX.1-2001. SUSv2 требует возврата -1 в случае ошибки.

source: The utmp file is found in various places on various systems, such as I</etc/utmp>, I</var/adm/utmp>, I</var/run/utmp>.
ru: Файл utmp в различных системах может находиться в различных местах: I</etc/utmp>, I</var/adm/utmp>, I</var/run/utmp>.

source: The glibc2 implementation of this function reads the file B<_PATH_TTYS>, defined in I<E<lt>ttyent.hE<gt>> as "/etc/ttys". It returns 0 on error. Since Linux systems do not usually have "/etc/ttys", it will always return 0.
ru: Реализация этой функции в glibc2 читает файл B<_PATH_TTYS>, определённый в I<E<lt>ttyent.hE<gt>> как «/etc/ttys». В случае ошибки она возвращает 0. Так как в системах Linux файла «/etc/ttys» обычно нет, то она всегда возвращает 0.

source: On BSD-like systems and Linux, the declaration of B<ttyslot>() is provided by I<E<lt>unistd.hE<gt>>. On System V-like systems, the declaration is provided by I<E<lt>stdlib.hE<gt>>. Since glibc 2.24, I<E<lt>stdlib.hE<gt>> also provides the declaration with the following feature test macro definitions:
ru: В BSD-подобных системах и Linux объявление B<ttyslot>() находится в файле I<E<lt>unistd.hE<gt>>. В System V-подобных системах объявление находится в файле I<E<lt>stdlib.hE<gt>>. Начиная с glibc 2.24 в I<E<lt>stdlib.hE<gt>> также поместили это объявление под следующий макрос тестирования свойств:

source: Minix also has I<fttyslot>(I<fd>).
ru: В Minix также есть I<fttyslot>(I<fd>).

source: timeradd, timersub, timercmp, timerclear, timerisset - timeval operations
ru: timeradd, timersub, timercmp, timerclear, timerisset - операции со структурой timeval

source: All functions shown above: Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: Все вышеперечисленные функции: начиная с glibc 2.19: _DEFAULT_SOURCE glibc 2.19 и старее: _BSD_SOURCE

source: The macros are provided to operate on I<timeval> structures, defined in I<E<lt>sys/time.hE<gt>> as:
ru: Макросы предназначены для работы со структурой I<timeval>, которая определена в I<E<lt>sys/time.hE<gt>> следующим образом:

source: struct timeval { time_t tv_sec; /* seconds */ suseconds_t tv_usec; /* microseconds */ };
ru: struct timeval { time_t tv_sec; /* секунды */ suseconds_t tv_usec; /* микросекунды */ };

source: B<timeradd>() adds the time values in I<a> and I<b>, and places the sum in the I<timeval> pointed to by I<res>. The result is normalized such that I<res-E<gt>tv_usec> has a value in the range 0 to 999,999.
ru: Макрос B<timeradd>() складывает значения времени I<a> и I<b>, и помещает сумму в I<timeval>, на которую указывает I<res>. Результат нормализуется так, что значение I<res-E<gt>tv_usec> лежит в диапазоне от 0 до 999999.

source: B<timersub>() subtracts the time value in I<b> from the time value in I<a>, and places the result in the I<timeval> pointed to by I<res>. The result is normalized such that I<res-E<gt>tv_usec> has a value in the range 0 to 999,999.
ru: Макрос B<timersub>() вычитает значение времени I<b> из I<a>, и помещает результат в I<timeval>, на которую указывает I<res>. Результат нормализуется так, что значение I<res-E<gt>tv_usec> лежит в диапазоне от 0 до 999999.

source: B<timerclear>() zeros out the I<timeval> structure pointed to by I<tvp>, so that it represents the Epoch: 1970-01-01 00:00:00 +0000 (UTC).
ru: Макрос B<timerclear>() обнуляет структуру I<timeval>, на которую указывает I<tvp>; полученное значение соответствует представлению эпохи: 1970-01-01 00:00:00 +0000 (UTC).

source: B<timerisset>() returns true (nonzero) if either field of the I<timeval> structure pointed to by I<tvp> contains a nonzero value.
ru: Макрос B<timerisset>() возвращает истину (не ноль), если любое из полей структуры I<timeval>, на которую указывает I<tvp>, содержит ненулевое значение.

source: B<timercmp>() compares the timer values in I<a> and I<b> using the comparison operator I<CMP>, and returns true (nonzero) or false (0) depending on the result of the comparison. Some systems (but not Linux/glibc), have a broken B<timercmp>() implementation, in which I<CMP> of I<E<gt>=>, I<E<lt>=>, and I<==> do not work; portable applications can instead use
ru: Макрос B<timercmp>() сравнивает значения таймера I<a> и I<b> с помощью оператора сравнения I<CMP>, и возвращает истину (не ноль) или ложь (0), в зависимости от результата сравнения. Некоторые системы (но не Linux/glibc) содержат некорректную реализацию B<timercmp>(), в которой I<CMP> для I<E<gt>=>, I<E<lt>=> и I<==> не работает; переносимые приложения могут использовать вместо неё

source: B<timerisset>() and B<timercmp>() return true (nonzero) or false (0).
ru: Макросы B<timerisset>() и B<timercmp>() возвращают истину (не ноль) или ложь (0).

source: No errors are defined.
ru: Ошибок не предполагается.

source: Not in POSIX.1. Present on most BSD derivatives.
ru: Не являются частью POSIX.1. Присутствует в вариациях BSD.

source: timegm, timelocal - inverses of gmtime and localtime
ru: timegm, timelocal - обратные gmtime и localtime функции

source: B<timelocal>(), B<timegm>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<timelocal>(), B<timegm>(): начиная с glibc 2.19: _DEFAULT_SOURCE glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: The functions B<timelocal>() and B<timegm>() are the inverses of B<localtime>(3) and B<gmtime>(3). Both functions take a broken-down time and convert it to calendar time (seconds since the Epoch, 1970-01-01 00:00:00 +0000, UTC). The difference between the two functions is that B<timelocal>() takes the local timezone into account when doing the conversion, while B<timegm>() takes the input value to be Coordinated Universal Time (UTC).
ru: B<timelocal>() и B<timegm>() являются обратными функциями по отношению к B<localtime>(3) и B<gmtime>(3). Обе функции принимают разделенное на составные части время и преобразуют его в календарное (измеряемое в секундах от начала Эпохи 1970-01-01 00:00:00 +0000, UTC). Различие между функциями заключается в том, что B<timelocal>() во время преобразования принимает во внимание локальный часовой пояс, когда как B<timegm>() во входном параметре использует Всемирное координированное время (Coordinated Universal Time, UTC).

source: On success, these functions return the calendar time (seconds since the Epoch), expressed as a value of type I<time_t>. On error, they return the value I<(time_t)\ -1> and set I<errno> to indicate the cause of the error.
ru: При успешном выполнении эти функции возвращают календарное время (количество секунд с начала эпохи), имеющее тип I<time_t>. При ошибке возвращается значение I<(time_t)\ -1>, а I<errno> присваивается код ошибки.

source: The result cannot be represented.
ru: Результат не может быть представлен.

source: These functions are nonstandard GNU extensions that are also present on the BSDs. Avoid their use.
ru: Данные функции являются нестандартными расширениями GNU, которые также присутствуют в BSD. Избегайте их использования.

source: The B<timelocal>() function is equivalent to the POSIX standard function B<mktime>(3). There is no reason to ever use it.
ru: Функция B<timelocal>() эквивалентна стандартной функции POSIX B<mktime>(3). Нет ни одной причины когда-либо её использовать.

source: towupper, towupper_l - convert a wide character to uppercase
ru: towupper, towupper_l - преобразует широкий символ к верхнему регистру

source: The B<towupper>() function is the wide-character equivalent of the B<toupper>(3) function. If I<wc> is a lowercase wide character, and there exists an uppercase equivalent in the current locale, it returns the uppercase equivalent of I<wc>. In all other cases, I<wc> is returned unchanged.
ru: Функция B<towupper>() является широкосимвольным аналогом функции B<toupper>(3). Если I<wc> является широким символом в нижнем регистре и в текущей локали существует эквивалент в верхнем регистре, то возвращается эквивалент I<wc> в верхнем регистре. Во всех остальных случаях I<wc> возвращается неизменным.

source: The B<towupper_l>() function performs the same task, but performs the conversion based on the character type information in the locale specified by I<locale>. The behavior of B<towupper_l>() is undefined if I<locale> is the special locale object B<LC_GLOBAL_LOCALE> (see B<duplocale>(3)) or is not a valid locale object handle.
ru: Функция B<towupper_l>() производит то же действие, но выполняет преобразование на основе информации о типе символа в локали, указанной в I<locale>. Поведение B<towupper_l>() не определёно, если значение I<locale> равно специальному объекту локали B<LC_GLOBAL_LOCALE> (смотрите B<duplocale>(3)) или некорректному описателю объекта локали.

source: If I<wc> was convertible to uppercase, B<towupper>() returns its uppercase equivalent; otherwise it returns I<wc>.
ru: Если I<wc> был преобразован к верхнему регистру, то B<towupper>() возвращает его эквивалент в верхнем регистре; в противном случае возвращается I<wc>.

source: The B<towupper_l>() function first appeared in glibc 2.3.
ru: Функция B<towupper_l>() впервые появилась в glibc 2.3.

source: B<towupper>(): C99, POSIX.1-2001 (XSI); present as an XSI extension in POSIX.1-2008, but marked obsolete.
ru: B<towupper>(): C99, POSIX.1-2001 (XSI); расширение XSI в POSIX.1-2008, но помечена как устаревшая.

source: tmpfile - create a temporary file
ru: tmpfile - создаёт временный файл

source: The B<tmpfile>() function opens a unique temporary file in binary read/write (w+b) mode. The file will be automatically deleted when it is closed or the program terminates.
ru: Функция B<tmpfile>() открывает уникальный временный файл в режиме чтения/записи (w+b). Файл будет автоматически удален, когда будет закрыт либо когда завершится программа.

source: The B<tmpfile>() function returns a stream descriptor, or NULL if a unique filename cannot be generated or the unique file cannot be opened. In the latter case, I<errno> is set to indicate the error.
ru: Функция B<tmpfile>() возвращает дескриптор потока или NULL, если не может сгенерировать уникальный файл или уникальный файл не может быть открыт. В последнем случае устанавливается I<errno> для индикации ошибки.

source: Search permission denied for directory in file's path prefix.
ru: Запрещен поиск для директории, содержащейся в пути файла.

source: Unable to generate a unique filename.
ru: Невозможно сгенерировать уникальное имя файла.

source: The call was interrupted by a signal; see B<signal>(7).
ru: Вызов был прерван каким-либо сигналом. Смотрите B<signal>(7).

source: There was no room in the directory to add the new filename.
ru: В директории не достаточно места, чтобы создать новое имя файла.

source: POSIX.1-2001 specifies: an error message may be written to I<stdout> if the stream cannot be opened.
ru: POSIX.1-2001 уточняет: сообщение с ошибкой может быть выведено в I<stdout>, если поток не может быть открыт.

source: The standard does not specify the directory that B<tmpfile>() will use. Glibc will try the path prefix I<P_tmpdir> defined in I<E<lt>stdio.hE<gt>>, and if that fails the directory I</tmp>.
ru: Стандартом не указывается, в какой директорию будет использовать B<tmpfile>(). Glibc попытается использовать префикс пути I<P_tmpdir>, указанный в I<E<lt>stdio.hE<gt>>, если это закончится неудачей, то - I</tmp>.

source: tzset, tzname, timezone, daylight - initialize time conversion information
ru: tzset, tzname, timezone, daylight - инициализирует информацию о преобразованиях времени

source: I<timezone>, I<daylight>: _XOPEN_SOURCE || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE
ru: I<timezone>, I<daylight>: _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версиях glibc E<lt>= 2.19: */ _SVID_SOURCE

source: The B<tzset>() function initializes the I<tzname> variable from the B<TZ> environment variable. This function is automatically called by the other time conversion functions that depend on the timezone. In a System-V-like environment, it will also set the variables I<timezone> (seconds West of UTC) and I<daylight> (to 0 if this timezone does not have any daylight saving time rules, or to nonzero if there is a time, past, present or future when daylight saving time applies).
ru: Функция B<tzset>() инициализирует переменную I<tzname> из значения переменной окружения B<TZ>. Данная функция автоматически вызывается другими функциями преобразования времени, которые зависят от часового пояса. В системах, совместимых с System V, она также устанавливает переменные I<timezone> (секунд западнее UTC) и I<daylight> (0, если в часовом поясе не используется переход на летнее время, в противном случае ненулевое значение, если есть времена в прошлом, настоящем или будущем, когда применялись правила перехода).

source: If the B<TZ> variable does not appear in the environment, the system timezone is used. The system timezone is configured by copying, or linking, a file in the B<tzfile>(5) format to I</etc/localtime>. A timezone database of these files may be located in the system timezone directory (see the B<FILES> section below).
ru: Если переменной B<TZ> в окружении не существует, то используется системный часовой пояс. Системный часовой пояс настраивается копированием или созданием ссылки на файл в формате B<tzfile>(5) в I</etc/localtime>. База данных часовых поясов с такими файлами может находиться в системном каталоге часовых поясов (смотрите далее раздел B<ФАЙЛЫ>).

source: If the B<TZ> variable does appear in the environment, but its value is empty, or its value cannot be interpreted using any of the formats specified below, then Coordinated Universal Time (UTC) is used.
ru: Если переменная B<TZ> в окружении существует, но имеет пустое значение или её величина не может быть представлена ни в одном из перечисленных ниже форматов, то используется UTC (Coordinated Universal Time, всемирное координированное время).

source: The value of B<TZ> can be one of two formats. The first format is a string of characters that directly represent the timezone to be used:
ru: Значение B<TZ> может быть представлено в одном из двух форматов. Первый формат — строка символов, которые явно описывают используемый часовой пояс:

source: There are no spaces in the specification. The I<std> string specifies an abbreviation for the timezone and must be three or more alphabetic characters. When enclosed between the less-than (E<lt>) and greater-than (E<gt>) signs, the characters set is expanded to include the plus (+) sign, the minus (-) sign, and digits. The I<offset> string immediately follows I<std> and specifies the time value to be added to the local time to get Coordinated Universal Time (UTC). The I<offset> is positive if the local timezone is west of the Prime Meridian and negative if it is east. The hour must be between 0 and 24, and the minutes and seconds 00 and 59:
ru: В спецификации нет пробелов. Строка I<std> определяет аббревиатуру часового пояса и должна содержать три или более символа алфавита. Если она заключена между знаками "меньше" (E<lt>) и "больше" (E<gt>), набор символов расширяется за счет добавления знаков "плюс" (+), "минус" (-) и цифр. Строка I<offset>, следующая непосредственно за I<std>, обозначает время, которое необходимо добавить к локальному, чтобы получить Всемирное координированное время (UTC). Значение I<offset> положительно, если локальный часовой пояс находится западнее Гринвичского меридиана, и отрицательна, если восточнее. Количество часов колеблется от 0 до 24, а минут и секунд — от 00 до 59:

source: [I<+>|I<->]I<hh>[I<:mm>[I<:ss>]]
ru: [I<+>|I<->]I<чч>[I<:мм>[I<:сс>]]

source: The I<dst> string and I<offset> specify the name and offset for the corresponding daylight saving timezone. If the offset is omitted, it defaults to one hour ahead of standard time.
ru: Пробелов быть не должно. Строки I<dst> и I<offset> задают название и смещение соответствующего часового пояса по летнему времени. Если I<offset> не указано, то по умолчанию используется значение на час больше поясного времени.

source: The I<start> field specifies when daylight saving time goes into effect and the I<end> field specifies when the change is made back to standard time. These fields may have the following formats:
ru: Полем I<start> определяется начало периода летнего времени, а полем I<end> определяется момент перехода обратно на поясное время. Эти поля могут быть представлены в следующих форматах:
