Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: Although B<tempnam>() generates names that are difficult to guess, it is nevertheless possible that between the time that B<tempnam>() returns a pathname, and the time that the program opens it, another program might create that pathname using B<open>(2), or create it as a symbolic link. This can lead to security holes. To avoid such possibilities, use the B<open>(2) B<O_EXCL> flag to open the pathname. Or better yet, use B<mkstemp>(3) or B<tmpfile>(3).
ru: Хотя B<tempnam>() генерирует имена, которые трудно подобрать, тем не менее, есть вероятность, что за промежуток времени, когда B<tempnam>() вернёт имя файла и программа откроет его, другая программа успеет создать такое же имя с помощью B<open>(2) или создать символическую ссылку, что может привести к проблемам безопасности. Чтобы исключить подобную вероятность, для открытия имени файла используйте B<open>(2) с флагом B<O_EXCL>. А ещё лучше \(em воспользуйтесь B<mkstemp>(3) или B<tmpfile>(3).

source: SUSv2 does not mention the use of B<TMPDIR>; glibc will use it only when the program is not set-user-ID. On SVr4, the directory used under B<d)> is I</tmp> (and this is what glibc does).
ru: В SUSv2 не упоминается использование B<TMPDIR>; в glibc она будет использоваться только в том случае, если у программы не установлен бит set-user-ID. В SVr4, используемый каталог для случая B<4.> \(em I</tmp> (как и для glibc).

source: Because it dynamically allocates memory used to return the pathname, B<tempnam>() is reentrant, and thus thread safe, unlike B<tmpnam>(3).
ru: Так как B<tempnam>() динамически выделяет память под возвращаемое имя файла, то она является реентерабельной и, следовательно, безопасной при использовании нитей (в отличие от B<tmpnam>(3)).

source: The B<tempnam>() function generates a different string each time it is called, up to B<TMP_MAX> (defined in I<E<lt>stdio.hE<gt>>) times. If it is called more than B<TMP_MAX> times, the behavior is implementation defined.
ru: Функция B<tempnam>() генерирует уникальное имя каждый раз, пока не достигнет предела B<TMP_MAX> (определённого в I<E<lt>stdio.hE<gt>>). Если она будет вызвана более чем B<TMP_MAX> раз, то дальнейшее поведение определяется конкретной реализацией.

source: B<tempnam>() uses at most the first five bytes from I<pfx>.
ru: B<tempnam>() использует по крайней мере первые пять байт из I<pfx>.

source: The glibc implementation of B<tempnam>() fails with the error B<EEXIST> upon failure to find a unique name.
ru: Реализация B<tempnam>() из glibc завершается ошибкой B<EEXIST>, если не сможет найти уникальное имя.

source: The precise meaning of "appropriate" is undefined; it is unspecified how accessibility of a directory is determined.
ru: Точного определения «целесообразности» не существует. Не определено, каким образом должна определяться доступность каталога.

source: tan, tanf, tanl - tangent function
ru: tan, tanf, tanl - функция тангенса

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версиях glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions return the tangent of I<x>, where I<x> is given in radians.
ru: Эти функции возвращают тангенс от I<x>, где I<x> указан в радианах.

source: On success, these functions return the tangent of I<x>.
ru: В случае успеха эти функции возвращают тангенс от I<x>.

source: If I<x> is a NaN, a NaN is returned.
ru: Если I<x> равно NaN, то будет возвращено NaN.

source: If I<x> is positive infinity or negative infinity, a domain error occurs, and a NaN is returned.
ru: Если I<x> стремится к плюс бесконечности или минус бесконечности, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If the correct result would overflow, a range error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively, with the mathematically correct sign.
ru: В случаях, когда корректный результат переполняется, возникает ошибка диапазона, а функции возвращают B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL> соответственно, с математически правильным знаком.

source: See B<math_error>(7) for information on how to determine whether an error has occurred when calling these functions.
ru: Смотрите B<math_error>(7), чтобы определить, какие ошибки могут возникать при вызове этих функций.

source: The following errors can occur:
ru: Могут возникать следующие ошибки:

source: Domain error: I<x> is an infinity
ru: Ошибка области: I<x> стремится к бесконечности

source: I<errno> is set to B<EDOM> (but see BUGS). An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: Значение I<errno> устанавливается в B<EDOM> (но см. ДЕФЕКТЫ). Возникает исключение неправильной плавающей запятой (B<FE_INVALID>).

source: Range error: result overflow
ru: Ошибка диапазона: результат превысил разрядность

source: An overflow floating-point exception (B<FE_OVERFLOW>) is raised.
ru: Вызывается исключение переполнения плавающей запятой (B<FE_OVERFLOW>).

source: The variant returning I<double> also conforms to SVr4, 4.3BSD, C89.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD, C89.

source: Before version 2.10, the glibc implementation did not set I<errno> to B<EDOM> when a domain error occurred.
ru: До версии 2.10 в реализации glibc при возникновении ошибки области I<errno> не устанавливалось в значение B<EDOM>.

source: towlower, towlower_l - convert a wide character to lowercase
ru: towlower, towlower_l - преобразует широкий символ к нижнему регистру

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: The B<towlower>() function is the wide-character equivalent of the B<tolower>(3) function. If I<wc> is an uppercase wide character, and there exists a lowercase equivalent in the current locale, it returns the lowercase equivalent of I<wc>. In all other cases, I<wc> is returned unchanged.
ru: Функция B<towlower>() является широкосимвольным аналогом функции B<tolower>(3). Если I<wc> является широким символом в верхнем регистре и в текущей локали существует эквивалент в нижнем регистре, то возвращается эквивалент I<wc> в нижнем регистре. Во всех остальных случаях I<wc> возвращается неизменным.

source: The B<towlower_l>() function performs the same task, but performs the conversion based on the character type information in the locale specified by I<locale>. The behavior of B<towlower_l>() is undefined if I<locale> is the special locale object B<LC_GLOBAL_LOCALE> (see B<duplocale>(3)) or is not a valid locale object handle.
ru: Функция B<towupper_l>() производит то же действие, но выполняет преобразование на основе информации о типе символа в локали, указанной в I<locale>. Поведение B<towupper_l>() не определёно, если значение I<locale> равно специальному объекту локали B<LC_GLOBAL_LOCALE> (смотрите B<duplocale>(3)) или некорректному описателю объекта локали.

source: The argument I<wc> must be representable as a I<wchar_t> and be a valid character in the locale or be the value B<WEOF>.
ru: Аргумент I<wc> должен быть представим типом I<wchar_t> и быть корректным символом в локали или равняться значению B<WEOF>.

source: If I<wc> was convertible to lowercase, B<towlower>() returns its lowercase equivalent; otherwise it returns I<wc>.
ru: Если I<wc> был преобразован к нижнему регистру, то B<towlower>() возвращает его эквивалент в нижнем регистре; в противном случае возвращается I<wc>.

source: The B<towlower_l>() function first appeared in glibc 2.3.
ru: Функция B<towlower_l>() впервые появилась в glibc 2.3.

source: B<towlower>(): C99, POSIX.1-2001 (XSI); present as an XSI extension in POSIX.1-2008, but marked obsolete.
ru: B<towlower>(): C99, POSIX.1-2001 (XSI); расширение XSI в POSIX.1-2008, но помечена как устаревшая.

source: The behavior of these functions depends on the B<LC_CTYPE> category of the locale.
ru: Поведение этих функций зависит от категории B<LC_CTYPE> локали.

source: These functions are not very appropriate for dealing with Unicode characters, because Unicode knows about three cases: upper, lower and title case.
ru: Эти функции не очень подходят для работы с символами Юникода, так как в Юникоде есть три типа регистра: верхний, нижний и заглавный.

source: tsearch, tfind, tdelete, twalk, tdestroy - manage a binary search tree
ru: tsearch, tfind, tdelete, twalk, tdestroy - работа с двоичным деревом поиска

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>search.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>search.hE<gt>>

source: B<tsearch>(), B<tfind>(), B<twalk>(), and B<tdelete>() manage a binary search tree. They are generalized from Knuth (6.2.2) Algorithm T. The first field in each node of the tree is a pointer to the corresponding data item. (The calling program must store the actual data.) I<compar> points to a comparison routine, which takes pointers to two items. It should return an integer which is negative, zero, or positive, depending on whether the first item is less than, equal to, or greater than the second.
ru: Функции B<tsearch>(), B<tfind>(), B<twalk>() и B<tdelete>() позволяют работать с двоичным деревом поиска. Они реализуют «Algorithm T» Д. Кнута (6.2.2). Первое поле в каждом узле дерева является указателем на соответствующий элемент данных (вызывающая программа должна хранить реальные данные). Аргумент I<compar> указывает на процедуру сравнения, которой передаются указатели на два элемента данных. Эта процедура должна возвращать отрицательное, нулевое или положительное значение, если первый элемент меньше, равен или больше чем второй.

source: B<tsearch>() searches the tree for an item. I<key> points to the item to be searched for. I<rootp> points to a variable which points to the root of the tree. If the tree is empty, then the variable that I<rootp> points to should be set to NULL. If the item is found in the tree, then B<tsearch>() returns a pointer to the corresponding tree node. (In other words, B<tsearch>() returns a pointer to a pointer to the data item.) If the item is not found, then B<tsearch>() adds it, and returns a pointer to the corresponding tree node.
ru: Функция B<tsearch>() ищет элемент в дереве. В I<key> задаётся разыскиваемый элемент. В I<rootp> указывает на переменную, указывающую на корень дерева. Если дерево пустое, то переменная, на которую ссылается I<rootp>, должна быть равна NULL. Если элемент найден, то B<tsearch>() возвращает указатель на соответствующий узел дерева (иначе говоря, B<tsearch>() возвращает указатель на элемент данных). Если элемент не найден, то B<tsearch>() добавляет его и возвращает указатель на соответствующий узел дерева.

source: B<tfind>() is like B<tsearch>(), except that if the item is not found, then B<tfind>() returns NULL.
ru: Функция B<tfind>() похожа на B<tsearch>(), за исключением того, что B<tfind>() в случае нулевого результата поиска возвращает NULL.

source: B<tdelete>() deletes an item from the tree. Its arguments are the same as for B<tsearch>().
ru: Функция B<tdelete>() удаляет элемент из дерева. Аргументы те же, что и для B<tsearch>().

source: B<twalk>() performs depth-first, left-to-right traversal of a binary tree. I<root> points to the starting node for the traversal. If that node is not the root, then only part of the tree will be visited. B<twalk>() calls the user function I<action> each time a node is visited (that is, three times for an internal node, and once for a leaf). I<action>, in turn, takes three arguments. The first argument is a pointer to the node being visited. The structure of the node is unspecified, but it is possible to cast the pointer to a pointer-to-pointer-to-element in order to access the element stored within the node. The application must not modify the structure pointed to by this argument. The second argument is an integer which takes one of the values B<preorder>, B<postorder>, or B<endorder> depending on whether this is the first, second, or third visit to the internal node, or the value B<leaf> if this is the single visit to a leaf node. (These symbols are defined in I<E<lt>search.hE<gt>>.) The third argument is the depth of the node; the root node has depth zero.
ru: Функция B<twalk>() выполняет обход дерева, сначала в глубину, затем слева направо. Аргумент I<root> указывает на начальный элемент обхода. Если этот узел не является корневым, то будет пройдена только часть дерева. Функция B<twalk> вызывает пользовательскую функцию I<action> для каждого посещаемого узла (то есть три раза для внутреннего узла и один раз для конечного узла-листа). Функция I<action> получает три аргумента. Первый — указатель на посещаемый узел. Структура узла не определена, но возможно привести указатель к указателю на указатель на элемент, чтобы получить доступ к элементу, хранящемуся внутри узла. Приложение не должно изменять структуру, на которую указывает этот аргумент. Второй — целое число, принимающее значение B<preorder>, B<postorder> или B<endorder> в зависимости от того, в первый, второй или третий раз посещается внутренний узел, или значение I<leaf>, если это единственный просмотр узла-листа. Эти символы определены в I<E<lt>search.hE<gt>>. Третий аргумент — это глубина текущего погружения в дерево; для корня она равна нулю.

source: (More commonly, B<preorder>, B<postorder>, and B<endorder> are known as B<preorder>, B<inorder>, and B<postorder>: before visiting the children, after the first and before the second, and after visiting the children. Thus, the choice of name B<post\%order> is rather confusing.)
ru: (В общем случае, функции B<preorder>, B<postorder> и B<endorder> известны как B<preorder>, B<inorder> и B<postorder>: перед посещением потомков, после первого посещения и перед вторым и после посещения. Таким образом, выбор имени B<post\%order> приводит к путанице.)

source: B<tdestroy>() removes the whole tree pointed to by I<root>, freeing all resources allocated by the B<tsearch>() function. For the data in each tree node the function I<free_node> is called. The pointer to the data is passed as the argument to the function. If no such work is necessary, I<free_node> must point to a function doing nothing.
ru: Функция B<tdestroy>() удаляет всё дерево, на которое указывает I<rootp>, высвобождая все ресурсы, выделенные функцией B<tsearch>(). Для данных каждого узла дерева вызывается функция I<free_node>. Указатель на данные передаётся в аргумент функции. Если делать ничего не нужно, то в I<free_node> нужно указать функцию, которая ничего не делает.

source: B<tsearch>() returns a pointer to a matching node in the tree, or to the newly added node, or NULL if there was insufficient memory to add the item. B<tfind>() returns a pointer to the node, or NULL if no match is found. If there are multiple items that match the key, the item whose node is returned is unspecified.
ru: Функция B<tsearch>() возвращает указатель на найденный узел дерева или добавляет новый узел, а также возвращает NULL, если для добавления недостаточно памяти. Функция B<tfind>() возвращает указатель на узел или NULL, если совпадений не найдено. Если есть несколько элементов с одинаковым ключом, то какой из них будет возвращён — не определено.

source: B<tdelete>() returns a pointer to the parent of the node deleted, or NULL if the item was not found. If the deleted node was the root node, B<tdelete>() returns a dangling pointer that must not be accessed.
ru: Функция B<tdelete>() возвращает указатель на родителя удалённого узла или NULL, если элемент не найден. Если удалённый узел был корневым узлом, то B<tdelete>() возвращает повисшую ссылку, по которой нельзя обращаться.

source: B<tsearch>(), B<tfind>(), and B<tdelete>() also return NULL if I<rootp> was NULL on entry.
ru: Функции B<tsearch>(), B<tfind>() и B<tdelete>() также возвращают NULL, если I<rootp> для записи был равен NULL.

source: POSIX.1-2001, POSIX.1-2008, SVr4. The function B<tdestroy>() is a GNU extension.
ru: POSIX.1-2001, POSIX.1-2008, SVr4. Функция B<tdestroy>() является расширением GNU.

source: B<twalk>() takes a pointer to the root, while the other functions take a pointer to a variable which points to the root.
ru: Функции B<twalk>() передаётся указатель на корень, а остальные функции ожидают указатель на переменную, которая указывает на корень.

source: B<tdelete>() frees the memory required for the node in the tree. The user is responsible for freeing the memory for the corresponding data.
ru: Функция B<tdelete>() освобождает память, которая необходима для хранения элемента в дереве. Пользователь отвечает за освобождение памяти, использованной для хранения соответствующих данных.

source: The example program depends on the fact that B<twalk>() makes no further reference to a node after calling the user function with argument "endorder" or "leaf". This works with the GNU library implementation, but is not in the System V documentation.
ru: Программа в примере зависит от того, что B<twalk>() больше не ссылается на узел после вызова пользовательской функции с аргументом «endorder» или «leaf». Это работает с реализацией библиотеки GNU, но этого нет в документации System V.

source: The following program inserts twelve random numbers into a binary tree, where duplicate numbers are collapsed, then prints the numbers in order.
ru: Приведённая ниже программа вставляет двенадцать случайных чисел в двоичное дерево, в котором повторяющиеся числа удаляются, а затем печатает их по порядку.

source: #define _GNU_SOURCE /* Expose declaration of tdestroy() */ #include E<lt>search.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>time.hE<gt>
ru: #define _GNU_SOURCE /* для объявления tdestroy() */ #include E<lt>search.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>time.hE<gt>

source: static void * xmalloc(unsigned n) { void *p; p = malloc(n); if (p) return p; fprintf(stderr, "insufficient memory\en"); exit(EXIT_FAILURE); }
ru: static void * xmalloc(unsigned n) { void *p; p = malloc(n); if (p) return p; fprintf(stderr, "недостаточно памяти\en"); exit(EXIT_FAILURE); }

source: toupper, tolower, toupper_l, tolower_l - convert uppercase or lowercase
ru: toupper, tolower, toupper_l, tolower_l - преобразуют регистр символов

source: These functions convert lowercase letters to uppercase, and vice versa.
ru: Эти функции преобразуют строчные символы в заглавные и наоборот.

source: If I<c> is a lowercase letter, B<toupper>() returns its uppercase equivalent, if an uppercase representation exists in the current locale. Otherwise, it returns I<c>. The B<toupper_l>() function performs the same task, but uses the locale referred to by the locale handle I<locale>.
ru: Если I<c> — строчная буква, то B<toupper>() возвращает её заглавный эквивалент, если он есть в текущей локали. В противном случае возвращается I<c>. Функция B<toupper_l>() выполняет ту же задачу, но использует локаль, на которую ссылается описатель локали I<locale>.

source: If I<c> is an uppercase letter, B<tolower>() returns its lowercase equivalent, if a lowercase representation exists in the current locale. Otherwise, it returns I<c>. The B<tolower_l>() function performs the same task, but uses the locale referred to by the locale handle I<locale>.
ru: Если I<c> — заглавная буква, то B<tolower>() возвращает её строчный эквивалент, если он есть в текущей локали. В противном случае возвращается I<c>. Функция B<tolower_l>() выполняет ту же задачу, но использует локаль, на которую ссылается описатель локали I<locale>.

source: If I<c> is neither an I<unsigned char> value nor B<EOF>, the behavior of these functions is undefined.
ru: Если I<c> имеет значение не типа I<unsigned char> или не равно B<EOF>, то поведение этих функций не определено.

source: The behavior of B<toupper_l>() and B<tolower_l>() is undefined if I<locale> is the special locale object B<LC_GLOBAL_LOCALE> (see B<duplocale>(3)) or is not a valid locale object handle.
ru: Поведение B<toupper_l>() и B<tolower_l>() не определено, если значение I<locale> равно специальному объекту локали B<LC_GLOBAL_LOCALE> (смотрите B<duplocale>(3)) или некорректному описателю объекта локали.

source: The value returned is that of the converted letter, or I<c> if the conversion was not possible.
ru: Возвращаемым значением является преобразованная буква или I<c>, если преобразование невозможно.

source: The standards require that the argument I<c> for these functions is either B<EOF> or a value that is representable in the type I<unsigned char>. If the argument I<c> is of type I<char>, it must be cast to I<unsigned char>, as in the following example:
ru: Стандартами требуется, что аргумент I<c> этих функций равнялся B<EOF> или значению, которое представимо типом I<unsigned char>. Если аргумент I<c> имеет тип I<char>, то он должен приводиться к I<unsigned char> как в следующем примере:

source: This is necessary because I<char> may be the equivalent I<signed char>, in which case a byte where the top bit is set would be sign extended when converting to I<int>, yielding a value that is outside the range of I<unsigned char>.
ru: Это необходимо, так как I<char> может быть эквивалентен I<signed char>, и если у байта установлен старший знаковый бит, то он учитывается при приведении к I<int> и байт превращается в значение, выходящее за границу I<unsigned char>.

source: The details of what constitutes an uppercase or lowercase letter depend on the locale. For example, the default B<"C"> locale does not know about umlauts, so no conversion is done for them.
ru: Особенности подстановки строчных и прописных букв зависят от локали. Например, в локали по умолчанию B<"C"> ничего не сказано про умляуты, поэтому они не преобразовываются.

source: In some non-English locales, there are lowercase letters with no corresponding uppercase equivalent; the German sharp s is one example.
ru: В некоторых не английских локалях существуют строчные буквы без заглавного аналога; например немецкая sharp.

source: toascii - convert character to ASCII
ru: toascii - преобразует символ в код ASCII

source: B<toascii>(): _XOPEN_SOURCE || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: B<toascii>(): _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версиях glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: B<toascii>() converts I<c> to a 7-bit I<unsigned char> value that fits into the ASCII character set, by clearing the high-order bits.
ru: B<toascii>() преобразует I<c> в 7-битное значение типа I<unsigned char>, которое включено в набор символов ASCII, очищая при этом старшие биты.

source: The value returned is that of the converted character.
ru: Возвращаемое значение \(em преобразованный символ.

source: SVr4, BSD, POSIX.1-2001. POSIX.1-2008 marks B<toascii>() as obsolete, noting that it cannot be used portably in a localized application.
ru: SVr4, BSD, POSIX.1-2001. В POSIX.1-2008 B<toascii>() отмечена устаревшей с примечанием, что её нельзя использовать в локализованных приложениях.

source: Many people will be unhappy if you use this function. This function will convert accented letters into random characters.
ru: Многие люди станут несчастными, если вы воспользуетесь этой функцией. Данная функция преобразует все символы с диакритическими знаками в случайные символы.

source: trunc, truncf, truncl - round to integer, toward zero
ru: trunc, truncf, truncl - округление числа до целого в меньшую сторону
