Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: I<tms> points outside the process's address space.
ru: Значение I<tms> указывает за пределы адресного пространства процесса.

source: The number of clock ticks per second can be obtained using:
ru: Количество тиков часов в секунду можно получить с помощью:

source: In POSIX.1-1996 the symbol B<CLK_TCK> (defined in I<E<lt>time.hE<gt>>) is mentioned as obsolescent. It is obsolete now.
ru: В POSIX.1-1996 символ B<CLK_TCK> (определённый в I<E<lt>time.hE<gt>>) упомянут как устаревающий. В настоящее время он точно устарел.

source: In Linux kernel versions before 2.6.9, if the disposition of B<SIGCHLD> is set to B<SIG_IGN>, then the times of terminated children are automatically included in the I<tms_cstime> and I<tms_cutime> fields, although POSIX.1-2001 says that this should happen only if the calling process B<wait>(2)s on its children. This nonconformance is rectified in Linux 2.6.9 and later.
ru: В ядрах Linux до версии 2.6.9, если обработчик B<SIGCHLD> равен B<SIG_IGN>, то времена завершившихся потомков автоматически включаются в поля I<tms_cstime> и I<tms_cutime>, хотя в POSIX.1-2001 сказано, что это должно происходить только, если вызвавший процесс вызывал B<wait>(2) для своих потомков. Это несоответствие устранено в Linux 2.6.9 и более новых.

source: On Linux, the I<buf> argument can be specified as NULL, with the result that B<times>() just returns a function result. However, POSIX does not specify this behavior, and most other UNIX implementations require a non-NULL value for I<buf>.
ru: В Linux значение аргумента I<buf> может быть равно NULL. В этом случае B<times>() просто возвращает результат функции. Однако в POSIX не описано такое поведение, и для большинства других реализаций UNIX требуется не равное NULL значение I<buf>.

source: Note that B<clock>(3) also returns a value of type I<clock_t>, but this value is measured in units of B<CLOCKS_PER_SEC>, not the clock ticks used by B<times>().
ru: Заметим, что B<clock>(3) также возвращает значение типа I<clock_t>, но это значение измеряется в единицах B<CLOCKS_PER_SEC>, а не в тиках часов как у B<times>().

source: On Linux, the "arbitrary point in the past" from which the return value of B<times>() is measured has varied across kernel versions. On Linux 2.4 and earlier, this point is the moment the system was booted. Since Linux 2.6, this point is I<(2^32/HZ) - 300> seconds before system boot time. This variability across kernel versions (and across UNIX implementations), combined with the fact that the returned value may overflow the range of I<clock_t>, means that a portable application would be wise to avoid using this value. To measure changes in elapsed time, use B<clock_gettime>(2) instead.
ru: «Произвольная точка в прошлом», от которой отсчитывается возвращаемое значение B<times>(), измеряется в разных в версиях ядра Linux по-разному. В Linux 2.4 и старее этой точкой является момент загрузки системы. Начиная с Linux 2.6 эта точка равна I<(2^32/HZ) - 300> секунд до времени загрузки системы. Из-за переменчивости в разных версиях ядер (и в реализациях UNIX) и с учётом того, что возвращаемое значение может выйти за пределы диапазона I<clock_t>, в переносимом приложении не следует использовать это значение. Для подсчёта прошедшего времени используйте B<clock_gettime>(2).

source: Historical
ru: Историческая справка

source: SVr1-3 returns I<long> and the struct members are of type I<time_t> although they store clock ticks, not seconds since the Epoch. V7 used I<long> for the struct members, because it had no type I<time_t> yet.
ru: В SVr1-3 результат имеет тип I<long> и члены структуры имеют тип I<time_t>, хотя они хранят тики часов, а не секунды начиная с Эпохи. В V7 используется I<long> для членов структуры, так как тип I<time_t> ещё не существовал.

source: A limitation of the Linux system call conventions on some architectures (notably i386) means that on Linux 2.6 there is a small time window (41 seconds) soon after boot when B<times>() can return -1, falsely indicating that an error occurred. The same problem can occur when the return value wraps past the maximum value that can be stored in B<clock_t>.
ru: Ограничение Linux в соглашениях системного вызова на некоторых архитектурах (в частности i386) приводит к тому, что в Linux 2.6 есть маленький временной интервал (41 секунда), в котором сразу после загрузки B<times>() может вернуть -1, ложно указывая на существование ошибки. Такая же проблема может возникнуть, когда возвращаемое значение становится больше максимального значения типа B<clock_t>.

source: truncate, ftruncate - truncate a file to a specified length
ru: truncate, ftruncate - обрезает файл до заданного размера

source: || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: || /* начиная с glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* в версиях glibc E<lt>= 2.19: */ _BSD_SOURCE

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.3.5: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.3.5: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* в версиях glibc E<lt>= 2.19: */ _BSD_SOURCE

source: The B<truncate>() and B<ftruncate>() functions cause the regular file named by I<path> or referenced by I<fd> to be truncated to a size of precisely I<length> bytes.
ru: Функции B<truncate>() и B<ftruncate>() обрезают обычный файл, указанный по имени I<path> или ссылке I<fd>, до размера, указанного в I<length> (в байтах).

source: If the file previously was larger than this size, the extra data is lost. If the file previously was shorter, it is extended, and the extended part reads as null bytes (\(aq\e0\(aq).
ru: Если до этого файл был больше указанного размера, все лишние данные будут утеряны. Если файл был меньше, он будет увеличен, а дополнительная часть будет заполнена нулевыми байтами («\e0»).

source: The file offset is not changed.
ru: Смещение файла не изменяется.

source: If the size changed, then the st_ctime and st_mtime fields (respectively, time of last status change and time of last modification; see B<inode>(7)) for the file are updated, and the set-user-ID and set-group-ID mode bits may be cleared.
ru: Если размер изменился, поля st_ctime и st_mtime (время последнего изменения состояния и время последнего изменения, соответственно; смотрите B<inode>(7)) файла будут обновлены, а биты режимов set-user-ID и set-group-ID могут быть сброшены.

source: With B<ftruncate>(), the file must be open for writing; with B<truncate>(), the file must be writable.
ru: Для B<ftruncate>() файл должен быть открыт на запись; для B<truncate>() файл должен быть доступен на запись.

source: For B<truncate>():
ru: Для B<truncate>():

source: Search permission is denied for a component of the path prefix, or the named file is not writable by the user. (See also B<path_resolution>(7).)
ru: В одном из каталогов префикса не разрешен поиск, либо указанный файл не доступен на запись для пользователя (смотрите также B<path_resolution>(7)).

source: The argument I<path> points outside the process's allocated address space.
ru: Значение I<path> указывает за пределы адресного пространства, выделенного процессу.

source: The argument I<length> is larger than the maximum file size. (XSI)
ru: Аргумент I<length> больше максимально допустимого размера файла (XSI).

source: While blocked waiting to complete, the call was interrupted by a signal handler; see B<fcntl>(2) and B<signal>(7).
ru: При блокирующем ожидании завершения вызов был прерван обработчиком сигналов; смотрите B<fcntl>(2) и B<signal>(7).

source: The argument I<length> is negative or larger than the maximum file size.
ru: Аргумент I<length> является отрицательным или больше максимально допустимого размера файла.

source: An I/O error occurred updating the inode.
ru: Во время обновления индексного дескриптора (inode) возникла ошибка ввода/вывода.

source: The named file is a directory.
ru: Указанный файл является каталогом.

source: Too many symbolic links were encountered in translating the pathname.
ru: Во время определения pathname встретилось слишком много символьных ссылок.

source: A component of a pathname exceeded 255 characters, or an entire pathname exceeded 1023 characters.
ru: Компонент имени пути содержит более 255 символов, или весь путь содержит более 1023 символов.

source: The named file does not exist.
ru: Указанный файл не существует.

source: A component of the path prefix is not a directory.
ru: Компонент в префиксе пути не является каталогом.

source: The underlying filesystem does not support extending a file beyond its current size.
ru: Используемая файловая система не поддерживает расширение файла больше его текущего размера.

source: The operation was prevented by a file seal; see B<fcntl>(2).
ru: Выполнение операции предотвращено опечатыванием (file seal); смотрите B<fcntl>(2).

source: The named file resides on a read-only filesystem.
ru: Указанный файл находится на файловой системе, смонтированной только для чтения.

source: The file is an executable file that is being executed.
ru: Файл является исполняемым файлом, который в данный момент исполняется.

source: For B<ftruncate>() the same errors apply, but instead of things that can be wrong with I<path>, we now have things that can be wrong with the file descriptor, I<fd>:
ru: Для B<ftruncate>() действуют те же ошибки, за исключением того, что вместо ошибок, связанных с неправильным I<path>, появляются ошибки, связанные с файловым дескриптором I<fd>:

source: I<fd> is not a valid file descriptor.
ru: Значение I<fd> не является правильным файловым дескриптором.

source: B<EBADF> or B<EINVAL>
ru: B<EBADF> или B<EINVAL>

source: I<fd> is not open for writing.
ru: Дескриптор I<fd> не открыт для записи.

source: I<fd> does not reference a regular file or a POSIX shared memory object.
ru: Дескриптор I<fd> не указывает на обычный файл или объект общей памяти POSIX.

source: B<EINVAL> or B<EBADF>
ru: B<EINVAL> или B<EBADF>

source: The file descriptor I<fd> is not open for writing. POSIX permits, and portable applications should handle, either error for this case. (Linux produces B<EINVAL>.)
ru: Файловый дескриптор I<fd> не открыт на запись. В POSIX это допускается и переносимые приложения должны обрабатывать любую ошибку для этого случая (Linux возвращает B<EINVAL>).

source: POSIX.1-2001, POSIX.1-2008, 4.4BSD, SVr4 (these calls first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, 4.4BSD, SVr4 (данные вызовы впервые появились в 4.2BSD).

source: B<ftruncate>() can also be used to set the size of a POSIX shared memory object; see B<shm_open>(7).
ru: Вызов B<ftruncate>() также может использоваться для установки размера объекта общей памяти POSIX; смотрите B<shm_open>(7).

source: The details in DESCRIPTION are for XSI-compliant systems. For non-XSI-compliant systems, the POSIX standard allows two behaviors for B<ftruncate>() when I<length> exceeds the file length (note that B<truncate>() is not specified at all in such an environment): either returning an error, or extending the file. Like most UNIX implementations, Linux follows the XSI requirement when dealing with native filesystems. However, some nonnative filesystems do not permit B<truncate>() and B<ftruncate>() to be used to extend a file beyond its current length: a notable example on Linux is VFAT.
ru: В ОПИСАНИИ приведена информация для XSI-совместимых систем. Для не XSI-совместимых систем в стандарте POSIX описано два поведения B<ftruncate>(), когда I<length> превышает длину файла (заметим, что B<truncate>() не обязательно быть во всех таких окружениях): или вернуть ошибку, или расширить файл. Подобно большинству реализаций UNIX, Linux соответствует требованию XSI, когда работает с родными файловыми системами. Однако, в некоторых неродных файловых системах не разрешается использовать B<truncate>() и B<ftruncate>() для расширения файла больше его текущей длины: например, в Linux это касается VFAT.

source: The original Linux B<truncate>() and B<ftruncate>() system calls were not designed to handle large file offsets. Consequently, Linux 2.4 added B<truncate64>() and B<ftruncate64>() system calls that handle large files. However, these details can be ignored by applications using glibc, whose wrapper functions transparently employ the more recent system calls where they are available.
ru: Первоначальные версии системных вызовов B<truncate>() и B<ftruncate>() в Linux не умели работать с большими файловыми смещениями. Позднее, в Linux 2.4 были добавлены системные вызовы B<truncate64>() и B<ftruncate64>() для работы с большими файлами. Однако это различие может игнорироваться приложениями, которые используют glibc, так как имеющиеся в ней обёрточные функции самостоятельно задействуют более новый системный вызов, если он доступен.

source: On some 32-bit architectures, the calling signature for these system calls differ, for the reasons described in B<syscall>(2).
ru: На некоторых 32-битных архитектурах интерфейс этих системных вызовов отличается от описанного выше по причинам, указанным в B<syscall>(2).

source: A header file bug in glibc 2.12 meant that the minimum value of B<_POSIX_C_SOURCE> required to expose the declaration of B<ftruncate>() was 200809L instead of 200112L. This has been fixed in later glibc versions.
ru: Из-за ошибки в заголовочном файле glibc 2.12 минимальное значение B<_POSIX_C_SOURCE>, требуемое для объявления декларации B<ftruncate>(), было равно 200809L вместо 200112L. В последующих версиях glibc эта ошибка была исправлена.

source: timer_delete - delete a POSIX per-process timer
ru: timer_delete - удаляет таймер POSIX определённого процесса

source: B<timer_delete>() deletes the timer whose ID is given in I<timerid>. If the timer was armed at the time of this call, it is disarmed before being deleted. The treatment of any pending signal generated by the deleted timer is unspecified.
ru: Вызов B<timer_delete>() удаляет таймер, чей ID указан в I<timerid>. Если таймер на момент этого вызовы был установлен, то он сбрасывается перед удалением. Как поступать с любым ожидающим сигналом, сгенерированным удалённым таймером, стандартами не определено.

source: On success, B<timer_delete>() returns 0. On failure, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<timer_delete>() возвращается 0. При ошибке возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: timerfd_create, timerfd_settime, timerfd_gettime - timers that notify via file descriptors
ru: timerfd_create, timerfd_settime, timerfd_gettime - таймеры, уведомляющие через файловые дескрипторы

source: These system calls create and operate on a timer that delivers timer expiration notifications via a file descriptor. They provide an alternative to the use of B<setitimer>(2) or B<timer_create>(2), with the advantage that the file descriptor may be monitored by B<select>(2), B<poll>(2), and B<epoll>(7).
ru: Эти системные вызовы создают и работают с таймером, доставляя уведомления о срабатывании через файловый дескриптор. Они предоставляют альтернативу B<setitimer>(2) или B<timer_create>(2); их преимущество в том, что за файловым дескриптором можно следить с помощью B<select>(2), B<poll>(2) и B<epoll>(7).

source: The use of these three system calls is analogous to the use of B<timer_create>(2), B<timer_settime>(2), and B<timer_gettime>(2). (There is no analog of B<timer_getoverrun>(2), since that functionality is provided by B<read>(2), as described below.)
ru: Использование данных трёх системных вызовов аналогично B<timer_create>(2), B<timer_settime>(2) и B<timer_gettime>(2) (аналога B<timer_getoverrun>(2) нет, так как его возможности предоставляет B<read>(2) как описано ниже).

source: B<timerfd_create>() creates a new timer object, and returns a file descriptor that refers to that timer. The I<clockid> argument specifies the clock that is used to mark the progress of the timer, and must be one of the following:
ru: Вызов B<timerfd_create>() создаёт новый объект таймера и возвращает файловый дескриптор, который ссылается на этот таймер. В аргументе I<clockid> задаются часы, которые используются для хода таймера; значением должно быть одно из следующих:

source: B<CLOCK_BOOTTIME> (Since Linux 3.15)
ru: B<CLOCK_BOOTTIME> (начиная с Linux 3.15)

source: B<CLOCK_REALTIME_ALARM> (since Linux 3.11)
ru: B<CLOCK_REALTIME_ALARM> (начиная с Linux 3.11)

source: B<CLOCK_BOOTTIME_ALARM> (since Linux 3.11)
ru: B<CLOCK_BOOTTIME_ALARM> (начиная с Linux 3.11)

source: The current value of each of these clocks can be retrieved using B<clock_gettime>(2).
ru: Текущее значение каждого из этих часов можно получить с помощью B<clock_gettime>(2).

source: Starting with Linux 2.6.27, the following values may be bitwise ORed in I<flags> to change the behavior of B<timerfd_create>():
ru: Начиная с Linux 2.6.27, для изменения поведения B<timerfd_create>() можно использовать следующие значения I<flags> (через OR):

source: Set the B<O_NONBLOCK> file status flag on the open file description (see B<open>(2)) referred to by the new file descriptor. Using this flag saves extra calls to B<fcntl>(2) to achieve the same result.
ru: Устанавливает флаг состояния файла B<O_NONBLOCK> для нового открытого файлового описания (смотрите B<open>(2)), на которое ссылается новый файловый дескриптор. Использование данного флага делает ненужными дополнительные вызовы B<fcntl>(2) для достижения того же результата.

source: Set the close-on-exec (B<FD_CLOEXEC>) flag on the new file descriptor. See the description of the B<O_CLOEXEC> flag in B<open>(2) for reasons why this may be useful.
ru: Устанавливает флаг close-on-exec (B<FD_CLOEXEC>) для нового открытого файлового дескриптора. Смотрите описание флага B<O_CLOEXEC> в B<open>(2) для того, чтобы узнать как это может пригодиться.

source: In Linux versions up to and including 2.6.26, I<flags> must be specified as zero.
ru: До Linux 2.6.26 включительно аргумент I<flags> должен быть равен нулю.

source: B<timerfd_settime>() arms (starts) or disarms (stops) the timer referred to by the file descriptor I<fd>.
ru: Вызов B<timerfd_settime>() запускает или останавливает таймер, на который ссылается файловый дескриптор I<fd>.

source: The I<new_value> argument specifies the initial expiration and interval for the timer. The I<itimerspec> structure used for this argument contains two fields, each of which is in turn a structure of type I<timespec>:
ru: В аргументе I<new_value> задаётся начальное срабатывание и интервал таймера. Для этого аргумента используется структура I<itimerspec>, содержащая два поля, каждое из которых, в свою очередь, является структурой I<timespec>:

source: struct itimerspec { struct timespec it_interval; /* Interval for periodic timer */ struct timespec it_value; /* Initial expiration */ };
ru: struct itimerspec { struct timespec it_interval; /* интервал для периодического таймера */ struct timespec it_value; /* первое срабатывание */ };

source: I<new_value.it_value> specifies the initial expiration of the timer, in seconds and nanoseconds. Setting either field of I<new_value.it_value> to a nonzero value arms the timer. Setting both fields of I<new_value.it_value> to zero disarms the timer.
ru: В I<new_value.it_value> задаётся первое срабатывание таймера, в секундах и наносекундах. Установка любого из полей I<new_value.it_value> в ненулевое значение включает таймер. Установка обоих полей I<new_value.it_value> в ноль выключает таймер.

source: Setting one or both fields of I<new_value.it_interval> to nonzero values specifies the period, in seconds and nanoseconds, for repeated timer expirations after the initial expiration. If both fields of I<new_value.it_interval> are zero, the timer expires just once, at the time specified by I<new_value.it_value>.
ru: Установка одного или обоих полей I<new_value.it_interval> в ненулевое значение задаёт период, в секундах и наносекундах, периодического срабатывания таймера после первого срабатывания. Если оба поля I<new_value.it_interval> равны нулю, то таймер срабатывает только один раз, во время, указанное в I<new_value.it_value>.

source: By default, the initial expiration time specified in I<new_value> is interpreted relative to the current time on the timer's clock at the time of the call (i.e., I<new_value.it_value> specifies a time relative to the current value of the clock specified by I<clockid>). An absolute timeout can be selected via the I<flags> argument.
ru: По умолчанию, начальное время срабатывания, задаваемое в I<new_value>, считается относительно текущего времени часов таймера на момент вызова (т. е., в I<new_value.it_value> задаётся время относительно текущего значения часов, заданных в I<clockid>). Использование абсолютной задержки можно включить через аргумент I<flags>.

source: The I<flags> argument is a bit mask that can include the following values:
ru: Аргумент I<flags> является битовой маской, которая может включать следующие значения:

source: Interpret I<new_value.it_value> as an absolute value on the timer's clock. The timer will expire when the value of the timer's clock reaches the value specified in I<new_value.it_value>.
ru: Считать I<new_value.it_value> абсолютным значением часов таймера. Таймер сработает, когда значение часов таймера достигнет значения, указанного в I<new_value.it_value>.

source: If this flag is specified along with B<TFD_TIMER_ABSTIME> and the clock for this timer is B<CLOCK_REALTIME> or B<CLOCK_REALTIME_ALARM>, then mark this timer as cancelable if the real-time clock undergoes a discontinuous change (B<settimeofday>(2), B<clock_settime>(2), or similar). When such changes occur, a current or future B<read>(2) from the file descriptor will fail with the error B<ECANCELED>.
ru: Если этот флаг указан вместе с B<TFD_TIMER_ABSTIME> и часами этого таймера являются B<CLOCK_REALTIME> или B<CLOCK_REALTIME_ALARM>, то помечать этот таймер как отменяемый, если часы реального времени подвергнуться скачкообразному изменению (B<settimeofday>(2), B<clock_settime>(2) или подобными). Когда такие изменения происходят, текущий или будущий вызова B<read>(2) для файлового дескриптора завершается с ошибкой B<ECANCELED>.

source: If the I<old_value> argument is not NULL, then the I<itimerspec> structure that it points to is used to return the setting of the timer that was current at the time of the call; see the description of B<timerfd_gettime>() following.
ru: Если I<old_value> не равно NULL, то это указатель на структуру I<itimerspec>, и он будет использоваться для возврата текущих на момент вызова настроек таймера; смотрите описание B<timerfd_gettime>() далее.

source: B<timerfd_gettime>() returns, in I<curr_value>, an I<itimerspec> structure that contains the current setting of the timer referred to by the file descriptor I<fd>.
ru: Вызов B<timerfd_gettime>() возвращает в I<curr_value>, которое указывает на структуру I<itimerspec>, текущие настройки таймера, на который ссылается файловый дескриптор I<fd>.

source: The I<it_value> field returns the amount of time until the timer will next expire. If both fields of this structure are zero, then the timer is currently disarmed. This field always contains a relative value, regardless of whether the B<TFD_TIMER_ABSTIME> flag was specified when setting the timer.
ru: В поле I<it_value> возвращается время до следующего срабатывания таймера. Если оба поля этой структуры равны нулю, то таймер в данный момент не запущен. Это поле всегда содержит относительное значение, независимо от того, был ли указан флаг B<TFD_TIMER_ABSTIME> при настройке таймера.
