Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: An invalid thread ID, thread group ID, or signal was specified.
ru: Указан некорректный идентификатор нити, группы или сигнал.

source: Permission denied. For the required permissions, see B<kill>(2).
ru: Отказано в доступе. См. B<kill>(2) для получения подробностей о необходимом доступе.

source: No process with the specified thread ID (and thread group ID) exists.
ru: Не существует процесса с указанным идентификатором нити (и идентификатором группы).

source: The B<RLIMIT_SIGPENDING> resource limit was reached and I<sig> is a real-time signal.
ru: Достигнут ограничитель ресурса B<RLIMIT_SIGPENDING> и I<sig> содержит сигнал реального времени.

source: Insufficient kernel memory was available and I<sig> is a real-time signal.
ru: Недостаточное количество памяти ядра и I<sig> содержит сигнал реального времени.

source: B<tkill>() is supported since Linux 2.4.19 / 2.5.4. B<tgkill>() was added in Linux 2.5.75.
ru: B<tkill>() поддерживается начиная с Linux 2.4.19/2.5.4. B<tgkill>() был добавлен в Linux 2.5.75.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: B<tkill>() and B<tgkill>() are Linux-specific and should not be used in programs that are intended to be portable.
ru: Вызовы B<tkill>() и B<tgkill>() есть только в Linux, и они не должны использоваться в переносимых программах.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: See the description of B<CLONE_THREAD> in B<clone>(2) for an explanation of thread groups.
ru: См. описание B<CLONE_THREAD> в B<clone>(2) для пояснения по поводу групп нитей.

source: Glibc does not provide wrappers for these system calls; call them using B<syscall>(2).
ru: В glibc нет обёрток для этих системных вызовов; вызывайте их через B<syscall>(2).

source: timer_getoverrun - get overrun count for a POSIX per-process timer
ru: timer_getoverrun - возвращает счётчик переполнения таймера POSIX (для каждого процесса отдельно)

source: Link with I<-lrt>.
ru: Компонуется при указании параметра I<-lrt>.

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: B<timer_getoverrun>() returns the "overrun count" for the timer referred to by I<timerid>. An application can use the overrun count to accurately calculate the number of timer expirations that would have occurred over a given time interval. Timer overruns can occur both when receiving expiration notifications via signals (B<SIGEV_SIGNAL>), and via threads (B<SIGEV_THREAD>).
ru: Вызов B<timer_getoverrun>() возвращает «счётчик переполнения» (overrun count) таймера, заданного в I<timerid>. Приложение может использовать счётчик переполнения для точного вычисления количества срабатываний (expirations) таймера, которые бы произошли за указанный временной интервал. Переполнения таймера могут происходить при получении уведомлений о срабатывании (expiration notifications) посредством сигналов (B<SIGEV_SIGNAL>) и нитей (B<SIGEV_THREAD>).

source: When expiration notifications are delivered via a signal, overruns can occur as follows. Regardless of whether or not a real-time signal is used for timer notifications, the system queues at most one signal per timer. (This is the behavior specified by POSIX.1. The alternative, queuing one signal for each timer expiration, could easily result in overflowing the allowed limits for queued signals on the system.) Because of system scheduling delays, or because the signal may be temporarily blocked, there can be a delay between the time when the notification signal is generated and the time when it is delivered (e.g., caught by a signal handler) or accepted (e.g., using B<sigwaitinfo>(2)). In this interval, further timer expirations may occur. The timer overrun count is the number of additional timer expirations that occurred between the time when the signal was generated and when it was delivered or accepted.
ru: Если уведомление о срабатывании доставляется сигналом, то переполнение может происходить следующим образом. Независимо от того, используется ли для таймерных уведомлений сигнал реального времени или нет, система ставит в очередь не более одного сигнала на таймер (так определено в POSIX.1. В противном случае, если ставить в очередь один сигнал на каждое срабатывание таймера, то легко можно превысить разрешённый размер очереди сигналов в системы). Из-за задержек системного планировщика или временной блокировки сигнала может возникать задержка между генерацией уведомляющего сигнала и его доставкой (delivered) (например, в обработчик сигнала) или приёмом (accepted) (например, с помощью B<sigwaitinfo>(2)). В этом промежутке могут произойти дополнительные срабатывания таймера. Переполнение счётчика таймера — это количество дополнительных срабатываний таймера, которые произошли между генерацией и доставкой или принятием сигнала.

source: Timer overruns can also occur when expiration notifications are delivered via invocation of a thread, since there may be an arbitrary delay between an expiration of the timer and the invocation of the notification thread, and in that delay interval, additional timer expirations may occur.
ru: Переполнение таймера также может произойти когда уведомление о срабатывании доставляется через вызов нити, так как здесь может возникать произвольная задержка между срабатыванием таймера и вызовом уведомляемой нити, и в этом промежутке могут произойти дополнительные срабатывания таймера.

source: On success, B<timer_getoverrun>() returns the overrun count of the specified timer; this count may be 0 if no overruns have occurred. On failure, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<timer_getoverrun>() возвращается счётчик переполнений заданного таймера; он может быть равен 0, если если переполнений не было. При ошибке возвращается -1, а I<errno> устанавливается в соответствующее значение кода ошибки.

source: I<timerid> is not a valid timer ID.
ru: Значение I<timerid> не является допустимым идентификатором таймера.

source: This system call is available since Linux 2.6.
ru: Данный системный вызов появился в Linux 2.6.

source: When timer notifications are delivered via signals (B<SIGEV_SIGNAL>), on Linux it is also possible to obtain the overrun count via the I<si_overrun> field of the I<siginfo_t> structure (see B<sigaction>(2)). This allows an application to avoid the overhead of making a system call to obtain the overrun count, but is a nonportable extension to POSIX.1.
ru: Когда уведомления таймера доставляются посредством сигналов (B<SIGEV_SIGNAL>), в Linux также возможно узнать значение счётчика переполнения из поля I<si_overrun> структуры I<siginfo_t> (смотрите B<sigaction>(2)). Это позволяет приложению не делать лишнего системного вызова для получения счётчика, но это непереносимое расширение POSIX.1.

source: POSIX.1 discusses timer overruns only in the context of timer notifications using signals.
ru: В POSIX.1 переполнение таймера обсуждается только в контексте уведомлений таймера с помощью сигналов.

source: POSIX.1 specifies that if the timer overrun count is equal to or greater than an implementation-defined maximum, B<DELAYTIMER_MAX>, then B<timer_getoverrun>() should return B<DELAYTIMER_MAX>. However, Linux does not implement this feature: instead, if the timer overrun value exceeds the maximum representable integer, the counter cycles, starting once more from low values.
ru: В POSIX.1 указано, что если счётчик переполнения таймера больше или равен максимальному значению (задаётся реализацией) B<DELAYTIMER_MAX>, то B<timer_getoverrun>() должен возвращать B<DELAYTIMER_MAX>. Однако в Linux это не реализовано: вместо этого, если значение переполнения таймера превышает максимальное значение целого, то счётчик начинает увеличиваться с начала.

source: EXAMPLE
ru: ПРИМЕР

source: See B<timer_create>(2).
ru: Смотрите B<timer_create>(2).

source: timer_create - create a POSIX per-process timer
ru: timer_create - создаёт таймер POSIX для определённого процесса

source: B<timer_create>() creates a new per-process interval timer. The ID of the new timer is returned in the buffer pointed to by I<timerid>, which must be a non-null pointer. This ID is unique within the process, until the timer is deleted. The new timer is initially disarmed.
ru: Вызов B<timer_create>() создаёт новый таймер для процесса. Идентификатор нового таймера возвращается в буфере, указанном в I<timerid>, его значение не должно быть равно null. Данный идентификатор уникален для процесса, пока таймер не будет удалён. Новый таймер создаётся неактивным.

source: The I<clockid> argument specifies the clock that the new timer uses to measure time. It can be specified as one of the following values:
ru: В аргументе I<clockid> задаются часы, которые используются в новом таймере для учёта времени. Это может быть одно из следующих значений:

source: A settable system-wide real-time clock.
ru: Настраиваемые системные часы реального времени.

source: A nonsettable monotonically increasing clock that measures time from some unspecified point in the past that does not change after system startup.
ru: Ненастраиваемые, постоянно идущие вперёд часы, отсчитывающие время с некоторой неопределённой точки в прошлом, которая не изменяется с момент запуска системы.

source: B<CLOCK_PROCESS_CPUTIME_ID> (since Linux 2.6.12)
ru: B<CLOCK_PROCESS_CPUTIME_ID> (начиная с Linux 2.6.12)

source: A clock that measures (user and system) CPU time consumed by (all of the threads in) the calling process.
ru: Часы, измеряющие время ЦП (пользовательское и системное), затраченное вызывающим процессом (всеми его нитями).

source: B<CLOCK_THREAD_CPUTIME_ID> (since Linux 2.6.12)
ru: B<CLOCK_THREAD_CPUTIME_ID> (начиная с Linux 2.6.12)

source: A clock that measures (user and system) CPU time consumed by the calling thread.
ru: Часы, измеряющие время ЦП (пользовательское и системное), затраченное вызывающей нитью.

source: B<CLOCK_BOOTTIME> (Since Linux 2.6.39)
ru: B<CLOCK_BOOTTIME> (начиная с Linux 2.6.39)

source: Like B<CLOCK_MONOTONIC>, this is a monotonically increasing clock. However, whereas the B<CLOCK_MONOTONIC> clock does not measure the time while a system is suspended, the B<CLOCK_BOOTTIME> clock does include the time during which the system is suspended. This is useful for applications that need to be suspend-aware. B<CLOCK_REALTIME> is not suitable for such applications, since that clock is affected by discontinuous changes to the system clock.
ru: Подобно B<CLOCK_MONOTONIC>, представляет монотонно растущие часы. Однако, если часы B<CLOCK_MONOTONIC> не отсчитывают время когда система находится в состоянии ожидания (suspended), а часы B<CLOCK_BOOTTIME> учитывают время в таком состоянии системы. Это полезно приложениям, которым необходимо учитывать состояние ожидания. B<CLOCK_REALTIME> не подходят для таких приложений, так как эти часы подвержены скачкообразным изменениям системных часов.

source: B<CLOCK_REALTIME_ALARM> (since Linux 3.0)
ru: B<CLOCK_REALTIME_ALARM> (начиная с Linux 3.0)

source: This clock is like B<CLOCK_REALTIME>, but will wake the system if it is suspended. The caller must have the B<CAP_WAKE_ALARM> capability in order to set a timer against this clock.
ru: Эти часы подобны B<CLOCK_REALTIME>, но разбудят систему, если она находится с состоянии ожидания. Для установки таймера по этим часам вызывающий должен иметь мандат B<CAP_WAKE_ALARM>.

source: B<CLOCK_BOOTTIME_ALARM> (since Linux 3.0)
ru: B<CLOCK_BOOTTIME_ALARM> (начиная с Linux 3.0)

source: This clock is like B<CLOCK_BOOTTIME>, but will wake the system if it is suspended. The caller must have the B<CAP_WAKE_ALARM> capability in order to set a timer against this clock.
ru: Эти часы подобны B<CLOCK_BOOTTIME>, но разбудят систему, если она находится с состоянии ожидания. Для установки таймера по этим часам вызывающий должен иметь мандат B<CAP_WAKE_ALARM>.

source: As well as the above values, I<clockid> can be specified as the I<clockid> returned by a call to B<clock_getcpuclockid>(3) or B<pthread_getcpuclockid>(3).
ru: Помимо значений, перечисленных ранее, в I<clockid> может быть указано I<clockid>, возвращённое вызовом B<clock_getcpuclockid>(3) или B<pthread_getcpuclockid>(3).

source: The I<sevp> argument points to a I<sigevent> structure that specifies how the caller should be notified when the timer expires. For the definition and general details of this structure, see B<sigevent>(7).
ru: Аргумент I<sevp> указывает на структуру I<sigevent>, которая задаёт способ уведомления вызывающего при срабатывании таймера. Определение и описание структуры смотрите в B<sigevent>(7).

source: The I<sevp.sigev_notify> field can have the following values:
ru: В поле I<sevp.sigev_notify> можно указать следующие значения:

source: Don't asynchronously notify when the timer expires. Progress of the timer can be monitored using B<timer_gettime>(2).
ru: Выполнять синхронное уведомление при срабатывании таймера. Ход таймера можно отслеживать с помощью B<timer_gettime>(2).

source: Upon timer expiration, generate the signal I<sigev_signo> for the process. See B<sigevent>(7) for general details. The I<si_code> field of the I<siginfo_t> structure will be set to B<SI_TIMER>. At any point in time, at most one signal is queued to the process for a given timer; see B<timer_getoverrun>(2) for more details.
ru: При срабатывании таймера генерировать для процесса сигнал I<sigev_signo>. Подробности смотрите в B<sigevent>(7). Полю I<si_code> структуры I<siginfo_t> присваивается значение B<SI_TIMER>. В любой момент времени для таймера в очередь процесса ставится не более одного сигнала; подробности смотрите в B<timer_getoverrun>(2).

source: Upon timer expiration, invoke I<sigev_notify_function> as if it were the start function of a new thread. See B<sigevent>(7) for details.
ru: При срабатывании вызвать I<sigev_notify_function>, как если бы это была начальная функция новой нити. Подробности смотрите в B<sigevent>(7).

source: B<SIGEV_THREAD_ID> (Linux-specific)
ru: B<SIGEV_THREAD_ID> (есть только в Linux)

source: As for B<SIGEV_SIGNAL>, but the signal is targeted at the thread whose ID is given in I<sigev_notify_thread_id>, which must be a thread in the same process as the caller. The I<sigev_notify_thread_id> field specifies a kernel thread ID, that is, the value returned by B<clone>(2) or B<gettid>(2). This flag is intended only for use by threading libraries.
ru: Как для B<SIGEV_SIGNAL>, но сигнал нацелен на нить, чей ID указывается в I<sigev_notify_thread_id>, который должен быть нитью того же процесса что и вызывающий. В поле I<sigev_notify_thread_id> указывается ID ядерной нити, то есть значение, возвращаемое B<clone>(2) или B<gettid>(2). Этот флаг предназначен только для использования в библиотеках нитей.

source: Specifying I<sevp> as NULL is equivalent to specifying a pointer to a I<sigevent> structure in which I<sigev_notify> is B<SIGEV_SIGNAL>, I<sigev_signo> is B<SIGALRM>, and I<sigev_value.sival_int> is the timer ID.
ru: Указание в I<sevp> значения NULL эквивалентно указанию указателя на структуру I<sigevent>, в которой I<sigev_notify> равно B<SIGEV_SIGNAL>, I<sigev_signo> равно B<SIGALRM> и I<sigev_value.sival_int> равно ID таймера.

source: On success, B<timer_create>() returns 0, and the ID of the new timer is placed in I<*timerid>. On failure, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<timer_create>() возвращается 0 и ID нового таймера помещается в I<*timerid>. При ошибке возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Temporary error during kernel allocation of timer structures.
ru: Временная ошибка, на время выделения ядром структур таймера.

source: Clock ID, I<sigev_notify>, I<sigev_signo>, or I<sigev_notify_thread_id> is invalid.
ru: Некорректный ID часов, I<sigev_notify>, I<sigev_signo> или I<sigev_notify_thread_id>.

source: Could not allocate memory.
ru: Невозможно выделить память.

source: A program may create multiple interval timers using B<timer_create>().
ru: С помощью B<timer_create>() программа может создавать несколько интервальных таймеров.

source: Timers are not inherited by the child of a B<fork>(2), and are disarmed and deleted during an B<execve>(2).
ru: Таймеры не наследуются в потомке после B<fork>(2), и выключаются и удаляются при B<execve>(2).

source: The kernel preallocates a "queued real-time signal" for each timer created using B<timer_create>(). Consequently, the number of timers is limited by the B<RLIMIT_SIGPENDING> resource limit (see B<setrlimit>(2)).
ru: Ядро заранее выделяет «сигнал реального времени в очереди» для каждого таймера, создаваемого B<timer_create>(). В результате, количество таймеров ограничено ресурсом B<RLIMIT_SIGPENDING> (смотрите B<setrlimit>(2)).

source: The timers created by B<timer_create>() are commonly known as "POSIX (interval) timers". The POSIX timers API consists of the following interfaces:
ru: Таймеры, созданные B<timer_create>(), часто называют «(интервальными) таймерами POSIX». Программный интерфейс таймеров POSIX состоит из следующих интерфейсов:

source: B<timer_create>(): Create a timer.
ru: B<timer_create>(): Создаёт таймер.

source: B<timer_settime>(2): Arm (start) or disarm (stop) a timer.
ru: B<timer_settime>(2): Включает (запускает) или выключает (останавливает) таймер.

source: B<timer_gettime>(2): Fetch the time remaining until the next expiration of a timer, along with the interval setting of the timer.
ru: B<timer_gettime>(2): Возвращает время, оставшееся до следующего срабатывания таймера вместе с интервалом, заданным в таймере.

source: B<timer_getoverrun>(2): Return the overrun count for the last timer expiration.
ru: B<timer_getoverrun>(2): Возвращает счётчик переполнения после последнего срабатывания таймера.

source: B<timer_delete>(2): Disarm and delete a timer.
ru: B<timer_delete>(2): Выключает и удаляет таймер.

source: Since Linux 3.10, the I</proc/[pid]/timers> file can be used to list the POSIX timers for the process with PID I<pid>. See B<proc>(5) for further information.
ru: Начиная с Linux 3.10, файл I</proc/[pid]/timers> можно использовать для просмотра списка таймеров POSIX для процесса с PID равным I<pid>. Подробности смотрите в B<proc>(5).

source: Since Linux 4.10, support for POSIX timers is a configurable option that is enabled by default. Kernel support can be disabled via the B<CONFIG_POSIX_TIMERS> option.
ru: Начиная с Linux 4.10, поддержка таймеров POSIX теперь необязательна и включена по умолчанию. Поддержку в ядре можно выключить через параметр B<CONFIG_POSIX_TIMERS>.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: Part of the implementation of the POSIX timers API is provided by glibc. In particular:
ru: Частично, реализация программного интерфейса таймеров POSIX предоставляется glibc. А именно:

source: Much of the functionality for B<SIGEV_THREAD> is implemented within glibc, rather than the kernel. (This is necessarily so, since the thread involved in handling the notification is one that must be managed by the C library POSIX threads implementation.) Although the notification delivered to the process is via a thread, internally the NPTL implementation uses a I<sigev_notify> value of B<SIGEV_THREAD_ID> along with a real-time signal that is reserved by the implementation (see B<nptl>(7)).
ru: Большая часть функций для B<SIGEV_THREAD> реализована в glibc, а не в ядре (это необходимо, так как в обработку уведомления вовлечена нить, которая должна управляться библиотекой C, реализующей нити POSIX). Хотя уведомление доставляется процессу через нить, внутри реализации NPTL для B<SIGEV_THREAD_ID> используется значение I<sigev_notify> и сигнал реального времени, который зарезервирован для реализации (смотрите B<nptl>(7)).

source: The implementation of the default case where I<evp> is NULL is handled inside glibc, which invokes the underlying system call with a suitably populated I<sigevent> structure.
ru: Стандартная ситуация, когда I<evp> равно NULL, обрабатывается в glibc, где вызывается нижележащий системный вызов с заполненной подходящим образом структурой I<sigevent>.

source: The timer IDs presented at user level are maintained by glibc, which maps these IDs to the timer IDs employed by the kernel.
ru: Идентификаторы таймеров, обрабатываемые на уровне пользователя, поддерживаются glibc, которая отображает эти ID в ID таймеров, созданных ядром.

source: The POSIX timers system calls first appeared in Linux 2.6. Prior to this, glibc provided an incomplete user-space implementation (B<CLOCK_REALTIME> timers only) using POSIX threads, and in glibc versions before 2.17, the implementation falls back to this technique on systems running pre-2.6 Linux kernels.
ru: Системные таймерные вызовы POSIX впервые появились в Linux 2.6. До этого в glibc была неполная реализация в пространстве пользователя (только таймеры B<CLOCK_REALTIME>) с использованием нитей POSIX, а реализация glibc до версии 2.17 переключается на неё в системах с ядрами до Linux 2.6.

source: The program below takes two arguments: a sleep period in seconds, and a timer frequency in nanoseconds. The program establishes a handler for the signal it uses for the timer, blocks that signal, creates and arms a timer that expires with the given frequency, sleeps for the specified number of seconds, and then unblocks the timer signal. Assuming that the timer expired at least once while the program slept, the signal handler will be invoked, and the handler displays some information about the timer notification. The program terminates after one invocation of the signal handler.
ru: Программа ниже обрабатывает два аргумента: интервал сна в секундах и частоту таймера в наносекундах. Программа устанавливает обработчик сигнала для таймера, блокирует этот сигнал, создаёт и включает таймер, который срабатывает с заданной частотой, засыпает на указанное количество секунд, а после разблокирует сигнал таймера. Предполагая, что таймер сработает не менее одного раза пока программа спит, обработчик сигнала будет вызван и покажет некоторую информацию об уведомлении таймера. Программа завершается после одного вызова обработчика сигнала.

source: In the following example run, the program sleeps for 1 second, after creating a timer that has a frequency of 100 nanoseconds. By the time the signal is unblocked and delivered, there have been around ten million overruns.
ru: В следующем примере программа спит 1 секунду после создания таймера, который работает с частотой 100 наносекунд. За время разблокировки и доставки сигнала, произошло около 10 миллионов переполнений.

source: $ B<./a.out 1 100> Establishing handler for signal 34 Blocking signal 34 timer ID is 0x804c008 Sleeping for 1 seconds Unblocking signal 34 Caught signal 34 sival_ptr = 0xbfb174f4; *sival_ptr = 0x804c008 overrun count = 10004886
ru: ./$ B<./a.out 1 100> Устанавливается обработчик сигнала 34 Блокируется сигнал 34 ID таймера — 0x804c008 Спим 1 секунду Разблокируется сигнал 34 Пойман сигнал 34 sival_ptr = 0xbfb174f4; *sival_ptr = 0x804c008 счётчик переполнения = 10004886

source: Program source
ru: Исходный код программы

source: or = timer_getoverrun(*tidp); if (or == -1) errExit("timer_getoverrun"); else printf(" overrun count = %d\en", or); }
ru: or = timer_getoverrun(*tidp); if (or == -1) errExit("timer_getoverrun"); else printf(" счётчик переполнения = %d\en", or); }
