Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: Pole error: I<x> is +0 or -0
ru: Ошибка особой точки: I<x> равно +0 или -0

source: I<errno> is set to B<ERANGE>. A divide-by-zero floating-point exception (B<FE_DIVBYZERO>) is raised.
ru: I<errno> устанавливается в B<ERANGE>. Возникает исключение деления плавающей точки на ноль (B<FE_DIVBYZERO>).

source: I<errno> is set to B<ERANGE>. An overflow floating-point exception (B<FE_OVERFLOW>) is raised.
ru: Значение I<errno> устанавливается в B<ERANGE>. Возникает исключение переполнения плавающей запятой (B<FE_OVERFLOW>).

source: glibc also gives the following error which is not specified in C99 or POSIX.1-2001.
ru: В glibc также возникает следующая ошибка, которая не определена в C99 или POSIX.1-2001:

source: Range error: result underflow
ru: Ошибка диапазона: результат исчерпал степень

source: An underflow floating-point exception (B<FE_UNDERFLOW>) is raised, and I<errno> is set to B<ERANGE>.
ru: Возникает исключение исчерпания степени чисел с плавающей запятой (B<FE_UNDERFLOW>) и I<errno> присваивается B<ERANGE>.

source: This function had to be called "true gamma function" since there is already a function B<gamma>(3) that returns something else (see B<gamma>(3) for details).
ru: Эта функция называется «настоящей гамма-функцией» (true gamma function), так как уже есть функция B<gamma>(3), возвращающая совершенно другое значение (смотрите B<gamma>(3)).

source: Before version 2.18, the glibc implementation of these functions did not set I<errno> to B<EDOM> when I<x> is negative infinity.
ru: До версии 2.18 реализации этих функций в glibc при возникновении ошибки потери значимости не присваивали I<errno> значение B<ERANGE>.

source: Before glibc 2.19, the glibc implementation of these functions did not set I<errno> to B<ERANGE> on an underflow range error. I<x>
ru: До реализации glibc версии 2.19 при возникновении ошибки исчерпания степени I<errno> не устанавливалось в значение B<ERANGE>. I<x>

source: In glibc versions 2.3.3 and earlier, an argument of +0 or -0 incorrectly produced a domain error (I<errno> set to B<EDOM> and an B<FE_INVALID> exception raised), rather than a pole error.
ru: В glibc версии 2.3.3 и старее при значении +0 или -0 некорректно возникает ошибка области (I<errno> присваивается B<EDOM> и возникает исключение B<FE_INVALID>), а не ошибка особой точки.
