Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: Retrieving and changing terminal settings
ru: Получение и изменение настроек терминала

source: B<tcgetattr>() gets the parameters associated with the object referred by I<fd> and stores them in the I<termios> structure referenced by I<termios_p>. This function may be invoked from a background process; however, the terminal attributes may be subsequently changed by a foreground process.
ru: Функция B<tcgetattr>() возвращает параметры, связанные с объектом, на который ссылается I<fd>, сохраняя их в структуре I<termios>, на которую указывает I<termios_p>. Эта функция может быть вызвана из фонового процесса; однако, атрибуты терминала могут в дальнейшем измениться активным процессом.

source: B<tcsetattr>() sets the parameters associated with the terminal (unless support is required from the underlying hardware that is not available) from the I<termios> structure referred to by I<termios_p>. I<optional_actions> specifies when the changes take effect:
ru: Функция B<tcsetattr>() изменяет параметры терминала (если это позволяет используемое оборудование) из структуры I<termios>, на которую указывает I<termios_p>. В I<optional_actions> задаётся, когда параметры должны начать действовать:

source: the change occurs immediately.
ru: Изменения начинают действовать немедленно.

source: the change occurs after all output written to I<fd> has been transmitted. This option should be used when changing parameters that affect output.
ru: Изменения начинают действовать после того, как переданы все данные для вывода, записанные в I<fd>. Это действие должно использоваться при работе с параметрами, которые влияют на вывод.

source: the change occurs after all output written to the object referred by I<fd> has been transmitted, and all input that has been received but not read will be discarded before the change is made.
ru: Изменения начинают действовать после того, как все данные, записанные в объект, на который указывает I<fd>, были переданы, и все данные, которые были приняты, но не прочитаны, были отброшены.

source: Canonical and noncanonical mode
ru: Канонический и неканонический режим

source: The setting of the B<ICANON> canon flag in I<c_lflag> determines whether the terminal is operating in canonical mode (B<ICANON> set) or noncanonical mode (B<ICANON> unset). By default, B<ICANON> is set.
ru: Флагом B<ICANON> в I<c_lflag> определяется, в каком режиме работает терминал: в каноническом режиме (B<ICANON> установлен), и неканоническом (B<ICANON> не установлен). По умолчанию B<ICANON> установлен.

source: In canonical mode:
ru: В каноническом режиме:

source: Input is made available line by line. An input line is available when one of the line delimiters is typed (NL, EOL, EOL2; or EOF at the start of line). Except in the case of EOF, the line delimiter is included in the buffer returned by B<read>(2).
ru: Вводимые данные становятся доступны построчно. Входная строка становится доступна после набора одного из разделителей строк (NL, EOL, EOL2 или EOF в начале строки). За исключением EOF, разделитель строк добавляется в буфер, возвращаемый B<read>(2).

source: Line editing is enabled (ERASE, KILL; and if the B<IEXTEN> flag is set: WERASE, REPRINT, LNEXT). A B<read>(2) returns at most one line of input; if the B<read>(2) requested fewer bytes than are available in the current line of input, then only as many bytes as requested are read, and the remaining characters will be available for a future B<read>(2).
ru: Включено редактирование строки (ERASE, KILL; и, если указан флаг B<IEXTEN> — WERASE, REPRINT, LNEXT). Вызов B<read>(2) возвращает не более одной строки ввода; если B<read>(2) запрашивает меньше байт, чем доступно в текущей вводимой строке, то читается только количество запрошенных байт, а оставшиеся символы будут доступны для следующего B<read>(2).

source: The maximum line length is 4096 chars (including the terminating newline character); lines longer than 4096 chars are truncated. After 4095 characters, input processing (e.g., B<ISIG> and B<ECHO*> processing) continues, but any input data after 4095 characters up to (but not including) any terminating newline is discarded. This ensures that the terminal can always receive more input until at least one line can be read.
ru: Максимальная длина строки - 4096 символов (включая завершающий символ перевода строки); строки длиннее 4096 символов будут обрезаны. После 4095 символов обработка ввода (то есть обработка B<ISIG> и B<ECHO*>) продолжится, однако любые входящие данные после 4095 символов до (но не включая) любого завершающего символа новой строки будут отбрасываться. Благодаря этому терминал всегда сможет принять больше входящих данных до тех пор, пока не появится хотя бы один перевод строки.

source: In noncanonical mode input is available immediately (without the user having to type a line-delimiter character), no input processing is performed, and line editing is disabled. The read buffer will only accept 4095 chars; this provides the necessary space for a newline char if the input mode is switched to canonical. The settings of MIN (I<c_cc[VMIN]>) and TIME (I<c_cc[VTIME]>) determine the circumstances in which a B<read>(2) completes; there are four distinct cases:
ru: В неканоническом режиме вводимые данные доступны сразу (без введённого пользователем символа разделителя строк), обработка ввода не выполняется и редактирование строки выключено. Буфер чтения принимает только 4095 символов; благодаря этому, в случае, если режим ввода переключится в канонический, резервируется необходимое место для символа новой строки. Настройками MIN (I<c_cc[VMIN]>) и TIME (I<c_cc[VTIME]>) задаются условия, при которых выполняется B<read>(2); есть четыре варианта:

source: MIN == 0, TIME == 0 (polling read)
ru: MIN == 0, TIME == 0 (чтение опросом (polling read))

source: If data is available, B<read>(2) returns immediately, with the lesser of the number of bytes available, or the number of bytes requested. If no data is available, B<read>(2) returns 0.
ru: Если данные доступны, то B<read>(2) завершает выполнение сразу, возвращая меньшее или запрошенное количество байт. Если данных нет, то B<read>(2) возвращает 0.

source: MIN E<gt> 0, TIME == 0 (blocking read)
ru: MIN E<gt> 0, TIME == 0 (блокирующее чтение)

source: B<read>(2) blocks until MIN bytes are available, and returns up to the number of bytes requested.
ru: Вызов B<read>(2) блокирует выполнение, пока не будет доступно MIN байт, и возвращает не более количества запрашиваемых байт.

source: MIN == 0, TIME E<gt> 0 (read with timeout)
ru: MIN == 0, TIME E<gt> 0 (чтение с блокировкой по времени (read with timeout))

source: TIME specifies the limit for a timer in tenths of a second. The timer is started when B<read>(2) is called. B<read>(2) returns either when at least one byte of data is available, or when the timer expires. If the timer expires without any input becoming available, B<read>(2) returns 0. If data is already available at the time of the call to B<read>(2), the call behaves as though the data was received immediately after the call.
ru: В TIME указывается время срабатывания таймера в десятых долях секунды. Таймер запускается при вызове B<read>(2). Вызов B<read>(2) завершается, когда не менее одного байта станет доступно, или когда сработает таймер. Если таймер сработал, а данных не появилось, то B<read>(2) возвращает 0. Если на момент вызова B<read>(2) данные уже были, то вызов действует так, как если бы данные были получены сразу после вызова.

source: MIN E<gt> 0, TIME E<gt> 0 (read with interbyte timeout)
ru: MIN E<gt> 0, TIME E<gt> 0 (чтение с блокировкой по времени между байтами (read with interbyte timeout))

source: TIME specifies the limit for a timer in tenths of a second. Once an initial byte of input becomes available, the timer is restarted after each further byte is received. B<read>(2) returns when any of the following conditions is met:
ru: В TIME указывается время срабатывания таймера в десятых долях секунды. После того, как первый байт станет доступен, таймер перезапускается после каждого полученного байта. Вызов B<read>(2) возвращает результат после удовлетворения любого из следующих условий:

source: MIN bytes have been received.
ru: Было получено MIN байт.

source: The interbyte timer expires.
ru: Истекло время межбайтового таймера.

source: The number of bytes requested by B<read>(2) has been received. (POSIX does not specify this termination condition, and on some other implementations B<read>(2) does not return in this case.)
ru: Получено запрошенное B<read>(2) количество байт (в POSIX нет этого условия завершения, и в некоторых реализациях B<read>(2) не возвращает управление в этом случае).

source: Because the timer is started only after the initial byte becomes available, at least one byte will be read. If data is already available at the time of the call to B<read>(2), the call behaves as though the data was received immediately after the call.
ru: Так как таймер запускается только после приёма начального байта, будет прочитан, как минимум, один байт. Если на момент вызова B<read>(2) данные уже были, то вызов действует так, как если бы данные были получены сразу после вызова.

source: POSIX does not specify whether the setting of the B<O_NONBLOCK> file status flag takes precedence over the MIN and TIME settings. If B<O_NONBLOCK> is set, a B<read>(2) in noncanonical mode may return immediately, regardless of the setting of MIN or TIME. Furthermore, if no data is available, POSIX permits a B<read>(2) in noncanonical mode to return either 0, or -1 with I<errno> set to B<EAGAIN>.
ru: В POSIX не указано, имеет ли флаг состояния файла B<O_NONBLOCK> приоритет над настройками MIN и TIME. Если B<O_NONBLOCK> установлен, то B<read>(2) в неканоническом режиме может вернуть управление сразу же, независимо от настройки MIN или TIME. Более того, если данных нет, то в POSIX разрешено B<read>(2) в неканоническом режиме вернуть или 0, или -1 с установкой I<errno> равной B<EAGAIN>.

source: Raw mode
ru: Режим без обработки

source: B<cfmakeraw>() sets the terminal to something like the "raw" mode of the old Version 7 terminal driver: input is available character by character, echoing is disabled, and all special processing of terminal input and output characters is disabled. The terminal attributes are set as follows:
ru: Функция B<cfmakeraw>() переводит терминал в нечто похожее на режим «raw» старого драйвера терминала Version 7: ввод доступен символ за символом, эхо отключено и все специальные обработки символов при вводе и выводе также отключены. Задаются следующие атрибуты терминала:

source: Line control
ru: Управление линией

source: B<tcsendbreak>() transmits a continuous stream of zero-valued bits for a specific duration, if the terminal is using asynchronous serial data transmission. If I<duration> is zero, it transmits zero-valued bits for at least 0.25 seconds, and not more that 0.5 seconds. If I<duration> is not zero, it sends zero-valued bits for some implementation-defined length of time.
ru: Функция B<tcsendbreak>() передаёт непрерывный поток нулевых битов в течение заданного промежутка времени, если терминал использует асинхронную передачу данных. Если I<duration> равно нулю, то нулевые биты передаются, по меньшей мере, в течение 0.25 секунды, но не более 0.5 секунды. Если I<duration> не равно нулю, то нулевые биты посылаются в течении некоторого периода времени, зависящего от реализации.

source: If the terminal is not using asynchronous serial data transmission, B<tcsendbreak>() returns without taking any action.
ru: Если терминал не использует асинхронную передачу данных, то B<tcsendbreak>() заканчивает работу, не предпринимая каких-либо действий.

source: B<tcdrain>() waits until all output written to the object referred to by I<fd> has been transmitted.
ru: Функция B<tcdrain>() ждёт, пока все данные вывода, записанные в объект, на который ссылается I<fd>, не будут переданы.

source: B<tcflush>() discards data written to the object referred to by I<fd> but not transmitted, or data received but not read, depending on the value of I<queue_selector>:
ru: Функция B<tcflush>() отбрасывает (discards) данные, записанные, но не переданные в объект, на который ссылается I<fd>, или принятые, но не прочитанные (в зависимости от значения I<queue_selector>):

source: flushes data received but not read.
ru: Отбросить принятые, но не прочитанные данные.

source: flushes data written but not transmitted.
ru: Отбросить записанные, но не переданные данные.

source: flushes both data received but not read, and data written but not transmitted.
ru: Отбросить принятые, но не прочитанные данные и записанные, но не переданные данные.

source: B<tcflow>() suspends transmission or reception of data on the object referred to by I<fd>, depending on the value of I<action>:
ru: Функция B<tcflow>() задерживает передачу или приём данных объектом, на который ссылается I<fd> (в зависимости от значения I<action>):

source: suspends output.
ru: Задержать вывод.

source: restarts suspended output.
ru: Возобновить задержанный вывод.

source: transmits a STOP character, which stops the terminal device from transmitting data to the system.
ru: Передать символ STOP, который останавливает передачу данных в систему с устройства терминала.

source: transmits a START character, which starts the terminal device transmitting data to the system.
ru: Передать символ START, который начинает передачу данных в систему с устройства терминала.

source: The default on open of a terminal file is that neither its input nor its output is suspended.
ru: По умолчанию при открытии файла терминала ни ввод, ни вывод не приостановлены.

source: Line speed
ru: Скорость линии

source: The baud rate functions are provided for getting and setting the values of the input and output baud rates in the I<termios> structure. The new values do not take effect until B<tcsetattr>() is successfully called.
ru: Функции работы со скоростью передачи (в бодах) предназначены для получения и установки значений скоростей ввода и вывода в структуре I<termios>. Новые значения не действуют, пока не будет вызвана B<tcsetattr>().

source: Setting the speed to B<B0> instructs the modem to "hang up". The actual bit rate corresponding to B<B38400> may be altered with B<setserial>(8).
ru: При установке скорости B<B0> модему передаётся команда «повесить трубку». Фактическая скорость, соответствующая B<B38400>, может быть изменена с помощью B<setserial>(8).

source: The input and output baud rates are stored in the I<termios> structure.
ru: Скорости ввода и вывода хранятся в структуре I<termios>.

source: B<cfgetospeed>() returns the output baud rate stored in the I<termios> structure pointed to by I<termios_p>.
ru: Функция B<cfgetospeed>() возвращает скорость вывода данных, хранящуюся в структуре I<termios>, на которую указывает I<termios_p>.

source: B<cfsetospeed>() sets the output baud rate stored in the I<termios> structure pointed to by I<termios_p> to I<speed>, which must be one of these constants:
ru: Функция B<cfsetospeed>() устанавливает скорость вывода данных из поля I<speed> структуры I<termios>, на которую указывает I<termios_p>. Значение должно быть равно одной из следующих констант:

source: The zero baud rate, B<B0>, is used to terminate the connection. If B0 is specified, the modem control lines shall no longer be asserted. Normally, this will disconnect the line. B<CBAUDEX> is a mask for the speeds beyond those defined in POSIX.1 (57600 and above). Thus, B<B57600> & B<CBAUDEX> is nonzero.
ru: Нулевая скорость, B<B0>, используется для завершения соединения. Если указана B<B0>, то линии управления модемом не должны больше отслеживаться. Обычно это обрывает связь на линии. B<CBAUDEX> — это маска скоростей, которые выше определённых в POSIX.1 (57600 и выше). Таким образом, B<B57600> & B<CBAUDEX> не равно нулю.

source: B<cfgetispeed>() returns the input baud rate stored in the I<termios> structure.
ru: Функция B<cfgetispeed>() возвращает скорость ввода данных, хранящуюся в структуре I<termios>.

source: B<cfsetispeed>() sets the input baud rate stored in the I<termios> structure to I<speed>, which must be specified as one of the B<Bnnn> constants listed above for B<cfsetospeed>(). If the input baud rate is set to zero, the input baud rate will be equal to the output baud rate.
ru: Функция B<cfsetispeed>() устанавливает значение скорости ввода данных из поля I<speed> структуры I<termios>. Значение должно быть равно одной из констант B<Bnnn>, перечисленных выше для B<cfsetospeed>(). Если скорость ввода данных устанавливается равной нулю, то скорость ввода данных будет равна скорости вывода данных.

source: B<cfsetspeed>() is a 4.4BSD extension. It takes the same arguments as B<cfsetispeed>(), and sets both input and output speed.
ru: Функция B<cfsetspeed>() является расширением 4.4BSD. Она имеет те же аргументы что и B<cfsetispeed>(), и задаёт сразу скорость и ввода и вывода.

source: B<cfgetospeed>() returns the output baud rate stored in the I<termios> structure.
ru: Функция B<cfgetospeed>() возвращает скорость вывода данных, хранящуюся в структуре I<termios>.

source: All other functions return:
ru: Все остальные функции возвращают:

source: on success.
ru: при успешном выполнении.

source: on failure and set I<errno> to indicate the error.
ru: при ошибках и I<errno> присваивается код ошибки.

source: Note that B<tcsetattr>() returns success if I<any> of the requested changes could be successfully carried out. Therefore, when making multiple changes it may be necessary to follow this call with a further call to B<tcgetattr>() to check that all changes have been performed successfully.
ru: Заметим, что B<tcsetattr>() завершается без ошибок, если I<любое> запрошенное изменение было успешно выполнено. Поэтому, при одновременном изменении нескольких параметров, может понадобиться вызвать B<tcgetattr>() для того, чтобы убедиться, что все изменения были выполнены.

source: B<tcgetattr>(), B<tcsetattr>(), B<tcsendbreak>(), B<tcdrain>(), B<tcflush>(), B<tcflow>(), B<cfgetispeed>(), B<cfgetospeed>(), B<cfsetispeed>(), and B<cfsetospeed>() are specified in POSIX.1-2001.
ru: Функции B<tcgetattr>(), B<tcsetattr>(), B<tcsendbreak>(), B<tcdrain>(), B<tcflush>(), B<tcflow>(), B<cfgetispeed>(), B<cfgetospeed>(), B<cfsetispeed>() и B<cfsetospeed>() определены в POSIX.1-2001.

source: B<cfmakeraw>() and B<cfsetspeed>() are nonstandard, but available on the BSDs.
ru: Функций B<cfmakeraw>() и B<cfsetspeed>() нет в стандарте, но есть в BSD.

source: UNIX\ V7 and several later systems have a list of baud rates where after the fourteen values B0, ..., B9600 one finds the two constants EXTA, EXTB ("External A" and "External B"). Many systems extend the list with much higher baud rates.
ru: В UNIX\ V7, а также в некоторых более новых системах, имеется список скоростей в бодах, где после первых четырнадцати значений B0, …, B9600, идут две константы EXTA и EXTB («External A» и «External B»). Многие другие системы расширяют этот список более высокими значениями скоростей.

source: The effect of a nonzero I<duration> with B<tcsendbreak>() varies. SunOS specifies a break of I<duration\ *\ N> seconds, where I<N> is at least 0.25, and not more than 0.5. Linux, AIX, DU, Tru64 send a break of I<duration> milliseconds. FreeBSD and NetBSD and HP-UX and MacOS ignore the value of I<duration>. Under Solaris and UnixWare, B<tcsendbreak>() with nonzero I<duration> behaves like B<tcdrain>().
ru: Ненулевое значение I<duration> с B<tcsendbreak>() приводит к неизвестному результату. В SunOS задана пауза I<duration\ *\ N> секунд, где N равно не менее 0.25, и не более 0.5. В Linux, AIX, DU, Tru64 делается пауза в I<duration> миллисекунд. В FreeBSD и NetBSD и HP-UX и MacOS значение I<duration> игнорируется. В Solaris и UnixWare функция B<tcsendbreak>() с ненулевым I<duration> работает аналогично B<tcdrain>().

source: On the Alpha architecture before Linux 4.16 (and glibc before 2.28), the B<XTABS> value was different from B<TAB3> and it was ignored by the B<N_TTY> line discipline code of the terminal driver as a result (because as it wasn't part of the B<TABDLY> mask).
ru: На архитектуре Alpha до Linux 4.16 (и glibc до версии 2.28), значение B<XTABS> отличалось от B<TAB3> и в результате игнорировалось кодом протокола линии B<N_TTY> в драйвере терминала (так как он не являлся частью маски B<TABDLY>).

source: tanh, tanhf, tanhl - hyperbolic tangent function
ru: tanh, tanhf, tanhl - функция гиперболического тангенса

source: These functions return the hyperbolic tangent of I<x>, which is defined mathematically as:
ru: Данные функции возвращают гиперболический тангенс от I<x>, как это математически определено:

source: On success, these functions return the hyperbolic tangent of I<x>.
ru: При успешном выполнении данные функции возвращают гиперболический тангенс от I<x>.

source: If I<x> is +0 (-0), +0 (-0) is returned.
ru: Если I<x> равно +0 (-0), будет возвращено +0 (-0).

source: If I<x> is positive infinity (negative infinity), +1 (-1) is returned.
ru: Если I<x> стремится к плюс или минус бесконечности, то будет возвращено +1 или -1.

source: tgamma, tgammaf, tgammal - true gamma function
ru: tgamma, tgammaf, tgammal - вычисление настоящей гамма-функции

source: These functions calculate the Gamma function of I<x>.
ru: Эти функции вычисляют гамма-функцию от I<x>.

source: The Gamma function is defined by
ru: Гамма-функция определяется так:

source: It is defined for every real number except for nonpositive integers. For nonnegative integral I<m> one has
ru: Она определена для всех действительных чисел кроме не положительных целых. Для не положительных интеграл I<m> получим

source: and, more generally, for all I<x>:
ru: и, в общем случае, для всех I<x>:

source: Furthermore, the following is valid for all values of I<x> outside the poles:
ru: Кроме это, допустимы все значения I<x> вне особых точек:

source: On success, these functions return Gamma(x).
ru: При успешном выполнении данные функции возвращают Gamma(x).

source: If I<x> is positive infinity, positive infinity is returned.
ru: Если I<x> стремится к плюс бесконечности, то будет возвращена плюс бесконечность.

source: If I<x> is a negative integer, or is negative infinity, a domain error occurs, and a NaN is returned.
ru: Если I<x> отрицательное целое или стремится к минус бесконечности, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If the result overflows, a range error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively, with the correct mathematical sign.
ru: Если происходит переполнение результата, возникает ошибка диапазона, а функция возвращает B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, соответственно, с математически правильным знаком.

source: If the result underflows, a range error occurs, and the functions return 0, with the correct mathematical sign.
ru: Если происходит исчерпание степени, то возникает ошибка диапазона, а функция возвращает 0 с математически правильным знаком.

source: If I<x> is -0 or +0, a pole error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively, with the same sign as the 0.
ru: Если I<x> равно -0 или +0, то генерируется ошибка особой точки, а функции возвращают B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, соответственно, с тем же знаком что и 0.

source: Domain error: I<x> is a negative integer, or negative infinity
ru: Ошибка области: I<x> отрицательное целое или стремится к минус бесконечности

source: I<errno> is set to B<EDOM>. An invalid floating-point exception (B<FE_INVALID>) is raised (but see BUGS).
ru: I<errno> устанавливается в B<EDOM>. Вызывается исключение неправильной плавающей запятой (B<FE_INVALID>)).
