Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: A newly created TCP socket has no remote or local address and is not fully specified. To create an outgoing TCP connection use B<connect>(2) to establish a connection to another TCP socket. To receive new incoming connections, first B<bind>(2) the socket to a local address and port and then call B<listen>(2) to put the socket into the listening state. After that a new socket for each incoming connection can be accepted using B<accept>(2). A socket which has had B<accept>(2) or B<connect>(2) successfully called on it is fully specified and may transmit data. Data cannot be transmitted on listening or not yet connected sockets.
ru: Только что созданный сокет TCP не имеет локального или удалённого адреса и не является полностью определённым. Для создания исходящего соединения TCP с другим сокетом TCP используйте B<connect>(2). Для приёма новых входящих соединений сперва подключите сокет к локальному адресу и порту с помощью B<bind>(2), а затем вызовите B<listen>(2) для перевода сокета в режим прослушивания. После этого через новый сокет можно принимать каждое входящее соединение с помощью B<accept>(2). Сокет, для которого успешно отработали B<accept>(2) или B<connect>(2), является полностью определённым и может передавать данные. Данные не могут быть переданы через слушающий или ещё не соединённый сокет.

source: Linux supports RFC\ 1323 TCP high performance extensions. These include Protection Against Wrapped Sequence Numbers (PAWS), Window Scaling and Timestamps. Window scaling allows the use of large (E<gt> 64\ kB) TCP windows in order to support links with high latency or bandwidth. To make use of them, the send and receive buffer sizes must be increased. They can be set globally with the I</proc/sys/net/ipv4/tcp_wmem> and I</proc/sys/net/ipv4/tcp_rmem> files, or on individual sockets by using the B<SO_SNDBUF> and B<SO_RCVBUF> socket options with the B<setsockopt>(2) call.
ru: Linux поддерживает высокопроизводительные расширения TCP RFC\ 1323. Они включают в себя: защиту против оборотной последовательности номеров (PAWS), масштабирование окна и метки времени. Масштабирование окна позволяет использовать большие (E<gt> 64\ КБ) окна TCP для поддержки соединений с большой задержкой или высокой пропускной способностью. Для их использования необходимо увеличить размеры буферов приёма и передачи. Это можно сделать глобально через файлы I</proc/sys/net/ipv4/tcp_wmem> и I</proc/sys/net/ipv4/tcp_rmem>, или для отдельных сокетов, используя параметры сокетов B<SO_SNDBUF> и B<SO_RCVBUF> в вызове B<setsockopt>(2).

source: The maximum sizes for socket buffers declared via the B<SO_SNDBUF> and B<SO_RCVBUF> mechanisms are limited by the values in the I</proc/sys/net/core/rmem_max> and I</proc/sys/net/core/wmem_max> files. Note that TCP actually allocates twice the size of the buffer requested in the B<setsockopt>(2) call, and so a succeeding B<getsockopt>(2) call will not return the same size of buffer as requested in the B<setsockopt>(2) call. TCP uses the extra space for administrative purposes and internal kernel structures, and the I</proc> file values reflect the larger sizes compared to the actual TCP windows. On individual connections, the socket buffer size must be set prior to the B<listen>(2) or B<connect>(2) calls in order to have it take effect. See B<socket>(7) for more information.
ru: Максимальный размер буферов сокета объявляется, используя механизмы B<SO_SNDBUF> и B<SO_RCVBUF> и ограничен значениями в файлах I</proc/sys/net/core/rmem_max> и I</proc/sys/net/core/wmem_max>. Заметим, что TCP в действительности бронирует в два раза больше места, чем размер буфера, запрошенный в вызове B<setsockopt>(2), поэтому последующий вызов B<getsockopt>(2) не возвратит тот же размер буфера, что был запрошен в вызове B<setsockopt>(2). TCP использует дополнительное пространство в административных целях и для внутренних структур ядра, а значения в файлах в I</proc> отражают большие размеры, по сравнению с действительными окнами TCP. Для отдельных соединений размер буфера сокета должен быть установлен до вызова B<listen>(2) или B<connect>(2). Дополнительную информацию смотрите в B<socket>(7).

source: TCP supports urgent data. Urgent data is used to signal the receiver that some important message is part of the data stream and that it should be processed as soon as possible. To send urgent data specify the B<MSG_OOB> option to B<send>(2). When urgent data is received, the kernel sends a B<SIGURG> signal to the process or process group that has been set as the socket "owner" using the B<SIOCSPGRP> or B<FIOSETOWN> ioctls (or the POSIX.1-specified B<fcntl>(2) B<F_SETOWN> operation). When the B<SO_OOBINLINE> socket option is enabled, urgent data is put into the normal data stream (a program can test for its location using the B<SIOCATMARK> ioctl described below), otherwise it can be received only when the B<MSG_OOB> flag is set for B<recv>(2) or B<recvmsg>(2).
ru: TCP поддерживает срочные данные. Срочные данные используются для уведомления принимающей стороны о том, что частью потока данных является некоторое важное сообщение, которое должно быть обработано как можно скорее. Для отправки срочных данных укажите параметр B<MSG_OOB> в вызове B<send>(2). При поступлении срочных данных ядро посылает сигнал B<SIGURG> процессу или группе процессов, который указан как «владелец» сокета с помощью ioctl-вызовов B<SIOCSPGRP> или B<FIOSETOWN> (или с помощью определённой в POSIX.1 операции B<F_SETOWN> для B<fcntl>(2)). Если задан параметр сокета B<SO_OOBINLINE>, то срочные данные будут помещены в обычный поток данных (программа может проверить его размещение с помощью ioctl-вызова B<SIOCATMARK>, описанного далее), в противном случае они могут быть получены, только если для B<recv>(2) или B<recvmsg>(2) установлен флаг B<MSG_OOB>.

source: When out-of-band data is present, B<select>(2) indicates the file descriptor as having an exceptional condition and I<poll (2)> indicates a B<POLLPRI> event.
ru: При наличии внеполосных данных B<select>(2) помечает файловый дескриптор как имеющий исключительное условие, а I<poll (2)> отмечает это событием B<POLLPRI>.

source: Linux 2.4 introduced a number of changes for improved throughput and scaling, as well as enhanced functionality. Some of these features include support for zero-copy B<sendfile>(2), Explicit Congestion Notification, new management of TIME_WAIT sockets, keep-alive socket options and support for Duplicate SACK extensions.
ru: В Linux 2.4 представлено несколько изменений по улучшению пропускной способности и масштабирования, а также дополнительные возможности: поддержка «нулевого» копирования (zero-copy) в B<sendfile>(2), явное уведомление о перегрузке, новое управление сокетами TIME_WAIT, параметры поддержки сокетов в рабочем состоянии и поддержка расширений Duplicate SACK.

source: Address formats
ru: Форматы адресов

source: TCP is built on top of IP (see B<ip>(7)). The address formats defined by B<ip>(7) apply to TCP. TCP supports point-to-point communication only; broadcasting and multicasting are not supported.
ru: Протокол TCP построен поверх протокола IP (смотрите B<ip>(7)). Форматы адресов, определённые в B<ip>(7), относятся и к TCP. TCP поддерживает только соединения типа точка-точка (point-to-point); широковещательная и многоадресная передача не поддерживаются.

source: /proc interfaces
ru: Интерфейсы /proc

source: System-wide TCP parameter settings can be accessed by files in the directory I</proc/sys/net/ipv4/>. In addition, most IP I</proc> interfaces also apply to TCP; see B<ip>(7). Variables described as I<Boolean> take an integer value, with a nonzero value ("true") meaning that the corresponding option is enabled, and a zero value ("false") meaning that the option is disabled.
ru: Системные настройки параметров TCP хранятся в каталоге I</proc/sys/net/ipv4/>. Также, большинство интерфейсов I</proc> для IP также применимы и к TCP (смотрите B<ip>(7)). Переменные, описанные как I<Boolean>, являются целочисленными, где ненулевое значение («истина, true») означает, что соответствующий параметр включён, а нулевое значение («ложь, false») означает, что параметр включён.

source: I<tcp_abc> (Integer; default: 0; Linux 2.6.15 to Linux 3.8)
ru: I<tcp_abc> (Integer; по умолчанию: 0; в Linux 2.6.15 по Linux 3.8)

source: Control the Appropriate Byte Count (ABC), defined in RFC 3465. ABC is a way of increasing the congestion window (I<cwnd>) more slowly in response to partial acknowledgments. Possible values are:
ru: Управляет подсчётом выделенных байтов (Appropriate Byte Count — ABC), определён в RFC 3465. ABC — это более плавный способ увеличения окна перегрузки (I<cwnd>) в ответ на частичные подтверждения. Возможные значения:

source: increase I<cwnd> once per acknowledgment (no ABC)
ru: увеличивать I<cwnd> при каждом подтверждении (ABC выключен)

source: increase I<cwnd> once per acknowledgment of full sized segment
ru: увеличивать I<cwnd> при каждом подтверждении всего сегмента

source: allow increase I<cwnd> by two if acknowledgment is of two segments to compensate for delayed acknowledgments.
ru: разрешить увеличение I<cwnd> на два, если подтверждение касается двух сегментов, что компенсирует задержку подтверждений.

source: I<tcp_abort_on_overflow> (Boolean; default: disabled; since Linux 2.4)
ru: I<tcp_abort_on_overflow> (Boolean; по умолчанию: выключен; начиная с Linux 2.4)

source: Enable resetting connections if the listening service is too slow and unable to keep up and accept them. It means that if overflow occurred due to a burst, the connection will recover. Enable this option I<only> if you are really sure that the listening daemon cannot be tuned to accept connections faster. Enabling this option can harm the clients of your server.
ru: Включает сброс (resetting) соединений, если слушающий сервис слишком медленно работает и не может поддержать существующие или принять новые соединения. Это означает, что при возникновении переполнения из-за всплеска подключений (burst), соединение будет восстановлено. Включайте этот параметр I<только>, если вы действительно уверены, что слушающая программа не может быть настроена более быстрый приём соединений. Включение этого параметра может нарушить работу клиентов вашего сервера.

source: I<tcp_adv_win_scale> (integer; default: 2; since Linux 2.4)
ru: I<tcp_adv_win_scale> (integer; по умолчанию: 2; начиная с Linux 2.4)

source: Count buffering overhead as I<bytes/2^tcp_adv_win_scale>, if I<tcp_adv_win_scale> is greater than 0; or I<bytes-bytes/2^(-tcp_adv_win_scale)>, if I<tcp_adv_win_scale> is less than or equal to zero.
ru: Рассчитывает переполнение буфера по формуле I<bytes/2^tcp_adv_win_scale>, если I<tcp_adv_win_scale> больше 0, или I<bytes-bytes/2^(-tcp_adv_win_scale)>, если значение I<tcp_adv_win_scale> меньше или равно 0.

source: The socket receive buffer space is shared between the application and kernel. TCP maintains part of the buffer as the TCP window, this is the size of the receive window advertised to the other end. The rest of the space is used as the "application" buffer, used to isolate the network from scheduling and application latencies. The I<tcp_adv_win_scale> default value of 2 implies that the space used for the application buffer is one fourth that of the total.
ru: Пространство буфера приёма сокета является общим для приложения и ядра. TCP обслуживает часть буфера как окно TCP, о размере этого окна приёма извещается другая сторона. Остаток пространства используется как «буфер приложения», используемый для изолирования сети от задержек планирования или приложения. Значение по умолчанию I<tcp_adv_win_scale> — 2 — означает, что для буфера приложения используется четверть всего пространства.

source: I<tcp_allowed_congestion_control> (String; default: see text; since Linux 2.4.20)
ru: I<tcp_allowed_congestion_control> (String; по умолчанию: смотрите описание; начиная с Linux 2.4.20)

source: Show/set the congestion control algorithm choices available to unprivileged processes (see the description of the B<TCP_CONGESTION> socket option). The items in the list are separated by white space and terminated by a newline character. The list is a subset of those listed in I<tcp_available_congestion_control>. The default value for this list is "reno" plus the default setting of I<tcp_congestion_control>.
ru: Показывает/назначает алгоритм управления перегрузкой из списка доступных для непривилегированных процессов (смотрите описание параметра сокета B<TCP_CONGESTION>). Элементы списка разделяются пробелом и завершаются символом новой строки. В списке содержатся несколько значений из перечисленных в I<tcp_available_congestion_control>. Значением по умолчанию является «reno» плюс значение по умолчанию из I<tcp_congestion_control>.

source: I<tcp_autocorking> (Boolean; default: enabled; since Linux 3.14)
ru: I<tcp_autocorking> (Boolean; по умолчанию: включено; начиная с Linux 3.14)

source: If this option is enabled, the kernel tries to coalesce small writes (from consecutive B<write>(2) and B<sendmsg>(2) calls) as much as possible, in order to decrease the total number of sent packets. Coalescing is done if at least one prior packet for the flow is waiting in Qdisc queues or device transmit queue. Applications can still use the B<TCP_CORK> socket option to obtain optimal behavior when they know how/when to uncork their sockets.
ru: Если тот параметр установлен, то ядро пытается объединить вместе как можно больше маленьких частей записываемых данных (от следующих друг за другом вызовов B<write>(2) и B<sendmsg>(2)), чтобы уменьшить общее количество посылаемых пакетов. Объединение (coalescing) выполняется, если, как минимум, один предыдущий пакет потока ждёт в очередях Qdisc или очереди отправки на устройство. Приложения по-прежнему могут использовать параметр сокета B<TCP_CORK> для получения оптимального поведения, когда они знают как/когда включать вывод (uncork) из своих сокетов.

source: I<tcp_available_congestion_control> (String; read-only; since Linux 2.4.20)
ru: I<tcp_available_congestion_control> (String; только для чтения; начиная с Linux 2.4.20)

source: Show a list of the congestion-control algorithms that are registered. The items in the list are separated by white space and terminated by a newline character. This list is a limiting set for the list in I<tcp_allowed_congestion_control>. More congestion-control algorithms may be available as modules, but not loaded.
ru: Показывает список зарегистрированных алгоритмов управления перегрузкой. Элементы списка разделяются пробелом и завершаются символом новой строки. Список представляет собой сокращённый набор из I<tcp_allowed_congestion_control>. Дополнительные алгоритмы управления перегрузкой могут быть доступны в виде модулей, но они не загружены.

source: I<tcp_app_win> (integer; default: 31; since Linux 2.4)
ru: I<tcp_app_win> (integer; по умолчанию: 31; начиная с Linux 2.4)

source: This variable defines how many bytes of the TCP window are reserved for buffering overhead.
ru: Эта переменная определяет, сколько байтов окна TCP зарезервировано для буферизации издержек (overhead).

source: A maximum of (I<window/2^tcp_app_win>, mss) bytes in the window are reserved for the application buffer. A value of 0 implies that no amount is reserved.
ru: Для буфера приложения будет зарезервировано максимум (I<window/2^tcp_app_win>, mss) байт в окне. Значение 0 обозначает, что ничего не зарезервировано.

source: I<tcp_base_mss> (Integer; default: 512; since Linux 2.6.17)
ru: I<tcp_base_mss> (Integer; по умолчанию: 512; начиная с Linux 2.6.17)

source: The initial value of I<search_low> to be used by the packetization layer Path MTU discovery (MTU probing). If MTU probing is enabled, this is the initial MSS used by the connection.
ru: Начальное значение для I<search_low>, которое будет использовано уровнем упаковки при обнаружении Path MTU (зондирование MTU). Если зондирование (probing) MTU включено, то в соединении для этого используется начальное значение MSS.

source: I<tcp_bic> (Boolean; default: disabled; Linux 2.4.27/2.6.6 to 2.6.13)
ru: I<tcp_bic> (Boolean; default: выключено; в Linux 2.4.27/2.6.6 по 2.6.13)

source: Enable BIC TCP congestion control algorithm. BIC-TCP is a sender-side-only change that ensures a linear RTT fairness under large windows while offering both scalability and bounded TCP-friendliness. The protocol combines two schemes called additive increase and binary search increase. When the congestion window is large, additive increase with a large increment ensures linear RTT fairness as well as good scalability. Under small congestion windows, binary search increase provides TCP friendliness.
ru: Включает алгоритм управления перегрузкой BIC TCP. Алгоритм BIC-TCP действует только на стороне отправляющего, при этом обеспечивается линейная справедливость RTT при больших окнах и предлагается масштабируемость и дружественность к TCP. Протокол объединяет две схемы, называемые аддитивное увеличение (additive increase) и увеличение дихотомическим поиском (binary search increase). Когда окно перегрузки велико, аддитивное увеличение с большим приращением обеспечивает линейную справедливость RTT, а также хорошую масштабируемость. При маленьких окнах перегрузки, увеличение дихотомическим поиском предоставляет дружественность к TCP.

source: I<tcp_bic_low_window> (integer; default: 14; Linux 2.4.27/2.6.6 to 2.6.13)
ru: I<tcp_bic_low_window> (integer; по умолчанию: 14; в Linux 2.4.27/2.6.6 по 2.6.13)

source: Set the threshold window (in packets) where BIC TCP starts to adjust the congestion window. Below this threshold BIC TCP behaves the same as the default TCP Reno.
ru: Устанавливает порог окна (в пакетах) после которого запускается BIC TCP для регулировки окна перегрузки. Ниже этого порога BIC TCP действует как алгоритм по умолчанию — TCP Reno.

source: I<tcp_bic_fast_convergence> (Boolean; default: enabled; Linux 2.4.27/2.6.6 to 2.6.13)
ru: I<tcp_bic_fast_convergence> (Boolean; по умолчанию: включено; в Linux 2.4.27/2.6.6 по 2.6.13)

source: Force BIC TCP to more quickly respond to changes in congestion window. Allows two flows sharing the same connection to converge more rapidly.
ru: Заставляет BIC TCP реагировать на изменения окна перегрузки более быстро. Позволяет двум потокам сообща использовать одно соединение для более быстрой сходимости.

source: I<tcp_congestion_control> (String; default: see text; since Linux 2.4.13)
ru: I<tcp_congestion_control> (String; по умолчанию: смотрите описание; начиная с Linux 2.4.13)

source: Set the default congestion-control algorithm to be used for new connections. The algorithm "reno" is always available, but additional choices may be available depending on kernel configuration. The default value for this file is set as part of kernel configuration.
ru: Включает алгоритм управления перегрузкой по умолчанию для новых соединений. Алгоритм «reno» доступен всегда, но в зависимости от настроек ядра могут быть и другие. Значение по умолчанию для этого файла задаётся в настройке ядра.

source: I<tcp_dma_copybreak> (integer; default: 4096; since Linux 2.6.24)
ru: I<tcp_dma_copybreak> (integer; по умолчанию: 4096; начиная с Linux 2.6.24)

source: Lower limit, in bytes, of the size of socket reads that will be offloaded to a DMA copy engine, if one is present in the system and the kernel was configured with the B<CONFIG_NET_DMA> option.
ru: Нижний предел (в байтах) на количество читаемых из сокета данных, которое будет снято из механизма копирования DMA, если он есть в системе и ядро было настроено с параметром B<CONFIG_NET_DMA>.

source: I<tcp_dsack> (Boolean; default: enabled; since Linux 2.4)
ru: I<tcp_dsack> (Boolean; по умолчанию: включено; начиная с Linux 2.4)

source: Enable RFC\ 2883 TCP Duplicate SACK support.
ru: Включает поддержку RFC\ 2883 TCP Duplicate SACK.

source: I<tcp_ecn> (Integer; default: see below; since Linux 2.4)
ru: I<tcp_ecn> (Integer; по умолчанию: смотрите далее; начиная с Linux 2.4)

source: Enable RFC\ 3168 Explicit Congestion Notification.
ru: Включает RFC\ 3168 — уведомление о явной перегрузке (Explicit Congestion Notification).

source: This file can have one of the following values:
ru: В этом файле могут быть следующие значения:

source: Disable ECN. Neither initiate nor accept ECN. This was the default up to and including Linux 2.6.30.
ru: Отключить ECN. Не посылать и не принимать ECN. Было включено по умолчанию до Linux 2.6.30 включительно.

source: Enable ECN when requested by incoming connections and also request ECN on outgoing connection attempts.
ru: Включать ECN при запросе входящими соединениями, а также запрашивать ECN при попытках исходящих соединений.

source: Enable ECN when requested by incoming connections, but do not request ECN on outgoing connections. This value is supported, and is the default, since Linux 2.6.31.
ru: Включать ECN при запросе входящими соединениями, но не запрашивать ECN при попытках исходящих соединений. Данное значение поддерживается и включено по умолчанию начиная с Linux 2.6.31.

source: When enabled, connectivity to some destinations could be affected due to older, misbehaving middle boxes along the path, causing connections to be dropped. However, to facilitate and encourage deployment with option 1, and to work around such buggy equipment, the B<tcp_ecn_fallback> option has been introduced.
ru: При включении может пропасть возможность установления соединений с некоторыми узлами из-за некорректно работающих маршрутизаторов по пути следования, что выражается в обрыве (dropped) соединения. Однако для улучшения и содействия внедрению со значением 1 и для обхода такого некорректного оборудования был введён параметр B<tcp_ecn_fallback>.

source: I<tcp_ecn_fallback> (Boolean; default: enabled; since Linux 4.1)
ru: I<tcp_ecn_fallback> (Boolean; по умолчанию: включено; начиная с Linux 4.1)

source: Enable RFC\ 3168, Section 6.1.1.1. fallback. When enabled, outgoing ECN-setup SYNs that time out within the normal SYN retransmission timeout will be resent with CWR and ECE cleared.
ru: Включает переход на резервный вариант RFC\ 3168, Section 6.1.1.1. При включении исходящие устанавливающие ECN SYNы, на которые не было ответа за обычное время перепосылки SYN, будут перепосланы со сброшенными CWR и ECE.

source: I<tcp_fack> (Boolean; default: enabled; since Linux 2.2)
ru: I<tcp_fack> (Boolean; по умолчанию: включено; начиная с Linux 2.2)

source: Enable TCP Forward Acknowledgement support.
ru: Включает поддержку TCP Forward Acknowledgement (подтверждение передачи).

source: I<tcp_fin_timeout> (integer; default: 60; since Linux 2.2)
ru: I<tcp_fin_timeout> (integer; по умолчанию: 60; начиная с Linux 2.2)

source: This specifies how many seconds to wait for a final FIN packet before the socket is forcibly closed. This is strictly a violation of the TCP specification, but required to prevent denial-of-service attacks. In Linux 2.2, the default value was 180.
ru: Устанавливает количество секунд, в течение которых необходимо ждать последний пакет FIN перед принудительным закрытием сокета. Строго говоря, это нарушение спецификации TCP, но оно необходимо для предотвращения атак отказа в обслуживании (DoS). Значение по умолчанию в ядрах 2.2 равно 180.

source: I<tcp_frto> (integer; default: see below; since Linux 2.4.21/2.6)
ru: I<tcp_frto> (integer; по умолчанию: смотрите далее; начиная с Linux 2.4.21/2.6)
