Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: Enable F-RTO, an enhanced recovery algorithm for TCP retransmission timeouts (RTOs). It is particularly beneficial in wireless environments where packet loss is typically due to random radio interference rather than intermediate router congestion. See RFC 4138 for more details.
ru: Включает F-RTO — расширенный алгоритм восстановления пауз при повторных передачах TCP (RTO). В частности, он полезен в беспроводных средах, где потеря пакетов обычно происходит из-за произвольного возникающих радиопомех, а не из-за перегрузки промежуточного маршрутизатора. Подробности смотрите в RFC 4138.

source: Disabled. This was the default up to and including Linux 2.6.23.
ru: Отключено. Было включено по умолчанию до Linux 2.6.23 включительно.

source: The basic version F-RTO algorithm is enabled.
ru: Включить базовую версию алгоритма F-RTO.

source: Enable SACK-enhanced F-RTO if flow uses SACK. The basic version can be used also when SACK is in use though in that case scenario(s) exists where F-RTO interacts badly with the packet counting of the SACK-enabled TCP flow. This value is the default since Linux 2.6.24.
ru: Включить расширенный SACK алгоритм F-RTO, если поток использует SACK. Когда используется SACK, также может использоваться и базовая версия, хотя при этом возникают случаи, где F-RTO сработает плохо при подсчёте пакетов в потоке TCP с включённым SACK. Данное значение введено по умолчанию начиная с Linux 2.6.24.

source: Before Linux 2.6.22, this parameter was a Boolean value, supporting just values 0 and 1 above.
ru: До Linux 2.6.22 этот параметр имел тип Boolean, в котором поддерживаются только значения 0 и 1.

source: I<tcp_frto_response> (integer; default: 0; since Linux 2.6.22)
ru: I<tcp_frto_response> (integer; по умолчанию: 0; начиная с Linux 2.6.22)

source: When F-RTO has detected that a TCP retransmission timeout was spurious (i.e., the timeout would have been avoided had TCP set a longer retransmission timeout), TCP has several options concerning what to do next. Possible values are:
ru: Если F-RTO обнаруживает, что пауза при повторной передаче TCP не типична (т.е., паузы можно было бы избежать, если в TCP была бы установлена более длительная пауза повторной передачи), то у TCP есть несколько вариантов, что сделать дальше. Возможные значения:

source: Rate halving based; a smooth and conservative response, results in halved congestion window (I<cwnd>) and slow-start threshold (I<ssthresh>) after one RTT.
ru: Уменьшение скорости (rate) вдвое; плавный и осторожный ответ, приводит к уменьшению окна перегрузки (I<cwnd>) вдвое и предельной величине медленного старта (I<ssthresh>) после одного RTT.

source: Very conservative response; not recommended because even though being valid, it interacts poorly with the rest of Linux TCP; halves I<cwnd> and I<ssthresh> immediately.
ru: Очень осторожный ответ; не рекомендуется, так как хотя и допускается, но плохо взаимодействует с остальным Linux TCP; немедленно уменьшает I<cwnd> и I<ssthresh> вдвое.

source: Aggressive response; undoes congestion-control measures that are now known to be unnecessary (ignoring the possibility of a lost retransmission that would require TCP to be more cautious); I<cwnd> and I<ssthresh> are restored to the values prior to timeout.
ru: Активный ответ; отменяет оценки управления перегрузкой, которые теперь не нужны (игнорируется возможность потери повторной передачи, которая бы требовала от TCP большей бережливости); значения I<cwnd> и I<ssthresh> восстанавливаются в значения до паузы.

source: I<tcp_keepalive_intvl> (integer; default: 75; since Linux 2.4)
ru: I<tcp_keepalive_intvl> (integer; по умолчанию: 75; начиная с Linux 2.4)

source: The number of seconds between TCP keep-alive probes.
ru: Количество секунд между отправкой «поддерживающих» (keep-alive) проверочных пакетов.

source: I<tcp_keepalive_probes> (integer; default: 9; since Linux 2.2)
ru: I<tcp_keepalive_probes> (integer; по умолчанию: 9; начиная с Linux 2.2)

source: The maximum number of TCP keep-alive probes to send before giving up and killing the connection if no response is obtained from the other end.
ru: Максимальное количество отправляемых «поддерживающих» (keep-alive) пакетов TCP до разрыва соединения, если не будет получено ответа от другой стороны.

source: I<tcp_keepalive_time> (integer; default: 7200; since Linux 2.2)
ru: I<tcp_keepalive_time> (integer; по умолчанию: 7200; начиная с Linux 2.2)

source: The number of seconds a connection needs to be idle before TCP begins sending out keep-alive probes. Keep-alives are sent only when the B<SO_KEEPALIVE> socket option is enabled. The default value is 7200 seconds (2 hours). An idle connection is terminated after approximately an additional 11 minutes (9 probes an interval of 75 seconds apart) when keep-alive is enabled.
ru: Количество секунд между отсутствием передаваемых данных и отправкой через соединение «поддерживающих» пакетов. Эти пакеты будут отправляться, только если установлен параметра сокета B<SO_KEEPALIVE>. Значение по умолчанию равно 7200 секунд (2 часа). Бездействующее соединение разрывается примерно через 11 минут (9 пакетов, с интервалом 75 секунд) при включённом режиме keep-alive.

source: Note that underlying connection tracking mechanisms and application timeouts may be much shorter.
ru: Заметим, что механизмы слежения за соединением более низкого уровня и периоды ожидания приложений могут быть гораздо короче.

source: I<tcp_low_latency> (Boolean; default: disabled; since Linux 2.4.21/2.6)
ru: I<tcp_low_latency> (Boolean; по умолчанию: выключено; начиная с Linux 2.4.21/2.6)

source: If enabled, the TCP stack makes decisions that prefer lower latency as opposed to higher throughput. It this option is disabled, then higher throughput is preferred. An example of an application where this default should be changed would be a Beowulf compute cluster.
ru: Если включён, то при работе стека TCP отдаётся предпочтение меньшей задержке, а не более высокой производительности. Если параметр выключен, то предпочтение отдаётся высокой производительности. В качестве примера приложения, для которого нужно включить этот параметр, можно привести вычислительный кластер Beowulf.

source: I<tcp_max_orphans> (integer; default: see below; since Linux 2.4)
ru: I<tcp_max_orphans> (integer; по умолчанию: смотрите далее; начиная с Linux 2.4)

source: The maximum number of orphaned (not attached to any user file handle) TCP sockets allowed in the system. When this number is exceeded, the orphaned connection is reset and a warning is printed. This limit exists only to prevent simple denial-of-service attacks. Lowering this limit is not recommended. Network conditions might require you to increase the number of orphans allowed, but note that each orphan can eat up to ~64\ kB of unswappable memory. The default initial value is set equal to the kernel parameter NR_FILE. This initial default is adjusted depending on the memory in the system.
ru: Максимальное количество брошенных (orphaned, не присоединённых ни к одному пользовательскому обработчику файлов) сокетов TCP, разрешённых в системе. Если это количество превышается, то брошенные соединения сбрасываются и выводится предупреждение. Данное ограничение существует только для предотвращения простейших атак в обслуживании (DoS). Понижать этот лимит не рекомендуется. Иногда для сети может потребоваться увеличить это количество, но заметим, что на каждое такое брошенное соединение расходуется до 64\ КБ невыгружаемой памяти. Значение по умолчанию равно значению параметра ядра NR_FILE. Значение по умолчанию может изменяться в зависимости от количества памяти в системе.

source: I<tcp_max_syn_backlog> (integer; default: see below; since Linux 2.2)
ru: I<tcp_max_syn_backlog> (integer; по умолчанию: смотрите далее; начиная с Linux 2.2)

source: The maximum number of queued connection requests which have still not received an acknowledgement from the connecting client. If this number is exceeded, the kernel will begin dropping requests. The default value of 256 is increased to 1024 when the memory present in the system is adequate or greater (E<gt>= 128\ MB), and reduced to 128 for those systems with very low memory (E<lt>= 32\ MB).
ru: Максимальное количество запросов на соединение в очереди, которые пока не получили подтверждения от клиентов. Если это количество превышается, то ядро начнёт отбрасывать запросы. Значение по умолчанию (256) увеличивается до 1024, если в системе достаточно памяти (E<gt>= 128\ МБ) и уменьшается до 128, если памяти мало (E<lt>= 32\ МБ).

source: Prior to Linux 2.6.20, it was recommended that if this needed to be increased above 1024, the size of the SYNACK hash table (B<TCP_SYNQ_HSIZE>) in I<include/net/tcp.h> should be modified to keep
ru: До Linux 2.6.20 рекомендовалось, что если необходимо значение больше 1024, то нужно изменить размер хэш-таблицы SYNACK (B<TCP_SYNQ_HSIZE>)в I<include/net/tcp.h> сохраняя условие

source: and the kernel should be recompiled. In Linux 2.6.20, the fixed sized B<TCP_SYNQ_HSIZE> was removed in favor of dynamic sizing.
ru: и пересобрать ядро. В Linux 2.6.20 постоянный размер B<TCP_SYNQ_HSIZE> был заменён на динамически изменяемый.

source: I<tcp_max_tw_buckets> (integer; default: see below; since Linux 2.4)
ru: I<tcp_max_tw_buckets> (integer; по умолчанию: смотрите далее; начиная с Linux 2.4)

source: The maximum number of sockets in TIME_WAIT state allowed in the system. This limit exists only to prevent simple denial-of-service attacks. The default value of NR_FILE*2 is adjusted depending on the memory in the system. If this number is exceeded, the socket is closed and a warning is printed.
ru: Максимальное количество сокетов в состоянии TIME_WAIT, разрешённое в системе. Это ограничение существует только для предотвращения простейших атак DoS. По умолчанию равно NR_FILE*2 и изменяется в зависимости от количества памяти в системе. Если это значение превышено, то сокет закрывается и выводится предупреждение.

source: I<tcp_moderate_rcvbuf> (Boolean; default: enabled; since Linux 2.4.17/2.6.7)
ru: I<tcp_moderate_rcvbuf> (Boolean; по умолчанию: включено; начиная с Linux 2.4.17/2.6.7)

source: If enabled, TCP performs receive buffer auto-tuning, attempting to automatically size the buffer (no greater than I<tcp_rmem[2]>) to match the size required by the path for full throughput.
ru: Если включён, то для TCP включается автоматическая настройка приёмного буфера; при этом размер буфера (не более чем I<tcp_rmem[2]>) автоматически подгоняется под размер, используемый на пути прохождения трафика, в целях достижения максимальной пропускной способности.

source: I<tcp_mem> (since Linux 2.4)
ru: I<tcp_mem> (начиная с Linux 2.4)

source: This is a vector of 3 integers: [low, pressure, high]. These bounds, measured in units of the system page size, are used by TCP to track its memory usage. The defaults are calculated at boot time from the amount of available memory. (TCP can only use I<low memory> for this, which is limited to around 900 megabytes on 32-bit systems. 64-bit systems do not suffer this limitation.)
ru: Вектор из 3 целочисленных значений: [low, pressure, high]. Представляют собой границы, измеряемые в системных страницах памяти, используются в TCP для отслеживания использования памяти. По умолчанию рассчитываются во время загрузки ОС, зависят от количества памяти в системе (для этого в TCP может использоваться только I<нижняя память> (low memory), которая в 32-битных системах ограничена 900-ми мегабайтами. В 64-битных системах этого ограничения нет).

source: TCP doesn't regulate its memory allocation when the number of pages it has allocated globally is below this number.
ru: TCP не регулирует распределение своей памяти, если число страниц, выделенных глобально, ниже этого значения.

source: When the amount of memory allocated by TCP exceeds this number of pages, TCP moderates its memory consumption. This memory pressure state is exited once the number of pages allocated falls below the I<low> mark.
ru: Когда количество страниц, размещённых TCP, превышает это значение, то TCP изменяет свой метод использования памяти. Это состояние отменяется при падении количества размещённых страниц ниже значения I<low>.

source: The maximum number of pages, globally, that TCP will allocate. This value overrides any other limits imposed by the kernel.
ru: Глобальное (общее) максимальное количество страниц, которое может использовать TCP. Это значение переопределяет все другие ограничения, накладываемые ядром.

source: I<tcp_mtu_probing> (integer; default: 0; since Linux 2.6.17)
ru: I<tcp_mtu_probing> (integer; по умолчанию: 0; начиная с Linux 2.6.17)

source: This parameter controls TCP Packetization-Layer Path MTU Discovery. The following values may be assigned to the file:
ru: Этот параметр контролирует TCP Packetization-Layer Path MTU Discovery. В файле могут указываться следующие значения:

source: Disabled
ru: Выключен

source: Disabled by default, enabled when an ICMP black hole detected
ru: Включать при обнаружении чёрной дыры (black hole) ICMP

source: Always enabled, use initial MSS of I<tcp_base_mss>.
ru: Всегда включено, использовать начальное значение MSS из I<tcp_base_mss>.

source: I<tcp_no_metrics_save> (Boolean; default: disabled; since Linux 2.6.6)
ru: I<tcp_no_metrics_save> (Boolean; по умолчанию: выключено; начиная с Linux 2.6.6)

source: By default, TCP saves various connection metrics in the route cache when the connection closes, so that connections established in the near future can use these to set initial conditions. Usually, this increases overall performance, but it may sometimes cause performance degradation. If I<tcp_no_metrics_save> is enabled, TCP will not cache metrics on closing connections.
ru: По умолчанию, TCP сохраняет различные метрики соединения в кэше маршрутов при закрытии соединения для того, чтобы соединения, устанавливаемые в ближайшем будущем, могли использовать этот набор начальных состояний. Обычно, это увеличивает общую производительность, но иногда может и уменьшить её. Если I<tcp_no_metrics_save> включено, то TCP не кэширует метрики при закрытии соединений.

source: I<tcp_orphan_retries> (integer; default: 8; since Linux 2.4)
ru: I<tcp_orphan_retries> (integer; по умолчанию: 8; начиная с Linux 2.4)

source: The maximum number of attempts made to probe the other end of a connection which has been closed by our end.
ru: Максимальное количество попыток проверки другой стороны соединения перед закрытием с нашей стороны.

source: I<tcp_reordering> (integer; default: 3; since Linux 2.4)
ru: I<tcp_reordering> (integer; по умолчанию: 3; начиная с Linux 2.4)

source: The maximum a packet can be reordered in a TCP packet stream without TCP assuming packet loss and going into slow start. It is not advisable to change this number. This is a packet reordering detection metric designed to minimize unnecessary back off and retransmits provoked by reordering of packets on a connection.
ru: Максимальное количество пакетов, которое может быть переупорядочено в потоке TCP, при котором TCP ещё не считает что произошли потери и не переходит в состояние медленного запуска (slow start). Не рекомендуется менять это значение. Данная метрика обнаружения переупорядочивания пакетов предназначена для минимизации повторных передач, обусловленных переупорядочиванием пакетов в соединении.

source: I<tcp_retrans_collapse> (Boolean; default: enabled; since Linux 2.2)
ru: I<tcp_retrans_collapse> (Boolean; по умолчанию: включено; начиная с Linux 2.2)

source: Try to send full-sized packets during retransmit.
ru: При повторной передаче пробовать посылать полноразмерные пакеты.

source: I<tcp_retries1> (integer; default: 3; since Linux 2.2)
ru: I<tcp_retries1> (integer; по умолчанию: 3; начиная с Linux 2.2)

source: The number of times TCP will attempt to retransmit a packet on an established connection normally, without the extra effort of getting the network layers involved. Once we exceed this number of retransmits, we first have the network layer update the route if possible before each new retransmit. The default is the RFC specified minimum of 3.
ru: Количество попыток повторной передачи пакетов по установленному соединению без привлечения других сетевых уровней. При превышении данного количества, сетевой уровень обновляет маршрут перед каждым повтором (если это возможно). В RFC установлено минимальное значение по умолчанию: 3.

source: I<tcp_retries2> (integer; default: 15; since Linux 2.2)
ru: I<tcp_retries2> (integer; по умолчанию: 15; начиная с Linux 2.2)

source: The maximum number of times a TCP packet is retransmitted in established state before giving up. The default value is 15, which corresponds to a duration of approximately between 13 to 30 minutes, depending on the retransmission timeout. The RFC\ 1122 specified minimum limit of 100 seconds is typically deemed too short.
ru: Максимальное количество попыток повторной передачи пакетов TCP по установленному соединению до того, как оно будет считаться разорванным. По умолчанию равно 15, что соответствует времени примерно от 13 до 30 минут, в зависимости от значения таймера повторной передачи. В RFC\ 1122 установлена минимальная граница в 100 секунд, которая обычно считается слишком маленькой.

source: I<tcp_rfc1337> (Boolean; default: disabled; since Linux 2.2)
ru: I<tcp_rfc1337> (Boolean; по умолчанию: выключено; начиная с Linux 2.2)

source: Enable TCP behavior conformant with RFC\ 1337. When disabled, if a RST is received in TIME_WAIT state, we close the socket immediately without waiting for the end of the TIME_WAIT period.
ru: Включает поведение TCP, совместимое с RFC\ 1337. Если выключено, то: если в состоянии TIME_WAIT принимается RST, то сокет закрывается немедленно, не дожидаясь конца периода TIME_WAIT.

source: I<tcp_rmem> (since Linux 2.4)
ru: I<tcp_rmem> (начиная с Linux 2.4)

source: This is a vector of 3 integers: [min, default, max]. These parameters are used by TCP to regulate receive buffer sizes. TCP dynamically adjusts the size of the receive buffer from the defaults listed below, in the range of these values, depending on memory available in the system.
ru: Вектор из 3 целочисленных значений: [min, default, max]. Эти параметры используются TCP для регулирования размера буфера приёма. TCP динамически корректирует размер буфера приёма от значений по умолчанию, указанных ниже, в диапазоне этих переменных и в зависимости от количества памяти в системе.

source: minimum size of the receive buffer used by each TCP socket. The default value is the system page size. (On Linux 2.4, the default value is 4\ kB, lowered to B<PAGE_SIZE> bytes in low-memory systems.) This value is used to ensure that in memory pressure mode, allocations below this size will still succeed. This is not used to bound the size of the receive buffer declared using B<SO_RCVBUF> on a socket.
ru: Минимальный размер буфера приёма, используемый каждым сокетом TCP. По умолчанию равен размеру системной страницы (в Linux 2.4 равно 4\ КБ и может уменьшаться до B<PAGE_SIZE> байт в системах с малым количеством памяти). Это значение используется для того, чтобы размещение страниц памяти меньше этого значения в режиме давления (pressure) все равно выполнялось. Не ограничивает размер буфера приёма, объявленного для сокета с помощью B<SO_RCVBUF>.

source: the default size of the receive buffer for a TCP socket. This value overwrites the initial default buffer size from the generic global I<net.core.rmem_default> defined for all protocols. The default value is 87380 bytes. (On Linux 2.4, this will be lowered to 43689 in low-memory systems.) If larger receive buffer sizes are desired, this value should be increased (to affect all sockets). To employ large TCP windows, the I<net.ipv4.tcp_window_scaling> must be enabled (default).
ru: Размер буфера приёма по умолчанию для сокетов TCP. Это значение переопределяет начальный размер буфера по умолчанию, взятый из общей глобальной переменной I<net.core.rmem_default>, определённой для всех протоколов. По умолчанию равен 87380 байт (в Linux 2.4 это значение может уменьшаться до 43689 в системах с малым количеством памяти). Если желательны большие размеры буфера приёма, то это значение должно быть увеличено (влияет на все сокеты). Для разрешения больших размеров окон TCP должно быть включено I<net.ipv4.tcp_window_scaling> (по умолчанию).

source: the maximum size of the receive buffer used by each TCP socket. This value does not override the global I<net.core.rmem_max>. This is not used to limit the size of the receive buffer declared using B<SO_RCVBUF> on a socket. The default value is calculated using the formula
ru: Максимальный размер буфера приёма, используемый каждым сокетом TCP. Это значение не переопределяет значение глобальной переменной I<net.core.rmem_max>. Не используется для ограничения размера буфера приёма, объявленного для сокета через B<SO_RCVBUF>. Значение по умолчанию рассчитывается по следующей формуле

source: max(87380, min(4\ MB, I<tcp_mem>[1]*PAGE_SIZE/128))
ru: max(87380, min(4\ МБ, I<tcp_mem>[1]*PAGE_SIZE/128))

source: (On Linux 2.4, the default is 87380*2 bytes, lowered to 87380 in low-memory systems).
ru: (в Linux 2.4 значение по умолчанию равно 87380*2 байт, уменьшается до 87380 в системах с малым количеством памяти).

source: I<tcp_sack> (Boolean; default: enabled; since Linux 2.2)
ru: I<tcp_sack> (Boolean; по умолчанию: включено; начиная с Linux 2.2)

source: Enable RFC\ 2018 TCP Selective Acknowledgements.
ru: Включает выборочные подтверждения TCP (TCP Selective Acknowledgements), описанные в RFC\ 2018.

source: I<tcp_slow_start_after_idle> (Boolean; default: enabled; since Linux 2.6.18)
ru: I<tcp_slow_start_after_idle> (Boolean; по умолчанию: включено; начиная с Linux 2.6.18)

source: If enabled, provide RFC 2861 behavior and time out the congestion window after an idle period. An idle period is defined as the current RTO (retransmission timeout). If disabled, the congestion window will not be timed out after an idle period.
ru: Если включено, то разрешается поведение согласно RFC 2861 и таймаут окна перегрузки после периода простоя. Период простоя определяется текущим значением RTO (таймаут повторной передачи). Если выключено, то после окна перегрузки не следует таймаут после периода простоя.

source: I<tcp_stdurg> (Boolean; default: disabled; since Linux 2.2)
ru: I<tcp_stdurg> (Boolean; по умолчанию: выключено; начиная с Linux 2.2)

source: If this option is enabled, then use the RFC\ 1122 interpretation of the TCP urgent-pointer field. According to this interpretation, the urgent pointer points to the last byte of urgent data. If this option is disabled, then use the BSD-compatible interpretation of the urgent pointer: the urgent pointer points to the first byte after the urgent data. Enabling this option may lead to interoperability problems.
ru: Если значение включено, то для поля указателя срочных данных TCP используется интерпретация RFC\ 1122. Согласно этому указатель срочности указывает на последний байт срочных данных. Если это значение выключено, то для указателя на срочные данные применяется интерпретация, совместимая с BSD: указатель срочности указывает на первый байт после срочных данных. Включение этого значения может привести к проблемам с взаимодействием сетей.

source: I<tcp_syn_retries> (integer; default: 5; since Linux 2.2)
ru: I<tcp_syn_retries> (integer; по умолчанию: 5; начиная с Linux 2.2)

source: The maximum number of times initial SYNs for an active TCP connection attempt will be retransmitted. This value should not be higher than 255. The default value is 5, which corresponds to approximately 180 seconds.
ru: Максимальное количество посылаемых начальных пакетов SYN у активного соединения TCP. Значение должно быть меньше 255. Значение по умолчанию равно 5, что соответствует примерно 180 секундам.
