Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: I<tcp_synack_retries> (integer; default: 5; since Linux 2.2)
ru: I<tcp_synack_retries> (integer; по умолчанию: 5; начиная с Linux 2.2)

source: The maximum number of times a SYN/ACK segment for a passive TCP connection will be retransmitted. This number should not be higher than 255.
ru: Максимальное количество попыток повторной передачи сегмента SYN/ACK у пассивного соединения TCP. Значение должно быть меньше 255.

source: I<tcp_syncookies> (Boolean; since Linux 2.2)
ru: I<tcp_syncookies> (Boolean; начиная с Linux 2.2)

source: Enable TCP syncookies. The kernel must be compiled with B<CONFIG_SYN_COOKIES>. Send out syncookies when the syn backlog queue of a socket overflows. The syncookies feature attempts to protect a socket from a SYN flood attack. This should be used as a last resort, if at all. This is a violation of the TCP protocol, and conflicts with other areas of TCP such as TCP extensions. It can cause problems for clients and relays. It is not recommended as a tuning mechanism for heavily loaded servers to help with overloaded or misconfigured conditions. For recommended alternatives see I<tcp_max_syn_backlog>, I<tcp_synack_retries>, and I<tcp_abort_on_overflow>.
ru: Включает TCP syncookies. Ядро должно быть собрано с параметром B<CONFIG_SYN_COOKIES>. Это вызывает отправку syncookies при переполнении у сокета очереди syn backlog. Возможность syncookies создана для защиты сокета от атак переполнения SYN. Используйте её в самую последнюю очередь, а лучше вообще не используйте. Это является нарушением протокола TCP и конфликтует со многими другими областями TCP, например с расширениями TCP. Может привести к проблемам в работе клиентов и релеев. Не рекомендуется к использованию на высокозагруженных серверах в качестве «быстрой помощи» при перегрузках или некорректных настройках. В качестве рекомендуемой альтернативы смотрите I<tcp_max_syn_backlog>, I<tcp_synack_retries> и I<tcp_abort_on_overflow>.

source: I<tcp_timestamps> (integer; default: 1; since Linux 2.2)
ru: I<tcp_timestamps> (integer; по умолчанию: 1; начиная с Linux 2.2)

source: Set to one of the following values to enable or disable RFC\ 1323 TCP timestamps:
ru: Устанавливается в одно из следующих значений для включения меток времени RFC\ 1323 TCP:

source: Disable timestamps.
ru: Отключить метки времени.

source: Enable timestamps as defined in RFC1323 and use random offset for each connection rather than only using the current time.
ru: Включить метки времени, определённые в RFC1323, и использовать случайное смещение для каждого соединения, а не просто использовать текущее время.

source: As for the value 1, but without random offsets. Setting I<tcp_timestamps> to this value is meaningful since Linux 4.10.
ru: Как при значении 1, но без случайных смещений. Назначение I<tcp_timestamps> этого значения работает начиная с Linux 4.10.

source: I<tcp_tso_win_divisor> (integer; default: 3; since Linux 2.6.9)
ru: I<tcp_tso_win_divisor> (integer; по умолчанию: 3; начиная с Linux 2.6.9)

source: This parameter controls what percentage of the congestion window can be consumed by a single TCP Segmentation Offload (TSO) frame. The setting of this parameter is a tradeoff between burstiness and building larger TSO frames.
ru: Контролирует процент окна перегрузки, который может быть использован одиночным кадром TCP Segmentation Offload (TSO). Значение этого параметра — компромисс между временной нагрузкой (burstiness) и построением больших кадров TSO.

source: I<tcp_tw_recycle> (Boolean; default: disabled; Linux 2.4 to 4.11)
ru: I<tcp_tw_recycle> (Boolean; по умолчанию: выключено; в Linux 2.4 по 4.11)

source: Enable fast recycling of TIME_WAIT sockets. Enabling this option is not recommended as the remote IP may not use monotonically increasing timestamps (devices behind NAT, devices with per-connection timestamp offsets). See RFC 1323 (PAWS) and RFC 6191.
ru: Включает быстрое повторное использование сокетов с TIME_WAIT. Включение данного параметра не рекомендуется, так как удалённый IP может не использовать монотонно увеличивающиеся метки времени (устройства за NAT, устройства с выделенными на подключение смещёнными метками времени). Смотрите RFC 1323 (PAWS) и RFC 6191.

source: I<tcp_tw_reuse> (Boolean; default: disabled; since Linux 2.4.19/2.6)
ru: I<tcp_tw_reuse> (Boolean; по умолчанию: выключено; начиная с Linux 2.4.19/2.6)

source: Allow to reuse TIME_WAIT sockets for new connections when it is safe from protocol viewpoint. It should not be changed without advice/request of technical experts.
ru: Позволяет повторно использовать сокеты TIME_WAIT для новых соединений, если это безопасно с точки зрения протокола. Значение не должно изменяться без совета/запроса технических специалистов.

source: I<tcp_vegas_cong_avoid> (Boolean; default: disabled; Linux 2.2 to 2.6.13)
ru: I<tcp_vegas_cong_avoid> (Boolean; по умолчанию: выключено; с Linux 2.2 по 2.6.13)

source: Enable TCP Vegas congestion avoidance algorithm. TCP Vegas is a sender-side-only change to TCP that anticipates the onset of congestion by estimating the bandwidth. TCP Vegas adjusts the sending rate by modifying the congestion window. TCP Vegas should provide less packet loss, but it is not as aggressive as TCP Reno.
ru: Включает алгоритм избежания перегрузок TCP Vegas. TCP Vegas действует на стороне отправителя; он ожидает начала перегрузки, оценивая пропускную способность. TCP Vegas подгоняет частоту отправки, изменяя окно перегрузки. При включённом TCP Vegas обеспечиваются меньшие потери пакетов, но он не так стремителен как TCP Reno.

source: I<tcp_westwood> (Boolean; default: disabled; Linux 2.4.26/2.6.3 to 2.6.13)
ru: I<tcp_westwood> (Boolean; по умолчанию: выключено; с Linux 2.4.26/2.6.3 по 2.6.13)

source: Enable TCP Westwood+ congestion control algorithm. TCP Westwood+ is a sender-side-only modification of the TCP Reno protocol stack that optimizes the performance of TCP congestion control. It is based on end-to-end bandwidth estimation to set congestion window and slow start threshold after a congestion episode. Using this estimation, TCP Westwood+ adaptively sets a slow start threshold and a congestion window which takes into account the bandwidth used at the time congestion is experienced. TCP Westwood+ significantly increases fairness with respect to TCP Reno in wired networks and throughput over wireless links.
ru: Включает алгоритм управления перегрузками TCP Westwood+. TCP Westwood+ действует на стороне отправителя и является модификацией стека протокола TCP Reno, ориентированной на производительность управления перегрузками TCP. Он основан на оценке полосы пропускания от точки передачи до точки приёма при изменении окна перегрузки и порога медленного старта после возникновения перегрузки. Используя эту оценку TCP Westwood+ подстраивает порог медленного старта и окно перегрузки, принимая во внимание пропускную способность, полученную во время перегрузки. TCP Westwood+ значительно увеличивает плавность (fairness), по сравнению с TCP Reno, в проводных сетях и пропускную способность в беспроводных сетях.

source: I<tcp_window_scaling> (Boolean; default: enabled; since Linux 2.2)
ru: I<tcp_window_scaling> (Boolean; по умолчанию: включено; начиная с Linux 2.2)

source: Enable RFC\ 1323 TCP window scaling. This feature allows the use of a large window (E<gt> 64\ kB) on a TCP connection, should the other end support it. Normally, the 16 bit window length field in the TCP header limits the window size to less than 64\ kB. If larger windows are desired, applications can increase the size of their socket buffers and the window scaling option will be employed. If I<tcp_window_scaling> is disabled, TCP will not negotiate the use of window scaling with the other end during connection setup.
ru: Включает изменение размера окна TCP, описанное в RFC\ 1323 Эта возможность позволяет использовать большие (E<gt> 64\ КБ) окна для соединений TCP, но она должна также поддерживаться на другой стороне соединения. Обычно, 16-ти битовый размер поля длины окна в заголовке TCP ограничивает его размер до 64\ КБ. Если нужно обеспечить больший размер окна, то приложение должно увеличить размер своих буферов сокетов и включить возможность масштабирования окна. Если значение I<tcp_window_scaling> выключено, то TCP не будет согласовывать использование масштабирования окон с другой стороной во время установки соединения.

source: I<tcp_wmem> (since Linux 2.4)
ru: I<tcp_wmem> (начиная с Linux 2.4)

source: This is a vector of 3 integers: [min, default, max]. These parameters are used by TCP to regulate send buffer sizes. TCP dynamically adjusts the size of the send buffer from the default values listed below, in the range of these values, depending on memory available.
ru: Вектор из 3 целочисленных значений: [min, default, max]. Эти параметры используются TCP для управления размером буфера отправления. TCP динамически корректирует размер буфера отправления от значений по умолчанию, указанных ниже, в диапазоне этих переменных и в зависимости от количества доступной памяти.

source: Minimum size of the send buffer used by each TCP socket. The default value is the system page size. (On Linux 2.4, the default value is 4\ kB.) This value is used to ensure that in memory pressure mode, allocations below this size will still succeed. This is not used to bound the size of the send buffer declared using B<SO_SNDBUF> on a socket.
ru: Минимальный размер буфера отправления, используемый каждым сокетом TCP По умолчанию равен размеру системной страницы (в Linux 2.4 значение равно 4\ КБ). Это значение используется для того, чтобы размещение страниц памяти меньше этого значения в режиме давления (pressure) все равно выполнялось. Не ограничивает размер буфера отправления, объявленного для сокета с помощью B<SO_SNDBUF>.

source: The default size of the send buffer for a TCP socket. This value overwrites the initial default buffer size from the generic global I</proc/sys/net/core/wmem_default> defined for all protocols. The default value is 16\ kB. If larger send buffer sizes are desired, this value should be increased (to affect all sockets). To employ large TCP windows, the I</proc/sys/net/ipv4/tcp_window_scaling> must be set to a nonzero value (default).
ru: Размер буфера отправления по умолчанию для сокетов TCP Это значение переопределяет начальный размер буфера по умолчанию, взятый из общей глобальной переменной I</proc/sys/net/core/wmem_default>, определённой для всех протоколов. По умолчанию равно 16\ КБ. Если желательны большие размеры буферов отправления, то это значение должно быть увеличено (влияет на все сокеты). Для разрешения больших размеров окон TCP значение I</proc/sys/net/ipv4/tcp_window_scaling> должно быть ненулевым (по умолчанию).

source: The maximum size of the send buffer used by each TCP socket. This value does not override the value in I</proc/sys/net/core/wmem_max>. This is not used to limit the size of the send buffer declared using B<SO_SNDBUF> on a socket. The default value is calculated using the formula
ru: Максимальный размер буфера отправления, используемый каждым сокетом TCP. Это значение не переопределяет значение переменной I</proc/sys/net/core/wmem_max>. Не используется для ограничения размера буфера отправления, объявленного для сокета через B<SO_SNDBUF>. Значение по умолчанию рассчитывается по следующей формуле

source: max(65536, min(4\ MB, I<tcp_mem>[1]*PAGE_SIZE/128))
ru: max(65536, min(4\ МБ, I<tcp_mem>[1]*PAGE_SIZE/128))

source: (On Linux 2.4, the default value is 128\ kB, lowered 64\ kB depending on low-memory systems.)
ru: (в Linux 2.4 значение по умолчанию равно 128\ КБ, уменьшается до 64\ КБ в системах с малым количеством памяти).

source: I<tcp_workaround_signed_windows> (Boolean; default: disabled; since Linux 2.6.26)
ru: I<tcp_workaround_signed_windows> (Boolean; по умолчанию: выключено; начиная с Linux 2.6.26)

source: If enabled, assume that no receipt of a window-scaling option means that the remote TCP is broken and treats the window as a signed quantity. If disabled, assume that the remote TCP is not broken even if we do not receive a window scaling option from it.
ru: Если включено, то предполагать, что неполучение параметра окна масштабирования означает, что удалённый TCP повреждён и считать размер окна как число со знаком. Если выключено, то предполагается, что удалённый TCP не повреждён, даже если мы не получаем от него параметр окна масштабирования.

source: Socket options
ru: Параметры сокета

source: To set or get a TCP socket option, call B<getsockopt>(2) to read or B<setsockopt>(2) to write the option with the option level argument set to B<IPPROTO_TCP>. Unless otherwise noted, I<optval> is a pointer to an I<int>. In addition, most B<IPPROTO_IP> socket options are valid on TCP sockets. For more information see B<ip>(7).
ru: Для получения и задания параметров сокетов TCP используйте вызов B<getsockopt>(2) и B<setsockopt>(2), соответственно. Значение аргумента уровня параметров должно быть равно B<IPPROTO_TCP>. Если не указано обратное, I<optval> — это указатель на I<int>. Кроме того, сокетам TCP доступно большинство параметров сокета B<IPPROTO_IP>. Дополнительная информация приведена в B<ip>(7).

source: Following is a list of TCP-specific socket options. For details of some other socket options that are also applicable for TCP sockets, see B<socket>(7).
ru: В следующем списке представлены параметры только для сокетов TCP. О других параметрах, применимых к сокетам TCP, читайте в B<socket>(7).

source: B<TCP_CONGESTION> (since Linux 2.6.13)
ru: B<TCP_CONGESTION> (начиная с Linux 2.6.13)

source: The argument for this option is a string. This option allows the caller to set the TCP congestion control algorithm to be used, on a per-socket basis. Unprivileged processes are restricted to choosing one of the algorithms in I<tcp_allowed_congestion_control> (described above). Privileged processes (B<CAP_NET_ADMIN>) can choose from any of the available congestion-control algorithms (see the description of I<tcp_available_congestion_control> above).
ru: Аргументом этого параметра является строка. Данный параметр позволяет вызывающему задать используемый алгоритм управления перегрузкой TCP, для каждого сокета. Для непривилегированных процессов выбор ограничен одним из алгоритмов I<tcp_allowed_congestion_control> (описано выше). Привилегированные процессы (B<CAP_NET_ADMIN>) могут выбирать любой из доступных алгоритмов контроля перегрузки (смотрите описание I<tcp_available_congestion_control> выше).

source: B<TCP_CORK> (since Linux 2.2)
ru: B<TCP_CORK> (начиная с Linux 2.2)

source: If set, don't send out partial frames. All queued partial frames are sent when the option is cleared again. This is useful for prepending headers before calling B<sendfile>(2), or for throughput optimization. As currently implemented, there is a 200 millisecond ceiling on the time for which output is corked by B<TCP_CORK>. If this ceiling is reached, then queued data is automatically transmitted. This option can be combined with B<TCP_NODELAY> only since Linux 2.5.71. This option should not be used in code intended to be portable.
ru: Если установлен, то не посылать частичные кадры. Все поставленные в очередь частичные кадры будут отосланы, когда этот параметр будет очищен. Это полезно для подготовки заголовков перед вызовом B<sendfile>(2) или для оптимизации пропускной способности. В текущей реализации отводится максимум (ceiling) 200 миллисекунд, в течение которых вывод закупоривается (corked) из-за B<TCP_CORK>. Если этот максимум достигнут, то данные в очереди передаются автоматически. Этот параметр можно совмещать с B<TCP_NODELAY> только начиная с Linux 2.5.71. Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_DEFER_ACCEPT> (since Linux 2.4)
ru: B<TCP_DEFER_ACCEPT> (начиная с Linux 2.4)

source: Allow a listener to be awakened only when data arrives on the socket. Takes an integer value (seconds), this can bound the maximum number of attempts TCP will make to complete the connection. This option should not be used in code intended to be portable.
ru: Позволяет слушающему просыпаться только при поступлении данных на сокет. Принимает целое значение (секунды), может ограничить максимальное количество попыток TCP закрытия этого соединения. Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_INFO> (since Linux 2.4)
ru: B<TCP_INFO> (начиная с Linux 2.4)

source: Used to collect information about this socket. The kernel returns a I<struct tcp_info> as defined in the file I</usr/include/linux/tcp.h>. This option should not be used in code intended to be portable.
ru: Используется для сбора информации об этом сокете. Ядро возвращает структуру I<struct tcp_info>, определённую в файле I</usr/include/linux/tcp.h>. Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_KEEPCNT> (since Linux 2.4)
ru: B<TCP_KEEPCNT> (начиная с Linux 2.4)

source: The maximum number of keepalive probes TCP should send before dropping the connection. This option should not be used in code intended to be portable.
ru: Максимальное число проверок (keepalive probes) TCP, отправляемых перед сбросом соединения. Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_KEEPIDLE> (since Linux 2.4)
ru: B<TCP_KEEPIDLE> (начиная с Linux 2.4)

source: The time (in seconds) the connection needs to remain idle before TCP starts sending keepalive probes, if the socket option B<SO_KEEPALIVE> has been set on this socket. This option should not be used in code intended to be portable.
ru: Время (в секундах) простоя (idle) соединения, по прошествии которого TCP начнёт отправлять проверочные пакеты (keepalive probes), если для сокета включён параметр B<SO_KEEPALIVE>. Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_KEEPINTVL> (since Linux 2.4)
ru: B<TCP_KEEPINTVL> (начиная с Linux 2.4)

source: The time (in seconds) between individual keepalive probes. This option should not be used in code intended to be portable.
ru: Время в секундах между отправками отдельных проверочных пакетов (keepalive probes). Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_LINGER2> (since Linux 2.4)
ru: B<TCP_LINGER2> (начиная с Linux 2.4)

source: The lifetime of orphaned FIN_WAIT2 state sockets. This option can be used to override the system-wide setting in the file I</proc/sys/net/ipv4/tcp_fin_timeout> for this socket. This is not to be confused with the B<socket>(7) level option B<SO_LINGER>. This option should not be used in code intended to be portable.
ru: Время жизни брошенных (orphaned) сокетов в состоянии FIN_WAIT2. Этот параметр может использоваться для переопределения общесистемного параметра из файла I</proc/sys/net/ipv4/tcp_fin_timeout> данного сокета. Значение не должно противоречить параметру B<SO_LINGER> уровня сокета B<socket>(7). Данный параметр не должен использоваться, если требуется переносимость кода.

source: The maximum segment size for outgoing TCP packets. In Linux 2.2 and earlier, and in Linux 2.6.28 and later, if this option is set before connection establishment, it also changes the MSS value announced to the other end in the initial packet. Values greater than the (eventual) interface MTU have no effect. TCP will also impose its minimum and maximum bounds over the value provided.
ru: Максимальный размер сегмента для исходящих пакетов TCP. В Linux 2.2 и ранее, и в Linux 2.6.28 и новее, если этот параметр задан до установления соединения, то меняется также и значение MSS, сообщаемое другой стороне в начальном пакете. Значения, превышающие MTU интерфейса, игнорируются. TCP также будет определять минимальную и максимальную границу поверх этих значений.

source: If set, disable the Nagle algorithm. This means that segments are always sent as soon as possible, even if there is only a small amount of data. When not set, data is buffered until there is a sufficient amount to send out, thereby avoiding the frequent sending of small packets, which results in poor utilization of the network. This option is overridden by B<TCP_CORK>; however, setting this option forces an explicit flush of pending output, even if B<TCP_CORK> is currently set.
ru: Если включён, то отменяется выполнение алгоритма Nagle. Это означает, что сегменты всегда отсылаются при первой же возможности, даже если к отправке назначено небольшое количество данных. Если выключен, то данные буферизируются и будут отправлены только после набора достаточно большого количества данных, поэтому небольшие пакеты с данными не отправляются. Этот параметр переопределяется B<TCP_CORK>; однако, установка данного параметра вызывает явную очистку ожидающих вывода данных, даже если установлен B<TCP_CORK>.

source: B<TCP_QUICKACK> (since Linux 2.4.4)
ru: B<TCP_QUICKACK> (начиная с Linux 2.4.4)

source: Enable quickack mode if set or disable quickack mode if cleared. In quickack mode, acks are sent immediately, rather than delayed if needed in accordance to normal TCP operation. This flag is not permanent, it only enables a switch to or from quickack mode. Subsequent operation of the TCP protocol will once again enter/leave quickack mode depending on internal protocol processing and factors such as delayed ack timeouts occurring and data transfer. This option should not be used in code intended to be portable.
ru: Включает режим quickack при установке или выключает при сбросе. В этом режиме все уведомления отправляются немедленно, а не с некоторой задержкой в соответствии с обычной работой TCP. Этот флаг не постоянный, он только включает или выключает режим quickack. Последующие операции с протоколом TCP будут по своему включать/выключать этот режим в зависимости от своих внутренних протоколов, настроек и факторов. Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_SYNCNT> (since Linux 2.4)
ru: B<TCP_SYNCNT> (начиная с Linux 2.4)

source: Set the number of SYN retransmits that TCP should send before aborting the attempt to connect. It cannot exceed 255. This option should not be used in code intended to be portable.
ru: Устанавливает количество повторных передач SYN, которое должен послать TCP до отмены попытки установки соединения. Не должно превышать 255. Данный параметр не должен использоваться, если требуется переносимость кода.

source: B<TCP_USER_TIMEOUT> (since Linux 2.6.37)
ru: B<TCP_USER_TIMEOUT> (начиная с Linux 2.6.37)

source: This option takes an I<unsigned int> as an argument. When the value is greater than 0, it specifies the maximum amount of time in milliseconds that transmitted data may remain unacknowledged before TCP will forcibly close the corresponding connection and return B<ETIMEDOUT> to the application. If the option value is specified as 0, TCP will use the system default.
ru: Типом аргумента этого параметра является I<unsigned int>. Если значение больше 0, то им задаётся максимальное количество времени в миллисекундах, которое передаваемые данные могут оставаться неподтверждёнными до того, как TCP принудительно закроет соответствующее соединение и приложению вернётся B<ETIMEDOUT>. Если значение равно 0, то TCP будет использовать значение по умолчанию.
