Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: A B<tmpfs> filesystem mounted at I</dev/shm> is used for the implementation of POSIX shared memory (B<shm_overview>(7)) and POSIX semaphores (B<sem_overview>(7)).
ru: Файловая система B<tmpfs>, смонтированная в I</dev/shm>, используется для реализации общей памяти POSIX (B<shm_overview>(7)) и семафоров POSIX (B<sem_overview>(7)).

source: The amount of memory consumed by all B<tmpfs> filesystems is shown in the I<Shmem> field of I</proc/meminfo> and in the I<shared> field displayed by B<free>(1).
ru: Объём памяти, использованной во всех файловых системах B<tmpfs> показывается в поле I<Shmem> файла I</proc/meminfo> и в поле I<shared>, показываемом B<free>(1).

source: The B<tmpfs> facility was formerly called B<shmfs>.
ru: Свойство B<tmpfs> раньше называлось B<shmfs>.

source: The kernel source files I<Documentation/filesystems/tmpfs.txt> and I<Documentation/admin-guide/mm/transhuge.rst>.
ru: Файлы исходного кода ядра I<Documentation/filesystems/tmpfs.txt> и I<Documentation/admin-guide/mm/transhuge.rst>.

source: tzfile - timezone information
ru: tzfile - информация о часовом поясе

source: The timezone information files used by B<tzset>(3) are typically found under a directory with a name like I</usr/share/zoneinfo>. These files begin with a 44-byte header containing the following fields:
ru: Файлы с информацией о часовых поясах, используемые B<tzset>(3), обычно, находятся в каталоге I</usr/share/zoneinfo>. Они начинаются с 44-байтного заголовка, содержащего следующие поля:

source: The magic four-byte ASCII sequence
ru: Информационная (magic) четырехбайтовая последовательность ASCII

source: identifies the file as a timezone information file.
ru: , означающая, что это файл с информацией о часовом поясе.

source: A byte identifying the version of the file's format (as of 2017, either an ASCII NUL, or
ru: Байт с версией формата файла (например 2017, ASCII NUL или

source: or
ru: или

source: Fifteen bytes containing zeros reserved for future use.
ru: Пятнадцать байт, заполненных нулями, зарезервированы для использования в будущем.

source: Six four-byte integer values written in a standard byte order (the high-order byte of the value is written first). These values are, in order:
ru: Шесть четырехбайтовых целых значений, записанных в стандартном порядке байт (старший байт значения записывается первым). Значения по порядку:

source: The number of UT/local indicators stored in the file.
ru: Количество UT/локальных (local) индикаторов в файле.

source: The number of standard/wall indicators stored in the file.
ru: Количество стандартных/местных (wall) индикаторов в файле.

source: The number of leap seconds for which data entries are stored in the file.
ru: Количество високосных секунд, для которых в файле определены элементы данных.

source: The number of transition times for which data entries are stored in the file.
ru: Количество моментов перевода часов, для которых в файле определены элементы данных.

source: The number of local time types for which data entries are stored in the file (must not be zero).
ru: Количество типов локального времени, для которых в файле определены элементы данных (не должно быть равно 0).

source: The number of bytes of time zone abbreviation strings stored in the file.
ru: Количество байт строк аббревиатур часовых поясов, определённых в файле.

source: The above header is followed by the following fields, whose lengths depend on the contents of the header:
ru: После заголовка, описанного выше, располагаются поля, длина которых зависит от содержимого заголовка:

source: I<tzh_timecnt> four-byte signed integer values sorted in ascending order. These values are written in standard byte order. Each is used as a transition time (as returned by B<time>(2)) at which the rules for computing local time change.
ru: Четырёхбайтовые знаковые целые I<tzh_timecnt>, сортируются в порядке возрастания. Эти значения записываются в стандартном порядке байт. Каждое значение используется как момент перевода часов (возвращаемый B<time>(2)), по правилам которого вычисляется изменение локального времени.

source: I<tzh_timecnt> one-byte unsigned integer values; each one but the last tells which of the different types of local time types described in the file is associated with the time period starting with the same-indexed transition time and continuing up to but not including the next transition time. (The last time type is present only for consistency checking with the POSIX-style TZ string described below.) These values serve as indices into the next field.
ru: Однобайтовые беззнаковые целые I<tzh_timecnt>; все кроме последнего описывают как различные типы типов локального времени, указанные в файле, связаны с периодом времени, начинающимся как переходное время с тем же индексом и перечисляются (исключая) до следующего переходного времени (тип последнего времени указывается только для проверки целостности строки TZ в формате POSIX, описанном ниже). Эти значения служат индексами для следующего поля.

source: I<tzh_typecnt> I<ttinfo> entries, each defined as follows:
ru: Элементы I<tzh_typecnt> I<ttinfo> определены следующим образом:

source: Each structure is written as a four-byte signed integer value for I<tt_gmtoff>, in a standard byte order, followed by a one-byte value for I<tt_isdst> and a one-byte value for I<tt_abbrind>. In each structure, I<tt_gmtoff> gives the number of seconds to be added to UT, I<tt_isdst> tells whether I<tm_isdst> should be set by B<localtime>(3) and I<tt_abbrind> serves as an index into the array of time zone abbreviation bytes that follow the I<ttinfo> structure(s) in the file.
ru: Каждая структура состоит из четырехбайтного знакового числа I<tt_gmtoff>, записанного в стандартном порядке байт; за ним следует однобайтное значение I<tt_isdst> и однобайтное значение I<tt_abbrind>. В каждой структуре I<tt_gmtoff> означает, сколько секунд надо добавить к UT; I<tt_isdst> определяет, будет ли I<tm_isdst> устанавливаться B<localtime>(3), а I<tt_abbrind> является индексом массива аббревиатур байт часовых поясов, за которым в файле следуют структуры I<ttinfo>.

source: I<tzh_leapcnt> pairs of four-byte values, written in standard byte order; the first value of each pair gives the nonnegative time (as returned by B<time>(2)) at which a leap second occurs; the second gives the I<total> number of leap seconds to be applied during the time period starting at the given time. The pairs of values are sorted in ascending order by time. Each transition is for one leap second, either positive or negative; transitions always separated by at least 28 days minus 1 second.
ru: Пары четырехбайтных значений I<tzh_leapcnt>, записанные в стандартном порядке байт; первое значение каждой пары задает неотрицательное время (возвращаемое B<time>(2)) появления високосной секунды; вторая пара определяет I<общее> количество високосных секунд, добавляемых во время периода времени, начинающегося в указанное время. Пары значений располагаются в порядке возрастания времени. Каждым переходом считается одна високосная секунда, положительная или отрицательная; переходы всегда отстают друг от друга на не менее чем 28 дней минус 1 секунда.

source: I<tzh_ttisstdcnt> standard/wall indicators, each stored as a one-byte value; they tell whether the transition times associated with local time types were specified as standard time or wall clock time, and are used when a timezone file is used in handling POSIX-style timezone environment variables.
ru: Индикаторы стандартного/местного времени I<tzh_ttisstdcnt>, хранимые в виде однобайтовых значений; эти индикаторы определяют, как связаны моменты перевода часов с локальными типами времени: согласно стандартному или местному времени. Эти индикаторы используются, когда файл с информацией о часовых поясах работает с POSIX-совместимыми переменными окружения часовых поясов.

source: I<tzh_ttisgmtcnt> UT/local indicators, each stored as a one-byte value; they tell whether the transition times associated with local time types were specified as UT or local time, and are used when a timezone file is used in handling POSIX-style timezone environment variables.
ru: UT/локальные индикаторы I<tzh_ttisgmtcnt>, хранимые в виде однобайтовых значений; эти индикаторы определяют, как связаны моменты перевода часов с локальными типами времени: согласно UT или локальному времени. Эти индикаторы используются, когда файл с информацией о часовых поясах работает с POSIX-совместимыми переменными окружения часовых поясов.

source: The B<localtime>(3) function uses the first standard-time I<ttinfo> structure in the file (or simply the first I<ttinfo> structure in the absence of a standard-time structure) if either I<tzh_timecnt> is zero or the time argument is less than the first transition time recorded in the file.
ru: Функция I<localtime>(3) использует первую структуру стандартного времени I<ttinfo> из этого файла (или просто первую структуру I<ttinfo> при отсутствии структуры стандартного времени), если значение I<tzh_timecnt> равно нулю или аргумент времени меньше первого момента перевода часов, записанного в файле.

source: Version 2 format
ru: Формат версии 2

source: For version-2-format timezone files, the above header and data are followed by a second header and data, identical in format except that eight bytes are used for each transition time or leap second time. (Leap second counts remain four bytes.) After the second header and data comes a newline-enclosed, POSIX-TZ-environment-variable-style string for use in handling instants after the last transition time stored in the file or for all instants if the file has no transitions. The POSIX-style TZ string is empty (i.e., nothing between the newlines) if there is no POSIX representation for such instants. If nonempty, the POSIX-style TZ string must agree with the local time type after the last transition time if present in the eight-byte data; for example, given the string
ru: Для файлов версии 2 с информацией о часовых поясах вышеприведённый заголовок и данные, идущие за вторым заголовком и данными, идентичны по формату, за исключением того, что для каждого перевода времени или високосной секунды используется восемь байт (високосная секунда занимает оставшиеся четыре байта). После второго заголовка и данных следует закрывающий символ новой строки, строка в формате переменной TZ из окружения POSIX для обработки моментов сразу после последнего перевода времени, хранящегося в файле или для всех моментов, если в файле нет переводов. Строка TZ в формате POSIX будет пустой (т. е. между символами новой строки ничего нет), если для таких моментов нет представления POSIX. Если она не пуста, то строка TZ в формате POSIX должна соответствовать типу локального времени после обоих данных о временах последнего перевода, если она представлена в виде восьми байтов данных; например, если задана строка

source: then if a last transition time is in July, the transition's local time type must specify a daylight-saving time abbreviated
ru: то, если последний перевод времени был в июле, тип перевода локального времени должен задаваться сокращением для времени перевода на зимнее время

source: that is one hour east of UT. Also, if there is at least one transition, time type 0 is associated with the time period from the indefinite past up to but not including the earliest transition time.
ru: то соответствует одному часу UT. Также, если есть хотя бы один перевод, то тип времени 0 связывается с периодом времени из бесконечного прошлого до, но исключая, самый ранний перевод времени.

source: Version 3 format
ru: Формат версии 3

source: For version-3-format timezone files, the POSIX-TZ-style string may use two minor extensions to the POSIX TZ format, as described in B<newtzset>(3). First, the hours part of its transition times may be signed and range from -167 through 167 instead of the POSIX-required unsigned values from 0 through 24. Second, DST is in effect all year if it starts January 1 at 00:00 and ends December 31 at 24:00 plus the difference between daylight saving and standard time.
ru: В формате файлов часовых поясов версии 3 в строке в стиле POSIX-TZ можно использовать два небольших расширения формата POSIX TZ, это описывается в B<newtzset>(3). Во-первых, часовая часть времён перевода может быть знаковой и имеет диапазон с -167 по 167, и не соответствовать беззнаковому значению POSIX от 0 до 24. Во-вторых, DST действует на весь год, если он начинается с 1 января 00:00 и заканчивается 31 декабря в 24:00 плюс разница между зимним и обычным временем.

source: Future changes to the format may append more data.
ru: В будущих изменениях формата могут появиться дополнительные данные.

source: termcap - terminal capability database
ru: termcap - база данных параметров терминалов

source: The termcap database is an obsolete facility for describing the capabilities of character-cell terminals and printers. It is retained only for capability with old programs; new programs should use the B<terminfo>(5) database and associated libraries.
ru: База данных termcap - это устаревший метод описания возможностей алфавитно-цифровых терминалов и принтеров. Он оставлен лишь для обеспечения совместимости со старыми программами; новые программы должны использовать базу данных B<terminfo>(5) и соответствующие ей библиотеки.

source: I</etc/termcap> is an ASCII file (the database master) that lists the capabilities of many different types of terminals. Programs can read termcap to find the particular escape codes needed to control the visual attributes of the terminal actually in use. (Other aspects of the terminal are handled by B<stty>(1).) The termcap database is indexed on the B<TERM> environment variable.
ru: I</etc/termcap> представляет собой ASCII-файл (исходный текст базы данных), содержащий список параметров, принадлежащих различным типам терминалов. Программы могут читать содержимое termcap для того, чтобы распознавать управляющие последовательности, необходимые для контроля за визуальными атрибутами терминала. (Другие свойства терминалов контролируются B<stty>(1).) База данных termcap проиндексирована в соответствии с переменной окружения B<TERM>.

source: Termcap entries must be defined on a single logical line, with \(aq\e\(aq used to suppress the newline. Fields are separated by \(aq:\(aq. The first field of each entry starts at the left-hand margin, and contains a list of names for the terminal, separated by \(aq|\(aq.
ru: Записи termcap должны быть расположены в одной логической строке, в которой \(aq\e\(aq используется для подавления символа новой строки. Поля разделяются символом \(aq:\(aq. Первое поле каждой записи начинается с крайней левой колонки и содержит список названий терминала, разделенных \(aq|\(aq.

source: The first subfield may (in BSD termcap entries from versions 4.3 and earlier) contain a short name consisting of two characters. This short name may consist of capital or small letters. In 4.4BSD, termcap entries this field is omitted.
ru: Первое подполе может содержать краткое название терминала, состоящее из двух символов (это касается записей termcap в BSD версии 4.3 и более ранних). Это короткое имя может состоять из прописных и строчных букв. В записях termcap BSD версии 4.4 это поле не учитывается.

source: The second subfield (first, in the newer 4.4BSD format) contains the name used by the environment variable B<TERM>. It should be spelled in lowercase letters. Selectable hardware capabilities should be marked by appending a hyphen and a suffix to this name. See below for an example. Usual suffixes are w (more than 80 characters wide), am (automatic margins), nam (no automatic margins), and rv (reverse video display). The third subfield contains a long and descriptive name for this termcap entry.
ru: Второе подполе (первое в формате BSD 4.4) содержит название терминала, используемое в переменной окружения B<TERM>. Оно должно быть написано строчными буквами. Различающиеся аппаратные возможности должны отмечаться при помощи суффикса, добавляемого к названию терминала через дефис. Смотрите пример, приведенный ниже. Обычные суффиксы: w (ширина терминала больше 80-и символов), am (автоматические границы), nam (нет автоматических границ) и rv (инверсный видеодисплей). Третье подполе содержит длинное описательное название записи termcap.

source: Subsequent fields contain the terminal capabilities; any continued capability lines must be indented one tab from the left margin.
ru: Последующие поля содержат параметры терминала; любые строки, являющиеся продолжением записи, должны начинаться с одного символа табуляции у левой границы.

source: Although there is no defined order, it is suggested to write first boolean, then numeric, and then string capabilities, each sorted alphabetically without looking at lower or upper spelling. Capabilities of similar functions can be written in one line.
ru: Несмотря на то, что порядок задания параметров не определён, рекомендуется сначала задавать логические параметры, затем числовые и только после них строковые параметры терминала. Каждая группа должна быть отсортирована в алфавитном порядке, без учета регистра. Параметры похожих свойств терминала должны быть записаны в одной строке.

source: Example for:
ru: Пример:

source: Head line: vt|vt101|DEC VT 101 terminal in 80 character mode:\e Head line: Vt|vt101-w|DEC VT 101 terminal in (wide) 132 character mode:\e Boolean: :bs:\e Numeric: :co#80:\e String: :sr=\eE[H:\e
ru: Загл. строка: vt|vt101|DEC VT 101 terminal in 80 character mode:\e З. строка: Vt|vt101-w|DEC VT 101 terminal in (wide) 132 character mode:\e Логическое значение: :bs:\e Цифровое значение: :co#80:\e Строковое значение: :sr=\eE[H:\e

source: Boolean capabilities
ru: Возможности с логическими значениями

source: 5i Printer will not echo on screen am Automatic margins which means automatic line wrap bs Control-H (8 dec.) performs a backspace bw Backspace on left margin wraps to previous line and right margin da Display retained above screen db Display retained below screen eo A space erases all characters at cursor position es Escape sequences and special characters work in status line gn Generic device hc This is a hardcopy terminal HC The cursor is hard to see when not on bottom line hs Has a status line hz Hazeltine bug, the terminal can not print tilde characters in Terminal inserts null bytes, not spaces, to fill whitespace km Terminal has a meta key mi Cursor movement works in insert mode ms Cursor movement works in standout/underline mode NP No pad character NR ti does not reverse te nx No padding, must use XON/XOFF os Terminal can overstrike ul Terminal underlines although it can not overstrike xb Beehive glitch, f1 sends ESCAPE, f2 sends B<^C> xn Newline/wraparound glitch xo Terminal uses xon/xoff protocol xs Text typed over standout text will be displayed in standout xt Teleray glitch, destructive tabs and odd standout mode
ru: 5i Принтер не будет повторять символ на экране am Автоматические поля, т.е. автоматический перевод строки bs Control-H (8 дес.) выполняет забой (стирание) bw При забое на левом поле выполняется переход к правому полю на предыдущую строку da Дисплей фиксируется вверху экрана db Дисплей фиксируется внизу экрана eo Пространство, стирающее все символы от позиции курсора es Спец. последовательность и специальные символы работают в строке состояния gn Обычное устройство hc Печатающий терминал HC Курсор плохо видно, когда он не на нижней строке hs Есть строка состояния hz Ошибка Hazeltine, терминал не может печатать символы тильды in Терминал вставляет байты null, а не пробелы для заполнения km У терминала есть клавиша мета mi В режиме вставки работает перемещение курсора ms В режиме выделения/подчёркивания работает перемещение курсора NP Нет символа-заполнителя NR ti не выполняет инверсию te nx Заполнения нет, нужно использовать XON/XOFF os Терминал может печатать наложением ul Терминал умеет подчёркивать, но не поддерживает наложение xb Сбой beehive, f1 посылает ESCAPE, f2 посылает B<^C> xn Сбой при добавлении новой строки/переноса xo Терминал использует протокол xon/xoff xs Текст, набранный поверх выделенного, будет показан выделенным xt Сбой teleray, разрушающие табуляции и странный режим выделения

source: Numeric capabilities
ru: Возможности с цифровыми значениями

source: co Number of columns dB Delay in milliseconds for backspace on hardcopy terminals dC Delay in milliseconds for carriage return on hardcopy terminals dF Delay in milliseconds for form feed on hardcopy terminals dN Delay in milliseconds for new line on hardcopy terminals dT Delay in milliseconds for tabulator stop on hardcopy terminals dV Delay in milliseconds for vertical tabulator stop on hardcopy terminals it Difference between tab positions lh Height of soft labels lm Lines of memory lw Width of soft labels li Number of lines Nl Number of soft labels pb Lowest baud rate which needs padding sg Standout glitch ug Underline glitch vt virtual terminal number ws Width of status line if different from screen width
ru: co Количество столбцов dB Задержка в миллисекундах для забоя на печатающих терминалах dC Задержка в миллисекундах для возврата каретки на печатающих терминалах dF Задержка в миллисекундах для перевода страницы на печатающих терминалах dN Задержка в миллисекундах для новой строки на печатающих терминалах dT Задержка в миллисекундах для остановки табуляции на печатающих терминалах dV Задержка в миллисекундах для остановки вертикальной табуляции на печатающих терминалах it Промежуток между позициями табуляции lh Высота функциональных ярлыков lm Количество строк памяти lw Ширина функциональных ярлыков li Количество строк Nl Количество функциональных ярлыков pb Минимальная скорость в бодах для заполнения sg Сбой выделения ug Сбой подчёркивания vt Номер виртуального терминала ws Ширина строки состояния (если отличается от ширины экрана)

source: String capabilities
ru: Возможности со строковыми значениями
