Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: The I<it_interval> field returns the interval of the timer. If both fields of this structure are zero, then the timer is set to expire just once, at the time specified by I<curr_value.it_value>.
ru: В поле I<it_interval> возвращается интервал таймера. Если оба поля этой структуры равны нулю, то таймер настроен на однократное срабатывание, на время, заданное в I<curr_value.it_value>.

source: Operating on a timer file descriptor
ru: Работа с файловым дескриптором таймера

source: The file descriptor returned by B<timerfd_create>() supports the following operations:
ru: Файловый дескриптор, возвращаемый B<timerfd_create>(), поддерживает следующие операции:

source: If the timer has already expired one or more times since its settings were last modified using B<timerfd_settime>(), or since the last successful B<read>(2), then the buffer given to B<read>(2) returns an unsigned 8-byte integer (I<uint64_t>) containing the number of expirations that have occurred. (The returned value is in host byte order\(emthat is, the native byte order for integers on the host machine.)
ru: Если таймер уже сработал один или более раз с момента настройки с помощью B<timerfd_settime>(), или после последнего успешного B<read>(2), то в буфер, указанный в B<read>(2), будет возвращено беззнаковое 8-байтное целое (I<uint64_t>), содержащее количество произошедших срабатываний (возвращаемое значение хранится в порядке байт узла, то есть родном порядке для целых чисел машины выполнения).

source: If no timer expirations have occurred at the time of the B<read>(2), then the call either blocks until the next timer expiration, or fails with the error B<EAGAIN> if the file descriptor has been made nonblocking (via the use of the B<fcntl>(2) B<F_SETFL> operation to set the B<O_NONBLOCK> flag).
ru: Если таймер ещё не срабатывал до вызова B<read>(2), то вызов блокирует выполнение до следующего срабатывания таймера, или завершается с ошибкой B<EAGAIN>, если файловый дескриптор был создан неблокирующим (с помощью вызова B<fcntl>(2) и операции B<F_SETFL> с флагом B<O_NONBLOCK>).

source: A B<read>(2) fails with the error B<EINVAL> if the size of the supplied buffer is less than 8 bytes.
ru: Вызов B<read>(2) завершается ошибкой B<EINVAL>, если размер указанного буфера будет меньше 8 байт.

source: If the associated clock is either B<CLOCK_REALTIME> or B<CLOCK_REALTIME_ALARM>, the timer is absolute (B<TFD_TIMER_ABSTIME>), and the flag B<TFD_TIMER_CANCEL_ON_SET> was specified when calling B<timerfd_settime>(), then B<read>(2) fails with the error B<ECANCELED> if the real-time clock undergoes a discontinuous change. (This allows the reading application to discover such discontinuous changes to the clock.)
ru: Если используются часы B<CLOCK_REALTIME> или B<CLOCK_REALTIME_ALARM>, таймер является абсолютным (B<TFD_TIMER_ABSTIME>) и при вызове B<timerfd_settime>() указан флаг B<TFD_TIMER_CANCEL_ON_SET>, то B<read>(2) завершается ошибкой B<ECANCELED>, если часы реального времени подвергнуться скачкообразному изменению (это позволяет читающему приложению обнаружить такие скачкообразные изменения часов).

source: B<poll>(2), B<select>(2) (and similar)
ru: B<poll>(2), B<select>(2) (и подобные)

source: The file descriptor is readable (the B<select>(2) I<readfds> argument; the B<poll>(2) B<POLLIN> flag) if one or more timer expirations have occurred.
ru: Файловый дескриптор доступен для чтения (в B<select>(2) аргумент I<readfds>; в B<poll>(2) флаг B<POLLIN>), если произошло одно или более срабатываний таймера.

source: The file descriptor also supports the other file-descriptor multiplexing APIs: B<pselect>(2), B<ppoll>(2), and B<epoll>(7).
ru: Файловый дескриптор также поддерживает другие мультиплексные вызовы: B<pselect>(2), B<ppoll>(2) и B<epoll>(7).

source: The following timerfd-specific command is supported:
ru: Поддерживается следующая команда, относящаяся к timerfd:

source: B<TFD_IOC_SET_TICKS> (since Linux 3.17)
ru: B<TFD_IOC_SET_TICKS> (начиная с Linux 3.17)

source: Adjust the number of timer expirations that have occurred. The argument is a pointer to a nonzero 8-byte integer (I<uint64_t>*) containing the new number of expirations. Once the number is set, any waiter on the timer is woken up. The only purpose of this command is to restore the expirations for the purpose of checkpoint/restore. This operation is available only if the kernel was configured with the B<CONFIG_CHECKPOINT_RESTORE> option.
ru: Корректирует количество истечений таймера, которые произошли. Аргументом является указатель на ненулевое 8-байтовое целое (I<uint64_t>*), содержащее новое количество истечений. После установки количества, все ожидающие таймера пробуждаются. Единственная цель данной команды — восстановить истечений для отсечки/восстановления. Данная операция доступна только, если ядро собрано с параметром B<CONFIG_CHECKPOINT_RESTORE>.

source: When the file descriptor is no longer required it should be closed. When all file descriptors associated with the same timer object have been closed, the timer is disarmed and its resources are freed by the kernel.
ru: Если файловый дескриптор больше не требуется, его нужно закрыть. Когда все файловые дескрипторы, связанные с одним объектом таймера, будут закрыты, таймер выключается и ядро освобождает его ресурсы.

source: fork(2) semantics
ru: Поведение при fork(2)

source: After a B<fork>(2), the child inherits a copy of the file descriptor created by B<timerfd_create>(). The file descriptor refers to the same underlying timer object as the corresponding file descriptor in the parent, and B<read>(2)s in the child will return information about expirations of the timer.
ru: После B<fork>(2) потомки наследуют копию файлового дескриптора, созданного B<timerfd_create>(). Файловый дескриптор потомка ссылается на тот же объект таймера, что и файловый дескриптор его родителя, и операция B<read>(2) в потомке будет возвращать информацию о срабатываниях таймера.

source: execve(2) semantics
ru: Поведение при execve(2)

source: A file descriptor created by B<timerfd_create>() is preserved across B<execve>(2), and continues to generate timer expirations if the timer was armed.
ru: Файловый дескриптор, созданный B<timerfd_create>(), сохраняется при B<execve>(2), и продолжает генерировать срабатывания таймера, если он включён.

source: On success, B<timerfd_create>() returns a new file descriptor. On error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<timerfd_create>() возвращает новый файловый дескриптор. При ошибке возвращается -1, и I<errno> устанавливается в соответствующее значение.

source: B<timerfd_settime>() and B<timerfd_gettime>() return 0 on success; on error they return -1, and set I<errno> to indicate the error.
ru: При успешном выполнении B<timerfd_settime>() и B<timerfd_gettime>() возвращают 0; в случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение ошибки.

source: B<timerfd_create>() can fail with the following errors:
ru: Вызов B<timerfd_create>() может завершиться со следующими ошибками:

source: The I<clockid> argument is neither B<CLOCK_MONOTONIC> nor B<CLOCK_REALTIME>;
ru: Аргумент I<clockid> не равен B<CLOCK_MONOTONIC> или B<CLOCK_REALTIME>;

source: I<flags> is invalid; or, in Linux 2.6.26 or earlier, I<flags> is nonzero.
ru: Неправильное значение I<flags> или, для Linux 2.6.26 и старее, I<flags> не равно 0.

source: The per-process limit on the number of open file descriptors has been reached.
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: The system-wide limit on the total number of open files has been reached.
ru: Достигнуто максимальное количество открытых файлов в системе.

source: Could not mount (internal) anonymous inode device.
ru: Не удалось смонтировать (внутреннее) безымянное устройство inode.

source: There was insufficient kernel memory to create the timer.
ru: Недостаточно памяти ядра для создания таймера.

source: B<timerfd_settime>() and B<timerfd_gettime>() can fail with the following errors:
ru: Вызовы B<timerfd_settime>() и B<timerfd_gettime>() могут завершаться со следующими ошибками:

source: I<new_value>, I<old_value>, or I<curr_value> is not valid a pointer.
ru: Указатели I<new_value>, I<old_value> или I<curr_value> являются некорректными.

source: I<fd> is not a valid timerfd file descriptor.
ru: Значение I<fd> не является правильным файловым дескриптором timerfd.

source: B<timerfd_settime>() can also fail with the following errors:
ru: Вызов B<timerfd_settime>() также может завершиться со следующими ошибками:

source: I<new_value> is not properly initialized (one of the I<tv_nsec> falls outside the range zero to 999,999,999).
ru: Значение I<new_value> некорректно инициализировано (одно из I<tv_nsec> вне диапазона от 0 до 999999999).

source: I<flags> is invalid.
ru: Значение I<flags> неверно.

source: These system calls are available on Linux since kernel 2.6.25. Library support is provided by glibc since version 2.8.
ru: Данные системные вызовы доступны в Linux начиная с ядра версии 2.6.25. Поддержка в библиотеке glibc появилась в версии 2.8.

source: These system calls are Linux-specific.
ru: Данные системные вызовы есть только в Linux.

source: Currently, B<timerfd_create>() supports fewer types of clock IDs than B<timer_create>(2).
ru: В настоящее время B<timerfd_create>() поддерживает только несколько типов идентификаторов часов, поддерживаемых B<timer_create>(2).

source: The following program creates a timer and then monitors its progress. The program accepts up to three command-line arguments. The first argument specifies the number of seconds for the initial expiration of the timer. The second argument specifies the interval for the timer, in seconds. The third argument specifies the number of times the program should allow the timer to expire before terminating. The second and third command-line arguments are optional.
ru: Следующая программа создаёт таймер и затем следит за его работой. Программа получает до трёх аргументов из командной строки. В первом аргументе задаётся количество секунд до первого срабатывания таймера. Во втором аргументе задаётся интервал таймера в секундах. В третьем аргументе задаётся сколько программа должна позволить сработать таймеру до завершения. Второй и третий аргументы необязательны.

source: The following shell session demonstrates the use of the program:
ru: Следующий сеанс работы в оболочке показывает использование программы:

source: $B< a.out 3 1 100> 0.000: timer started 3.000: read: 1; total=1 4.000: read: 1; total=2 B<^Z > # type control-Z to suspend the program [1]+ Stopped ./timerfd3_demo 3 1 100 $ B<fg> # Resume execution after a few seconds a.out 3 1 100 9.660: read: 5; total=7 10.000: read: 1; total=8 11.000: read: 1; total=9 B<^C > # type control-C to suspend the program
ru: $B< a.out 3 1 100> 0.000: таймер запущен 3.000: read: 1; всего=1 4.000: read: 1; всего=2 B<^Z > # нажато control-Z для приостанова программы [1]+ Stopped ./timerfd3_demo 3 1 100 $ B<fg> # возобновление выполнения после нескольких #секунд a.out 3 1 100 9.660: read: 5; всего=7 10.000: read: 1; всего=8 11.000: read: 1; всего=9 B<^C > # нажато control-C для приостанова программы

source: #include E<lt>sys/timerfd.hE<gt> #include E<lt>time.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdint.hE<gt> /* Definition of uint64_t */
ru: #include E<lt>sys/timerfd.hE<gt> #include E<lt>time.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdint.hE<gt> /* определение uint64_t */

source: if ((argc != 2) && (argc != 4)) { fprintf(stderr, "%s init-secs [interval-secs max-exp]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if ((argc != 2) && (argc != 4)) { fprintf(stderr, "%s нач-сек [интервал макс-сраб]\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Create a CLOCK_REALTIME absolute timer with initial expiration and interval as specified in command line */
ru: /* создаём абсолютный таймер CLOCK_REALTIME с начальным срабатыванием и интервалом, заданными из командной строки */

source: print_elapsed_time(); printf("timer started\en");
ru: print_elapsed_time(); printf("таймер запущен\en");

source: tot_exp += exp; print_elapsed_time(); printf("read: %llu; total=%llu\en", (unsigned long long) exp, (unsigned long long) tot_exp); }
ru: tot_exp += exp; print_elapsed_time(); printf("read: %llu; всего=%llu\en", (unsigned long long) exp, (unsigned long long) tot_exp); }

source: ttytype - terminal device to default terminal type mapping
ru: ttytype - отображение терминального устройства на тип терминала по умолчанию

source: The I</etc/ttytype> file associates B<termcap>(5)/B<terminfo>(5) terminal type names with tty lines. Each line consists of a terminal type, followed by whitespace, followed by a tty name (a device name without the I</dev/>) prefix.
ru: Файл I</etc/ttytype> связывает имена типов из B<termcap>(5)/B<terminfo>(5) с линиями tty. Каждая строка состоит из типа терминала, пробел, имя терминала (имя устройства без префикса I</dev/>).

source: This association is used by the program B<tset>(1) to set the environment variable B<TERM> to the default terminal name for the user's current tty.
ru: Эта связь используется программой B<tset>(1) для настройки переменной окружения B<TERM> на имя терминала по умолчанию для пользователей текущего tty.

source: This facility was designed for a traditional time-sharing environment featuring character-cell terminals hardwired to a UNIX minicomputer. It is little used on modern workstation and personal UNIX systems.
ru: Это средство было разработано для традиционной среды с разделением времени, благодаря символьным терминалам, которые были неотъемлемой частью мини-компьютера UNIX. Оно мало используется на современных рабочих станциях и персональных системах UNIX.

source: the tty definitions file.
ru: Файл определений tty.

source: A typical I</etc/ttytype> is:
ru: Обычно I</etc/ttytype> следующий:

source: tmpfs - a virtual memory filesystem
ru: tmpfs - файловая система в виртуальной памяти

source: The B<tmpfs> facility allows the creation of filesystems whose contents reside in virtual memory. Since the files on such filesystems typically reside in RAM, file access is extremely fast.
ru: Свойство B<tmpfs> позволяет создавать файловые системы, чьё содержимое находится в виртуальной памяти. Так как файлы в таких файловых системах, обычно, располагаются в оперативной памяти, то доступ к файлах очень быстр.

source: The filesystem is automatically created when mounting a filesystem with the type B<tmpfs> via a command such as the following:
ru: Файловая система создаётся автоматически при монтировании с типом B<tmpfs> с помощью команды следующего вида:

source: A B<tmpfs> filesystem has the following properties:
ru: Файловая система B<tmpfs> имеет следующие свойства:

source: The filesystem can employ swap space when physical memory pressure demands it.
ru: Файловая система может задействовать пространство подкачки, если это требуется из-за нагрузки на физическую память.

source: The filesystem consumes only as much physical memory and swap space as is required to store the current contents of the filesystem.
ru: Файловая система потребляет физическую память и пространство подкачки только для хранения текущего содержимого файловой системы.

source: During a remount operation (I<mount\ -o\ remount>), the filesystem size can be changed (without losing the existing contents of the filesystem).
ru: При операции перемонтирования (I<mount\ -o\ remount>), размер файловой системы можно изменить (без потери имеющегося содержимого файловой системы).

source: If a B<tmpfs> filesystem is unmounted, its contents are discarded (lost).
ru: При размонтировании файловой системы B<tmpfs> её содержимое уничтожается (теряется).

source: Mount options
ru: Параметры монтирования

source: The B<tmpfs> filesystem supports the following mount options:
ru: Файловая система B<tmpfs> поддерживает следующие параметры монтирования:

source: B<size>=I<bytes>
ru: B<size>=I<байт>

source: Specify an upper limit on the size of the filesystem. The size is given in bytes, and rounded up to entire pages.
ru: Задать максимальный размер файловой системы. Указывается в байтах и округляется до полного размера страницы.

source: The size may have a B<k>, B<m>, or B<g> suffix for Ki, Mi, Gi (binary kilo (kibi), binary mega (mebi) and binary giga (gibi)).
ru: У размера может быть указан суффикс B<k>, B<m> или B<g> единиц измерения Ki, Mi, Gi (двоичный кило (kibi), двоичный мега (mebi) и двоичный гига (gibi) -байт).

source: The size may also have a % suffix to limit this instance to a percentage of physical RAM.
ru: Также у размер может быть указан суффикс %, задающий размер экземпляра в процентах от физической оперативной памяти.

source: The default, when neither B<size> nor B<nr_blocks> is specified, is I<size=50%>.
ru: Если B<size> или B<nr_blocks> не заданы, то по умолчанию используется I<size=50%>.

source: B<nr_blocks>=I<blocks>
ru: B<nr_blocks>=I<блоков>

source: The same as B<size>, but in blocks of B<PAGE_CACHE_SIZE>.
ru: То же, что и B<size>, но считается в блоках B<PAGE_CACHE_SIZE>.

source: Blocks may be specified with B<k>, B<m>, or B<g> suffixes like B<size>, but not a % suffix.
ru: У блоков может быть задан суффикс B<k>, B<m> или B<g>, как у B<size>, но нельзя задать суффикс %.

source: B<nr_inodes>=I<inodes>
ru: B<nr_inodes>=I<инод>

source: The maximum number of inodes for this instance. The default is half of the number of your physical RAM pages, or (on a machine with highmem) the number of lowmem RAM pages, whichever is smaller.
ru: Максимальное количество инод в экземпляре. Значением по умолчанию является или половина количества страниц оперативной памяти, или (для машины с highmem) количество страниц памяти lowmem, выбирается меньшее.

source: Inodes may be specified with B<k>, B<m>, or B<g> suffixes like B<size>, but not a % suffix.
ru: У инод может быть задан суффикс B<k>, B<m> или B<g>, как у B<size>, но нельзя задать суффикс %.

source: B<mode>=I<mode>
ru: B<mode>=I<права>

source: Set initial permissions of the root directory.
ru: Назначить начальные права на корневой каталог.

source: B<gid>=I<gid> (since Linux 2.5.7)
ru: B<gid>=I<gid> (начиная с Linux 2.5.7)

source: Set the initial group ID of the root directory.
ru: Назначить начальный идентификатор группы на корневой каталог.

source: B<uid>=I<uid> (since Linux 2.5.7)
ru: B<uid>=I<uid> (начиная с Linux 2.5.7)

source: Set the initial user ID of the root directory.
ru: Назначить начальный идентификатор пользователя на корневой каталог.

source: B<huge>=I<huge_option> (since Linux 4.7.0)
ru: B<huge>=I<huge_option> (начиная с Linux 4.7.0)

source: Set the huge table memory allocation policy for all files in this instance (if B<CONFIG_TRANSPARENT_HUGE_PAGECACHE> is enabled).
ru: Задать алгоритм выделения огромной табличной памяти для всех файлов в этом экземпляре (если включён B<CONFIG_TRANSPARENT_HUGE_PAGECACHE>).

source: The I<huge_option> value is one of the following:
ru: Значением I<huge_option> может быть одно из:

source: Do not allocate huge pages. This is the default.
ru: Не выделять огромные страницы. По умолчанию.

source: Attempt to allocate huge pages every time a new page is needed.
ru: Каждый раз пытаться выделить огромные страницы при необходимости в новой странице.

source: Only allocate huge page if it will be fully within I<i_size>. Also respect B<fadvise>(2)/B<madvise>(2) hints
ru: Выделять огромную страницу только, если в ней займётся I<i_size>. Также учитываются подсказки B<fadvise>(2)/B<madvise>(2).

source: Only allocate huge pages if requested with B<fadvise>(2)/B<madvise>(2).
ru: Выделять огромные страницы только, если они запрашиваются с помощью B<fadvise>(2)/B<madvise>(2).

source: For use in emergencies, to force the huge option off from all mounts.
ru: Запретить включение огромных страниц у всех монтирований, используется в экстренных случаях.

source: Force the huge option on for all mounts; useful for testing.
ru: Принудительно включить огромные страницы у всех монтирований; полезно при отладке.

source: B<mpol>=I<mpol_option> (since Linux 2.6.15)
ru: B<mpol>=I<mpol_option> (начиная с Linux 2.6.15)

source: Set the NUMA memory allocation policy for all files in this instance (if B<CONFIG_NUMA> is enabled).
ru: Задать алгоритм выделения памяти NUMA для всех файлов в этом экземпляре (если включён B<CONFIG_NUMA>).

source: The I<mpol_option> value is one of the following:
ru: Значением I<mpol_option> может быть одно из:

source: Use the process allocation policy (see B<set_mempolicy>(2)).
ru: Использовать алгоритм выделения из процесса (смотрите B<set_mempolicy>(2)).

source: B<prefer>:I<node>
ru: B<prefer>:I<узел>

source: Preferably allocate memory from the given I<node>.
ru: Отдавать предпочтение выделению памяти из указанного I<узла>.

source: B<bind>:I<nodelist>
ru: B<bind>:I<список_узлов>

source: Allocate memory only from nodes in I<nodelist>.
ru: Выделять память только на узлах из I<списка_узлов>.

source: Allocate from each node in turn.
ru: Выделять на каждом узле по очереди.

source: B<interleave>:I<nodelist>
ru: B<interleave>:I<список_узлов>

source: Allocate from each node of I<in> turn.
ru: Выделять на каждом узле по очереди из I<списка_узлов>.

source: Preferably allocate memory from the local node.
ru: Отдавать предпочтение выделению памяти из локального узла.

source: In the above, I<nodelist> is a comma-separated list of decimal numbers and ranges that specify NUMA nodes. A range is a pair of hyphen-separated decimal numbers, the smallest and largest node numbers in the range. For example, I<mpol=bind:0-3,5,7,9-15>.
ru: Здесь I<список_узлов> — это список перечисленных через запятую десятичных чисел идиапазонов, указывающие узлы NUMA. Диапазон задаётся парой десятичных чисел через тире, наименьший и наибольший номера узлов диапазона. Пример: I<mpol=bind:0-3,5,7,9-15>.

source: The B<tmpfs> facility was added in Linux 2.4, as a successor to the older B<ramfs> facility, which did not provide limit checking or allow for the use of swap space.
ru: Свойство B<tmpfs> было добавлено в Linux 2.4 как последователь старого свойства B<ramfs>, в котором отсутствует возможность проверки ограничения и использования пространства подкачки.

source: In order for user-space tools and applications to create B<tmpfs> filesystems, the kernel must be configured with the B<CONFIG_TMPFS> option.
ru: Чтобы пользовательские инструменты и приложения могли создавать файловые системы B<tmpfs> ядро должно быть собрано с параметром B<CONFIG_TMPFS>.

source: The B<tmpfs> filesystem supports extended attributes (see B<xattr>(7)), but I<user> extended attributes are not permitted.
ru: Файловая система B<tmpfs> поддерживает расширенные атрибуты (смотрите B<xattr>(7)), но расширенные атрибуты I<user> не допускаются.

source: An internal shared memory filesystem is used for System V shared memory (B<shmget>(2)) and shared anonymous mappings (B<mmap>(2) with the B<MAP_SHARED> and B<MAP_ANONYMOUS> flags). This filesystem is available regardless of whether the kernel was configured with the B<CONFIG_TMPFS> option.
ru: Для общей памяти System V B<shmget>(2)) и общих анонимных отображений (B<mmap>(2) с флагами B<MAP_SHARED> и B<MAP_ANONYMOUS>) используется внутренняя файловая система общей памяти. Эта файловая система доступна независимо от того, собрано ли ядро с параметром B<CONFIG_TMPFS>.
