Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: If B<IGNBRK> is set, a BREAK is ignored. If it is not set but B<BRKINT> is set, then a BREAK causes the input and output queues to be flushed, and if the terminal is the controlling terminal of a foreground process group, it will cause a B<SIGINT> to be sent to this foreground process group. When neither B<IGNBRK> nor B<BRKINT> are set, a BREAK reads as a null byte (\(aq\e0\(aq), except when B<PARMRK> is set, in which case it reads as the sequence \e377 \e0 \e0.
ru: Если указан B<IGNBRK>, то BREAK игнорируется. Если он не указан, а B<BRKINT> указан, то BREAK вызывает сброс (flushed) очередей ввода и вывода, и, если терминал является управляющим для активной (foreground) группы процессов, то этой группе посылается сигнал B<SIGINT>. Если B<IGNBRK> и B<BRKINT> не указаны, то BREAK считывается как байт null («\e0»), кроме случая, когда указан B<PARMRK>, тогда он будет прочитан как последовательность \e377 \e0 \e0.

source: Ignore framing errors and parity errors.
ru: Игнорировать ошибки кадра и чётности.

source: If this bit is set, input bytes with parity or framing errors are marked when passed to the program. This bit is meaningful only when B<INPCK> is set and B<IGNPAR> is not set. The way erroneous bytes are marked is with two preceding bytes, \e377 and \e0. Thus, the program actually reads three bytes for one erroneous byte received from the terminal. If a valid byte has the value \e377, and B<ISTRIP> (see below) is not set, the program might confuse it with the prefix that marks a parity error. Therefore, a valid byte \e377 is passed to the program as two bytes, \e377 \e377, in this case.
ru: Если этот бит установлен, то входящие байты с ошибками чётности или кадра помечаются при передаче в программу. Этот бит значим, только когда установлен бит B<INPCK> и не установлен бит B<IGNPAR>. Байты с ошибками помечаются двумя предваряющими их байтами \e377 и \e0. То есть программа, на самом деле, читает три байта при получении одного байта с ошибками с терминала. Если корректный байт имеет значение \e377 и бит B<ISTRIP> (смотрите далее) не установлен, то программа может ошибочно посчитать его как помечающий ошибки чётности. Поэтому в этом случае корректный байт \e377 передаётся программе как два байта, \e377 \e377.

source: If neither B<IGNPAR> nor B<PARMRK> is set, read a character with a parity error or framing error as \e0.
ru: Если B<IGNPAR> или B<PARMRK> не указаны, то символ с ошибкой чётности или кадра считывается как \e0.

source: Enable input parity checking.
ru: Включить проверку чётности ввода.

source: Strip off eighth bit.
ru: Удалять восьмой бит.

source: Translate NL to CR on input.
ru: Преобразовывать NL в CR в вводе.

source: Ignore carriage return on input.
ru: Игнорировать возврат каретки в вводе.

source: Translate carriage return to newline on input (unless B<IGNCR> is set).
ru: Преобразовывать возврат каретки в символ новой строки в вводе (если не указан B<IGNCR>).

source: (not in POSIX) Map uppercase characters to lowercase on input.
ru: (нет в POSIX) Переводить заглавные буквы в прописные в вводе.

source: Enable XON/XOFF flow control on output.
ru: Включить управление потоком XON/XOFF в выводе.

source: (XSI) Typing any character will restart stopped output. (The default is to allow just the START character to restart output.)
ru: (XSI) Набор любого символа запускает остановленный вывод (по умолчанию только символ START заново запускает вывод).

source: Enable XON/XOFF flow control on input.
ru: Включить управление потоком XON/XOFF в вводе.

source: (not in POSIX) Ring bell when input queue is full. Linux does not implement this bit, and acts as if it is always set.
ru: (нет в POSIX) Выдавать звуковой сигнал, когда очередь ввода переполняется. В Linux не реализован этот бит и его действие выполняется всегда.

source: B<IUTF8> (since Linux 2.6.4)
ru: B<IUTF8> (начиная с Linux 2.6.4)

source: (not in POSIX) Input is UTF8; this allows character-erase to be correctly performed in cooked mode.
ru: (нет в POSIX) Ввод в UTF8; это позволяет символу стирания (character-erase) правильно работать в режиме предварительной обработки (cooked mode).

source: I<c_oflag> flag constants:
ru: Константы флага I<c_oflag>:

source: Enable implementation-defined output processing.
ru: Включить обработку вывода, определяемую реализацией.

source: (not in POSIX) Map lowercase characters to uppercase on output.
ru: (нет в POSIX) Переводить прописные буквы в заглавные в выводе.

source: (XSI) Map NL to CR-NL on output.
ru: (XSI) Преобразовывать NL в CR-NL в выводе.

source: Map CR to NL on output.
ru: Преобразовывать CR в NL в выводе.

source: Don't output CR at column 0.
ru: Не выводить CR в столбец 0.

source: Don't output CR.
ru: Не выводить CR.

source: Send fill characters for a delay, rather than using a timed delay.
ru: Посылать символы заполнения для задержки, а не использовать временную задержку.

source: Fill character is ASCII DEL (0177). If unset, fill character is ASCII NUL (\(aq\e0\(aq). (Not implemented on Linux.)
ru: Символ заполнения ASCII DEL (0177). Если не указано, то используется ASCII NUL («\e0») (не реализовано в Linux).

source: Newline delay mask. Values are B<NL0> and B<NL1>. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE> or B<_XOPEN_SOURCE>]
ru: Маска задержки новой строки. Значениями могут быть B<NL0> и B<NL1> [требуется B<_BSD_SOURCE>, B<_SVID_SOURCE> или B<_XOPEN_SOURCE>].

source: Carriage return delay mask. Values are B<CR0>, B<CR1>, B<CR2>, or B<CR3>. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE> or B<_XOPEN_SOURCE>]
ru: Маска задержки перевода каретки. Значениями могут быть B<CR0>, B<CR1>, B<CR2> или B<CR3> [требуется B<_BSD_SOURCE>, B<_SVID_SOURCE> или B<_XOPEN_SOURCE>].

source: Horizontal tab delay mask. Values are B<TAB0>, B<TAB1>, B<TAB2>, B<TAB3> (or B<XTABS>, but see the B<BUGS> section). A value of TAB3, that is, XTABS, expands tabs to spaces (with tab stops every eight columns). [requires B<_BSD_SOURCE> or B<_SVID_SOURCE> or B<_XOPEN_SOURCE>]
ru: Маска задержки горизонтальной табуляции. Значениями могут быть B<TAB0>, B<TAB1>, B<TAB2>, B<TAB3> (или B<XTABS>, но смотрите раздел B<BUGS>). Значение TAB3, то есть, XTABS, раскрывает табуляцию в пробелы (один символ табуляции — восемь столбцов) [требуется B<_BSD_SOURCE>, B<_SVID_SOURCE> или B<_XOPEN_SOURCE>].

source: Backspace delay mask. Values are B<BS0> or B<BS1>. (Has never been implemented.) [requires B<_BSD_SOURCE> or B<_SVID_SOURCE> or B<_XOPEN_SOURCE>]
ru: Маска задержки символа забоя. Значениями могут быть B<BS0> или B<BS1> (никогда не была реализована) [требуется B<_BSD_SOURCE>, B<_SVID_SOURCE> или B<_XOPEN_SOURCE>].

source: Vertical tab delay mask. Values are B<VT0> or B<VT1>.
ru: Маска задержки вертикальной табуляции. Значениями могут быть B<VT0> или B<VT1>.

source: Form feed delay mask. Values are B<FF0> or B<FF1>. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE> or B<_XOPEN_SOURCE>]
ru: Маска задержки прокрутки страницы. Значениями могут быть B<FF0> или B<FF1> [требуется B<_BSD_SOURCE>, B<_SVID_SOURCE> или B<_XOPEN_SOURCE>].

source: I<c_cflag> flag constants:
ru: Константы флага I<c_cflag>:

source: (not in POSIX) Baud speed mask (4+1 bits). [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX) Маска скорости в бодах (4+1 бита) [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: (not in POSIX) Extra baud speed mask (1 bit), included in B<CBAUD>. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX) Дополнительная маска скорости в бодах (1 бит), включена в B<CBAUD> [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: (POSIX says that the baud speed is stored in the I<termios> structure without specifying where precisely, and provides B<cfgetispeed>() and B<cfsetispeed>() for getting at it. Some systems use bits selected by B<CBAUD> in I<c_cflag>, other systems use separate fields, for example, I<sg_ispeed> and I<sg_ospeed>.)
ru: В стандарте POSIX указано, что скорость в бодах хранится в структуре I<termios> без указания её точного местонахождения, и для работы к ней используются B<cfgetispeed>() и B<cgfsetispeed>(). В некоторых системах используются биты, выбираемые B<CBAUD> в I<c_cflag>, в других используются отдельные поля, например I<sg_ispeed> и I<sg_ospeed>.

source: Character size mask. Values are B<CS5>, B<CS6>, B<CS7>, or B<CS8>.
ru: Маска размера символа. Значениями могут быть B<CS5>, B<CS6>, B<CS7> или B<CS8>.

source: Set two stop bits, rather than one.
ru: Использовать два стоповых бита вместо одного.

source: Enable receiver.
ru: Включить приёмник.

source: Enable parity generation on output and parity checking for input.
ru: Запустить генерацию чётности при выводе и проверку чётности на вводе.

source: If set, then parity for input and output is odd; otherwise even parity is used.
ru: Если указано, то при вводе и выводе используется отрицательная чётность, в противном случае используется положительная чётность.

source: Lower modem control lines after last process closes the device (hang up).
ru: Выключить управляющие линии модема после того, как последний процесс прекратит использование устройства (повесит трубку).

source: Ignore modem control lines.
ru: Игнорировать управляющие линии модема.

source: (not in POSIX) Block output from a noncurrent shell layer. For use by B<shl> (shell layers). (Not implemented on Linux.)
ru: (нет в POSIX) Блокировать вывод из не текущего уровня оболочки (для использования в B<shl> (shell layers), не реализовано в Linux).

source: (not in POSIX) Mask for input speeds. The values for the B<CIBAUD> bits are the same as the values for the B<CBAUD> bits, shifted left B<IBSHIFT> bits. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>] (Not implemented on Linux.)
ru: (нет в POSIX) Маска скоростей ввода. Для битов B<CIBAUD> используются те же значения, что и для битов B<CBAUD>, но они смещены влево на B<ISHIFT> битов [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>] (не реализовано в Linux).

source: (not in POSIX) Use "stick" (mark/space) parity (supported on certain serial devices): if B<PARODD> is set, the parity bit is always 1; if B<PARODD> is not set, then the parity bit is always 0. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX) Использовать «липкую» (есть/нет) чётность (поддерживается в некоторых последовательных устройствах): если задан B<PARODD>, то бит чётности всегда 1; если B<PARODD> не задан, то бит чётности всегда 0 [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: (not in POSIX) Enable RTS/CTS (hardware) flow control. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX) Разрешить (аппаратное) управление потоком данных RTS/CTS [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: I<c_lflag> flag constants:
ru: Константы флага I<c_lflag>:

source: When any of the characters INTR, QUIT, SUSP, or DSUSP are received, generate the corresponding signal.
ru: При получении символов INTR, QUIT, SUSP или DSUSP генерировать соответствующий сигнал.

source: Enable canonical mode (described below).
ru: Включить канонический режим (описан далее).

source: (not in POSIX; not supported under Linux) If B<ICANON> is also set, terminal is uppercase only. Input is converted to lowercase, except for characters preceded by \e. On output, uppercase characters are preceded by \e and lowercase characters are converted to uppercase. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE> or B<_XOPEN_SOURCE>]
ru: (нет в POSIX; не поддерживается в Linux) Если также указан B<ICANON>, то терминал работает только с символами в верхнем регистре. Ввод преобразуется в символы нижнего регистра, кроме символов, предваряемых \e. При выводе предваряемые \e символы в верхнем регистре и символы в нижнем регистре преобразуются в символы верхнего регистра [requires B<_BSD_SOURCE>, B<_SVID_SOURCE> или B<_XOPEN_SOURCE>].

source: Echo input characters.
ru: Отображать вводимые символы.

source: If B<ICANON> is also set, the ERASE character erases the preceding input character, and WERASE erases the preceding word.
ru: Если также указан B<ICANON>, то символ ERASE стирает предыдущий введённый символ, а WERASE стирает предыдущее слово.

source: If B<ICANON> is also set, the KILL character erases the current line.
ru: Если также указан B<ICANON>, то символ KILL стирает текущую строку.

source: If B<ICANON> is also set, echo the NL character even if ECHO is not set.
ru: Если также указан B<ICANON>, то символ NL отображается, даже если не указан ECHO.

source: (not in POSIX) If B<ECHO> is also set, terminal special characters other than TAB, NL, START, and STOP are echoed as B<^X>, where X is the character with ASCII code 0x40 greater than the special character. For example, character 0x08 (BS) is echoed as B<^H>. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX) Если также указан B<ECHO>, то специальные символы терминала, кроме TAB, NL, START и STOP, отображаются как B<^X>, где X — символ из таблицы ASCII с кодом на 0x40 больше, чем у специального символа. Например, символ 0x08 (BS) отобразится как B<^H> [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: (not in POSIX) If B<ICANON> and B<ECHO> are also set, characters are printed as they are being erased. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX) Если также указаны B<ICANON> и B<IECHO>, то символы печатаются по мере того, как они стираются [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: (not in POSIX) If B<ICANON> is also set, KILL is echoed by erasing each character on the line, as specified by B<ECHOE> and B<ECHOPRT>. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX) Если также указан B<ICANON>, то KILL выводится стиранием каждого символа в строке, как задано B<ECHOE> и B<ECHOPRT> [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: (not in POSIX) Echo only when a process is reading. (Not implemented on Linux.)
ru: (нет в POSIX) Выводить (echo) только в момент чтения процессом (не реализовано в Linux).

source: (not in POSIX; not supported under Linux) Output is being flushed. This flag is toggled by typing the DISCARD character. [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX; не поддерживается в Linux) Выводимые данные сбрасываются (flushed). Этот флаг переключается с помощью набираемого символа DISCARD [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: Disable flushing the input and output queues when generating signals for the INT, QUIT, and SUSP characters.
ru: Отключить сброс (flushing) очередей ввода и вывода во время генерации сигналов из-за символов INT, QUIT и SUSP.

source: Send the B<SIGTTOU> signal to the process group of a background process which tries to write to its controlling terminal.
ru: Послать сигнал B<SIGTTOU> группе процессов фонового процесса, который пытается писать на управляющий терминал.

source: (not in POSIX; not supported under Linux) All characters in the input queue are reprinted when the next character is read. (B<bash>(1) handles typeahead this way.) [requires B<_BSD_SOURCE> or B<_SVID_SOURCE>]
ru: (нет в POSIX; не поддерживается в Linux) Все символы в очереди ввода повторно печатаются, когда читается последующий символ (это используется в B<bash>(1) для перехвата набираемого) [требуется B<_BSD_SOURCE> или B<_SVID_SOURCE>].

source: Enable implementation-defined input processing. This flag, as well as B<ICANON> must be enabled for the special characters EOL2, LNEXT, REPRINT, WERASE to be interpreted, and for the B<IUCLC> flag to be effective.
ru: Включить обработку ввода, определяемую реализацией. Этот флаг, как и B<ICANON>, должен быть включён для обработки специальных символов EOL2, LNEXT, REPRINT, WERASE, а также для того, чтобы работал флаг B<IUCLC>.

source: The I<c_cc> array defines the terminal special characters. The symbolic indices (initial values) and meaning are:
ru: Массивом I<c_cc> определяются специальные символы терминала. Символьные индексы (начальные значения) и их смысл:

source: (not in POSIX; not supported under Linux; 017, SI, Ctrl-O) Toggle: start/stop discarding pending output. Recognized when B<IEXTEN> is set, and then not passed as input.
ru: (нет в POSIX; не поддерживается в Linux; 017, SI, Ctrl-O) Переключатель: включить/выключить отбрасывание ожидающего вывода. Распознаётся, если указан B<IEXTEN> и, в этом случае, не передаётся как ввод.

source: (not in POSIX; not supported under Linux; 031, EM, Ctrl-Y) Delayed suspend character (DSUSP): send B<SIGTSTP> signal when the character is read by the user program. Recognized when B<IEXTEN> and B<ISIG> are set, and the system supports job control, and then not passed as input.
ru: (нет в POSIX; не поддерживается в Linux; 031, EM, Ctrl-Y) Символ отложенного приостанова (DSUSP). Посылает сигнал B<SIGTSTP> при считывании символа программой пользователя. Распознаётся, если указаны B<IEXTEN> и B<ISIG>, и система поддерживает управление заданиями. В этом случае не передаётся как ввод.

source: (004, EOT, Ctrl-D) End-of-file character (EOF). More precisely: this character causes the pending tty buffer to be sent to the waiting user program without waiting for end-of-line. If it is the first character of the line, the B<read>(2) in the user program returns 0, which signifies end-of-file. Recognized when B<ICANON> is set, and then not passed as input.
ru: (004, EOT, Ctrl-D) Символ конца файла (EOF). Этот символ заставляет переслать ждущий обработки буфер tty ожидающей программе пользователя без ожидания конца строки. Если это первый символ в строке, то B<read>(2) вернёт программе 0, что означает конец файла. Распознаётся, если указан B<ICANON>, и, в этом случае, не передаётся как ввод.

source: (0, NUL) Additional end-of-line character (EOL). Recognized when B<ICANON> is set.
ru: (0, NUL) Дополнительный символ конца строки (EOL). Распознаётся, если указан B<ICANON>.

source: (not in POSIX; 0, NUL) Yet another end-of-line character (EOL2). Recognized when B<ICANON> is set.
ru: (нет в POSIX; 0, NUL) Ещё один символ конца строки (EOL2). Распознаётся, если указан B<ICANON>.

source: (0177, DEL, rubout, or 010, BS, Ctrl-H, or also #) Erase character (ERASE). This erases the previous not-yet-erased character, but does not erase past EOF or beginning-of-line. Recognized when B<ICANON> is set, and then not passed as input.
ru: (0177, DEL, rubout, или 010, BS, Ctrl-H, а также #) Символ забоя (ERASE). Стирает предыдущий ещё не стёртый символ, но не стирает за EOF или началом строки. Распознаётся, если указан B<ICANON>, и, в этом случае, не передаётся как ввод.

source: (003, ETX, Ctrl-C, or also 0177, DEL, rubout) Interrupt character (INTR). Send a B<SIGINT> signal. Recognized when B<ISIG> is set, and then not passed as input.
ru: (003, ETX, Ctrl-C, а также 0177, DEL, rubout) Символ прерывания (INTR). Посылает сигнал B<SIGINT>. Распознаётся, если указан B<ISIG>, и, в этом случае, не передаётся как ввод.

source: (025, NAK, Ctrl-U, or Ctrl-X, or also @) Kill character (KILL). This erases the input since the last EOF or beginning-of-line. Recognized when B<ICANON> is set, and then not passed as input.
ru: (025, NAK, Ctrl-U, или Ctrl-X, а также @) Символ уничтожения (KILL). Стирает ввод начиная с последнего EOF или начала строки. Распознаётся, если указан B<ICANON>, и, в этом случае, не передаётся как ввод.

source: (not in POSIX; 026, SYN, Ctrl-V) Literal next (LNEXT). Quotes the next input character, depriving it of a possible special meaning. Recognized when B<IEXTEN> is set, and then not passed as input.
ru: (нет в POSIX; 026, SYN, Ctrl-V) Следующий символ — литера (LNEXT). Экранирует следующий введённый символ, отменяя его возможное специальное значение. Распознаётся, если указан B<IEXTEN> и, в этом случае, не передаётся как ввод.

source: Minimum number of characters for noncanonical read (MIN).
ru: Минимальное количество символов для неканонического чтения (MIN).

source: (034, FS, Ctrl-\e) Quit character (QUIT). Send B<SIGQUIT> signal. Recognized when B<ISIG> is set, and then not passed as input.
ru: (034, FS, Ctrl-\e) Символ завершения (QUIT). Посылает сигнал B<SIGQUIT>. Распознаётся, если указан B<ISIG>, и, в этом случае, не передаётся как ввод.

source: (not in POSIX; 022, DC2, Ctrl-R) Reprint unread characters (REPRINT). Recognized when B<ICANON> and B<IEXTEN> are set, and then not passed as input.
ru: (нет в POSIX; 022, DC2, Ctrl-R) Вывести заново непрочитанные символы (REPRINT). Распознаётся, если указан B<ICANON> и B<IEXTEN> и, в этом случае, не передаётся как ввод.

source: (021, DC1, Ctrl-Q) Start character (START). Restarts output stopped by the Stop character. Recognized when B<IXON> is set, and then not passed as input.
ru: (021, DC1, Ctrl-Q) Символ запуска (START). Перезапускает вывод, остановленный символом останова. Распознаётся, если указан B<IXON> и, в этом случае, не передаётся как ввод.

source: (not in POSIX; not supported under Linux; status request: 024, DC4, Ctrl-T). Status character (STATUS). Display status information at terminal, including state of foreground process and amount of CPU time it has consumed. Also sends a B<SIGINFO> signal (not supported on Linux) to the foreground process group.
ru: (нет в POSIX; не поддерживается в Linux; запрос состояния: 024, DC4, Ctrl-T). Символ состояния (STATUS). Выводит информацию о состоянии на терминал, включая состояние активного (foreground) процесса и количество потраченного времени ЦП. Также посылает сигнал B<SIGINFO> (не поддерживается в Linux) активной группе процессов.

source: (023, DC3, Ctrl-S) Stop character (STOP). Stop output until Start character typed. Recognized when B<IXON> is set, and then not passed as input.
ru: (023, DC3, Ctrl-S) Символ останова (STOP). Приостанавливает вывод до появления символа запуска. Распознаётся, если указан B<IXON> и, в этом случае, не передаётся как ввод.

source: (032, SUB, Ctrl-Z) Suspend character (SUSP). Send B<SIGTSTP> signal. Recognized when B<ISIG> is set, and then not passed as input.
ru: (032, SUB, Ctrl-Z) Символ приостанова (SUSP). Посылает сигнал B<SIGTSTP>. Распознаётся, если указан B<ISIG> и, в этом случае, не передаётся как ввод.

source: (not in POSIX; not supported under Linux; 0, NUL) Switch character (SWTCH). Used in System V to switch shells in I<shell layers>, a predecessor to shell job control.
ru: (нет в POSIX; не поддерживается в Linux; 0, NUL) Символ переключения (SWTCH). Используется в System V для переключения оболочек в I<слоях оболочек>, предшественник механизма управления задачами в оболочке.

source: Timeout in deciseconds for noncanonical read (TIME).
ru: Время ожидания в децисекундах для неканонического чтения (TIME).

source: (not in POSIX; 027, ETB, Ctrl-W) Word erase (WERASE). Recognized when B<ICANON> and B<IEXTEN> are set, and then not passed as input.
ru: (нет в POSIX; 027, ETB, Ctrl-W) Стирание слова (WERASE). Распознаётся, если указан B<ICANON> и B<IEXTEN> и, в этом случае, не передаётся как ввод.

source: An individual terminal special character can be disabled by setting the value of the corresponding I<c_cc> element to B<_POSIX_VDISABLE>.
ru: Отдельные специальные терминальные символы могут быть выключены указанием значения B<_POSIX_VDISABLE> в соответствующем элементе I<c_cc>.

source: The above symbolic subscript values are all different, except that B<VTIME>, B<VMIN> may have the same value as B<VEOL>, B<VEOF>, respectively. In noncanonical mode the special character meaning is replaced by the timeout meaning. For an explanation of B<VMIN> and B<VTIME>, see the description of noncanonical mode below.
ru: Все значения индексов этих символов различны, за исключением B<VTIME>, B<VMIN>, которые могут иметь те же значения, что и B<VEOL>, B<VEOF>, соответственно. В неканоническом режиме значения специальных символов используются как значения времени ожидания. Предназначение B<VMIN> и B<VTIME> смотрите в описании неканонического режима далее.
