Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: This specifies the Julian day with I<n> between 1 and 365. Leap days are not counted. In this format, February 29 can't be represented; February 28 is day 59, and March 1 is always day 60.
ru: Номер I<n> — это день по Юлианскому календарю (от 1 до 365). Високосный день не учитывается. В этом формате 29 февраля не может быть представлено; 28 февраля — это 59 день, а 1 марта всегда 60 день.

source: This specifies the zero-based Julian day with I<n> between 0 and 365. February 29 is counted in leap years.
ru: Номер I<n> — это день по Юлианскому календарю (от 1 до 365). 29 февраля в високосном году учитывается.

source: This specifies day I<d> (0 E<lt>= I<d> E<lt>= 6) of week I<w> (1 E<lt>= I<w> E<lt>= 5) of month I<m> (1 E<lt>= I<m> E<lt>= 12). Week 1 is the first week in which day I<d> occurs and week 5 is the last week in which day I<d> occurs. Day 0 is a Sunday.
ru: Номер I<d> — это день (0 E<lt>= I<d> E<lt>= 6) в неделе I<w> (1 E<lt>= I<w> E<lt>= 5) и месяце I<m> (1 E<lt>= I<m> E<lt>= 12). Неделя номер 1 — это первая неделя, в которой есть день I<d>, а неделя номер 5 — это последняя неделя, в которой есть день I<d>. День номер 0 — это воскресенье.

source: The I<time> fields specify when, in the local time currently in effect, the change to the other time occurs. If omitted, the default is 02:00:00.
ru: В поле I<time> задаётся, когда по действующему времени наступает переход на другое время. Если не указано, то по умолчанию равно 02:00:00.

source: Here is an example for New Zealand, where the standard time (NZST) is 12 hours ahead of UTC, and daylight saving time (NZDT), 13 hours ahead of UTC, runs from the first Sunday in October to the third Sunday in March, and the changeovers happen at the default time of 02:00:00:
ru: Вот пример для Новой Зеландии, где поясное (standard) время (NZST) на 12 часов опережает UTC, а летнее (daylight saving) время (NZDT) на 13 часов опережает UTC, которое действует с первого воскресенья октября по третье воскресенье марта, и меняется обратно в 02:00:00 (как значение по умолчанию):

source: The second format specifies that the timezone information should be read from a file:
ru: Второй формат используется, если информация о часовом поясе должна быть получена из файла:

source: If the file specification I<filespec> is omitted, or its value cannot be interpreted, then Coordinated Universal Time (UTC) is used. If I<filespec> is given, it specifies another B<tzfile>(5)-format file to read the timezone information from. If I<filespec> does not begin with a \(aq/\(aq, the file specification is relative to the system timezone directory. If the colon is omitted each of the above B<TZ> formats will be tried.
ru: Если указание файла I<filespec> опущено или его значение не может быть понято, то используется всемирное координированное время (UTC). Если значение I<filespec> не пусто, то оно определяет другой файл формата B<tzfile>(5), из которого будет получена информация о часовых поясах. Если значение I<filespec> не начинается с символа «/», то этот файл находится в системном каталоге часовых поясов. Если отсутствует двоеточие, то будет опробован каждый из представленных выше форматов B<TZ>.

source: Here's an example, once more for New Zealand:
ru: Вот ещё один пример для Новой Зеландии:

source: If this variable is set its value takes precedence over the system configured timezone.
ru: Если эта переменная установлена, то её значение имеет приоритет над настроенным системным часовым поясом.

source: If this variable is set its value takes precedence over the system configured timezone database directory path.
ru: Если эта переменная установлена, то её значение имеет приоритет над путём базы данных системных часовых поясов.

source: The system timezone file.
ru: Файл системного часового пояса.

source: The system timezone database directory.
ru: Системный каталог базы данных часовых поясов.

source: When a TZ string includes a dst timezone without anything following it, then this file is used for the start/end rules. It is in the B<tzfile>(5) format. By default, the zoneinfo Makefile hard links it to the I<America/New_York> tzfile.
ru: Когда строка TZ содержит часовой пояс dst и больше ничего, то из этого файла берутся начальные/конечные правила. Его формат совпадает с B<tzfile>(5). По умолчанию Makefile из zoneinfo создаёт его как жёсткую ссылку на tz-файл I<America/New_York>.

source: Above are the current standard file locations, but they are configurable when glibc is compiled.
ru: Показанные файлы выше — текущие стандартные расположения файлов, но они могут быть изменены при компиляции glibc.

source: 4.3BSD had a function B<char *timezone(>I<zone>B<, >I<dst>B<)> that returned the name of the timezone corresponding to its first argument (minutes West of UTC). If the second argument was 0, the standard name was used, otherwise the daylight saving time version.
ru: В 4.3BSD имелась функция B<char *timezone(>I<zone>B<, >I<dst>B<)>, которая возвращала имя часового пояса, соответствующее первому аргументу (минуты западнее UTC). Если второй аргумент равнялся 0, то использовалось поясное имя, иначе использовалась версия для летнего времени.

source: towctrans - wide-character transliteration
ru: towctrans - транслитерация широкого символа

source: If I<wc> is a wide character, the B<towctrans>() function translates it according to the transliteration descriptor I<desc>. If I<wc> is B<WEOF>, B<WEOF> is returned.
ru: Если аргумент I<wc> — это широкий символ, то функция B<towctrans> транслирует его в соответствии с описателем I<desc>. Если I<wc> равно B<WEOF>, то возвращается B<WEOF>.

source: I<desc> must be a transliteration descriptor returned by the B<wctrans>(3) function.
ru: Значение I<desc> должно быть описателем транслитерации, возвращаемым функцией B<wctrans>(3).

source: The B<towctrans>() function returns the translated wide character, or B<WEOF> if I<wc> is B<WEOF>.
ru: Функция B<towctrans>() возвращает преобразованный широкий символ или B<WEOF>, если I<wc> равно B<WEOF>.

source: The behavior of B<towctrans>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<towctrans>() зависит от категории B<LC_CTYPE> текущей локали.

source: tmpnam, tmpnam_r - create a name for a temporary file
ru: tmpnam, tmpnam_r - создаёт имя для временного файла

source: Since glibc 2.19:
ru: Начиная с glibc 2.19:

source: Up to and including glibc 2.19:
ru: Начиная с glibc 2.19:

source: B<Note:> avoid using these functions; use B<mkstemp>(3) or B<tmpfile>(3) instead.
ru: B<Замечание:> не используйте эти функции; вместо них используйте B<mkstemp>(3) или B<tmpfile>(3).

source: The B<tmpnam>() function returns a pointer to a string that is a valid filename, and such that a file with this name did not exist at some point in time, so that naive programmers may think it a suitable name for a temporary file. If the argument I<s> is NULL, this name is generated in an internal static buffer and may be overwritten by the next call to B<tmpnam>(). If I<s> is not NULL, the name is copied to the character array (of length at least I<L_tmpnam>) pointed to by I<s> and the value I<s> is returned in case of success.
ru: Функция B<tmpnam>() возвращает указатель на строку, содержащую корректное имя файла, и гарантирует, что файла с таким именем не существует на момент вызова, и наивный программист может считать это имя самым подходящим для временного файла. Если аргумент I<s> равен NULL, это имя генерируется во внутреннем статическом буфере и может быть изменено последующим вызовом B<tmpnam>(). Если I<s> не равно NULL, то имя копируется в массив символов (длиной не менее I<L_tmpnam>), на который указывает I<s>, и в случае успешного выполнения возвращается значение I<s>.

source: The created pathname has a directory prefix I<P_tmpdir>. (Both I<L_tmpnam> and I<P_tmpdir> are defined in I<E<lt>stdio.hE<gt>>, just like the B<TMP_MAX> mentioned below.)
ru: Созданное имя файла содержит префикс каталога I<P_tmpdir> (I<L_tmpnam> и I<P_tmpdir> определены в I<E<lt>stdio.hE<gt>> также, как B<TMP_MAX>, описанная ниже).

source: The B<tmpnam_r>() function performs the same task as B<tmpnam>(), but returns NULL (to indicate an error) if I<s> is NULL.
ru: Функция B<tmpnam_r>() выполняет ту же задачу, что и B<tmpnam>(), но возвращает NULL (возникла ошибка), если I<s> равно NULL.

source: These functions return a pointer to a unique temporary filename, or NULL if a unique name cannot be generated.
ru: Эти функции возвращают указатель на уникальное имя временного файла, либо NULL, если уникальное имя невозможно сгенерировать.

source: B<tmpnam>(): SVr4, 4.3BSD, C89, C99, POSIX.1-2001. POSIX.1-2008 marks B<tmpnam>() as obsolete.
ru: B<tmpnam>(): SVr4, 4.3BSD, C89, C99, POSIX.1-2001. В POSIX.1-2008 функция B<tmpnam>() помечена как устаревшая.

source: B<tmpnam_r>() is a nonstandard extension that is also available on a few other systems.
ru: Функция B<tmpnam_r>() является нестандартным расширением, но доступна и в некоторых других системах.

source: The B<tmpnam>() function generates a different string each time it is called, up to B<TMP_MAX> times. If it is called more than B<TMP_MAX> times, the behavior is implementation defined.
ru: Функция B<tmpnam>() генерирует уникальное имя каждый раз, до B<TMP_MAX> вызовов. Если она будет вызвана более чем B<TMP_MAX> раз, то дальнейшее поведение определяется конкретной реализацией.

source: Although these functions generate names that are difficult to guess, it is nevertheless possible that between the time that the pathname is returned and the time that the program opens it, another program might create that pathname using B<open>(2), or create it as a symbolic link. This can lead to security holes. To avoid such possibilities, use the B<open>(2) B<O_EXCL> flag to open the pathname. Or better yet, use B<mkstemp>(3) or B<tmpfile>(3).
ru: Хотя эти функции генерируют имена, которые трудно подобрать, тем не менее, есть вероятность, что за промежуток времени, когда вернётся имя файла и программа откроет его, другая программа успеет создать с помощью B<open>(2) файл с таким же именем или символическую ссылку, что может привести к проблемам с безопасностью. Чтобы исключить подобную вероятность, для открытия файла используйте B<open>(2) с флагом B<O_EXCL>. А ещё лучше — воспользуйтесь B<mkstemp>(3) или B<tmpfile>(3).

source: Portable applications that use threads cannot call B<tmpnam>() with a NULL argument if either B<_POSIX_THREADS> or B<_POSIX_THREAD_SAFE_FUNCTIONS> is defined.
ru: Если определён B<_POSIX_THREADS> или B<_POSIX_THREAD_SAFE_FUNCTIONS>, то в переносимых приложениях с нитями нельзя вызывать B<tmpnam>() с аргументом NULL.

source: Never use these functions. Use B<mkstemp>(3) or B<tmpfile>(3) instead.
ru: Никогда не используйте эти функции. Вместо них используйте B<mkstemp>(3) или B<tmpfile>(3).

source: tcgetpgrp, tcsetpgrp - get and set terminal foreground process group
ru: tcgetpgrp, tcsetpgrp - возвращает и задаёт терминал активной группы процессов

source: The function B<tcgetpgrp>() returns the process group ID of the foreground process group on the terminal associated to I<fd>, which must be the controlling terminal of the calling process.
ru: Функция B<tcgetpgrp>() возвращает идентификатор активной (foreground) группы процессов, терминал которой связан с I<fd>. Этот терминал должен быть управляющим терминалом вызывающего процесса.

source: The function B<tcsetpgrp>() makes the process group with process group ID I<pgrp> the foreground process group on the terminal associated to I<fd>, which must be the controlling terminal of the calling process, and still be associated with its session. Moreover, I<pgrp> must be a (nonempty) process group belonging to the same session as the calling process.
ru: Функция B<tcsetpgrp>() делает группу процессов с идентификатором I<pgrp> активной группой процессов на терминале, связанном с I<fd>, который должен быть управляющим терминалом для вызывающего процесса, и все ещё быть связанным с его сеансом. Более того, I<pgrp> должно быть (непустой) группой процессов, принадлежащей к тому же сеансу, что и вызывающий процесс.

source: If B<tcsetpgrp>() is called by a member of a background process group in its session, and the calling process is not blocking or ignoring B<SIGTTOU>, a B<SIGTTOU> signal is sent to all members of this background process group.
ru: Если B<tcsetpgrp>() вызывается членом группы фоновых процессов в этом сеансе, и вызывающий процесс не блокирует или игнорирует B<SIGTTOU>, то сигнал B<SIGTTOU> отправляется всем членам этой группы фоновых процессов.

source: When I<fd> refers to the controlling terminal of the calling process, the function B<tcgetpgrp>() will return the foreground process group ID of that terminal if there is one, and some value larger than 1 that is not presently a process group ID otherwise. When I<fd> does not refer to the controlling terminal of the calling process, -1 is returned, and I<errno> is set appropriately.
ru: Когда I<fd> ссылается на управляющий терминал вызывающего процесса, функция B<tcgetpgrp>() возвращает идентификатор активной группы процессов этого терминала, если такой существует, или некоторое значение больше 1, не являющееся в данный момент идентификатором группы процессов, в другом случае. Когда I<fd> не ссылается на управляющий терминал вызывающего процесса, возвращается -1, а переменная I<errno> устанавливается соответственно ошибке.

source: When successful, B<tcsetpgrp>() returns 0. Otherwise, it returns -1, and I<errno> is set appropriately.
ru: При успешном выполнении B<tcsetpgrp>() возвращает 0. Иначе возвращается -1 и переменная I<errno> устанавливается соответствующим образом.

source: I<pgrp> has an unsupported value.
ru: Неподдерживаемое значение I<pgrp>.

source: The calling process does not have a controlling terminal, or it has one but it is not described by I<fd>, or, for B<tcsetpgrp>(), this controlling terminal is no longer associated with the session of the calling process.
ru: Вызывающий процесс не имеет управляющего терминала, или он имеется, но не описан I<fd>, или, для B<tcsetpgrp>(), этот управляющий терминал больше не связан с сеансом вызывающего процесса.

source: I<pgrp> has a supported value, but is not the process group ID of a process in the same session as the calling process.
ru: В I<pgrp> содержится поддерживаемое значение, но это не идентификатор группы процессов для процесса в том же сеансе, что и вызывающий процесс.

source: These functions are implemented via the B<TIOCGPGRP> and B<TIOCSPGRP> ioctls.
ru: Эти функции реализованы через вызовы ioctl B<TIOCGPGRP> и B<TIOCSPGRP>.

source: History
ru: История

source: The ioctls appeared in 4.2BSD. The functions are POSIX inventions.
ru: Эти вызовы ioctl появились в 4.2BSD. Функции являются изобретениями POSIX.

source: telldir - return current location in directory stream
ru: telldir - возвращает текущее положение в потоке каталога

source: B<telldir>(): _XOPEN_SOURCE || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: B<telldir>(): _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версиях glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<telldir>() function returns the current location associated with the directory stream I<dirp>.
ru: Функция B<telldir>() возвращает текущее положение, связанное с потоком каталога I<dirp>.

source: On success, the B<telldir>() function returns the current location in the directory stream. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении функция B<telldir>() возвращает текущее расположение в потоке каталога. В случае ошибки возвращается -1, и устанавливается соответствующее значение I<errno>.

source: Invalid directory stream descriptor I<dirp>.
ru: Неверный дескриптор потока каталога I<dirp>.

source: In glibc up to version 2.1.1, the return type of B<telldir>() was I<off_t>. POSIX.1-2001 specifies I<long>, and this is the type used since glibc 2.1.2.
ru: В glibc до версии 2.1.1, тип возвращаемого значения B<telldir>() был равен I<off_t>. В POSIX.1-2001 указан тип I<long>, и это стало используемым типом в glibc начиная с версии 2.1.2.

source: In early filesystems, the value returned by B<telldir>() was a simple file offset within a directory. Modern filesystems use tree or hash structures, rather than flat tables, to represent directories. On such filesystems, the value returned by B<telldir>() (and used internally by B<readdir>(3)) is a "cookie" that is used by the implementation to derive a position within a directory. Application programs should treat this strictly as an opaque value, making I<no> assumptions about its contents.
ru: В старых файловых системах возвращаемое B<telldir>() значение было просто файловым смещением в каталоге. В современных файловых системах для представления каталогов используются структуры деревьев или хэшей, а не плоские таблицы. В таких файловых системах значение, возвращаемое B<telldir>() (и используемое внутри B<readdir>(3)) — некая «подсказка», которая используется реализацией для получения позиции в каталоге. Прикладные программы должны считать это значение «чёрным ящиком» и I<не> делать предположений о его содержимом.

source: ttyname, ttyname_r - return name of a terminal
ru: ttyname, ttyname_r - возвращает имя терминала

source: The function B<ttyname>() returns a pointer to the null-terminated pathname of the terminal device that is open on the file descriptor I<fd>, or NULL on error (for example, if I<fd> is not connected to a terminal). The return value may point to static data, possibly overwritten by the next call. The function B<ttyname_r>() stores this pathname in the buffer I<buf> of length I<buflen>.
ru: Функция B<ttyname>() возвращает указатель на завершаемый нулевым символом путь устройства терминала, на котором был открыт файловый дескриптор I<fd>, или NULL в случае ошибки (например, если I<fd> не подключен к терминалу). Возвращаемое значение может указывать на статические данные, которые могут быть перезаписаны при следующем вызове. Функция B<ttyname_r>() сохраняет имя пути в буфере I<buf> длиной I<buflen>.

source: The function B<ttyname>() returns a pointer to a pathname on success. On error, NULL is returned, and I<errno> is set appropriately. The function B<ttyname_r>() returns 0 on success, and an error number upon error.
ru: При успешном выполнении функция B<ttyname>() возвращает указатель на имя пути. В случае ошибки возвращается NULL, в I<errno> устанавливается код ошибки. При успешном выполнении функция B<ttyname_r>() возвращает 0, а в случае ошибки — номер ошибки.

source: Bad file descriptor.
ru: Неправильный дескриптор файла.

source: File descriptor does not refer to a terminal device.
ru: Файловый дескриптор указывает не на устройство терминала.

source: (B<ttyname_r>()) I<buflen> was too small to allow storing the pathname.
ru: (B<ttyname_r>()) Значение I<buflen> мало для хранения имени пути.

source: File descriptor refers to a slave pseudoterminal device but the corresponding pathname could not be found (see NOTES).
ru: Файловые дескрипторы ссылаются на устройство подчинённого псевдотерминала, но соответствующий путь невозможно найти (смотрите ЗАМЕЧАНИЯ).

source: A process that keeps a file descriptor that refers to a B<pts>(4) device open when switching to another mount namespace that uses a different I</dev/ptmx> instance may still accidentally find that a device path of the same name for that file descriptor exists. However, this device path refers to a different device and thus can't be used to access the device that the file descriptor refers to. Calling B<ttyname>() or B<ttyname_r>() on the file descriptor in the new mount namespace will cause these functions to return NULL and set I<errno> to B<ENODEV>.
ru: Процесс, сохранивший файловый дескриптор, указывающий на устройство B<pts>(4), открытым при переключении в другое пространство имён монтирования, в котором используется другой экземпляр I</dev/ptmx>, может неожиданно обнаружить, что существует путь устройства с тем же именем как у этого файлового дескриптора. Однако данный путь указывает на другое устройство и поэтому не может использоваться для доступа к устройству, на который указывает файловый дескриптор. Вызов B<ttyname>() или B<ttyname_r>() с файловым дескриптором в новом пространстве имён монтирования приведёт к тому, что эти функции вернут NULL и присвоят I<errno> значение B<ENODEV>.

source: termios, tcgetattr, tcsetattr, tcsendbreak, tcdrain, tcflush, tcflow, cfmakeraw, cfgetospeed, cfgetispeed, cfsetispeed, cfsetospeed, cfsetspeed - get and set terminal attributes, line control, get and set baud rate
ru: termios, tcgetattr, tcsetattr, tcsendbreak, tcdrain, tcflush, tcflow, cfmakeraw, cfgetospeed, cfgetispeed, cfsetispeed, cfsetospeed, cfsetspeed - возвращает и задаёт атрибуты терминала, управляет линией, возвращает и задаёт скорость передачи

source: B<cfsetspeed>(), B<cfmakeraw>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<cfsetspeed>(), B<cfmakeraw>(): начиная с glibc 2.19: _DEFAULT_SOURCE glibc 2.19 и старее: _BSD_SOURCE

source: The termios functions describe a general terminal interface that is provided to control asynchronous communications ports.
ru: Функции termios описывают общий интерфейс терминала, который предоставляет управление асинхронными портами связи.

source: The termios structure
ru: Структура termios

source: Many of the functions described here have a I<termios_p> argument that is a pointer to a I<termios> structure. This structure contains at least the following members:
ru: Множество описанных здесь функций имеют аргумент I<termios_p>, который является указателем на структуру I<termios>. В этой структуре есть, по крайней мере, следующие поля:

source: tcflag_t c_iflag; /* input modes */ tcflag_t c_oflag; /* output modes */ tcflag_t c_cflag; /* control modes */ tcflag_t c_lflag; /* local modes */ cc_t c_cc[NCCS]; /* special characters */
ru: tcflag_t c_iflag; /* режимы ввода */ tcflag_t c_oflag; /* режимы вывода */ tcflag_t c_cflag; /* режимы управления */ tcflag_t c_lflag; /* локальные режимы */ cc_t c_cc[NCCS]; /* специальные символы */

source: The values that may be assigned to these fields are described below. In the case of the first four bit-mask fields, the definitions of some of the associated flags that may be set are exposed only if a specific feature test macro (see B<feature_test_macros>(7)) is defined, as noted in brackets ("[]").
ru: Значения этих полей описаны далее. Для первых четырёх полей битовых масок определения некоторых флагов доступны только, если определён специальный макрос тестирования свойств (смотрите B<feature_test_macros>(7)), как указано в квадратных скобках («[]»).

source: In the descriptions below, "not in POSIX" means that the value is not specified in POSIX.1-2001, and "XSI" means that the value is specified in POSIX.1-2001 as part of the XSI extension.
ru: В описаниях ниже приписка «нет в POSIX» означает, что значение не описано в POSIX.1-2001, а «XSI» — что значение описано в POSIX.1-2001 как часть расширения XSI.

source: I<c_iflag> flag constants:
ru: Константы флага I<c_iflag>:

source: Ignore BREAK condition on input.
ru: Игнорировать состояние BREAK в вводе.
