Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: !1 shifted save key !2 shifted suspend key !3 shifted undo key #1 shifted help key #2 shifted home key #3 shifted input key #4 shifted cursor left key %0 redo key %1 help key %2 mark key %3 message key %4 move key %5 next-object key %6 open key %7 options key %8 previous-object key %9 print key %a shifted message key %b shifted move key %c shifted next key %d shifted options key %e shifted previous key %f shifted print key %g shifted redo key %h shifted replace key %i shifted cursor right key %j shifted resume key &0 shifted cancel key &1 reference key &2 refresh key &3 replace key &4 restart key &5 resume key &6 save key &7 suspend key &8 undo key &9 shifted begin key *0 shifted find key *1 shifted command key *2 shifted copy key *3 shifted create key *4 shifted delete character *5 shifted delete line *6 select key *7 shifted end key *8 shifted clear line key *9 shifted exit key @0 find key @1 begin key @2 cancel key @3 close key @4 command key @5 copy key @6 create key @7 end key @8 enter/send key @9 exit key al Insert one line AL Insert %1 lines ac Pairs of block graphic characters to map alternate character set ae End alternative character set as Start alternative character set for block graphic characters bc Backspace, if not B<^H> bl Audio bell bt Move to previous tab stop cb Clear from beginning of line to cursor cc Dummy command character cd Clear to end of screen ce Clear to end of line ch Move cursor horizontally only to column %1 cl Clear screen and cursor home cm Cursor move to row %1 and column %2 (on screen) CM Move cursor to row %1 and column %2 (in memory) cr Carriage return cs Scroll region from line %1 to %2 ct Clear tabs cv Move cursor vertically only to line %1 dc Delete one character DC Delete %1 characters dl Delete one line DL Delete %1 lines dm Begin delete mode do Cursor down one line DO Cursor down #1 lines ds Disable status line eA Enable alternate character set ec Erase %1 characters starting at cursor ed End delete mode ei End insert mode ff Formfeed character on hardcopy terminals fs Return character to its position before going to status line F1 The string sent by function key f11 F2 The string sent by function key f12 F3 The string sent by function key f13 \&... \&... F9 The string sent by function key f19 FA The string sent by function key f20 FB The string sent by function key f21 \&... \&... FZ The string sent by function key f45 Fa The string sent by function key f46 Fb The string sent by function key f47 \&... \&... Fr The string sent by function key f63 hd Move cursor a half line down ho Cursor home hu Move cursor a half line up i1 Initialization string 1 at login i3 Initialization string 3 at login is Initialization string 2 at login ic Insert one character IC Insert %1 characters if Initialization file im Begin insert mode ip Insert pad time and needed special characters after insert iP Initialization program K1 upper left key on keypad K2 center key on keypad K3 upper right key on keypad K4 bottom left key on keypad K5 bottom right key on keypad k0 Function key 0 k1 Function key 1 k2 Function key 2 k3 Function key 3 k4 Function key 4 k5 Function key 5 k6 Function key 6 k7 Function key 7 k8 Function key 8 k9 Function key 9 k; Function key 10 ka Clear all tabs key kA Insert line key kb Backspace key kB Back tab stop kC Clear screen key kd Cursor down key kD Key for delete character under cursor ke turn keypad off kE Key for clear to end of line kF Key for scrolling forward/down kh Cursor home key kH Cursor hown down key kI Insert character/Insert mode key kl Cursor left key kL Key for delete line kM Key for exit insert mode kN Key for next page kP Key for previous page kr Cursor right key kR Key for scrolling backward/up ks Turn keypad on kS Clear to end of screen key kt Clear this tab key kT Set tab here key ku Cursor up key l0 Label of zeroth function key, if not f0 l1 Label of first function key, if not f1 l2 Label of first function key, if not f2 \&... \&... la Label of tenth function key, if not f10 le Cursor left one character ll Move cursor to lower left corner LE Cursor left %1 characters LF Turn soft labels off LO Turn soft labels on mb Start blinking MC Clear soft margins md Start bold mode me End all mode like so, us, mb, md, and mr mh Start half bright mode mk Dark mode (Characters invisible) ML Set left soft margin mm Put terminal in meta mode mo Put terminal out of meta mode mp Turn on protected attribute mr Start reverse mode MR Set right soft margin nd Cursor right one character nw Carriage return command pc Padding character pf Turn printer off pk Program key %1 to send string %2 as if typed by user pl Program key %1 to execute string %2 in local mode pn Program soft label %1 to show string %2 po Turn the printer on pO Turn the printer on for %1 (E<lt>256) bytes ps Print screen contents on printer px Program key %1 to send string %2 to computer r1 Reset string 1 to set terminal to sane modes r2 Reset string 2 to set terminal to sane modes r3 Reset string 3 to set terminal to sane modes RA disable automatic margins rc Restore saved cursor position rf Reset string filename RF Request for input from terminal RI Cursor right %1 characters rp Repeat character %1 for %2 times rP Padding after character sent in replace mode rs Reset string RX Turn off XON/XOFF flow control sa Set %1 %2 %3 %4 %5 %6 %7 %8 %9 attributes SA enable automatic margins sc Save cursor position se End standout mode sf Normal scroll one line SF Normal scroll %1 lines so Start standout mode sr Reverse scroll SR scroll back %1 lines st Set tabulator stop in all rows at current column SX Turn on XON/XOFF flow control ta move to next hardware tab tc Read in terminal description from another entry te End program that uses cursor motion ti Begin program that uses cursor motion ts Move cursor to column %1 of status line uc Underline character under cursor and move cursor right ue End underlining up Cursor up one line UP Cursor up %1 lines us Start underlining vb Visible bell ve Normal cursor visible vi Cursor invisible vs Standout cursor wi Set window from line %1 to %2 and column %3 to %4 XF XOFF character if not B<^S>
ru: !1 клавиша save в другом регистре !2 клавиша suspend в другом регистре !3 клавиша undo в другом регистре #1 клавиша help в другом регистре #2 клавиша home в другом регистре #3 клавиша input в другом регистре #4 клавиша cursor left в другом регистре %0 клавиша redo %1 клавиша help %2 клавиша mark %3 клавиша message %4 клавиша move %5 клавиша next-object %6 клавиша open %7 клавиша options %8 клавиша previous-object %9 клавиша print %a клавиша message в другом регистре %b клавиша move в другом регистре %c клавиша next в другом регистре %d клавиша options в другом регистре %e клавиша previous в другом регистре %f клавиша print в другом регистре %g клавиша redo в другом регистре %h клавиша replace в другом регистре %i клавиша cursor right в другом регистре %j клавиша resume в другом регистре &0 клавиша cancel в другом регистре &1 клавиша reference &2 клавиша refresh &3 клавиша replace &4 клавиша restart &5 клавиша resume &6 клавиша save &7 клавиша suspend &8 клавиша undo &9 клавиша begin в другом регистре *0 клавиша find в другом регистре *1 клавиша command в другом регистре *2 клавиша copy в другом регистре *3 клавиша create в другом регистре *4 клавиша delete в другом регистре *5 клавиша delete line в другом регистре *6 клавиша select *7 клавиша end в другом регистре *8 клавиша clear line в другом регистре *9 клавиша exit в другом регистре @0 клавиша find @1 клавиша begin @2 клавиша cancel @3 клавиша close @4 клавиша command @5 клавиша copy @6 клавиша create @7 клавиша end @8 клавиша enter/send @9 клавиша exit al Вставить одну строку AL Вставить %1 строк ac Пара блоков графических символов для отображения на альтернативный набор символов ae Конец альтернативного символьного набора as Начало альтернативного символьного набора для блока графических символов bc Backspace, если нет B<^H> bl Звонок bt Переместиться к предыдущей остановке табуляции cb Очистить от начала строки до курсора cc Символ пустой команды cd Очистить до конца экрана ce Очистить до конца строки ch Переместить курсор горизонтально в столбец %1 cl Очистить экран и вернуть курсор в начальную позицию cm Переместить курсор на строку %1 и столбец %2 (на экране) CM Переместить курсор на строку %1 и столбец %2 (в памяти) cr Возврат каретки cs Прокрутить область от строки %1 до %2 ct Очистить табуляции cv Переместить курсор вертикально на строку %1 dc Удалить один символ DC Удалить %1 символов dl Удалить одну строку DL Удалить %1 строк dm Начало режима удаления do Переместить курсор вниз на одну строку DO Переместить курсор вниз на #1 строк ds Выключить строку состояния eA Включить альтернативный набор символов ec Стереть %1 символов, начиная с позиции курсора ed Конец режима удаления ei Конец режима вставки ff Символ перевода страницы на печатающих терминалах fs Вернуть символ в его позицию перед переходом в строку состояния F1 Строка, посылаемая клавишей f11 F2 Строка, посылаемая клавишей f12 F3 Строка, посылаемая клавишей f13 \&... \&... F9 Строка, посылаемая клавишей f19 FA Строка, посылаемая клавишей f20 FB Строка, посылаемая клавишей f21 \&... \&... FZ Строка, посылаемая клавишей f45 Fa Строка, посылаемая клавишей f46 Fb Строка, посылаемая клавишей f47 \&... \&... Fr Строка, посылаемая клавишей f63 hd Переместить курсор на половину строки вниз ho Переместить курсор в начальную позицию hu Переместить курсор на половину строки вверх i1 Строка 1 инициализации при входе в систему i3 Строка 3 инициализации при входе в систему is Строка 2 инициализации при входе в систему ic Вставить один символ IC Вставить %1 символов if Файл инициализации im Начать режим вставки ip Вставить время заполнения и необходимые специальные символы после вставки iP Программа инициализации K1 Левая верхняя клавиша на доп. клавиатуре K2 Центральная клавиша на доп. клавиатуре K3 Правая верхняя клавиша на доп. клавиатуре K4 Левая нижняя клавиша на доп. клавиатуре K5 Правая нижняя клавиша на доп. клавиатуре k0 Функциональная клавиша 0 k1 Функциональная клавиша 1 k2 Функциональная клавиша 2 k3 Функциональная клавиша 3 k4 Функциональная клавиша 4 k5 Функциональная клавиша 5 k6 Функциональная клавиша 6 k7 Функциональная клавиша 7 k8 Функциональная клавиша 8 k9 Функциональная клавиша 9 k; Функциональная клавиша 10 ka Стирание всех кодов табуляции kA Клавиша вставки строки kb Клавиша забоя kB Back tab stop kC Клавиша очистки экрана kd Клавиша курсор вниз kD Клавиша удаления символа под курсором ke Выключить цифровую доп. клавиатуру kE Клавиша очистки до конца строки kF Клавиша прокрутки вперёд/вниз kh Клавиша курсора home kH Клавиша курсора hown down kI Клавиша вставки символа/режима вставки kl Клавиша курсор влево kL Клавиша удаления строки kM Клавиша выхода из режима вставки kN Клавиша следующая страница kP Клавиша предыдущая страница kr Клавиша курсор вправо kR Клавиша прокрутки назад/вверх ks Включить цифровую доп. клавиатуру kS Очистить до конца экрана kt Очистить эту клавишу табуляции kT Задать клавишу Здесь табуляция ku Клавиша курсор вверх l0 Ярлык нулевой функциональной клавиши, если нет f0 l1 Ярлык первой функциональной клавиши, если нет f1 l2 Ярлык второй функциональной клавиши, если нет f2 \&... \&... la Ярлык десятой функциональной клавиши, если нет f10 le Переместить курсор влево на один символ ll Переместить курсор в левый нижний угол LE Переместить курсор влево на %1 символов LF Выключить функциональные ярлыки LO Включить функциональные ярлыки mb Включить мигание MC Очистить мягкие границы md Включить режим жирности me Выкличить все режимы: so, us, mb, md и mr mh Включить режим половинной яркости mk Тёмный режим (символы невидимы) ML Задать левую мягкую границу mm Перевести терминал в мета режим mo Вывести терминал из мета режима mp Включить атрибут защиты mr Включить обратный режим MR Задать правую мягкую границу nd Переместить курсор вправо на один символ nw Команда возврата каретки pc Символ заполнения pf Выключить принтер pk Запрограммировать клавишу %1 для отправки строки %2, как если бы она была набрана пользователем pl Запрограммировать клавишу %1 для выполнения строки %2 в локальном режиме pn Запрограммировать функциональный ярлык %1 для показа строки %2 po Включить принтер pO Включить принтер в режим по %1 (E<lt>256) байт ps Напечатать содержимое экрана на принтере px Запрограммировать клавишу %1 для отправки строки %2 в компьютер r1 Строка сброса 1 для установки терминала в нормальные режимы r2 Строка сброса 2 для установки терминала в нормальные режимы r3 Строка сброса 3 для установки терминала в нормальные режимы RA Выключить автоматические границы rc Восстановить сохранённую позицию курсора rf Имя файла для строки сброса RF Запросить ввод с терминала RI Переместить курсор вправо на %1 символов rp Повторить символ %1 %2 раз rP Заполнить после отправки символа в режиме замены rs Сбросить строку RX Выключить протокол XON/XOFF для управления потоком sa Задать атрибуты %1 %2 %3 %4 %5 %6 %7 %8 %9 SA Включить автоматические границы sc Сохранить позицию курсора se Конец режима выделения sf Прокрутить на одну строку SF Прокрутить на %1 строк so Начало режима выделения sr Изменить направление прокрутки SR Прокрутить назад на %1 строк st Задать остановку табуляции в текущем столбце во всех строках SX Включить протокол XON/XOFF для управления потоком ta Переместиться на следующую аппаратную позицию табуляции tc Прочитать описание терминала из другого элемента te Конец программы для перемещения курсора ti Начало программы для перемещения курсора ts Переместить курсов в столбец %1 в строке состояния uc Подчеркнуть символ под курсором и переместить курсор вправо ue Закончить подчёркивание up Переместить курсор вверх на 1 строку UP Переместить курсор вверх на %1 строк us Начать подчёркивание vb Визуальный звонок ve Видим обычный курсор vi Курсор невидим vs Курсор выделения wi Задать окно от строки %1 до %2 и от столбца %3 до %4 XF Символ XOFF, если нет B<^S>

source: There are several ways of defining the control codes for string capabilities:
ru: Есть несколько способов определения управляющих кодов со строковыми значениями:

source: Every normal character represents itself, except \(aq^\(aq, \(aq\e\(aq, and \(aq%\(aq.
ru: Обычные символы, исключая \(aq^\(aq, \(aq\e\(aq, и \(aq%\(aq.

source: A B<^x> means Control-x. Control-A equals 1 decimal.
ru: Значение B<^x> означает Control-x. Control-A эквивалентно десятичной единице.

source: \ex means a special code. x can be one of the following characters:
ru: \ex означает специальный код. x может быть одним из следующих символов:

source: n Linefeed (10)
ru: n Перевод строки (10)

source: r Carriage return (13)
ru: r Возврат каретки (13)

source: t Tabulation (9)
ru: t Табуляция (9)

source: b Backspace (8)
ru: b Забой (8)

source: f Form feed (12)
ru: f Прогон страницы (12)

source: 0 Null character. A \exxx specifies the octal character xxx.
ru: 0 Символ Null. Комбинация \exxx задаёт восьмеричный символ xxx.

source: Increments parameters by one.
ru: Увеличивает параметр на единицу

source: Single parameter capability
ru: Возможность одиночного параметра

source: Add value of next character to this parameter and do binary output
ru: Добавление значения следующего символа к данному параметру и выполнение вывода получившегося двоичного кода

source: Do ASCII output of this parameter with a field with of 2
ru: Выполнение ASCII вывода данного параметра с полем 2

source: Do ASCII output of this parameter with a field with of 3
ru: Выполнение ASCII вывода данного параметра с полем 3

source: Print a \(aq%\(aq
ru: Напечатать \(aq%\(aq

source: If you use binary output, then you should avoid the null character (\(aq\e0\(aq) because it terminates the string. You should reset tabulator expansion if a tabulator can be the binary output of a parameter.
ru: Если используется двоичный вывод, то нужно избегать символа null (\(aq\e0\(aq), потому что он завершает строку. Вы должны сбросить расширение табуляции, если табуляция может быть в двоичном выводе значения параметра.

source: Warning:
ru: Предупреждение:

source: The above metacharacters for parameters may be wrong: they document Minix termcap which may not be compatible with Linux termcap.
ru: Приведённые ранее используемые в параметрах метасимволы могут быть ошибочны: так они описаны в Minix termcap, который может быть несовместим с Linux termcap.

source: The block graphic characters can be specified by three string capabilities:
ru: Блок графических символов может быть задан через три строковых значения:

source: start the alternative charset
ru: начало альтернативного набора символов

source: end the alternative charset
ru: конец альтернативного набора символов

source: pairs of characters. The first character is the name of the block graphic symbol and the second characters is its definition.
ru: пара символов. Первый символ является именем блока графического символа, а второй является символом его описания.

source: The following names are available:
ru: Доступны следующие имена:

source: + right arrow (E<gt>) , left arrow (E<lt>) \&. down arrow (v) 0 full square (#) I lantern (#) - upper arrow (^) \&' rhombus (+) a chess board (:) f degree (') g plus-minus (#) h square (#) j right bottom corner (+) k right upper corner (+) l left upper corner (+) m left bottom corner (+) n cross (+) o upper horizontal line (-) q middle horizontal line (-) s bottom horizontal line (_) t left tee (+) u right tee (+) v bottom tee (+) w normal tee (+) x vertical line (|) ~ paragraph (???)
ru: + стрелка вправо (E<gt>) , стрелка влево (E<lt>) \&. стрелка вниз (v) 0 закрашенный квадрат (#) I фонарик (#) - стрелка вверх (^) \&' ромб (+) a шашечки (:) f градус (') g плюс-минус (#) h квадрат (#) j правый нижний уголок (+) k правый верхний уголок (+) l левый верхний уголок (+) m левый нижний уголок (+) n крест (+) o верхняя горизонтальная линия (-) q средняя горизонтальная линия (-) s нижняя горизонтальная линия (_) t Т-образный символ с чертой слева (+) u Т-образный символ с чертой справа (+) v Т-образный символ с чертой снизу (+) w Т-образный символ (+) x вертикальная линия (|) ~ параграф (???)

source: The values in parentheses are suggested defaults which are used by the I<curses> library, if the capabilities are missing.
ru: Значения в круглых скобках являются предлагаемыми значениями по умолчанию, которые используются библиотекой I<curses>, если эти возможности отсутствуют.

source: tcgetsid - get session ID
ru: tcgetsid - возвращает идентификатор сеанса

source: B<#define _XOPEN_SOURCE 500> /* See feature_test_macros(7) */
ru: B<#define _XOPEN_SOURCE 500> /* см. feature_test_macros(7) */

source: The function B<tcgetsid>() returns the session ID of the current session that has the terminal associated to I<fd> as controlling terminal. This terminal must be the controlling terminal of the calling process.
ru: Функция B<tcgetsid>() возвращает идентификатор сеанса текущего сеанса, управляющий терминал которого связан с I<fd>. Этот терминал должен быть управляющим терминалом вызывающего процесса.

source: When I<fd> refers to the controlling terminal of our session, the function B<tcgetsid>() will return the session ID of this session. Otherwise, -1 is returned, and I<errno> is set appropriately.
ru: Когда I<fd> ссылается на управляющий терминал нашего сеанса, функция B<tcgetsid>() возвращает идентификатор сеанса этого сеанса. В противном случае возвращается -1, и I<errno> устанавливается соответствующим образом.

source: The calling process does not have a controlling terminal, or it has one but it is not described by I<fd>.
ru: Вызвавший процесс не имеет управляющего терминала или I<fd> не ссылается на имеющийся управляющий терминал.

source: B<tcgetsid>() is provided in glibc since version 2.1.
ru: Функция B<tcgetsid>() появилась в glibc начиная с версии 2.1.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: This function is implemented via the B<TIOCGSID> B<ioctl>(2), present since Linux 2.1.71.
ru: Эта функция реализована посредством вызова B<ioctl>(2) с B<TIOCGSID>, появившемся в Linux 2.1.71.

source: tempnam - create a name for a temporary file
ru: tempnam - создаёт имя для временного файла

source: B<tempnam>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<tempnam>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: I<Never use this function.> Use B<mkstemp>(3) or B<tmpfile>(3) instead.
ru: I<Никогда не используйте эту функцию>. Вместо неё используйте B<mkstemp>(3) или B<tmpfile>(3).

source: The B<tempnam>() function returns a pointer to a string that is a valid filename, and such that a file with this name did not exist when B<tempnam>() checked. The filename suffix of the pathname generated will start with I<pfx> in case I<pfx> is a non-NULL string of at most five bytes. The directory prefix part of the pathname generated is required to be "appropriate" (often that at least implies writable).
ru: Функция B<tempnam>() возвращает указатель на строку, которая является допустимым именем файла и при этом файл с подобным именем на момент проверки B<tempnam>() не существует. Суффикс сгенерированного имени файла будет начинаться с I<pfx> (при условии, что I<pfx> — не NULL-строка и содержит не менее пяти байт). Также необходимо, чтобы префикс, состоящий из имён каталогов полного имени файла, был «целесообразным» (чаще всего это подразумевает, как минимум, доступность на запись).

source: Attempts to find an appropriate directory go through the following steps:
ru: Попытка найти подходящий каталог делится на следующие шаги:

source: In case the environment variable B<TMPDIR> exists and contains the name of an appropriate directory, that is used.
ru: Если существует переменная окружения B<TMPDIR>, которая содержит подходящий каталог, то используется она.

source: Otherwise, if the I<dir> argument is non-NULL and appropriate, it is used.
ru: Иначе, если аргумент I<dir> не является NULL и подходящий, то используется он.

source: Otherwise, I<P_tmpdir> (as defined in I<E<lt>stdio.hE<gt>>) is used when appropriate.
ru: Иначе используется I<P_tmpdir> (описана в I<E<lt>stdio.hE<gt>>), если она подходит.

source: Finally an implementation-defined directory may be used.
ru: И, наконец, может быть использован каталог, определённый реализацией функции.

source: The string returned by B<tempnam>() is allocated using B<malloc>(3) and hence should be freed by B<free>(3).
ru: Память под строку, возвращаемую B<tempnam>(), выделяется с помощью B<malloc>(3) и в последствии должна быть освобождена с помощью B<free>(3).

source: On success, the B<tempnam>() function returns a pointer to a unique temporary filename. It returns NULL if a unique name cannot be generated, with I<errno> set to indicate the cause of the error.
ru: При успешном выполнении функция B<tempnam>() возвращает указатель на уникальное имя временного файла. Она возвращает NULL, если его невозможно сгенерировать и записывает в I<errno> номер ошибки.

source: Allocation of storage failed.
ru: Не удалось выделить память для строки.

source: SVr4, 4.3BSD, POSIX.1-2001. POSIX.1-2008 marks B<tempnam>() as obsolete.
ru: SVr4, 4.3BSD, POSIX.1-2001. В POSIX.1-2008 функция B<tempnam>() отмечена как устаревшая.
