Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: tty - controlling terminal
ru: tty - управляющий терминал

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The file I</dev/tty> is a character file with major number 5 and minor number 0, usually with mode 0666 and ownership root:tty. It is a synonym for the controlling terminal of a process, if any.
ru: Файл I</dev/tty> является символьным файлом со старшим номером 5 и младшим номером 0, обычно имеет права доступа 0666 и принадлежит root:tty. Используется как синоним управляющего терминала процесса (если есть).

source: In addition to the B<ioctl>(2) requests supported by the device that B<tty> refers to, the B<ioctl>(2) request B<TIOCNOTTY> is supported.
ru: В дополнении к запросам B<ioctl>(2), поддерживаемым устройством, на которое указывает B<tty>, также поддерживается вызов B<ioctl>(2) B<TIOCNOTTY>.

source: Detach the calling process from its controlling terminal.
ru: Отсоединить вызывающий процесс от его управляющего терминала.

source: If the process is the session leader, then B<SIGHUP> and B<SIGCONT> signals are sent to the foreground process group and all processes in the current session lose their controlling tty.
ru: Если процесс является лидером сеанса, то использующей терминал группе процессов (foreground process group) будут посланы сигналы B<SIGHUP> и B<SIGCONT>, и все процессы в текущем сеансе потеряют свои управляющие tty.

source: This B<ioctl>(2) call works only on file descriptors connected to I</dev/tty>. It is used by daemon processes when they are invoked by a user at a terminal. The process attempts to open I</dev/tty>. If the open succeeds, it detaches itself from the terminal by using B<TIOCNOTTY>, while if the open fails, it is obviously not attached to a terminal and does not need to detach itself.
ru: Вызов B<ioctl>(2) может работать только с дескрипторами файлов, которые подключены к I</dev/tty>. Это используется процессами служб, когда они запущены пользователем с терминала. Процесс пытается открыть I</dev/tty>. Если это удаётся, то он отсоединяется от терминала с помощью B<TIOCNOTTY>; если же операция не удалась, то очевидно, что процесс не присоединён к терминалу и отсоединение не требуется.

source: FILES
ru: ФАЙЛЫ

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: ttyS - serial terminal lines
ru: ttyS - последовательные терминальные линии

source: B<ttyS[0-3]> are character devices for the serial terminal lines.
ru: B<ttyS[0-3]> \(em это символьные устройства для последовательных терминальных линий.

source: They are typically created by:
ru: Файлы устройств, обычно, создаются следующим образом:

source: mknod -m 660 /dev/ttyS0 c 4 64 # base address 0x3f8 mknod -m 660 /dev/ttyS1 c 4 65 # base address 0x2f8 mknod -m 660 /dev/ttyS2 c 4 66 # base address 0x3e8 mknod -m 660 /dev/ttyS3 c 4 67 # base address 0x2e8 chown root:tty /dev/ttyS[0-3]
ru: mknod -m 660 /dev/ttyS0 c 4 64 # базовый адрес 0x3f8 mknod -m 660 /dev/ttyS1 c 4 65 # базовый адрес 0x2f8 mknod -m 660 /dev/ttyS2 c 4 66 # базовый адрес 0x3e8 mknod -m 660 /dev/ttyS3 c 4 67 # базовый адрес 0x2e8 chown root:tty /dev/ttyS[0-3]

source: Linux System Administration
ru: Системное администрирование Linux

source: tzselect - select a timezone
ru: tzselect - выбор часового пояса

source: SYNOPSIS
ru: ОБЗОР

source: The B<tzselect> program asks the user for information about the current location, and outputs the resulting timezone description to standard output. The output is suitable as a value for the B<TZ> environment variable.
ru: Программа B<tzselect> запрашивает у пользователя его текущее местоположение и выводит описание часового пояса на устройство стандартного вывода. Это описание можно использовать в качестве значения переменной окружения B<TZ>.

source: All interaction with the user is done via standard input and standard error.
ru: Взаимодействие с пользователем происходит через устройства стандартного ввода и стандартных ошибок.

source: EXIT STATUS
ru: КОД РЕЗУЛЬТАТА

source: The exit status is zero if a timezone was successfully obtained from the user, and is nonzero otherwise.
ru: Возвращаемое значение равно нулю, если пользователь правильно ввёл информацию о часовом поясе; в противном случае возвращаемое значение не равно нулю.

source: ENVIRONMENT
ru: ОКРУЖЕНИЕ

source: Name of a POSIX-compliant I<awk> program (default: B<awk>).
ru: Имя POSIX-совместимой программы I<awk> (по умолчанию B<awk>).

source: Name of the directory containing timezone data files (default: I</usr/share/zoneinfo>).
ru: Имя каталога, содержащего файлы с описаниями часовых поясов (по умолчанию I</usr/share/zoneinfo>).

source: Table of ISO 3166 2-letter country codes and country names.
ru: Таблица двухсимвольных кодов стран и их названий, согласно стандарту ISO 3166.

source: Table of country codes, latitude and longitude, TZ values, and descriptive comments.
ru: Таблица кодов стран, широты и долготы, значений переменной TZ и описаний.

source: Timezone data file for timezone I<TZ>.
ru: Файл, содержащий описание часового пояса I<TZ>.

source: Linux User's Manual
ru: Руководство пользователя Linux

source: time - time a simple command or give resource usage
ru: time - подсчитывает время выполнения простой команды или использования ресурсов

source: B<time [>I<options>B<] >I<command>B< [>I<arguments...>B<] >
ru: B<time [>I<параметры>B<] >I<команда>B< [>I<аргументы...>B<] >

source: The B<time> command runs the specified program I<command> with the given arguments. When I<command> finishes, B<time> writes a message to standard error giving timing statistics about this program run. These statistics consist of (i) the elapsed real time between invocation and termination, (ii) the user CPU time (the sum of the I<tms_utime> and I<tms_cutime> values in a I<struct tms> as returned by B<times>(2)), and (iii) the system CPU time (the sum of the I<tms_stime> and I<tms_cstime> values in a I<struct tms> as returned by B<times>(2)).
ru: Программа B<time> запускает указанную I<команду> с заданными аргументами. Когда I<команда> завершается, B<time> выдаёт в стандартный вывод сообщений об ошибках статистическое сообщение об использованном времени при этом запуске. Эта статистика содержит (1) прошедшее реальное время между вызовом и завершением, (2) процессорное время работы в пользовательском пространстве (сумма значений I<tms_utime> и I<tms_cutime> из структуры I<struct tms>, возвращаемой B<times>(2)) и (3) процессорное время работы в системном пространстве (сумма значений I<tms_stime> и I<tms_cstime> из структуры I<struct tms>, возвращаемой B<times>(2)).

source: Note: some shells (e.g., B<bash>(1)) have a built-in B<time> command that provides similar information on the usage of time and possibly other resources. To access the real command, you may need to specify its pathname (something like I</usr/bin/time>).
ru: Замечание: некоторые командные интерпретаторы (например, B<bash>(1)) имеют встроенную команду B<time>, выводит похожую информацию и, возможно, другие ресурсы. Для работы с настоящей командой вам может потребоваться вызывать её по абсолютному имени (например, I</usr/bin/time>).

source: OPTIONS
ru: ПАРАМЕТРЫ

source: When in the POSIX locale, use the precise traditional format
ru: При локали POSIX использовать точный традиционный формат

source: (with numbers in seconds) where the number of decimals in the output for %f is unspecified but is sufficient to express the clock tick accuracy, and at least one.
ru: (с цифрами в секундах), где число целых разрядов в выводе для %f не задаётся, но является достаточным для точного вывода времени и, по крайней мере, разрядов не меньше одного.

source: If I<command> was invoked, the exit status is that of I<command>. Otherwise, it is 127 if I<command> could not be found, 126 if it could be found but could not be invoked, and some other nonzero value (1\(en125) if something else went wrong.
ru: Если I<команда> отработала, то возвращается её код результата (exit status). В противном случае он равен 27, если I<команда> не найдена, 126 — если она найдена, но не может быть вызвана, и некоторому другому отличному от нуля значению (1\(en125), если произошли какие-либо другие ошибки.

source: The variables B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC>, and B<NLSPATH> are used for the text and formatting of the output. B<PATH> is used to search for I<command>. The remaining ones for the text and formatting of the output.
ru: Переменные B<LANG>, B<LC_ALL>, B<LC_CTYPE>, B<LC_MESSAGES>, B<LC_NUMERIC> и B<NLSPATH> при выводе и форматировании текста. Переменная B<PATH> используется для поиска I<команды>. Остальные — для форматирования и вывода текстового результата.

source: GNU VERSION
ru: ВЕРСИЯ GNU

source: Below a description of the GNU 1.7 version of B<time>. Disregarding the name of the utility, GNU makes it output lots of useful information, not only about time used, but also on other resources like memory, I/O and IPC calls (where available). The output is formatted using a format string that can be specified using the I<-f> option or the B<TIME> environment variable.
ru: Ниже дано описание программы GNU B<time> версии 1.7. Несмотря на тоже имя утилиты, GNU выводит большее количество полезной информации, не только об использованном времени, но также и о других ресурсах, таких как память, ввод/вывод и вызовы IPC (если возможно). Вывод создаётся с помощью строки форматирования, которую можно задать с помощью параметра I<-f> или переменной окружения B<TIME>.

source: The default format string is:
ru: По умолчанию строка форматирования имеет вид:

source: When the I<-p> option is given, the (portable) output format is used:
ru: Если задан параметр I<-p>, то используется переносимый формат вывода:

source: The format string
ru: Строка форматирования

source: The format is interpreted in the usual printf-like way. Ordinary characters are directly copied, tab, newline and backslash are escaped using \et, \en and \e\e, a percent sign is represented by %%, and otherwise % indicates a conversion. The program B<time> will always add a trailing newline itself. The conversions follow. All of those used by B<tcsh>(1) are supported.
ru: Формат интерпретируется аналогично printf. Обычные символы просто копируются, табуляции, символы новой строки и обратная косая черта изолируются с помощью \et, \en и \e\e, знак процента указывается как %% и, наконец, % указывает на преобразование следующего за ним символа. Программа B<time> всегда будет добавлять в начало вывода новую строку. Преобразования описаны ниже. Поддерживаются все параметры, имеющиеся в B<tcsh>(1).

source: B<Time>
ru: B<Время>

source: Elapsed real time (in [hours:]minutes:seconds).
ru: Фактическое затраченное время (в формате [часы:]минуты:секунды).

source: (Not in B<tcsh>(1).) Elapsed real time (in seconds).
ru: (Нет в B<tcsh>(1).) Фактическое затраченное время (в секундах).

source: Total number of CPU-seconds that the process spent in kernel mode.
ru: Общее количество секунд времени ЦП, которое процесс провел в режиме ядра.

source: Total number of CPU-seconds that the process spent in user mode.
ru: Общее количество секунд времени ЦП, которое процесс провел в пользовательском режиме.

source: Percentage of the CPU that this job got, computed as (%U + %S) / %E.
ru: Процент ЦП, который процесс получил для работы, вычисляется как (%U + %S) / %E.

source: B<Memory>
ru: B<Память>

source: Maximum resident set size of the process during its lifetime, in Kbytes.
ru: Максимальный резидентный размер процесса в течении его выполнения в килобайтах.

source: (Not in B<tcsh>(1).) Average resident set size of the process, in Kbytes.
ru: (Нет в B<tcsh>(1).) Средний резидентный размер процесса в килобайтах.

source: Average total (data+stack+text) memory use of the process, in Kbytes.
ru: Средний общий размер использованной процессом памяти (данные+стек+текст) в килобайтах.

source: Average size of the process's unshared data area, in Kbytes.
ru: Средний размер неразделяемой области данных процесса в килобайтах.

source: (Not in B<tcsh>(1).) Average size of the process's unshared stack space, in Kbytes.
ru: (Нет в B<tcsh>(1).) Средний размер неразделяемого пространства стека процесса в килобайтах.

source: Average size of the process's shared text space, in Kbytes.
ru: Средний размер разделяемого пространства кода процесса в килобайтах.

source: (Not in B<tcsh>(1).) System's page size, in bytes. This is a per-system constant, but varies between systems.
ru: (Нет в B<tcsh>(1).) Размер системной страницы в байтах. Это значение является постоянным, но может отличаться у разных систем.

source: Number of major page faults that occurred while the process was running. These are faults where the page has to be read in from disk.
ru: Число больших страничных промахов, произошедших при работе процесса. Данные промахи учитываются, если нужную страницу пришлось читать с диска.

source: Number of minor, or recoverable, page faults. These are faults for pages that are not valid but which have not yet been claimed by other virtual pages. Thus the data in the page is still valid but the system tables must be updated.
ru: Число малых или восстановимых страничных промахов. Данные промахи учитываются для страниц, которые уже считаются некорректными, но не были захвачены другими виртуальными страницами. Таким образом, данные в странице всё ещё достоверны, но требуется обновление системных таблиц.

source: Number of times the process was swapped out of main memory.
ru: Количество раз, которое процесс был выгружен в область подкачки из основной памяти.

source: Number of times the process was context-switched involuntarily (because the time slice expired).
ru: Количество раз, когда для процесса совершалось принудительное переключение контекста (потому что истёк выделенный ему отрезок времени).

source: Number of waits: times that the program was context-switched voluntarily, for instance while waiting for an I/O operation to complete.
ru: Количество ожиданий: сколько раз программа добровольно выполняла переключение контекста, например, на время ожидания завершения операций ввода/вывода.

source: B<I/O>
ru: B<Ввод/вывод>

source: Number of filesystem inputs by the process.
ru: Количество чтений файловой системы процессом.

source: Number of filesystem outputs by the process.
ru: Количество записи в файловую систему процессом.

source: Number of socket messages received by the process.
ru: Количество сообщений, принятых процессом из сокета.

source: Number of socket messages sent by the process.
ru: Количество сообщений, посланных процессом в сокет.

source: Number of signals delivered to the process.
ru: Количество сигналов, доставленных процессу.

source: (Not in B<tcsh>(1).) Name and command-line arguments of the command being timed.
ru: (Нет в B<tcsh>(1).) Имя и аргументы командной строки запущенной команды.

source: (Not in B<tcsh>(1).) Exit status of the command.
ru: (Нет в B<tcsh>(1).) Код результата выполненной команды.

source: GNU options
ru: Параметры GNU

source: B<-f >I<format>B<, --format=>I<format>
ru: B<-f >I<формат>B<, --format=>I<формат>

source: Specify output format, possibly overriding the format specified in the environment variable TIME.
ru: Задать формат вывода, возможно перекрывая формат, указанный в переменной окружения TIME.

source: Use the portable output format.
ru: Использовать переносимый формат вывода.

source: B<-o >I<file>B<, --output=>I<file>
ru: B<-o >I<файл>B<, --output=>I<файл>

source: Do not send the results to I<stderr>, but overwrite the specified file.
ru: Не посылать вывод в I<stderr>, а перезаписать им указанный файл.

source: (Used together with -o.) Do not overwrite but append.
ru: (Используется совместно с -o.) Не перезаписывать файл, а дополнять его.

source: Give very verbose output about all the program knows about.
ru: Выводить все возможные подробности о работе программы.

source: Don't report abnormal program termination (where I<command> is terminated by a signal) or nonzero exit status.
ru: Не сообщать о ненормальном завершении программы (если I<команда> завершается по сигналу) или ненулевом возвращаемом коде.

source: GNU standard options
ru: Стандартные параметры GNU

source: Print a usage message on standard output and exit successfully.
ru: Выдать справку по работе на стандартный вывод и успешно завершить работу.

source: Print version information on standard output, then exit successfully.
ru: Выдать информацию о версии на стандартный вывод и успешно завершить работу.

source: Terminate option list.
ru: Служит для обозначения конца списка параметров.

source: BUGS
ru: ДЕФЕКТЫ

source: Not all resources are measured by all versions of UNIX, so some of the values might be reported as zero. The present selection was mostly inspired by the data provided by 4.2 or 4.3BSD.
ru: Не все ресурсы могут быть измерены во всех версиях UNIX, поэтому некоторые значения могут быть показаны как нулевые. Отбор измеряемых ресурсов, в основном, проводился по данным, предоставляемым 4.2 или 4.3BSD.

source: GNU time version 1.7 is not yet localized. Thus, it does not implement the POSIX requirements.
ru: Программа GNU time версии 1.7 пока не локализована. Таким образом, она не удовлетворяет требованиям POSIX.

source: The environment variable B<TIME> was badly chosen. It is not unusual for systems like B<autoconf>(1) or B<make>(1) to use environment variables with the name of a utility to override the utility to be used. Uses like MORE or TIME for options to programs (instead of program pathnames) tend to lead to difficulties.
ru: Имя для переменной окружения B<TIME> выбрано неосмотрительно. Есть вполне распространённая практика для систем, например B<autoconf>(1) или B<make>(1), использовать переменные окружения с именами утилит для замены используемой утилиты. Использование MORE или TIME в качестве параметров программ (вместо путей к программам) рано или поздно приведёт к проблемам.

source: It seems unfortunate that I<-o> overwrites instead of appends. (That is, the I<-a> option should be the default.)
ru: Кажется неудачным, что I<-o> выполняется перезапись вместо добавления. (То есть параметр I<-a> должен бы использоваться по умолчанию.)

source: Mail suggestions and bug reports for GNU B<time> to I<bug-time@gnu.org>. Please include the version of B<time>, which you can get by running
ru: Советы и сообщения об ошибках по GNU B<time> направляйте на I<bug-time@gnu.org>. Указывайте версию B<time>, которую можно узнать, запустив

source: and the operating system and C compiler you used.
ru: а также операционную систему и компилятор C, который вы использовали.

source: termio - System V terminal driver interface
ru: termio - интерфейс драйвера терминала System V

source: B<termio> is the name of the old System V terminal driver interface. This interface defined a I<termio> structure used to store terminal settings, and a range of B<ioctl>(2) operations to get and set terminal attributes.
ru: B<termio> — название старого интерфейса драйвера терминала System V. В этом интерфейсе определена структура I<termio>, которая используется для хранения настроек терминала, и набор операций B<ioctl>(2) для выборки и изменения атрибутов терминала.

source: The B<termio> interface is now obsolete: POSIX.1-1990 standardized a modified version of this interface, under the name B<termios>. The POSIX.1 data structure differs slightly from the System V version, and POSIX.1 defined a suite of functions to replace the various B<ioctl>(2) operations that existed in System V. (This was done because B<ioctl>(2) was unstandardized, and its variadic third argument does not allow argument type checking.)
ru: В настоящее время интерфейс B<termio> устарел: в POSIX.1-1990 стандартизована изменённая версия данного интерфейса под именем B<termios>. В POSIX.1 структура данных немного отличается от версии System V, а также в POSIX.1 определён комплект функций, заменяющих различные операции B<ioctl>(2), которые существовали в System V (это сделано из-за нестандаризованности B<ioctl>(2) и непостоянной длины (variadic) третьего аргумента, что не позволяет проверить тип аргумента).

source: If you're looking for a page called "termio", then you can probably find most of the information that you seek in either B<termios>(3) or B<ioctl_tty>(2).
ru: Если вы ищете данные на странице с именем «termio», то большинство информации найдёте на странице B<termios>(3) или B<ioctl_tty>(2).

source: thread-keyring - per-thread keyring
ru: thread-keyring - связка ключей нити

source: The thread keyring is a keyring used to anchor keys on behalf of a process. It is created only when a thread requests it. The thread keyring has the name (description) I<_tid>.
ru: Связка ключей нити — это связка ключей, используемая для привязки ключей нити. Она создаётся только по запросу нити. Связка ключей нити имеет имя (описание) I<_tid>.

source: A special serial number value, B<KEY_SPEC_THREAD_KEYRING>, is defined that can be used in lieu of the actual serial number of the calling thread's thread keyring.
ru: Существует специальный серийный номер, B<KEY_SPEC_THREAD_KEYRING>, который можно указывать вместо реального серийного номера связки ключей сеанса вызывающей нити.

source: From the B<keyctl>(1) utility, 'B<@t>' can be used instead of a numeric key ID in much the same way, but as B<keyctl>(1) is a program run after forking, this is of no utility.
ru: В утилите B<keyctl>(1) подобным образом можно использовать «B<@t>» вместо числового ID ключа, но так как B<keyctl>(1) выполняется после разветвления, это не используется.

source: Thread keyrings are not inherited across B<clone>(2) and B<fork>(2) and are cleared by B<execve>(2). A thread keyring is destroyed when the thread that refers to it terminates.
ru: Связка ключей нити не наследуется при B<clone>(2) и B<fork>(2) и очищается при B<execve>(2). Связка ключей нити уничтожается по завершению ссылающейся на неё нити.

source: Initially, a thread does not have a thread keyring. If a thread doesn't have a thread keyring when it is accessed, then it will be created if it is to be modified; otherwise the operation fails with the error B<ENOKEY>.
ru: Первоначально, нить не имеет связки ключей нити. Если нить не имеет связки ключей нити при обращении, то связка создаётся, если выполняется её изменение; в противном случает операция завершается ошибкой B<ENOKEY>.

source: tcp - TCP protocol
ru: tcp - протокол TCP

source: This is an implementation of the TCP protocol defined in RFC\ 793, RFC\ 1122 and RFC\ 2001 with the NewReno and SACK extensions. It provides a reliable, stream-oriented, full-duplex connection between two sockets on top of B<ip>(7), for both v4 and v6 versions. TCP guarantees that the data arrives in order and retransmits lost packets. It generates and checks a per-packet checksum to catch transmission errors. TCP does not preserve record boundaries.
ru: Эта реализация протокола TCP, описанного в RFC\ 793, RFC\ 1122 и RFC\ 2001 с расширениями NewReno и SACK. Данный протокол предоставляет пользователю надёжное полнодуплексное соединение двух сокетов для потоковой передачи поверх B<ip>(7) версий v4 и v6. TCP гарантирует доставку данных в правильном порядке и повторно передаёт потерявшиеся пакеты. Для выявления ошибок передачи протоколом генерируются и проверяются контрольные суммы пакетов. TCP не сохраняет границы записей.
