Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: static void handler(int sig, siginfo_t *si, void *uc) { /* Note: calling printf() from a signal handler is not safe (and should not be done in production programs), since printf() is not async-signal-safe; see signal-safety(7). Nevertheless, we use printf() here as a simple way of showing that the handler was called. */
ru: static void handler(int sig, siginfo_t *si, void *uc) { /* Замечание: вызов printf() из обработчика сигнала небезопасен (и не должен выполняться в готовых программах), так как printf() не async-signal-safe; смотрите signal-safety(7). Тем не менее, здесь мы используем printf(), так как это простой способ показать когда вызывается обработчик. */

source: printf("Caught signal %d\en", sig); print_siginfo(si); signal(sig, SIG_IGN); }
ru: printf("Пойман сигнал %d\en", sig); print_siginfo(si); signal(sig, SIG_IGN); }

source: if (argc != 3) { fprintf(stderr, "Usage: %s E<lt>sleep-secsE<gt> E<lt>freq-nanosecsE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 3) { fprintf(stderr, "Использование: %s E<lt>secsE<gt> E<lt>nsecsE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Establish handler for timer signal */
ru: /* Устанавливаем обработчик для сигнала таймера */

source: printf("Establishing handler for signal %d\en", SIG); sa.sa_flags = SA_SIGINFO; sa.sa_sigaction = handler; sigemptyset(&sa.sa_mask); if (sigaction(SIG, &sa, NULL) == -1) errExit("sigaction");
ru: printf("Устанавливается обработчик сигнала %d\en", SIG); sa.sa_flags = SA_SIGINFO; sa.sa_sigaction = handler; sigemptyset(&sa.sa_mask); if (sigaction(SIG, &sa, NULL) == -1) errExit("sigaction");

source: /* Block timer signal temporarily */
ru: /* Временно блокируем сигнал таймера */

source: printf("Blocking signal %d\en", SIG); sigemptyset(&mask); sigaddset(&mask, SIG); if (sigprocmask(SIG_SETMASK, &mask, NULL) == -1) errExit("sigprocmask");
ru: printf("Блокируется сигнал %d\en", SIG); sigemptyset(&mask); sigaddset(&mask, SIG); if (sigprocmask(SIG_SETMASK, &mask, NULL) == -1) errExit("sigprocmask");

source: /* Create the timer */
ru: /* Создаём таймер */

source: printf("timer ID is 0x%lx\en", (long) timerid);
ru: printf("ID таймера — 0x%lx\en", (long) timerid);

source: /* Start the timer */
ru: /* Запускаем таймер */

source: /* Sleep for a while; meanwhile, the timer may expire multiple times */
ru: /* Ненадолго засыпаем; за это время, таймер может сработать несколько раз */

source: printf("Sleeping for %d seconds\en", atoi(argv[1])); sleep(atoi(argv[1]));
ru: printf("Спим %d секунду\en", atoi(argv[1])); sleep(atoi(argv[1]));

source: /* Unlock the timer signal, so that timer notification can be delivered */
ru: /* Разблокируем сигнал таймера, чтобы доставлялись уведомления таймера */

source: printf("Unblocking signal %d\en", SIG); if (sigprocmask(SIG_UNBLOCK, &mask, NULL) == -1) errExit("sigprocmask");
ru: printf("Разблокируется сигнал %d\en", SIG); if (sigprocmask(SIG_UNBLOCK, &mask, NULL) == -1) errExit("sigprocmask");

source: timer_settime, timer_gettime - arm/disarm and fetch state of POSIX per-process timer
ru: timer_settime, timer_gettime - запускает/останавливает и возвращает состояние таймера POSIX некоторого процесса

source: B<timer_settime>() arms or disarms the timer identified by I<timerid>. The I<new_value> argument is pointer to an I<itimerspec> structure that specifies the new initial value and the new interval for the timer. The I<itimerspec> structure is defined as follows:
ru: Вызов B<timer_settime>() запускает или останавливает таймер, указанный в I<timerid>. Аргумент I<new_value> — это указатель на структуру I<itimerspec>, которая определяет новое начальное значение и новый интервал таймера. Структура I<itimerspec> определена следующим образом:

source: struct timespec { time_t tv_sec; /* Seconds */ long tv_nsec; /* Nanoseconds */ };
ru: struct timespec { time_t tv_sec; /* секунды */ long tv_nsec; /* наносекунды */ };

source: struct itimerspec { struct timespec it_interval; /* Timer interval */ struct timespec it_value; /* Initial expiration */ };
ru: struct itimerspec { struct timespec it_interval; /* интервал таймера */ struct timespec it_value; /* первое срабатывание */ };

source: Each of the substructures of the I<itimerspec> structure is a I<timespec> structure that allows a time value to be specified in seconds and nanoseconds. These time values are measured according to the clock that was specified when the timer was created by B<timer_create>(2).
ru: Каждая подструктура структуры I<itimerspec> представляет собой структуру I<timespec>, которая позволяет задавать значение времени в секундах и наносекундах. Эти значения времени отсчитываются по часам, которые были указаны при создании таймера с помощью B<timer_create>(2).

source: If I<new_value-E<gt>it_value> specifies a nonzero value (i.e., either subfield is nonzero), then B<timer_settime>() arms (starts) the timer, setting it to initially expire at the given time. (If the timer was already armed, then the previous settings are overwritten.) If I<new_value-E<gt>it_value> specifies a zero value (i.e., both subfields are zero), then the timer is disarmed.
ru: Если I<new_value-E<gt>it_value> равно ненулевому значению (т. е., любое из подполей не равно нулю), то B<timer_settime>() запускает таймер, устанавливая ему первое время срабатывания (если таймер уже запущен, то предыдущие параметры перезаписываются). Если I<new_value-E<gt>it_value> равно нулю (т. е., оба подполя равны нулю), то таймер выключается.

source: The I<new_value-E<gt>it_interval> field specifies the period of the timer, in seconds and nanoseconds. If this field is nonzero, then each time that an armed timer expires, the timer is reloaded from the value specified in I<new_value-E<gt>it_interval>. If I<new_value-E<gt>it_interval> specifies a zero value, then the timer expires just once, at the time specified by I<it_value>.
ru: В поле I<new_value-E<gt>it_interval> указывается период таймера в секундах и наносекундах. Если это поле равно нулю, то каждый раз, когда таймер срабатывает, он перезапускается со значением, указанным в I<new_value-E<gt>it_interval>. Если I<new_value-E<gt>it_interval> равно нулю, то таймер срабатывает только один раз, согласно заданному в I<it_value> времени.

source: By default, the initial expiration time specified in I<new_value-E<gt>it_value> is interpreted relative to the current time on the timer's clock at the time of the call. This can be modified by specifying B<TIMER_ABSTIME> in I<flags>, in which case I<new_value-E<gt>it_value> is interpreted as an absolute value as measured on the timer's clock; that is, the timer will expire when the clock value reaches the value specified by I<new_value-E<gt>it_value>. If the specified absolute time has already passed, then the timer expires immediately, and the overrun count (see B<timer_getoverrun>(2)) will be set correctly.
ru: По умолчанию, начальное время срабатывания, указанное в I<new_value-E<gt>it_value>, считается относительно текущего времени на часах таймера на момент вызова. Это можно изменить, указав B<TIMER_ABSTIME> в I<flags>; в этом случае I<new_value-E<gt>it_value> рассматривается как абсолютное значение по часам таймера; то есть таймер сработает, когда значение часов достигнет значения, указанного в I<new_value-E<gt>it_value>. Если указанное абсолютное время уже прошло, то таймер срабатывает немедленно и счётчик переполнения изменяется соответствующим образом (смотрите B<timer_getoverrun>(2)).

source: If the value of the B<CLOCK_REALTIME> clock is adjusted while an absolute timer based on that clock is armed, then the expiration of the timer will be appropriately adjusted. Adjustments to the B<CLOCK_REALTIME> clock have no effect on relative timers based on that clock.
ru: Если значение часов B<CLOCK_REALTIME> корректируется (adjusted) и указано абсолютное значение у включённого таймера с этими часами, то срабатывание таймера будет скорректировано соответствующим образом. Корректировка часов B<CLOCK_REALTIME> не влияет на относительные таймеры, использующие эти часы.

source: If I<old_value> is not NULL, then it points to a buffer that is used to return the previous interval of the timer (in I<old_value-E<gt>it_interval>) and the amount of time until the timer would previously have next expired (in I<old_value-E<gt>it_value>).
ru: Если значение I<old_value> не равно NULL, то оно указывает на буфер, который используется для возврата предыдущего интервала таймера (в I<old_value-E<gt>it_interval>) и количества времени, которое осталось таймеру до срабатывания (в I<old_value-E<gt>it_value>).

source: B<timer_gettime>() returns the time until next expiration, and the interval, for the timer specified by I<timerid>, in the buffer pointed to by I<curr_value>. The time remaining until the next timer expiration is returned in I<curr_value-E<gt>it_value>; this is always a relative value, regardless of whether the B<TIMER_ABSTIME> flag was used when arming the timer. If the value returned in I<curr_value-E<gt>it_value> is zero, then the timer is currently disarmed. The timer interval is returned in I<curr_value-E<gt>it_interval>. If the value returned in I<curr_value-E<gt>it_interval> is zero, then this is a "one-shot" timer.
ru: Вызов B<timer_gettime>() возвращает время до следующего срабатывания таймера I<timerid> и интервал в буфер I<curr_value>. Оставшееся время до следующего срабатывания возвращается в I<curr_value-E<gt>it_value>; это всегда относительное значение, независимо от того, указывался ли флаг B<TIMER_ABSTIME> при включении таймера. Если значение I<curr_value-E<gt>it_value> равно нулю, то таймер в данный момент выключен. Интервал таймера возвращается в I<curr_value-E<gt>it_interval>. Если значение I<curr_value-E<gt>it_interval> равно нулю, то это «одноразовый» таймер.

source: On success, B<timer_settime>() and B<timer_gettime>() return 0. On error, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<timer_settime>() и B<timer_gettime>() возвращается 0. При ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: These functions may fail with the following errors:
ru: Эти функции могут завершиться со следующими ошибками:

source: I<new_value>, I<old_value>, or I<curr_value> is not a valid pointer.
ru: Некорректный указатель I<new_value>, I<old_value> или I<curr_value>.

source: I<timerid> is invalid.
ru: Неверное значение I<timerid>.

source: B<timer_settime>() may fail with the following errors:
ru: B<timer_settime>() может завершиться со следующими ошибками:

source: I<new_value.it_value> is negative; or I<new_value.it_value.tv_nsec> is negative or greater than 999,999,999.
ru: Значение I<new_value.it_value> отрицательно; или I<new_value.it_value.tv_nsec> отрицательно или больше 999999999.

source: These system calls are available since Linux 2.6.
ru: Данные системные вызовы появились в Linux 2.6.

source: tee - duplicating pipe content
ru: tee - повторяет содержимое канала

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>
ru: B<#define _GNU_SOURCE> /* см. feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>

source: B<tee>() duplicates up to I<len> bytes of data from the pipe referred to by the file descriptor I<fd_in> to the pipe referred to by the file descriptor I<fd_out>. It does not consume the data that is duplicated from I<fd_in>; therefore, that data can be copied by a subsequent B<splice>(2).
ru: Вызов B<tee>() повторяет до I<len> байт данных из канала, на который указывает файловый дескриптор I<fd_in> в канал, на который указывает файловый дескриптор I<fd_out>. Он не потребляет данные, копируемые из I<fd_in>, поэтому эти данные можно копировать последующим вызовом B<splice>(2).

source: I<flags> is a bit mask that is composed by ORing together zero or more of the following values:
ru: Аргумент I<flags> представляет собой битовую маску, которая составляется логическим сложением (OR) следующих значений:

source: Currently has no effect for B<tee>(); see B<splice>(2).
ru: В данный момент никак не влияет при указании в B<tee>(); см. B<splice>(2).

source: Do not block on I/O; see B<splice>(2) for further details.
ru: Не блокировать ввод-вывод; подробности в B<splice>(2).

source: Currently has no effect for B<tee>(), but may be implemented in the future; see B<splice>(2).
ru: В данный момент никак не влияет при указании в B<tee>(), но это может измениться; см. B<splice>(2).

source: Unused for B<tee>(); see B<vmsplice>(2).
ru: Не используется для B<tee>(); см. B<vmsplice>(2).

source: Upon successful completion, B<tee>() returns the number of bytes that were duplicated between the input and output. A return value of 0 means that there was no data to transfer, and it would not make sense to block, because there are no writers connected to the write end of the pipe referred to by I<fd_in>.
ru: При успешном выполнении, B<tee>() возвращает количество байт, которые были повторены из ввода в выводе. Возвращаемое значение 0 означает, что нет данных для передачи, и блокировка не имеет смысла, так как нет процессов-писателей, подключённых к каналу для записи, на который указывает I<fd_in>.

source: On error, B<tee>() returns -1 and I<errno> is set to indicate the error.
ru: В случае ошибки B<tee>() возвращает -1, а I<errno> устанавливается в соответствующее значение.

source: B<SPLICE_F_NONBLOCK> was specified in I<flags>, and the operation would block.
ru: В указан I<flags> B<SPLICE_F_NONBLOCK>, и операция вызвала бы блокировку.

source: I<fd_in> or I<fd_out> does not refer to a pipe; or I<fd_in> and I<fd_out> refer to the same pipe.
ru: Значение I<fd_in> или I<fd_out> не указывает на канал; I<fd_in> и I<fd_out> указывают на один и тот же канал.

source: Out of memory.
ru: Не хватает памяти.

source: The B<tee>() system call first appeared in Linux 2.6.17; library support was added to glibc in version 2.5.
ru: Системный вызов B<tee>() впервые появился в Linux 2.6.17; поддержка в glibc добавлена в версии 2.5.

source: This system call is Linux-specific.
ru: Данный вызов есть только в Linux.

source: Conceptually, B<tee>() copies the data between the two pipes. In reality no real data copying takes place though: under the covers, B<tee>() assigns data to the output by merely grabbing a reference to the input.
ru: Концептуально, B<tee>() копирует данные между двумя каналами. В реальности, данные не копируются на самом деле: внутри, B<tee>() назначает данные на вывод просто схватывая ссылку из ввода.

source: The example below implements a basic B<tee>(1) program using the B<tee>() system call. Here is an example of its use:
ru: В примере далее показана простая реализация программы B<tee>(1) с помощью системного вызова B<tee>(). Пример использования:

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>fileE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s E<lt>файлE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: do { /* * tee stdin to stdout. */ len = tee(STDIN_FILENO, STDOUT_FILENO, INT_MAX, SPLICE_F_NONBLOCK);
ru: do { /* * перекладывать из stdin в stdout. */ len = tee(STDIN_FILENO, STDOUT_FILENO, INT_MAX, SPLICE_F_NONBLOCK);

source: /* * Consume stdin by splicing it to a file. */ while (len E<gt> 0) { slen = splice(STDIN_FILENO, NULL, fd, NULL, len, SPLICE_F_MOVE); if (slen E<lt> 0) { perror("splice"); break; } len -= slen; } } while (1);
ru: /* * Поглотить stdin, объединяя данные в файле. */ while (len E<gt> 0) { slen = splice(STDIN_FILENO, NULL, fd, NULL, len, SPLICE_F_MOVE); if (slen E<lt> 0) { perror("splice"); break; } len -= slen; } } while (1);

source: time - get time in seconds
ru: time - получить время в секундах

source: B<time>() returns the time as the number of seconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
ru: B<time>() возвращает количество секунд, которое прошло с начала эпохи, 1970-01-01 00:00:00 +0000 (UTC).

source: If I<tloc> is non-NULL, the return value is also stored in the memory pointed to by I<tloc>.
ru: Если I<tloc> не равно NULL, то возвращаемое значение также сохраняется в область памяти, на которую указывает I<tloc>.

source: On success, the value of time in seconds since the Epoch is returned. On error, I<((time_t)\ -1)> is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается время в секундах, прошедшее с начала эпохи. При ошибке возвращается I<((time_t)\ -1)>, а I<errno> устанавливается должным образом.

source: I<tloc> points outside your accessible address space (but see BUGS).
ru: I<tloc> указывает за пределы доступного адресного пространства (однако см. ОШИБКИ).

source: On systems where the C library B<time>() wrapper function invokes an implementation provided by the B<vdso>(7) (so that there is no trap into the kernel), an invalid address may instead trigger a B<SIGSEGV> signal.
ru: В системах, где обёрточная функция B<time>() библиотеки C вызывает реализацию, предоставляемую B<vdso>(7) (то есть нет ловушки в ядре), из-за некорректного адреса может генерироваться сигнал B<SIGSEGV>.

source: SVr4, 4.3BSD, C89, C99, POSIX.1-2001. POSIX does not specify any error conditions.
ru: SVr4, 4.3BSD, C89, C99, POSIX.1-2001. В POSIX не определены условия возникновения ошибок.

source: POSIX.1 defines I<seconds since the Epoch> using a formula that approximates the number of seconds between a specified time and the Epoch. This formula takes account of the facts that all years that are evenly divisible by 4 are leap years, but years that are evenly divisible by 100 are not leap years unless they are also evenly divisible by 400, in which case they are leap years. This value is not the same as the actual number of seconds between the time and the Epoch, because of leap seconds and because system clocks are not required to be synchronized to a standard reference. The intention is that the interpretation of seconds since the Epoch values be consistent; see POSIX.1-2008 Rationale A.4.15 for further rationale.
ru: В POSIX.1 для определения I<секунд, прошедших с начала эпохи> используется формула для приблизительного подсчёта количества секунд между указываемым временем и началом эпохи. Эта формула учитывает тот факт, что все годы, номер которых делится на 4, считаются високосными, но годы, которые делятся на 100 не високосные, если они также не делятся на 400 (которые нужно считать високосными). Это значение не является указанием на точное количество секунд между заданным временем и началом эпохи вследствие игнорирования високосных секунд и по причине того, что время в часах необязательно синхронизировано со временем стандартного источника. Считается, что это значение соответствует настоящему количеству секунд, прошедшему с начала эпохи. Дополнительную информацию можно найти в POSIX.1-2008 Rationale A.4.15.

source: On Linux, a call to B<time>() with I<tloc> specified as NULL cannot fail with the error B<EOVERFLOW>, even on ABIs where I<time_t> is a signed 32-bit integer and the clock ticks past the time 2**31 (2038-01-19 03:14:08 UTC, ignoring leap seconds). (POSIX.1 permits, but does not require, the B<EOVERFLOW> error in the case where the seconds since the Epoch will not fit in I<time_t>.) Instead, the behavior on Linux is undefined when the system time is out of the I<time_t> range. Applications intended to run after 2038 should use ABIs with I<time_t> wider than 32 bits.
ru: В Linux, вызов B<time>() со значением I<tloc> равным NULL, не может завершиться ошибкой B<EOVERFLOW>, даже с ABI, у которого I<time_t> — знаковое 32-битное целое и количество тактов часов выходит за пределами времени 2**31 (2038-01-19 03:14:08 UTC, високосные секунды игнорируются) (в POSIX.1 допускается, но не требуется возврат ошибки B<EOVERFLOW> в случае, когда количество секунд с начала эпохи не влезает в I<time_t>). Вместо этого, поведение в Linux является не определённым, когда системное время выходит за границы диапазона I<time_t>. Приложения, которые должны работать после 2038 года, должны использовать ABI, в котором тип I<time_t> больше 32 бит.

source: Error returns from this system call are indistinguishable from successful reports that the time is a few seconds I<before> the Epoch, so the C library wrapper function never sets I<errno> as a result of this call.
ru: Ошибка, возвращаемая из этого системного вызова неотличима от успешного выполнения в случае, когда момент времени — за несколько секунд I<до> эпохи, поэтому обёрточная функция библиотеки C никогда не изменяет I<errno> при возврате.

source: The I<tloc> argument is obsolescent and should always be NULL in new code. When I<tloc> is NULL, the call cannot fail.
ru: Аргумент I<tloc> устарел и в новом коде всегда должен быть равен NULL. Если I<tloc> равно NULL, то вызов не может завершиться ошибкой.

source: On some architectures, an implementation of B<time>() is provided in the B<vdso>(7).
ru: На некоторых архитектурах реализация B<time>() находится в B<vdso>(7).

source: times - get process times
ru: times - возвращает времена процесса

source: B<times>() stores the current process times in the I<struct tms> that I<buf> points to. The I<struct tms> is as defined in I<E<lt>sys/times.hE<gt>>:
ru: Вызов B<times>() сохраняет текущие времена процесса в I<struct tms>, на которую указывает I<buf>. Определение I<struct tms> содержится в I<E<lt>sys/times.hE<gt>>:

source: struct tms { clock_t tms_utime; /* user time */ clock_t tms_stime; /* system time */ clock_t tms_cutime; /* user time of children */ clock_t tms_cstime; /* system time of children */ };
ru: struct tms { clock_t tms_utime; /* пользовательское время */ clock_t tms_stime; /* системное время */ clock_t tms_cutime; /* пользовательское время потомков */ clock_t tms_cstime; /* системное время потомков */ };

source: The I<tms_utime> field contains the CPU time spent executing instructions of the calling process. The I<tms_stime> field contains the CPU time spent executing inside the kernel while performing tasks on behalf of the calling process.
ru: В поле I<tms_utime> содержится время ЦП, потраченное для выполнения инструкций вызвавшего процесса. В поле I<tms_stime> содержится время ЦП, потраченное в ядре для выполнения задач вызвавшего процесса.

source: The I<tms_cutime> field contains the sum of the I<tms_utime> and I<tms_cutime> values for all waited-for terminated children. The I<tms_cstime> field contains the sum of the I<tms_stime> and I<tms_cstime> values for all waited-for terminated children.
ru: В поле I<tms_cutime> содержится сумма значений I<tms_utime> и I<tms_cutime> всех ожидающих завершения потомков. В поле I<tms_cstime> содержится сумма значений I<tms_stime> и I<tms_cstime> всех ожидающих завершения потомков.

source: Times for terminated children (and their descendants) are added in at the moment B<wait>(2) or B<waitpid>(2) returns their process ID. In particular, times of grandchildren that the children did not wait for are never seen.
ru: Времена завершившихся потомков (и их потомков) добавляются в момент когда B<wait>(2) или B<waitpid>(2) возвращают их ID процесса. При этом, времена внуков, которых потомки не ждали, никогда не добавляются.

source: All times reported are in clock ticks.
ru: Все времена считаются в тиках часов.

source: B<times>() returns the number of clock ticks that have elapsed since an arbitrary point in the past. The return value may overflow the possible range of type I<clock_t>. On error, I<(clock_t)\ -1> is returned, and I<errno> is set appropriately.
ru: Вызов B<times>() возвращает количество тиков часов, которое прошло с момента произвольной точки в прошлом. Возвращаемое значение может переполнить максимальную величину типа I<clock_t>. При ошибке возвращается I<(clock_t)\ -1>, а в I<errno> записывается код ошибки.
