Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_t/*.po
Languages: ru

source: Increasing user timeouts allows a TCP connection to survive extended periods without end-to-end connectivity. Decreasing user timeouts allows applications to "fail fast", if so desired. Otherwise, failure may take up to 20 minutes with the current system defaults in a normal WAN environment.
ru: Увеличение пользовательского времени задержки позволяет соединению TCP продолжать существовать дополнительные периоды при отсутствии связи. Уменьшение пользовательского времени задержки позволяет приложениям «быстро упасть», если это нужно. В противном случае ошибка может быть отложена до 20 минут при текущих системных значениях по умолчанию в обычной среде WAN.

source: This option can be set during any state of a TCP connection, but is effective only during the synchronized states of a connection (ESTABLISHED, FIN-WAIT-1, FIN-WAIT-2, CLOSE-WAIT, CLOSING, and LAST-ACK). Moreover, when used with the TCP keepalive (B<SO_KEEPALIVE>) option, B<TCP_USER_TIMEOUT> will override keepalive to determine when to close a connection due to keepalive failure.
ru: Этот параметр может быть задан при любом состоянии соединения TCP, но будет задействован только при синхронизации состояний соединения (ESTABLISHED, FIN-WAIT-1, FIN-WAIT-2, CLOSE-WAIT, CLOSING и LAST-ACK). Кроме этого, когда используется параметр поддержания TCP (B<SO_KEEPALIVE>), B<TCP_USER_TIMEOUT> отменит действие поддержания для определения нужно ли закрывать соединение из-за ошибки поддержания.

source: The option has no effect on when TCP retransmits a packet, nor when a keepalive probe is sent.
ru: Этот параметр не действует, если TCP перепосылает пакет, или посылается проба поддержания.

source: This option, like many others, will be inherited by the socket returned by B<accept>(2), if it was set on the listening socket.
ru: Этот параметр, как и многие другие, наследуется сокетом, возвращаемым B<accept>(2), если он установлен у прослушивающего сокета.

source: Further details on the user timeout feature can be found in RFC\ 793 and RFC\ 5482 ("TCP User Timeout Option").
ru: Подробней о свойстве пользовательского времени задержки смотрите RFC\ 793 и RFC\ 5482 («TCP User Timeout Option»).

source: B<TCP_WINDOW_CLAMP> (since Linux 2.4)
ru: B<TCP_WINDOW_CLAMP> (начиная с Linux 2.4)

source: Bound the size of the advertised window to this value. The kernel imposes a minimum size of SOCK_MIN_RCVBUF/2. This option should not be used in code intended to be portable.
ru: Ограничивает размер предлагаемого окна указанным значением. Ядро считает минимальный размер как SOCK_MIN_RCVBUF/2. Данный параметр не должен использоваться, если требуется переносимость кода.

source: Sockets API
ru: Программный интерфейс сокетов

source: TCP provides limited support for out-of-band data, in the form of (a single byte of) urgent data. In Linux this means if the other end sends newer out-of-band data the older urgent data is inserted as normal data into the stream (even when B<SO_OOBINLINE> is not set). This differs from BSD-based stacks.
ru: TCP предоставляет ограниченную поддержку внеполосных данных в виде (одного байта) срочных данных. В Linux это означает, что если другая сторона посылает новые внеполосные данные, то старые срочные данные вставляются как обычные данные в поток (даже когда B<SO_OOBINLINE> не установлен). В этом отличие от реализации стека в BSD.

source: Linux uses the BSD compatible interpretation of the urgent pointer field by default. This violates RFC\ 1122, but is required for interoperability with other stacks. It can be changed via I</proc/sys/net/ipv4/tcp_stdurg>.
ru: По умолчанию в Linux используется совместимая с BSD интерпретация поля срочного указателя. Это нарушает RFC\ 1122, но требуется для правильного взаимодействия с другими стеками. Это можно изменить через I</proc/sys/net/ipv4/tcp_stdurg>.

source: It is possible to peek at out-of-band data using the B<recv>(2) B<MSG_PEEK> flag.
ru: Возможно получить внеполосные данные с помощью I<recv>(2) и флага B<MSG_PEEK>.

source: Since version 2.4, Linux supports the use of B<MSG_TRUNC> in the I<flags> argument of B<recv>(2) (and B<recvmsg>(2)). This flag causes the received bytes of data to be discarded, rather than passed back in a caller-supplied buffer. Since Linux 2.4.4, B<MSG_TRUNC> also has this effect when used in conjunction with B<MSG_OOB> to receive out-of-band data.
ru: Начиная с версии 2.4, Linux поддерживает использование B<MSG_TRUNC> в аргументе I<flags> вызова B<recv>(2) (и B<recvmsg>(2)). Этот флаг принуждает отбросить принятые байты данных, а не передавать их обратно в буфер, предоставленный вызывающим. Начиная с Linux 2.4.4, B<MSG_TRUNC> также обладает этим свойством, если используется вместе с B<MSG_OOB> для приёма внеполосных данных.

source: Ioctls
ru: Системные вызовы (ioctl)

source: The following B<ioctl>(2) calls return information in I<value>. The correct syntax is:
ru: Следующие вызовы B<ioctl>(2) возвращают информацию в аргументе I<value>. Синтаксис:

source: I<ioctl_type> is one of the following:
ru: Значением I<ioctl_type> может быть одно из:

source: Returns the amount of queued unread data in the receive buffer. The socket must not be in LISTEN state, otherwise an error (B<EINVAL>) is returned. B<SIOCINQ> is defined in I<E<lt>linux/sockios.hE<gt>>. Alternatively, you can use the synonymous B<FIONREAD>, defined in I<E<lt>sys/ioctl.hE<gt>>.
ru: Возвращает количество непрочитанных данных в очереди в приёмном буфере. Сокет не должен быть в состоянии LISTEN, иначе возвращается ошибка (B<EINVAL>). Значение B<SIOCINQ> определено в I<E<lt>linux/sockios.hE<gt>>. В качестве альтернативы вы можете использовать синоним B<FIONREAD>, определённый в I<E<lt>sys/ioctl.hE<gt>>.

source: Returns true (i.e., I<value> is nonzero) if the inbound data stream is at the urgent mark.
ru: Возвращает истинное значение (т.е., I<value> отличное от нуля), если входящие данные потока отмечены как срочные.

source: If the B<SO_OOBINLINE> socket option is set, and B<SIOCATMARK> returns true, then the next read from the socket will return the urgent data. If the B<SO_OOBINLINE> socket option is not set, and B<SIOCATMARK> returns true, then the next read from the socket will return the bytes following the urgent data (to actually read the urgent data requires the B<recv(MSG_OOB)> flag).
ru: Если установлен параметр сокета B<SO_OOBINLINE> и B<SIOCATMARK> возвращает истинное значение, то при следующем чтении из сокета будут получены срочные данные. Если параметр сокета B<SO_OOBINLINE> не установлен и B<SIOCATMARK> возвращает истинное значение, то при следующем чтении из сокета будут получены байты, размещённые после срочных (для действительного чтения срочных данных требуется флаг B<recv(MSG_OOB)>).

source: Note that a read never reads across the urgent mark. If an application is informed of the presence of urgent data via B<select>(2) (using the I<exceptfds> argument) or through delivery of a B<SIGURG> signal, then it can advance up to the mark using a loop which repeatedly tests B<SIOCATMARK> and performs a read (requesting any number of bytes) as long as B<SIOCATMARK> returns false.
ru: Заметим, что при чтении никогда не происходит чтения за меткой срочности. Если приложение проинформировано о наличии срочных данных с помощью B<select>(2) (с аргументом I<exceptfds>) или доставкой сигнала B<SIGURG>, то оно может переместить метку дальше с помощью цикла, в котором постоянно проверяется B<SIOCATMARK>, и выполнить чтение (запросив любое количество байт) пока B<SIOCATMARK> возвращает ложь.

source: Returns the amount of unsent data in the socket send queue. The socket must not be in LISTEN state, otherwise an error (B<EINVAL>) is returned. B<SIOCOUTQ> is defined in I<E<lt>linux/sockios.hE<gt>>. Alternatively, you can use the synonymous B<TIOCOUTQ>, defined in I<E<lt>sys/ioctl.hE<gt>>.
ru: Возвращает количество не отправленных данных в очереди отправки сокета. Сокет не должен быть в состоянии прослушивания LISTEN, иначе возвратится ошибка (B<EINVAL>). Значение B<SIOCOUTQ> определено в I<E<lt>linux/sockios.hE<gt>>. Или же вы можете использовать его аналог B<TIOCOUTQ>, определённый в I<E<lt>sys/ioctl.hE<gt>>.

source: Error handling
ru: Обработка ошибок

source: When a network error occurs, TCP tries to resend the packet. If it doesn't succeed after some time, either B<ETIMEDOUT> or the last received error on this connection is reported.
ru: При возникновении сетевой ошибки TCP пытается отправить пакет повторно. Если в течение некоторого времени этого сделать не удаётся, то возвращается либо B<ETIMEDOUT>, либо последняя ошибка, произошедшая в этом соединении.

source: Some applications require a quicker error notification. This can be enabled with the B<IPPROTO_IP> level B<IP_RECVERR> socket option. When this option is enabled, all incoming errors are immediately passed to the user program. Use this option with care \(em it makes TCP less tolerant to routing changes and other normal network conditions.
ru: Для некоторых приложений требуется более быстрое уведомление об ошибках. Это может быть выполнено на уровне B<IPPROTO_IP> с помощью параметра сокета B<IP_RECVERR>. Если этот параметр включён, то все входящие ошибки немедленно передаются программе пользователя. Используйте этот параметр осторожно: он приводит к тому, что TCP становится более чувствительным к сменам маршрутов и другим событиям, обычным для сети.

source: ERRORS
ru: ОШИБКИ

source: Passed socket address type in I<sin_family> was not B<AF_INET>.
ru: Переданный в I<sin_family> тип адреса сокета не равен B<AF_INET>.

source: The other end closed the socket unexpectedly or a read is executed on a shut down socket.
ru: Другая сторона неожиданно закрыла сокет, или была произведена попытка чтения в отключённом сокете.

source: The other end didn't acknowledge retransmitted data after some time.
ru: Другая сторона не подтвердила передачу данных через определённое время.

source: Any errors defined for B<ip>(7) or the generic socket layer may also be returned for TCP.
ru: Все ошибки, определённые для B<ip>(7) или общего слоя сокетов, также могут быть возвращены и для TCP.

source: VERSIONS
ru: ВЕРСИИ

source: Support for Explicit Congestion Notification, zero-copy B<sendfile>(2), reordering support and some SACK extensions (DSACK) were introduced in 2.4. Support for forward acknowledgement (FACK), TIME_WAIT recycling, and per-connection keepalive socket options were introduced in 2.3.
ru: В версии 2.4 были представлены: поддержка явного уведомления о перегрузке (Explicit Congestion Notification), нулевое копирование B<sendfile>(2), поддержка переупорядочения и некоторые расширения SACK (DSACK). Поддержка упреждающего подтверждения (FACK), повторение цикла TIME_WAIT и параметры сокетов проверочных пакетов (keepalive) для каждого соединения появились в версии 2.3.

source: Not all errors are documented.
ru: Не все ошибки описаны.

source: IPv6 is not described.
ru: Протокол IPv6 не описан.

source: RFC\ 793 for the TCP specification.
ru: В RFC\ 793 описан TCP.

source: RFC\ 1122 for the TCP requirements and a description of the Nagle algorithm.
ru: В RFC\ 1122 перечислены требования TCP и дано описание алгоритма Нагла (Nagle).

source: RFC\ 1323 for TCP timestamp and window scaling options.
ru: В RFC\ 1323 описаны метки времени TCP и параметры масштабирования окна.

source: RFC\ 1337 for a description of TIME_WAIT assassination hazards.
ru: В RFC\ 1337 описаны факторы риска TIME_WAIT.

source: RFC\ 3168 for a description of Explicit Congestion Notification.
ru: В RFC\ 3168 описано уведомление о явной перегрузке (Explicit Congestion Notification).

source: RFC\ 2581 for TCP congestion control algorithms.
ru: В RFC\ 2581 описаны алгоритмы управления перегрузками TCP.

source: RFC\ 2018 and RFC\ 2883 for SACK and extensions to SACK.
ru: В RFC\ 2018 и RFC\ 2883 описан SACK и расширения к SACK.

source: time - overview of time and timers
ru: time - обзор времени и таймеров

source: Real time and process time
ru: Реальное время и время процесса

source: I<Real time> is defined as time measured from some fixed point, either from a standard point in the past (see the description of the Epoch and calendar time below), or from some point (e.g., the start) in the life of a process (I<elapsed time>).
ru: I<Реальное время> (real time) — время, измеряемое от некоторой постоянной точки, или от стандартной точки в прошлом (смотрите описание эпохи (Epoch) и календарного времени далее), или от некоторой точки (например, с момента запуска) в жизни процесса (I<прошедшее время> (elapsed time)).

source: I<Process time> is defined as the amount of CPU time used by a process. This is sometimes divided into I<user> and I<system> components. User CPU time is the time spent executing code in user mode. System CPU time is the time spent by the kernel executing in system mode on behalf of the process (e.g., executing system calls). The B<time>(1) command can be used to determine the amount of CPU time consumed during the execution of a program. A program can determine the amount of CPU time it has consumed using B<times>(2), B<getrusage>(2), or B<clock>(3).
ru: I<Время процесса> (process time) — количество процессорного времени, использованного процессом. Иногда его делят на I<пользовательское> (user) и I<системное> (system). Пользовательское время ЦП — это время, потраченное на исполнение кода в режиме пользователя. Системное время ЦП — это время, потраченное ядром, выполняющемся в системном режиме, для процесса (например, на обработку системных вызовов). Команда B<time>(1) позволяет определить количество процессорного времени, затраченного при выполнении программы. Программа может определить количество потраченного процессорного времени с помощью B<times>(2), B<getrusage>(2) или B<clock>(3).

source: The hardware clock
ru: Аппаратные часы

source: Most computers have a (battery-powered) hardware clock which the kernel reads at boot time in order to initialize the software clock. For further details, see B<rtc>(4) and B<hwclock>(8).
ru: В большинстве компьютеров (оснащённых батареей) имеются аппаратные часы, которые ядро читает при запуске для инициализации программных часов. Подробности смотрите в B<rtc>(4) и B<hwclock>(8).

source: The software clock, HZ, and jiffies
ru: Программные часы, HZ и миги (jiffies)

source: The accuracy of various system calls that set timeouts, (e.g., B<select>(2), B<sigtimedwait>(2)) and measure CPU time (e.g., B<getrusage>(2)) is limited by the resolution of the I<software clock>, a clock maintained by the kernel which measures time in I<jiffies>. The size of a jiffy is determined by the value of the kernel constant I<HZ>.
ru: Точность различных системных вызовов, которые задают время ожидания (timeouts) (например, B<select>(2), B<sigtimedwait>(2)) и измеряют процессорное время (например, B<getrusage>(2)), ограничена точностью I<программных часов> (software clock) — часов, поддерживаемых ядром, у которых время измеряется в I<мигах> (jiffies). Размер мига определяется значением константы ядра I<HZ>.

source: The value of I<HZ> varies across kernel versions and hardware platforms. On i386 the situation is as follows: on kernels up to and including 2.4.x, HZ was 100, giving a jiffy value of 0.01 seconds; starting with 2.6.0, HZ was raised to 1000, giving a jiffy of 0.001 seconds. Since kernel 2.6.13, the HZ value is a kernel configuration parameter and can be 100, 250 (the default) or 1000, yielding a jiffies value of, respectively, 0.01, 0.004, or 0.001 seconds. Since kernel 2.6.20, a further frequency is available: 300, a number that divides evenly for the common video frame rates (PAL, 25 HZ; NTSC, 30 HZ).
ru: Значение I<HZ> различно в разных версиях ядра и аппаратных платформах. Для i386: в ядрах до версии 2.4.x включительно, HZ равно 100, то есть значение мига равно 0.01 секунды; начиная с версии 2.6.0 значение HZ увеличено до 1000 и миг равен 0.001 секунды. Начиная с ядра 2.6.13 значение HZ задаётся в параметре настройки ядра и может быть равно 100, 250 (по умолчанию) или 1000, что делает значение мига равным, соответственно, 0.01, 0.004 или 0.001 секунды. Начиная с ядра 2.6.20 добавлено ещё одна частота: 300, количество, которое делится нацело на распространённые частоты видеокадров (PAL — 25 HZ; NTSC — 30 HZ).

source: The B<times>(2) system call is a special case. It reports times with a granularity defined by the kernel constant I<USER_HZ>. User-space applications can determine the value of this constant using I<sysconf(_SC_CLK_TCK)>.
ru: Системный вызов B<times>(2) — это особый случай. Он выдаёт время с точностью, определяемой константой ядра I<USER_HZ>. Приложения пользовательского пространства могут определить значение этой константы с помощью I<sysconf(_SC_CLK_TCK)>.

source: High-resolution timers
ru: Таймеры высокой точности

source: Before Linux 2.6.21, the accuracy of timer and sleep system calls (see below) was also limited by the size of the jiffy.
ru: До Linux 2.6.21 точность системных вызовов таймера и сна (смотрите далее) была ограничена размером мига.

source: Since Linux 2.6.21, Linux supports high-resolution timers (HRTs), optionally configurable via B<CONFIG_HIGH_RES_TIMERS>. On a system that supports HRTs, the accuracy of sleep and timer system calls is no longer constrained by the jiffy, but instead can be as accurate as the hardware allows (microsecond accuracy is typical of modern hardware). You can determine whether high-resolution timers are supported by checking the resolution returned by a call to B<clock_getres>(2) or looking at the "resolution" entries in I</proc/timer_list>.
ru: Начиная с Linux 2.6.21, Linux поддерживает таймеры высокой точности (HRT), включаемые через B<CONFIG_HIGH_RES_TIMERS>. В системе, которая поддерживает HRT, точность сна и таймеров в системных вызовах больше не ограничена мигом, а только точностью аппаратуры (в современной аппаратуре, обычно, микросекундная точность). Вы можете определить поддерживаются ли таймеры высокой точности, проверив результат вызова B<clock_getres>(2) или поискав записи «resolution» в I</proc/timer_list>.

source: HRTs are not supported on all hardware architectures. (Support is provided on x86, arm, and powerpc, among others.)
ru: HRT поддерживаются не на всех аппаратных архитектурах (среди имеющих отметим x86, arm и powerpc).

source: The Epoch
ru: Эпоха

source: UNIX systems represent time in seconds since the I<Epoch>, 1970-01-01 00:00:00 +0000 (UTC).
ru: В системах UNIX время считается в секундах и начинается с I<эпохи> (Epoch), 1970-01-01 00:00:00 +0000 (UTC).

source: A program can determine the I<calendar time> via the B<clock_gettime>(2) B<CLOCK_REALTIME> clock, which returns time (in seconds and nanoseconds) that have elapsed since the Epoch; B<time>(2) provides similar information, but only with accuracy to the nearest second. The system time can be changed using B<clock_settime>(2).
ru: Программа может определить I<календарное время> c помощью часов B<CLOCK_REALTIME> через B<clock_gettime>(2), которые возвращают время (в секундах и наносекундах), прошедшее с начала эпохи; вызов B<time>(2) выдаёт подобную информацию, но с точностью только до ближайшей секунды. Системное время можно изменять с помощью B<clock_settime>(2).

source: Broken-down time
ru: Календарное время, разделённое на компоненты

source: Certain library functions use a structure of type I<tm> to represent I<broken-down time>, which stores time value separated out into distinct components (year, month, day, hour, minute, second, etc.). This structure is described in B<ctime>(3), which also describes functions that convert between calendar time and broken-down time. Functions for converting between broken-down time and printable string representations of the time are described in B<ctime>(3), B<strftime>(3), and B<strptime>(3).
ru: Некоторые библиотечные функции используют структуру с типом I<tm> для представления I<календарного времени, разделённого на компоненты> (broken-down time), в которой время хранится в виде отдельных составляющих (год, месяц, день, час, минута, секунда и т. д.). Эта структура описана в B<ctime>(3), в которой также описаны функции, преобразующие календарное время в разделённое на компоненты и обратно. Функции представления календарного времени, разделённого на компоненты, в печатную строку описаны в B<ctime>(3), B<strftime>(3) и B<strptime>(3).

source: Sleeping and setting timers
ru: Таймеры сна и их установка

source: Various system calls and functions allow a program to sleep (suspend execution) for a specified period of time; see B<nanosleep>(2), B<clock_nanosleep>(2), and B<sleep>(3).
ru: Различные системные вызовы и функции позволяют программе спать (приостанавливать выполнение) заданный промежуток времени; смотрите B<nanosleep>(2), B<clock_nanosleep>(2) и B<sleep>(3).

source: Various system calls allow a process to set a timer that expires at some point in the future, and optionally at repeated intervals; see B<alarm>(2), B<getitimer>(2), B<timerfd_create>(2), and B<timer_create>(2).
ru: Различные системные вызовы позволяют процессу устанавливать таймеры, которые срабатывают в какой-то момент в будущем, и, возможно, через определённые интервалы; смотрите B<alarm>(2), B<getitimer>(2), B<timerfd_create>(2) и B<timer_create>(2).

source: Timer slack
ru: Допуск таймера

source: Since Linux 2.6.28, it is possible to control the "timer slack" value for a thread. The timer slack is the length of time by which the kernel may delay the wake-up of certain system calls that block with a timeout. Permitting this delay allows the kernel to coalesce wake-up events, thus possibly reducing the number of system wake-ups and saving power. For more details, see the description of B<PR_SET_TIMERSLACK> in B<prctl>(2).
ru: Начиная с Linux 2.6.28, возможно контролировать значение «допуска таймера» (timer slack) нити. Допуск таймера — это промежуток времени, на который ядро может задержать пробуждение определённых системных вызовов, заблокированных на время. Эта задержка позволяет ядру объединять события пробуждения, таким образом сокращая количество системных пробуждений и экономя энергию. Подробней смотрите описание B<PR_SET_TIMERSLACK> в B<prctl>(2).

source: tkill, tgkill - send a signal to a thread
ru: tkill, tgkill - посылает сигнал нити

source: I<Note>: There are no glibc wrappers for these system calls; see NOTES.
ru: I<Замечание>: В glibc нет обёрточных функций для этих системных вызовов; смотрите ЗАМЕЧАНИЯ.

source: B<tgkill>() sends the signal I<sig> to the thread with the thread ID I<tid> in the thread group I<tgid>. (By contrast, B<kill>(2) can be used to send a signal only to a process (i.e., thread group) as a whole, and the signal will be delivered to an arbitrary thread within that process.)
ru: B<tgkill>() отправляет сигнал I<sig> нити с ID I<tid> в группе нитей I<tgid>. Для сравнения, B<kill>(2) может быть использована только для отправки сигнала процессу (т.е., группе нитей) как единому целому и сигнал будет доставлен произвольной нити внутри этого процесса.

source: B<tkill>() is an obsolete predecessor to B<tgkill>(). It allows only the target thread ID to be specified, which may result in the wrong thread being signaled if a thread terminates and its thread ID is recycled. Avoid using this system call.
ru: Вызов B<tkill>() \(em устаревший предшественник B<tgkill>(). Он позволяет задавать только идентификатор нити-получателя, что может привести к уведомлению не той нити, если нить завершила работу и её идентификатор используется повторно. Не используйте данный системный вызов.

source: These are the raw system call interfaces, meant for internal thread library use.
ru: Это вызовы интерфейса системного уровня, они предназначены для внутреннего использования в библиотеке нитей.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ
