Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: B<FUTEX_WAIT_REQUEUE_PI> pairs with B<FUTEX_CMP_REQUEUE_PI>. This must be performed from a non-PI futex to a distinct PI futex (or the error B<EINVAL> results). Additionally, I<val> (the number of waiters to be woken) must be 1 (or the error B<EINVAL> results).
ru: Парой к операции B<FUTEX_WAIT_REQUEUE_PI> является B<FUTEX_CMP_REQUEUE_PI>. Она должна применяться для перехода с не PI-фьютекса к PI-фьютексу (или возникает ошибка B<EINVAL>). Также, I<val> (количество разбуживаемых ожидающих) должно равняться 1 (или возникает ошибка B<EINVAL>).

source: The PI futex operations are as follows:
ru: Операции с PI-фьютексами:

source: B<FUTEX_LOCK_PI> (since Linux 2.6.18)
ru: B<FUTEX_LOCK_PI> (начиная с Linux 2.6.18)

source: This operation is used after an attempt to acquire the lock via an atomic user-mode instruction failed because the futex word has a nonzero value\(emspecifically, because it contained the (PID-namespace-specific) TID of the lock owner.
ru: Данная операция используется после попытки получить блокировку через атомарную инструкцию в пространстве пользователя, которая завершилась с ошибкой из-за того, что слово фьютекса не равно нулю — содержит value\(emspecifically, because it contained the TID (PID в этом пространстве имён) владельца блокировки.

source: The operation checks the value of the futex word at the address I<uaddr>. If the value is 0, then the kernel tries to atomically set the futex value to the caller's TID. If the futex word's value is nonzero, the kernel atomically sets the B<FUTEX_WAITERS> bit, which signals the futex owner that it cannot unlock the futex in user space atomically by setting the futex value to 0. After that, the kernel:
ru: Операция проверяет значение слова фьютекса по адресу I<uaddr>. Если значение равно 0, то ядро пытается атомарно изменить слово фьютекса на TID вызывающего. Если слово фьютекса не равно нулю, то ядро атомарно устанавливает бит B<FUTEX_WAITERS>, который указывает владельцу фьютекса, что он не может разблокировать фьютекс в пространстве пользователя атомарным способом посредством установки значения фьюетекса в 0. После этого ядро:

source: Tries to find the thread which is associated with the owner TID.
ru: Пытается найти нить-владельца по TID.

source: Creates or reuses kernel state on behalf of the owner. (If this is the first waiter, there is no kernel state for this futex, so kernel state is created by locking the RT-mutex and the futex owner is made the owner of the RT-mutex. If there are existing waiters, then the existing state is reused.)
ru: Создаёт или повторно использует состояние ядра от имени владельца (если это первый ожидающий, то для этого фьютекса не состояния ядра, поэтому состояние ядра создаётся блокировкой RT-мьютекса и владелец фьютекса становится владельцем RT-мьютекса. Если ожидающие уже есть, то используется имеющееся состояние).

source: Attaches the waiter to the futex (i.e., the waiter is enqueued on the RT-mutex waiter list).
ru: Присоединяет ожидающего к фьютексу (т. е., ожидающий ставится в очередь списка ожидающих на основе RT-мьютекса).

source: If more than one waiter exists, the enqueueing of the waiter is in descending priority order. (For information on priority ordering, see the discussion of the B<SCHED_DEADLINE>, B<SCHED_FIFO>, and B<SCHED_RR> scheduling policies in B<sched>(7).) The owner inherits either the waiter's CPU bandwidth (if the waiter is scheduled under the B<SCHED_DEADLINE> policy) or the waiter's priority (if the waiter is scheduled under the B<SCHED_RR> or B<SCHED_FIFO> policy). This inheritance follows the lock chain in the case of nested locking and performs deadlock detection.
ru: Если есть более одного ожидающего, то перестановка ожидающего в очередь выполняется в порядке убывания приоритета (упорядочивание по приоритету описано в разделе об алгоритмах планирования B<SCHED_DEADLINE>, B<SCHED_FIFO> и B<SCHED_RR> в B<sched>(7)). Владелец наследует от ожидающего пропускную способность ЦП (если ожидающий работает по алгоритму планирования B<SCHED_DEADLINE>) или приоритет (если ожидающий работает по алгоритму планирования B<SCHED_RR> или B<SCHED_FIFO>). При обнаружении вложенности блокировки и клинча такое наследование распространяется по всей цепочке блокировки.

source: The I<timeout> argument provides a timeout for the lock attempt. If I<timeout> is not NULL, the structure it points to specifies an absolute timeout, measured against the B<CLOCK_REALTIME> clock. If I<timeout> is NULL, the operation will block indefinitely.
ru: В аргументе I<timeout> задаётся время ожидания захвата блокировки. Если I<timeout> равно NULL, то структура, на которую он указывает, определяет абсолютное время ожидания, отсчитываемое по часам B<CLOCK_REALTIME>. Если I<timeout> равно NULL, то операция может быть в блокировке неопределённо долго.

source: The I<uaddr2>, I<val>, and I<val3> arguments are ignored.
ru: Аргументы I<uaddr2>, I<val> и I<val3> игнорируются.

source: B<FUTEX_TRYLOCK_PI> (since Linux 2.6.18)
ru: B<FUTEX_TRYLOCK_PI> (начиная с Linux 2.6.18)

source: This operation tries to acquire the lock at I<uaddr>. It is invoked when a user-space atomic acquire did not succeed because the futex word was not 0.
ru: Эта операция пытается получить блокировку по адресу I<uaddr>. Она вызывается, когда не удалось выполнить атомарное получение из пользовательского пространства, так как слово фьютекса не равно 0.

source: Because the kernel has access to more state information than user space, acquisition of the lock might succeed if performed by the kernel in cases where the futex word (i.e., the state information accessible to use-space) contains stale state (B<FUTEX_WAITERS> and/or B<FUTEX_OWNER_DIED>). This can happen when the owner of the futex died. User space cannot handle this condition in a race-free manner, but the kernel can fix this up and acquire the futex.
ru: Так как ядро имеет больший доступ к информации о состоянии, чем пользовательское пространство, получение блокировки из ядра может осуществиться, в случаях когда слово фьютекса (т. е., информация о состоянии доступна из пользовательского пространства) устарело (B<FUTEX_WAITERS> и/или B<FUTEX_OWNER_DIED>). Это может случиться, если владелец фьютекса неожиданно завершился. Пользовательское пространство не может учесть это событие не получив состязательности, но ядро может решить данную проблему и получить блокировку.

source: The I<uaddr2>, I<val>, I<timeout>, and I<val3> arguments are ignored.
ru: Аргументы I<uaddr2>, I<val>, I<timeout> и I<val3> игнорируются.

source: B<FUTEX_UNLOCK_PI> (since Linux 2.6.18)
ru: B<FUTEX_UNLOCK_PI> (начиная с Linux 2.6.18)

source: This operation wakes the top priority waiter that is waiting in B<FUTEX_LOCK_PI> on the futex address provided by the I<uaddr> argument.
ru: Данная операция будит ожидающего с самым высоким приоритетом, который ждёт фьютекс по адресу из I<uaddr> посредством операции B<FUTEX_LOCK_PI>.

source: This is called when the user-space value at I<uaddr> cannot be changed atomically from a TID (of the owner) to 0.
ru: Операция вызывается, когда значение по адресу I<uaddr> пользовательского пространства невозможно изменить атомарно с TID (владельца) на 0.

source: B<FUTEX_CMP_REQUEUE_PI> (since Linux 2.6.31)
ru: B<FUTEX_CMP_REQUEUE_PI> (начиная с Linux 2.6.31)

source: This operation is a PI-aware variant of B<FUTEX_CMP_REQUEUE>. It requeues waiters that are blocked via B<FUTEX_WAIT_REQUEUE_PI> on I<uaddr> from a non-PI source futex (I<uaddr>) to a PI target futex (I<uaddr2>).
ru: Данная операция является PI-аналогом операции B<FUTEX_CMP_REQUEUE>. Она перестанавливает ожидающих, заблокированных с помощью B<FUTEX_WAIT_REQUEUE_PI> для I<uaddr>, из очереди не PI-фьютекса источника (I<uaddr>) в очередь PI-фьютекса назначения (I<uaddr2>).

source: As with B<FUTEX_CMP_REQUEUE>, this operation wakes up a maximum of I<val> waiters that are waiting on the futex at I<uaddr>. However, for B<FUTEX_CMP_REQUEUE_PI>, I<val> is required to be 1 (since the main point is to avoid a thundering herd). The remaining waiters are removed from the wait queue of the source futex at I<uaddr> and added to the wait queue of the target futex at I<uaddr2>.
ru: Как и B<FUTEX_CMP_REQUEUE>, эта операция пробуждает не более I<val> ожидающих, которые ждут фьютекса по адресу I<uaddr>. Однако у B<FUTEX_CMP_REQUEUE_PI> значение I<val> должно быть равно 1 (чтобы избежать «нашествия орды»). Оставшиеся ожидающие удаляются из очереди ожидания фьютекса-источника по адресу I<uaddr> и добавляются в очередь ожидания фьютекса-назначения по адресу I<uaddr2>.

source: The I<val2> and I<val3> arguments serve the same purposes as for B<FUTEX_CMP_REQUEUE>.
ru: Аргументы I<val2> и I<val3> служат тем же целям, что и в B<FUTEX_CMP_REQUEUE>.

source: B<FUTEX_WAIT_REQUEUE_PI> (since Linux 2.6.31)
ru: B<FUTEX_WAIT_REQUEUE_PI> (начиная с Linux 2.6.31)

source: Wait on a non-PI futex at I<uaddr> and potentially be requeued (via a B<FUTEX_CMP_REQUEUE_PI> operation in another task) onto a PI futex at I<uaddr2>. The wait operation on I<uaddr> is the same as for B<FUTEX_WAIT>.
ru: Ждать не PI-фьютекса по адресу I<uaddr> и, потенциально быть перемещённым в очередь (при операции B<FUTEX_CMP_REQUEUE_PI> из другой задачи) PI-фьютекса по адресу I<uaddr2>. Операция ожидания на адресе I<uaddr> такая же как для B<FUTEX_WAIT>.

source: The waiter can be removed from the wait on I<uaddr> without requeueing on I<uaddr2> via a B<FUTEX_WAKE> operation in another task. In this case, the B<FUTEX_WAIT_REQUEUE_PI> operation fails with the error B<EAGAIN>.
ru: Ожидающий может быть удалён из ожидающих на адресе I<uaddr> перемещения в очередь у I<uaddr2> при операции B<FUTEX_WAKE> из другой задачи. В этом случае операция B<FUTEX_WAIT_REQUEUE_PI> завершается с ошибкой B<EAGAIN>.

source: The I<val3> argument is ignored.
ru: Аргумент I<val3> игнорируется.

source: The B<FUTEX_WAIT_REQUEUE_PI> and B<FUTEX_CMP_REQUEUE_PI> were added to support a fairly specific use case: support for priority-inheritance-aware POSIX threads condition variables. The idea is that these operations should always be paired, in order to ensure that user space and the kernel remain in sync. Thus, in the B<FUTEX_WAIT_REQUEUE_PI> operation, the user-space application pre-specifies the target of the requeue that takes place in the B<FUTEX_CMP_REQUEUE_PI> operation.
ru: Операции B<FUTEX_WAIT_REQUEUE_PI> и B<FUTEX_CMP_REQUEUE_PI> добавлены для довольно узкого варианта применения — поддержки переменных условия нитей POSIX с наследованием приоритета. Идея в том, что эти операции всегда должны использоваться попарно, для поддержания синхронизации между пользовательским пространством и ядром. То есть в операции B<FUTEX_WAIT_REQUEUE_PI> приложение пользовательского пространства заранее задаёт назначение для перемещения в очередь, которое проводится операцией B<FUTEX_CMP_REQUEUE_PI>.

source: In the event of an error (and assuming that B<futex>() was invoked via B<syscall>(2)), all operations return -1 and set I<errno> to indicate the cause of the error.
ru: В случае ошибки (предполагается, что B<futex>() был вызван через B<syscall>(2)), все операции возвращают -1 и присваивают I<errno> номер ошибки.

source: The return value on success depends on the operation, as described in the following list:
ru: При успешном выполнении возвращаемое значение зависит от операции:

source: Returns 0 if the caller was woken up. Note that a wake-up can also be caused by common futex usage patterns in unrelated code that happened to have previously used the futex word's memory location (e.g., typical futex-based implementations of Pthreads mutexes can cause this under some conditions). Therefore, callers should always conservatively assume that a return value of 0 can mean a spurious wake-up, and use the futex word's value (i.e., the user-space synchronization scheme) to decide whether to continue to block or not.
ru: Значение 0 возвращается, если вызывающий был разбужен. Заметим, что пробуждение также может быть вызвано часто используемыми вариантами использования фьютексов в не связанном коде, которое случается, если память под слово фьютекса использовалась ранее (например, при типичной реализации фьютексов на основе мьютексов Pthreads это может возникать при определённых условиях). Поэтому вызывающий всегда должен консервативно предполагать, что возвращаемое значение 0 может означать побочное пробуждение (spurious wake-up), и учитывать значение слово фьютекса (т. е. схема с синхронизацией пользовательского пространства) при принятии решения нужна дальнейшее ожидание или нет.

source: Returns the number of waiters that were woken up.
ru: Возвращается количество разбуженных ожидающих.

source: Returns the new file descriptor associated with the futex.
ru: Возвращается новый файловый дескриптор, связанный с фьютексом.

source: Returns the total number of waiters that were woken up or requeued to the futex for the futex word at I<uaddr2>. If this value is greater than I<val>, then the difference is the number of waiters requeued to the futex for the futex word at I<uaddr2>.
ru: Возвращается общее количество ожидающих, которые будятся или перемещаются в очередь фьютекса, у которого слово фьютекса задано по адресу I<uaddr2>. Если это значение больше чем I<val>, то разница это количество ожидающих, перемещённых в очередь фьютекса, у которого слово фьютекса задано по адресу I<uaddr2>.

source: Returns the total number of waiters that were woken up. This is the sum of the woken waiters on the two futexes for the futex words at I<uaddr> and I<uaddr2>.
ru: Возвращается общее количество разбуженных ожидающих. Это сумма разбуженных ожидающих у двух фьютексов для слов фьютексов по адресам I<uaddr> и I<uaddr2>.

source: Returns 0 if the caller was woken up. See B<FUTEX_WAIT> for how to interpret this correctly in practice.
ru: Возвращается 0, если вызывающий был разбужен. Смотрите в описании B<FUTEX_WAIT>, как это правильно учитывать на практике.

source: Returns 0 if the futex was successfully locked.
ru: Возвращается 0, если фьютекс был успешно заблокирован.

source: Returns 0 if the futex was successfully unlocked.
ru: Возвращается 0, если фьютекс был успешно разблокирован.

source: Returns the total number of waiters that were woken up or requeued to the futex for the futex word at I<uaddr2>. If this value is greater than I<val>, then difference is the number of waiters requeued to the futex for the futex word at I<uaddr2>.
ru: Возвращается общее количество ожидающих, которые будятся или перемещаются в очередь фьютекса, у которого слово фьютекса задано по адресу I<uaddr2>. Если это значение больше чем I<val>, то разница это количество ожидающих, перемещённых в очередь фьютекса, у которого слово фьютекса задано по адресу I<uaddr2>.

source: Returns 0 if the caller was successfully requeued to the futex for the futex word at I<uaddr2>.
ru: Возвращается 0, если вызывающий был успешно перемещён в очередь фьютекса со словом фьютекса по адресу I<uaddr2>.

source: No read access to the memory of a futex word.
ru: Нет доступа на чтение памяти слова фьютекса.

source: (B<FUTEX_WAIT>, B<FUTEX_WAIT_BITSET>, B<FUTEX_WAIT_REQUEUE_PI>) The value pointed to by I<uaddr> was not equal to the expected value I<val> at the time of the call.
ru: (B<FUTEX_WAIT>, B<FUTEX_WAIT_BITSET>, B<FUTEX_WAIT_REQUEUE_PI>) Значение, на которое указывает I<uaddr>, не было равно ожидаемому значению I<val> на момент вызова.

source: B<Note>: on Linux, the symbolic names B<EAGAIN> and B<EWOULDBLOCK> (both of which appear in different parts of the kernel futex code) have the same value.
ru: B<Замечание>: в Linux символические имена B<EAGAIN> и B<EWOULDBLOCK> (оба есть в разных частях кода фьютекса ядра) имеют одинаковое значение.

source: (B<FUTEX_CMP_REQUEUE>, B<FUTEX_CMP_REQUEUE_PI>) The value pointed to by I<uaddr> is not equal to the expected value I<val3>.
ru: (B<FUTEX_CMP_REQUEUE>, B<FUTEX_CMP_REQUEUE_PI>) Значение, на которое указывает I<uaddr>, не равно ожидаемому значению I<val3>.

source: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) The futex owner thread ID of I<uaddr> (for B<FUTEX_CMP_REQUEUE_PI>: I<uaddr2>) is about to exit, but has not yet handled the internal state cleanup. Try again.
ru: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) ID нити владельца фьютекса по адресу I<uaddr> (для B<FUTEX_CMP_REQUEUE_PI> — I<uaddr2>) вскоре закончит работу, но не выполнил очистку внутреннего состояния. Попробуйте ещё раз.

source: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) The futex word at I<uaddr> is already locked by the caller.
ru: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) Слово фьютекса по адресу I<uaddr> уже заблокировано вызывающим.

source: (B<FUTEX_CMP_REQUEUE_PI>) While requeueing a waiter to the PI futex for the futex word at I<uaddr2>, the kernel detected a deadlock.
ru: (B<FUTEX_CMP_REQUEUE_PI>) Во время перемещения в другую очередь ожидающего PI-фьютекса со словом фьютекса по адресу I<uaddr2> ядро обнаружило тупиковую блокировку (deadlock).

source: A required pointer argument (i.e., I<uaddr>, I<uaddr2>, or I<timeout>) did not point to a valid user-space address.
ru: Требуемый аргумент указателя (т. е., I<uaddr>, I<uaddr2> или I<timeout>) не указывает на допустимый адрес пользовательского пространства.

source: A B<FUTEX_WAIT> or B<FUTEX_WAIT_BITSET> operation was interrupted by a signal (see B<signal>(7)). In kernels before Linux 2.6.22, this error could also be returned for a spurious wakeup; since Linux 2.6.22, this no longer happens.
ru: Операция B<FUTEX_WAIT> или B<FUTEX_WAIT_BITSET> была прервана сигналом (смотрите B<signal>(7)). В ядрах до версии Linux 2.6.22 эта ошибка также возвращалась при побочном пробуждении; начиная с Linux 2.6.22 этого больше не происходит.

source: The operation in I<futex_op> is one of those that employs a timeout, but the supplied I<timeout> argument was invalid (I<tv_sec> was less than zero, or I<tv_nsec> was not less than 1,000,000,000).
ru: Операция в I<futex_op> является одной из тех, что используют ожидание (timeout), но значение аргумента I<timeout> некорректно (I<tv_sec> меньше нуля или I<tv_nsec> больше 1000000000).

source: The operation specified in I<futex_op> employs one or both of the pointers I<uaddr> and I<uaddr2>, but one of these does not point to a valid object\(emthat is, the address is not four-byte-aligned.
ru: Операция, указанная в I<futex_op>, использует один или оба указателя I<uaddr> и I<uaddr2>, но один из них не указывает на корректный объект, то есть адрес не выровнен по четырёх байтовой границе.

source: (B<FUTEX_WAIT_BITSET>, B<FUTEX_WAKE_BITSET>) The bit mask supplied in I<val3> is zero.
ru: (B<FUTEX_WAIT_BITSET>, B<FUTEX_WAKE_BITSET>) Битовая маска, указанная в I<val3>, равна нулю.

source: (B<FUTEX_CMP_REQUEUE_PI>) I<uaddr> equals I<uaddr2> (i.e., an attempt was made to requeue to the same futex).
ru: (B<FUTEX_CMP_REQUEUE_PI>) Значение I<uaddr> равно I<uaddr2> (т. е., предпринята попытка выполнить перемещение в одну и ту же очередь).

source: (B<FUTEX_FD>) The signal number supplied in I<val> is invalid.
ru: (B<FUTEX_FD>) В I<val> указан некорректный номер сигнала.

source: (B<FUTEX_WAKE>, B<FUTEX_WAKE_OP>, B<FUTEX_WAKE_BITSET>, B<FUTEX_REQUEUE>, B<FUTEX_CMP_REQUEUE>) The kernel detected an inconsistency between the user-space state at I<uaddr> and the kernel state\(emthat is, it detected a waiter which waits in B<FUTEX_LOCK_PI> on I<uaddr>.
ru: (B<FUTEX_WAKE>, B<FUTEX_WAKE_OP>, B<FUTEX_WAKE_BITSET>, B<FUTEX_REQUEUE>, B<FUTEX_CMP_REQUEUE>) Ядро обнаружило противоречие между состояние в пользовательском пространстве по адресу I<uaddr> и состоянием в ядре, то есть обнаружило, что ожидающий ждёт посредством операции B<FUTEX_LOCK_PI> на адресе I<uaddr>.

source: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_UNLOCK_PI>) The kernel detected an inconsistency between the user-space state at I<uaddr> and the kernel state. This indicates either state corruption or that the kernel found a waiter on I<uaddr> which is waiting via B<FUTEX_WAIT> or B<FUTEX_WAIT_BITSET>.
ru: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_UNLOCK_PI>) Ядро обнаружило противоречие между состояние в пользовательском пространстве по адресу I<uaddr> и состоянием в ядре. Это указывает на поврежденное значение состояния или что ядро обнаружило ожидающего на адресе I<uaddr>, который делает это посредством операции B<FUTEX_WAIT> или B<FUTEX_WAIT_BITSET>.

source: (B<FUTEX_CMP_REQUEUE_PI>) The kernel detected an inconsistency between the user-space state at I<uaddr2> and the kernel state; that is, the kernel detected a waiter which waits via B<FUTEX_WAIT> or B<FUTEX_WAIT_BITSET> on I<uaddr2>.
ru: (B<FUTEX_CMP_REQUEUE_PI>) Ядро обнаружило противоречие между состояние в пользовательском пространстве по адресу I<uaddr2> и состоянием в ядре, то есть обнаружило, что ожидающий ждёт посредством операции B<FUTEX_WAIT> или B<FUTEX_WAIT_BITSET> на адресе I<uaddr2>.

source: (B<FUTEX_CMP_REQUEUE_PI>) The kernel detected an inconsistency between the user-space state at I<uaddr> and the kernel state; that is, the kernel detected a waiter which waits via B<FUTEX_WAIT> or B<FUTEX_WAIT_BITESET> on I<uaddr>.
ru: (B<FUTEX_CMP_REQUEUE_PI>) Ядро обнаружило противоречие между состояние в пользовательском пространстве по адресу I<uaddr> и состоянием в ядре, то есть обнаружило, что ожидающий ждёт посредством операции B<FUTEX_WAIT> или B<FUTEX_WAIT_BITESET> на адресе I<uaddr>.

source: (B<FUTEX_CMP_REQUEUE_PI>) The kernel detected an inconsistency between the user-space state at I<uaddr> and the kernel state; that is, the kernel detected a waiter which waits on I<uaddr> via B<FUTEX_LOCK_PI> (instead of B<FUTEX_WAIT_REQUEUE_PI>).
ru: (B<FUTEX_CMP_REQUEUE_PI>) Ядро обнаружило противоречие между состояние в пользовательском пространстве по адресу I<uaddr> и состоянием в ядре, то есть обнаружило, что ожидающий ждёт посредством операции B<FUTEX_LOCK_PI> на адресе I<uaddr> (вместо B<FUTEX_WAIT_REQUEUE_PI>).

source: (B<FUTEX_CMP_REQUEUE_PI>) An attempt was made to requeue a waiter to a futex other than that specified by the matching B<FUTEX_WAIT_REQUEUE_PI> call for that waiter.
ru: (B<FUTEX_CMP_REQUEUE_PI>) Предпринята попытка выполнить перемещение ожидающего на фьютекс, отличный от указанного в соответствующем вызове B<FUTEX_WAIT_REQUEUE_PI> для этого вызывающего.

source: (B<FUTEX_CMP_REQUEUE_PI>) The I<val> argument is not 1.
ru: (B<FUTEX_CMP_REQUEUE_PI>) Значение аргумента I<val> не равно 1.

source: Invalid argument.
ru: Неверный аргумент.

source: (B<FUTEX_FD>) The system-wide limit on the total number of open files has been reached.
ru: (B<FUTEX_FD>) Достигнуто ограничение на общее количество открытых файлов в системе.

source: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) The kernel could not allocate memory to hold state information.
ru: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) Ядро не может выделить память для хранения информации о состоянии.

source: Invalid operation specified in I<futex_op>.
ru: В I<futex_op> задана неверная операция.

source: The B<FUTEX_CLOCK_REALTIME> option was specified in I<futex_op>, but the accompanying operation was neither B<FUTEX_WAIT>, B<FUTEX_WAIT_BITSET>, nor B<FUTEX_WAIT_REQUEUE_PI>.
ru: В I<futex_op> был указан параметр B<FUTEX_CLOCK_REALTIME>, но сопутствующая операция не равна B<FUTEX_WAIT>, B<FUTEX_WAIT_BITSET> или B<FUTEX_WAIT_REQUEUE_PI>.
