Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Each of the arguments can have a dummy value. The dummy classification value B<MM_NULLMC> (0L) does not specify any output, so nothing is printed. The dummy severity value B<NO_SEV> (0) says that no severity is supplied. The values B<MM_NULLLBL>, B<MM_NULLTXT>, B<MM_NULLACT>, B<MM_NULLTAG> are synonyms for I<((char\ *)\ 0)>, the empty string, and B<MM_NULLSEV> is a synonym for B<NO_SEV>.
ru: Каждый аргумент может иметь фиктивное значение. Для фиктивного значения классификации (classification) B<MM_NULLMC> (0L) ничего не выводится, то есть ничего не печатается. Фиктивное значение важности (severity) B<NO_SEV> (0) указывается, если важность не определена. Значения B<MM_NULLLBL>, B<MM_NULLTXT>, B<MM_NULLACT>, B<MM_NULLTAG> являются синонимами I<((char\ *)\ 0)> — пустой строки, а B<MM_NULLSEV> — синоним B<NO_SEV>.

source: The classification argument
ru: Аргумент классификации

source: The I<classification> argument is the sum of values describing 4 types of information.
ru: Аргумент I<classification> — это сочетание значений, описывающих 4 типа информации.

source: The first value defines the output channel.
ru: Первое значение определяет канал вывода.

source: Output to I<stderr>.
ru: Вывод в I<stderr>.

source: Output to the system console.
ru: Вывод в системную консоль.

source: Output to both.
ru: Вывод в оба места.

source: The second value is the source of the error:
ru: Вторым значением описывается источник ошибки.

source: A hardware error occurred.
ru: Произошла аппаратная ошибка.

source: A firmware error occurred.
ru: Произошла ошибка в микропрограмме.

source: A software error occurred.
ru: Произошла ошибка в программном обеспечении.

source: The third value encodes the detector of the problem:
ru: В третьем значении кодируется выявитель проблемы.

source: It is detected by an application.
ru: Обнаружено приложением.

source: It is detected by a utility.
ru: Обнаружено утилитой.

source: It is detected by the operating system.
ru: Обнаружено операционной системой.

source: The fourth value shows the severity of the incident:
ru: В четвёртом значении показывается важность инцидента:

source: It is a recoverable error.
ru: Это исправимая ошибка.

source: It is a nonrecoverable error.
ru: Это неисправимая ошибка.

source: The severity argument
ru: Аргумент важности

source: The I<severity> argument can take one of the following values:
ru: В аргументе I<severity> можно указать одно из следующих значений:

source: No severity is printed.
ru: Важность не печатается.

source: This value is printed as HALT.
ru: Это значение печатается как ОСТАНОВ.

source: This value is printed as ERROR.
ru: Это значение печатается как ОШИБКА.

source: This value is printed as WARNING.
ru: Это значение печатается как ПРЕДУПРЕЖДЕНИЕ.

source: This value is printed as INFO.
ru: Это значение печатается как ИНФОРМАЦИОННОЕ.

source: The numeric values are between 0 and 4. Using B<addseverity>(3) or the environment variable B<SEV_LEVEL> you can add more levels and strings to print.
ru: Числовые значения от 0 до 4. Используя функцию B<addseverity>(3) или переменную окружения B<SEV_LEVEL> вы можете добавить дополнительные уровни и строки для печати.

source: The function can return 4 values:
ru: Функция может возвращать 4 значения:

source: Everything went smooth.
ru: Всё хорошо.

source: Complete failure.
ru: Всё плохо.

source: Error writing to I<stderr>.
ru: Ошибка записи в I<stderr>.

source: Error writing to the console.
ru: Ошибка записи в консоль.

source: ENVIRONMENT
ru: ОКРУЖЕНИЕ

source: The environment variable B<MSGVERB> ("message verbosity") can be used to suppress parts of the output to I<stderr>. (It does not influence output to the console.) When this variable is defined, is non-NULL, and is a colon-separated list of valid keywords, then only the parts of the message corresponding to these keywords is printed. Valid keywords are "label", "severity", "text", "action" and "tag".
ru: Переменная окружения B<MSGVERB> (message verbosity — детальность сообщения) может использоваться для отключения некоторых частей вывода в I<stderr> (она не влияет на вывод на консоль). Если эта переменная определена, не равна NULL и содержит список допустимых ключевых слов через двоеточие, то печатаются только части сообщения, которые соответствуют этим ключевым словам. Допустимые ключевые слова: «label», «severity», «text», «action» и «tag».

source: The environment variable B<SEV_LEVEL> can be used to introduce new severity levels. By default, only the five severity levels described above are available. Any other numeric value would make B<fmtmsg>() print nothing. If the user puts B<SEV_LEVEL> with a format like
ru: Переменная окружения B<SEV_LEVEL> может использоваться для ввода новых уровней важности. По умолчанию, доступно только пять уровней важности, описанных выше. Для любого другого числового значения B<fmtmsg>() ничего не печатает. Если пользователь задал B<SEV_LEVEL> в формате

source: SEV_LEVEL=[description[:description[:...]]]
ru: SEV_LEVEL=[описание[:описание[:...]]]

source: in the environment of the process before the first call to B<fmtmsg>(), where each description is of the form
ru: в окружении процесса перед первым вызовом B<fmtmsg>() и каждое описание имеет вид

source: severity-keyword,level,printstring
ru: ключевое-слово-важности,уровень,печатаемая-строка

source: then B<fmtmsg>() will also accept the indicated values for the level (in addition to the standard levels 0\(en4), and use the indicated printstring when such a level occurs.
ru: то B<fmtmsg>() также будет обрабатывать заданные значения уровней (в дополнении к стандартным уровням 0\(en4), и использовать указанную строку печати, когда встречается такой уровень.

source: The severity-keyword part is not used by B<fmtmsg>() but it has to be present. The level part is a string representation of a number. The numeric value must be a number greater than 4. This value must be used in the severity argument of B<fmtmsg>() to select this class. It is not possible to overwrite any of the predefined classes. The printstring is the string printed when a message of this class is processed by B<fmtmsg>().
ru: Часть «ключевое-слово-важности» не используется B<fmtmsg>(), но указывается. Часть «уровень» — это строка, представляющая число. Числовое значение должно быть числом более 4. Это значение должно использоваться в аргументе важности B<fmtmsg>() для выбора этого класса. Невозможно заменить любой из предопределённых классов. «Печатаемая-строка» — строка, которая печатается в случае, когда сообщение этого класса обрабатывается B<fmtmsg>().

source: B<fmtmsg>() is provided in glibc since version 2.1.
ru: Функция B<fmtmsg>() появилась в glibc начиная с версии 2.1.

source: Before glibc 2.16, the B<fmtmsg>() function uses a static variable that is not protected, so it is not thread-safe.
ru: До glibc 2.16 функция B<fmtmsg>() использовала статическую незащищённую переменную, поэтому функцию нельзя использовать в нескольких нитях одновременно.

source: Since glibc 2.16, the B<fmtmsg>() function uses a lock to protect the static variable, so it is thread-safe.
ru: Начиная с glibc 2.16 функция B<fmtmsg>() использует блокировку для защиты статической переменной, поэтому функцию можно использовать в нескольких нитях одновременно.

source: The functions B<fmtmsg>() and B<addseverity>(3), and environment variables B<MSGVERB> and B<SEV_LEVEL> come from System V.
ru: Функции B<fmtmsg>() и B<addseverity>(3), и переменные окружения B<MSGVERB> и B<SEV_LEVEL> впервые появились в System V.

source: The function B<fmtmsg>() and the environment variable B<MSGVERB> are described in POSIX.1-2001 and POSIX.1-2008.
ru: Функция B<fmtmsg>() и переменная окружения B<MSGVERB> описана в POSIX.1-2001 и POSIX.1-2008.

source: System V and UnixWare man pages tell us that these functions have been replaced by "pfmt() and addsev()" or by "pfmt(), vpfmt(), lfmt(), and vlfmt()", and will be removed later.
ru: В справочных страницах System V и UnixWare указано, что эти функции были заменены на «pfmt() и addsev()» или «pfmt(), vpfmt(), lfmt() и vlfmt()», и будут впоследствии удалены.

source: err = fmtmsg(class, "util-linux:mount", MM_ERROR, "unknown mount option", "See mount(8).", "util-linux:mount:017"); switch (err) { case MM_OK: break; case MM_NOTOK: printf("Nothing printed\en"); break; case MM_NOMSG: printf("Nothing printed to stderr\en"); break; case MM_NOCON: printf("No console output\en"); break; default: printf("Unknown error from fmtmsg()\en"); } exit(EXIT_SUCCESS); }
ru: err = fmtmsg(class, "util-linux:mount", MM_ERROR, "неизвестный параметр mount", "Смотрите mount(8).", "util-linux:mount:017"); switch (err) { case MM_OK: break; case MM_NOTOK: printf("Нечего печатать\en"); break; case MM_NOMSG: printf("Нечего печатать в stderr\en"); break; case MM_NOCON: printf("Нет вывода на консоль\en"); break; default: printf("Неизвестная ошибка fmtmsg()\en"); } exit(EXIT_SUCCESS); }

source: The output should be:
ru: Вывод должен быть таким:

source: util-linux:mount: ERROR: unknown mount option TO FIX: See mount(8). util-linux:mount:017
ru: util-linux:mount: ERROR: unknown mount option TO FIX: Смотрите mount(8). util-linux:mount:017

source: and after
ru: а после

source: the output becomes:
ru: вывод станет:

source: unknown mount option TO FIX: See mount(8).
ru: неизвестный параметр mount TO FIX: Смотрите mount(8).

source: fmemopen - open memory as stream
ru: fmemopen - открывает память как поток

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: The B<fmemopen>() function opens a stream that permits the access specified by I<mode>. The stream allows I/O to be performed on the string or memory buffer pointed to by I<buf>.
ru: Функция B<fmemopen>() открывает поток, тип доступа указывается в I<mode>. Поток позволяет выполнять операции ввода-вывода со строкой или буфером памяти, указанным в I<buf>.

source: The I<mode> argument specifies the semantics of I/O on the stream, and is one of the following:
ru: В аргументе I<mode> задаётся семантика ввода-вывода потока и может указываться одно из следующих значений:

source: The stream is opened for reading.
ru: Поток открывается для чтения.

source: The stream is opened for writing.
ru: Поток открывается для записи.

source: Append; open the stream for writing, with the initial buffer position set to the first null byte.
ru: Добавление; поток открывается для записи, начальное положение в буфере указывает на первый байт null.

source: Open the stream for reading and writing.
ru: Поток открывается для чтения и записи.

source: Open the stream for reading and writing. The buffer contents are truncated (i.e., \(aq\e0\(aq is placed in the first byte of the buffer).
ru: Поток открывается для чтения и записи. Содержимое буфера обрезается (то есть, в первый байт буфера помещается \(aq\e0\(aq).

source: Append; open the stream for reading and writing, with the initial buffer position set to the first null byte.
ru: Добавление; поток открывается для чтения и записи, начальное положение в буфере указывает на первый байт null.

source: The stream maintains the notion of a current position, the location where the next I/O operation will be performed. The current position is implicitly updated by I/O operations. It can be explicitly updated using B<fseek>(3), and determined using B<ftell>(3). In all modes other than append, the initial position is set to the start of the buffer. In append mode, if no null byte is found within the buffer, then the initial position is I<size+1>.
ru: Для потока поддерживается понятие текущего положения — место, откуда будет выполнена следующая операция ввода-вывода. Текущее положение неявно обновляется операциями ввода-вывода. Оно может быть изменено явным образом с помощью B<fseek>(3) и получено с помощью B<ftell>(3). Во всех режимах кроме добавления, начальное положение указывает на начало буфера. В режиме добавления, если в буфере нет байта null, то начальное положение равно I<size+1>.

source: If I<buf> is specified as NULL, then B<fmemopen>() allocates a buffer of I<size> bytes. This is useful for an application that wants to write data to a temporary buffer and then read it back again. The initial position is set to the start of the buffer. The buffer is automatically freed when the stream is closed. Note that the caller has no way to obtain a pointer to the temporary buffer allocated by this call (but see B<open_memstream>(3)).
ru: Если значение I<buf> равно NULL, то B<fmemopen>() выделяет буфер длиной I<size> байт. Это полезно для приложений, которым нужно записать данные во временный буфер и прочитать из него. Начальное положение указывает на начало буфера. Буфер автоматически освобождается при закрытии потока. Заметим, что вызывающий никогда не получит указатель на временный буфер, выделенный этим вызовом (но смотрите B<open_memstream>(3)).

source: If I<buf> is not NULL, then it should point to a buffer of at least I<len> bytes allocated by the caller.
ru: Если I<buf> не равно NULL, то значение должно указывать на буфер длиной не менее I<len> байт, выделенный вызывающим.

source: When a stream that has been opened for writing is flushed (B<fflush>(3)) or closed (B<fclose>(3)), a null byte is written at the end of the buffer if there is space. The caller should ensure that an extra byte is available in the buffer (and that I<size> counts that byte) to allow for this.
ru: Когда поток, открытый на запись, сбрасывается (flushed) (B<fflush>(3)) или закрывается (B<fclose>(3)), то в конец буфера записывается байт null, если есть место. Вызывающий должен быть уверен, что в буфере есть место для дополнительного байта (и в I<size> учитывается этот байт), чтобы это произошло.

source: In a stream opened for reading, null bytes (\(aq\e0\(aq) in the buffer do not cause read operations to return an end-of-file indication. A read from the buffer will indicate end-of-file only when the current buffer position advances I<size> bytes past the start of the buffer.
ru: В потоке, открытом на чтение, при обнаружении байтов null («\e0») в буфере операции чтения не возвращают конец файла. Чтение из буфера будет возвращать конец файла, только когда текущее положение в буфере достигнет I<size> байт от начала буфера.

source: Write operations take place either at the current position (for modes other than append), or at the current size of the stream (for append modes).
ru: Операции записи выполняются, или по текущему положению (для всех режимов, кроме добавления), или по текущему размеру потока (в режимах добавления).

source: Attempts to write more than I<size> bytes to the buffer result in an error. By default, such errors will be visible (by the absence of data) only when the I<stdio> buffer is flushed. Disabling buffering with the following call may be useful to detect errors at the time of an output operation:
ru: Попытка записать более I<size> байт в буфер приводит к ошибке. По умолчанию, такие ошибки будут видимы (по отсутствию данных) только в момент сброса буфера I<stdio>. Следующий вызов отключает буферизацию, что может быть полезно для обнаружения ошибок в момент операции вывода:

source: Upon successful completion, B<fmemopen>() returns a I<FILE> pointer. Otherwise, NULL is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<fmemopen>() возвращается указатель I<FILE>. В противном случае возвращается NULL и I<errno> присваивается код ошибки.

source: B<fmemopen>() was already available in glibc 1.0.x.
ru: Функция B<fmemopen>() была доступна уже в glibc 1.0.x.

source: POSIX.1-2008. This function is not specified in POSIX.1-2001, and is not widely available on other systems.
ru: POSIX.1-2008. Эта функция не определена в POSIX.1-2001 и широко не распространена среди других систем.

source: POSIX.1-2008 specifies that \(aqb\(aq in I<mode> shall be ignored. However, Technical Corrigendum 1 adjusts the standard to allow implementation-specific treatment for this case, thus permitting the glibc treatment of \(aqb\(aq.
ru: В POSIX.1-2008 указано, что символ «b» в I<mode> должен игнорироваться. Однако в Technical Corrigendum 1 изменили стандарт, позволив реализации решать что делать; это позволяет glibc учитывать «b».

source: There is no file descriptor associated with the file stream returned by this function (i.e., B<fileno>(3) will return an error if called on the returned stream).
ru: У файлового потока, возвращаемого этой функцией, отсутствует файловый дескриптор (т. е., если файловый поток передать в B<fileno>(3), то произойдёт ошибка).

source: With version 2.22, binary mode (see below) was removed, many longstanding bugs in the implementation of B<fmemopen>() were fixed, and a new versioned symbol was created for this interface.
ru: Начиная с версии 2.22 двоичный режим (смотрите ниже) был удалён, было исправлено много дефектов в реализации B<fmemopen>() и для этого интерфейса был создан новый символ с версией.

source: Binary mode
ru: Двоичный режим

source: From version 2.9 to 2.21, the glibc implementation of B<fmemopen>() supported a "binary" mode, enabled by specifying the letter \(aqb\(aq as the second character in I<mode>. In this mode, writes don't implicitly add a terminating null byte, and B<fseek>(3) B<SEEK_END> is relative to the end of the buffer (i.e., the value specified by the I<size> argument), rather than the current string length.
ru: В версиях с 2.9 по 2.21 реализация B<fmemopen>() в glibc поддерживает «двоичный» режим, включаемый в I<mode> указанием вторым символа \(aqb\(aq. В этом режиме при записи не выполняется неявное добавление конечного байта null и B<fseek>(3) B<SEEK_END> считается относительно конца буфера (т. е., значения, указанного в аргументе I<size>), а не длины текущей строки.

source: An API bug afflicted the implementation of binary mode: to specify binary mode, the \(aqb\(aq must be the I<second> character in I<mode>. Thus, for example, "wb+" has the desired effect, but "w+b" does not. This is inconsistent with the treatment of I<mode> by B<fopen>(3).
ru: Дефект программного интерфейса перешёл и в реализацию двоичного режима: для задания двоичного режима \(aqb\(aq должен указываться I<вторым> символом в I<mode>. То есть, например, «wb+» сработает, а «w+b» — нет. Это не совпадает с трактовкой I<mode> в B<fopen>(3).

source: Binary mode was removed in glibc 2.22; a \(aqb\(aq specified in I<mode> has no effect.
ru: Двоичный режим удалён в glibc 2.22; указание \(aqb\(aq в I<mode> игнорируется.

source: In versions of glibc before 2.22, if I<size> is specified as zero, B<fmemopen>() fails with the error B<EINVAL>. It would be more consistent if this case successfully created a stream that then returned end-of-file on the first attempt at reading; since version 2.22, the glibc implementation provides that behavior.
ru: В glibc до версии 2.22, если I<size> равно нулю, то B<fmemopen>() завершается с ошибкой B<EINVAL>. Было бы логичней, если бы в этом случае успешно создавался поток, который затем бы возвращал конец файла при первой попытке его чтения; начиная с версии 2.22 реализация glibc поступает именно так.

source: In versions of glibc before 2.22, specifying append mode ("a" or "a+") for B<fmemopen>() sets the initial buffer position to the first null byte, but (if the current position is reset to a location other than the end of the stream) does not force subsequent writes to append at the end of the stream. This bug is fixed in glibc 2.22.
ru: В glibc до версии 2.22 указание в B<fmemopen>() режима добавления («a» или «a+») устанавливает начальное положение в буфере на первый байт null, но (если положение сбрасывается в расположение, отличное от конца потока) не заставляет последующие операции записи выполнять добавление в конец потока. Этот дефект исправлен в glibc 2.22.

source: In versions of glibc before 2.22, if the I<mode> argument to B<fmemopen>() specifies append ("a" or "a+"), and the I<size> argument does not cover a null byte in I<buf>, then, according to POSIX.1-2008, the initial buffer position should be set to the next byte after the end of the buffer. However, in this case the glibc B<fmemopen>() sets the buffer position to -1. This bug is fixed in glibc 2.22.
ru: В glibc до версии 2.22, если в аргументе I<mode> в B<fmemopen>() включено добавление («a» или «a+») и аргумент I<size> не учитывает байт null в I<buf>, то согласно POSIX.1-2008 начальное положение буфера должно указывать на следующий байт за концом буфера. Однако, в этом случае glibc B<fmemopen>() присваивает положению буфера значение -1. Этот дефект исправлен в glibc 2.22.

source: In versions of glibc before 2.22, when a call to B<fseek>(3) with a I<whence> value of B<SEEK_END> was performed on a stream created by B<fmemopen>(), the I<offset> was I<subtracted> from the end-of-stream position, instead of being added. This bug is fixed in glibc 2.22.
ru: В glibc до версии 2.22 при вызове B<fseek>(3) со значением I<whence>, равным B<SEEK_END>, и для потока, созданного B<fmemopen>(), значение I<offset> I<вычитается> из положения конца потока, а не добавляется. Этот дефект исправлен в glibc 2.22.

source: The glibc 2.9 addition of "binary" mode for B<fmemopen>() silently changed the ABI: previously, B<fmemopen>() ignored \(aqb\(aq in I<mode>.
ru: При дополнении B<fmemopen>() в glibc 2.9 «двоичным» режимом было потихоньку изменено ABI: раньше B<fmemopen>() игнорировала «b» в I<mode>.

source: The program below uses B<fmemopen>() to open an input buffer, and B<open_memstream>(3) to open a dynamically sized output buffer. The program scans its input string (taken from the program's first command-line argument) reading integers, and writes the squares of these integers to the output buffer. An example of the output produced by this program is the following:
ru: Программа, показанная ниже, использует B<fmemopen>() для открытия входного буфера и B<open_memstream>(3) для открытия выходного буфера с динамически изменяющимся размером. Программа сканирует входную строку (первый аргумент командной строки программы), читая целые числа, и записывает квадраты этих чисел в выходной буфер. Пример результата работы программы:

source: $B< ./a.out \(aq1 23 43\(aq> size=11; ptr=1 529 1849
ru: $B< ./a.out \(aq1 23 43\(aq> размер=11; ptr=1 529 1849

source: if (argc != 2) { fprintf(stderr, "Usage: %s \(aqE<lt>numE<gt>...\(aq\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s \(aqE<lt>numE<gt>...\(aq\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("size=%zu; ptr=%s\en", size, ptr);
ru: printf("размер=%zu; ptr=%s\en", size, ptr);

source: fgetpos, fseek, fsetpos, ftell, rewind - reposition a stream
ru: fgetpos, fseek, fsetpos, ftell, rewind - меняют положение в потоке
