Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: The following are also allowable: B<O_APPEND>, B<O_DSYNC>, B<O_NOATIME>, B<O_NONBLOCK>, and B<O_SYNC>. Specifying any other flag in I<event_f_flags> yields the error B<EINVAL> (but see BUGS).
ru: Также доступны следующие флаги: B<O_APPEND>, B<O_DSYNC>, B<O_NOATIME>, B<O_NONBLOCK> и B<O_SYNC>. Указание любых других флагов в I<event_f_flags>приводит к ошибке B<EINVAL> (но смотрите ДЕФЕКТЫ).

source: On success, B<fanotify_init>() returns a new file descriptor. On error, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<fanotify_init>() возвращает новый файловый дескриптор. При ошибке возвращается -1, и I<errno> устанавливается в соответствующее значение.

source: An invalid value was passed in I<flags> or I<event_f_flags>. B<FAN_ALL_INIT_FLAGS> (deprecated since Linux kernel version 4.20) defines all allowable bits for I<flags>.
ru: В I<flags> или I<event_f_flags> указано некорректное значение. Значение B<FAN_ALL_INIT_FLAGS> (устарело, начиная с версии ядра Linux 4.20) определяет все допустимые биты в I<flags>.

source: The number of fanotify groups for this user exceeds 128.
ru: Количество групп fanotify для этого пользователя превышает 128.

source: The per-process limit on the number of open file descriptors has been reached.
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: The allocation of memory for the notification group failed.
ru: Не удалось выделить память для группы уведомления.

source: This kernel does not implement B<fanotify_init>(). The fanotify API is available only if the kernel was configured with B<CONFIG_FANOTIFY>.
ru: В этом ядре не реализован B<fanotify_init>(). Программный интерфейс fanotify доступен только, если ядро было собрано с параметром B<CONFIG_FANOTIFY>.

source: The operation is not permitted because the caller lacks the B<CAP_SYS_ADMIN> capability.
ru: Операция запрещена, так как вызывающий не имеет мандата B<CAP_SYS_ADMIN>.

source: B<fanotify_init>() was introduced in version 2.6.36 of the Linux kernel and enabled in version 2.6.37.
ru: Вызов B<fanotify_init>() появился в версии 2.6.36 ядра Linux и был включён в версии 2.6.37.

source: The following bug was present in Linux kernels before version 3.18:
ru: В ядрах Linux до версии 3.18 существовали следующие дефекты:

source: The B<O_CLOEXEC> is ignored when passed in I<event_f_flags>.
ru: При передаче в I<event_f_flags> флаг B<O_CLOEXEC> игнорируется.

source: The following bug was present in Linux kernels before version 3.14:
ru: В ядрах Linux до версии 3.14 существовали следующие дефекты:

source: The I<event_f_flags> argument is not checked for invalid flags. Flags that are intended only for internal use, such as B<FMODE_EXEC>, can be set, and will consequently be set for the file descriptors returned when reading from the fanotify file descriptor.
ru: Значение аргумента I<event_f_flags> не проверяется на корректность флагов. Могут быть установлены флаги, предназначенные только для внутреннего использования, такие как B<FMODE_EXEC>, и в результате будут установлены для файловых дескрипторов при чтении из файлового дескриптора fanotify.

source: fallocate - manipulate file space
ru: fallocate - управление пространством файла

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>fcntl.hE<gt>>

source: This is a nonportable, Linux-specific system call. For the portable, POSIX.1-specified method of ensuring that space is allocated for a file, see B<posix_fallocate>(3).
ru: Это непереносимый системный вызов, существующий только в Linux. В POSIX.1 есть переносимый метод, обеспечивающий выделение пространства под файл (смотрите B<posix_fallocate>(3)).

source: B<fallocate>() allows the caller to directly manipulate the allocated disk space for the file referred to by I<fd> for the byte range starting at I<offset> and continuing for I<len> bytes.
ru: Вызов B<fallocate>() позволяет вызывающему напрямую управлять выделением дискового пространства под файл, на который указывает I<fd>, для байтового диапазона, начинающегося с I<offset> и имеющего длину I<len> байт.

source: The I<mode> argument determines the operation to be performed on the given range. Details of the supported operations are given in the subsections below.
ru: В аргументе I<mode> задаётся операция, выполняемая над указанным диапазоном. Детали о поддерживаемых операциях представлены в подразделах далее.

source: Allocating disk space
ru: Выделение дискового пространства

source: The default operation (i.e., I<mode> is zero) of B<fallocate>() allocates the disk space within the range specified by I<offset> and I<len>. The file size (as reported by B<stat>(2)) will be changed if I<offset>+I<len> is greater than the file size. Any subregion within the range specified by I<offset> and I<len> that did not contain data before the call will be initialized to zero. This default behavior closely resembles the behavior of the B<posix_fallocate>(3) library function, and is intended as a method of optimally implementing that function.
ru: По умолчанию (т. е. значение I<mode> равно нулю) B<fallocate>() выделяет место на диске в диапазоне, задаваемом I<offset> и I<len>. Размер файла (получаемый через B<stat>(2)) будет изменён, если I<offset>+I<len> больше чем размер файла. Любая подобласть внутри диапазона, заданного I<offset> и I<len>, которая не содержала данных до вызова, будет заполнена нулями. Такое поведение по умолчанию очень напоминает поведение библиотечной функции B<posix_fallocate>(3), и было введено для оптимальной реализации этой функции.

source: After a successful call, subsequent writes into the range specified by I<offset> and I<len> are guaranteed not to fail because of lack of disk space.
ru: После успешного выполнения вызова последующие операции записи в диапазон, указанный I<offset> и I<len>, гарантированно не завершатся с ошибкой из-за нехватки места на диске.

source: If the B<FALLOC_FL_KEEP_SIZE> flag is specified in I<mode>, the behavior of the call is similar, but the file size will not be changed even if I<offset>+I<len> is greater than the file size. Preallocating zeroed blocks beyond the end of the file in this manner is useful for optimizing append workloads.
ru: Если в I<mode> указан флаг B<FALLOC_FL_KEEP_SIZE>, то поведение по умолчанию почти то же, но размер файла не будет изменён даже, если I<offset>+I<len> больше чем размер файла. Это полезно для предварительного выделения блоков с нулями за концом файла для оптимизации загруженности при добавлении.

source: If the B<FALLOC_FL_UNSHARE> flag is specified in I<mode>, shared file data extents will be made private to the file to guarantee that a subsequent write will not fail due to lack of space. Typically, this will be done by performing a copy-on-write operation on all shared data in the file. This flag may not be supported by all filesystems.
ru: Если в I<mode>указан флаг B<FALLOC_FL_UNSHARE>, то общие файловые extent-данные будут сделаны частными для файла, чтобы гарантировать, что последующая запись не завершится ошибкой из-за нехватки места. Обычно, это выполняется с помощью операции копирования при записи для всех общих данных файла. Данный флаг может поддерживаться не во всех файловых системах.

source: Because allocation is done in block size chunks, B<fallocate>() may allocate a larger range of disk space than was specified.
ru: Так как выделение выполняется кусками размером с блок, B<fallocate>() может выделить больший диапазон дискового пространства, чем было указано.

source: Deallocating file space
ru: Освобождение файлового пространства

source: Specifying the B<FALLOC_FL_PUNCH_HOLE> flag (available since Linux 2.6.38) in I<mode> deallocates space (i.e., creates a hole) in the byte range starting at I<offset> and continuing for I<len> bytes. Within the specified range, partial filesystem blocks are zeroed, and whole filesystem blocks are removed from the file. After a successful call, subsequent reads from this range will return zeros.
ru: Указание флага B<FALLOC_FL_PUNCH_HOLE> (доступен, начиная с Linux 2.6.38) в I<mode> освобождает пространство (т.е., создаёт дыру) в диапазоне начиная с I<offset> и до I<len> байт. Внутри заданного диапазона неполные блоки файловой системы заполняются нулями, а полные блоки файловой системы удаляются из файла. После успешного выполнения вызова, последующие операции чтения из этого диапазона вернут нули.

source: The B<FALLOC_FL_PUNCH_HOLE> flag must be ORed with B<FALLOC_FL_KEEP_SIZE> in I<mode>; in other words, even when punching off the end of the file, the file size (as reported by B<stat>(2)) does not change.
ru: Флаг B<FALLOC_FL_PUNCH_HOLE> должен быть логически добавлен к флагу B<FALLOC_FL_KEEP_SIZE> в I<mode>; другими словами, даже когда пробивание (punching) выходит за конец файла, размер файла (получаемый с помощью B<stat>(2)) остаётся неизменным.

source: Not all filesystems support B<FALLOC_FL_PUNCH_HOLE>; if a filesystem doesn't support the operation, an error is returned. The operation is supported on at least the following filesystems:
ru: Не все файловые системы поддерживают B<FALLOC_FL_PUNCH_HOLE>; если файловая система не поддерживает эту операцию, то возвращается ошибка. Операция поддерживается, как минимум, следующими файловыми системами:

source: XFS (since Linux 2.6.38)
ru: XFS (начиная с Linux 2.6.38)

source: ext4 (since Linux 3.0)
ru: ext4 (начиная с Linux 3.0)

source: Btrfs (since Linux 3.7)
ru: Btrfs (начиная с Linux 3.7)

source: B<tmpfs>(5) (since Linux 3.5)"
ru: B<tmpfs>(5) (начиная с Linux 3.5)"

source: Collapsing file space
ru: Сворачивание (Collapsing) файлового пространства

source: Specifying the B<FALLOC_FL_COLLAPSE_RANGE> flag (available since Linux 3.15) in I<mode> removes a byte range from a file, without leaving a hole. The byte range to be collapsed starts at I<offset> and continues for I<len> bytes. At the completion of the operation, the contents of the file starting at the location I<offset+len> will be appended at the location I<offset>, and the file will be I<len> bytes smaller.
ru: Задание флага B<FALLOC_FL_COLLAPSE_RANGE> (доступен, начиная с Linux 3.15) в I<mode> приводит к удалению байтового диапазона из файла без создания дыры. Сворачиваемый диапазон байт начинается с I<offset> и длится I<len> байт. По завершению операции, содержимое файла, начиная с I<offset+len>, будет добавлено в расположение I<offset>, и файл будет на I<len> байт меньше.

source: A filesystem may place limitations on the granularity of the operation, in order to ensure efficient implementation. Typically, I<offset> and I<len> must be a multiple of the filesystem logical block size, which varies according to the filesystem type and configuration. If a filesystem has such a requirement, B<fallocate>() fails with the error B<EINVAL> if this requirement is violated.
ru: У файловой системы могут быть ограничения на детализацию операции, для большей эффективности реализации. Обычно, значения I<offset> и I<len> должны быть кратны размеру логического блока файловой системы, различающемуся в разных файловых системах и зависящему от настроек. Если файловая система содержит такое требование и оно нарушено, то B<fallocate>() завершается ошибкой B<EINVAL>.

source: If the region specified by I<offset> plus I<len> reaches or passes the end of file, an error is returned; instead, use B<ftruncate>(2) to truncate a file.
ru: Если область, заданная I<offset> плюс I<len> достигает или выходит за конец файла, то возвращается ошибка; вместо этого используйте B<ftruncate>(2) для обрезания файла.

source: No other flags may be specified in I<mode> in conjunction with B<FALLOC_FL_COLLAPSE_RANGE>.
ru: Вместе с B<FALLOC_FL_COLLAPSE_RANGE> другие флаги в I<mode> указывать нельзя.

source: As at Linux 3.15, B<FALLOC_FL_COLLAPSE_RANGE> is supported by ext4 (only for extent-based files) and XFS.
ru: В Linux 3.15 флаг B<FALLOC_FL_COLLAPSE_RANGE> поддерживается в ext4 (только для файлов на основе extent) и XFS.

source: Zeroing file space
ru: Зануление файлового пространства

source: Specifying the B<FALLOC_FL_ZERO_RANGE> flag (available since Linux 3.15) in I<mode> zeros space in the byte range starting at I<offset> and continuing for I<len> bytes. Within the specified range, blocks are preallocated for the regions that span the holes in the file. After a successful call, subsequent reads from this range will return zeros.
ru: Задание флага B<FALLOC_FL_ZERO_RANGE> (доступен, начиная с Linux 3.15) в I<mode> приводит к обнулению байтового диапазона, начиная с I<offset> и размером I<len> байт. Внутри указанного диапазона блоки выделяются заранее для областей, которые попадают в дыры в файле. После успешного выполнения вызова последующие операции чтения из этого диапазона будут возвращать нули.

source: Zeroing is done within the filesystem preferably by converting the range into unwritten extents. This approach means that the specified range will not be physically zeroed out on the device (except for partial blocks at the either end of the range), and I/O is (otherwise) required only to update metadata.
ru: Зануление, желательно, выполнять внутри файловой системы, преобразуя диапазон в незаписываемые extents. Этот подход означает, что указанный диапазон на устройстве в действительности не будет содержать нули на физическом уровне (за исключением неполных блоков в одном из концов диапазона), и ввод-вывод требуется только для обновления метаданных.

source: If the B<FALLOC_FL_KEEP_SIZE> flag is additionally specified in I<mode>, the behavior of the call is similar, but the file size will not be changed even if I<offset>+I<len> is greater than the file size. This behavior is the same as when preallocating space with B<FALLOC_FL_KEEP_SIZE> specified.
ru: Если в I<mode> также указан флаг B<FALLOC_FL_KEEP_SIZE>, то поведение вызова похоже, но размер файла не будет изменён даже, если I<offset>+I<len> больше размера файла. Такое поведение совпадает с предварительным выделением пространства с помощью указания флага B<FALLOC_FL_KEEP_SIZE>.

source: Not all filesystems support B<FALLOC_FL_ZERO_RANGE>; if a filesystem doesn't support the operation, an error is returned. The operation is supported on at least the following filesystems:
ru: Не все файловые системы поддерживают B<FALLOC_FL_ZERO_RANGE>; если файловая система не поддерживает эту операцию, то возвращается ошибка. Операция поддерживается, как минимум, следующими файловыми системами:

source: XFS (since Linux 3.15)
ru: XFS (начиная с Linux 3.15)

source: ext4, for extent-based files (since Linux 3.15)
ru: ext4, для файлов на основе extent (начиная с Linux 3.15)

source: SMB3 (since Linux 3.17)
ru: SMB3 (начиная с Linux 3.17)

source: Btrfs (since Linux 4.16)
ru: Btrfs (начиная с Linux 4.16)

source: Increasing file space
ru: Увеличение файлового пространства

source: Specifying the B<FALLOC_FL_INSERT_RANGE> flag (available since Linux 4.1) in I<mode> increases the file space by inserting a hole within the file size without overwriting any existing data. The hole will start at I<offset> and continue for I<len> bytes. When inserting the hole inside file, the contents of the file starting at I<offset> will be shifted upward (i.e., to a higher file offset) by I<len> bytes. Inserting a hole inside a file increases the file size by I<len> bytes.
ru: Задание флага B<FALLOC_FL_INSERT_RANGE> (доступен начиная с Linux 4.1) в I<mode> увеличивает файловое пространство посредством вставки дыры (hole) в размер файла без перезаписывания существующих данных. Дыра начинается с I<offset> и продолжается I<len> байт. При вставки дыры внутрь файла содержимое файла, начинающееся с I<offset>, будет сдвинуто вперёд (т. е., станет доступно по большему смещению в файле) на I<len> байт. Вставка дыры внутрь файла увеличивает размер файла на I<len> байт.

source: This mode has the same limitations as B<FALLOC_FL_COLLAPSE_RANGE> regarding the granularity of the operation. If the granularity requirements are not met, B<fallocate>() fails with the error B<EINVAL>. If the I<offset> is equal to or greater than the end of file, an error is returned. For such operations (i.e., inserting a hole at the end of file), B<ftruncate>(2) should be used.
ru: Данный режим имеет те же ограничения что и B<FALLOC_FL_COLLAPSE_RANGE>, независимо от детализации операции Если требования детализации не удовлетворяются, то B<fallocate>() завершается ошибкой B<EINVAL>. Если I<offset> больше или равно концу файла, то возвращается ошибка. Для таких операций (т. е., вставка дыры в конец файла) нужно использовать B<ftruncate>(2).

source: No other flags may be specified in I<mode> in conjunction with B<FALLOC_FL_INSERT_RANGE>.
ru: Вместе с B<FALLOC_FL_INSERT_RANGE> другие флаги в I<mode> указывать нельзя.

source: B<FALLOC_FL_INSERT_RANGE> requires filesystem support. Filesystems that support this operation include XFS (since Linux 4.1) and ext4 (since Linux 4.2).
ru: Для работы B<FALLOC_FL_INSERT_RANGE> требуется поддержка в файловой системе; сейчас это XFS (начиная с Linux 4.1) и ext4 (начиная с Linux 4.2).

source: On success, B<fallocate>() returns zero. On error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<fallocate>() возвращается 0; при ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: I<fd> is not a valid file descriptor, or is not opened for writing.
ru: Значение I<fd> не является допустимым файловым дескриптором или он не открыт на запись.

source: I<offset>+I<len> exceeds the maximum file size.
ru: Сумма I<offset>+I<len> превышает максимальный размер файла.

source: I<mode> is B<FALLOC_FL_INSERT_RANGE>, and the current file size+I<len> exceeds the maximum file size.
ru: В I<mode> указан B<FALLOC_FL_INSERT_RANGE>, и текущий размер файла+I<len> превышает максимальный файловый размер.

source: A signal was caught during execution; see B<signal>(7).
ru: При выполнении поступил сигнал; смотрите B<signal>(7).

source: I<offset> was less than 0, or I<len> was less than or equal to 0.
ru: Значение I<offset> меньше 0, или I<len> меньше или равно 0.

source: I<mode> is B<FALLOC_FL_COLLAPSE_RANGE> and the range specified by I<offset> plus I<len> reaches or passes the end of the file.
ru: Значение I<mode> равно B<FALLOC_FL_COLLAPSE_RANGE>, но диапазон, указанный в I<offset> плюс I<len>, достиг или перешагнул за конец файла.

source: I<mode> is B<FALLOC_FL_INSERT_RANGE> and the range specified by I<offset> reaches or passes the end of the file.
ru: Значение I<mode> равно B<FALLOC_FL_INSERT_RANGE>, но диапазон, указанный в I<offset>, достиг или перешагнул за конец файла.

source: I<mode> is B<FALLOC_FL_COLLAPSE_RANGE> or B<FALLOC_FL_INSERT_RANGE>, but either I<offset> or I<len> is not a multiple of the filesystem block size.
ru: Значение I<mode> равно B<FALLOC_FL_COLLAPSE_RANGE> или B<FALLOC_FL_INSERT_RANGE>, но значение I<offset> или I<len> не кратно размеру блока файловой системы.

source: I<mode> contains one of B<FALLOC_FL_COLLAPSE_RANGE> or B<FALLOC_FL_INSERT_RANGE> and also other flags; no other flags are permitted with B<FALLOC_FL_COLLAPSE_RANGE> or B<FALLOC_FL_INSERT_RANGE>.
ru: Значение I<mode> содержит B<FALLOC_FL_COLLAPSE_RANGE> или B<FALLOC_FL_INSERT_RANGE>, а также другие флаги; но с B<FALLOC_FL_COLLAPSE_RANGE> или B<FALLOC_FL_INSERT_RANGE> другие флаги указывать нельзя.

source: I<mode> is B<FALLOC_FL_COLLAPSE_RANGE> or B<FALLOC_FL_ZERO_RANGE> or B<FALLOC_FL_INSERT_RANGE>, but the file referred to by I<fd> is not a regular file.
ru: Значение I<mode> равно B<FALLOC_FL_COLLAPSE_RANGE>, B<FALLOC_FL_ZERO_RANGE> или B<FALLOC_FL_INSERT_RANGE>, но файл, на который указывает I<fd>, не является обычным файлом.

source: An I/O error occurred while reading from or writing to a filesystem.
ru: При чтении или записи в файловую систему произошла ошибка ввода-вывода.

source: I<fd> does not refer to a regular file or a directory. (If I<fd> is a pipe or FIFO, a different error results.)
ru: Значение I<fd> не указывает на обычный файл или каталог (если I<fd> — канал или FIFO, то возникнет другая ошибка).

source: There is not enough space left on the device containing the file referred to by I<fd>.
ru: Недостаточно дискового пространства на устройстве, на котором расположен файл, указанный в I<fd>.

source: This kernel does not implement B<fallocate>().
ru: В данном ядре вызов B<fallocate>() не реализован.

source: The filesystem containing the file referred to by I<fd> does not support this operation; or the I<mode> is not supported by the filesystem containing the file referred to by I<fd>.
ru: Файловая система с файлом, на который указывает I<fd>, не поддерживает данную операцию; или значение I<mode> не поддерживается файловой системой, в которой находится файл, на который указывает I<fd>.

source: The file referred to by I<fd> is marked immutable (see B<chattr>(1)).
ru: Файл, на который указывает I<fd>, помечен как неизменяемый (immutable) (смотрите B<chattr>(1)).

source: I<mode> specifies B<FALLOC_FL_PUNCH_HOLE> or B<FALLOC_FL_COLLAPSE_RANGE> or B<FALLOC_FL_INSERT_RANGE> and the file referred to by I<fd> is marked append-only (see B<chattr>(1)).
ru: Значение I<mode> равно B<FALLOC_FL_PUNCH_HOLE>, B<FALLOC_FL_COLLAPSE_RANGE> или B<FALLOC_FL_INSERT_RANGE> и файл, на который указывает I<fd>, помечен как только для добавления (смотрите B<chattr>(1)).

source: The operation was prevented by a file seal; see B<fcntl>(2).
ru: Выполнение операции предотвращено опечатыванием (file seal); смотрите B<fcntl>(2).

source: I<fd> refers to a pipe or FIFO.
ru: Значение I<fd> указывает на канал или FIFO.

source: I<mode> specifies B<FALLOC_FL_COLLAPSE_RANGE> or B<FALLOC_FL_INSERT_RANGE>, but the file referred to by I<fd> is currently being executed.
ru: Значение I<mode> равно B<FALLOC_FL_COLLAPSE_RANGE> или B<FALLOC_FL_INSERT_RANGE>, но файл, на который указывает I<fd>, в данный момент выполняется.

source: B<fallocate>() is available on Linux since kernel 2.6.23. Support is provided by glibc since version 2.10. The B<FALLOC_FL_*> flags are defined in glibc headers only since version 2.18.
ru: Вызов B<fallocate>() доступен в Linux начиная с ядра 2.6.23. Поддержка в glibc добавлена в версии 2.10. Флаги B<FALLOC_FL_*> определены в заголовочных файлах glibc только начиная с версии 2.18.

source: B<fallocate>() is Linux-specific.
ru: Вызов B<fallocate>() есть только в Linux.

source: ftpusers - list of users that may not log in via the FTP daemon
ru: ftpusers - список пользователей, не имеющих доступа к службе FTP

source: The text file B<ftpusers> contains a list of users that may not log in using the File Transfer Protocol (FTP) server daemon. This file is used not merely for system administration purposes but also for improving security within a TCP/IP networked environment.
ru: Текстовый файл B<ftpusers> содержит список пользователей, которые не могут войти на сервер по протоколу передачи файлов (FTP). Этот файл используется не только в целях администрирования системы, но и для улучшения безопасности в сетевой среде TCP/IP.

source: The B<ftpusers> file will typically contain a list of the users that either have no business using ftp or have too many privileges to be allowed to log in through the FTP server daemon. Such users usually include root, daemon, bin, uucp, and news.
ru: Обычно, файл B<ftpusers> содержит список пользователей, которые не пользуются ftp или имеют слишком много прав, позволяющих получить доступ через службу сервера FTP. Такими пользователями, обычно, являются root, daemon, bin, uucp и news.
