Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_UNLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>, B<FUTEX_WAIT_REQUEUE_PI>) A run-time check determined that the operation is not available. The PI-futex operations are not implemented on all architectures and are not supported on some CPU variants.
ru: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_UNLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>, B<FUTEX_WAIT_REQUEUE_PI>) Проверка во время выполнения обнаружила, что операция недоступна. Операции с PI-фьютексами реализованы не на всех архитектурах и не поддерживаются на некоторых моделях ЦП.

source: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) The caller is not allowed to attach itself to the futex at I<uaddr> (for B<FUTEX_CMP_REQUEUE_PI>: the futex at I<uaddr2>). (This may be caused by a state corruption in user space.)
ru: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) Вызывающему запрещено самостоятельно присоединяться к фьютексу по адресу I<uaddr> (для B<FUTEX_CMP_REQUEUE_PI>: фьютексу по адресу I<uaddr2>) (это может быть вызвано повреждением состояния в пользовательском пространстве).

source: (B<FUTEX_UNLOCK_PI>) The caller does not own the lock represented by the futex word.
ru: (B<FUTEX_UNLOCK_PI>) Вызывающему не принадлежит блокировка, представленная в слове фьютекса.

source: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) The thread ID in the futex word at I<uaddr> does not exist.
ru: (B<FUTEX_LOCK_PI>, B<FUTEX_TRYLOCK_PI>, B<FUTEX_CMP_REQUEUE_PI>) Идентификатор нити из слова фьютекса по адресу I<uaddr> не существует.

source: (B<FUTEX_CMP_REQUEUE_PI>) The thread ID in the futex word at I<uaddr2> does not exist.
ru: (B<FUTEX_CMP_REQUEUE_PI>) Идентификатор нити из слова фьютекса по адресу I<uaddr2> не существует.

source: The operation in I<futex_op> employed the timeout specified in I<timeout>, and the timeout expired before the operation completed.
ru: Операция в I<futex_op> использует время ожидания, указанное в I<timeout>, и время истекло до завершения операции.

source: Futexes were first made available in a stable kernel release with Linux 2.6.0.
ru: Фьютексы появились в стабильном ядре Linux версии 2.6.0.

source: Initial futex support was merged in Linux 2.5.7 but with different semantics from what was described above. A four-argument system call with the semantics described in this page was introduced in Linux 2.5.40. A fifth argument was added in Linux 2.5.70, and a sixth argument was added in Linux 2.6.7.
ru: Начальная поддержка фьютексов была встроена в Linux 2.5.7, но с другой семантикой, отличающейся от описанной выше. Семантика системного вызова с четырьмя аргументами, описанная в этой странице, появилась в Linux 2.5.40. Пятый аргумент была добавлен в Linux 2.5.70, а шестой аргумент был добавлен в Linux 2.6.7.

source: This system call is Linux-specific.
ru: Данный системный вызов есть только в Linux.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2).
ru: В glibc нет обёртки для данного системного вызова; запускайте его с помощью B<syscall>(2).

source: Several higher-level programming abstractions are implemented via futexes, including POSIX semaphores and various POSIX threads synchronization mechanisms (mutexes, condition variables, read-write locks, and barriers).
ru: На основе фьютексов было реализовано несколько высокоуровневых программных абстракций, например, семафоры POSIX и различные механизмы синхронизации нитей POSIX (мьютексы, переменные условий, блокировки чтения-записи и барьеры).

source: The program below demonstrates use of futexes in a program where a parent process and a child process use a pair of futexes located inside a shared anonymous mapping to synchronize access to a shared resource: the terminal. The two processes each write I<nloops> (a command-line argument that defaults to 5 if omitted) messages to the terminal and employ a synchronization protocol that ensures that they alternate in writing messages. Upon running this program we see output such as the following:
ru: В программе, показанной далее, показано использование фьютексов: родительский и дочерний процессы используют пару фьютексов, расположенных в общем анонимном отображении, для синхронизации доступа к общему ресурсу: терминалу. Каждый из процессов записывает I<nloops> (аргумент командной строки, если отсутствует, то 5) сообщений на терминал и использует протокол синхронизации, который гарантирует, что они записываются поочерёдно. Результат работы программы:

source: $ B<./futex_demo> Parent (18534) 0 Child (18535) 0 Parent (18534) 1 Child (18535) 1 Parent (18534) 2 Child (18535) 2 Parent (18534) 3 Child (18535) 3 Parent (18534) 4 Child (18535) 4
ru: $ B<./futex_demo> Родитель (18534) 0 Потомок (18535) 0 Родитель (18534) 1 Потомок (18535) 1 Родитель (18534) 2 Потомок (18535) 2 Родитель (18534) 3 Потомок (18535) 3 Родитель (18534) 4 Потомок (18535) 4

source: Usage: futex_demo [nloops] (Default: 5)
ru: Использование: futex_demo [nloops] (по умолчанию: 5)

source: Demonstrate the use of futexes in a program where parent and child use a pair of futexes located inside a shared anonymous mapping to synchronize access to a shared resource: the terminal. The two processes each write \(aqnum-loops\(aq messages to the terminal and employ a synchronization protocol that ensures that they alternate in writing messages. */ #define _GNU_SOURCE #include E<lt>stdio.hE<gt> #include E<lt>errno.hE<gt> #include E<lt>stdatomic.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>sys/mman.hE<gt> #include E<lt>sys/syscall.hE<gt> #include E<lt>linux/futex.hE<gt> #include E<lt>sys/time.hE<gt>
ru: Продемонстрировано использование фьютексов в программе, где родитель и потомок используют пару фьютексов, расположенных в общем анонимном отображении, для синхронизации доступа к общему ресурсу: терминалу. Каждый из процессов записывает I<num-loops> на терминал и использует протокол синхронизации, который гарантирует, что они выполняют запись поочерёдно. */ #define _GNU_SOURCE #include E<lt>stdio.hE<gt> #include E<lt>errno.hE<gt> #include E<lt>stdatomic.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>unistd.hE<gt> #include E<lt>sys/wait.hE<gt> #include E<lt>sys/mman.hE<gt> #include E<lt>sys/syscall.hE<gt> #include E<lt>linux/futex.hE<gt> #include E<lt>sys/time.hE<gt>

source: /* Acquire the futex pointed to by \(aqfutexp\(aq: wait for its value to become 1, and then set the value to 0. */
ru: /* Получить фьютекс, указанный \(aqfutexp\(aq: подождать пока его значение не станет 1, и изменить значение на 0. */

source: /* atomic_compare_exchange_strong(ptr, oldval, newval) atomically performs the equivalent of:
ru: /* atomic_compare_exchange_strong(ptr, oldval, newval) атомарно выполняет эквивалент кода:

source: It returns true if the test yielded true and *ptr was updated. */
ru: Она возвращает true, если тест вернул true и было обновлено *ptr.

source: /* Is the futex available? */ const int zero = 0; if (atomic_compare_exchange_strong(futexp, &zero, 1)) break; /* Yes */
ru: /* фьютекс доступен? */ const int zero = 0; if (atomic_compare_exchange_strong(futexp, &zero, 1)) break; /* да */

source: /* Futex is not available; wait */
ru: /* фьютекс недоступен, ждём */

source: /* Release the futex pointed to by \(aqfutexp\(aq: if the futex currently has the value 0, set its value to 1 and the wake any futex waiters, so that if the peer is blocked in fpost(), it can proceed. */
ru: /* Освобождаем фьютекс, указанный в \(aqfutexp\(aq: если значение фьютекса сейчас равно 0, то присваиваем ему 1 и пробуждаем ожидающий фьютекса, то есть, если вторая сторона заблокирована в fpost(), то она может продолжить работу. */

source: /* atomic_compare_exchange_strong() was described in comments above */
ru: /* atomic_compare_exchange_strong() описан в комментария выше */

source: /* Create a shared anonymous mapping that will hold the futexes. Since the futexes are being shared between processes, we subsequently use the "shared" futex operations (i.e., not the ones suffixed "_PRIVATE") */
ru: /* Создаём общее анонимное отображение, в котором будем хранить фьютексы. Так как фьютексы совместно используются процессами, воспользуемся операциями с «общими» фьютексами (т. е., без суффикса «_PRIVATE»). */

source: *futex1 = 0; /* State: unavailable */ *futex2 = 1; /* State: available */
ru: *futex1 = 0; /* Состояние: недоступен */ *futex2 = 1; /* Состояние: доступен */

source: /* Create a child process that inherits the shared anonymous mapping */
ru: /* Создаём дочерний процесс, который наследует общее анонимное отображение. */

source: if (childPid == 0) { /* Child */ for (j = 0; j E<lt> nloops; j++) { fwait(futex1); printf("Child (%ld) %d\en", (long) getpid(), j); fpost(futex2); }
ru: if (childPid == 0) { /* Child */ for (j = 0; j E<lt> nloops; j++) { fwait(futex1); printf("Потомок (%ld) %d\en", (long) getpid(), j); fpost(futex2); }

source: /* Parent falls through to here */
ru: /* предок попадает сюда */

source: for (j = 0; j E<lt> nloops; j++) { fwait(futex2); printf("Parent (%ld) %d\en", (long) getpid(), j); fpost(futex1); }
ru: for (j = 0; j E<lt> nloops; j++) { fwait(futex2); printf("Родитель (%ld) %d\en", (long) getpid(), j); fpost(futex1); }

source: The following kernel source files:
ru: Файлы из дерева исходного кода ядра:

source: Franke, H., Russell, R., and Kirwood, M., 2002. I<Fuss, Futexes and Furwocks: Fast Userlevel Locking in Linux> (from proceedings of the Ottawa Linux Symposium 2002),
ru: Franke, H., Russell, R., and Kirwood, M., 2002. I<Fuss, Futexes and Furwocks: Fast Userlevel Locking in Linux> (доклад на симпозиуме по Linux в 2002 году),

source: Hart, D.\& and Guniguntala, D., 2009. I<Requeue-PI: Making Glibc Condvars PI-Aware> (from proceedings of the 2009 Real-Time Linux Workshop), E<.UR http://lwn.net/images/conf/rtlws11/papers/proc/p10.pdf> E<.UE>
ru: Hart, D.\& и Guniguntala, D., 2009. I<Requeue-PI: Making Glibc Condvars PI-Aware> (доклад на Real-Time Linux Workshop в 2009 году), E<.UR http://lwn.net/images/conf/rtlws11/papers/proc/p10.pdf> E<.UE>

source: Futex example library, futex-*.tar.bz2 at
ru: Пример библиотеки futex, futex-*.tar.bz2, доступен на

source: futimesat - change timestamps of a file relative to a directory file descriptor
ru: futimesat - изменяет временные отметки файла, определяемого относительно файлового дескриптора каталога

source: B<#include E<lt>fcntl.hE<gt> /* Definition of AT_* constants */> B<#include E<lt>sys/time.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> /* определения констант AT_* */> B<#include E<lt>sys/time.hE<gt>>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: This system call is obsolete. Use B<utimensat>(2) instead.
ru: Данный системный вызов устарел. Используйте вместо него B<utimensat>(2).

source: The B<futimesat>() system call operates in exactly the same way as B<utimes>(2), except for the differences described in this manual page.
ru: Системный вызов B<futimesat>() работает также как системный вызов B<utimes>(2), за исключением случаев, описанных в данной справочной странице.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<utimes>(2) for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<utimes>(2)).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<utimes>(2)).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<utimes>(2)).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то I<dirfd> игнорируется.

source: On success, B<futimesat>() returns a 0. On error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<futimesat>() возвращает 0; при ошибке \(em -1, а в I<errno> задаётся причина ошибки.

source: The same errors that occur for B<utimes>(2) can also occur for B<futimesat>(). The following additional errors can occur for B<futimesat>():
ru: В B<futimesat>() могут возникнуть те же ошибки, что и в B<utimes>(2). Также, в B<futimesat>() могут возникнуть следующие ошибки:

source: I<dirfd> is not a valid file descriptor.
ru: I<dirfd> не является правильным файловым дескриптором.

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
ru: Значение I<pathname> содержит относительный путь и I<dirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог.

source: B<futimesat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Вызов B<futimesat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: This system call is nonstandard. It was implemented from a specification that was proposed for POSIX.1, but that specification was replaced by the one for B<utimensat>(2).
ru: Данный системный вызов не является стандартным. Он был реализован по спецификации POSIX.1, но она была заменена на B<utimensat>(2).

source: A similar system call exists on Solaris.
ru: Подобный системный вызов есть в Solaris.

source: Glibc notes
ru: Замечания по glibc

source: If I<pathname> is NULL, then the glibc B<futimesat>() wrapper function updates the times for the file referred to by I<dirfd>.
ru: Если I<pathname> равно NULL, то обёрточная функция glibc B<futimesat>() обновляет временные метки файла, указанного в I<dirfd>.

source: flock - apply or remove an advisory lock on an open file
ru: flock - устанавливает или снимает консультативную (advisory) блокировку на открытом файле

source: Apply or remove an advisory lock on the open file specified by I<fd>. The argument I<operation> is one of the following:
ru: Устанавливает или снимает консультативную блокировку на открытом файле, указанном в I<fd>. Аргумент I<operation> может содержать одно из следующих значений:

source: Place a shared lock. More than one process may hold a shared lock for a given file at a given time.
ru: Установить общую (shared) блокировку. Общую блокировку на заданный файл может удерживать более чем один процесс.

source: Place an exclusive lock. Only one process may hold an exclusive lock for a given file at a given time.
ru: Установить эксклюзивную (exclusive) блокировку. Только один процесс может удерживать эксклюзивную блокировку файла.

source: Remove an existing lock held by this process.
ru: Удалить существующую блокировку, удерживаемую данным процессом.

source: A call to B<flock>() may block if an incompatible lock is held by another process. To make a nonblocking request, include B<LOCK_NB> (by ORing) with any of the above operations.
ru: Вызов B<flock>() может быть блокирован, если несовместимый тип блокировки уже удерживается другим процессом. Чтобы выполнить неблокирующий запрос, добавьте B<LOCK_NB> (через операцию ИЛИ) к одному из вышеописанных значений.

source: A single file may not simultaneously have both shared and exclusive locks.
ru: Один файл не может иметь одновременно и общую и эксклюзивную блокировку.

source: Locks created by B<flock>() are associated with an open file description (see B<open>(2)). This means that duplicate file descriptors (created by, for example, B<fork>(2) or B<dup>(2)) refer to the same lock, and this lock may be modified or released using any of these file descriptors. Furthermore, the lock is released either by an explicit B<LOCK_UN> operation on any of these duplicate file descriptors, or when all such file descriptors have been closed.
ru: Блокировки, созданные B<flock>(), ассоциируются с дескриптором открытого файла (смотрите B<open>(2)). Это означает, что дублирующие файловые дескрипторы (созданные, например, вызовами B<fork>(2) или B<dup>(2)) указывают на одну блокировку, и эта блокировка может быть изменена или снята при использовании любого из этих файловых дескрипторов. Также, блокировка освобождается либо через явное выполнение операции B<LOCK_UN> на одном из дублирующих файловых дескрипторов, либо когда все такие файловые дескрипторы будут закрыты.

source: If a process uses B<open>(2) (or similar) to obtain more than one file descriptor for the same file, these file descriptors are treated independently by B<flock>(). An attempt to lock the file using one of these file descriptors may be denied by a lock that the calling process has already placed via another file descriptor.
ru: Если процесс использует B<open>(2) (или подобный вызов) для получения более одного файлового дескриптора на один и тот же файл, то эти файловые дескрипторы считаются B<flock>() независимыми. Попытка заблокировать файл с помощью одного из этих файловых дескрипторов может быть пресечена из-за блокировки, которую вызывающий процесс уже установил через другой файловый дескриптор.

source: A process may hold only one type of lock (shared or exclusive) on a file. Subsequent B<flock>() calls on an already locked file will convert an existing lock to the new lock mode.
ru: Процесс может удерживать на файле только один из типов блокировки (общую или эксклюзивную). Последующие вызовы B<flock>() на уже заблокированный файл будут преобразовывать текущую блокировку к новому заданному режиму блокировки.

source: Locks created by B<flock>() are preserved across an B<execve>(2).
ru: Блокировки, созданные B<flock>(), сохраняются при выполнении B<execve>(2).

source: A shared or exclusive lock can be placed on a file regardless of the mode in which the file was opened.
ru: Общая или эксклюзивная блокировка может быть установлена на файл вне зависимости от режима, в котором этот файл был открыт.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: I<fd> is not an open file descriptor.
ru: I<fd> не является открытым файловым дескриптором.

source: While waiting to acquire a lock, the call was interrupted by delivery of a signal caught by a handler; see B<signal>(7).
ru: При ожидании получения блокировки вызов был прерван сигналом, пришедшим в обработчик; см. B<signal>(7).

source: I<operation> is invalid.
ru: Неверное значение I<operation>.

source: The kernel ran out of memory for allocating lock records.
ru: Ядру не хватило памяти для создания записи блокировки.

source: The file is locked and the B<LOCK_NB> flag was selected.
ru: Файл блокирован и был указан флаг B<LOCK_NB>.

source: 4.4BSD (the B<flock>() call first appeared in 4.2BSD). A version of B<flock>(), possibly implemented in terms of B<fcntl>(2), appears on most UNIX systems.
ru: 4.4BSD (впервые вызов B<flock>() появился в 4.2BSD). Вызов B<flock>() есть в большинстве систем UNIX, возможно реализованный с помощью B<fcntl>(2).

source: Since kernel 2.0, B<flock>() is implemented as a system call in its own right rather than being emulated in the GNU C library as a call to B<fcntl>(2). With this implementation, there is no interaction between the types of lock placed by B<flock>() and B<fcntl>(2), and B<flock>() does not detect deadlock. (Note, however, that on some systems, such as the modern BSDs, B<flock>() and B<fcntl>(2) locks I<do> interact with one another.)
ru: Начиная с версии ядра 2.0, B<flock>() реализован как самостоятельный системный вызов, а не как эмуляция в библиотеке GNU C с помощью B<fcntl>(2). В этой реализации не существует никакого взаимодействия между типами блокировок, устанавливаемыми B<flock>() и B<fcntl>(2), и B<flock>() не обнаруживает взаимные блокировки (заметим, что в некоторых системах, таких как современные BSD, вызовы B<flock>() и B<fcntl>(2) блокирующие, при взаимодействии друг с другом).

source: B<flock>() places advisory locks only; given suitable permissions on a file, a process is free to ignore the use of B<flock>() and perform I/O on the file.
ru: B<flock>() устанавливает только консультативные блокировки; имея соответствующие права на файл, процесс может игнорировать использование B<flock>() и выполнять над файлом операции ввода/вывода.

source: B<flock>() and B<fcntl>(2) locks have different semantics with respect to forked processes and B<dup>(2). On systems that implement B<flock>() using B<fcntl>(2), the semantics of B<flock>() will be different from those described in this manual page.
ru: B<flock>() и B<fcntl>(2) имеют разную семантику для порождённых процессов и B<dup>(2). В системах, где реализован B<flock>() с помощью B<fcntl>(2), семантика B<flock>() будет отличаться от описанной в данной справочной странице.

source: Converting a lock (shared to exclusive, or vice versa) is not guaranteed to be atomic: the existing lock is first removed, and then a new lock is established. Between these two steps, a pending lock request by another process may be granted, with the result that the conversion either blocks, or fails if B<LOCK_NB> was specified. (This is the original BSD behavior, and occurs on many other implementations.)
ru: При преобразовании блокировки (общую в эксклюзивную или наоборот) не гарантируется атомарность операции: сначала существующая блокировка удаляется, а затем устанавливается новая. Между этими двумя действиями другой процесс, ожидающий запрос на блокировку, может получить на неё разрешение, в следствие чего преобразование или заблокируется, или завершится неудачно, если был указан флаг B<LOCK_NB> (это оригинальное поведение BSD встречается во многих других реализациях).

source: NFS details
ru: Особенности NFS

source: In Linux kernels up to 2.6.11, B<flock>() does not lock files over NFS (i.e., the scope of locks was limited to the local system). Instead, one could use B<fcntl>(2) byte-range locking, which does work over NFS, given a sufficiently recent version of Linux and a server which supports locking.
ru: В ядрах Linux вплоть до 2.6.11, B<flock>() не блокирует файлы через NFS (т. е., охват блокировки ограничен локальной системой). Вместо этого можно использовать байтовой диапазон блокировки B<fcntl>(2), который работает через NFS; появился в сравнительно новой версии Linux и серверах, поддерживающих блокировку.

source: Since Linux 2.6.12, NFS clients support B<flock>() locks by emulating them as B<fcntl>(2) byte-range locks on the entire file. This means that B<fcntl>(2) and B<flock>() locks I<do> interact with one another over NFS. It also means that in order to place an exclusive lock, the file must be opened for writing.
ru: Начиная с Linux 2.6.12, клиенты NFS поддерживают блокировки B<flock>(), посредством эмуляции через байтовые диапазоны блокировок B<fcntl>(2) на весь файл. Это означает, что блокировки B<fcntl>(2) и B<flock>() I<взаимодействуют> друг с другом через NFS. Также это означает, что для выполнения эксклюзивной блокировки файл должен быть открыт на запись.
