Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: The B<flockfile>() function waits for I<*filehandle> to be no longer locked by a different thread, then makes the current thread owner of I<*filehandle>, and increments the lockcount.
ru: Функция B<flockfile>() ожидает, пока I<*filehandle> не разблокируется другой нитью, затем делает текущую нить владельцем I<*filehandle> и увеличивает счётчик блокировок.

source: The B<funlockfile>() function decrements the lock count.
ru: Функция B<funlockfile>() уменьшает счётчик блокировок.

source: The B<ftrylockfile>() function is a nonblocking version of B<flockfile>(). It does nothing in case some other thread owns I<*filehandle>, and it obtains ownership and increments the lockcount otherwise.
ru: Функция B<ftrylockfile>() является неблокирующей версией B<flockfile>(). Она ничего не делает в том случае, если другая нить владеет I<*filehandle>, в противном случае устанавливает статус владельца и увеличивает счётчик блокировок.

source: The B<ftrylockfile>() function returns zero for success (the lock was obtained), and nonzero for failure.
ru: При успешном выполнении функция B<ftrylockfile>() возвращает ноль (была получена блокировка) или ненулевое значение при ошибках.

source: None.
ru: Нет.

source: These functions are available when B<_POSIX_THREAD_SAFE_FUNCTIONS> is defined.
ru: Эти функции доступны, если определено B<_POSIX_THREAD_SAFE_FUNCTIONS>.

source: fmin, fminf, fminl - determine minimum of two floating-point numbers
ru: fmin, fminf, fminl - определение минимального из двух чисел с плавающей запятой

source: These functions return the lesser value of I<x> and I<y>.
ru: Данные функции возвращают меньшее значение из I<x> и I<y>.

source: These functions return the minimum of I<x> and I<y>.
ru: Данные функции возвращают меньшее значение из I<x> и I<y>.

source: If one argument is a NaN, the other argument is returned.
ru: Если значение одного из аргументов равно NaN, то будет возвращено значение другого аргумента.

source: If both arguments are NaN, a NaN is returned.
ru: Если значение обоих аргументов равно NaN, то будет возвращено NaN.

source: fopencookie - opening a custom stream
ru: fopencookie - открывает нестандартный поток

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>stdio.hE<gt>>
ru: B<#define _GNU_SOURCE> /* см. feature_test_macros(7) */ B<#include E<lt>stdio.hE<gt>>

source: The B<fopencookie>() function allows the programmer to create a custom implementation for a standard I/O stream. This implementation can store the stream's data at a location of its own choosing; for example, B<fopencookie>() is used to implement B<fmemopen>(3), which provides a stream interface to data that is stored in a buffer in memory.
ru: Функция B<fopencookie>() позволяет программисту создать нестандартную реализацию стандартного потока ввода-вывода. Эта реализация может хранить данные потока в расположении по своему выбору; например, B<fopencookie>() используется для реализации функции B<fmemopen>(3), которая предоставляет потоковый интерфейс для данных, хранящихся в буфере в памяти.

source: In order to create a custom stream the programmer must:
ru: Для создания нестандартного потока программист должен:

source: Implement four "hook" functions that are used internally by the standard I/O library when performing I/O on the stream.
ru: Реализовать четыре «обрабатывающих» (hook) функции, которые используются внутри стандартной библиотеки ввода-вывода при операциях ввода-вывода над потоком.

source: Define a "cookie" data type, a structure that provides bookkeeping information (e.g., where to store data) used by the aforementioned hook functions. The standard I/O package knows nothing about the contents of this cookie (thus it is typed as I<void\ *> when passed to B<fopencookie>()), but automatically supplies the cookie as the first argument when calling the hook functions.
ru: Определить тип данных «cookie» — структуру для учёта информации (например, где хранятся данные), используемую вышеупомянутыми обрабатывающими функциями. Стандартный пакет ввода-вывода ничего не знает о содержимом этого cookie (к нему обращаются как к I<void\ *> при передаче в B<fopencookie>()), но автоматически передаёт cookie в первом аргументе при вызове обрабатывающих функций.

source: Call B<fopencookie>() to open a new stream and associate the cookie and hook functions with that stream.
ru: Вызвать B<fopencookie>() для открытия нового потока и связывания cookie и обрабатывающими функциями с этим потоком.

source: The B<fopencookie>() function serves a purpose similar to B<fopen>(3): it opens a new stream and returns a pointer to a I<FILE> object that is used to operate on that stream.
ru: Функция B<fopencookie>() подобна B<fopen>(3): она открывает новый поток и возвращает указатель на объект I<FILE>, который используется для работы с потоком.

source: The I<cookie> argument is a pointer to the caller's cookie structure that is to be associated with the new stream. This pointer is supplied as the first argument when the standard I/O library invokes any of the hook functions described below.
ru: Аргумент I<cookie> — это указатель на структуру cookie вызывающего, которая связывается с новым потоком. Данный указатель передаётся в первом аргументе в моменты, когда стандартная библиотека ввода-вывода вызывает одну из обрабатывающих функций, описанных ниже.

source: The I<mode> argument serves the same purpose as for B<fopen>(3). The following modes are supported: I<r>, I<w>, I<a>, I<r+>, I<w+>, and I<a+>. See B<fopen>(3) for details.
ru: Аргумент I<mode> служит той же цели что и для B<fopen>(3). Поддерживаются следующие режимы: I<r>, I<w>, I<a>, I<r+>, I<w+> и I<a+>. Подробности смотрите в B<fopen>(3).

source: The I<io_funcs> argument is a structure that contains four fields pointing to the programmer-defined hook functions that are used to implement this stream. The structure is defined as follows
ru: Аргумент I<io_funcs> — это структура, которая содержит четыре поля с задаваемыми программистом обрабатывающими функциями, которые используются для реализации этого потока. Структура определена как

source: The four fields are as follows:
ru: Поля:

source: This function implements read operations for the stream. When called, it receives three arguments:
ru: Эта функция реализует операции чтения из потока. Она вызывается с тремя аргументами:

source: The I<buf> and I<size> arguments are, respectively, a buffer into which input data can be placed and the size of that buffer. As its function result, the I<read> function should return the number of bytes copied into I<buf>, 0 on end of file, or -1 on error. The I<read> function should update the stream offset appropriately.
ru: Аргументы I<buf> и I<size> — буфер для получаемых данных и его размер. В качестве результата функция I<read> возвращает количество байт, скопированных в I<buf>, 0 — при окончании файла и -1 при ошибке. Функция I<read> обновляет смещение в потоке соответствующим образом.

source: If I<*read> is a null pointer, then reads from the custom stream always return end of file.
ru: Если значение I<*read> равно null, то при чтении из нестандартного потока всегда возвращается конец файла.

source: This function implements write operations for the stream. When called, it receives three arguments:
ru: Эта функция реализует операции записи в поток. Она вызывается с тремя аргументами:

source: The I<buf> and I<size> arguments are, respectively, a buffer of data to be output to the stream and the size of that buffer. As its function result, the I<write> function should return the number of bytes copied from I<buf>, or 0 on error. (The function must not return a negative value.) The I<write> function should update the stream offset appropriately.
ru: Аргументы I<buf> и I<size> — буфер для выходных данных и его размер (данные, записываемые в поток). В качестве результата функция I<write> возвращает количество байт, скопированных из I<buf>, и 0 при ошибке (функция не должна возвращать отрицательное значение). Функция I<write> обновляет смещение в потоке соответствующим образом.

source: If I<*write> is a null pointer, then output to the stream is discarded.
ru: Если значение I<*write> равно null, то вывод в поток отбрасывается.

source: This function implements seek operations on the stream. When called, it receives three arguments:
ru: Эта функция реализует операции смещения в потоке. Она вызывается с тремя аргументами:

source: The I<*offset> argument specifies the new file offset depending on which of the following three values is supplied in I<whence>:
ru: В аргументе I<*offset> указывается новое файловое смещение, зависящее от значения I<whence>:

source: The stream offset should be set I<*offset> bytes from the start of the stream.
ru: Значение смещения приравнивается I<*offset> байт от начала потока.

source: I<*offset> should be added to the current stream offset.
ru: Значение I<*offset> должно быть добавлено к текущему смещению в потоке.

source: The stream offset should be set to the size of the stream plus I<*offset>.
ru: Значение смещения приравнивается к размеру потока плюс I<*offset>.

source: Before returning, the I<seek> function should update I<*offset> to indicate the new stream offset.
ru: Перед возвратом функция I<seek> должна обновить I<*offset>, чтобы показать новое смещение в потоке.

source: As its function result, the I<seek> function should return 0 on success, and -1 on error.
ru: В качестве результата функция I<seek> должна возвращать 0 при успешном выполнении и -1 при ошибке.

source: If I<*seek> is a null pointer, then it is not possible to perform seek operations on the stream.
ru: Если значение I<*seek> равно null, то операции смещения в потоке выполнить невозможно.

source: This function closes the stream. The hook function can do things such as freeing buffers allocated for the stream. When called, it receives one argument:
ru: Эта функция закрывает поток. Обрабатывающая функция может выполнить такие операции как освобождение буферов, выделенных для потока. При вызове она принимает один аргумент:

source: The I<cookie> argument is the cookie that the programmer supplied when calling B<fopencookie>().
ru: Аргумент I<cookie> — это cookie, которую программист передал при вызове B<fopencookie>().

source: As its function result, the I<close> function should return 0 on success, and B<EOF> on error.
ru: В качестве результата функция I<close> должна возвращать 0 при успешном выполнении и B<EOF> при ошибке.

source: If I<*close> is NULL, then no special action is performed when the stream is closed.
ru: Если значение I<*close> равно NULL, то при закрытии потока не выполняется никаких действий.

source: On success B<fopencookie>() returns a pointer to the new stream. On error, NULL is returned.
ru: При успешном выполнении B<fopencookie>() возвращает указатель на новый поток. При ошибке возвращается NULL.

source: This function is a nonstandard GNU extension.
ru: Эта функция является нестандартным расширением GNU.

source: The program below implements a custom stream whose functionality is similar (but not identical) to that available via B<fmemopen>(3). It implements a stream whose data is stored in a memory buffer. The program writes its command-line arguments to the stream, and then seeks through the stream reading two out of every five characters and writing them to standard output. The following shell session demonstrates the use of the program:
ru: Программа, представленная ниже, реализует нестандартный поток, свойства которого похожи (но не одинаковы) на свойство потока, получаемого от B<fmemopen>(3). Она реализует поток, данные которого хранятся в буфере памяти. Программа записывает свои аргументы командной строки в поток, а затем перемещается по потоку, читая два из каждых пяти символов и записывая их в стандартный вывод. Сеанс оболочки, демонстрирующий использование программы:

source: $B< ./a.out \(aqhello world\(aq> /he/ / w/ /d/ Reached end of file
ru: $B< ./a.out \(aqhello world\(aq> /he/ / w/ /d/ Достигнут конец файла

source: Note that a more general version of the program below could be improved to more robustly handle various error situations (e.g., opening a stream with a cookie that already has an open stream; closing a stream that has already been closed).
ru: Заметим, что представленную версию можно сильно улучшить, добавив обработку ошибок (например, открытие потока с cookie, которая уже имеет открытый поток; закрытие потока, который уже был закрыт).

source: struct memfile_cookie { char *buf; /* Dynamically sized buffer for data */ size_t allocated; /* Size of buf */ size_t endpos; /* Number of characters in buf */ off_t offset; /* Current file offset in buf */ };
ru: struct memfile_cookie { char *buf; /* динамически изменяемый буфер для данных */ size_t allocated; /* размер буфера */ size_t endpos; /* количество символов в буфере */ off_t offset; /* текущее файловое смещение в буфере */ };

source: /* Buffer too small? Keep doubling size until big enough */
ru: /* Буфер мал? Удваиваем размер, пока не станет достаточным */

source: /* Fetch minimum of bytes requested and bytes available */
ru: /* Выбираем минимум запрашиваемых и доступных байт */

source: xbytes = size; if (cookie-E<gt>offset + size E<gt> cookie-E<gt>endpos) xbytes = cookie-E<gt>endpos - cookie-E<gt>offset; if (xbytes E<lt> 0) /* offset may be past endpos */ xbytes = 0;
ru: xbytes = size; if (cookie-E<gt>offset + size E<gt> cookie-E<gt>endpos) xbytes = cookie-E<gt>endpos - cookie-E<gt>offset; if (xbytes E<lt> 0) /* смещение может быть за endpos */ xbytes = 0;

source: /* Set up the cookie before calling fopencookie() */
ru: /* Устанавливаем cookie перед вызовом fopencookie() */

source: /* Write command-line arguments to our file */
ru: /* Записываем аргументы командной строки в файл */

source: /* Read two bytes out of every five, until EOF */
ru: /* Читаем два байта из пяти пока не получим EOF */

source: for (p = 0; ; p += 5) { if (fseek(stream, p, SEEK_SET) == -1) { perror("fseek"); exit(EXIT_FAILURE); } nread = fread(buf, 1, 2, stream); if (nread == -1) { perror("fread"); exit(EXIT_FAILURE); } if (nread == 0) { printf("Reached end of file\en"); break; }
ru: for (p = 0; ; p += 5) { if (fseek(stream, p, SEEK_SET) == -1) { perror("fseek"); exit(EXIT_FAILURE); } nread = fread(buf, 1, 2, stream); if (nread == -1) { perror("fread"); exit(EXIT_FAILURE); } if (nread == 0) { printf("Достигнут конец файла\en"); break; }

source: fgetpwent - get password file entry
ru: fgetpwent - получает записи из файла паролей

source: B<fgetpwent>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _SVID_SOURCE
ru: B<fgetpwent>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _SVID_SOURCE

source: The B<fgetpwent>() function returns a pointer to a structure containing the broken out fields of a line in the file I<stream>. The first time it is called it returns the first entry; thereafter, it returns successive entries. The file referred to by I<stream> must have the same format as I</etc/passwd> (see B<passwd>(5)).
ru: Функция B<fgetpwent>() возвращает указатель на структуру, содержащую отдельные поля строки файла I<stream>. Во время первого вызова функция возвращает первую запись; в дальнейшем она возвращает все последующие записи. Формат файла I<stream> должен быть таким же как у I</etc/passwd> (смотрите B<passwd>(5)).

source: The I<passwd> structure is defined in I<E<lt>pwd.hE<gt>> as follows:
ru: Структура I<passwd> определена в I<E<lt>pwd.hE<gt>> таким образом:

source: struct passwd { char *pw_name; /* username */ char *pw_passwd; /* user password */ uid_t pw_uid; /* user ID */ gid_t pw_gid; /* group ID */ char *pw_gecos; /* real name */ char *pw_dir; /* home directory */ char *pw_shell; /* shell program */ };
ru: struct passwd { char *pw_name; /* имя пользователя */ char *pw_passwd; /* пароль пользователя */ uid_t pw_uid; /* идентификатор пользователя */ gid_t pw_gid; /* идентификатор группы */ char *pw_gecos; /* настоящее имя */ char *pw_dir; /* домашний каталог */ char *pw_shell; /* программная оболочка */ };

source: The B<fgetpwent>() function returns a pointer to a I<passwd> structure, or NULL if there are no more entries or an error occurs. In the event of an error, I<errno> is set to indicate the cause.
ru: Функция B<fgetpwent>() возвращает указатель на структуру I<passwd> или NULL, если больше паролей не найдено или произошла ошибка. При ошибке I<errno> присваивается соответствующее значение.

source: Insufficient memory to allocate I<passwd> structure.
ru: Недостаточно памяти для структуры I<passwd>.

source: password database file
ru: файл, содержащий базу паролей

source: fcloseall - close all open streams
ru: fcloseall - закрытие всех открытых потоков

source: The B<fcloseall>() function closes all of the calling process's open streams. Buffered output for each stream is written before it is closed (as for B<fflush>(3)); buffered input is discarded.
ru: Функция B<fcloseall>() закрывает все открытые потоки вызвавшего процесса. Перед закрытием буферизированный вывод каждого потока записывается (как с B<fflush>(3)), а буферизированный ввод отбрасывается.

source: The standard streams, I<stdin>, I<stdout>, and I<stderr> are also closed.
ru: Стандартные потоки, I<stdin>, I<stdout> и I<stderr>, также закрываются.

source: This function returns 0 if all files were successfully closed; on error, B<EOF> is returned.
ru: Данная функция возвращает 0, если все файлы успешно закрыты, и B<EOF> в случае ошибки.

source: The B<fcloseall>() function does not lock the streams, so it is not thread-safe.
ru: Функция B<fcloseall>() не блокирует потоки, поэтому её нельзя использовать в нескольких нитях одновременно.

source: This function is a GNU extension.
ru: Эта функция является расширением GNU.

source: fread, fwrite - binary stream input/output
ru: fread, fwrite - ввод/вывод из двоичного потока

source: The function B<fread>() reads I<nmemb> items of data, each I<size> bytes long, from the stream pointed to by I<stream>, storing them at the location given by I<ptr>.
ru: Функция B<fread>() считывает I<nmemb> единиц данных (размер каждого I<size> байт) из потока, на который указывает I<stream>, и сохраняет их в расположение, на которое указывает I<ptr>.

source: The function B<fwrite>() writes I<nmemb> items of data, each I<size> bytes long, to the stream pointed to by I<stream>, obtaining them from the location given by I<ptr>.
ru: Функция B<fwrite>() записывает I<nmemb> единиц данных (размер каждого I<size> байт) в поток, на который указывает I<stream>, получая их из расположения, на которое указывает I<ptr>.

source: For nonlocking counterparts, see B<unlocked_stdio>(3).
ru: Неблокирующие аналоги смотрите в B<unlocked_stdio>(3).

source: On success, B<fread>() and B<fwrite>() return the number of items read or written. This number equals the number of bytes transferred only when I<size> is 1. If an error occurs, or the end of the file is reached, the return value is a short item count (or zero).
ru: При успешном выполнении функции B<fread>() и B<fwrite>() возвращают количество считанных или записанных единиц. Это количество равно количеству переданных байт только, если значение I<size> равно 1. В случае ошибки или по достижении конца файла возвращается меньшее количество единиц (или ноль).

source: B<fread>() does not distinguish between end-of-file and error, and callers must use B<feof>(3) and B<ferror>(3) to determine which occurred.
ru: Функция B<fread>() не отличает возникновение ошибки и достижения конца файла; для точного определения необходимо вызывать функции B<feof>(3) и B<ferror>(3).

source: fabs, fabsf, fabsl - absolute value of floating-point number
ru: fabs, fabsf, fabsl - вычисление абсолютного значения числа с плавающей точкой

source: These functions return the absolute value of the floating-point number I<x>.
ru: Эти функции возвращают абсолютное значение числа с плавающей точкой I<x>.

source: These functions return the absolute value of I<x>.
ru: Данные функции возвращают абсолютное значение I<x>.

source: If I<x> is a NaN, a NaN is returned.
ru: Если I<x> имеет значение NaN, будет возвращено NaN.

source: If I<x> is -0, +0 is returned.
ru: Если I<x> стремится к -0, будет возвращено +0.

source: If I<x> is negative infinity or positive infinity, positive infinity is returned.
ru: Если I<x> стремится к минус или плюс бесконечности, будет возвращена плюс бесконечность.

source: clearerr, feof, ferror, fileno - check and reset stream status
ru: clearerr, feof, ferror, fileno - проверка и сброс состояния потока

source: The function B<clearerr>() clears the end-of-file and error indicators for the stream pointed to by I<stream>.
ru: Функция B<clearerr>() очищает индикаторы конца файла и ошибки потока, указанного в I<stream>.

source: The function B<feof>() tests the end-of-file indicator for the stream pointed to by I<stream>, returning nonzero if it is set. The end-of-file indicator can be cleared only by the function B<clearerr>().
ru: Функция B<feof>() проверяет индикатор конца файла для потока, указанного в I<stream>, возвращая при этом ненулевое значение, если индикатор установлен. Индикатор конца файла может быть очищен только функцией B<clearerr>().

source: The function B<ferror>() tests the error indicator for the stream pointed to by I<stream>, returning nonzero if it is set. The error indicator can be reset only by the B<clearerr>() function.
ru: Функция B<ferror>() проверяет индикатор ошибки для потока, указанного в I<stream>, возвращая при этом ненулевое значение, если индикатор установлен. Индикатор ошибки может быть очищен только функцией B<clearerr>().

source: The function B<fileno>() examines the argument I<stream> and returns the integer file descriptor used to implement this stream. The file descriptor is still owned by I<stream> and will be closed when B<fclose>(3) is called. Duplicate the file descriptor with B<dup>(2) before passing it to code that might close it.
ru: Функция B<fileno>() исследует параметр I<stream> и возвращает целочисленный файловый дескриптор, который используется для реализации этого потока. Файловый дескриптор продолжает принадлежать I<stream> и будет закрыт при вызове B<fclose>(3). Сделайте копию файлового дескриптора с помощью B<dup>(2) перед передачей его коду, который может его закрыть.

source: These functions should not fail and do not set the external variable I<errno>. (However, in case B<fileno>() detects that its argument is not a valid stream, it must return -1 and set I<errno> to B<EBADF>.)
ru: Данные функции не должны завершаться с ошибкой и поэтому не устанавливают значение внешней переменной I<errno> (тем не менее, в случае с B<fileno>(), если аргумент не является корректным потоком, возвращается -1 и I<errno> приравнивается значение B<EBADF>).

source: The functions B<clearerr>(), B<feof>(), and B<ferror>() conform to C89, C99, POSIX.1-2001, and POSIX.1-2008.
ru: Функции B<clearerr>(), B<feof>() и B<ferror>() соответствует стандартам C89, C99, POSIX.1-2001 и POSIX.1-2008.

source: The function B<fileno>() conforms to POSIX.1-2001 and POSIX.1-2008.
ru: Функция B<fileno>() соответствует POSIX.1-2001 и POSIX.1-2008.

source: fgetc, fgets, getc, getchar, ungetc - input of characters and strings
ru: fgetc, fgets, getc, getchar, ungetc - функции для ввода символов и строк

source: B<fgetc>() reads the next character from I<stream> and returns it as an I<unsigned char> cast to an I<int>, or B<EOF> on end of file or error.
ru: Функция B<fgetc>() считывает очередной символ из потока I<stream> и возвращает I<unsigned char> преобразованный в I<int>, или B<EOF> при достижении конца файла или при возникновении ошибки.
