Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: full - always full device
ru: full - всегда полное устройство

source: CONFIGURATION
ru: НАСТРОЙКА

source: If your system does not have I</dev/full> created already, it can be created with the following commands:
ru: Если в системе нет файла I</dev/full>, то его можно создать при помощи следующих команд:

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The file I</dev/full> has major device number 1 and minor device number 7.
ru: Файл I</dev/full> имеет основной номер устройства, равный 1, и второстепенный, равный 7.

source: Writes to the I</dev/full> device fail with an B<ENOSPC> error. This can be used to test how a program handles disk-full errors.
ru: При записи в устройство I</dev/full> возвращается ошибка B<ENOSPC>. Это можно использовать для проверки обработки ошибки переполнения диска в программе.

source: Reads from the I</dev/full> device will return \e0 characters.
ru: При попытке чтения файла I</dev/full> будут возвращаться символы \e0.

source: Seeks on I</dev/full> will always succeed.
ru: Перемещение по I</dev/full> всегда выполняется успешно.

source: FILES
ru: ФАЙЛЫ

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: fd - floppy disk device
ru: fd - устройство для работы с дисководом

source: Floppy drives are block devices with major number 2. Typically they are owned by root:floppy (i.e., user root, group floppy) and have either mode 0660 (access checking via group membership) or mode 0666 (everybody has access). The minor numbers encode the device type, drive number, and controller number. For each device type (that is, combination of density and track count) there is a base minor number. To this base number, add the drive's number on its controller and 128 if the drive is on the secondary controller. In the following device tables, I<n> represents the drive number.
ru: Дисководы гибких дисков — блочные устройства со старшим номером 2. Обычно их владельцем является root.floppy (т.е. пользователь root, группа floppy), а права доступа к ним — 0660 (доступно членам группы) или 0666 (доступно всем). Младший номер определяется типом устройства, номером устройства, и номером контроллера. Для каждого типа устройства, то есть комбинации объёма и количества дорожек, существует базовый младший номер. К этому базовому номеру прибавьте номер устройства в пределах его контроллера и ещё 128, если дисковод подключен к вторичному контроллеру. В нижеследующих таблицах I<n> означает номер дисковода.

source: B<Warning: if you use formats with more tracks than supported by your drive, you may cause it mechanical damage.> Trying once if more tracks than the usual 40/80 are supported should not damage it, but no warranty is given for that. If you are not sure, don't create device entries for those formats, so as to prevent their usage.
ru: B<Предупреждение: Если вы используете формат дискет с большим числом дорожек, чем поддерживает ваш дисковод, вы можете вызвать механическое повреждение.> Однократная попытка поработать с числом дорожек больше обычных 40/80, не должна его повредить, но нет гарантии, что этого не произойдет. Если вы не уверены, не создавайте устройства для таких форматов, чтобы предотвратить их использование.

source: Drive-independent device files which automatically detect the media format and capacity:
ru: Файлы устройств, не зависящие от дисковода, которые автоматически определяют формат носителя и ёмкость диска:

source: Name
ru: Имя

source: Base
ru: Основной

source: minor #
ru: младший №

source: 5.25 inch double-density device files:
ru: Файлы устройств с носителями 5.25 дюймов с двойной плотностью:

source: Capacity
ru: Ёмкость

source: Cyl.
ru: Цил.

source: Sect.
ru: Сект.

source: Heads
ru: Головок

source: KiB
ru: КиБ

source: 5.25 inch high-density device files:
ru: Файлы устройств с носителями 5.25 дюйма и повышенной плотностью:

source: 3.5 inch double-density device files:
ru: Файлы устройств с носителями 3.5 дюйма и двойной плотностью:

source: 3.5 inch high-density device files:
ru: Файлы устройств с носителями 3.5 дюйма и повышенной плотностью:

source: 3.5 inch extra-density device files:
ru: Файлы устройств с носителями 3.5 дюйма и сверх плотностью:

source: B<fd> special files access the floppy disk drives in raw mode. The following B<ioctl>(2) calls are supported by B<fd> devices:
ru: Специальные файлы B<fd> обеспечивают доступ к дисководам в режиме без обработки (raw mode). Устройства B<fd> поддерживают следующие вызовы B<ioctl>(2):

source: clears the media information of a drive (geometry of disk in drive).
ru: Очищает информацию о носителе в дисководе (геометрию диска в дисководе).

source: sets the media information of a drive. The media information will be lost when the media is changed.
ru: Устанавливает информацию о носителе в дисководе. Информация о носителе потеряется, когда носитель будет сменён.

source: sets the media information of a drive (geometry of disk in drive). The media information will not be lost when the media is changed. This will disable autodetection. In order to reenable autodetection, you have to issue an B<FDCLRPRM>.
ru: Устанавливает информацию о носителе в дисководе (геометрию диска в дисководе). Информация о носителе не будет потеряна, когда носитель будет сменён. При этом автоопределение носителя будет выключено. Чтобы снова его включить, выполните B<FDCLRPRM>.

source: returns the type of a drive (name parameter). For formats which work in several drive types, B<FDGETDRVTYP> returns a name which is appropriate for the oldest drive type which supports this format.
ru: Возвращает тип дисковода (параметр имени). Для форматов, работающих на нескольких типах дисководов, B<FDGETDRVTYP> возвращает имя, соответствующее самому старому типу дисковода, который поддерживает данный формат.

source: invalidates the buffer cache for the given drive.
ru: Объявляет недействительными данные буферного кэша указанного привода.

source: sets the error thresholds for reporting errors, aborting the operation, recalibrating, resetting, and reading sector by sector.
ru: Устанавливает пороговые значения для сообщения об ошибках, остановки действий, перекалибровки, сброса в начальное состояние и посекторного чтения.

source: gets the current error thresholds.
ru: Возвращает текущие пороговые значения для ошибок.

source: gets the internal name of the drive.
ru: Возвращает внутреннее имя дисковода.

source: clears the write error statistics.
ru: Очищает статистику ошибок записи.

source: reads the write error statistics. These include the total number of write errors, the location and disk of the first write error, and the location and disk of the last write error. Disks are identified by a generation number which is incremented at (almost) each disk change.
ru: Читает статистику ошибок записи. Она включает общее число ошибок записи, расположение и диск, на котором произошла первая ошибка записи, и расположение и диск, на котором произошла последняя ошибка записи. Диски обозначаются генерирующимся числом, которое увеличивается на единицу при (почти) каждой смене диска.

source: Switch the drive motor off for a few microseconds. This might be needed in order to access a disk whose sectors are too close together.
ru: Выключает на несколько микросекунд мотор привода. Это может быть необходимо для получения доступа к диску, чьи сектора располагаются слишком близко друг к другу.

source: sets various drive parameters.
ru: Устанавливает различные параметры дисковода.

source: reads these parameters back.
ru: Возвращает различные параметры.

source: gets the cached drive state (disk changed, write protected et al.)
ru: Возвращает кэшированное состояние дисковода (диск сменён, защищён от записи и т. д.)

source: polls the drive and return its state.
ru: Обращается к дисководу и возвращает его состояние.

source: gets the floppy controller state.
ru: Возвращает состояние контроллера дисководов.

source: resets the floppy controller under certain conditions.
ru: Сбрасывает в начальное состояние контроллер дисководов при определённых условиях.

source: sends a raw command to the floppy controller.
ru: Посылает команду в необработанном виде (raw command) контроллеру дисководов.

source: For more precise information, consult also the I<E<lt>linux/fd.hE<gt>> and I<E<lt>linux/fdreg.hE<gt>> include files, as well as the B<floppycontrol>(1) manual page.
ru: За более точной информацией обратитесь также к файлам I<E<lt>linux/fd.hE<gt>> и I<E<lt>linux/fdreg.hE<gt>>, а также к справочной странице B<floppycontrol>(1).

source: NOTES
ru: ЗАМЕЧАНИЯ

source: The various formats permit reading and writing many types of disks. However, if a floppy is formatted with an inter-sector gap that is too small, performance may drop, to the point of needing a few seconds to access an entire track. To prevent this, use interleaved formats.
ru: Разные форматы позволяют читать и записывать многие типы дисков. Однако, если дискета отформатирована со слишком маленьким межсекторным промежутком, производительность может снизиться вплоть до того, что для доступа к дорожке может понадобиться несколько секунд. Во избежание этого, используйте перемежающиеся (interleaved) форматы.

source: It is not possible to read floppies which are formatted using GCR (group code recording), which is used by Apple II and Macintosh computers (800k disks).
ru: Невозможно прочитать дискеты, отформатированные с использованием GCR (групповая запись кодов), которые используются компьютерами Apple II и Macintosh (диски 800k).

source: Reading floppies which are hard sectored (one hole per sector, with the index hole being a little skewed) is not supported. This used to be common with older 8-inch floppies.
ru: Чтение аппаратно размеченных на секторы дискет (с отверстием на каждый сектор и слегка повернутым индексным отверстием) не поддерживается. Такими были старые 8-дюймовые дискеты.

source: fuse - Filesystem in Userspace (FUSE) device
ru: fuse - устройство файловой системы в пользовательском пространстве (FUSE)

source: SYNOPSIS
ru: ОБЗОР

source: This device is the primary interface between the FUSE filesystem driver and a user-space process wishing to provide the filesystem (referred to in the rest of this manual page as the I<filesystem daemon>). This manual page is intended for those interested in understanding the kernel interface itself. Those implementing a FUSE filesystem may wish to make use of a user-space library such as I<libfuse> that abstracts away the low-level interface.
ru: Это устройство является основным интерфейсом между драйвером файловой системы FUSE и процессом в пользовательском пространстве, который будет предоставлять файловую систему (далее здесь называется I<службой файловой системы> (filesystem daemon)). Данная справочная страница предназначена тому, кто заинтересован в понимании интерфейса самого ядра. Тем, кто реализует файловую систему FUSE, важнее описание библиотеки пользовательского пространства такой как I<libfuse>, которая скрывает низкоуровневый интерфейс.

source: At its core, FUSE is a simple client-server protocol, in which the Linux kernel is the client and the daemon is the server. After obtaining a file descriptor for this device, the daemon may B<read>(2) requests from that file descriptor and is expected to B<write>(2) back its replies. It is important to note that a file descriptor is associated with a unique FUSE filesystem. In particular, opening a second copy of this device, will not allow access to resources created through the first file descriptor (and vice versa).
ru: В основе FUSE лежит простой клиент-серверный протокол, в котором ядро Linux является клиентом, а служба — сервером. После получения файлового дескриптора этого устройства, служба может читать запросы с помощью B<read>(2) из этого файлового дескриптора и писать ответы с помощью B<write>(2). Важно отметить, что данный файловый дескриптор, связанный с файловой системой FUSE, является индивидуальным. В частности, открытие второй копии этого устройства не даст доступ к ресурсам, созданным через первый файловый дескриптор (и наоборот).

source: The basic protocol
ru: Основной протокол

source: Every message that is read by the daemon begins with a header described by the following structure:
ru: Каждое сообщение, читаемое службой, начинается с заголовка следующей структуры:

source: struct fuse_in_header { uint32_t len; /* Total length of the data, including this header */ uint32_t opcode; /* The kind of operation (see below) */ uint64_t unique; /* A unique identifier for this request */ uint64_t nodeid; /* ID of the filesystem object being operated on */ uint32_t uid; /* UID of the requesting process */ uint32_t gid; /* GID of the requesting process */ uint32_t pid; /* PID of the requesting process */ uint32_t padding; };
ru: struct fuse_in_header { uint32_t len; /* общая длина данных, включая этот заголовок */ uint32_t opcode; /* тип операции (смотрите ниже) */ uint64_t unique; /* уникальный идентификатор этого запроса */ uint64_t nodeid; /* ID объекта файловой системы, с которым выполняется действие */ uint32_t uid; /* UID запрашивающего процесса */ uint32_t gid; /* GID запрашивающего процесса */ uint32_t pid; /* PID запрашивающего процесса */ uint32_t padding; };

source: The header is followed by a variable-length data portion (which may be empty) specific to the requested operation (the requested operation is indicated by I<opcode>).
ru: После заголовка располагаются данные произвольной длины (их может и не быть), используемые вместе с запрашиваемой операцией (запрашиваемая операция указывается в I<opcode>).

source: The daemon should then process the request and if applicable send a reply (almost all operations require a reply; if they do not, this is documented below), by performing a B<write>(2) to the file descriptor. All replies must start with the following header:
ru: Служба обрабатывает запрос и, если нужен ответ (почти все операции требуют ответа; если нет, то это описано далее), выполняет запись с помощью B<write>(2) в файловый дескриптор. Все ответы должны начинаться со следующего заголовка:

source: struct fuse_out_header { uint32_t len; /* Total length of data written to the file descriptor */ int32_t error; /* Any error that occurred (0 if none) */ uint64_t unique; /* The value from the corresponding request */ };
ru: struct fuse_out_header { uint32_t len; /* общая длина данных, записываемых в файловый дескриптор */ int32_t error; /* возникшая ошибка (0, если нет) */ uint64_t unique; /* значение из соответствующего запроса */ };

source: This header is also followed by (potentially empty) variable-sized data depending on the executed request. However, if the reply is an error reply (i.e., I<error> is set), then no further payload data should be sent, independent of the request.
ru: После этого заголовка также располагаются данные произвольной длины (возможно их отсутствие), в зависимости от запроса. Однако, если ответ является ответом, содержащим ошибку, (т. е., I<error> не равно нулю), то дополнительных данных посылаться не должно, независимо от запроса.

source: Exchanged messages
ru: Расширенные сообщения

source: This section should contain documentation for each of the messages in the protocol. This manual page is currently incomplete, so not all messages are documented. For each message, first the struct sent by the kernel is given, followed by a description of the semantics of the message.
ru: В этом разделе должна быть документация по каждому сообщению протокола. Данная справочная страница не закончена, поэтому описаны не все сообщения. Для каждого сообщения сначала приводится структура, посылаемая ядром, после чего описывается семантика сообщения.

source: struct fuse_init_in { uint32_t major; uint32_t minor; uint32_t max_readahead; /* Since protocol v7.6 */ uint32_t flags; /* Since protocol v7.6 */ };
ru: struct fuse_init_in { uint32_t major; uint32_t minor; uint32_t max_readahead; /* начиная с протокола v7.6 */ uint32_t flags; /* начиная с протокола v7.6 */ };

source: This is the first request sent by the kernel to the daemon. It is used to negotiate the protocol version and other filesystem parameters. Note that the protocol version may affect the layout of any structure in the protocol (including this structure). The daemon must thus remember the negotiated version and flags for each session. As of the writing of this man page, the highest supported kernel protocol version is I<7.26>.
ru: Это первый запрос, посылаемый ядром службе. Он используется для согласования версии протокола и других параметров файловой системы. Заметим, что версия протокола может влиять на любую структуру протокола (включая эту). Служба должна запоминать согласованную версию и флаги для каждого сеанса. На момент написания этой справочной страницы наибольшей версией поддерживаемого ядром протокола была I<7.26>.

source: Users should be aware that the descriptions in this manual page may be incomplete or incorrect for older or more recent protocol versions.
ru: Пользователи должны учесть, что описания в этой справочной странице могут быть неполны или некорректны по отношению к старым или более новым версиям протокола.

source: The reply for this request has the following format:
ru: Ответ на этот запрос имеет следующий формат:

source: struct fuse_init_out { uint32_t major; uint32_t minor; uint32_t max_readahead; /* Since v7.6 */ uint32_t flags; /* Since v7.6; some flags bits were introduced later */ uint16_t max_background; /* Since v7.13 */ uint16_t congestion_threshold; /* Since v7.13 */ uint32_t max_write; /* Since v7.5 */ uint32_t time_gran; /* Since v7.6 */ uint32_t unused[9]; };
ru: struct fuse_init_out { uint32_t major; uint32_t minor; uint32_t max_readahead; /* Начиная с v7.6 */ uint32_t flags; /* Начиная с v7.6; некоторые биты флагов были введены позднее */ uint16_t max_background; /* Начиная с v7.13 */ uint16_t congestion_threshold; /* Начиная с v7.13 */ uint32_t max_write; /* Начиная с v7.5 */ uint32_t time_gran; /* Начиная с v7.6 */ uint32_t unused[9]; };

source: If the major version supported by the kernel is larger than that supported by the daemon, the reply shall consist of only I<uint32_t major> (following the usual header), indicating the largest major version supported by the daemon. The kernel will then issue a new B<FUSE_INIT> request conforming to the older version. In the reverse case, the daemon should quietly fall back to the kernel's major version.
ru: Если главная (major) версия, поддерживаемая ядром, больше чем поддерживаемая службой, то ответ должен содержать только I<uint32_t major> (как обычный заголовок), показывающий наибольшую главную версию, поддерживаемую службой. После этого ядро создаст новый запрос B<FUSE_INIT>, соответствующий более старой версии. В противном случае (то есть, если версия службы новее), служба должна переключиться на работу с главной версией ядра.

source: The negotiated minor version is considered to be the minimum of the minor versions provided by the daemon and the kernel and both parties should use the protocol corresponding to said minor version.
ru: Согласованной вспомогательной (minor) версией считается минимальная из вспомогательных версий, поддерживаемых службой и ядром, и обе стороны должны использовать протокол, соответствующий указанной вспомогательной версии.

source: struct fuse_getattr_in { uint32_t getattr_flags; uint32_t dummy; uint64_t fh; /* Set only if (getattr_flags & FUSE_GETATTR_FH) };
ru: struct fuse_getattr_in { uint32_t getattr_flags; uint32_t dummy; uint64_t fh; /* задаётся, только если (getattr_flags & FUSE_GETATTR_FH) };

source: The requested operation is to compute the attributes to be returned by B<stat>(2) and similar operations for the given file system object. The object for which the attributes should be computed is indicated either by I<header-E<gt>nodeid> or, if the I<FUSE_GETATTR_FH> flag is set, by the file handle I<fh>. The latter case of operation is analogous to B<fstat>(2).
ru: Операция запроса вычисления атрибутов, возвращаемых B<stat>(2) и подобными операциями для указанного объекта файловой системы. Объект, для которого вычисляются атрибуты, задаётся в виде I<header-E<gt>nodeid> или, если указан флаг I<FUSE_GETATTR_FH>, в виде файлового описателя (handle) I<fh>. Для последнего случая операция аналогична B<fstat>(2).

source: For performance reasons, these attributes may be cached in the kernel for a specified duration of time. While the cache timeout has not been exceeded, the attributes will be served from the cache and will not cause additional B<FUSE_GETATTR> requests.
ru: С целью оптимизации производительности, эти атрибуты могут кэшироваться в ядре на указанный период времени. Пока срок хранения кэша не истёк, атрибуты будут браться из кэша и дополнительные запросы B<FUSE_GETATTR> выполняться не будут.

source: The computed attributes and the requested cache timeout should then be returned in the following structure:
ru: Вычисленные атрибуты и срок хранения в кэше возвращаются в следующей структуре:

source: struct fuse_attr_out { /* Attribute cache duration (seconds + nanoseconds) */ uint64_t attr_valid; uint32_t attr_valid_nsec; uint32_t dummy; struct fuse_attr { uint64_t ino; uint64_t size; uint64_t blocks; uint64_t atime; uint64_t mtime; uint64_t ctime; uint32_t atimensec; uint32_t mtimensec; uint32_t ctimensec; uint32_t mode; uint32_t nlink; uint32_t uid; uint32_t gid; uint32_t rdev; uint32_t blksize; uint32_t padding; } attr; };
ru: struct fuse_attr_out { /* срок хранения атрибута в кэше (секунды + наносекунды) */ uint64_t attr_valid; uint32_t attr_valid_nsec; uint32_t dummy; struct fuse_attr { uint64_t ino; uint64_t size; uint64_t blocks; uint64_t atime; uint64_t mtime; uint64_t ctime; uint32_t atimensec; uint32_t mtimensec; uint32_t ctimensec; uint32_t mode; uint32_t nlink; uint32_t uid; uint32_t gid; uint32_t rdev; uint32_t blksize; uint32_t padding; } attr; };

source: If the I<default_permissions> mount options is not used, this request may be used for permissions checking. No reply data is expected, but errors may be indicated as usual by setting the I<error> field in the reply header (in particular, access denied errors may be indicated by returning B<-EACCES>).
ru: Если не используется параметр монтирования I<default_permissions>, то этот запрос можно использовать для проверки прав доступа. Данных в ответе не ожидается, но могут возвращаться ошибки, как обычно в поле I<error> заголовка ответа (в частности, при ошибках отказа в доступе может возвращаться B<-EACCES>).

source: B<FUSE_OPEN> and B<FUSE_OPENDIR>
ru: B<FUSE_OPEN> и B<FUSE_OPENDIR>

source: struct fuse_open_in { uint32_t flags; /* The flags that were passed to the open(2) */ uint32_t unused; };
ru: struct fuse_open_in { uint32_t flags; /* флаги, передаваемые в open(2) */ uint32_t unused; };

source: The requested operation is to open the node indicated by I<header-E<gt>nodeid>. The exact semantics of what this means will depend on the filesystem being implemented. However, at the very least the filesystem should validate that the requested I<flags> are valid for the indicated resource and then send a reply with the following format:
ru: Этот запрос открывает ноду, указанную в I<header-E<gt>nodeid>. Точна семантика будет зависеть от реализации в файловой системе. Однако, по крайней мере, файловая система должна проверить что запрашиваемые I<flags> корректны для указанного ресурса и затем послать ответ в следующем формате:
