Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: if (argc != 2) { fprintf(stderr, "Usage: %s MOUNT\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s ТОЧКА_МОНТИРОВАНИЯ\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("Press enter key to terminate.\en");
ru: printf("Нажмите enter для завершения работы.\en");

source: /* Create the file descriptor for accessing the fanotify API */
ru: /* Создаём файловый дескриптор для доступа к fanotify API */

source: /* Mark the mount for: - permission events before opening files - notification events after closing a write-enabled file descriptor */
ru: /* Помечаем точку монтирования для: - событий доступа перед открытием файлов - событий уведомления после закрытия файлового дескриптора для файла открытого для записи */

source: /* Prepare for polling */
ru: /* подготовка к опросу */

source: /* Console input */
ru: /* ввод с консоли */

source: /* Fanotify input */
ru: /* ввод из fanotify */

source: /* This is the loop to wait for incoming events */
ru: /* цикл ожидания входящих событий */

source: printf("Listening for events.\en");
ru: printf("Ожидание событий.\en");

source: while (1) { poll_num = poll(fds, nfds, -1); if (poll_num == -1) { if (errno == EINTR) /* Interrupted by a signal */ continue; /* Restart poll() */
ru: while (1) { poll_num = poll(fds, nfds, -1); if (poll_num == -1) { if (errno == EINTR) /* прервано сигналом */ continue; /* перезапуск poll() */

source: perror("poll"); /* Unexpected error */ exit(EXIT_FAILURE); }
ru: perror("poll"); /* неожиданная ошибка */ exit(EXIT_FAILURE); }

source: /* Console input is available: empty stdin and quit */
ru: /* доступен ввод с консоли: опустошаем stdin и выходим */

source: /* Fanotify events are available */
ru: /* доступны события fanotify */

source: printf("Listening for events stopped.\en"); exit(EXIT_SUCCESS); }
ru: printf("Ожидание событий прекращено.\en"); exit(EXIT_SUCCESS); }

source: Example program: fanotify_fid.c
ru: Программа-пример: fanotify_fid.c

source: The second program is an example of fanotify being used with B<FAN_REPORT_FID> enabled. The program marks the filesystem object that is passed as a command-line argument and waits until an event of type B<FAN_CREATE> has occurred. The event mask indicates which type of filesystem object\(emeither a file or a directory\(emwas created. Once all events have been read from the buffer and processed accordingly, the program simply terminates.
ru: Во второй программе показано как использовать fanotify с включённым B<FAN_REPORT_FID>. Программа помечает объект файловой системы, переданный в аргументе командной строки, и ждёт возникновения события с типом B<FAN_CREATE>. В маске событий задаётся какой тип объекта файловой системы ждать — файл или каталог. После того как все события из буфера будут прочитаны и правильно обработаны программа просто завершает работу.

source: The following shell sessions show two different invocations of this program, with different actions performed on a watched object.
ru: В следующих сеансах показано два разных запуска программы с разными выполняемыми действиями над наблюдаемым объектом.

source: The first session shows a mark being placed on I</home/user>. This is followed by the creation of a regular file, I</home/user/testfile.txt>. This results in a B<FAN_CREATE> event being created and reported against the file's parent watched directory object. Program execution ends once all events captured within the buffer have been processed. Program execution ends once all events captured within the buffer are processed.
ru: В первом сеансе ставится отметка на I</home/user>. После этого создаётся обычный файл I</home/user/testfile.txt>. В результате возникает событие B<FAN_CREATE>, в котором передаётсяобъект отслеживаемого родительского каталога файла. Программа завершает выполнение после обработки всех захваченных и помещённых в буфер событий.

source: # B<./fanotify_fid /home/user> Listening for events. FAN_CREATE (file created): Directory /home/user has been modified. All events processed successfully. Program exiting.
ru: # B<./fanotify_fid /home/user> Ожидание событий. FAN_CREATE (создан файл): Каталог /home/user изменён. Все события успешно обработаны. Завершение программы.

source: $ B<touch /home/user/testing> # In another terminal
ru: $ B<touch /home/user/testing> # в другом терминале

source: The second session shows a mark being placed on I</home/user>. This is followed by the creation of a directory, I</home/user/testdir>. This specific action results in the program producing a B<FAN_CREATE> and B<FAN_ONDIR> event.
ru: Во втором сеансе ставится отметка на I</home/user>. После этого создаётся каталог I</home/user/testdir>. В результате такого специального действия в программу передаются события B<FAN_CREATE> и B<FAN_ONDIR>.

source: # B<./fanotify_fid /home/user> Listening for events. FAN_CREATE | FAN_ONDIR (subdirectory created): Directory /home/user has been modified. All events processed successfully. Program exiting.
ru: # B<./fanotify_fid /home/user> Ожидание событий. FAN_CREATE | FAN_ONDIR (создан подкаталог): Каталог /home/user изменён. Все события успешно обработаны. Завершение программы.

source: $ B<mkdir -p /home/user/testing> # In another terminal
ru: $ B<mkdir -p /home/user/testing> # в другом терминале

source: Program source: fanotify_fid.c
ru: Исходный код программы: fanotify_fid.c

source: if (argc != 2) { fprintf(stderr, "Invalid number of command line arguments.\en"); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Некорректное количество аргументов в командной строке.\en"); exit(EXIT_FAILURE); }

source: /* Create an fanotify file descriptor with FAN_REPORT_FID as a flag so that program can receive fid events. */
ru: /* создаём файловый дескриптор fanotify с флагом FAN_REPORT_FID для того, чтобы программа могла принимать события fid. */

source: /* Place a mark on the filesystem object supplied in argv[1]. */
ru: /* ставим метку на объект файловой системы, заданный в argv[1]. */

source: /* Read events from the event queue into a buffer */
ru: /* читаем события из очереди событий в буфер */

source: /* Process all events within the buffer */
ru: /* обрабатываем все события в буфере */

source: /* Ensure that the event info is of the correct type */
ru: /* проверим, что информация о событии правильного типа */

source: if (fid-E<gt>hdr.info_type != FAN_EVENT_INFO_TYPE_FID) { fprintf(stderr, "Received unexpected event info type.\en"); exit(EXIT_FAILURE); }
ru: if (fid-E<gt>hdr.info_type != FAN_EVENT_INFO_TYPE_FID) { fprintf(stderr, "Получена информация о событии неожидаемого типа.\en"); exit(EXIT_FAILURE); }

source: if (metadata-E<gt>mask == FAN_CREATE) printf("FAN_CREATE (file created):");
ru: if (metadata-E<gt>mask == FAN_CREATE) printf("FAN_CREATE (создан файл):");

source: if (metadata-E<gt>mask == FAN_CREATE | FAN_ONDIR) printf("FAN_CREATE | FAN_ONDIR (subdirectory created):");
ru: if (metadata-E<gt>mask == FAN_CREATE | FAN_ONDIR) printf("FAN_CREATE | FAN_ONDIR (создан подкаталог):");

source: /* metadata-E<gt>fd is set to FAN_NOFD when FAN_REPORT_FID is enabled. To obtain a file descriptor for the file object corresponding to an event you can use the struct file_handle that\(aqs provided within the fanotify_event_info_fid in conjunction with the open_by_handle_at(2) system call. A check for ESTALE is done to accommodate for the situation where the file handle for the object was deleted prior to this system call. */
ru: /* metadata-E<gt>fd присваивается FAN_NOFD, если включён FAN_REPORT_FID. Чтобы получить файловый дескриптор для файлового объекта, соответствующего событию, можно использовать struct file_handle, которая находится внутри fanotify_event_info_fid и системный вызов open_by_handle_at(2). Проверка на ESTALE нужна, чтобы учесть ситуацию, когда файловый описатель для объекта был удалён до этого системного вызова. */

source: event_fd = open_by_handle_at(AT_FDCWD, file_handle, O_RDONLY); if (ret == -1) { if (errno == ESTALE) { printf("File handle is no longer valid. " "File has been deleted\en"); continue; } else { perror("open_by_handle_at"); exit(EXIT_FAILURE); } }
ru: event_fd = open_by_handle_at(AT_FDCWD, file_handle, O_RDONLY); if (ret == -1) { if (errno == ESTALE) { printf("Обработчик файл более недействителен. " "Файл был удалён\en"); continue; } else { perror("open_by_handle_at"); exit(EXIT_FAILURE); } }

source: /* Retrieve and print the path of the modified dentry */
ru: /* получаем и выводим путь изменённой dentry */

source: path[path_len] = \(aq\e0\(aq; printf("\etDirectory \(aq%s\(aq has been modified.\en", path);
ru: path[path_len] = \(aq\e0\(aq; printf("\etКаталог \(aq%s\(aq изменён.\en", path);

source: /* Close associated file descriptor for this event */
ru: /* закрываем связанный файловый дескриптор этого события */

source: printf("All events processed successfully. Program exiting.\en"); exit(EXIT_SUCCESS); }
ru: printf("Все события успешно обработаны. Завершение программы.\en"); exit(EXIT_SUCCESS); }

source: feature_test_macros - feature test macros
ru: feature_test_macros - макросы тестирования свойств

source: Feature test macros allow the programmer to control the definitions that are exposed by system header files when a program is compiled.
ru: Макросы тестирования свойств позволяют программисту контролировать какие определения будут доступны из системных заголовочных файлов при компиляции программы.

source: B<NOTE:> In order to be effective, a feature test macro I<must be defined before including any header files>. This can be done either in the compilation command (I<cc -DMACRO=value>) or by defining the macro within the source code before including any headers. The requirement that the macro must be defined before including any header file exists because header files may freely include one another. Thus, for example, in the following lines, defining the B<_GNU_SOURCE> macro may have no effect because the header I<E<lt>abc.hE<gt>> itself includes I<E<lt>xyz.hE<gt>> (POSIX explicitly allows this):
ru: B<ЗАМЕЧАНИЕ:> В целях эффективности, макрос тестирования свойств I<должен быть определён до включения всех заголовочных файлов>. Это можно сделать или в команде компиляции (I<cc -DМАКРОС=значение>) или определив макрос в исходном коде до включения заголовочных файлов. Требование включения макроса раньше остальных заголовочных файлов возникло из-за того, что заголовочные файлы могут включаться друг в друга в любой последовательности. Например, в следующих строках определение макроса B<_GNU_SOURCE> может не сработать, так как заголовок I<E<lt>abc.hE<gt>> сам включает I<E<lt>xyz.hE<gt>> (в POSIX это разрешается явным образом):

source: Some feature test macros are useful for creating portable applications, by preventing nonstandard definitions from being exposed. Other macros can be used to expose nonstandard definitions that are not exposed by default.
ru: Некоторые макросы тестирования свойств полезны для создания переносимых приложений; они позволяют блокировать нестандартные определения. Другие макросы можно использовать для разблокировки нестандартных определений, которые по умолчанию недоступны.

source: The precise effects of each of the feature test macros described below can be ascertained by inspecting the I<E<lt>features.hE<gt>> header file. B<Note>: applications do I<not> need to directly include I<E<lt>features.hE<gt>>; indeed, doing so is actively discouraged. See NOTES.
ru: Действие каждого макроса тестирования свойств, описанного далее, можно узнать из содержимого заголовочного файла I<E<lt>features.hE<gt>>. B<Замечание>: в приложениях I<не> нужно явно включать I<E<lt>features.hE<gt>> — это не приветствуется. Смотрите ЗАМЕЧАНИЯ.

source: Specification of feature test macro requirements in manual pages
ru: Обозначение макросов тестирования свойств в справочных страницах

source: When a function requires that a feature test macro is defined, the manual page SYNOPSIS typically includes a note of the following form (this example from the B<acct>(2) manual page):
ru: Когда функции требуется определение макроса тестирования свойств в ОБЗОРЕ справочной страницы, обычно, содержится упоминание в следующем виде (этот пример взят из справочной страницы B<acct>(2)):

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: The B<||> means that in order to obtain the declaration of B<acct>(2) from I<E<lt>unistd.hE<gt>>, I<either> of the following macro definitions must be made before including any header files:
ru: Символ B<||> означает, что для получения объявления B<acct>(2) из I<E<lt>unistd.hE<gt>> нужно определить I<любой> из следующих макросов до включения любых заголовочных файлов:

source: #define _BSD_SOURCE #define _XOPEN_SOURCE /* or any value E<lt> 500 */
ru: #define _BSD_SOURCE #define _XOPEN_SOURCE /* или любое значение E<lt> 500 */

source: Alternatively, equivalent definitions can be included in the compilation command:
ru: Или же эквивалентные определения могут быть включены следующей командой компиляции:

source: cc -D_BSD_SOURCE cc -D_XOPEN_SOURCE # Or any value E<lt> 500
ru: cc -D_BSD_SOURCE cc -D_XOPEN_SOURCE # или любое значение E<lt> 500

source: Note that, as described below, B<some feature test macros are defined by default>, so that it may not always be necessary to explicitly specify the feature test macro(s) shown in the SYNOPSIS.
ru: Как описывается далее, B<некоторые макросы тестирования свойств определяются по умолчанию>, поэтому макрос не всегда нужно указывать явно даже, если он приведён в ОБЗОРЕ.

source: In a few cases, manual pages use a shorthand for expressing the feature test macro requirements (this example from B<readahead>(2)):
ru: В некоторых случаях в справочных страницах используется сокращённая запись требований макросов тестирования свойств (пример из B<readahead>(2)):

source: This format is employed in cases where only a single feature test macro can be used to expose the function declaration, and that macro is not defined by default.
ru: Такой формат употребляется в случаях, когда достаточно одного макроса для получения объявления функции, и этот макрос не определён по умолчанию.

source: Feature test macros understood by glibc
ru: Макросы тестирования свойств, распознаваемые glibc

source: The paragraphs below explain how feature test macros are handled in Linux glibc 2.I<x>, I<x> E<gt> 0.
ru: В следующих параграфах описаны макросы тестирования свойств, управляющие Linux glibc 2.I<x>, где I<x> E<gt> 0.

source: First, though a summary of a few details for the impatient:
ru: Если кратко:

source: The macros that you most likely need to use in modern source code are B<_POSIX_C_SOURCE> (for definitions from various versions of POSIX.1), B<_XOPEN_SOURCE> (for definitions from various versions of SUS), B<_GNU_SOURCE> (for GNU and/or Linux specific stuff), and B<_DEFAULT_SOURCE> (to get definitions that would normally be provided by default).
ru: Макросы, которые вам, вероятно, понадобится использовать в современном коде: B<_POSIX_C_SOURCE> (определения из различных версий POSIX.1), B<_XOPEN_SOURCE> (определения из различных версий SUS), B<_GNU_SOURCE> (специальные возможности GNU и/или Linux) и B<_DEFAULT_SOURCE> (определения, которые, обычно, включены по умолчанию).

source: Certain macros are defined with default values. Thus, although one or more macros may be indicated as being required in the SYNOPSIS of a man page, it may not be necessary to define them explicitly. Full details of the defaults are given later in this man page.
ru: Некоторые макросы определяют значения по умолчанию. То есть, хотя один или более макросов могут быть указаны как необходимые в ОБЗОР справочной страницы, возможно необязательно определять их явно. Полное описание значений по умолчанию приведены далее в этой справочной странице.

source: Defining B<_XOPEN_SOURCE> with a value of 600 or greater produces the same effects as defining B<_POSIX_C_SOURCE> with a value of 200112L or greater. Where one sees
ru: Определение B<_XOPEN_SOURCE> со значением 600 и более даёт тот же эффект что и определение B<_POSIX_C_SOURCE> со значением 200112L и больше. Если требуется

source: in the feature test macro requirements in the SYNOPSIS of a man page, it is implicit that the following has the same effect:
ru: в макросах тестирования свойств ОБЗОРА справочной страницы, то это неявным образом тоже что и:

source: Defining B<_XOPEN_SOURCE> with a value of 700 or greater produces the same effects as defining B<_POSIX_C_SOURCE> with a value of 200809L or greater. Where one sees
ru: Определение B<_XOPEN_SOURCE> со значением 700 и более даёт тот же эффект что и определение B<_POSIX_C_SOURCE> со значением 200809L и больше. Если требуется

source: Linux glibc understands the following feature test macros:
ru: В Linux glibc распознаются следующие макросы тестирования свойств:

source: ISO Standard C. This macro is implicitly defined by B<gcc>(1) when invoked with, for example, the I<-std=c99> or I<-ansi> flag.
ru: Стандарт ISO C. Этот макрос неявно определяется компилятором B<gcc>(1), если он вызывается с флагом I<-std=c99> или I<-ansi>.

source: Defining this macro causes header files to expose definitions as follows:
ru: При определении этого макроса из заголовочных файлов становится доступно следующее:

source: The value 1 exposes definitions conforming to POSIX.1-1990 and ISO C (1990).
ru: При значении 1 доступны определения, удовлетворяющие POSIX.1-1990 и ISO C (1990).

source: The value 2 or greater additionally exposes definitions for POSIX.2-1992.
ru: При значении 2 и более дополнительно доступны определения, удовлетворяющие POSIX.2-1992.

source: The value 199309L or greater additionally exposes definitions for POSIX.1b (real-time extensions).
ru: При значении 199309L и более дополнительно доступны определения, удовлетворяющие POSIX.1b (расширения для реального времени).

source: The value 199506L or greater additionally exposes definitions for POSIX.1c (threads).
ru: При значении 199506L и более дополнительно доступны определения, удовлетворяющие POSIX.1c (нити).

source: (Since glibc 2.3.3) The value 200112L or greater additionally exposes definitions corresponding to the POSIX.1-2001 base specification (excluding the XSI extension). This value also causes C95 (since glibc 2.12) and C99 (since glibc 2.10) features to be exposed (in other words, the equivalent of defining B<_ISOC99_SOURCE>).
ru: (начиная с glibc 2.3.3) При значении 200112L и более доступны определения, удовлетворяющие базовой спецификации POSIX.1-2001 (за исключением расширения XSI) а также свойства C95 (начиная с glibc 2.12) и C99 (начиная с glibc 2.10). Другими словами это эквивалент определения B<_ISOC99_SOURCE>.

source: (Since glibc 2.10) The value 200809L or greater additionally exposes definitions corresponding to the POSIX.1-2008 base specification (excluding the XSI extension).
ru: (начиная с glibc 2.10) При значении 200809L и более доступны определения, удовлетворяющие базовой спецификации POSIX.1-2008 (за исключением расширения XSI).

source: Defining this obsolete macro with any value is equivalent to defining B<_POSIX_C_SOURCE> with the value 1.
ru: Определение этого устаревшего макроса с любым значением эквивалентно определению B<_POSIX_C_SOURCE> со значением 1.

source: Since this macro is obsolete, its usage is generally not documented when discussing feature test macro requirements in the man pages.
ru: Так как этот макрос устарел, его использование, обычно, не описывается при обсуждении требований макросов тестирования свойств в справочной странице.

source: Defining with any value exposes definitions conforming to POSIX.1, POSIX.2, and XPG4.
ru: Определение с любым значением делает доступным определения, удовлетворяющие POSIX.1, POSIX.2 и XPG4.

source: The value 500 or greater additionally exposes definitions for SUSv2 (UNIX 98).
ru: При значении 500 и более дополнительно доступны определения, удовлетворяющие SUSv2 (UNIX 98).

source: (Since glibc 2.2) The value 600 or greater additionally exposes definitions for SUSv3 (UNIX 03; i.e., the POSIX.1-2001 base specification plus the XSI extension) and C99 definitions.
ru: (начиная с glibc 2.2) При значении 600L и более дополнительно доступны определения, удовлетворяющие SUSv3 (UNIX 03; т. е., базовой спецификации POSIX.1-2001 плюс расширение XSI), и определения C99.

source: (Since glibc 2.10) The value 700 or greater additionally exposes definitions for SUSv4 (i.e., the POSIX.1-2008 base specification plus the XSI extension).
ru: (начиная с glibc 2.10) При значении 700 и более дополнительно доступны определения, удовлетворяющие SUSv4 (т. е., базовой спецификации POSIX.1-2008 плюс расширение XSI).

source: If B<__STRICT_ANSI__> is not defined, or B<_XOPEN_SOURCE> is defined with a value greater than or equal to 500 I<and> neither B<_POSIX_SOURCE> nor B<_POSIX_C_SOURCE> is explicitly defined, then the following macros are implicitly defined:
ru: If B<__STRICT_ANSI__> не определено или определено B<_XOPEN_SOURCE> со значением больше или равно 500 I<и> явно не определено B<_POSIX_SOURCE> или B<_POSIX_C_SOURCE>, то неявно определяются следующие макросы:

source: B<_POSIX_SOURCE> is defined with the value 1.
ru: B<_POSIX_SOURCE> определяется со значением 1.

source: B<_POSIX_C_SOURCE> is defined, according to the value of B<_XOPEN_SOURCE>:
ru: B<_POSIX_C_SOURCE> определяется согласно значению B<_XOPEN_SOURCE>:

source: B<_POSIX_C_SOURCE> is defined with the value 2.
ru: B<_POSIX_C_SOURCE> определяется со значением 2.

source: B<_POSIX_C_SOURCE> is defined with the value 199506L.
ru: B<_POSIX_C_SOURCE> определяется со значением 199506L.

source: B<_POSIX_C_SOURCE> is defined with the value 200112L.
ru: B<_POSIX_C_SOURCE> определяется со значением 200112L.

source: 700 E<lt>= B<_XOPEN_SOURCE> (since glibc 2.10)
ru: 700 E<lt>= B<_XOPEN_SOURCE> (начиная с glibc 2.10)

source: B<_POSIX_C_SOURCE> is defined with the value 200809L.
ru: B<_POSIX_C_SOURCE> определяется со значением 200809L.

source: In addition, defining B<_XOPEN_SOURCE> with a value of 500 or greater produces the same effects as defining B<_XOPEN_SOURCE_EXTENDED>.
ru: Также, определение B<_XOPEN_SOURCE> со значением 500 и более даёт тот же эффект что и определение B<_XOPEN_SOURCE_EXTENDED>.

source: If this macro is defined, I<and> B<_XOPEN_SOURCE> is defined, then expose definitions corresponding to the XPG4v2 (SUSv1) UNIX extensions (UNIX 95). Defining B<_XOPEN_SOURCE> with a value of 500 or more also produces the same effect as defining B<_XOPEN_SOURCE_EXTENDED>. Use of B<_XOPEN_SOURCE_EXTENDED> in new source code should be avoided.
ru: Если этот макрос определён I<вместе> с B<_XOPEN_SOURCE>, то доступны определения, соответствующие расширениям UNIX (UNIX 95) XPG4v2 (SUSv1). Определение B<_XOPEN_SOURCE> со значением 500 и более также вызывает эффект, подобный B<_XOPEN_SOURCE_EXTENDED>. Использование B<_XOPEN_SOURCE_EXTENDED> в новом коде следует избегать.

source: Since defining B<_XOPEN_SOURCE> with a value of 500 or more has the same effect as defining B<_XOPEN_SOURCE_EXTENDED>, the latter (obsolete) feature test macro is generally not described in the SYNOPSIS in man pages.
ru: Так как определение B<_XOPEN_SOURCE> со значением 500 и более даёт тот же эффект, что и B<_XOPEN_SOURCE_EXTENDED>, последний (устаревший) макрос тестирования свойств, обычно, не описывается в ОБЗОРЕ справочной страницы.

source: B<_ISOC99_SOURCE> (since glibc 2.1.3)
ru: B<_ISOC99_SOURCE> (начиная с glibc 2.1.3)

source: Exposes declarations consistent with the ISO C99 standard.
ru: Делает доступными объявления, удовлетворяющие требованиям стандарта ISO C99.
