Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: B<getc>() is equivalent to B<fgetc>() except that it may be implemented as a macro which evaluates I<stream> more than once.
ru: Функция B<getc>() похожа на B<fgetc>(), но она может быть реализована как макрос, который определяет состояние I<stream> более одного раза.

source: B<getchar>() is equivalent to B<getc(>I<stdin>B<)>.
ru: Функция B<getchar>() эквивалентна B<getc(>I<stdin>B<)>.

source: B<fgets>() reads in at most one less than I<size> characters from I<stream> and stores them into the buffer pointed to by I<s>. Reading stops after an B<EOF> or a newline. If a newline is read, it is stored into the buffer. A terminating null byte (\(aq\e0\(aq) is stored after the last character in the buffer.
ru: Функция B<fgets>() считывает максимум I<size> -1 символов из I<stream> и записывает их в буфер, на который указывает I<s>. Чтение прерывается по достижении B<EOF> или символа новой строки. Если получен символ новой строки, то он заносится в буфер. В конец буфера после последнего символа добавляется завершающий байт null (\(aq\e0\(aq).

source: B<ungetc>() pushes I<c> back to I<stream>, cast to I<unsigned char>, where it is available for subsequent read operations. Pushed-back characters will be returned in reverse order; only one pushback is guaranteed.
ru: Функция B<ungetc>() заносит I<c> обратно в I<stream>, преобразует в I<unsigned char>, если это возможно для дальнейших операций чтения. Занесённые обратно символы будут возвращаться в обратном порядке; гарантируется только одно занесение символов.

source: Calls to the functions described here can be mixed with each other and with calls to other input functions from the I<stdio> library for the same input stream.
ru: Вызовы функций, описанные здесь, могут смешиваться друг с другом и с другими функциями ввода из библиотеки I<stdio> для того же потока ввода.

source: B<fgetc>(), B<getc>() and B<getchar>() return the character read as an I<unsigned char> cast to an I<int> or B<EOF> on end of file or error.
ru: Функции B<fgetc>(), B<getc>() и B<getchar>() возвращают символ, считанный как I<unsigned char> и преобразованный в I<int>, или B<EOF> по достижении конца файла или при возникновении ошибки.

source: B<fgets>() returns I<s> on success, and NULL on error or when end of file occurs while no characters have been read.
ru: Функция B<fgets>() возвращает I<s> при удачном выполнении и NULL при ошибке или если достигнут конец файла, а символы остались несчитанными.

source: B<ungetc>() returns I<c> on success, or B<EOF> on error.
ru: При успешном выполнении функция B<ungetc>() возвращает I<c> или B<EOF> при ошибке.

source: It is not advisable to mix calls to input functions from the I<stdio> library with low-level calls to B<read>(2) for the file descriptor associated with the input stream; the results will be undefined and very probably not what you want.
ru: Не рекомендуется чередовать вызовы функций ввода библиотеки I<stdio> с низкоуровневыми вызовами B<read>(2) для дескриптора файла, связанного с потоком ввода; результат этого будет неопределённым и, скорее всего, не тем, который ожидается.

source: fflush - flush a stream
ru: fflush - сбрасывает поток

source: For output streams, B<fflush>() forces a write of all user-space buffered data for the given output or update I<stream> via the stream's underlying write function.
ru: Для потоков вывода функция B<fflush>() принудительно записывает все буферизированные в пользовательском пространстве данные в устройство вывода данных или корректирует I<stream> посредством определённой для него функции записи.

source: For input streams associated with seekable files (e.g., disk files, but not pipes or terminals), B<fflush>() discards any buffered data that has been fetched from the underlying file, but has not been consumed by the application.
ru: Для потоков ввода, связанных с файлами, в которых возможно позиционирование (например, дисковые файлы, но не каналы или терминалы), функция B<fflush>() отбрасывает все буферизированные данные, которые были получены из соответствующего файла, но не обработаны приложением.

source: The open status of the stream is unaffected.
ru: При этом поток остается открытым.

source: If the I<stream> argument is NULL, B<fflush>() flushes I<all> open output streams.
ru: Если аргумент I<stream> равен NULL, то B<fflush>() сбрасывает данные всех открытых потоков вывода.

source: Upon successful completion 0 is returned. Otherwise, B<EOF> is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении возвращается нулевое значение. В противном случае возвращается B<EOF> и I<errno> присваивается код ошибки.

source: I<stream> is not an open stream, or is not open for writing.
ru: Поток I<stream> не открыт или не открыт для записи.

source: The function B<fflush>() may also fail and set I<errno> for any of the errors specified for B<write>(2).
ru: Функция I<fflush>() может завершиться с ошибкой и присвоить I<errno> любое значение из определённых для B<write>(2).

source: POSIX.1-2001 did not specify the behavior for flushing of input streams, but the behavior is specified in POSIX.1-2008.
ru: В POSIX.1-2001 не определено поведение для сброса потоков ввода, но но это описано в POSIX.1-2008.

source: Note that B<fflush>() flushes only the user-space buffers provided by the C library. To ensure that the data is physically stored on disk the kernel buffers must be flushed too, for example, with B<sync>(2) or B<fsync>(2).
ru: Заметим, что B<fflush>() сбрасывает буферы только пользовательского пространства, заданные библиотекой Си. Чтобы гарантировать, что данные действительно физически сохранены на диске, буферы ядра также должны быть сохранены, например, с помощью вызова B<sync>(2) или B<fsync>(2).

source: fputws - write a wide-character string to a FILE stream
ru: fputws - записывает строку широких символов в поток FILE

source: The B<fputws>() function is the wide-character equivalent of the B<fputs>(3) function. It writes the wide-character string starting at I<ws>, up to but not including the terminating null wide character (L\(aq\e0\(aq), to I<stream>.
ru: Функция B<fputws>() — эквивалент B<fputs>(3) для строк широких символов. Она записывает строку широких символов, начинающуюся с I<ws> до, но не включая, завершающего широкого символа null (L\(aq\e0\(aq), в I<stream>.

source: The B<fputws>() function returns a nonnegative integer if the operation was successful, or -1 to indicate an error.
ru: Функция B<fputws>() возвращает неотрицательное целое число, если операция завершилась успешно, или -1 для обозначения ошибки.

source: The behavior of B<fputws>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<fputws>() зависит от категории B<LC_CTYPE> текущей локали.

source: In the absence of additional information passed to the B<fopen>(3) call, it is reasonable to expect that B<fputws>() will actually write the multibyte string corresponding to the wide-character string I<ws>.
ru: Из-за отсутствия дополнительной информации, передаваемой в B<fopen>(3), закономерно ожидать, что B<fputws>() на самом деле пишет многобайтовую строку, соответствующую строке широких символов I<ws>.

source: ffs, ffsl, ffsll - find first bit set in a word
ru: ffs, ffsl, ffsll - ищет первый установленный бит в слове

source: Since glibc 2.12:
ru: Начиная с glibc 2.12:

source: _XOPEN_SOURCE E<gt>= 700 || ! (_POSIX_C_SOURCE\ E<gt>=\ 200809L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE E<gt>= 700 || ! (_POSIX_C_SOURCE\ E<gt>=\ 200809L) || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: Before glibc 2.12:
ru: До glibc 2.12:

source: none
ru: ни одного

source: Since glibc 2.27:
ru: Начиная с glibc 2.27:

source: Before glibc 2.27:
ru: До glibc 2.27:

source: The B<ffs>() function returns the position of the first (least significant) bit set in the word I<i>. The least significant bit is position 1 and the most significant position is, for example, 32 or 64. The functions B<ffsll>() and B<ffsl>() do the same but take arguments of possibly different size.
ru: Функция B<ffs>() возвращает позицию первого (считая с наименее значимого) установленного бита в слове I<i>. Наименее значимый бит находится в позиции номер 1, а наиболее значимый — в позиции (как пример) номер 32 или 64. Функции B<ffsll>() и B<ffsl>() делают то же самое, но имеют аргументы возможно других размеров.

source: These functions return the position of the first bit set, or 0 if no bits are set in I<i>.
ru: Эти функции возвращают положение первого установленного бита или 0, если в I<i> не установлено ни одного бита.

source: The B<ffsl>() and B<ffsll>() functions are glibc extensions.
ru: Функции B<ffsl>() и B<ffsll>() являются расширениями glibc.

source: BSD systems have a prototype in I<E<lt>string.hE<gt>>.
ru: В системах BSD прототип указан в I<E<lt>string.hE<gt>>.

source: fmod, fmodf, fmodl - floating-point remainder function
ru: fmod, fmodf, fmodl - функция получения остатка от деления числа с плавающей запятой

source: These functions compute the floating-point remainder of dividing I<x> by I<y>. The return value is I<x> - I<n> * I<y>, where I<n> is the quotient of I<x> / I<y>, rounded toward zero to an integer.
ru: Эти функции вычисляют остаток деления числа с плавающей запятой I<x> на I<y>. Возвращаемое значение: I<x> - I<n> * I<y>, где I<n> — частное I<x> / I<y>, округлённое к нулю до ближайшего целого числа.

source: On success, these functions return the value I<x>\ -\ I<n>*I<y>, for some integer I<n>, such that the returned value has the same sign as I<x> and a magnitude less than the magnitude of I<y>.
ru: При успешном выполнении функции возвращают значение I<x>\ -\ I<n>*I<y> для некоторого целого I<n>; при этом возвращаемое значение имеет тот же знак что и I<x>, а абсолютное значение меньше абсолютного значения I<y>.

source: If I<x> is an infinity, a domain error occurs, and a NaN is returned.
ru: Если I<x> стремится к бесконечности, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If I<y> is zero, a domain error occurs, and a NaN is returned.
ru: Если I<y> равно 0, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If I<x> is +0 (-0), and I<y> is not zero, +0 (-0) is returned.
ru: Если I<x> равно +0 (-0) и I<y> не равно, то возвращается +0 (-0).

source: Domain error: I<x> is an infinity
ru: Ошибка области: I<x> стремится к бесконечности

source: I<errno> is set to B<EDOM> (but see BUGS). An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: I<errno> устанавливается в B<EDOM> (но см. ДЕФЕКТЫ). Возникает исключение неправильной плавающей точки (B<FE_INVALID>).

source: Domain error: I<y> is zero
ru: Ошибка области: I<y> равно 0

source: I<errno> is set to B<EDOM>. An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: I<errno> устанавливается в B<EDOM>. Вызывается исключение неправильной плавающей точки (B<FE_INVALID>).

source: Before version 2.10, the glibc implementation did not set I<errno> to B<EDOM> when a domain error occurred for an infinite I<x>.
ru: До версии 2.10 в реализации glibc при возникновении ошибки области переменная I<errno> не устанавливалась в значение B<EDOM> для бесконечного I<x>.

source: ftw, nftw - file tree walk
ru: ftw, nftw - обход файлового дерева

source: B<nftw>() walks through the directory tree that is located under the directory I<dirpath>, and calls I<fn>() once for each entry in the tree. By default, directories are handled before the files and subdirectories they contain (preorder traversal).
ru: Функция B<nftw>() обходит дерево каталогов, начиная с указанного в I<dirpath>, и для каждого элемента дерева однократно вызывает I<fn>(). По умолчанию каталоги обрабатываются раньше файлов и подкаталогов, которые в них содержатся (предварительный обход).

source: To avoid using up all of the calling process's file descriptors, I<nopenfd> specifies the maximum number of directories that B<nftw>() will hold open simultaneously. When the search depth exceeds this, B<nftw>() will become slower because directories have to be closed and reopened. B<nftw>() uses at most one file descriptor for each level in the directory tree.
ru: Чтобы избежать использования всех файловых дескрипторов вызывающего процесса, в I<nopenfd> задаётся максимальное количество одновременно открываемых B<nftw>() каталогов. Когда это количество превышается, работа B<nftw>() немного замедляется, так как каталоги будут закрываться и снова открываться. Функция B<nftw>() использует не более одного файлового дескриптора для работы с каждым уровнем дерева каталогов.

source: For each entry found in the tree, B<nftw>() calls I<fn>() with four arguments: I<fpath>, I<sb>, I<typeflag>, and I<ftwbuf>. I<fpath> is the pathname of the entry, and is expressed either as a pathname relative to the calling process's current working directory at the time of the call to B<nftw>(), if I<dirpath> was expressed as a relative pathname, or as an absolute pathname, if I<dirpath> was expressed as an absolute pathname. I<sb> is a pointer to the I<stat> structure returned by a call to B<stat>(2) for I<fpath>.
ru: Для каждого найденного элемента дерева B<nftw>() вызывает функцию B<fn>() с четырьмя аргументами: I<fpath>, I<sb>, I<fpath> и I<ftwbuf>. В I<fpath> указывается полное имя элемента в виде, или пути относительно рабочего каталога вызывающего процесса на момент вызова B<nftw>() (если I<dirpath> указан в виде относительного пути), или абсолютного пути (если I<dirpath> указан в виде абсолютного пути). В I<sb> задаётся указатель на структуру I<stat>, возвращаемую вызовом B<stat>(2) для I<fpath>.

source: The I<typeflag> argument passed to I<fn>() is an integer that has one of the following values:
ru: Аргумент I<typeflag>, передаваемый в I<fn>(), представляет собой целое число, которое может быть одним из следующих значений:

source: I<fpath> is a regular file.
ru: I<fpath> обычный файл

source: I<fpath> is a directory.
ru: I<fpath> каталог

source: I<fpath> is a directory which can't be read.
ru: I<fpath> каталог, который не может быть прочитан

source: I<fpath> is a directory, and B<FTW_DEPTH> was specified in I<flags>. (If B<FTW_DEPTH> was not specified in I<flags>, then directories will always be visited with I<typeflag> set to B<FTW_D>.) All of the files and subdirectories within I<fpath> have been processed.
ru: I<fpath> является каталогом, и в I<flags> установлен B<FTW_DEPTH> (если B<FTW_DEPTH> отсутствует в I<flags>, то каталоги всегда будут просматриваться с I<typeflag> равным B<FTW_D>). Обработаны все файлы и подкаталоги в I<fpath>.

source: The B<stat>(2) call failed on I<fpath>, which is not a symbolic link. The probable cause for this is that the caller had read permission on the parent directory, so that the filename I<fpath> could be seen, but did not have execute permission, so that the file could not be reached for B<stat>(2). The contents of the buffer pointed to by I<sb> are undefined.
ru: Вызов B<stat>(2) завершился с ошибкой для I<fpath>, который не является символьной ссылкой. Вероятно, проблема в том, что вызывающий имеет право на чтение родительского каталога, и поэтому файл с именем I<fpath> доступен, но не имеет права выполнения, и поэтому файл недоступен для B<stat>(2). Содержимое буфера, указываемого I<sb>, не определено.

source: I<fpath> is a symbolic link, and B<FTW_PHYS> was set in I<flags>.
ru: I<fpath> является символьной ссылкой и в I<flags> установлен B<FTW_PHYS>.

source: I<fpath> is a symbolic link pointing to a nonexistent file. (This occurs only if B<FTW_PHYS> is not set.) On most implementations, in this case the I<sb> argument passed to I<fn>() contains information returned by performing B<lstat>(2) on the symbolic link. For the details on Linux, see BUGS.
ru: Значение I<fpath> является символьной ссылкой, указывающей на несуществующий файл (это может произойти, только если не установлен флаг B<FTW_PHYS>). В большинстве реализаций в этом случае аргумент I<sb>, переданный I<fn>(), содержит информацию, возвращаемую вызовом B<lstat>(2) для символьной ссылки. Подробней для Linux смотрите в разделе ДЕФЕКТЫ.

source: The fourth argument (I<ftwbuf>) that B<nftw>() supplies when calling I<fn>() is a pointer to a structure of type I<FTW>:
ru: Четвёртый аргумент (I<ftwbuf>), передаваемый B<nftw>() при вызове I<fn>(), является структурой типа I<FTW>:

source: I<base> is the offset of the filename (i.e., basename component) in the pathname given in I<fpath>. I<level> is the depth of I<fpath> in the directory tree, relative to the root of the tree (I<dirpath>, which has depth 0).
ru: I<base> — смещение на имя файла (т.е. базовая часть) в пути, заданном в I<fpath>. I<level> — глубина I<fpath> в дереве каталогов относительно корня дерева (I<dirpath> имеет глубину 0).

source: To stop the tree walk, I<fn>() returns a nonzero value; this value will become the return value of B<nftw>(). As long as I<fn>() returns 0, B<nftw>() will continue either until it has traversed the entire tree, in which case it will return zero, or until it encounters an error (such as a B<malloc>(3) failure), in which case it will return -1.
ru: Для остановки обхода дерева I<fn>() возвращает ненулевое значение; оно станет возвращаемым значением для B<nftw>(). Пока I<fn>() возвращает 0, B<nftw>() будет продолжать свой поиск до полного обхода дерева (в этом случае она возвратит ноль), или пока не возникнет ошибка (например, из-за B<malloc>(3)). В этом случае функция возвратит значение -1.

source: Because B<nftw>() uses dynamic data structures, the only safe way to exit out of a tree walk is to return a nonzero value from I<fn>(). To allow a signal to terminate the walk without causing a memory leak, have the handler set a global flag that is checked by I<fn>(). I<Don't> use B<longjmp>(3) unless the program is going to terminate.
ru: Так как B<nftw>() использует динамические структуры данных, то единственным безопасным способом для выхода из процесса обхода дерева будет возврат ненулевого значения из I<fn>(). Для завершения обхода по сигналу без утечек памяти в обработчике нужно устанавливать глобальный флаг, проверяемый I<fn>(). I<Не> используйте B<longjmp>(3) кроме как для завершения программы.

source: The I<flags> argument of B<nftw>() is formed by ORing zero or more of the following flags:
ru: Значение аргумента I<flags> в B<nftw>() составляется логическим сложением 0 или нескольких следующих флагов:

source: B<FTW_ACTIONRETVAL> (since glibc 2.3.3)
ru: B<FTW_ACTIONRETVAL> (начиная с glibc 2.3.3)

source: If this glibc-specific flag is set, then B<nftw>() handles the return value from I<fn>() differently. I<fn>() should return one of the following values:
ru: Если этот флаг, имеющийся только в glibc, не задан, то B<nftw>() по другому обрабатывает полученное от I<fn>() значение. Вызов I<fn>() должен возвращать одно из следующих значений:

source: Instructs B<nftw>() to continue normally.
ru: Указывает B<nftw>() продолжать обычную работу.

source: If I<fn>() returns this value, then siblings of the current entry will be skipped, and processing continues in the parent.
ru: При возврате этого значения родственные элементы пропускаются и продолжается обход родителя.

source: If I<fn>() is called with an entry that is a directory (I<typeflag> is B<FTW_D>), this return value will prevent objects within that directory from being passed as arguments to I<fn>(). B<nftw>() continues processing with the next sibling of the directory.
ru: Если I<fn>() вызывается для элемента, являющегося каталогом (I<typeflag> равно B<FTW_D>), то объекты внутри каталога не будут переданы I<fn>() в качестве аргументов. B<nftw>() продолжит обход со следующего родственного элемента каталога.

source: Causes B<nftw>() to return immediately with the return value B<FTW_STOP>.
ru: Заставляет B<nftw>() немедленно завершить работу со значением B<FTW_STOP>.

source: Other return values could be associated with new actions in the future; I<fn>() should not return values other than those listed above.
ru: В будущем могут появиться другие возвращаемые значения для новых действий; I<fn>() не должна возвращать значений, отличных от перечисленных выше.

source: The feature test macro B<_GNU_SOURCE> must be defined (before including I<any> header files) in order to obtain the definition of B<FTW_ACTIONRETVAL> from I<E<lt>ftw.hE<gt>>.
ru: Чтобы получить определение B<FTW_ACTIONRETVAL> из I<E<lt>ftw.hE<gt>>, должен быть определён макрос тестирования свойств B<_GNU_SOURCE>.

source: If set, do a B<chdir>(2) to each directory before handling its contents. This is useful if the program needs to perform some action in the directory in which I<fpath> resides. (Specifying this flag has no effect on the pathname that is passed in the I<fpath> argument of I<fn>.)
ru: Если установлен этот флаг, то будет выполняться B<chdir>(2) для каждого каталога перед обработкой его содержимого. Это полезно, если программе требуется выполнить какое-то действие в каталоге, в котором расположен I<fpath> (наличие данного флага не влияет на путь, который передаётся в I<fpath> аргумента I<fn>).

source: If set, do a post-order traversal, that is, call I<fn>() for the directory itself I<after> handling the contents of the directory and its subdirectories. (By default, each directory is handled I<before> its contents.)
ru: Если установлен этот флаг, то производить обход в обратном порядке, т.е. вызывать I<fn>() для обработки самого каталога I<после> обработки содержимого его подкаталогов (по умолчанию каждый каталог обрабатывается I<раньше> своего содержимого).

source: If set, stay within the same filesystem (i.e., do not cross mount points).
ru: Если установлен этот флаг, то оставаться в пределах одной файловой системы (т.е. не переходить в другую точку монтирования).

source: If set, do not follow symbolic links. (This is what you want.) If not set, symbolic links are followed, but no file is reported twice.
ru: Если установлен этот флаг, то не следовать по символьным ссылкам (то, что обычно нужно). Если флаг не задан, то выполняется переход по символьным ссылкам, но ни один файл не будет обработан дважды.

source: If B<FTW_PHYS> is not set, but B<FTW_DEPTH> is set, then the function I<fn>() is never called for a directory that would be a descendant of itself.
ru: Если B<FTW_PHYS> не задан, но задан B<FTW_DEPTH>, то функция I<fn>() никогда не будет вызвана для каталога, который является потомком самого себя.

source: B<ftw>() is an older function that offers a subset of the functionality of B<nftw>(). The notable differences are as follows:
ru: Функция B<ftw>() является устаревшей и предоставляет только часть возможностей B<nftw>(). Основные отличия:

source: B<ftw>() has no I<flags> argument. It behaves the same as when B<nftw>() is called with I<flags> specified as zero.
ru: В B<ftw>() нет аргумента I<flags>. Она действует также, как если бы B<nftw>() вызвали со значением I<flags> равным нулю.

source: The callback function, I<fn>(), is not supplied with a fourth argument.
ru: Функции обратного вызова I<fn>() не передаётся четвёртый аргумент.

source: The range of values that is passed via the I<typeflag> argument supplied to I<fn>() is smaller: just B<FTW_F>, B<FTW_D>, B<FTW_DNR>, B<FTW_NS>, and (possibly) B<FTW_SL>.
ru: Диапазон значений, передаваемый в аргументе I<typeflag> для I<fn>() меньше: B<FTW_F>, B<FTW_D>, B<FTW_DNR>, B<FTW_NS> и (возможно) B<FTW_SL>.

source: These functions return 0 on success, and -1 if an error occurs.
ru: При успешном выполнении эти функции возвращают 0 и -1 при ошибке.
