Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: The B<fseek>() function sets the file position indicator for the stream pointed to by I<stream>. The new position, measured in bytes, is obtained by adding I<offset> bytes to the position specified by I<whence>. If I<whence> is set to B<SEEK_SET>, B<SEEK_CUR>, or B<SEEK_END>, the offset is relative to the start of the file, the current position indicator, or end-of-file, respectively. A successful call to the B<fseek>() function clears the end-of-file indicator for the stream and undoes any effects of the B<ungetc>(3) function on the same stream.
ru: Функция B<fseek>() устанавливает положение файлового индикатора в потоке, на который указывает аргумент I<stream>. Новое положение (в байтах) получается прибавлением I<offset> байтов к положению, которое задаётся параметром I<whence>. Если значение I<whence> равно B<SEEK_SET>, B<SEEK_CUR> или B<SEEK_END>, то смещение указывается относительно начала файла, текущего положения указателя или конца файла, соответственно. Успешный вызов функции B<fseek>() очищает (clear) индикатор конца файла потока и отменяет влияние функции B<ungetc>(3) на этот же поток.

source: The B<ftell>() function obtains the current value of the file position indicator for the stream pointed to by I<stream>.
ru: Функция B<ftell>() возвращает текущее значение файлового индикатора положения для потока, на который указывает I<stream>.

source: The B<rewind>() function sets the file position indicator for the stream pointed to by I<stream> to the beginning of the file. It is equivalent to:
ru: Функция B<rewind>() устанавливает файловый индикатор положения для потока, на который указывает I<stream>, равным началу файла. Эта функция эквивалентна вызову:

source: except that the error indicator for the stream is also cleared (see B<clearerr>(3)).
ru: хотя в этом случае также сбрасывается индикатор ошибок потока (смотрите B<clearerr>(3)).

source: The B<fgetpos>() and B<fsetpos>() functions are alternate interfaces equivalent to B<ftell>() and B<fseek>() (with I<whence> set to B<SEEK_SET>), setting and storing the current value of the file offset into or from the object referenced by I<pos>. On some non-UNIX systems, an I<fpos_t> object may be a complex object and these routines may be the only way to portably reposition a text stream.
ru: Функции B<fgetpos>() и B<fsetpos>() эквивалентны B<ftell>() и B<fseek>() (где значение I<whence> равно B<SEEK_SET>); они сохраняют или устанавливают текущее значение файлового смещения в объектах, определяемых I<pos>. В некоторых не-UNIX системах объект I<fpos_t> может быть сложным объектом, а данные функции могут быть единственным переносимым способом изменения положения в текстовом потоке.

source: The B<rewind>() function returns no value. Upon successful completion, B<fgetpos>(), B<fseek>(), B<fsetpos>() return 0, and B<ftell>() returns the current offset. Otherwise, -1 is returned and I<errno> is set to indicate the error.
ru: Функция B<rewind>() не возвращает значений. При успешном выполнении функции B<fgetpos>(), B<fseek>(), B<fsetpos>() возвращают 0, а B<ftell>() возвращает значение текущего смещения. В противном случае возвращается -1, а в I<errno> записывается соответствующий код ошибки.

source: The I<whence> argument to B<fseek>() was not B<SEEK_SET>, B<SEEK_END>, or B<SEEK_CUR>. Or: the resulting file offset would be negative.
ru: Значение I<whence> в B<fseek>() не равно B<SEEK_SET>, B<SEEK_> или B<SEEK_CUR>. Или результирующее смещение файла получается отрицательным.

source: The file descriptor underlying I<stream> is not seekable (e.g., it refers to a pipe, FIFO, or socket).
ru: Связанный со I<stream> файловый дескриптор не допускает перемоток (верно для каналов, FIFO или сокетов).

source: The functions B<fgetpos>(), B<fseek>(), B<fsetpos>(), and B<ftell>() may also fail and set I<errno> for any of the errors specified for the routines B<fflush>(3), B<fstat>(2), B<lseek>(2), and B<malloc>(3).
ru: При ошибках функции B<fgetpos>(), B<fseek>(), B<fsetpos>() и B<ftell>() устанавливают значение I<errno> равным значению, определённому в функциях B<fflush>(3), B<fstat>(2), B<lseek>(2) и B<malloc>(3).

source: frexp, frexpf, frexpl - convert floating-point number to fractional and integral components
ru: frexp, frexpf, frexpl - приводит число с плавающей точкой к виду мантисса/степень

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions are used to split the number I<x> into a normalized fraction and an exponent which is stored in I<exp>.
ru: Эти функции используются для разделения числа I<x> на нормализованную мантиссу и степень, которая сохраняется в I<exp>.

source: These functions return the normalized fraction. If the argument I<x> is not zero, the normalized fraction is I<x> times a power of two, and its absolute value is always in the range 1/2 (inclusive) to 1 (exclusive), that is, [0.5,1).
ru: Эти функции возвращают нормализованную мантиссу. Если аргумент I<x> не равен нулю, то нормализованная мантисса равна I<x> степеням двойки, а её абсолютное значение всегда находится в диапазоне от 1/2 (включительно) до 1 (не включая), то есть [0.5,1).

source: If I<x> is zero, then the normalized fraction is zero and zero is stored in I<exp>.
ru: Если значение I<x> равно нулю, то нормализованная мантисса равна нулю, и ноль сохраняется в I<exp>.

source: If I<x> is a NaN, a NaN is returned, and the value of I<*exp> is unspecified.
ru: Если значение I<x> равно NaN, то возвращается NaN, а значение I<*exp> не определено.

source: If I<x> is positive infinity (negative infinity), positive infinity (negative infinity) is returned, and the value of I<*exp> is unspecified.
ru: Если I<x> равно плюс или минус бесконечность, то будет возвращена плюс или минус бесконечность, а значение I<*exp> не определено.

source: No errors occur.
ru: Ошибки не возникают.

source: The variant returning I<double> also conforms to SVr4, 4.3BSD, C89.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD, C89.

source: The program below produces results such as the following:
ru: Нижеследующая программа выдает такие результаты:

source: fclose - close a stream
ru: fclose - закрывает поток

source: The B<fclose>() function flushes the stream pointed to by I<stream> (writing any buffered output data using B<fflush>(3)) and closes the underlying file descriptor.
ru: Функция B<fclose>() сбрасывает (flushes) поток, указанный в I<stream> (записывает все буферизированные выходные данные с помощью B<fflush>(3)) и закрывает связанный с ним файловый дескриптор.

source: Upon successful completion, 0 is returned. Otherwise, B<EOF> is returned and I<errno> is set to indicate the error. In either case, any further access (including another call to B<fclose>()) to the stream results in undefined behavior.
ru: При успешном выполнении возвращается нулевое значение. В противном случае возвращается B<EOF> и I<errno> присваивается код ошибки. В любом случае, дальнейшие попытки доступа (включая ещё один вызов B<fclose>()) к потоку приведут к неопределенному результату.

source: The file descriptor underlying I<stream> is not valid.
ru: В I<stream> указан неверный дескриптор файла.

source: The B<fclose>() function may also fail and set I<errno> for any of the errors specified for the routines B<close>(2), B<write>(2), or B<fflush>(3).
ru: Функция B<fclose>() при ошибках может установить I<errno> в значение, соответствующее ошибкам функций B<close>(2), B<write>(2) или B<fflush>(3).

source: Note that B<fclose>() flushes only the user-space buffers provided by the C library. To ensure that the data is physically stored on disk the kernel buffers must be flushed too, for example, with B<sync>(2) or B<fsync>(2).
ru: Заметим, что B<fclose>() сбрасывает буферы только пользовательского пространства, заданные библиотекой Си. Чтобы гарантировать, что данные действительно физически сохранены на диске, буферы ядра также должны быть сохранены, например, с помощью вызова B<sync>(2) или B<fsync>(2).

source: fwide - set and determine the orientation of a FILE stream
ru: fwide - задаёт и определяет ориентацию потока FILE

source: When I<mode> is zero, the B<fwide>() function determines the current orientation of I<stream>. It returns a positive value if I<stream> is wide-character oriented, that is, if wide-character I/O is permitted but char I/O is disallowed. It returns a negative value if I<stream> is byte oriented\(emthat is, if char I/O is permitted but wide-character I/O is disallowed. It returns zero if I<stream> has no orientation yet; in this case the next I/O operation might change the orientation (to byte oriented if it is a char I/O operation, or to wide-character oriented if it is a wide-character I/O operation).
ru: Если значение I<mode> равно нулю, то функция B<fwide>() определяет текущую ориентацию потока I<stream>. Возвращается положительное значение, если I<stream> ориентирован на широкие символы, то есть ввод/вывод широких символов разрешён, а ввод/вывод обычных символов запрещён. Возвращается отрицательное значение, если I<stream> ориентирован на работу с байтами, то есть разрешён ввод/вывод обычных символов (char), а ввод/вывод широких символов запрещён. Возвращается ноль, если I<stream> пока не имеет ориентации; в этом случае следующая операция ввода/вывода может поменять ориентацию (например, на байтовую, если производится операция ввода/вывода символов, или на широкие символы, если выполняется операция ввода/вывода широких символов).

source: Once a stream has an orientation, it cannot be changed and persists until the stream is closed.
ru: После того, ориентация потока определена, она не сможет быть изменена и будет действовать до тех пор, пока не закроется поток.

source: When I<mode> is nonzero, the B<fwide>() function first attempts to set I<stream>'s orientation (to wide-character oriented if I<mode> is greater than 0, or to byte oriented if I<mode> is less than 0). It then returns a value denoting the current orientation, as above.
ru: Если значение I<mode> не равно нулю, то функция B<fwide>() сначала попытается установить ориентацию I<stream> (на широкие символы, если I<mode> больше 0, или на байты, если I<mode> меньше 0). Затем возвращается значение, отражающее текущую ориентацию, как указано выше.

source: The B<fwide>() function returns the stream's orientation, after possibly changing it. A positive return value means wide-character oriented. A negative return value means byte oriented. A return value of zero means undecided.
ru: Функция B<fwide>() возвращает ориентацию потока после возможного её изменения. Возвращаемое положительное значение означает ориентацию на широкие символы. Возвращаемое отрицательное значение означает ориентацию на байты. Возвращаемое значение 0 означает неопределённость.

source: Wide-character output to a byte oriented stream can be performed through the B<fprintf>(3) function with the B<%lc> and B<%ls> directives.
ru: Вывод широких символов в поток, ориентированный на байтовые операции, может быть осуществлён с помощью функции B<fprintf>(3) с директивами B<%lc> и B<%ls>.

source: Char oriented output to a wide-character oriented stream can be performed through the B<fwprintf>(3) function with the B<%c> and B<%s> directives.
ru: Вывод символов в поток, ориентированный на операции с широкими символами, может быть осуществлён с помощью функции B<fwprintf>(3) с директивами B<%c> и B<%s>.

source: fexecve - execute program specified via file descriptor
ru: fexecve - запускает программу, заданную файловым дескриптором

source: B<fexecve>() performs the same task as B<execve>(2), with the difference that the file to be executed is specified via a file descriptor, I<fd>, rather than via a pathname. The file descriptor I<fd> must be opened read-only (B<O_RDONLY>) or with the B<O_PATH> flag and the caller must have permission to execute the file that it refers to.
ru: Функция B<fexecve>() выполняет ту же задачу, что и B<execve>(2), только выполняемый файл указывается посредством файлового дескриптора I<fd>, а не через путь к файлу. Файловый дескриптор I<fd> должен быть открыт только для чтения (B<O_RDONLY>) или иметь флаг B<O_PATH> и вызывающий должен иметь право на выполнение файла, на который ссылается дескриптор.

source: A successful call to B<fexecve>() never returns. On error, the function does return, with a result value of -1, and I<errno> is set appropriately.
ru: При успешном выполнении B<fexecve>() не возвращает управление. При ошибке функция возвращает выполнение с результатом -1, а I<errno> устанавливает в соответствующее значение.

source: Errors are as for B<execve>(2), with the following additions:
ru: Возникают те же ошибки что и для B<execve>(2), а также дополнительно:

source: I<fd> is not a valid file descriptor, or I<argv> is NULL, or I<envp> is NULL.
ru: Значение I<fd> не является правильным файловым дескриптором или I<argv> равно NULL, или I<envp> равно NULL.

source: The close-on-exec flag is set on I<fd>, and I<fd> refers to a script. See BUGS.
ru: На I<fd> установлен флаг close-on-exec и I<fd> ссылается на сценарий. Смотрите ДЕФЕКТЫ.

source: The kernel does not provide the B<execveat>(2) system call, and the I</proc> filesystem could not be accessed.
ru: Ядро не предоставляет системный вызов B<execveat>(2) и файловая система I</proc> недоступна.

source: B<fexecve>() is implemented since glibc 2.3.2.
ru: Функция B<fexecve>() появилась в glibc 2.3.2.

source: POSIX.1-2008. This function is not specified in POSIX.1-2001, and is not widely available on other systems. It is specified in POSIX.1-2008.
ru: POSIX.1-2008. Эта функция не определена в POSIX.1-2001 и широко не распространена среди других систем. Она определена в POSIX.1-2008.

source: On Linux with glibc versions 2.26 and earlier, B<fexecve>() is implemented using the B<proc>(5) filesystem, so I</proc> needs to be mounted and available at the time of the call. Since glibc 2.27, if the underlying kernel supports the B<execveat>(2) system call, then B<fexecve>() is implemented using that system call, with the benefit that I</proc> does not need to be mounted.
ru: В Linux c glibc с версией 2.26 и старее функция B<fexecve>() реализована с использованием файловой системы B<proc>(5), поэтому I</proc> должна быть смонтирована и доступна на момент вызова. Начиная с glibc 2.27, если используемое ядро поддерживает системный вызов B<execveat>(2), то B<fexecve>() реализуется через этот системный вызов и I</proc> монтировать уже не нужно.

source: The idea behind B<fexecve>() is to allow the caller to verify (checksum) the contents of an executable before executing it. Simply opening the file, checksumming the contents, and then doing an B<execve>(2) would not suffice, since, between the two steps, the filename, or a directory prefix of the pathname, could have been exchanged (by, for example, modifying the target of a symbolic link). B<fexecve>() does not mitigate the problem that the I<contents> of a file could be changed between the checksumming and the call to B<fexecve>(); for that, the solution is to ensure that the permissions on the file prevent it from being modified by malicious users.
ru: Предназначение B<fexecve>() — позволить вызывающему проверить содержимое исполняемого файла (контрольную сумму) до запуска. Простого открытия файла, вычисления контрольной суммы содержимого и выполнения B<execve>(2) недостаточно, так как между двумя этими шагами может измениться имя файла или каталог пути (например, посредством изменения цели символьной ссылки). Функция B<fexecve>() не решает проблему возможного изменения I<содержимого> файла между проверкой контрольной суммы и вызовом B<fexecve>() — для этого есть права на файл, которые должны предотвращать его несанкционированное изменение.

source: The natural idiom when using B<fexecve>() is to set the close-on-exec flag on I<fd>, so that the file descriptor does not leak through to the program that is executed. This approach is natural for two reasons. First, it prevents file descriptors being consumed unnecessarily. (The executed program normally has no need of a file descriptor that refers to the program itself.) Second, if B<fexecve>() is used recursively, employing the close-on-exec flag prevents the file descriptor exhaustion that would result from the fact that each step in the recursion would cause one more file descriptor to be passed to the new program. (But see BUGS.)
ru: Естественная идиома при использовании B<fexecve>() — установить флаг закрытия-при-выполнении на I<fd> для того, чтобы дескриптор файла не утекал выполняемой программе. Этот подход естественен по двум причинам. Во-первых, это предотвращает трату дескрипторов файлов без надобности (выполняемой программе, обычно, не нужен дескриптор файла, который ссылается на саму программу). Во-вторых, если B<fexecve>() использовать рекурсивно, то применение флага закрытия-при-выполнении предотвращает исчерпание дескрипторов файлов, которое произошло бы, так как каждый шаг в рекурсии вызывает передачу ещё одного дескриптора файла новой программе (но смотрите ДЕФЕКТЫ).

source: If I<fd> refers to a script (i.e., it is an executable text file that names a script interpreter with a first line that begins with the characters I<#!>) and the close-on-exec flag has been set for I<fd>, then B<fexecve>() fails with the error B<ENOENT>. This error occurs because, by the time the script interpreter is executed, I<fd> has already been closed because of the close-on-exec flag. Thus, the close-on-exec flag can't be set on I<fd> if it refers to a script, leading to the problems described in NOTES.
ru: Если I<fd> ссылается на сценарий (т. е., это исполняемый текстовый файл, у которого в первой строке (начинается с I<#!>) указан интерпретатор сценария и флаг закрытия-при-выполнении установлен на I<fd>, то B<fexecve>() завершается с ошибкой B<ENOENT>. Эта ошибка возникает потому, что на момент выполнения интерпретатора сценария I<fd> уже закрыт, так как указан флаг закрытия-при-выполнении. Таким образом флаг закрытия-при-выполнении не может быть установлен I<fd>, если он указывает на сценарий, так как это приводит к проблемам, описанным в ЗАМЕЧАНИЯХ.

source: fgetws - read a wide-character string from a FILE stream
ru: fgetws - читает строку широких символов из потока FILE

source: The B<fgetws>() function is the wide-character equivalent of the B<fgets>(3) function. It reads a string of at most I<n-1> wide characters into the wide-character array pointed to by I<ws>, and adds a terminating null wide character (L\(aq\e0\(aq). It stops reading wide characters after it has encountered and stored a newline wide character. It also stops when end of stream is reached.
ru: Функция B<fgetws>() — это эквивалент B<fgets>(3), но работающий со строками широких символов. Она читает строку из не более чем I<n-1> широких символов, записывает её в массив широких символов I<ws> и добавляет завершающий широкий символ null (L\(aq\e0\(aq). Она прекращает чтение после обнаружения и записи широкого символа новой строки. Это также происходит и в случае достижения конца потока.

source: The programmer must ensure that there is room for at least I<n> wide characters at I<ws>.
ru: Программист должен убедиться в том, что выделил для I<ws> память, достаточную для записи не менее I<n> широких символов.

source: For a nonlocking counterpart, see B<unlocked_stdio>(3).
ru: Неблокирующий аналог смотрите в B<unlocked_stdio>(3).

source: The B<fgetws>() function, if successful, returns I<ws>. If end of stream was already reached or if an error occurred, it returns NULL.
ru: Функция B<fgetws>() в случае удачного выполнения возвращает I<ws>. Если достигнут конец потока или возникает ошибка, то возвращается NULL.

source: The behavior of B<fgetws>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<fgetws>() зависит от категории B<LC_CTYPE> текущей локали.

source: In the absence of additional information passed to the B<fopen>(3) call, it is reasonable to expect that B<fgetws>() will actually read a multibyte string from the stream and then convert it to a wide-character string.
ru: Из-за отсутствия дополнительной информации, передаваемой в B<fopen>(3), закономерно ожидать, что B<fgetws>() на самом деле читает многобайтовую строку из потока, а затем преобразует её в широкую строку.

source: This function is unreliable, because it does not permit to deal properly with null wide characters that may be present in the input.
ru: Данная функция ненадёжна, так как не позволяет правильно обработать ситуацию, когда во входных данных появляется широкий символ null.

source: flockfile, ftrylockfile, funlockfile - lock FILE for stdio
ru: flockfile, ftrylockfile, funlockfile - блокирует FILE для stdio

source: All functions shown above:
ru: Для всех функций, перечисленных выше:

source: /* Since glibc 2.24: */ _POSIX_C_SOURCE\ E<gt>=\ 199309L || /* Glibc versions E<lt>= 2.23: */ _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: /* начиная с glibc 2.24: */ _POSIX_C_SOURCE\ E<gt>=\ 199309L || /* Glibc versions E<lt>= 2.23: */ _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The stdio functions are thread-safe. This is achieved by assigning to each I<FILE> object a lockcount and (if the lockcount is nonzero) an owning thread. For each library call, these functions wait until the I<FILE> object is no longer locked by a different thread, then lock it, do the requested I/O, and unlock the object again.
ru: Функции stdio можно без опаски использовать в нитях. Это достигается назначением каждому объекту I<FILE> счётчика блокировок и (если счётчик не равен нулю) нити-владельца. При каждом библиотечном вызове эти функции ждут разблокировки объекта I<FILE> другой нитью, блокируют его, а затем выполняют заданную операцию ввода/вывода и разблокируют объект.

source: (Note: this locking has nothing to do with the file locking done by functions like B<flock>(2) and B<lockf>(3).)
ru: (Замечание: блокировка не учитывается, если блокировка файла осуществлялась функциями типа B<flock>(2) и B<lockf>(3).)

source: All this is invisible to the C-programmer, but there may be two reasons to wish for more detailed control. On the one hand, maybe a series of I/O actions by one thread belongs together, and should not be interrupted by the I/O of some other thread. On the other hand, maybe the locking overhead should be avoided for greater efficiency.
ru: Всё это прозрачно и незаметно для программиста на С, но всё же есть две причины для более подробного изучения. Первая: возможны последовательности операций ввода/вывода в одной нити, при этом другая нить не будет прерывать ввод/вывод. Вторая: можно избежать чрезмерной нагрузки от блокировок.

source: To this end, a thread can explicitly lock the I<FILE> object, then do its series of I/O actions, then unlock. This prevents other threads from coming in between. If the reason for doing this was to achieve greater efficiency, one does the I/O with the nonlocking versions of the stdio functions: with B<getc_unlocked>(3) and B<putc_unlocked>(3) instead of B<getc>(3) and B<putc>(3).
ru: С этой целью нить может явно блокировать объект I<FILE>, осуществить серию операций ввода/вывода, а затем снять блокировку. При этом другие нити не могут вклиниться между операциями. Если причиной для реализации всего этого является повышение эффективности работы, то для ввода/вывод можно использовать неблокирующие версии функций stdio: B<getc_unlocked>(3) и B<putc_unlocked>(3) вместо B<getc>(3) и B<putc>(3).
