Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Earlier glibc 2.1.x versions recognized an equivalent macro named B<_ISOC9X_SOURCE> (because the C99 standard had not then been finalized). Although the use of this macro is obsolete, glibc continues to recognize it for backward compatibility.
ru: Ранние версии glibc 2.1.x распознавали макрос-эквивалент B<_ISOC9X_SOURCE> (так как стандарт C99 ещё не был утверждён). Хотя использование последнего макроса не рекомендуется, glibc пока поддерживает его для обратной совместимости.

source: Defining B<_ISOC99_SOURCE> also exposes ISO C (1990) Amendment 1 ("C95") definitions. (The primary change in C95 was support for international character sets.)
ru: Делает доступными определения стандарта ISO C (1990) Amendment 1 («C95»). Основным изменением в C95 была поддержка международных наборов символов.

source: Invoking the C compiler with the option I<-std=c99> produces the same effects as defining this macro.
ru: Вызов компилятора C с параметром I<-std=c99> работает также как если был бы указан этот макрос.

source: B<_ISOC11_SOURCE> (since glibc 2.16)
ru: B<_ISOC11_SOURCE> (начиная с glibc 2.16)

source: Exposes declarations consistent with the ISO C11 standard. Defining this macro also enables C99 and C95 features (like B<_ISOC99_SOURCE>).
ru: Делает доступными объявления, удовлетворяющие требованиям стандарта ISO C11. Определение этого макроса также включает свойства C99 и C95 (подобно B<_ISOC99_SOURCE>).

source: Invoking the C compiler with the option I<-std=c11> produces the same effects as defining this macro.
ru: Вызов компилятора C с параметром I<-std=c11> работает также как если был бы указан этот макрос.

source: Expose definitions for the alternative API specified by the LFS (Large File Summit) as a "transitional extension" to the Single UNIX Specification. (See E<.UR http:\:/\:/opengroup.org\:/platform\:/lfs.html> E<.UE .)> The alternative API consists of a set of new objects (i.e., functions and types) whose names are suffixed with "64" (e.g., I<off64_t> versus I<off_t>, B<lseek64>() versus B<lseek>(), etc.). New programs should not employ this macro; instead I<_FILE_OFFSET_BITS=64> should be employed.
ru: Делает доступными объявления альтернативного программного интерфейса, определяемого в LFS (Large File Summit) как «переходного расширение» на Single UNIX Specification (смотрите E<.UR http:\:/\:/opengroup.org\:/platform\:/lfs.html> E<.UE)>. Альтернативный программный интерфейс состоит из набора новых объектов (т. е., функций и типов), чьи имена оканчиваются на «»64 (например, I<off64_t> и I<off_t>, B<lseek64>() и B<lseek>(), и т. д.). В новых программах не нужно указывать этот макрос; вместо него указывайте I<_FILE_OFFSET_BITS=64>.

source: This macro was historically used to expose certain functions (specifically B<fseeko>(3) and B<ftello>(3)) that address limitations of earlier APIs (B<fseek>(3) and B<ftell>(3)) that use I<long int> for file offsets. This macro is implicitly defined if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 500. New programs should not employ this macro; defining B<_XOPEN_SOURCE> as just described or defining B<_FILE_OFFSET_BITS> with the value 64 is the preferred mechanism to achieve the same result.
ru: Данный макрос исторически используется для предоставления определённых функций (в частности, B<fseeko>(3) и B<ftello>(3)), которые обходят адресные ограничения раннего программного интерфейса (B<fseek>(3) и B<ftell>(3)), в котором для файловых смещений использовался I<long int>. Данный макрос неявно определяется, если определён B<_XOPEN_SOURCE> со значением больше или равным 500. В новых программах не нужно определять данный макрос; определение B<_XOPEN_SOURCE> или B<_FILE_OFFSET_BITS> со значением 64 является более предпочтительным механизмом для достижения того же результата.

source: Defining this macro with the value 64 automatically converts references to 32-bit functions and data types related to file I/O and filesystem operations into references to their 64-bit counterparts. This is useful for performing I/O on large files (E<gt> 2 Gigabytes) on 32-bit systems. (Defining this macro permits correctly written programs to use large files with only a recompilation being required.)
ru: При определении данного макроса со значением 64 ссылки на 32-битные функции и типы данных, относящиеся к файловому вводу-выводу и операциям с файловой системой, автоматически преобразуются в их 64-битные прототипы. Это полезно для выполнения ввода-вывода в огромные файлы (E<gt> 2 гигабайт) на 32-битных системах (определение данного макроса позволяет корректно написанным программам использовать огромные файлы, для чего требуется только перекомпиляция).

source: 64-bit systems naturally permit file sizes greater than 2 Gigabytes, and on those systems this macro has no effect.
ru: 64-битные системы сразу позволяют работать с файлами размером больше 2 гигабайт, и на этих системах данный макрос ничего не делает.

source: B<_BSD_SOURCE> (deprecated since glibc 2.20)
ru: B<_BSD_SOURCE> (устарел начиная с glibc 2.20)

source: Defining this macro with any value causes header files to expose BSD-derived definitions.
ru: Определение данного макроса с любым значением приводит к доступности из заголовочных файлов определений BSD.

source: In glibc versions up to and including 2.18, defining this macro also causes BSD definitions to be preferred in some situations where standards conflict, unless one or more of B<_SVID_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, or B<_GNU_SOURCE> is defined, in which case BSD definitions are disfavored. Since glibc 2.19, B<_BSD_SOURCE> no longer causes BSD definitions to be preferred in case of conflicts.
ru: В glibc до версии 2.18 включительно при определении данного макроса также отдаётся приоритет определениям BSD в ситуациях, когда имеется конфликт со стандартами. Если определён один из макросов B<_SVID_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED> или B<_GNU_SOURCE>, то определения BSD не используются. Начиная с glibc 2.19 при наличии макроса B<_BSD_SOURCE> определения BSD в случае конфликта приоритета не имеют.

source: Since glibc 2.20, this macro is deprecated. It now has the same effect as defining B<_DEFAULT_SOURCE>, but generates a compile-time warning (unless B<_DEFAULT_SOURCE> is also defined). Use B<_DEFAULT_SOURCE> instead. To allow code that requires B<_BSD_SOURCE> in glibc 2.19 and earlier and B<_DEFAULT_SOURCE> in glibc 2.20 and later to compile without warnings, define I<both> B<_BSD_SOURCE> and B<_DEFAULT_SOURCE>.
ru: Начиная с glibc 2.20 этот макрос считается устаревшим. Теперь он действует также как определение B<_DEFAULT_SOURCE>, но при компиляции генерируется предупреждение (если также не определён B<_DEFAULT_SOURCE>). Используйте B<_DEFAULT_SOURCE> вместо него. Чтобы для кода, которому требуется B<_BSD_SOURCE> в glibc 2.19 и старее и B<_DEFAULT_SOURCE> в glibc 2.20 и новее, не выдавалось предупреждение при компиляции определите B<_BSD_SOURCE> и B<_DEFAULT_SOURCE> I<одновременно>.

source: B<_SVID_SOURCE> (deprecated since glibc 2.20)
ru: B<_SVID_SOURCE> (устарел начиная с glibc 2.20)

source: Defining this macro with any value causes header files to expose System V-derived definitions. (SVID == System V Interface Definition; see B<standards>(7).)
ru: При определении этого макроса с любым значением из заголовочных файлов становятся доступны определения System V (SVID == System V Interface Definition; смотрите B<standards>(7)).

source: Since glibc 2.20, this macro is deprecated in the same fashion as B<_BSD_SOURCE>.
ru: Начиная с glibc 2.20 этот макрос устарел также как B<_BSD_SOURCE>.

source: B<_DEFAULT_SOURCE> (since glibc 2.19)
ru: B<_DEFAULT_SOURCE> (начиная с glibc 2.19)

source: This macro can be defined to ensure that the "default" definitions are provided even when the defaults would otherwise be disabled, as happens when individual macros are explicitly defined, or the compiler is invoked in one of its "standard" modes (e.g., I<cc\ -std=c99>). Defining B<_DEFAULT_SOURCE> without defining other individual macros or invoking the compiler in one of its "standard" modes has no effect.
ru: Данный макрос можно определить, чтобы точно знать, что будут доступны определения «по умолчанию» даже, если умолчательные макросы отключены, что случается, когда отдельные макросы определяются явно, или компилятор вызывается в одном из своих «стандартных» режимов (например, I<cc\ -std=c99>). Определение B<_DEFAULT_SOURCE> без определения отдельных макросов или вызов компилятора в одном из его «стандартных» режимов не работают.

source: The "default" definitions comprise those required by POSIX.1-2008 and ISO C99, as well as various definitions originally derived from BSD and System V. On glibc 2.19 and earlier, these defaults were approximately equivalent to explicitly defining the following:
ru: Определения «по умолчанию» охватывают все, которые требуются POSIX.1-2008 и ISO C99, а также различные определения появившиеся из BSD и System V. В glibc 2.19 и старее эти значения по умолчанию приблизительно эквивалентны явному определению следующего:

source: B<_ATFILE_SOURCE> (since glibc 2.4)
ru: B<_ATFILE_SOURCE> (начиная с glibc 2.4)

source: Defining this macro with any value causes header files to expose declarations of a range of functions with the suffix "at"; see B<openat>(2). Since glibc 2.10, this macro is also implicitly defined if B<_POSIX_C_SOURCE> is defined with a value greater than or equal to 200809L.
ru: При определении этого макроса с любым значением из заголовочных файлов становятся доступны объявления набора функций с суффиксом «at»; смотрите B<openat>(2). Начиная с glibc 2.10 данный макрос также неявно определяется, если определён B<_POSIX_C_SOURCE> со значением 200809L или больше.

source: Defining this macro (with any value) implicitly defines B<_ATFILE_SOURCE>, B<_LARGEFILE64_SOURCE>, B<_ISOC99_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE> with the value 200809L (200112L in glibc versions before 2.10; 199506L in glibc versions before 2.5; 199309L in glibc versions before 2.1) and B<_XOPEN_SOURCE> with the value 700 (600 in glibc versions before 2.10; 500 in glibc versions before 2.2). In addition, various GNU-specific extensions are also exposed.
ru: При определении этого макроса (с любым значением) неявно определяются B<_ATFILE_SOURCE>, B<_LARGEFILE64_SOURCE>, B<_ISOC99_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE> со значением 200809L (200112L в версиях glibc до 2.10; 199506L в версиях glibc до 2.5; 199309L в версиях glibc до 2.1) и B<_XOPEN_SOURCE> со значением 700 (600 в версиях glibc до 2.10; 500 в версиях glibc до 2.2). Также становятся доступны различные расширения GNU.

source: Since glibc 2.19, defining B<_GNU_SOURCE> also has the effect of implicitly defining B<_DEFAULT_SOURCE>. In glibc versions before 2.20, defining B<_GNU_SOURCE> also had the effect of implicitly defining B<_BSD_SOURCE> and B<_SVID_SOURCE>.
ru: Начиная с glibc 2.19 определение B<_GNU_SOURCE> также неявно определяет B<_DEFAULT_SOURCE>. В glibc до 2.20 версии определение B<_GNU_SOURCE> также неявно определяет B<_BSD_SOURCE> и B<_SVID_SOURCE>.

source: Historically, on various C libraries it was necessary to define this macro in all multithreaded code. (Some C libraries may still require this.) In glibc, this macro also exposed definitions of certain reentrant functions.
ru: В прошлом, этот макрос требовалось определять для различных библиотек C, чтобы работал многонитевой код (некоторым библиотекам C это всё ещё требуется). В glibc этот макрос также включает определения определённых реентерабельных функций.

source: However, glibc has been thread-safe by default for many years; since glibc 2.3, the only effect of defining B<_REENTRANT> has been to enable one or two of the same declarations that are also enabled by defining B<_POSIX_C_SOURCE> with a value of 199606L or greater.
ru: Однако glibc уже давно по умолчанию безопасна для нитей; начиная glibc 2.3 единственным эффектом определения B<_REENTRANT> является включение одного или двух определений, которые также включаются определением B<_POSIX_C_SOURCE> со значением 199606L или больше.

source: B<_REENTRANT> is now obsolete. In glibc 2.25 and later, defining B<_REENTRANT> is equivalent to defining B<_POSIX_C_SOURCE> with the value 199606L. If a higher POSIX conformance level is selected by any other means (such as B<_POSIX_C_SOURCE> itself, B<_XOPEN_SOURCE>, B<_DEFAULT_SOURCE>, or B<_GNU_SOURCE>), then defining B<_REENTRANT> has no effect.
ru: В настоящий момент B<_REENTRANT> устарел. В glibc 2.25 и новее определение B<_REENTRANT> эквивалентно определению B<_POSIX_C_SOURCE> со значением 199606L. Если выбирается более высокий уровень соответствия POSIX (например, самим B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_DEFAULT_SOURCE> или B<_GNU_SOURCE>), то определение не действует B<_REENTRANT>.

source: This macro is automatically defined if one compiles with I<cc\ -pthread>.
ru: Данный макрос автоматически определяется, если выполняется компиляция I<cc\ -pthread>.

source: Synonym for the (deprecated) B<_REENTRANT>, provided for compatibility with some other implementations.
ru: Синоним (устарел) B<_REENTRANT>, предоставляется для совместимости с некоторыми другими реализациями.

source: B<_FORTIFY_SOURCE> (since glibc 2.3.4)
ru: B<_FORTIFY_SOURCE> (начиная с glibc 2.3.4)

source: Defining this macro causes some lightweight checks to be performed to detect some buffer overflow errors when employing various string and memory manipulation functions (for example, B<memcpy>(3), B<memset>(3), B<stpcpy>(3), B<strcpy>(3), B<strncpy>(3), B<strcat>(3), B<strncat>(3), B<sprintf>(3), B<snprintf>(3), B<vsprintf>(3), B<vsnprintf>(3), B<gets>(3), and wide character variants thereof). For some functions, argument consistency is checked; for example, a check is made that B<open>(2) has been supplied with a I<mode> argument when the specified flags include B<O_CREAT>. Not all problems are detected, just some common cases.
ru: Определение этого макроса вызывает выполнение нескольких простых проверок для обнаружения ошибок переполнения буфера, которые возникают в различных функциях работы со строками и памятью (например, B<memcpy>(3), B<memset>(3), B<stpcpy>(3), B<strcpy>(3), B<strncpy>(3), B<strcat>(3), B<strncat>(3), B<sprintf>(3), B<snprintf>(3), B<vsprintf>(3), B<vsnprintf>(3), B<gets>(3) и их варианты для работы с широкими символами). Для некоторых функций проверяется целостность аргумента; например, проверяется, что B<open>(2) передали в аргументе I<mode>, если указан флаг B<O_CREAT>. Обнаруживаются не все проблемы, только самые распространённые.

source: If B<_FORTIFY_SOURCE> is set to 1, with compiler optimization level 1 (I<gcc\ -O1>) and above, checks that shouldn't change the behavior of conforming programs are performed. With B<_FORTIFY_SOURCE> set to 2, some more checking is added, but some conforming programs might fail.
ru: Если значение B<_FORTIFY_SOURCE> равно 1 и уровень оптимизации компиляции равен 1 (I<gcc\ -O1>) и больше, то выполняются проверки, которые не изменяют поведение выверяемых программ. Если значение B<_FORTIFY_SOURCE> равно 2, то добавляются дополнительные проверки, но некоторые выверяемые программы могут завершаться с ошибкой.

source: Some of the checks can be performed at compile time (via macros logic implemented in header files), and result in compiler warnings; other checks take place at run time, and result in a run-time error if the check fails.
ru: Некоторые проверки выполняются во время компиляции (через макросы, реализованных в заголовочных файлах) и вызывают предупреждение компилятора; другие проверки выполняются во время выполнения и приводят к ошибкам времени выполнения.

source: Use of this macro requires compiler support, available with B<gcc>(1) since version 4.0.
ru: Для работы этого макроса требуется поддержка в компиляторе, доступная в B<gcc>(1) начиная с версии 4.0.

source: Default definitions, implicit definitions, and combining definitions
ru: Определения по умолчанию, неявные определения и объединяющие определения

source: If no feature test macros are explicitly defined, then the following feature test macros are defined by default: B<_BSD_SOURCE> (in glibc 2.19 and earlier), B<_SVID_SOURCE> (in glibc 2.19 and earlier), B<_DEFAULT_SOURCE> (since glibc 2.19), B<_POSIX_SOURCE>, and B<_POSIX_C_SOURCE>=200809L (200112L in glibc versions before 2.10; 199506L in glibc versions before 2.4; 199309L in glibc versions before 2.1).
ru: Если макросы тестирования свойств не указаны явно, то по умолчанию действуют следующие макросы тестирования свойств: B<_BSD_SOURCE> (в glibc 2.19 и старее), B<_SVID_SOURCE> (в glibc 2.19 и старее), B<_DEFAULT_SOURCE> (начиная с glibc 2.19), B<_POSIX_SOURCE> и B<_POSIX_C_SOURCE>=200809L (200112L в версиях glibc до 2.10; 199506L в версиях glibc до 2.4; 199309L в версиях glibc до 2.1).

source: If any of B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_BSD_SOURCE> (in glibc 2.19 and earlier), or B<_SVID_SOURCE> (in glibc 2.19 and earlier) is explicitly defined, then B<_BSD_SOURCE>, B<_SVID_SOURCE>, and B<_DEFAULT_SOURCE> are not defined by default.
ru: Если любой из макросов B<__STRICT_ANSI__>, B<_ISOC99_SOURCE>, B<_POSIX_SOURCE>, B<_POSIX_C_SOURCE>, B<_XOPEN_SOURCE>, B<_XOPEN_SOURCE_EXTENDED>, B<_BSD_SOURCE> (в glibc 2.19 и старее) или B<_SVID_SOURCE> (в glibc 2.19 и старее) указан явно, то по умолчанию не определяются макросы B<_BSD_SOURCE>, B<_SVID_SOURCE> и B<_DEFAULT_SOURCE>.

source: If B<_POSIX_SOURCE> and B<_POSIX_C_SOURCE> are not explicitly defined, and either B<__STRICT_ANSI__> is not defined or B<_XOPEN_SOURCE> is defined with a value of 500 or more, then
ru: Если макросы B<_POSIX_SOURCE> и B<_POSIX_C_SOURCE> не указаны явно и не определён B<__STRICT_ANSI__> или B<_XOPEN_SOURCE> определён со значением 500 или более, то

source: B<_POSIX_SOURCE> is defined with the value 1; and
ru: B<_POSIX_SOURCE> определяется со значением 1; и

source: B<_POSIX_C_SOURCE> is defined with one of the following values:
ru: B<_POSIX_C_SOURCE> определяется с одним из следующих значений:

source: 2, if B<_XOPEN_SOURCE> is defined with a value less than 500;
ru: 2, если B<_XOPEN_SOURCE> определён со значением меньше 500;

source: 199506L, if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 500 and less than 600; or
ru: 199506L, если B<_XOPEN_SOURCE> определён со значением 500 или более, но меньше 600; или

source: (since glibc 2.4) 200112L, if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 600 and less than 700.
ru: (начиная с glibc 2.4) 200112L, если B<_XOPEN_SOURCE> определён со значением 600 или более, но меньше 700.

source: (Since glibc 2.10) 200809L, if B<_XOPEN_SOURCE> is defined with a value greater than or equal to 700.
ru: (начиная с glibc 2.10) 200809L, если B<_XOPEN_SOURCE> определён со значением 700 или более.

source: Older versions of glibc do not know about the values 200112L and 200809L for B<_POSIX_C_SOURCE>, and the setting of this macro will depend on the glibc version.
ru: Старые версии glibc не знают о значениях 200112L и 200809L у B<_POSIX_C_SOURCE>, и значение этого макроса зависит от версии glibc.

source: If B<_XOPEN_SOURCE> is undefined, then the setting of B<_POSIX_C_SOURCE> depends on the glibc version: 199506L, in glibc versions before 2.4; 200112L, in glibc 2.4 to 2.9; and 200809L, since glibc 2.10.
ru: Если макрос B<_XOPEN_SOURCE> не определён, то значение B<_POSIX_C_SOURCE> зависит от версии glibc: 199506L в версиях glibc до 2.4; 200112L в glibc от 2.4 до 2.9 и 200809L в glibc 2.10 и новее.

source: Multiple macros can be defined; the results are additive.
ru: Можно определять несколько макросов; результат складывается.

source: POSIX.1 specifies B<_POSIX_C_SOURCE>, B<_POSIX_SOURCE>, and B<_XOPEN_SOURCE>.
ru: В POSIX.1 определены B<_POSIX_C_SOURCE>, B<_POSIX_SOURCE> и B<_XOPEN_SOURCE>.

source: B<_XOPEN_SOURCE_EXTENDED> was specified by XPG4v2 (aka SUSv1), but is not present in SUSv2 and later. B<_FILE_OFFSET_BITS> is not specified by any standard, but is employed on some other implementations.
ru: Макрос B<_XOPEN_SOURCE_EXTENDED> был определён в XPG4v2 (также называемом SUSv1), но отсутствует в SUSv2 и более новых версиях. Макрос B<_FILE_OFFSET_BITS> отсутствует в стандартах, но используется в некоторых других реализациях.

source: B<_BSD_SOURCE>, B<_SVID_SOURCE>, B<_DEFAULT_SOURCE>, B<_ATFILE_SOURCE>, B<_GNU_SOURCE>, B<_FORTIFY_SOURCE>, B<_REENTRANT>, and B<_THREAD_SAFE> are specific to Linux (glibc).
ru: Макросы B<_BSD_SOURCE>, B<_SVID_SOURCE>, B<_DEFAULT_SOURCE>, B<_ATFILE_SOURCE>, B<_GNU_SOURCE>, B<_FORTIFY_SOURCE>, B<_REENTRANT> и B<_THREAD_SAFE> есть только в Linux (glibc).

source: I<E<lt>features.hE<gt>> is a Linux/glibc-specific header file. Other systems have an analogous file, but typically with a different name. This header file is automatically included by other header files as required: it is not necessary to explicitly include it in order to employ feature test macros.
ru: Файл I<E<lt>features.hE<gt>> есть только в Linux/glibc. В других системах есть аналогичный файл, но, обычно, с другим именем. Данный заголовочный файл, если нужен, автоматически включается из других заголовочных файлов: его необязательно явно указывать для использования макросов тестирования свойств.

source: According to which of the above feature test macros are defined, I<E<lt>features.hE<gt>> internally defines various other macros that are checked by other glibc header files. These macros have names prefixed by two underscores (e.g., B<__USE_MISC>). Programs should I<never> define these macros directly: instead, the appropriate feature test macro(s) from the list above should be employed.
ru: Согласно указанным макросам тестирования свойств раньше файла I<E<lt>features.hE<gt>>, внутри него определяются другие различные макросы, которые проверяются в других заголовочных файлах glibc. Эти макросы имеют имена, начинающиеся с двух подчёркиваний (например, B<__USE_MISC>). Программы I<никогда> не должны определять эти макросы самостоятельно: вместо этого нужно задействовать соответствующий макрос тестирования свойств из перечисленных ранее.

source: The program below can be used to explore how the various feature test macros are set depending on the glibc version and what feature test macros are explicitly set. The following shell session, on a system with glibc 2.10, shows some examples of what we would see:
ru: Представленную далее программу можно использовать для изучения какие значения присваиваются макросам тестирования свойств в зависимости от версии glibc и какие макросы тестирования свойств устанавливаются явно. В следующем сеансе оболочки на системе с glibc 2.10 показаны несколько примеров того, что мы увидели:

source: Program source
ru: Исходный код программы

source: The section "Feature Test Macros" under I<info libc>.
ru: Раздел «Макросы тестирования свойств» в I<info libc>.

source: fifo - first-in first-out special file, named pipe
ru: fifo - специальный файл, организующий очередь (first-in first-out), именованный канал
