Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: A file or directory metadata was changed.
ru: Метаданные файла или каталога изменены.

source: A child file or directory was created in a watched parent.
ru: Создан дочерний файл или каталог в отслеживаемом родителе.

source: A child file or directory was deleted in a watched parent.
ru: Удалён дочерний файл или каталог в отслеживаемом родителе.

source: A watched file or directory was deleted.
ru: Отслеживаемый файл или каталог был удалён.

source: A file or directory has been moved from a watched parent directory.
ru: Дочерний файл или каталог был перемещён из отслеживаемого родительского каталога.

source: A file or directory has been moved to a watched parent directory.
ru: Дочерний файл или каталог был помещён в отслеживаемый родительский каталог.

source: A watched file or directory was moved.
ru: Отслеживаемый файл или каталог был перемещён.

source: A file was modified.
ru: Файл изменён.

source: A file that was opened for writing (B<O_WRONLY> or B<O_RDWR>) was closed.
ru: Файл, открытый на запись (B<O_WRONLY> или B<O_RDWR>), закрыт.

source: A file or directory that was opened read-only (B<O_RDONLY>) was closed.
ru: Файл или каталог, открытый только для чтения (B<O_RDONLY>), закрыт.

source: The event queue exceeded the limit of 16384 entries. This limit can be overridden by specifying the B<FAN_UNLIMITED_QUEUE> flag when calling B<fanotify_init>(2).
ru: Очередь событий превысила ограничение в 16384 записи. Это ограничение можно изменить, указав флаг B<FAN_UNLIMITED_QUEUE> при вызове B<fanotify_init>(2).

source: An application wants to read a file or directory, for example using B<read>(2) or B<readdir>(2). The reader must write a response (as described below) that determines whether the permission to access the filesystem object shall be granted.
ru: Приложение хочет прочитать файл или каталог, например, с помощью B<read>(2) или B<readdir>(2). Читатель события должен написать ответ (описано далее) о разрешении доступа к объекту файловой системы.

source: An application wants to open a file or directory. The reader must write a response that determines whether the permission to open the filesystem object shall be granted.
ru: Приложение хочет открыть файл или каталог. Читатель события должен написать ответ о разрешении открытия объекта файловой системы.

source: An application wants to open a file for execution. The reader must write a response that determines whether the permission to open the filesystem object for execution shall be granted. See NOTES in B<fanotify_mark>(2) for additional details.
ru: Приложение хочет открыть файл для выполнения. Читатель должен написать ответ о разрешении открытия объекта файловой системы для выполнения. Смотрите ЗАМЕЧАНИЯ в B<fanotify_mark>(2).

source: To check for any close event, the following bit mask may be used:
ru: Для проверки любого события закрытия может использоваться следующая битовая маска:

source: A file was closed. This is a synonym for:
ru: Файл закрыт. Это синоним:

source: To check for any move event, the following bit mask may be used:
ru: Для проверки любого события перемещения может использоваться следующая битовая маска:

source: A file or directory was moved. This is a synonym for:
ru: Файл или каталог был перемещён. Это синоним для:

source: The fields of the I<fanotify_event_info_fid> structure are as follows:
ru: Поля структуры I<fanotify_event_info_fid>:

source: This is a structure of type I<fanotify_event_info_header>. It is a generic header that contains information used to describe additional information attached to the event. For example, when an fanotify file descriptor is created using B<FAN_REPORT_FID>, the I<info_type> field of this header is set to B<FAN_EVENT_INFO_TYPE_FID>. Event listeners can use this field to check that the additional information received for an event is of the correct type. Additionally, the I<fanotify_event_info_header> also contains a I<len> field. In the current implementation, the value of I<len> is always (event_len - FAN_EVENT_METADATA_LEN).
ru: Структура типа I<fanotify_event_info_header>. Это общий заголовок, содержащий информацию для описания дополнительной информации, присоединяемой к событию. Например, когда файловый дескриптор fanotify создан с использованием B<FAN_REPORT_FID>, поле I<info_type> этого заголовка равно B<FAN_EVENT_INFO_TYPE_FID>. Слушатели события могут использовать это поле для проверки того, что полученная дополнительная информация о событии имеет правильный тип. Также I<fanotify_event_info_header> содержит поле I<len>. В текущей реализации значение I<len> всегда равно (event_len - FAN_EVENT_METADATA_LEN).

source: This is a unique identifier of the filesystem containing the object associated with the event. It is a structure of type I<__kernel_fsid_t> and contains the same value as I<f_fsid> when calling B<statfs>(2).
ru: Уникальный идентификатор файловой системы, содержащей объект, связанный с событием. Это структура имеет тип I<__kernel_fsid_t> и содержит те же значения что и I<f_fsid> при вызове B<statfs>(2).

source: This is a variable length structure of type I<file_handle>. It is an opaque handle that corresponds to a specified object on a filesystem as returned by B<name_to_handle_at>(2). It can be used to uniquely identify a file on a filesystem and can be passed as an argument to B<open_by_handle_at>(2). Note that for directory entry events, such as B<FAN_CREATE>, B<FAN_DELETE>, and B<FAN_MOVE>, the I<file_handle> describes the modified directory and not the created/deleted/moved child object. The events B<FAN_ATTRIB>, B<FAN_DELETE_SELF>, and B<FAN_MOVE_SELF> will carry the I<file_handle> information for the child object if the child object is being watched.
ru: Структура переменной длины, имеет тип I<file_handle>. Это закрытый описатель, который соответствует заданному объекту файловой системы, возвращается B<name_to_handle_at>(2). Её можно использовать как уникально определяемую файл в файловой системе и передавать аргументом в B<open_by_handle_at>(2). Заметим, что для событий элементов каталога, таких как B<FAN_CREATE>, B<FAN_DELETE>, и B<FAN_MOVE>, значение I<file_handle> описывает изменяемый каталог, а не созданный/удалённый/перемещённый дочерний объект. События B<FAN_ATTRIB>, B<FAN_DELETE_SELF> и B<FAN_MOVE_SELF> будут содержать информацию I<file_handle> о дочернем объекте, если дочерний объект отслеживается.

source: The following macros are provided to iterate over a buffer containing fanotify event metadata returned by a B<read>(2) from an fanotify file descriptor:
ru: Следующие макросы позволяют обходить буфер с метаданными событий fanotify, возвращаемый B<read>(2) из файлового дескриптора fanotify:

source: This macro checks the remaining length I<len> of the buffer I<meta> against the length of the metadata structure and the I<event_len> field of the first metadata structure in the buffer.
ru: Этот макрос сверяет оставшуюся длину I<len> буфера I<meta> с длиной структуры метаданных и полем I<event_len> из первой структуры метаданных в буфере.

source: This macro uses the length indicated in the I<event_len> field of the metadata structure pointed to by I<meta> to calculate the address of the next metadata structure that follows I<meta>. I<len> is the number of bytes of metadata that currently remain in the buffer. The macro returns a pointer to the next metadata structure that follows I<meta>, and reduces I<len> by the number of bytes in the metadata structure that has been skipped over (i.e., it subtracts I<meta-E<gt>event_len> from I<len>).
ru: Этот макрос использует длину из поля I<event_len> структуры метаданных, на которую указывает I<meta>, для вычисления адреса следующей структуры метаданных, которая находится после I<meta>. В поле I<len> указано количество байт метаданных, оставшихся в буфере. Макрос возвращает указатель на следующую структуру метаданных после I<meta> и уменьшает I<len> на количество байт в структуре метаданных, которая была пропущена (т. е., вычитает I<meta-E<gt>event_len> из I<len>).

source: In addition, there is:
ru: Дополнительно есть:

source: This macro returns the size (in bytes) of the structure I<fanotify_event_metadata>. This is the minimum size (and currently the only size) of any event metadata.
ru: Этот макрос возвращает размер (в байтах) структуры I<fanotify_event_metadata>. Это минимальный размер (и, в настоящее время, единственный) метаданных любого события.

source: Monitoring an fanotify file descriptor for events
ru: Отслеживание событий через файловый дескриптор fanotify

source: When an fanotify event occurs, the fanotify file descriptor indicates as readable when passed to B<epoll>(7), B<poll>(2), or B<select>(2).
ru: Когда возникает событие fanotify файловый дескриптор fanotify помечается как доступный для чтения при его передаче в B<epoll>(7), B<poll>(2) или B<select>(2).

source: Dealing with permission events
ru: Работа с событиями доступа

source: For permission events, the application must B<write>(2) a structure of the following form to the fanotify file descriptor:
ru: Для событий доступа приложение должно записать (B<write>(2)) в файловый дескриптор fanotify следующую структуру:

source: The fields of this structure are as follows:
ru: Поля этой структуры имеют следующее назначение:

source: This is the file descriptor from the structure I<fanotify_event_metadata>.
ru: Файловый дескриптор из структуры I<fanotify_event_metadata>.

source: This field indicates whether or not the permission is to be granted. Its value must be either B<FAN_ALLOW> to allow the file operation or B<FAN_DENY> to deny the file operation.
ru: В этом поле указывает о разрешении доступа или запрещении. Данное значение должно быть равно B<FAN_ALLOW>, чтобы разрешить операцию с файлом, или B<FAN_DENY> для запрета.

source: If access is denied, the requesting application call will receive an B<EPERM> error.
ru: Если доступ запрещается, то запрашивающее приложение получит ошибку B<EPERM>.

source: Closing the fanotify file descriptor
ru: Закрытие файлового дескриптора fanotify

source: When all file descriptors referring to the fanotify notification group are closed, the fanotify group is released and its resources are freed for reuse by the kernel. Upon B<close>(2), outstanding permission events will be set to allowed.
ru: Когда все файловые дескрипторы, указывающие на группу уведомления fanotify, закрыты, группа fanotify освобождается и её ресурсы становятся доступны ядру для повторного использования. После B<close>(2) все оставшиеся непросмотренные события доступа будут разрешены.

source: The file I</proc/[pid]/fdinfo/[fd]> contains information about fanotify marks for file descriptor I<fd> of process I<pid>. See B<proc>(5) for details.
ru: Файл I</proc/[pid]/fdinfo/[fd]> содержит информацию о метках fanotify для файлового дескриптора I<fd> процесса I<pid> Подробности смотрите в B<proc>(5).

source: In addition to the usual errors for B<read>(2), the following errors can occur when reading from the fanotify file descriptor:
ru: Кроме обычных ошибок B<read>(2) при чтении из файлового дескриптора fanotify могут возникать следующие ошибки:

source: The buffer is too small to hold the event.
ru: Буфер слишком мал для хранения события.

source: The per-process limit on the number of open files has been reached. See the description of B<RLIMIT_NOFILE> in B<getrlimit>(2).
ru: Достигнуто максимальное попроцессное количество открытых файлов. Смотрите описание B<RLIMIT_NOFILE> в B<getrlimit>(2).

source: The system-wide limit on the total number of open files has been reached. See I</proc/sys/fs/file-max> in B<proc>(5).
ru: Достигнут предел на общее количество открытых файлов в системе. Смотрите I</proc/sys/fs/file-max> в B<proc>(5).

source: This error is returned by B<read>(2) if B<O_RDWR> or B<O_WRONLY> was specified in the I<event_f_flags> argument when calling B<fanotify_init>(2) and an event occurred for a monitored file that is currently being executed.
ru: Эта ошибка возвращается B<read>(2), если при вызове B<fanotify_init>(2) в аргументе I<event_f_flags> был указан B<O_RDWR> или B<O_WRONLY> и произошло событие с отслеживаемым файлом, который в данный момент выполняется.

source: In addition to the usual errors for B<write>(2), the following errors can occur when writing to the fanotify file descriptor:
ru: Кроме обычных ошибок B<write>(2) при записи в файловый дескриптор fanotify могут возникать следующие ошибки:

source: Fanotify access permissions are not enabled in the kernel configuration or the value of I<response> in the response structure is not valid.
ru: Свойство для проверки прав доступа fanotify не включено в настройках ядра или некорректное значение I<response> в структуре ответа.

source: The file descriptor I<fd> in the response structure is not valid. This may occur when a response for the permission event has already been written.
ru: Некорректный файловый дескриптор I<fd> в структуре ответа. Это может происходить, когда ответ на право доступа уже был записан.

source: VERSIONS
ru: ВЕРСИИ

source: The fanotify API was introduced in version 2.6.36 of the Linux kernel and enabled in version 2.6.37. Fdinfo support was added in version 3.8.
ru: Программный интерфейс fanotify представлен в версии 2.6.36 ядра Linux и включён в версии 2.6.37. Поддержка fdinfo была добавлена в версии 3.8.

source: The fanotify API is Linux-specific.
ru: Программный интерфейс fanotify есть только в Linux.

source: The fanotify API is available only if the kernel was built with the B<CONFIG_FANOTIFY> configuration option enabled. In addition, fanotify permission handling is available only if the B<CONFIG_FANOTIFY_ACCESS_PERMISSIONS> configuration option is enabled.
ru: Программный интерфейс fanotify доступен только, если ядро собрано с включённым параметром настройки B<CONFIG_FANOTIFY>. Также, работа с доступом в fanotify доступна только, если включён параметр настройки B<CONFIG_FANOTIFY_ACCESS_PERMISSIONS>.

source: Limitations and caveats
ru: Ограничения и подводные камни

source: Fanotify reports only events that a user-space program triggers through the filesystem API. As a result, it does not catch remote events that occur on network filesystems.
ru: Fanotify сообщает только о событиях, которые возникли при использовании пользовательскими программами программного интерфейса файловой системы. Поэтому события об обращении к файлам в сетевых файловых системах не отлавливаются.

source: The fanotify API does not report file accesses and modifications that may occur because of B<mmap>(2), B<msync>(2), and B<munmap>(2).
ru: Программный интерфейс fanotify не сообщает о доступе и изменениях, которые могут произойти из-за B<mmap>(2), B<msync>(2) и B<munmap>(2).

source: Events for directories are created only if the directory itself is opened, read, and closed. Adding, removing, or changing children of a marked directory does not create events for the monitored directory itself.
ru: События для каталогов создаются только, если сам каталог открывается, читается и закрывается. Добавление, удаление и изменение потомков отслеживаемого каталога не приводит к возникновению событий.

source: Fanotify monitoring of directories is not recursive: to monitor subdirectories under a directory, additional marks must be created. (But note that the fanotify API provides no way of detecting when a subdirectory has been created under a marked directory, which makes recursive monitoring difficult.) Monitoring mounts offers the capability to monitor a whole directory tree. Monitoring filesystems offers the capability to monitor changes made from any mount of a filesystem instance.
ru: Fanotify не следит за каталогами рекурсивно: чтобы следить за подкаталогами каталога, нужно их явно пометить (и, заметим, что программный интерфейс fanotify не позволяет отслеживать создание подкаталога, что затрудняет рекурсивное слежение). Отслеживание точек монтирования позволяет следить за всем деревом каталогов. Отслеживание файловых систем позволяет следить за изменениями, сделанными в любом смонтированном экземпляре файловой системы.

source: The event queue can overflow. In this case, events are lost.
ru: Очередь событий может переполниться. В этом случае события теряются.

source: BUGS
ru: ДЕФЕКТЫ

source: Before Linux 3.19, B<fallocate>(2) did not generate fanotify events. Since Linux 3.19, calls to B<fallocate>(2) generate B<FAN_MODIFY> events.
ru: До Linux 3.19, B<fallocate>(2) не генерировал событий fanotify. Начиная с Linux 3.19, вызовы B<fallocate>(2) генерируют событие B<FAN_MODIFY>.

source: As of Linux 3.17, the following bugs exist:
ru: В Linux 3.17 существуют следующие дефекты:

source: On Linux, a filesystem object may be accessible through multiple paths, for example, a part of a filesystem may be remounted using the I<--bind> option of B<mount>(8). A listener that marked a mount will be notified only of events that were triggered for a filesystem object using the same mount. Any other event will pass unnoticed.
ru: В Linux объект файловой системы может быть доступен через несколько путей, например, часть файловой системы может быть перемонтирована B<mount>(8) с использованием параметра I<--bind>. Ожидающий слушатель получит уведомления об объекте файловой системы только из запрошенной точки монтирования. О событиях из других точек уведомлений не поступит.

source: When an event is generated, no check is made to see whether the user ID of the receiving process has authorization to read or write the file before passing a file descriptor for that file. This poses a security risk, when the B<CAP_SYS_ADMIN> capability is set for programs executed by unprivileged users.
ru: При генерации события не делается проверка, что пользовательскому ID получающего процесса разрешено читать или писать в файл перед передачей файлового дескриптора на этот файл. Это представляет некоторый риск безопасности, когда у программ, выполняющихся непривилегированными пользователями, есть мандат B<CAP_SYS_ADMIN>.

source: If a call to B<read>(2) processes multiple events from the fanotify queue and an error occurs, the return value will be the total length of the events successfully copied to the user-space buffer before the error occurred. The return value will not be -1, and I<errno> will not be set. Thus, the reading application has no way to detect the error.
ru: Если вызов B<read>(2) получает несколько событий из очереди fanotify и возникает ошибка, будет возвращена полная длина событий, которые были успешно скопированы в буфер пользовательского пространства до ошибки. Возвращаемое значение не будет равно -1, и в I<errno> не записывается код ошибки. То есть читающее приложение не может обнаружить ошибку.

source: EXAMPLE
ru: ПРИМЕР

source: The two example programs below demonstrate the usage of the fanotify API.
ru: Далее показано два примера программы, в которых продемонстрированоиспользование программного интерфейса fanotify.

source: Example program: fanotify_example.c
ru: Программа-пример: fanotify_example.c

source: The first program is an example of fanotify being used with its event object information passed in the form of a file descriptor. The program marks the mount point passed as a command-line argument and waits for events of type B<FAN_OPEN_PERM> and B<FAN_CLOSE_WRITE>. When a permission event occurs, a B<FAN_ALLOW> response is given.
ru: В первой программе показано как использовать fanotify с информацией об событийном объекте, передаваемом в виде файлового дескриптора. Программа помечает точку монтирования, переданную в аргументе командной строки, и ждёт событий с типом B<FAN_OPEN_PERM> и B<FAN_CLOSE_WRITE>. При возникновении событий доступа выдаёт ответ B<FAN_ALLOW>.

source: The following shell session shows an example of running this program. This session involved editing the file I</home/user/temp/notes>. Before the file was opened, a B<FAN_OPEN_PERM> event occurred. After the file was closed, a B<FAN_CLOSE_WRITE> event occurred. Execution of the program ends when the user presses the ENTER key.
ru: В сеансе оболочки далее показан пример запуска программы. В сеансе выполняется редактирование файла I</home/user/temp/notes>. Перед открытием файла возникает событие B<FAN_OPEN_PERM>. После закрытия файла возникает событие B<FAN_CLOSE_WRITE>. Выполнение программы заканчивается после нажатия пользователем клавиши ENTER.

source: # B<./fanotify_example /home> Press enter key to terminate. Listening for events. FAN_OPEN_PERM: File /home/user/temp/notes FAN_CLOSE_WRITE: File /home/user/temp/notes
ru: # B<./fanotify_example /home> Нажмите enter для завершения работы. Ожидание событий. FAN_OPEN_PERM: Файл /home/user/temp/notes FAN_CLOSE_WRITE: Файл /home/user/temp/notes

source: Listening for events stopped.
ru: Ожидание событий прекращено.

source: Program source: fanotify_example.c
ru: Исходный код программы: fanotify_example.c

source: #define _GNU_SOURCE /* Needed to get O_LARGEFILE definition */ #include E<lt>errno.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>poll.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/fanotify.hE<gt> #include E<lt>unistd.hE<gt>
ru: #define _GNU_SOURCE /* для получения определения O_LARGEFILE */ #include E<lt>errno.hE<gt> #include E<lt>fcntl.hE<gt> #include E<lt>limits.hE<gt> #include E<lt>poll.hE<gt> #include E<lt>stdio.hE<gt> #include E<lt>stdlib.hE<gt> #include E<lt>sys/fanotify.hE<gt> #include E<lt>unistd.hE<gt>

source: /* Read all available fanotify events from the file descriptor \(aqfd\(aq */
ru: /* читаем все доступные события fanotify из файлового дескриптора «fd» */

source: /* Loop while events can be read from fanotify file descriptor */
ru: /* проходим по всем событиям, которые можем прочитать из файлового дескриптора fanotify */

source: /* Read some events */
ru: /* читаем несколько событий */

source: /* Check if end of available data reached */
ru: /* проверяем, достигнут ли конец доступных данных */

source: /* Point to the first event in the buffer */
ru: /* выбираем первое событие в буфере */

source: /* Loop over all events in the buffer */
ru: /* проходим по всем событиям в буфере */

source: /* Check that run-time and compile-time structures match */
ru: /* проверяем, что структуры, использовавшиеся при сборке, идентичны структурам при выполнении */

source: if (metadata-E<gt>vers != FANOTIFY_METADATA_VERSION) { fprintf(stderr, "Mismatch of fanotify metadata version.\en"); exit(EXIT_FAILURE); }
ru: if (metadata-E<gt>vers != FANOTIFY_METADATA_VERSION) { fprintf(stderr, "Версия метаданных fanotify не совпадает.\en"); exit(EXIT_FAILURE); }

source: /* metadata-E<gt>fd contains either FAN_NOFD, indicating a queue overflow, or a file descriptor (a nonnegative integer). Here, we simply ignore queue overflow. */
ru: /* metadata-E<gt>fd содержит или FAN_NOFD, указывающее на переполнение очереди, или файловый дескриптор (неотрицательное целое). Здесь мы просто игнорируем переполнение очереди. */

source: /* Handle open permission event */
ru: /* обрабатываем событие на право открытия */

source: /* Allow file to be opened */
ru: /* разрешаем открыть файл */

source: /* Handle closing of writable file event */
ru: /* обрабатываем событие закрытия записываемого файла */

source: /* Retrieve and print pathname of the accessed file */
ru: /* получаем и выводим имя файла, к которому отслеживается доступ */

source: path[path_len] = \(aq\e0\(aq; printf("File %s\en", path);
ru: path[path_len] = \(aq\e0\(aq; printf("Файл %s\en", path);

source: /* Close the file descriptor of the event */
ru: /* закрываем файловый дескриптор из события */

source: /* Advance to next event */
ru: /* переходим на следующее событие */

source: /* Check mount point is supplied */
ru: /* проверяем заданную точку монтирования */
