Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: If this seal is set, any further call to B<fcntl>() with B<F_ADD_SEALS> fails with the error B<EPERM>. Therefore, this seal prevents any modifications to the set of seals itself. If the initial set of seals of a file includes B<F_SEAL_SEAL>, then this effectively causes the set of seals to be constant and locked.
ru: Если печать установлена, то последующий вызов B<fcntl>() с B<F_ADD_SEALS> завершится ошибкой B<EPERM>. Таки образом, данная печать предотвращает изменения самого набора печатей. Если начальный набор печатей файла содержит B<F_SEAL_SEAL>, то он является постоянным и неизменяемым.

source: If this seal is set, the file in question cannot be reduced in size. This affects B<open>(2) with the B<O_TRUNC> flag as well as B<truncate>(2) and B<ftruncate>(2). Those calls fail with B<EPERM> if you try to shrink the file in question. Increasing the file size is still possible.
ru: Если эта печать установлена, то нельзя уменьшить размер файла. Она влияет на B<open>(2) с флагом B<O_TRUNC>, а также на B<truncate>(2) и B<ftruncate>(2). Эти вызовы завершаются ошибкой B<EPERM>, если пытаются уменьшить файл. Увеличение размера файла по-прежнему возможно.

source: If this seal is set, the size of the file in question cannot be increased. This affects B<write>(2) beyond the end of the file, B<truncate>(2), B<ftruncate>(2), and B<fallocate>(2). These calls fail with B<EPERM> if you use them to increase the file size. If you keep the size or shrink it, those calls still work as expected.
ru: Если эта печать установлена, то нельзя увеличить размер файла. Она влияет на B<write>(2) за концом файла, B<truncate>(2), B<ftruncate>(2) и B<fallocate>(2). Эти вызовы завершаются ошибкой B<EPERM>, если пытаются увеличить файл. Уменьшение размера файла по-прежнему возможно.

source: If this seal is set, you cannot modify the contents of the file. Note that shrinking or growing the size of the file is still possible and allowed. Thus, this seal is normally used in combination with one of the other seals. This seal affects B<write>(2) and B<fallocate>(2) (only in combination with the B<FALLOC_FL_PUNCH_HOLE> flag). Those calls fail with B<EPERM> if this seal is set. Furthermore, trying to create new shared, writable memory-mappings via B<mmap>(2) will also fail with B<EPERM>.
ru: Если эта печать установлена, то нельзя изменить содержимое файла. Заметим, что уменьшение или увеличение файла по-прежнему возможно. То есть данная печать, обычно, используется в комбинации с одной из этих печатей. Данная печать влияет на B<write>(2) и B<fallocate>(2) (только для флага B<FALLOC_FL_PUNCH_HOLE>). Эти вызовы завершаются ошибкой B<EPERM>. Кроме этого, попытка создать новое общее, доступное на запись отображение через B<mmap>(2) также завершится ошибкой B<EPERM>.

source: Using the B<F_ADD_SEALS> operation to set the B<F_SEAL_WRITE> seal fails with B<EBUSY> if any writable, shared mapping exists. Such mappings must be unmapped before you can add this seal. Furthermore, if there are any asynchronous I/O operations (B<io_submit>(2)) pending on the file, all outstanding writes will be discarded.
ru: Использование операции B<F_ADD_SEALS> для установки B<F_SEAL_WRITE> завершается ошибкой B<EBUSY>, если существует доступное на запись общее отображение. Такие отображения должны быть удалены перед добавлением данной печати. Кроме этого, если у файла есть асинхронные операции, ожидающие ввода-вывода (B<io_submit>(2)), то все отложенные операции записи будут отброшены.

source: File read/write hints
ru: Подсказки чтения/записи файла

source: Write lifetime hints can be used to inform the kernel about the relative expected lifetime of writes on a given inode or via a particular open file description. (See B<open>(2) for an explanation of open file descriptions.) In this context, the term "write lifetime" means the expected time the data will live on media, before being overwritten or erased.
ru: Подсказки срока службы записи можно использовать для уведомления ядра об относительно ожидаемом сроке службы записи заданной иноды и открытого файлового описания (об открытых файловых описаниях читайте в B<open>(2)). В этом контексте термин «срок службы записи» (write lifetime) означает ожидаемое время, которое будут существовать данные на носителе до их перезаписи или стирания.

source: An application may use the different hint values specified below to separate writes into different write classes, so that multiple users or applications running on a single storage back-end can aggregate their I/O patterns in a consistent manner. However, there are no functional semantics implied by these flags, and different I/O classes can use the write lifetime hints in arbitrary ways, so long as the hints are used consistently.
ru: В приложении можно использовать различные значения подсказок, перечисленные ниже, для разделения записей на различные классы, чтобы несколько пользователей или приложений, работающие на одном аппаратном хранилище могли объединить свои шаблоны ввода-вывода в непротиворечивую форму. Однако, для флагов не подразумевается какая-то функциональная семантика, и для различных классов ввода-вывода можно использовать подсказки срока службы записи произвольным образом, пока подсказки не противоречат друг другу.

source: The following operations can be applied to the file descriptor, I<fd>:
ru: Следующие операции могут применяться к файловому дескриптору I<fd>:

source: B<F_GET_RW_HINT> (I<uint64_t *>; since Linux 4.13)
ru: B<F_GET_RW_HINT> (I<uint64_t *>; начиная с Linux 4.13)

source: Returns the value of the read/write hint associated with the underlying inode referred to by I<fd>.
ru: Возвращает значение подсказки чтения/записи, связанной с инодой, на которую указывает I<fd>.

source: B<F_SET_RW_HINT> (I<uint64_t *>; since Linux 4.13)
ru: B<F_SET_RW_HINT> (I<uint64_t *>; начиная с Linux 4.13)

source: Sets the read/write hint value associated with the underlying inode referred to by I<fd>. This hint persists until either it is explicitly modified or the underlying filesystem is unmounted.
ru: Изменяет значение подсказки чтения/записи, связанной с инодой, на которую указывает I<fd>. Данная подсказка действует до тех пор, пока не будет явно изменена или не будет размонтирована нижележащая файловая система.

source: B<F_GET_FILE_RW_HINT> (I<uint64_t *>; since Linux 4.13)
ru: B<F_GET_FILE_RW_HINT> (I<uint64_t *>; начиная с Linux 4.13)

source: Returns the value of the read/write hint associated with the open file description referred to by I<fd>.
ru: Возвращает значение подсказки чтения/записи, связанной с открытым файловым описанием, на которое указывает I<fd>.

source: B<F_SET_FILE_RW_HINT> (I<uint64_t *>; since Linux 4.13)
ru: B<F_SET_FILE_RW_HINT> (I<uint64_t *>; начиная с Linux 4.13)

source: Sets the read/write hint value associated with the open file description referred to by I<fd>.
ru: Изменяет значение подсказки чтения/записи, связанной с открытым файловым описанием, на которое указывает I<fd>.

source: If an open file description has not been assigned a read/write hint, then it shall use the value assigned to the inode, if any.
ru: Если открытому файловому описанию не была назначена подсказка чтения/записи, то будет использоваться значение (если есть), назначенное иноде.

source: The following read/write hints are valid since Linux 4.13:
ru: Начиная с Linux 4.13, действуют следующие подсказки чтения/записи:

source: No specific hint has been set. This is the default value.
ru: Подсказка не задана. Это значение по умолчанию.

source: No specific write lifetime is associated with this file or inode.
ru: Срока службы записи, связанного с этим файлом или инодой, не задано.

source: Data written to this inode or via this open file description is expected to have a short lifetime.
ru: Ожидается, что данные, записанные в эту иноду или через открытое файловое описание, будут иметь короткий срок службы.

source: Data written to this inode or via this open file description is expected to have a lifetime longer than data written with B<RWH_WRITE_LIFE_SHORT>.
ru: Ожидается, что данные, записанные в эту иноду или через открытое файловое описание, будут иметь срок службы длиннее, чем данные, записанные с B<RWH_WRITE_LIFE_SHORT>.

source: Data written to this inode or via this open file description is expected to have a lifetime longer than data written with B<RWH_WRITE_LIFE_MEDIUM>.
ru: Ожидается, что данные, записанные в эту иноду или через открытое файловое описание, будут иметь срок службы длиннее, чем данные, записанные с B<RWH_WRITE_LIFE_MEDIUM>.

source: Data written to this inode or via this open file description is expected to have a lifetime longer than data written with B<RWH_WRITE_LIFE_LONG>.
ru: Ожидается, что данные, записанные в эту иноду или через открытое файловое описание, будут иметь срок службы длиннее, чем данные, записанные с B<RWH_WRITE_LIFE_LONG>.

source: All the write-specific hints are relative to each other, and no individual absolute meaning should be attributed to them.
ru: Все подсказки записи соотносятся друг с другом и нет отдельного абсолютного смысла им предписываемого.

source: For a successful call, the return value depends on the operation:
ru: При успешном выполнении возвращаемое значение зависит от используемой команды:

source: The new file descriptor.
ru: Новый файловый дескриптор.

source: Value of file descriptor flags.
ru: Значение флагов файлового дескриптора.

source: Value of file status flags.
ru: Значение флагов состояния файла.

source: Type of lease held on file descriptor.
ru: Тип аренды, установленной на файлом дескрипторе.

source: Value of file descriptor owner.
ru: Значение, представляющее собой владельца файлового дескриптора.

source: Value of signal sent when read or write becomes possible, or zero for traditional B<SIGIO> behavior.
ru: Значение сигнала, посылаемого когда становится возможным чтение или запись или ноль для традиционного поведения B<SIGIO>.

source: The pipe capacity.
ru: Ёмкость канала.

source: A bit mask identifying the seals that have been set for the inode referred to by I<fd>.
ru: Битовая маска, описывающая печати inode, на которую указывает I<fd>.

source: All other commands
ru: Все остальные команды

source: Zero.
ru: Ноль.

source: On error, -1 is returned, and I<errno> is set appropriately.
ru: В случае ошибки возвращается -1 и значение I<errno> устанавливается соответствующим образом.

source: B<EACCES> or B<EAGAIN>
ru: B<EACCES> или B<EAGAIN>

source: Operation is prohibited by locks held by other processes.
ru: Операция запрещена блокировками, которые удерживаются другими процессами.

source: The operation is prohibited because the file has been memory-mapped by another process.
ru: Операция запрещена, потому что файл отображается в память другим процессом.

source: I<fd> is not an open file descriptor
ru: Значение I<fd> не является открытым файловым дескриптором.

source: I<cmd> is B<F_SETLK> or B<F_SETLKW> and the file descriptor open mode doesn't match with the type of lock requested.
ru: Значение I<cmd> равно B<F_SETLK> или B<F_SETLKW>, но режим открытия файлового дескриптора не совпадает с типом запрошенной блокировки.

source: I<cmd> is B<F_SETPIPE_SZ> and the new pipe capacity specified in I<arg> is smaller than the amount of buffer space currently used to store data in the pipe.
ru: Значение I<cmd> равно B<F_SETPIPE_SZ> и новая ёмкость канала, указанная в I<arg>, меньше размера буферного пространства, используемого в данный момент для хранения данных в канале.

source: I<cmd> is B<F_ADD_SEALS>, I<arg> includes B<F_SEAL_WRITE>, and there exists a writable, shared mapping on the file referred to by I<fd>.
ru: Значение I<cmd> равно B<F_ADD_SEALS>, в I<arg> содержится B<F_SEAL_WRITE> и существует доступное на запись, общее отображение файла, на который указывает I<fd>.

source: It was detected that the specified B<F_SETLKW> command would cause a deadlock.
ru: Было обнаружено, что указанная команда B<F_SETLKW> привела бы к взаимной блокировке (deadlock).

source: I<lock> is outside your accessible address space.
ru: Значение I<lock> находится за пределами доступного адресного пространства.

source: I<cmd> is B<F_SETLKW> or B<F_OFD_SETLKW> and the operation was interrupted by a signal; see B<signal>(7).
ru: Значение I<cmd> равно B<F_SETLKW> или B<F_OFD_SETLKW> и операция была прервана сигналом; смотрите B<signal>(7)).

source: I<cmd> is B<F_GETLK>, B<F_SETLK>, B<F_OFD_GETLK>, or B<F_OFD_SETLK>, and the operation was interrupted by a signal before the lock was checked or acquired. Most likely when locking a remote file (e.g., locking over NFS), but can sometimes happen locally.
ru: Значение I<cmd> равно B<F_GETLK>, B<F_SETLK>, B<F_OFD_GETLK> или B<F_OFD_SETLK> и операция была прервана сигналом перед тем как блокировка была проверена или установлена. Большинство таких ошибок случается при блокировке удалённого файла (например, блокировка через NFS), но иногда такое может случаться и с локальным файлом.

source: The value specified in I<cmd> is not recognized by this kernel.
ru: Значение I<cmd> не распознано ядром.

source: I<cmd> is B<F_ADD_SEALS> and I<arg> includes an unrecognized sealing bit.
ru: Значение I<cmd> равно B<F_ADD_SEALS> и I<arg> содержит бит не распознанной печати.

source: I<cmd> is B<F_ADD_SEALS> or B<F_GET_SEALS> and the filesystem containing the inode referred to by I<fd> does not support sealing.
ru: Значение I<cmd> равно B<F_ADD_SEALS> или B<F_GET_SEALS> и файловая система, содержащая inode, на которую указывает I<fd>, не поддерживает опечатывание.

source: I<cmd> is B<F_DUPFD> and I<arg> is negative or is greater than the maximum allowable value (see the discussion of B<RLIMIT_NOFILE> in B<getrlimit>(2)).
ru: Значение I<cmd> равно B<F_DUPFD> и значение I<arg> отрицательное или больше максимально возможного значения (смотрите описание B<RLIMIT_NOFILE> в B<getrlimit>(2)).

source: I<cmd> is B<F_SETSIG> and I<arg> is not an allowable signal number.
ru: Значение I<cmd> равно B<F_SETSIG> и значение I<arg> не содержит допустимый номер сигнала.

source: I<cmd> is B<F_OFD_SETLK>, B<F_OFD_SETLKW>, or B<F_OFD_GETLK>, and I<l_pid> was not specified as zero.
ru: Значение I<cmd> равно B<F_OFD_SETLK>, B<F_OFD_SETLKW> или B<F_OFD_GETLK>, но значение I<l_pid> не равно нулю.

source: I<cmd> is B<F_DUPFD> and the per-process limit on the number of open file descriptors has been reached.
ru: Значение I<cmd> равно B<F_DUPFD> и было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: Too many segment locks open, lock table is full, or a remote locking protocol failed (e.g., locking over NFS).
ru: Открыто слишком много блокировок сегментов, таблица блокировок заполнена или ошибка протокола удалённой блокировки (например, при блокировке через NFS).

source: B<F_NOTIFY> was specified in I<cmd>, but I<fd> does not refer to a directory.
ru: Значение I<cmd> равно B<F_NOTIFY>, I<fd> не ссылается на каталог.

source: I<cmd> is B<F_SETPIPE_SZ> and the soft or hard user pipe limit has been reached; see B<pipe>(7).
ru: Значение I<cmd> равно B<F_SETPIPE_SZ> и достигнуто мягкое или жёсткое ограничение канала пользователя; смотрите B<pipe>(7).

source: Attempted to clear the B<O_APPEND> flag on a file that has the append-only attribute set.
ru: Попытка сбросить флаг B<O_APPEND> на файле, который открыт с атрибутом только для добавления.

source: I<cmd> was B<F_ADD_SEALS>, but I<fd> was not open for writing or the current set of seals on the file already includes B<F_SEAL_SEAL>.
ru: Значение I<cmd> равно B<F_ADD_SEALS>, но I<fd> не открыт на запись или текущий набор печатей файла уже содержит B<F_SEAL_SEAL>.

source: SVr4, 4.3BSD, POSIX.1-2001. Only the operations B<F_DUPFD>, B<F_GETFD>, B<F_SETFD>, B<F_GETFL>, B<F_SETFL>, B<F_GETLK>, B<F_SETLK>, and B<F_SETLKW> are specified in POSIX.1-2001.
ru: SVr4, 4.3BSD, POSIX.1-2001. В POSIX.1-2001 указаны только команды B<F_DUPFD>, B<F_GETFD>, B<F_SETFD>, B<F_GETFL>, B<F_SETFL>, B<F_GETLK>, B<F_SETLK> и B<F_SETLKW>.

source: B<F_GETOWN> and B<F_SETOWN> are specified in POSIX.1-2001. (To get their definitions, define either B<_XOPEN_SOURCE> with the value 500 or greater, or B<_POSIX_C_SOURCE> with the value 200809L or greater.)
ru: Значения B<F_GETOWN> и B<F_SETOWN> определены в POSIX.1-2001. Для получения их определений, определите B<_XOPEN_SOURCE> со значением 500 или больше или B<_POSIX_C_SOURCE> со значением 200809L или больше.

source: B<F_DUPFD_CLOEXEC> is specified in POSIX.1-2008. (To get this definition, define B<_POSIX_C_SOURCE> with the value 200809L or greater, or B<_XOPEN_SOURCE> with the value 700 or greater.)
ru: B<F_DUPFD_CLOEXEC> указана в POSIX.1-2008. Для получения определения, определите B<_POSIX_C_SOURCE> со значением 200809L или больше, или B<_XOPEN_SOURCE> со значением 700 или больше.

source: B<F_GETOWN_EX>, B<F_SETOWN_EX>, B<F_SETPIPE_SZ>, B<F_GETPIPE_SZ>, B<F_GETSIG>, B<F_SETSIG>, B<F_NOTIFY>, B<F_GETLEASE>, and B<F_SETLEASE> are Linux-specific. (Define the B<_GNU_SOURCE> macro to obtain these definitions.)
ru: Команды B<F_GETOWN_EX>, B<F_SETOWN_EX>, B<F_SETPIPE_SZ>, B<F_GETPIPE_SZ>, B<F_GETSIG>, B<F_SETSIG>, B<F_NOTIFY>, B<F_GETLEASE> и B<F_SETLEASE> есть только в Linux. Для задействования этих определений определите макрос B<_GNU_SOURCE>.

source: B<F_OFD_SETLK>, B<F_OFD_SETLKW>, and B<F_OFD_GETLK> are Linux-specific (and one must define B<_GNU_SOURCE> to obtain their definitions), but work is being done to have them included in the next version of POSIX.1.
ru: Значения B<F_OFD_SETLK>, B<F_OFD_SETLKW> и B<F_OFD_GETLK> есть только в Linux (и для получения их определений нужно определить B<_GNU_SOURCE>), но ведётся работа по их включению в следующую версию POSIX.1.

source: B<F_ADD_SEALS> and B<F_GET_SEALS> are Linux-specific.
ru: Значения B<F_ADD_SEALS> и B<F_GET_SEALS> есть только в Linux.

source: The errors returned by B<dup2>(2) are different from those returned by B<F_DUPFD>.
ru: Ошибки, возвращаемые B<dup2>(2), отличаются от тех, что возвращаются при B<F_DUPFD>.

source: File locking
ru: Файловая блокировка

source: The original Linux B<fcntl>() system call was not designed to handle large file offsets (in the I<flock> structure). Consequently, an B<fcntl64>() system call was added in Linux 2.4. The newer system call employs a different structure for file locking, I<flock64>, and corresponding commands, B<F_GETLK64>, B<F_SETLK64>, and B<F_SETLKW64>. However, these details can be ignored by applications using glibc, whose B<fcntl>() wrapper function transparently employs the more recent system call where it is available.
ru: Первоначальная версия системного вызова B<fcntl>() в Linux не умела работать с большими файловыми смещениями (в структуре I<flock>). Позднее, в Linux 2.4 был добавлен системный вызов B<fcntl64>(). Новый системный вызов использует другую структуру для блокировки файлов — I<flock64> и соответствующие команды — B<F_GETLK64>, B<F_SETLK64> и B<F_SETLKW64>. Однако, это различие может игнорироваться приложениями, которые используют glibc, так как имеющаяся в ней обёрточная функция B<fcntl>() самостоятельно задействует более новый системный вызов, если он доступен.

source: Record locks
ru: Обычные блокировки (Record locks)

source: Since kernel 2.0, there is no interaction between the types of lock placed by B<flock>(2) and B<fcntl>().
ru: Начиная с ядра 2.0, не существует разницы между типами блокировки, которые осуществляют B<flock>(2) и B<fcntl>().

source: Several systems have more fields in I<struct flock> such as, for example, I<l_sysid> (to identify the machine where the lock is held). Clearly, I<l_pid> alone is not going to be very useful if the process holding the lock may live on a different machine; on Linux, while present on some architectures (such as MIPS32), this field is not used.
ru: Некоторые системы имеют дополнительные поля в структуре I<struct flock>, например, I<l_sysid> (признак машины, на которой удерживается блокировка). Вообще говоря, один I<l_pid> не очень полезен, если процесс, удерживающий блокировку, может работать на другой машине; в Linux, хотя это поле и есть на некоторых архитектурах (например, MIPS32), но оно не используется.

source: Record locking and NFS
ru: Блокировка и NFS

source: Before Linux 3.12, if an NFSv4 client loses contact with the server for a period of time (defined as more than 90 seconds with no communication), it might lose and regain a lock without ever being aware of the fact. (The period of time after which contact is assumed lost is known as the NFSv4 leasetime. On a Linux NFS server, this can be determined by looking at I</proc/fs/nfsd/nfsv4leasetime>, which expresses the period in seconds. The default value for this file is 90.) This scenario potentially risks data corruption, since another process might acquire a lock in the intervening period and perform file I/O.
ru: До Linux 3.12, если клиент NFSv4 теряет связь с сервером на некоторый период времени (более 90 секунд), то он может потерять и перезапросить блокировки даже не зная об этом (период времени, после которого контакт предполагается потерянным в NFSv4 называется время аренды (leasetime). У Linux в сервере NFS его можно узнать по значению в I</proc/fs/nfsd/nfsv4leasetime>, которое отражает период в секундах. В этом файле значение по умолчанию равно 90). Данный сценарий несёт потенциальный риск повреждения данных, так как в этот перерыв другой процесс может установить блокировку и выполнить файловый ввод-вывод.

source: Since Linux 3.12, if an NFSv4 client loses contact with the server, any I/O to the file by a process which "thinks" it holds a lock will fail until that process closes and reopens the file. A kernel parameter, I<nfs.recover_lost_locks>, can be set to 1 to obtain the pre-3.12 behavior, whereby the client will attempt to recover lost locks when contact is reestablished with the server. Because of the attendant risk of data corruption, this parameter defaults to 0 (disabled).
ru: Начиная с Linux 3.12, если клиент NFSv4 теряет контакт с сервером, то любой файловый ввод-вывод, выполняемый процессом, который «думает», что имеет блокировку, будет завершаться с ошибкой до тех пор, пока этот процесс не закроет и не переоткроет файл. Чтобы вернуть поведение, которое было до версии pre-3.12, можно параметру ядра I<nfs.recover_lost_locks> присвоить значение 1, из-за чего клиент буде пытаться восстановить потерянные блокировки при переустановлении связи с сервером. Из-за наличия сопутствующего риска повреждения данных, значение данного параметра по умолчанию равно 0 (отключено).

source: It is not possible to use B<F_SETFL> to change the state of the B<O_DSYNC> and B<O_SYNC> flags. Attempts to change the state of these flags are silently ignored.
ru: Невозможно использовать B<F_SETFL> для смены состояния флагов B<O_DSYNC> и B<O_SYNC>. Попытка изменить состояние этих флагов просто игнорируется.
