Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Any I<FTSENT> structure that represents a file type not explicitly described by one of the other I<fts_info> values.
ru: Любая структура I<FTSENT>, представляющая тип файла, неявно описываемый одним из других значений I<fts_info>.

source: A directory which cannot be read. This is an error return, and the I<fts_errno> field will be set to indicate what caused the error.
ru: Каталог, который не может быть прочитан. Это значение возвращается при ошибке, и поле I<fts_errno> будет заполнено тем, что вызвало ошибку.

source: A file named "." or ".." which was not specified as a filename to B<fts_open>() (see B<FTS_SEEDOT>).
ru: Файл с именем «.» или «..», который не был указан в качестве имени файла в B<fts_open>() (смотрите B<FTS_SEEDOT>).

source: A directory being visited in postorder. The contents of the I<FTSENT> structure will be unchanged from when it was returned in preorder, that is, with the I<fts_info> field set to B<FTS_D>.
ru: Каталог, посещаемый в обратном порядке. Содержимое структуры I<FTSENT> будет неизменно, как если бы он посещался в прямом порядке, то есть значение поля I<fts_info> равно B<FTS_D>.

source: This is an error return, and the I<fts_errno> field will be set to indicate what caused the error.
ru: Это значение возвращается при ошибке, и поле I<fts_errno> будет заполнено тем, что вызвало ошибку.

source: A regular file.
ru: Обычный файл.

source: A file for which no B<stat>(2) information was available. The contents of the I<fts_statp> field are undefined. This is an error return, and the I<fts_errno> field will be set to indicate what caused the error.
ru: Файл, для которого нет доступной информации по B<stat>(2). Содержимое поля I<fts_statp> не определено. Это значение возвращается при ошибке, и поле I<fts_errno> будет заполнено тем, что вызвало ошибку.

source: A file for which no B<stat>(2) information was requested. The contents of the I<fts_statp> field are undefined.
ru: Файл, для которого не запрашивалась информация с помощью B<stat>(2). Содержимое поля I<fts_statp> не определено.

source: A symbolic link.
ru: Символьная ссылка.

source: A symbolic link with a nonexistent target. The contents of the I<fts_statp> field reference the file characteristic information for the symbolic link itself.
ru: Символьная ссылка, указывающая на несуществующий объект. В поле I<fts_statp> содержится ссылка на информацию о свойствах самой символьной ссылки.

source: A path for accessing the file from the current directory.
ru: Путь к файлу относительно текущего каталога.

source: The path for the file relative to the root of the traversal. This path contains the path specified to B<fts_open>() as a prefix.
ru: Путь к файлу относительно начального каталога обхода. Этот путь содержит в себе путь (как префикс), указанный в B<fts_open>().

source: The sum of the lengths of the strings referenced by I<fts_path> and I<fts_name>.
ru: Сумма длин строк, на которые ссылается I<fts_path> и I<fts_name>.

source: The name of the file.
ru: Имя файла.

source: The length of the string referenced by I<fts_name>.
ru: Длина строки, на которую ссылается I<fts_name>.

source: The depth of the traversal, numbered from -1 to N, where this file was found. The I<FTSENT> structure representing the parent of the starting point (or root) of the traversal is numbered -1, and the I<FTSENT> structure for the root itself is numbered 0.
ru: Глубина погружения в дерево иерархии, от -1 до N, на которой был обнаружен файл. Структура I<FTSENT>, представляющая родительский каталог обхода (или начальный каталог), обозначена как -1, а структура I<FTSENT> для самой начальной точки поиска обозначена как 0.

source: If B<fts_children>() or B<fts_read>() returns an I<FTSENT> structure whose I<fts_info> field is set to B<FTS_DNR>, B<FTS_ERR>, or B<FTS_NS>, the I<fts_errno> field contains the error number (i.e., the I<errno> value) specifying the cause of the error. Otherwise, the contents of the I<fts_errno> field are undefined.
ru: Если при возврате структуры I<FTSENT> функцией B<fts_children>() или B<fts_read>() её поле I<fts_info> равно B<FTS_DNR>, B<FTS_ERR> или B<FTS_NS>, то в поле I<fts_errno> содержится номер ошибки (то есть значение I<errno>), обозначающее причину ошибки. В других случаях, содержимое поля I<fts_errno> не определено.

source: This field is provided for the use of the application program and is not modified by the fts functions. It is initialized to 0.
ru: Это поле создано для использования пользовательским приложением и не изменяется функциями fts. При инициализации оно устанавливается в 0.

source: This field is provided for the use of the application program and is not modified by the fts functions. It is initialized to NULL.
ru: Это поле создано для использования пользовательским приложением и не изменяется функциями fts. При инициализации оно устанавливается в NULL.

source: A pointer to the I<FTSENT> structure referencing the file in the hierarchy immediately above the current file, that is, the directory of which this file is a member. A parent structure for the initial entry point is provided as well, however, only the I<fts_level>, I<fts_number>, and I<fts_pointer> fields are guaranteed to be initialized.
ru: Указатель на структуру I<FTSENT>, которая ссылается на файл в иерархии непосредственно над текущим файлом, то есть на каталог, членом которого является текущий файл. Родительский каталог начальной точки поиска также может быть доступен, однако инициализируются только поля I<fts_level>, I<fts_number> и I<fts_pointer>.

source: Upon return from the B<fts_children>() function, the I<fts_link> field points to the next structure in the NULL-terminated linked list of directory members. Otherwise, the contents of the I<fts_link> field are undefined.
ru: При возврате функции B<fts_children>() поле I<fts_link> указывает на следующую структуру в связанном списке (заканчивающемся NULL) содержимого каталога. В другим случаях содержимое поля I<fts_link> не определено.

source: If a directory causes a cycle in the hierarchy (see B<FTS_DC>), either because of a hard link between two directories, or a symbolic link pointing to a directory, the I<fts_cycle> field of the structure will point to the I<FTSENT> structure in the hierarchy that references the same file as the current I<FTSENT> structure. Otherwise, the contents of the I<fts_cycle> field are undefined.
ru: Если каталог вызывает зацикливание иерархии (смотрите B<FTS_DC>), либо из-за жёсткой ссылки между двумя каталогами, либо из-за символьной ссылки, указывающей на каталог, то поле I<fts_cycle> будет указывать на структуру I<FTSENT> в иерархии, которая ссылается на тот же файл, что и текущая структура I<FTSENT>. В других случаях содержимое поля I<fts_cycle> не определено.

source: A pointer to B<stat>(2) information for the file.
ru: Указатель на информацию о файле, полученную с помощью B<stat>(2).

source: A single buffer is used for all of the paths of all of the files in the file hierarchy. Therefore, the I<fts_path> and I<fts_accpath> fields are guaranteed to be null-terminated I<only> for the file most recently returned by B<fts_read>(). To use these fields to reference any files represented by other I<FTSENT> structures will require that the path buffer be modified using the information contained in that I<FTSENT> structure's I<fts_pathlen> field. Any such modifications should be undone before further calls to B<fts_read>() are attempted. The I<fts_name> field is always null-terminated.
ru: Для всех путей всех файлов в иерархии используется единый буфер. Следовательно, поля I<fts_path> и I<fts_accpath> гарантировано завершаются null I<только> для файла, который был возвращён B<fts_read>() последним. Для использования этих полей для обращения к любым файлам, представленным другими структурами I<FTSENT> необходимо, чтобы буфер пути был изменён в соответствии с информацией, содержащейся в поле I<fts_pathlen> структуры I<FTSENT>. Любое изменение должно быть обратно восстановлено перед дальнейшими попытками вызова B<fts_read>(). Поле I<fts_name> всегда завершается null.

source: The B<fts_open>() function takes a pointer to an array of character pointers naming one or more paths which make up a logical file hierarchy to be traversed. The array must be terminated by a null pointer.
ru: Функция B<fts_open>() ожидает указатель на массив символьных указателей, обозначающих один или несколько путей, образующих логическую файловую иерархию, по которой будет проводиться обход. Массив должен заканчиваться указателем null.

source: There are a number of options, at least one of which (either B<FTS_LOGICAL> or B<FTS_PHYSICAL>) must be specified. The options are selected by ORing the following values:
ru: Есть несколько флагов, должен быть указан хотя бы один (либо B<FTS_LOGICAL>, либо B<FTS_PHYSICAL>). Флаги, выбираемые с помощью логического объединения, имеют следующие значения:

source: This option causes any symbolic link specified as a root path to be followed immediately whether or not B<FTS_LOGICAL> is also specified.
ru: Этот флаг принуждает перемещаться по любой символьной ссылке, определённой как корневой путь, несмотря на то, определён или нет флаг B<FTS_LOGICAL>.

source: This option causes the fts routines to return I<FTSENT> structures for the targets of symbolic links instead of the symbolic links themselves. If this option is set, the only symbolic links for which I<FTSENT> structures are returned to the application are those referencing nonexistent files. Either B<FTS_LOGICAL> or B<FTS_PHYSICAL> I<must> be provided to the B<fts_open>() function.
ru: Этот флаг принуждает функции fts возвращать структуры B<FTSENT> для целей символьных ссылок вместо самих символьных ссылок. Если этот флаг включён, то единственные символьные ссылки, для которых приложениям выдаются структуры I<FTSENT> — это ссылки, указывающие на несуществующие файлы. Также для работы функции B<fts_open>() I<должны> быть указаны B<FTS_LOGICAL> или B<FTS_PHYSICAL>.

source: As a performance optimization, the fts functions change directories as they walk the file hierarchy. This has the side-effect that an application cannot rely on being in any particular directory during the traversal. The B<FTS_NOCHDIR> option turns off this optimization, and the fts functions will not change the current directory. Note that applications should not themselves change their current directory and try to access files unless B<FTS_NOCHDIR> is specified and absolute pathnames were provided as arguments to B<fts_open>().
ru: С целью оптимизации производительности функции fts меняют каталоги, по которым они следуют по файловой иерархии. Это имеет один побочный эффект — приложения не могут точно определить, в каком каталоге они находятся во время перемещения по дереву. Флаг B<FTS_NOCHDIR> выключает такую оптимизацию, и функции fts не будут менять текущий каталог. Заметим, что приложения тоже не должны изменять свой текущий каталог и пытаться получить доступ к файлам, пока не указан флаг B<FTS_NOCHDIR> и функции B<fts_open>() не переданы абсолютные пути в качестве параметров.

source: By default, returned I<FTSENT> structures reference file characteristic information (the I<statp> field) for each file visited. This option relaxes that requirement as a performance optimization, allowing the fts functions to set the I<fts_info> field to B<FTS_NSOK> and leave the contents of the I<statp> field undefined.
ru: По умолчанию, возвращаемые структуры I<FTSENT> ссылаются на информацию о файлах (поле I<statp>) в каждом просмотренном файле. Данный флаг снимает это требование (для оптимизации производительности), позволяя функциям fts присваивать полю I<fts_info> значение B<FTS_NSOK> и оставлять содержание поля I<statp> неопределенным.

source: This option causes the fts routines to return I<FTSENT> structures for symbolic links themselves instead of the target files they point to. If this option is set, I<FTSENT> structures for all symbolic links in the hierarchy are returned to the application. Either B<FTS_LOGICAL> or B<FTS_PHYSICAL> I<must> be provided to the B<fts_open>() function.
ru: Этот флаг заставляет функции fts выдавать структуру I<FTSENT> самих символьных ссылок, а не файлов, на которые они указывают. Если этот флаг установлен, то для всех символьных ссылок в файловой иерархии приложениям возвращаются структуры I<FTSENT>. Для работы функции B<fts_open>() также I<должны> присутствовать B<FTS_LOGICAL> или B<FTS_PHYSICAL>.

source: By default, unless they are specified as path arguments to B<fts_open>(), any files named "." or ".." encountered in the file hierarchy are ignored. This option causes the fts routines to return I<FTSENT> structures for them.
ru: По умолчанию, все файлы с именами «.» или «..», обнаруженные в файловой иерархии, игнорируются, если они не указаны как параметры пути в B<fts_open>(). Данный флаг принуждает функции fts для таких файлов возвращать структуры I<FTSENT>.

source: This option prevents fts from descending into directories that have a different device number than the file from which the descent began.
ru: Этот флаг предотвращает функции fts от вхождения в каталоги, которые имеют номер устройства, отличный от файла, с которого начался обход.

source: The argument B<compar>() specifies a user-defined function which may be used to order the traversal of the hierarchy. It takes two pointers to pointers to I<FTSENT> structures as arguments and should return a negative value, zero, or a positive value to indicate if the file referenced by its first argument comes before, in any order with respect to, or after, the file referenced by its second argument. The I<fts_accpath>, I<fts_path>, and I<fts_pathlen> fields of the I<FTSENT> structures may I<never> be used in this comparison. If the I<fts_info> field is set to B<FTS_NS> or B<FTS_NSOK>, the I<fts_statp> field may not either. If the B<compar>() argument is NULL, the directory traversal order is in the order listed in I<path_argv> for the root paths, and in the order listed in the directory for everything else.
ru: В параметре B<compar>() указывается определяемая пользователем функция, которая может использоваться для упорядочивания обхода иерархии. В качестве параметров ей требуется два указателя на указатели на структуры I<FTSENT>, и она должна возвращать отрицательное значение, ноль или положительное значение для того, чтобы показать, расположен ли файл, на который указывает первый параметр, перед (относительно текущего упорядочивания), на одном уровне или после файла, на который указывает второй параметр. Поля I<fts_accpath>, I<fts_path> и I<fts_pathlen> структур I<FTSENT> могут быть I<никогда> не использованы при таком сравнении. Если значение поля I<fts_info> равно B<FTS_NS> или B<FTS_NSOK>, то поле I<fts_statp> может не использоваться. Если значение параметра B<compar>() равно NULL, то порядок обхода каталогов определяется параметрами, указанными в I<path_argv> для корневых путей, и в порядке, перечисленном в каталоге, для всего остального.

source: The B<fts_read>() function returns a pointer to an I<FTSENT> structure describing a file in the hierarchy. Directories (that are readable and do not cause cycles) are visited at least twice, once in preorder and once in postorder. All other files are visited at least once. (Hard links between directories that do not cause cycles or symbolic links to symbolic links may cause files to be visited more than once, or directories more than twice.)
ru: Функция B<fts_read>() возвращает указатель на структуру I<FTSENT>, описывающую файл в иерархии. Каталоги (корректно считанные и не образующие зацикливаний), посещаются как минимум дважды — первый раз в прямом прохождении и второй раз в обратном. Все остальные файлы посещаются минимум один раз (жёсткие ссылки между каталогами, не образующие зацикливаний, или символьные ссылки на символьные ссылки могут привести к тому, что файлы будут посещаться более одного раза, а каталоги более двух раз).

source: If all the members of the hierarchy have been returned, B<fts_read>() returns NULL and sets the external variable I<errno> to 0. If an error unrelated to a file in the hierarchy occurs, B<fts_read>() returns NULL and sets I<errno> appropriately. If an error related to a returned file occurs, a pointer to an I<FTSENT> structure is returned, and I<errno> may or may not have been set (see I<fts_info>).
ru: Когда все члены иерархии возвращены, B<fts_read>() возвращает NULL и устанавливает внешнюю переменную I<errno> равной 0. Если происходит ошибка, не имеющая отношения к файлу в иерархии, B<fts_read>() возвращает NULL и устанавливает I<errno> в соответствующее значение. Если происходит ошибка, связанная с возвращённым файлом, то возвращается указатель на структуру I<FTSENT>, а I<errno> может быть установлена в какое-то значение (а может и не быть, смотрите I<fts_info>).

source: The I<FTSENT> structures returned by B<fts_read>() may be overwritten after a call to B<fts_close>() on the same file hierarchy stream, or, after a call to B<fts_read>() on the same file hierarchy stream unless they represent a file of type directory, in which case they will not be overwritten until after a call to B<fts_read>() after the I<FTSENT> structure has been returned by the function B<fts_read>() in postorder.
ru: Структуры I<FTSENT>, возвращаемые B<fts_read>(), могут быть перезаписаны после вызова B<fts_close>() в том же файловом потоке иерархии или после вызова B<fts_read>() в том же файловом потоке иерархии, если они не представляют файл типа «каталог»; в этом случае они не будут перезаписаны до тех пор, пока функция B<fts_read>() не вернёт структуру I<FTSENT> при выполнении обхода в обратном порядке.

source: The B<fts_children>() function returns a pointer to an I<FTSENT> structure describing the first entry in a NULL-terminated linked list of the files in the directory represented by the I<FTSENT> structure most recently returned by B<fts_read>(). The list is linked through the I<fts_link> field of the I<FTSENT> structure, and is ordered by the user-specified comparison function, if any. Repeated calls to B<fts_children>() will re-create this linked list.
ru: Функция B<fts_children>() возвращает указатель на структуру I<FTSENT>, описывающую первый член связанного списка (оканчивающегося NULL) файлов в каталоге, представленного структурой I<FTSENT>, возвращённой B<fts_read>() последней. Список связан через поле I<fts_link> структуры I<FTSENT>, и упорядочен определённой пользователем функцией сравнения, если таковая существует. Повторные вызовы B<fts_children>() будут пересоздавать этот связанный список.

source: As a special case, if B<fts_read>() has not yet been called for a hierarchy, B<fts_children>() will return a pointer to the files in the logical directory specified to B<fts_open>(), that is, the arguments specified to B<fts_open>(). Otherwise, if the I<FTSENT> structure most recently returned by B<fts_read>() is not a directory being visited in preorder, or the directory does not contain any files, B<fts_children>() returns NULL and sets I<errno> to zero. If an error occurs, B<fts_children>() returns NULL and sets I<errno> appropriately.
ru: В особом случае, если B<fts_read>() ещё не вызывалась для иерархии, то B<fts_children>() возвратит указатель на файлы в логическом каталоге, заданном B<fts_open>(), т.е. параметры, переданные функции B<fts_open>(). В противном случае, если последняя возвращённая B<fts_read>() структура I<FTSENT> не является каталогом, просмотренном в прямом порядке, и не каталогом файлов, то B<fts_children>() возвратит NULL и установит I<errno> равным 0. Если произойдёт ошибка, то B<fts_children>() возвратит NULL и установит I<errno> в соответствующее значение.

source: The I<FTSENT> structures returned by B<fts_children>() may be overwritten after a call to B<fts_children>(), B<fts_close>(), or B<fts_read>() on the same file hierarchy stream.
ru: Структура I<FTSENT>, возвращаемая B<fts_children>(), может быть перезаписана после вызова B<fts_children>(), B<fts_close>() или B<fts_read>() в том же файловом потоке иерархии.

source: The I<instr> argument is either zero or the following value:
ru: Параметр I<instr> может принимать значение нуля или одного из следующих значений:

source: Only the names of the files are needed. The contents of all the fields in the returned linked list of structures are undefined with the exception of the I<fts_name> and I<fts_namelen> fields.
ru: Необходимы только имена файлов. Содержимое всех полей в возвращаемом связанном списке структур не определено, за исключением полей I<fts_name> и I<fts_namelen>.

source: The function B<fts_set>() allows the user application to determine further processing for the file I<f> of the stream I<ftsp>. The B<fts_set>() function returns 0 on success, and -1 if an error occurs.
ru: Функция B<fts_set>() позволяет пользовательскому приложению определять дальнейшую обработку файла I<f> в потоке I<ftsp>. При успешном выполнении функция B<fts_set>() возвращает 0 и -1 при ошибке.

source: The I<instr> argument is either 0 (meaning "do nothing") or one of the following values:
ru: Значением аргумента I<instr> может быть 0 («ничего не делать») или одно из следующих значений:

source: Revisit the file; any file type may be revisited. The next call to B<fts_read>() will return the referenced file. The I<fts_stat> and I<fts_info> fields of the structure will be reinitialized at that time, but no other fields will have been changed. This option is meaningful only for the most recently returned file from B<fts_read>(). Normal use is for postorder directory visits, where it causes the directory to be revisited (in both preorder and postorder) as well as all of its descendants.
ru: Повторно посетить файл; файл любого типа может быть повторно посещён. Последующий вызов B<fts_read>() возвратит файл, к которому идёт обращение. Поля I<fts_stat> и I<fts_info> структуры будут переинициализированы в этот момент, но никакие поля больше не будут изменены. Этот параметр значим только для последнего возвращённого файла из B<fts_read>(). Обычно его используют при посещении каталогов в обратном порядке; в этом случае каталог посещается повторно (в прямом и обратном порядке), а также все его потомки.

source: The referenced file must be a symbolic link. If the referenced file is the one most recently returned by B<fts_read>(), the next call to B<fts_read>() returns the file with the I<fts_info> and I<fts_statp> fields reinitialized to reflect the target of the symbolic link instead of the symbolic link itself. If the file is one of those most recently returned by B<fts_children>(), the I<fts_info> and I<fts_statp> fields of the structure, when returned by B<fts_read>(), will reflect the target of the symbolic link instead of the symbolic link itself. In either case, if the target of the symbolic link does not exist, the fields of the returned structure will be unchanged and the I<fts_info> field will be set to B<FTS_SLNONE>.
ru: Рассматриваемый файл должен быть символьной ссылкой. Если рассматриваемый файл — последний возвращённый B<fts_read>(), то следующий вызов B<fts_read>() возвратит файл с изменёнными полями I<fts_info> и I<fts_statp>, в которых будут отражать повторно инициализированные данные цели символьной ссылки, а не самой символьной ссылки. Если рассматриваемый файл — последний возвращённый B<fts_children>(), то поля I<fts_info> и I<fts_statp> структуры при возврате из B<fts_read>() будут отражать данные цели символьной ссылки, а не самой символьной ссылки. В любом случае, если цель символьной ссылки не существует, то поля возвращаемой структуры не будут меняться, а поле I<fts_info> будет равно B<FTS_SLNONE>.
