Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: By selecting a real time signal (value E<gt>= B<SIGRTMIN>), multiple I/O events may be queued using the same signal numbers. (Queuing is dependent on available memory.) Extra information is available if B<SA_SIGINFO> is set for the signal handler, as above.
ru: При выборе сигнала реального времени (значение E<gt>= B<SIGRTMIN>) в очередь может добавляться несколько событий ввода-вывода с одинаковыми номерами сигналов (размер очереди зависит от доступной памяти). Дополнительная информация будет доступна как описано выше, если для обработчика сигнала будет установлено B<SA_SIGINFO>.

source: Note that Linux imposes a limit on the number of real-time signals that may be queued to a process (see B<getrlimit>(2) and B<signal>(7)) and if this limit is reached, then the kernel reverts to delivering B<SIGIO>, and this signal is delivered to the entire process rather than to a specific thread.
ru: Заметим, что в Linux есть предел на количество сигналов реального времени, которые могут находиться в очереди процесса (см. B<getrlimit>(2) и B<signal>(7)), и если этот предел достигнут, то ядро изменяет пункт доставки B<SIGIO>, и этот сигнал доставляется всему процессу, а не указанной нити.

source: Using these mechanisms, a program can implement fully asynchronous I/O without using B<select>(2) or B<poll>(2) most of the time.
ru: Используя эти механизмы, программа может реализовать полностью асинхронный ввод-вывод почти не используя в своей работе B<select>(2) или B<poll>(2).

source: The use of B<O_ASYNC> is specific to BSD and Linux. The only use of B<F_GETOWN> and B<F_SETOWN> specified in POSIX.1 is in conjunction with the use of the B<SIGURG> signal on sockets. (POSIX does not specify the B<SIGIO> signal.) B<F_GETOWN_EX>, B<F_SETOWN_EX>, B<F_GETSIG>, and B<F_SETSIG> are Linux-specific. POSIX has asynchronous I/O and the I<aio_sigevent> structure to achieve similar things; these are also available in Linux as part of the GNU C Library (Glibc).
ru: Использование B<O_ASYNC>, является специфичным для BSD и Linux. В POSIX.1 описано только использование B<F_GETOWN> и B<F_SETOWN> вместе с сигналом B<SIGURG> для сокетов (в POSIX не определён сигнал B<SIGIO>). B<F_GETOWN_EX>, B<F_SETOWN_EX>, B<F_GETSIG>, and B<F_SETSIG> есть только в Linux. В POSIX описан асинхронный ввод-вывод и структура I<aio_sigevent>, используемая для сходных действий; они также доступны в Linux как часть библиотеки GNU C (Glibc).

source: Leases
ru: Аренда

source: B<F_SETLEASE> and B<F_GETLEASE> (Linux 2.4 onward) are used to establish a new lease, and retrieve the current lease, on the open file description referred to by the file descriptor I<fd>. A file lease provides a mechanism whereby the process holding the lease (the "lease holder") is notified (via delivery of a signal) when a process (the "lease breaker") tries to B<open>(2) or B<truncate>(2) the file referred to by that file descriptor.
ru: Команды B<F_SETLEASE> и B<F_GETLEASE> (в Linux 2.4 и выше) используются для установки новой и получения текущей аренды открытого описания файла, на который указывает файловый дескриптор I<fd>. Аренда файла предоставляет механизм, посредством которого процесс, который удерживает аренду («арендатор»), уведомляется (отправкой сигнала), когда процесс («нарушитель аренды») пытается выполнить вызов B<open>(2) или B<truncate>(2) на файл, указанный в этом файловом дескрипторе.

source: Set or remove a file lease according to which of the following values is specified in the integer I<arg>:
ru: Установить или удалить аренду файла, в соответствии со значениями, указываемыми в I<arg>:

source: Take out a read lease. This will cause the calling process to be notified when the file is opened for writing or is truncated. A read lease can be placed only on a file descriptor that is opened read-only.
ru: Установить аренду чтения. Это приведёт к генерации уведомления вызывающего процесса, когда файл открывается для записи или усечения. Аренда чтения может быть выделена только на файловый дескриптор, открытый только на чтение.

source: Take out a write lease. This will cause the caller to be notified when the file is opened for reading or writing or is truncated. A write lease may be placed on a file only if there are no other open file descriptors for the file.
ru: Установить аренду записи. Это приведёт к генерации уведомления вызывающего процесса, когда файл открывается для чтения или записи или выполняется его усечение. Аренда записи может быть установлена на файл, только если этот файл не имеет других открытых файловых дескрипторов.

source: Remove our lease from the file.
ru: Удалить аренду с указанного файла.

source: Leases are associated with an open file description (see B<open>(2)). This means that duplicate file descriptors (created by, for example, B<fork>(2) or B<dup>(2)) refer to the same lease, and this lease may be modified or released using any of these descriptors. Furthermore, the lease is released by either an explicit B<F_UNLCK> operation on any of these duplicate file descriptors, or when all such file descriptors have been closed.
ru: Аренды ассоциируются с открытым файловым описанием (см. B<open>(2)). Это значит, что дублированные файловые дескрипторы (созданные, например, B<fork>(2) или B<dup>(2)) указывают на одну и ту же аренду, и эта аренда может изменяться или освобождаться через любой из этих дескрипторов. Более того, аренда освобождается или через явную команду B<F_UNLCK> на любом из этих дублированных файловых дескрипторов, или когда все эти файловые дескрипторы будут закрыты.

source: Leases may be taken out only on regular files. An unprivileged process may take out a lease only on a file whose UID (owner) matches the filesystem UID of the process. A process with the B<CAP_LEASE> capability may take out leases on arbitrary files.
ru: Аренды могут быть выданы только на обычные файлы. Непривилегированный процесс может получить аренду только на файл, чей UID (владельца) совпадает с UID на файловой системе процесса. Процесс с мандатом B<CAP_LEASE> может получить аренду на любые файлы.

source: Indicates what type of lease is associated with the file descriptor I<fd> by returning either B<F_RDLCK>, B<F_WRLCK>, or B<F_UNLCK>, indicating, respectively, a read lease , a write lease, or no lease. I<arg> is ignored.
ru: Узнать какой тип аренды ассоциирован с файловым дескриптором I<fd>; возвращается одно из значений B<F_RDLCK>, B<F_WRLCK> или B<F_UNLCK>, соответственно означающих аренду на чтение, запись или что аренды нет. Аргумент I<arg> игнорируется.

source: When a process (the "lease breaker") performs an B<open>(2) or B<truncate>(2) that conflicts with a lease established via B<F_SETLEASE>, the system call is blocked by the kernel and the kernel notifies the lease holder by sending it a signal (B<SIGIO> by default). The lease holder should respond to receipt of this signal by doing whatever cleanup is required in preparation for the file to be accessed by another process (e.g., flushing cached buffers) and then either remove or downgrade its lease. A lease is removed by performing an B<F_SETLEASE> command specifying I<arg> as B<F_UNLCK>. If the lease holder currently holds a write lease on the file, and the lease breaker is opening the file for reading, then it is sufficient for the lease holder to downgrade the lease to a read lease. This is done by performing an B<F_SETLEASE> command specifying I<arg> as B<F_RDLCK>.
ru: Когда процесс («нарушителя аренды») выполняет вызов B<open>(2) или B<truncate>(2), который конфликтует с арендой, установленной через B<F_SETLEASE>, то системный вызов блокируется ядром и ядро уведомляет арендатора сигналом (по умолчанию B<SIGIO>). Арендатор должен при получении этого сигнала выполнить все необходимые действия по очистке для подготовки этого файла к использованию другим процессом (например, сбросить буферы кэша) и затем удалить или снизить условия аренды. Аренда удаляется по команде B<F_SETLEASE> с аргументом I<arg>, установленным в B<F_UNLCK>. Если арендатор удерживает аренду на запись в файл, и нарушитель аренды открывает файл на чтение, то достаточно того, что арендатор понизит условия аренды до аренды на чтение. Это выполняется командой B<F_SETLEASE> с аргументом I<arg>, установленным в B<F_RDLCK>.

source: If the lease holder fails to downgrade or remove the lease within the number of seconds specified in I</proc/sys/fs/lease-break-time>, then the kernel forcibly removes or downgrades the lease holder's lease.
ru: Если арендатор не освободит аренду или не снизит условия в течении определённого количества секунд, указанного в файле I</proc/sys/fs/lease-break-time>, то ядро принудительно удалит или снизит условия аренды для арендатора.

source: Once a lease break has been initiated, B<F_GETLEASE> returns the target lease type (either B<F_RDLCK> or B<F_UNLCK>, depending on what would be compatible with the lease breaker) until the lease holder voluntarily downgrades or removes the lease or the kernel forcibly does so after the lease break timer expires.
ru: После того, как был начат разрыв аренды, B<F_GETLEASE> возвращает тип назначения аренды (или B<F_RDLCK> или B<F_UNLCK>, в зависимости от необходимости совместимости с нарушителем аренды) до тех пор, пока держатель аренды добровольно не отдаст или не удалит аренду или ядро принудительно не сделает это после истечения таймера разрыва аренды.

source: Once the lease has been voluntarily or forcibly removed or downgraded, and assuming the lease breaker has not unblocked its system call, the kernel permits the lease breaker's system call to proceed.
ru: После того как аренда снята держателем аренды или принудительно удалена и снижены условия, и предполагая, что нарушитель аренды не выполнял неблокирующий системный вызов, ядро позволяет продолжить работу системного вызова нарушителя аренды.

source: If the lease breaker's blocked B<open>(2) or B<truncate>(2) is interrupted by a signal handler, then the system call fails with the error B<EINTR>, but the other steps still occur as described above. If the lease breaker is killed by a signal while blocked in B<open>(2) or B<truncate>(2), then the other steps still occur as described above. If the lease breaker specifies the B<O_NONBLOCK> flag when calling B<open>(2), then the call immediately fails with the error B<EWOULDBLOCK>, but the other steps still occur as described above.
ru: Если нарушитель аренды, заблокированный в B<open>(2) или B<truncate>(2), прерывается обработчиком сигнала, то системный вызов завершается неудачно с ошибкой B<EINTR>, но другие шаги по-прежнему выполняются как описано ранее. Если нарушитель аренды завершается по сигналу будучи блокированным в B<open>(2) или B<truncate>(2), то другие шаги по-прежнему выполняются как описано ранее. Если нарушитель аренды указал флаг B<O_NONBLOCK> при вызове B<open>(2), то вызов немедленно завершается неудачей с ошибкой B<EWOULDBLOCK>, но другие шаги по-прежнему выполняются как описано ранее.

source: The default signal used to notify the lease holder is B<SIGIO>, but this can be changed using the B<F_SETSIG> command to B<fcntl>(). If a B<F_SETSIG> command is performed (even one specifying B<SIGIO>), and the signal handler is established using B<SA_SIGINFO>, then the handler will receive a I<siginfo_t> structure as its second argument, and the I<si_fd> field of this argument will hold the file descriptor of the leased file that has been accessed by another process. (This is useful if the caller holds leases against multiple files.)
ru: По умолчанию, для уведомления арендатора используется сигнал B<SIGIO>, но его можно изменить, используя команду B<F_SETSIG> для B<fcntl>(). Если выполняется команда B<F_SETSIG> (даже назначая сигнал B<SIGIO>), и при этом обработчик сигнала устанавливается с использованием B<SA_SIGINFO>, то обработчик получит в качестве второго аргумента структуру I<siginfo_t>, в которой поле I<si_fd> будет содержать файловый дескриптор арендованного файла, к которому пытается получить доступ другой процесс (это полезно, если вызывающий процесс удерживает аренду на несколько файлов).

source: File and directory change notification (dnotify)
ru: Уведомления об изменении файла и каталога (dnotify)

source: (Linux 2.4 onward) Provide notification when the directory referred to by I<fd> or any of the files that it contains is changed. The events to be notified are specified in I<arg>, which is a bit mask specified by ORing together zero or more of the following bits:
ru: (Начиная с Linux 2.4) Уведомлять при смене каталога, на который указывает I<fd> или когда изменились файлы, которые в нём содержатся. События, о наступлении которых делается уведомление, задаются в аргументе I<arg>, который является битовой маской, получаемой сложением (OR) одного или более следующих бит:

source: A file was accessed (B<read>(2), B<pread>(2), B<readv>(2), and similar)
ru: Был произведён доступ к файлу (B<read>(2), B<pread>(2), B<readv>(2) и подобные).

source: A file was modified (B<write>(2), B<pwrite>(2), B<writev>(2), B<truncate>(2), B<ftruncate>(2), and similar).
ru: Файл был изменён (B<write>(2), B<pwrite>(2), B<writev>(2), B<truncate>(2), B<ftruncate>(2) и подобные).

source: A file was created (B<open>(2), B<creat>(2), B<mknod>(2), B<mkdir>(2), B<link>(2), B<symlink>(2), B<rename>(2) into this directory).
ru: Файл был создан (B<open>(2), B<creat>(2), B<mknod>(2), B<mkdir>(2), B<link>(2), B<symlink>(2), B<rename>(2) в этом каталоге).

source: A file was unlinked (B<unlink>(2), B<rename>(2) to another directory, B<rmdir>(2)).
ru: Файл был удалён (B<unlink>(2), B<rename>(2) в другой каталог, B<rmdir>(2)).

source: A file was renamed within this directory (B<rename>(2)).
ru: Файл был переименован внутри каталога (B<rename>(2)).

source: The attributes of a file were changed (B<chown>(2), B<chmod>(2), B<utime>(2), B<utimensat>(2), and similar).
ru: У файла были изменены атрибуты (B<chown>(2), B<chmod>(2), B<utime>(2), B<utimensat>(2) и подобные).

source: (In order to obtain these definitions, the B<_GNU_SOURCE> feature test macro must be defined before including I<any> header files.)
ru: (Чтобы получить эти определения, нужно задать макрос тестирования свойств B<_GNU_SOURCE> перед I<всеми> остальными заголовочными файлами.)

source: Directory notifications are normally "one-shot", and the application must reregister to receive further notifications. Alternatively, if B<DN_MULTISHOT> is included in I<arg>, then notification will remain in effect until explicitly removed.
ru: Уведомления об изменении состояния каталога обычно однократные и приложение должно перерегистрировать установку уведомлений, чтобы и дальше получать их. Однако, если в аргумент I<arg>, добавить B<DN_MULTISHOT>, то уведомления будут приходить до тех пор, пока не будут явно отменены.

source: A series of B<F_NOTIFY> requests is cumulative, with the events in I<arg> being added to the set already monitored. To disable notification of all events, make an B<F_NOTIFY> call specifying I<arg> as 0.
ru: Серии запросов B<F_NOTIFY> добавляются к событиям в I<arg>, которые уже установлены. Чтобы выключить уведомления всех событий, выполните вызов B<F_NOTIFY>, указав 0 в I<arg>.

source: Notification occurs via delivery of a signal. The default signal is B<SIGIO>, but this can be changed using the B<F_SETSIG> command to B<fcntl>(). (Note that B<SIGIO> is one of the nonqueuing standard signals; switching to the use of a real-time signal means that multiple notifications can be queued to the process.) In the latter case, the signal handler receives a I<siginfo_t> structure as its second argument (if the handler was established using B<SA_SIGINFO>) and the I<si_fd> field of this structure contains the file descriptor which generated the notification (useful when establishing notification on multiple directories).
ru: Уведомление происходит посредством доставки сигнала. Сигналом по умолчанию является B<SIGIO>, но это можно изменить с помощью команды B<F_SETSIG> B<fcntl>() (заметим, что B<SIGIO> — один из безочерёдных стандартных сигналов; переход к использованию сигнала реального времени означает, что многократные уведомления могут попасть в очередь процесса). В последнем случае, обработчик сигнала принимает структуру I<siginfo_t> в качестве второго аргумента (если обработчик был установлен с помощью B<SA_SIGINFO>), в поле I<si_fd> этой структуры содержится файловый описатель, для которого сгенерировано уведомление (полезно при учёте уведомлений из нескольких каталогов).

source: Especially when using B<DN_MULTISHOT>, a real time signal should be used for notification, so that multiple notifications can be queued.
ru: Кроме того, когда используется B<DN_MULTISHOT>, для уведомлений должен бы быть использован сигнал реального времени, так что множественные уведомления могут быть поставлены в очередь.

source: B<NOTE:> New applications should use the I<inotify> interface (available since kernel 2.6.13), which provides a much superior interface for obtaining notifications of filesystem events. See B<inotify>(7).
ru: B<ЗАМЕЧАНИЕ:> В новых приложениях нужно использовать интерфейс I<inotify> (доступен начиная с ядра 2.6.13), который предоставляет намного лучший интерфейс для получения уведомлений о событиях в файловой системе. Смотрите B<inotify>(7).

source: Changing the capacity of a pipe
ru: Изменение ёмкости канала

source: B<F_SETPIPE_SZ> (I<int>; since Linux 2.6.35)
ru: B<F_SETPIPE_SZ> (I<int>; начиная с Linux 2.6.35)

source: Change the capacity of the pipe referred to by I<fd> to be at least I<arg> bytes. An unprivileged process can adjust the pipe capacity to any value between the system page size and the limit defined in I</proc/sys/fs/pipe-max-size> (see B<proc>(5)). Attempts to set the pipe capacity below the page size are silently rounded up to the page size. Attempts by an unprivileged process to set the pipe capacity above the limit in I</proc/sys/fs/pipe-max-size> yield the error B<EPERM>; a privileged process (B<CAP_SYS_RESOURCE>) can override the limit.
ru: Изменяет ёмкость канала, на который указывает I<fd>; она становится равной не менее I<arg> байт. Непривилегированный процесс может задать ёмкость канала любого значения, начиная с размера системной страницы до ограничения, заданного в I</proc/sys/fs/pipe-max-size> (смотрите B<proc>(5)). При задании ёмкости меньше размера страницы, она будет без ошибок округлена до размера страницы. При задании непривилегированным процессом ёмкости канала больше ограничения из I</proc/sys/fs/pipe-max-size> приведёт к ошибке B<EPERM>; привилегированный процесс (с B<CAP_SYS_RESOURCE>) может превысить это ограничение.

source: When allocating the buffer for the pipe, the kernel may use a capacity larger than I<arg>, if that is convenient for the implementation. (In the current implementation, the allocation is the next higher power-of-two page-size multiple of the requested size.) The actual capacity (in bytes) that is set is returned as the function result.
ru: При выделении буфера под канал ядро может использовать большую ёмкость чем указано в I<arg>, если это удобно для реализации (в текущей реализации размером выделения является следующий кратный степени двойки размер страницы больший запрашиваемого размера). Реальным размером (в байтах) считается возвращаемый результат функции.

source: Attempting to set the pipe capacity smaller than the amount of buffer space currently used to store data produces the error B<EBUSY>.
ru: Попытка задать ёмкость канала меньшую размера буферного пространства, используемого в данный момент для хранения данных в канале приводит к ошибке B<EBUSY>.

source: Note that because of the way the pages of the pipe buffer are employed when data is written to the pipe, the number of bytes that can be written may be less than the nominal size, depending on the size of the writes.
ru: Заметим, что из-за способа использования страниц буфера канала при записи данных количество байт, которые могут быть записаны, может быть меньше, чем номинальный размер, в зависимости от размера записей.

source: B<F_GETPIPE_SZ> (I<void>; since Linux 2.6.35)
ru: B<F_GETPIPE_SZ> (I<void>; начиная с Linux 2.6.35)

source: Return (as the function result) the capacity of the pipe referred to by I<fd>.
ru: Возвращает (как результат функции) ёмкость канала, указываемого I<fd>.

source: File Sealing
ru: Опечатывание файла (file sealing)

source: File seals limit the set of allowed operations on a given file. For each seal that is set on a file, a specific set of operations will fail with B<EPERM> on this file from now on. The file is said to be sealed. The default set of seals depends on the type of the underlying file and filesystem. For an overview of file sealing, a discussion of its purpose, and some code examples, see B<memfd_create>(2).
ru: Опечатывание файла позволяет ограничить набор выполняемых над файлом операций. Любая операция с файлом, попавшая в набор опечатанных, завершается с ошибкой B<EPERM>. Набор печатей по умолчанию зависит от типа файла, к которому он применяется и файловой системы. Описание опечатывания файла, предназначение и примеры кода смотрите в B<memfd_create>(2).

source: Currently, file seals can be applied only to a file descriptor returned by B<memfd_create>(2) (if the B<MFD_ALLOW_SEALING> was employed). On other filesystems, all B<fcntl>() operations that operate on seals will return B<EINVAL>.
ru: В настоящее время опечатывание файла может применяться к файловому дескриптору, возвращаемому B<memfd_create>(2) (если был указан B<MFD_ALLOW_SEALING>). В других файловых системах все операции B<fcntl>(), относящиеся к печатям, возвращают B<EINVAL>.

source: Seals are a property of an inode. Thus, all open file descriptors referring to the same inode share the same set of seals. Furthermore, seals can never be removed, only added.
ru: Печати (seals) — свойство inode. То есть все открытые файловые дескрипторы, указывающие на один inode, имеют общий набор печатей. Кроме этого, печати нельзя удалять, можно только добавлять.

source: B<F_ADD_SEALS> (I<int>; since Linux 3.17)
ru: B<F_ADD_SEALS> (I<int>; начиная с Linux 3.17)

source: Add the seals given in the bit-mask argument I<arg> to the set of seals of the inode referred to by the file descriptor I<fd>. Seals cannot be removed again. Once this call succeeds, the seals are enforced by the kernel immediately. If the current set of seals includes B<F_SEAL_SEAL> (see below), then this call will be rejected with B<EPERM>. Adding a seal that is already set is a no-op, in case B<F_SEAL_SEAL> is not set already. In order to place a seal, the file descriptor I<fd> must be writable.
ru: Добавляет печати из значения битовой маски I<arg> в набор печатей inode, на которую ссылается файловый дескриптор I<fd>. Печати из набора нельзя удалить. После успешного выполнения, печати сразу же учитываются ядром. Если в текущий набор печатей входит B<F_SEAL_SEAL> (смотрите далее), то этот вызов завершается с ошибкой B<EPERM>. Добавление уже установленной печати ни к чему не приводит, если ещё не указана B<F_SEAL_SEAL>. Чтобы разместить печать файловый дескриптор I<fd> должен быть доступен на запись.

source: B<F_GET_SEALS> (I<void>; since Linux 3.17)
ru: B<F_GET_SEALS> (I<void>; начиная с Linux 3.17)

source: Return (as the function result) the current set of seals of the inode referred to by I<fd>. If no seals are set, 0 is returned. If the file does not support sealing, -1 is returned and I<errno> is set to B<EINVAL>.
ru: Возвращает (в виде результата функции) текущий набор печатей inode, на которую указывает I<fd>. Если печатей нет, возвращается 0. Если файл не поддерживает опечатывание, то возвращается -1 и I<errno> присваивается B<EINVAL>.

source: The following seals are available:
ru: Доступны следующие печати:
