Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: A limitation of the Linux system call conventions on some architectures (notably i386) means that if a (negative) process group ID to be returned by B<F_GETOWN> falls in the range -1 to -4095, then the return value is wrongly interpreted by glibc as an error in the system call; that is, the return value of B<fcntl>() will be -1, and I<errno> will contain the (positive) process group ID. The Linux-specific B<F_GETOWN_EX> operation avoids this problem. Since glibc version 2.11, glibc makes the kernel B<F_GETOWN> problem invisible by implementing B<F_GETOWN> using B<F_GETOWN_EX>.
ru: Ограничение в соглашениях по системным вызовам Linux на некоторых архитектурах (в частности i386) приводит к тому, что если значение ID группы процесса (отрицательное), возвращаемое по команде B<F_GETOWN>, попадает в диапазон от -1 до -4095, то оно неправильно интерпретируется glibc и считается ошибкой в системном вызове; то есть возвращаемое значение B<fcntl>() будет равно -1, а I<errno> будет содержать значение ID группы процесса (положительное). Команда B<F_GETOWN_EX> (есть только в Linux) не подвержена этой проблеме. Начиная с glibc версии 2.11, glibc делает проблему для B<F_GETOWN> невидимой, реализовав B<F_GETOWN> с помощью B<F_GETOWN_EX>.

source: In Linux 2.4 and earlier, there is bug that can occur when an unprivileged process uses B<F_SETOWN> to specify the owner of a socket file descriptor as a process (group) other than the caller. In this case, B<fcntl>() can return -1 with I<errno> set to B<EPERM>, even when the owner process (group) is one that the caller has permission to send signals to. Despite this error return, the file descriptor owner is set, and signals will be sent to the owner.
ru: В Linux 2.4 и более раннем, есть ошибка, которая может произойти когда непривилегированный процесс использует B<F_SETOWN> для задания владельца дескриптора файла сокета как процесса (группу) отличного от вызывающего. В этом случае B<fcntl>() может вернуть -1 с I<errno> равным B<EPERM>, даже когда процесс (группа) владелец такая же как и вызывающий имеет право посылать сигнал. Несмотря на возвращаемую ошибку, владелец файлового дескриптора всё равно устанавливается и сигналы будут посылаться владельцу.

source: Deadlock detection
ru: Обнаружение взаимных блокировок (deadlock)

source: The deadlock-detection algorithm employed by the kernel when dealing with B<F_SETLKW> requests can yield both false negatives (failures to detect deadlocks, leaving a set of deadlocked processes blocked indefinitely) and false positives (B<EDEADLK> errors when there is no deadlock). For example, the kernel limits the lock depth of its dependency search to 10 steps, meaning that circular deadlock chains that exceed that size will not be detected. In addition, the kernel may falsely indicate a deadlock when two or more processes created using the B<clone>(2) B<CLONE_FILES> flag place locks that appear (to the kernel) to conflict.
ru: Алгоритм обнаружения взаимных блокировок задействуется ядром при работе с запросами B<F_SETLKW> и может закончиться как ненахождением (не удалось обнаружить взаимную блокировку и процессы блокируют друг друга навсегда), так и ошибочным нахождением (ошибка B<EDEADLK>, но взаимная блокировка отсутствует). Например, ограничение ядра на вложенность зависимостей блокировки при поиске равна 10, что означает, что цепочки циклических зависимостей, превышающие этот размер, не будут обнаружены. Также ядро может ошибочно посчитать за взаимную блокировку ситуацию, когда два и более процесса, созданных с помощью B<clone>(2) с флагом B<CLONE_FILES>, размещают блокировки, которые похожи (для ядра) на конфликтующие.

source: The Linux implementation of mandatory locking is subject to race conditions which render it unreliable: a B<write>(2) call that overlaps with a lock may modify data after the mandatory lock is acquired; a B<read>(2) call that overlaps with a lock may detect changes to data that were made only after a write lock was acquired. Similar races exist between mandatory locks and B<mmap>(2). It is therefore inadvisable to rely on mandatory locking.
ru: Реализация обязательной блокировки в Linux проводит к состязательности процессов, что делает её ненадёжной: вызов B<write>(2), пересекающийся с блокировкой, может изменить данные после установления обязательной блокировки; вызов B<read>(2), пересекающийся с блокировкой, может обнаружить изменившиеся данные, которые были внесены уже установления блокировки на запись. Подобная состязательность существует между обязательными блокировками и B<mmap>(2). Поэтому нецелесообразно полагаться на обязательную блокировку.

source: I<locks.txt>, I<mandatory-locking.txt>, and I<dnotify.txt> in the Linux kernel source directory I<Documentation/filesystems/> (on older kernels, these files are directly under the I<Documentation/> directory, and I<mandatory-locking.txt> is called I<mandatory.txt>)
ru: Файлы I<locks.txt>, I<mandatory-locking.txt> и I<dnotify.txt> из каталога I<Documentation/filesystems.> исходного кода ядра Linux (в старых ядрах эти файлы были в каталоге I<Documentation/>, а I<mandatory-locking.txt> назывался I<mandatory.txt>).

source: fsync, fdatasync - synchronize a file's in-core state with storage device
ru: fsync, fdatasync - синхронизирует состояние файла в памяти с состоянием на устройстве хранения

source: B<fsync>(): Glibc 2.16 and later: No feature test macros need be defined Glibc up to and including 2.15: _BSD_SOURCE || _XOPEN_SOURCE || /* since glibc 2.8: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
ru: B<fsync>(): в glibc 2.16 и новее: Не требуется определять макросы тестирования свойств до glibc 2.15 включительно: _BSD_SOURCE || _XOPEN_SOURCE || /* начиная с glibc 2.8: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: B<fsync>() transfers ("flushes") all modified in-core data of (i.e., modified buffer cache pages for) the file referred to by the file descriptor I<fd> to the disk device (or other permanent storage device) so that all changed information can be retrieved even if the system crashes or is rebooted. This includes writing through or flushing a disk cache if present. The call blocks until the device reports that the transfer has completed.
ru: Вызов B<fsync>() пересылает («сбрасывает») все изменённые в памяти (in-core) данные (т. е., изменённые страницы буферного кэша) файла, на который указывает файловый дескриптор I<fd>, на дисковое устройство (или другое устройство постоянного хранения) таким образом, что вся изменённая информация может быть получена даже после падения системы или внезапной перезагрузки. При этом выполняется непосредственная запись или сброс дискового кэша (если он есть). Вызов блокируется до тех пор, пока устройство не сообщит, что пересылка завершена.

source: As well as flushing the file data, B<fsync>() also flushes the metadata information associated with the file (see B<inode>(7)).
ru: Помимо сброса самих данных, также сбрасывается информация о метаданных, связанная с файлом (смотрите B<inode>(7)).

source: Calling B<fsync>() does not necessarily ensure that the entry in the directory containing the file has also reached disk. For that an explicit B<fsync>() on a file descriptor for the directory is also needed.
ru: Вызов B<fsync>() необязательно приводит к тому, что элемент каталога, содержащий файл, также будет сброшен на диск. Для этого нужно явно выполнить B<fsync>() для файлового дескриптора каталога.

source: B<fdatasync>() is similar to B<fsync>(), but does not flush modified metadata unless that metadata is needed in order to allow a subsequent data retrieval to be correctly handled. For example, changes to I<st_atime> or I<st_mtime> (respectively, time of last access and time of last modification; see B<inode>(7)) do not require flushing because they are not necessary for a subsequent data read to be handled correctly. On the other hand, a change to the file size (I<st_size>, as made by say B<ftruncate>(2)), would require a metadata flush.
ru: Вызов B<fdatasync>() подобен B<fsync>(), но не записывает изменившиеся метаданные, если эти метаданные не нужны для последующего получения данных. Например, изменения I<st_atime> или I<st_mtime> (время последнего доступа и последнего изменения, соответственно; смотрите B<inode>(7)) не нужно записывать, так как они ненужны для чтения самих данных. С другой стороны, при изменении размера файла (I<st_size>, изменяется, например, B<ftruncate>(2)) запись метаданных будет нужна.

source: The aim of B<fdatasync>() is to reduce disk activity for applications that do not require all metadata to be synchronized with the disk.
ru: Целью создания B<fdatasync>() является сокращение обменов с диском для приложений, которым не нужна синхронизация метаданных с диском.

source: On success, these system calls return zero. On error, -1 is returned, and I<errno> is set appropriately.
ru: В случае успеха данные системные вызовы возвращают ноль. Если произошла ошибка возвращается -1 и I<errno> устанавливается должным образом.

source: I<fd> is not a valid open file descriptor.
ru: I<fd> не является правильным открытым файловым дескриптором.

source: An error occurred during synchronization. This error may relate to data written to some other file descriptor on the same file. Since Linux 4.13, errors from write-back will be reported to all file descriptors that might have written the data which triggered the error. Some filesystems (e.g., NFS) keep close track of which data came through which file descriptor, and give more precise reporting. Other filesystems (e.g., most local filesystems) will report errors to all file descriptors that were open on the file when the error was recorded.
ru: Во время синхронизации произошла ошибка. Эта ошибка может относится к данным, записанным в какой-то другой файловый дескриптор того же файла. Начиная с Linux 4.13, об ошибках отложенной записи (write-back) будет сообщено всем файловым дескрипторам, которые могли записывать данные при возникновении ошибки. Некоторые файловые системы (например, NFS) следят за тем какие данные поступили из файлового дескриптора и сообщают только там, где нужно. Другие файловые системы (например, большинство локальных файловых систем) сообщат об ошибках всем файловым дескрипторам, которые уже открыли файл при возникновении ошибки.

source: Disk space was exhausted while synchronizing.
ru: При синхронизации закончилось дисковое пространство.

source: I<fd> is bound to a special file (e.g., a pipe, FIFO, or socket) which does not support synchronization.
ru: Значение I<fd> связано со специальным файлом (например, канал, FIFO или сокет), который не поддерживает синхронизацию.

source: I<fd> is bound to a file on NFS or another filesystem which does not allocate space at the time of a B<write>(2) system call, and some previous write failed due to insufficient storage space.
ru: Значение I<fd> указывает на файл в NFS или другой файловой системе, которая не выделяет место во время системного вызова B<write>(2), и какая-то предыдущая операция записи завершилась ошибкой из-за нехватки места.

source: AVAILABILITY
ru: ДОСТУПНОСТЬ

source: On POSIX systems on which B<fdatasync>() is available, B<_POSIX_SYNCHRONIZED_IO> is defined in I<E<lt>unistd.hE<gt>> to a value greater than 0. (See also B<sysconf>(3).)
ru: В системах POSIX, в которых есть B<fdatasync>(), в I<E<lt>unistd.hE<gt>> определено значение для B<_POSIX_SYNCHRONIZED_IO> и оно больше 0 (см. также B<sysconf>(3)).

source: On some UNIX systems (but not Linux), I<fd> must be a I<writable> file descriptor.
ru: В некоторых системах UNIX (но не в Linux), I<fd> должен быть файловым дескриптором, I<доступным для записи>.

source: In Linux 2.2 and earlier, B<fdatasync>() is equivalent to B<fsync>(), and so has no performance advantage.
ru: В Linux 2.2 и ранее, вызов B<fdatasync>() эквивалентен B<fsync>(), и поэтому не даёт преимуществ в производительности.

source: The B<fsync>() implementations in older kernels and lesser used filesystems do not know how to flush disk caches. In these cases disk caches need to be disabled using B<hdparm>(8) or B<sdparm>(8) to guarantee safe operation.
ru: Реализации B<fsync>() в старых ядрах и ранее, использовавшиеся в файловых системах, не знают как очищать (flush) дисковые кэши. В этих случаях дисковые кэши требуется заблокировать с помощью B<hdparm>(8) или B<sdparm>(8), чтобы гарантировать безопасное выполнение.

source: fanotify_init - create and initialize fanotify group
ru: fanotify_init - создаёт и инициализирует группу fanotify

source: B<fanotify_init>() initializes a new fanotify group and returns a file descriptor for the event queue associated with the group.
ru: Вызов B<fanotify_init>() инициализирует новую группу fanotify и возвращает файловый дескриптор очереди событий, связанной с группой.

source: The file descriptor is used in calls to B<fanotify_mark>(2) to specify the files, directories, mounts or filesystems for which fanotify events shall be created. These events are received by reading from the file descriptor. Some events are only informative, indicating that a file has been accessed. Other events can be used to determine whether another application is permitted to access a file or directory. Permission to access filesystem objects is granted by writing to the file descriptor.
ru: В файловом дескрипторе, используемом в B<fanotify_mark>(2), задаются файлы, каталоги, точки монтирования и файловые системы, для которых должны создаваться события fanotify. Эти события можно получить с помощью чтения файлового дескриптора. Одни события носят уведомительный характер, показывая что к файлу был получен доступ. Другие события можно использовать для разрешения приложению доступа к файлу или каталогу. Доступ к объектам файловой системы разрешается посредством записи в файловый дескриптор.

source: Multiple programs may be using the fanotify interface at the same time to monitor the same files.
ru: Несколько программ могут использовать интерфейс fanotify к одним и тем же файлам одновременно.

source: In the current implementation, the number of fanotify groups per user is limited to 128. This limit cannot be overridden.
ru: В текущей реализации количество групп fanotify ограничено 128 на пользователя. Это значение нельзя изменить.

source: Calling B<fanotify_init>() requires the B<CAP_SYS_ADMIN> capability. This constraint might be relaxed in future versions of the API. Therefore, certain additional capability checks have been implemented as indicated below.
ru: Для вызова B<fanotify_init>() требуется мандат B<CAP_SYS_ADMIN>. Это требование может быть облегчено в будущих версиях программного интерфейса. Поэтому ниже показаны определённые дополнительные проверки возможностей, которые были реализованы.

source: The I<flags> argument contains a multi-bit field defining the notification class of the listening application and further single bit fields specifying the behavior of the file descriptor.
ru: Аргумент I<flags> содержит многобитовое поле, определяющее класс уведомления, запрашиваемый приложением, а также однобитовые поля, задающие поведение файлового дескриптора.

source: If multiple listeners for permission events exist, the notification class is used to establish the sequence in which the listeners receive the events.
ru: Если на события доступа зарегистрировалось несколько слушателей, то класс уведомления используется для установления порядка слушателей при получении событий.

source: Only one of the following notification classes may be specified in I<flags>:
ru: В I<flags> может быть указан только один из следующих классов уведомления:

source: This value allows the receipt of events notifying that a file has been accessed and events for permission decisions if a file may be accessed. It is intended for event listeners that need to access files before they contain their final data. This notification class might be used by hierarchical storage managers, for example.
ru: Это значение позволяет принимать уведомляющие события об обращении к файлу, и события доступа, запрашивающие доступ к файлу. Он предназначен для слушателей событий, которым требуется доступ к файлам до того, как в них будут содержаться окончательные данные. Этот класс уведомления может быть использован, например, в программах управления иерархического хранения.

source: This value allows the receipt of events notifying that a file has been accessed and events for permission decisions if a file may be accessed. It is intended for event listeners that need to access files when they already contain their final content. This notification class might be used by malware detection programs, for example.
ru: Это значение позволяет принимать уведомляющие события об обращении к файлу, и события доступа, запрашивающие доступ к файлу. Он предназначен для слушателей событий, которым требуется доступ к файлам после того, как они содержат окончательные данные. Этот класс уведомления может быть использован, например, в программах обнаружения вредоносного кода.

source: B<FAN_REPORT_FID> (since Linux 5.1)
ru: B<FAN_REPORT_FID> (начиная с Linux 5.1)

source: This value allows the receipt of events which contain additional information about the underlying filesystem object correlated to an event. An additional structure encapsulates the information about the object and is included alongside the generic event metadata structure. The file descriptor that is used to represent the object correlated to an event is instead substituted with a file handle. It is intended for applications that may find the use of a file handle to identify an object more suitable than a file descriptor. Additionally, it may be used for applications that are interested in directory entry events, such as B<FAN_CREATE>, B<FAN_ATTRIB>, B<FAN_MOVE>, and B<FAN_DELETE> for example. Note that the use of directory modification events are not supported when monitoring a mount point. The use of B<FAN_CLASS_CONTENT> or B<FAN_CLASS_PRE_CONTENT> is not permitted with this flag and will result in the error B<EINVAL>. See B<fanotify>(7) for additional information.
ru: Это значение позволяет получать события, которые содержат дополнительную информацию о нижележащем объекте файловой системы, относящемся к событию. Дополнительная структура содержит информацию об объекте, которая добавляется к структуре общих метаданных событий. Файловый дескриптор, используемый для представления объекта, заменяется в событии файловым описателем. Он предназначен для приложений, которым для работы с файлами удобней использовать файловый описатель, а не файловый дескриптор. Также, его можно использовать в приложениях, которым интересны события об элементах каталога, например таких как B<FAN_CREATE>, B<FAN_ATTRIB>, B<FAN_MOVE> и B<FAN_DELETE>. Заметим, что использование событий изменения каталога не поддерживается при слежении за точкой монтирования. Использование B<FAN_CLASS_CONTENT> или B<FAN_CLASS_PRE_CONTENT> с этим флагом не допускается и приводит к ошибке B<EINVAL>. Дополнительную информацию смотрите в B<fanotify>(7).

source: This is the default value. It does not need to be specified. This value only allows the receipt of events notifying that a file has been accessed. Permission decisions before the file is accessed are not possible.
ru: Значение по умолчанию. Его не нужно указывать. Это значение позволяет принимать только события о доступе к файлу. Право на доступ к файлу задать невозможно.

source: Listeners with different notification classes will receive events in the order B<FAN_CLASS_PRE_CONTENT>, B<FAN_CLASS_CONTENT>, B<FAN_CLASS_NOTIF>. The order of notification for listeners in the same notification class is undefined.
ru: Слушатели с различными классами уведомлений будут принимать события в таком порядке: B<FAN_CLASS_PRE_CONTENT>, B<FAN_CLASS_CONTENT>, B<FAN_CLASS_NOTIF>. Порядок уведомления слушателей в этом классе уведомления не определён.

source: The following bits can additionally be set in I<flags>:
ru: Дополнительно в I<flags> могут быть установлены следующие биты:

source: Set the close-on-exec flag (B<FD_CLOEXEC>) on the new file descriptor. See the description of the B<O_CLOEXEC> flag in B<open>(2).
ru: Устанавливать флаг close-on-exec (B<FD_CLOEXEC>) для нового файлового дескриптора. Смотрите описание флага B<O_CLOEXEC> в B<open>(2).

source: Enable the nonblocking flag (B<O_NONBLOCK>) for the file descriptor. Reading from the file descriptor will not block. Instead, if no data is available, B<read>(2) fails with the error B<EAGAIN>.
ru: Включить неблокирующий флаг (B<O_NONBLOCK>) для файлового дескриптора. Чтение из такого файлового дескриптора не вызовет блокирования. Если данные отсутствуют, то B<read>(2) завершается ошибкой B<EAGAIN>.

source: Remove the limit of 16384 events for the event queue. Use of this flag requires the B<CAP_SYS_ADMIN> capability.
ru: Снять ограничение в 16384 события в очереди событий. Для использования этого флага требуется мандат B<CAP_SYS_ADMIN>.

source: Remove the limit of 8192 marks. Use of this flag requires the B<CAP_SYS_ADMIN> capability.
ru: Снять ограничение в 8192 метки. Для использования этого флага требуется мандат B<CAP_SYS_ADMIN>.

source: B<FAN_REPORT_TID> (since Linux 4.20)
ru: B<FAN_REPORT_TID> (начиная с Linux 4.20)

source: Report thread ID (TID) instead of process ID (PID) in the I<pid> field of the I<struct fanotify_event_metadata> supplied to B<read>(2) (see B<fanotify>(7)).
ru: Хранить ID нити (TID) вместо ID процесса (PID) в поле I<pid> структуры I<struct fanotify_event_metadata>, передаваемой в B<read>(2) (смотрите B<fanotify>(7)).

source: The I<event_f_flags> argument defines the file status flags that will be set on the open file descriptions that are created for fanotify events. For details of these flags, see the description of the I<flags> values in B<open>(2). I<event_f_flags> includes a multi-bit field for the access mode. This field can take the following values:
ru: В аргументе I<event_f_flags> задаются флаги состояния файла, которые будут установлены на открытые файловые описатели, создаваемые для событий fanotify. Подробней об этих флагах смотрите описание значений I<flags> в B<open>(2). Аргумент I<event_f_flags> включает многобитовое поле для режима доступа. Это поел может иметь следующие значения:

source: This value allows only read access.
ru: Это значение разрешает доступ только на чтение.

source: This value allows only write access.
ru: Это значение разрешает доступ только на запись.

source: This value allows read and write access.
ru: Это значение разрешает доступ на чтение и запись.

source: Additional bits can be set in I<event_f_flags>. The most useful values are:
ru: В I<event_f_flags> могут быть установлены дополнительные биты. Наиболее полезные значения:

source: Enable support for files exceeding 2\ GB. Failing to set this flag will result in an B<EOVERFLOW> error when trying to open a large file which is monitored by an fanotify group on a 32-bit system.
ru: Включить поддержку файлов более 2\ ГБ. Если не удастся установить этот флаг, то при попытке открыть большой файл, отслеживаемый группой fanotify на 32-битной системе, возвращается ошибка B<EOVERFLOW>.

source: B<O_CLOEXEC> (since Linux 3.18)
ru: B<O_CLOEXEC> (начиная с Linux 3.18)

source: Enable the close-on-exec flag for the file descriptor. See the description of the B<O_CLOEXEC> flag in B<open>(2) for reasons why this may be useful.
ru: Включить флаг close-on-exec для нового открытого файлового дескриптора. Смотрите описание флага B<O_CLOEXEC> в B<open>(2) для того, чтобы узнать как это может пригодиться.
