Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: If the target of the link is a directory, the preorder return, followed by the return of all of its descendants, followed by a postorder return, is done.
ru: Если цель ссылки — каталог, то выполняется возврат при прямом прохождении, после него возврат всех его потомков, после чего выполняется возврат в обратном порядке.

source: No descendants of this file are visited. The file may be one of those most recently returned by either B<fts_children>() or B<fts_read>().
ru: Не посещать потомков данного файла. Файл может быть одним из последних возвращённых либо B<fts_children>(), либо B<fts_read>().

source: The B<fts_close>() function closes the file hierarchy stream referred to by I<ftsp> and restores the current directory to the directory from which B<fts_open>() was called to open I<ftsp>. The B<fts_close>() function returns 0 on success, and -1 if an error occurs.
ru: Функция B<fts_close>() закрывает поток файловой иерархии, на который указывает I<ftsp>, и делает текущим каталогом тот, который был до вызова B<fts_open>() для открытия I<ftsp>. При успешном выполнении функция B<fts_close>() возвращает 0 и -1 при ошибке.

source: The function B<fts_open>() may fail and set I<errno> for any of the errors specified for B<open>(2) and B<malloc>(3).
ru: Функция B<fts_open>() может завершиться с ошибкой и назначить переменной I<errno> значения, перечисленные в B<open>(2) и B<malloc>(3).

source: The function B<fts_close>() may fail and set I<errno> for any of the errors specified for B<chdir>(2) and B<close>(2).
ru: Функция B<fts_close>() может завершиться с ошибкой и назначить переменной I<errno> значения, перечисленные в B<chdir>(2) и B<close>(2).

source: The functions B<fts_read>() and B<fts_children>() may fail and set I<errno> for any of the errors specified for B<chdir>(2), B<malloc>(3), B<opendir>(3), B<readdir>(3), and B<stat>(2).
ru: Функции B<fts_read>() и B<fts_children>() могут завершиться с ошибкой и назначить переменной I<errno> значения, перечисленные в B<chdir>(2), B<malloc>(3), B<opendir>(3), B<readdir>(3) и B<stat>(2).

source: In addition, B<fts_children>(), B<fts_open>(), and B<fts_set>() may fail and set I<errno> as follows:
ru: Кроме того, функции B<fts_children>(), B<fts_open>() и B<fts_set>() могут завершиться с ошибкой и назначить переменной I<errno> следующие значения:

source: I<options> or I<instr> was invalid.
ru: Некорректное значение I<options> или I<instr>.

source: These functions are available in Linux since glibc2.
ru: Эти функции доступны в версиях Linux начиная с glibc2.

source: In versions of glibc before 2.23, all of the APIs described in this man page are not safe when compiling a program using the LFS APIs (e.g., when compiling with I<-D_FILE_OFFSET_BITS=64>).
ru: В версиях glibc до 2.23 весь описанный здесь программный интерфейс небезопасен, если компиляция программы производится с программным интерфейсом LFS (например, когда компиляция выполняется с I<-D_FILE_OFFSET_BITS=64>).

source: floor, floorf, floorl - largest integral value not greater than argument
ru: floor, floorf, floorl - поиск наибольшего целого значения не превышающего заданный аргумент

source: These functions return the largest integral value that is not greater than I<x>.
ru: Данные функции возвращают наибольшее целое значение не превышающее I<x>.

source: For example, I<floor(0.5)> is 0.0, and I<floor(-0.5)> is -1.0.
ru: Например, результатом I<floor(0.5)> будет 0.0, а I<floor(-0.5)> \(em -1.0.

source: These functions return the floor of I<x>.
ru: Данные функции возвращают целую часть от I<x>.

source: If I<x> is integral, +0, -0, NaN, or an infinity, I<x> itself is returned.
ru: Если I<x> \(em целое, +0, -0, NaN или стремится к бесконечности, то будет возвращено значение I<x>.

source: No errors occur. POSIX.1-2001 documents a range error for overflows, but see NOTES.
ru: Ошибки не возникают. В документах POSIX.1-2001 описывается ошибка диапазона при переполнениях, однако см. ЗАМЕЧАНИЯ.

source: SUSv2 and POSIX.1-2001 contain text about overflow (which might set I<errno> to B<ERANGE>, or raise an B<FE_OVERFLOW> exception). In practice, the result cannot overflow on any current machine, so this error-handling stuff is just nonsense. (More precisely, overflow can happen only when the maximum value of the exponent is smaller than the number of mantissa bits. For the IEEE-754 standard 32-bit and 64-bit floating-point numbers the maximum value of the exponent is 128 (respectively, 1024), and the number of mantissa bits is 24 (respectively, 53).)
ru: В SUSv2 и POSIX.1-2001 есть текст о переполнении (которое может установить I<errno> в B<ERANGE> или вызвать исключение B<FE_OVERFLOW>). На практике, результат не может выйти за диапазон ни на каком компьютере, поэтому обработка этой ошибки не имеет смысла (точнее говоря, переполнение возможно только в том случае, когда максимальное значение экспоненты меньше числа бит мантиссы. В стандарте IEEE-754 для 32- и 64-битных чисел с плавающей точкой максимальное значение экспоненты равно 128 и 1024 соответственно, а число бит мантиссы — 24 и 53 соответственно).

source: fputwc, putwc - write a wide character to a FILE stream
ru: fputwc, putwc - записывает широкий символ в поток FILE

source: The B<fputwc>() function is the wide-character equivalent of the B<fputc>(3) function. It writes the wide character I<wc> to I<stream>. If I<ferror(stream)> becomes true, it returns B<WEOF>. If a wide-character conversion error occurs, it sets I<errno> to B<EILSEQ> and returns B<WEOF>. Otherwise, it returns I<wc>.
ru: Функция B<fputwc> — это эквивалент функции B<fputc>(3), но для широких символов. Она записывает широкий символ I<wc> в поток I<stream>. Если значение I<ferror(stream)> истинно, то возвращается B<WEOF>. Если при преобразовании в широкий символ возникает ошибка, то значение переменной I<errno> устанавливается равным B<EILSEQ> и возвращается B<WEOF>. В любом другом случае возвращается I<wc>.

source: The B<putwc>() function or macro functions identically to B<fputwc>(). It may be implemented as a macro, and may evaluate its argument more than once. There is no reason ever to use it.
ru: Функция B<putwc>() — это функция, или макрос, идентичный B<fputwc>(). Она может быть реализована в виде макроса, и может вычислять свой аргумент более одного раза. Вообще нет смысла использовать эту функцию.

source: The B<fputwc>() function returns I<wc> if no error occurred, or B<WEOF> to indicate an error. In the event of an error, I<errno> is set to indicate the cause.
ru: Функция B<fputwc>() возвращает I<wc>, если не было ошибок, или B<WEOF> в противном случае. При ошибке в I<errno> записывается соответствующее значение.

source: Conversion of I<wc> to the stream's encoding fails.
ru: Не удалось преобразовать I<wc> в кодировку потока.

source: The behavior of B<fputwc>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<fputwc>() зависит от категории B<LC_CTYPE> текущей локали.

source: In the absence of additional information passed to the B<fopen>(3) call, it is reasonable to expect that B<fputwc>() will actually write the multibyte sequence corresponding to the wide character I<wc>.
ru: Из-за отсутствия дополнительной информации, передаваемой в B<fopen>(3), закономерно ожидать, что B<fputwc>() на самом деле пишет многобайтовую последовательность, соответствующую широкому символу I<wc>.

source: fmax, fmaxf, fmaxl - determine maximum of two floating-point numbers
ru: fmax, fmaxf, fmaxl - определение максимального из двух чисел с плавающей запятой

source: These functions return the larger value of I<x> and I<y>.
ru: Данные функции возвращают большее значение из I<x> и I<y>.

source: These functions return the maximum of I<x> and I<y>.
ru: Данные функции возвращают большее значение из I<x> и I<y>.

source: fma, fmaf, fmal - floating-point multiply and add
ru: fma, fmaf, fmal - умножение и сложение чисел с плавающей запятой

source: These functions compute I<x> * I<y> + I<z>. The result is rounded as one ternary operation according to the current rounding mode (see B<fenv>(3)).
ru: Эти функции вычисляют I<x> * I<y> + I<z>. Результат округляется как единая тернарная операция согласно текущему режиму округления (смотрите B<fenv>(3)).

source: These functions return the value of I<x> * I<y> + I<z>, rounded as one ternary operation.
ru: Данные функции возвращают результат I<x> * I<y> + I<z>, округлённый как для единой тернарной операции.

source: If I<x> times I<y> is an exact infinity, and I<z> is an infinity with the opposite sign, a domain error occurs, and a NaN is returned.
ru: Если I<x> умноженное на I<y> стремится к бесконечности и значение I<z> равно минус бесконечности, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If one of I<x> or I<y> is an infinity, the other is 0, and I<z> is not a NaN, a domain error occurs, and a NaN is returned.
ru: Если I<x> или I<y> равно бесконечности, не равно 0 и I<z> не равно NaN, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If one of I<x> or I<y> is an infinity, and the other is 0, and I<z> is a NaN, a domain error occurs, and a NaN is returned.
ru: Если I<x> или I<y> равно бесконечности, не равно 0, а I<z> равно NaN, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: If I<x> times I<y> is not an infinity times zero (or vice versa), and I<z> is a NaN, a NaN is returned.
ru: Если I<x> умноженное на I<y> не равно бесконечности умноженной на 0 (или наоборот) и значение I<z> равно NaN, то будет возвращено NaN.

source: If the result overflows, a range error occurs, and an infinity with the correct sign is returned.
ru: Если происходит переполнение результата, возникает ошибка диапазона, и возвращается бесконечность с математически правильным знаком.

source: If the result underflows, a range error occurs, and a signed 0 is returned.
ru: Если в результате исчерпана степень числа, возникает ошибка диапазона и возвращается 0 со знаком.

source: Domain error: I<x> * I<y> + I<z>, or I<x> * I<y> is invalid and I<z> is not a NaN
ru: Ошибка области: I<x> * I<y> + I<z> или I<x> * I<y> некорректно и I<z> не равно NaN

source: An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: Возникает исключение неправильной плавающей запятой (B<FE_INVALID>).

source: Range error: result underflow
ru: Ошибка диапазона: результат исчерпал степень

source: An underflow floating-point exception (B<FE_UNDERFLOW>) is raised.
ru: Возникает исключение исчерпания степени чисел с плавающей запятой (B<FE_UNDERFLOW>).

source: feclearexcept, fegetexceptflag, feraiseexcept, fesetexceptflag, fetestexcept, fegetenv, fegetround, feholdexcept, fesetround, fesetenv, feupdateenv, feenableexcept, fedisableexcept, fegetexcept - floating-point rounding and exception handling
ru: feclearexcept, fegetexceptflag, feraiseexcept, fesetexceptflag, fetestexcept, fegetenv, fegetround, feholdexcept, fesetround, fesetenv, feupdateenv, feenableexcept, fedisableexcept, fegetexcept - округление и обработка ошибок для чисел с плавающей запятой

source: These eleven functions were defined in C99, and describe the handling of floating-point rounding and exceptions (overflow, zero-divide, etc.).
ru: Эти одиннадцать функций определены в C99, и описывают обработку округления и исключения (переполнение, деление на ноль и т. д.) при работе с числами с плавающей запятой.

source: Exceptions
ru: Исключения

source: The I<divide-by-zero> exception occurs when an operation on finite numbers produces infinity as exact answer.
ru: Исключение I<деление-на-ноль (divide-by-zero)> возникает, когда результатом операции над конечными числами является бесконечность.

source: The I<overflow> exception occurs when a result has to be represented as a floating-point number, but has (much) larger absolute value than the largest (finite) floating-point number that is representable.
ru: Исключение I<переполнение (overflow)> возникает, когда результат возможно представить в виде числа с плавающей запятой, но он намного больше абсолютного значения самого большого (конечного) представимого числа с плавающей запятой.

source: The I<underflow> exception occurs when a result has to be represented as a floating-point number, but has smaller absolute value than the smallest positive normalized floating-point number (and would lose much accuracy when represented as a denormalized number).
ru: Исключение I<исчерпания(underflow)> возникает, когда результат можно представить в виде числа с плавающей запятой, но он меньше абсолютного значения самого малого положительного нормализованного числа с плавающей запятой (и возникает большая потеря точности, если представить его в виде денормализованного числа).

source: The I<inexact> exception occurs when the rounded result of an operation is not equal to the infinite precision result. It may occur whenever I<overflow> or I<underflow> occurs.
ru: Исключение I<inexact> возникает, когда округлённый результат операции не равен бесконечной точности результата. Оно может произойти при исключении I<переполнении> или I<исчерпании>.

source: The I<invalid> exception occurs when there is no well-defined result for an operation, as for 0/0 or infinity - infinity or sqrt(-1).
ru: Исключение I<invalid> возникает, когда при операции получается плохо определённый результат (no well-defined result), например, при 0/0 или бесконечность - бесконечность или sqrt(-1).

source: Exception handling
ru: Обработка исключений

source: Exceptions are represented in two ways: as a single bit (exception present/absent), and these bits correspond in some implementation-defined way with bit positions in an integer, and also as an opaque structure that may contain more information about the exception (perhaps the code address where it occurred).
ru: Исключения представляются двумя способами: в виде одного бита (наличие/отсутствие исключения) и целого числа, где каждый бит соответствует исключению (определяется реализацией), а также структуры скрытого формата, которая может содержать дополнительную информацию об исключении (возможно, адрес в коде, где оно возникло).

source: Each of the macros B<FE_DIVBYZERO>, B<FE_INEXACT>, B<FE_INVALID>, B<FE_OVERFLOW>, B<FE_UNDERFLOW> is defined when the implementation supports handling of the corresponding exception, and if so then defines the corresponding bit(s), so that one can call exception handling functions, for example, using the integer argument B<FE_OVERFLOW>|B<FE_UNDERFLOW>. Other exceptions may be supported. The macro B<FE_ALL_EXCEPT> is the bitwise OR of all bits corresponding to supported exceptions.
ru: Если реализацией поддерживается обработка определённого исключения, то определён соответствующий макрос: B<FE_DIVBYZERO>, B<FE_INEXACT>, B<FE_INVALID>, B<FE_OVERFLOW>, B<FE_UNDERFLOW>. Если таким способом определить соответствующий бит(ы), например, с целочисленным аргументом B<FE_OVERFLOW>|B<FE_UNDERFLOW>, то могут вызываться функции обработки исключений. Могут поддерживаться и другие исключения. Макрос B<FE_ALL_EXCEPT> — это побитовый OR всех бит, соответствующих поддерживаемым исключениям.

source: The B<feclearexcept>() function clears the supported exceptions represented by the bits in its argument.
ru: Функция B<feclearexcept>() очищает поддерживаемые исключения, указанные битами в аргументе.

source: The B<fegetexceptflag>() function stores a representation of the state of the exception flags represented by the argument I<excepts> in the opaque object I<*flagp>.
ru: Функция B<fegetexceptflag>() сохраняет представление состояния флагов исключения, представленного аргументом I<excepts> в чёрном ящике I<*flagp>.

source: The B<feraiseexcept>() function raises the supported exceptions represented by the bits in I<excepts>.
ru: Функция B<feraiseexcept>() возбуждает поддерживаемые исключения, заданные битами в I<excepts>.

source: The B<fesetexceptflag>() function sets the complete status for the exceptions represented by I<excepts> to the value I<*flagp>. This value must have been obtained by an earlier call of B<fegetexceptflag>() with a last argument that contained all bits in I<excepts>.
ru: Функция B<fesetexceptflag>() задаёт полное состояние для исключений, представленных в I<excepts>, в значение I<*flagp>. Это значение должно быть получено с помощью вызова B<fegetexceptflag>() с последним аргументом, значение которого содержит все биты в I<excepts>.

source: The B<fetestexcept>() function returns a word in which the bits are set that were set in the argument I<excepts> and for which the corresponding exception is currently set.
ru: Функция B<fetestexcept>() возвращает слово, в котором биты устанавливаются в соответствии с установленными битами в аргументе I<excepts> и для которых установлено соответствующее исключение.

source: Rounding mode
ru: Режим округления

source: The rounding mode determines how the result of floating-point operations is treated when the result cannot be exactly represented in the significand. Various rounding modes may be provided: round to nearest (the default), round up (toward positive infinity), round down (toward negative infinity), and round toward zero.
ru: Режим округления определяет трактовку результата операций с плавающей запятой, если результат не может быть точно представлен в значащей части числа(significand). Могут быть доступны различные режимы округления: округление к ближайшему (по умолчанию), округление в сторону увеличения (round up, к положительной бесконечности), округление в сторону уменьшения (round down, к отрицательной бесконечности) и округление в сторону нуля.

source: Each of the macros B<FE_TONEAREST>, B<FE_UPWARD>, B<FE_DOWNWARD>, and B<FE_TOWARDZERO> is defined when the implementation supports getting and setting the corresponding rounding direction.
ru: Если в реализации поддерживается получение и установка направления округления, то для них определены соответствующие макросы: B<FE_TONEAREST>, B<FE_UPWARD>, B<FE_DOWNWARD> и B<FE_TOWARDZERO>.

source: The B<fegetround>() function returns the macro corresponding to the current rounding mode.
ru: Функция B<fegetround>() возвращает макрос, соответствующий текущему режиму округления.

source: The B<fesetround>() function sets the rounding mode as specified by its argument and returns zero when it was successful.
ru: Функция B<fesetround>() задаёт режим округления в соответствии со значением аргумента и возвращает ноль при успешном выполнении.

source: C99 and POSIX.1-2008 specify an identifier, B<FLT_ROUNDS>, defined in I<E<lt>float.hE<gt>>, which indicates the implementation-defined rounding behavior for floating-point addition. This identifier has one of the following values:
ru: В C99 и POSIX.1-2008 в файле I<E<lt>float.hE<gt>> описан идентификатор B<FLT_ROUNDS>, который определяет используемый реализацией режим поведения для сложения чисел с плавающей запятой. Значениями идентификатора могут быть:

source: The rounding mode is not determinable.
ru: Режим округления не определён.

source: Rounding is toward 0.
ru: Округление к нулю.

source: Rounding is toward nearest number.
ru: Округление к ближайшему числу.

source: Rounding is toward positive infinity.
ru: Округление в сторону положительной бесконечности.

source: Rounding is toward negative infinity.
ru: Округление в сторону отрицательной бесконечности.

source: Other values represent machine-dependent, nonstandard rounding modes.
ru: Существуют другие значения для нестандартных режимов округления, зависящие от архитектуры.

source: The value of B<FLT_ROUNDS> should reflect the current rounding mode as set by B<fesetround>() (but see BUGS).
ru: Значение B<FLT_ROUNDS> должно отражать текущий режим округления, который задаётся с помощью B<fesetround>() (но смотрите ДЕФЕКТЫ).

source: Floating-point environment
ru: Окружение плавающей запятой

source: The entire floating-point environment, including control modes and status flags, can be handled as one opaque object, of type I<fenv_t>. The default environment is denoted by B<FE_DFL_ENV> (of type I<const fenv_t\ *>). This is the environment setup at program start and it is defined by ISO C to have round to nearest, all exceptions cleared and a nonstop (continue on exceptions) mode.
ru: С полным окружением плавающей запятой, включая режимы управления и флаги состояния, можно работать через скрытый объект с типом I<fenv_t>. Окружение по умолчанию обозначается как B<FE_DFL_ENV> (с типом I<const fenv_t\ *>). Это окружение задаётся при запуске программы и определено в ISO C; в нём включено округление к ближайшему числу, все исключения сброшены и задан безостановочный режим (продолжать при возникновении исключений).

source: The B<fegetenv>() function saves the current floating-point environment in the object I<*envp>.
ru: Функция B<fegetenv>() сохраняет текущее окружение плавающей запятой в объект I<*envp>.

source: The B<feholdexcept>() function does the same, then clears all exception flags, and sets a nonstop (continue on exceptions) mode, if available. It returns zero when successful.
ru: Функция B<feholdexcept>() делает то же самое, затем очищает все флаги исключений и включает безостановочный режим (продолжать при возникновении исключений), если он доступен. При успешном выполнении возвращается ноль.

source: The B<fesetenv>() function restores the floating-point environment from the object I<*envp>. This object must be known to be valid, for example, the result of a call to B<fegetenv>() or B<feholdexcept>() or equal to B<FE_DFL_ENV>. This call does not raise exceptions.
ru: Функция B<fesetenv>() восстанавливает окружение плавающей запятой из объекта I<*envp>. Данный объект должен быть корректен, например, должен быть получен из вызова B<fegetenv>() или B<feholdexcept>() или равен B<FE_DFL_ENV>. Данный вызов не возбуждает исключения.

source: The B<feupdateenv>() function installs the floating-point environment represented by the object I<*envp>, except that currently raised exceptions are not cleared. After calling this function, the raised exceptions will be a bitwise OR of those previously set with those in I<*envp>. As before, the object I<*envp> must be known to be valid.
ru: Функция B<feupdateenv>() устанавливает окружение плавающей запятой, представленное объектом I<*envp>, за исключением того, что уже возбуждённые исключения не очищаются. После вызова этой функции, возбуждённые исключения будут побитово сложены с установленными ранее в I<*envp>. Как и для предыдущей функции, объект I<*envp> должен быть корректен.

source: These functions return zero on success and nonzero if an error occurred.
ru: При успешном выполнении эти функции возвращают ноль и не ноль при ошибке.
