Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: If your FTP server daemon doesn't use B<ftpusers>, then it is suggested that you read its documentation to find out how to block access for certain users. Washington University FTP server Daemon (wuftpd) and Professional FTP Daemon (proftpd) are known to make use of B<ftpusers>.
ru: Если сервер FTP не использует B<ftpusers>, то рекомендуется прочитать его документацию, чтобы найти способ блокирования определённых пользователей. Сервер Washington University FTP Daemon (wuftpd) и Professional FTP Daemon (proftpd) умеют обращаться с B<ftpusers>.

source: Format
ru: Формат

source: The format of B<ftpusers> is very simple. There is one account name (or username) per line. Lines starting with a # are ignored.
ru: Формат B<ftpusers> очень прост. Он содержит по одному имени учётной записи (или имени пользователя) в каждой строке. Строки, начинающиеся с # игнорируются.

source: filesystems - Linux filesystem types: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs,
ru: filesystems - типы файловых систем Linux: ext, ext2, ext3, ext4, hpfs, iso9660, JFS, minix, msdos, ncpfs nfs, ntfs, proc, Reiserfs, smb, sysv, umsdos, vfat, XFS, xiafs,

source: When, as is customary, the B<proc> filesystem is mounted on I</proc>, you can find in the file I</proc/filesystems> which filesystems your kernel currently supports; see B<proc>(5) for more details. There is also a legacy B<sysfs>(2) system call (whose availability is controlled by the B<CONFIG_SYSFS_SYSCALL> kernel build configuration option since Linux 3.15) that enables enumeration of the currently available filesystem types regardless of I</proc> availability and/or sanity.
ru: Если, как обычно, файловая система B<proc> смонтирована в I</proc>, то в файле I</proc/filesystems> можно найти список типов файловых систем, которые в текущий момент поддерживаются ядром; подробности смотрите в B<proc>(5). Также есть устаревший системный вызов B<sysfs>(2) (доступен, если ядро собрано с параметром настойки B<CONFIG_SYSFS_SYSCALL>, начиная с Linux 3.15), который содержи перечисление доступных типов файловых систем независимо от того, смонтировано ли что-то в I</proc> или нет.

source: If you need a currently unsupported filesystem, insert the corresponding kernel module or recompile the kernel.
ru: Если требуется пока не поддерживаемая файловая система, то загрузите соответствующий модуль или пересоберите ядро.

source: In order to use a filesystem, you have to I<mount> it; see B<mount>(2) and B<mount>(8).
ru: Чтобы использовать файловую систему, её нужно I<смонтировать>; смотрите B<mount>(2) и B<mount>(8).

source: iThe following list provides a short description of the available or historically available filesystems in the Linux kernel. See the kernel documentation for a comprehensive description of all options and limitations.
ru: В списке далее приводится краткое описание доступных или доступных ранее файловых систем в ядре Linux. Полное описание, все параметры и ограничения описаны в документации к ядру.

source: is an elaborate extension of the B<minix> filesystem. It has been completely superseded by the second version of the extended filesystem (B<ext2>) and has been removed from the kernel (in 2.1.21).
ru: Доработанное расширение файловой системы B<minix>. Полностью вытеснена второй версией расширенной файловой системой (B<ext2>) и была удалена из ядра (в 2.1.21).

source: is the high performance disk filesystem used by Linux for fixed disks as well as removable media. The second extended filesystem was designed as an extension of the extended filesystem (B<ext>). See B<ext2>(5).
ru: Высокопроизводительная дисковая файловая система Linux для жёстких дисков, а также сменных носителей. Вторая версия расширенной файловой системы разрабатывалась как расширение расширенной файловой системы (B<ext>). Смотрите B<ext2>(5).

source: is a journaling version of the B<ext2> filesystem. It is easy to switch back and forth between B<ext2> and B<ext3>. See B<ext3>(5).
ru: Журналируемая версия файловой системы B<ext2>. Очень легко переключаться с B<ext2> на B<ext3> и обратно. Смотрите B<ext3>(5).

source: is a set of upgrades to B<ext3> including substantial performance and reliability enhancements, plus large increases in volume, file, and directory size limits. See B<ext4>(5).
ru: Обновлённая версия B<ext3>, включающая существенное увеличение производительности и надёжности, размеров границ томов, файлов и каталогов. Смотрите B<ext4>(5).

source: is the High Performance Filesystem, used in OS/2. This filesystem is read-only under Linux due to the lack of available documentation.
ru: Высокопроизводительная файловая система (High Performance Filesystem), используемая в OS/2. Данная файловая система доступна под Linux только для чтения из-за отсутствия документации.

source: is a CD-ROM filesystem type conforming to the ISO 9660 standard.
ru: Файловая система для CD-ROM, соответствующая стандарту ISO 9660.

source: Linux supports High Sierra, the precursor to the ISO 9660 standard for CD-ROM filesystems. It is automatically recognized within the B<iso9660> filesystem support under Linux.
ru: В Linux есть поддержка стандарта High Sierra, предшественника стандарта ISO 9660 для файловых систем CD-ROM. High Sierra автоматически распознается при включении в Linux поддержки файловой системы B<iso9660>.

source: Linux also supports the System Use Sharing Protocol records specified by the Rock Ridge Interchange Protocol. They are used to further describe the files in the B<iso9660> filesystem to a UNIX host, and provide information such as long filenames, UID/GID, POSIX permissions, and devices. It is automatically recognized within the B<iso9660> filesystem support under Linux.
ru: В Linux также есть поддержка записей System Use Sharing Protocol, которые определены в протоколе обмена Rock Ridge. Они используются для подробного описания файлов в файловой системе B<iso9660> для машин UNIX и предоставляют информацию о длинных именах файлов, UID/GID, правах доступа к файлам по стандарту POSIX и файлах устройств. Rock Ridge автоматически распознаётся при включении в Linux поддержки файловой системы B<iso9660>.

source: is a journaling filesystem, developed by IBM, that was integrated into Linux in kernel 2.4.24.
ru: Журналируемая файловая система, разработанная IBM, была добавлена в Linux начиная с ядра версии 2.4.24.

source: is the filesystem used in the Minix operating system, the first to run under Linux. It has a number of shortcomings, including a 64\ MB partition size limit, short filenames, and a single timestamp. It remains useful for floppies and RAM disks.
ru: Файловая система, использующаяся в операционной системе Minix, первая, на которой заработал Linux. Имеет несколько недостатков: максимальный размер раздела 64\ МБ, короткие имена файлов и одна временная метка. Осталась полезной для дискет и RAM-дисков.

source: is the filesystem used by DOS, Windows, and some OS/2 computers. B<msdos> filenames can be no longer than 8 characters, followed by an optional period and 3 character extension.
ru: Файловая система, используемая в DOS, Windows и на некоторых компьютерах с OS/2. Имена файлов в B<msdos> не могут быть более 8 символов с необязательным расширением из 3 символов, отделённого точкой.

source: is a network filesystem that supports the NCP protocol, used by Novell NetWare.
ru: Сетевая файловая система, которая поддерживает протокол NCP, используемый в Novell NetWare.

source: To use B<ncpfs>, you need special programs, which can be found at E<.UR ftp://linux01.gwdg.de\:/pub\:/ncpfs> E<.UE .>
ru: Для использования B<ncpfs> необходимы специальные программы, которые можно найти по адресу E<.UR ftp://linux01.gwdg.de\:/pub\:/ncpfs> E<.UE .>

source: is the network filesystem used to access disks located on remote computers.
ru: Сетевая файловая система, используемая для доступа к дискам, расположенным на других компьютерах в сети.

source: replaces Microsoft Window's FAT filesystems (VFAT, FAT32). It has reliability, performance, and space-utilization enhancements plus features like ACLs, journaling, encryption, and so on.
ru: Замена для файловых систем Microsoft Window FAT (VFAT, FAT32). Улучшена надёжность, производительность и использование пространства и добавлены такие возможности как списки контроля, журналирование, шифрование и т.д.

source: is a pseudo filesystem which is used as an interface to kernel data structures rather than reading and interpreting I</dev/kmem>. In particular, its files do not take disk space. See B<proc>(5).
ru: Ненастоящая файловая система, используется как интерфейс к структурам данных ядра вместо прямого чтения из I</dev/kmem>. В частности, её файлы не занимают пространство на диске. Смотрите B<proc>(5).

source: is a journaling filesystem, designed by Hans Reiser, that was integrated into Linux in kernel 2.4.1.
ru: Журналируемая файловая система, разработанная Гансом Рейзером (Hans Reiser), была добавлена в Linux начиная с ядра версии 2.4.1.

source: is a network filesystem that supports the SMB protocol, used by Windows for Workgroups, Windows NT, and Lan Manager. See E<.UR https://www.samba.org\:/samba\:/smbfs/> E<.UE .>
ru: Сетевая файловая система, которая поддерживает протокол SMB, используемый в Windows for Workgroups, Windows NT и Lan Manager. Смотрите E<.UR https://www.samba.org\:/samba\:/smbfs/> E<.UE .>

source: is an implementation of the SystemV/Coherent filesystem for Linux. It implements all of Xenix FS, SystemV/386 FS, and Coherent FS.
ru: Реализация файловой системы SystemV/Coherent для Linux. Поддерживает файловые системы из Xenix, SystemV/386 и Coherent.

source: is an extended DOS filesystem used by Linux. It adds capability for long filenames, UID/GID, POSIX permissions, and special files (devices, named pipes, etc.) under the DOS filesystem, without sacrificing compatibility with DOS.
ru: Расширенная файловая система DOS, используемая в Linux. Была добавлена поддержка длинных имён файлов, UID/GID, права доступа POSIX и специальные файлы (устройства, именованные каналы и т.д.) без ухудшения совместимости с DOS.

source: is a filesystem whose contents reside in virtual memory. Since the files on such filesystems typically reside in RAM, file access is extremely fast. See B<tmpfs>(5).
ru: Файловая система, чьё содержимое находится в виртуальной памяти. Так как файлы в таких файловых системах, обычно, располагаются в оперативной памяти, то доступ к файлах очень быстр. Смотрите B<tmpfs>(5).

source: is an extended FAT filesystem used by Microsoft Windows95 and Windows NT. B<vfat> adds the capability to use long filenames under the MSDOS filesystem.
ru: Расширенная файловая система FAT, используемая в Microsoft Windows95 и Windows NT. В B<vfat> добавлена поддержка длинных имён файлов из файловой системы MSDOS.

source: is a journaling filesystem, developed by SGI, that was integrated into Linux in kernel 2.4.20.
ru: Журналируемая файловая система, разработанная SGI, была добавлена в Linux начиная с ядра версии 2.4.20.

source: was designed and implemented to be a stable, safe filesystem by extending the Minix filesystem code. It provides the basic most requested features without undue complexity. The B<xiafs> filesystem is no longer actively developed or maintained. It was removed from the kernel in 2.1.21.
ru: Разработана и реализована как стабильная надёжная файловая система посредством расширения кода файловой системы Minix. Предоставляет основные часто запрашиваемые возможности без неоправданной сложности. Файловая система B<xiafs> больше активно не разрабатывается или сопровождается. Была удалена из ядра 2.1.21.

source: finite, finitef, finitel, isinf, isinff, isinfl, isnan, isnanf, isnanl - BSD floating-point classification functions
ru: finite, finitef, finitel, isinf, isinff, isinfl, isnan, isnanf, isnanl - функции BSD для классификации чисел с плавающей запятой

source: /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: _XOPEN_SOURCE\ E<gt>=\ 600 || _ISOC99_SOURCE || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 600 || _ISOC99_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: _XOPEN_SOURCE || _ISOC99_SOURCE || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE || _ISOC99_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: _XOPEN_SOURCE\ E<gt>=\ 600 || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 600 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии gibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<finite>(), B<finitef>(), and B<finitel>() functions return a nonzero value if I<x> is neither infinite nor a "not-a-number" (NaN) value, and 0 otherwise.
ru: Функции B<finite>(), B<finitef>() и B<finitel>() возвращают ненулевое значение, если I<x> не равно бесконечности или «не числу» (NaN), в противном случае 0.

source: The B<isnan>(), B<isnanf>(), and B<isnanl>() functions return a nonzero value if I<x> is a NaN value, and 0 otherwise.
ru: Функции B<isnan>(), B<isnanf>() и B<isnanl>() возвращают ненулевое значение, если I<x> равно NaN, в противном случае 0.

source: The B<isinf>(), B<isinff>(), and B<isinfl>() functions return 1 if I<x> is positive infinity, -1 if I<x> is negative infinity, and 0 otherwise.
ru: Функции B<isinf>(), B<isinff>() и B<isinfl>() возвращают 1, если I<x> равно плюс бесконечности, -1, если I<x> равно минус бесконечности, в остальных случаях 0.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: Note that these functions are obsolete. C99 defines macros B<isfinite>(), B<isinf>(), and B<isnan>() (for all types) replacing them. Further note that the C99 B<isinf>() has weaker guarantees on the return value. See B<fpclassify>(3).
ru: Заметим, что эти функции устарели. В C99 их заменили макросы B<isfinite>(), B<isinf>() и B<isnan>() (для всех типов). Также заметим, что для B<isinf>() C99 не гарантируется возвращаемого значения. Смотрите B<fpclassify>(3).

source: fdim, fdimf, fdiml - positive difference
ru: fdim, fdimf, fdiml - вычисление положительной разницы

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: These functions return the positive difference, max(I<x>-I<y>,0), between their arguments.
ru: Эти функции возвращают положительную разницу, max(I<x>-I<y>,0), между их аргументами.

source: On success, these functions return the positive difference.
ru: При успешном выполнении данные функции возвращают положительную разницу.

source: If I<x> or I<y> is a NaN, a NaN is returned.
ru: Если I<x> или I<y> равно NaN, то будет возвращено NaN.

source: If the result overflows, a range error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively.
ru: Если в результате превышена разрядность, то возникает ошибка диапазона и функции возвращают B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, соответственно.

source: See B<math_error>(7) for information on how to determine whether an error has occurred when calling these functions.
ru: Смотрите B<math_error>(7), чтобы определить, какие ошибки могут возникать при вызове этих функций.

source: The following errors can occur:
ru: Могут возникать следующие ошибки:

source: Range error: result overflow
ru: Ошибка диапазона: результат превысил разрядность

source: An overflow floating-point exception (B<FE_OVERFLOW>) is raised.
ru: Вызывается исключение переполнения плавающей точки (B<FE_OVERFLOW>).

source: These functions do not set I<errno>.
ru: Эти функции не изменяют I<errno>.

source: These functions first appeared in glibc in version 2.1.
ru: Эти функции впервые появились в glibc 2.1.

source: fnmatch - match filename or pathname
ru: fnmatch - сравнивает имя файла или путь

source: The B<fnmatch>() function checks whether the I<string> argument matches the I<pattern> argument, which is a shell wildcard pattern (see B<glob>(7)).
ru: Функция B<fnmatch>() проверяет, совпадает ли параметр I<string> с параметром I<pattern>, который является подстановочным шаблоном оболочки (смотрите B<glob>(7)).

source: The I<flags> argument modifies the behavior; it is the bitwise OR of zero or more of the following flags:
ru: Аргумент I<flags> изменяет поведение; он является битовой маской и может содержать следующие флаги:

source: If this flag is set, treat backslash as an ordinary character, instead of an escape character.
ru: Если этот флаг установлен, то обратная косая черта воспринимается как простой символ, а не специальный.

source: If this flag is set, match a slash in I<string> only with a slash in I<pattern> and not by an asterisk (*) or a question mark (?) metacharacter, nor by a bracket expression ([]) containing a slash.
ru: Если этот флаг установлен, то косая черта в строке I<string> будет совпадать только с косой чертой в шаблоне I<pattern>, но не с метасимволом звёздочка (*) или вопросительным знаком (?) и не последовательностью в квадратных скобках ([]), содержащую косую черту.

source: If this flag is set, a leading period in I<string> has to be matched exactly by a period in I<pattern>. A period is considered to be leading if it is the first character in I<string>, or if both B<FNM_PATHNAME> is set and the period immediately follows a slash.
ru: Если этот флаг установлен, то начальная точка в строке I<string> должна сравниваться именно с точкой в шаблоне I<pattern>. Точка считается начальной, если она является первым символом в строке I<string>, или если установлен флаг B<FNM_PATHNAME> и точка следует сразу за косой чертой.

source: This is a GNU synonym for B<FNM_PATHNAME>.
ru: Синоним B<FNM_PATHNAME> в GNU.

source: If this flag (a GNU extension) is set, the pattern is considered to be matched if it matches an initial segment of I<string> which is followed by a slash. This flag is mainly for the internal use of glibc and is implemented only in certain cases.
ru: Если этот флаг (расширение GNU) установлен, то строка считается совпавшей с шаблоном, если совпадает начальный сегмент строки I<string>, который следует сразу за косой чертой. Этот флаг для внутреннего использования glibc и не всегда реализуется.

source: If this flag (a GNU extension) is set, the pattern is matched case-insensitively.
ru: Если этот флаг (расширение GNU) установлен, то выражения сравниваются без учёта регистра символов.

source: If this flag (a GNU extension) is set, extended patterns are supported, as introduced by \&'ksh' and now supported by other shells. The extended format is as follows, with I<pattern-list> being a \&'|' separated list of patterns.
ru: Если этот флаг (расширение GNU) установлен, то поддерживаются расширенные шаблоны из \&'ksh' и теперь поддерживаемые другими оболочками. В расширенном формате I<pattern-list> предоставляет собой список шаблонов, разделённых \&'|', входит следующее:

source: The pattern matches if zero or one occurrences of any of the patterns in the I<pattern-list> match the input I<string>.
ru: Шаблон совпадает, если ноль или одно вхождение любого шаблона в I<pattern-list> совпадает с входной строкой I<string>.

source: The pattern matches if zero or more occurrences of any of the patterns in the I<pattern-list> match the input I<string>.
ru: Шаблон совпадает, если ноль или более вхождений любых шаблонов в I<pattern-list> совпадает с входной строкой I<string>.

source: The pattern matches if one or more occurrences of any of the patterns in the I<pattern-list> match the input I<string>.
ru: Шаблон совпадает, если одно или более вхождений любых шаблонов в I<pattern-list> совпадает с входной строкой I<string>.

source: The pattern matches if exactly one occurrence of any of the patterns in the I<pattern-list> match the input I<string>.
ru: Шаблон совпадает, если только одно вхождение любого шаблона в I<pattern-list> совпадает с входной строкой I<string>.

source: The pattern matches if the input I<string> cannot be matched with any of the patterns in the I<pattern-list>.
ru: Шаблон совпадает, если входная строка I<string> не совпадает с каким-либо шаблоном в I<pattern-list>.

source: Zero if I<string> matches I<pattern>, B<FNM_NOMATCH> if there is no match or another nonzero value if there is an error.
ru: Возвращает ноль, если строка I<string> совпадает с шаблоном I<pattern>, возвращает B<FNM_NOMATCH>, если строка и шаблон не совпадают, или другое ненулевое значение, если произошла ошибка.

source: POSIX.1-2001, POSIX.1-2008, POSIX.2. The B<FNM_FILE_NAME>, B<FNM_LEADING_DIR>, and B<FNM_CASEFOLD> flags are GNU extensions.
ru: POSIX.1-2001, POSIX.1-2008, POSIX.2. Флаги B<FNM_FILE_NAME>, B<FNM_LEADING_DIR> и B<FNM_CASEFOLD> являются расширениями GNU.

source: fmtmsg - print formatted error messages
ru: fmtmsg - выводит отформатированные сообщения об ошибках

source: This function displays a message described by its arguments on the device(s) specified in the I<classification> argument. For messages written to I<stderr>, the format depends on the B<MSGVERB> environment variable.
ru: Эта функция выводит сообщение, описываемое аргументами, на устройство(а), заданное в аргументе I<classification>. Для сообщений, записываемых в I<stderr>, формат зависит от переменной окружения B<MSGVERB>.

source: The I<label> argument identifies the source of the message. The string must consist of two colon separated parts where the first part has not more than 10 and the second part not more than 14 characters.
ru: В аргументе I<label> задаётся источник сообщения. Строка должна состоять из двух частей, разделённых двоеточиями; первая часть должна быть не более 10 символов, а вторая часть — не более 14.

source: The I<text> argument describes the condition of the error.
ru: В аргументе I<text> описывается условие ошибки.

source: The I<action> argument describes possible steps to recover from the error. If it is printed, it is prefixed by "TO FIX: ".
ru: В аргументе I<action> описываются возможные шаги по исправлению ошибки. Если они выводятся, то начинаются с «TO FIX: ».

source: The I<tag> argument is a reference to the online documentation where more information can be found. It should contain the I<label> value and a unique identification number.
ru: В аргументе I<tag> указывается ссылка на онлайн-документацию, в которой можно найти дополнительную информацию. Он должен содержать значение I<label> и уникальный идентификационный номер.

source: Dummy arguments
ru: Фиктивные аргументы
