Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: The I<fh> field is an opaque identifier that the kernel will use to refer to this resource The I<open_flags> field is a bit mask of any number of the flags that indicate properties of this file handle to the kernel:
ru: Поле I<fh> представляет собой закрытый (opaque) идентификатор, который ядро будет использовать для ссылки на этот ресурс. Поле I<open_flags> представляет собой битовую маску с набором флагов, которые определяют свойства этого описателя в ядре:

source: Bypass page cache for this open file.
ru: Не использовать страничный кэш для этого открытого файла.

source: Don't invalidate the data cache on open.
ru: Не делать недействительными данные кэша при открытии.

source: The file is not seekable.
ru: Внутри файла не поддерживается смена положения.

source: B<FUSE_READ> and B<FUSE_READDIR>
ru: B<FUSE_READ> и B<FUSE_READDIR>

source: The requested action is to read up to I<size> bytes of the file or directory, starting at I<offset>. The bytes should be returned directly following the usual reply header.
ru: По этому запросу читается до I<size> байт файла или каталога, начиная с I<offset>. Байты должны возвращаться сразу за обычным заголовком ответа.

source: The requested action is to cancel the pending operation indicated by I<unique>. This request requires no response. However, receipt of this message does not by itself cancel the indicated operation. The kernel will still expect a reply to said operation (e.g., an I<EINTR> error or a short read). At most one B<FUSE_INTERRUPT> request will be issued for a given operation. After issuing said operation, the kernel will wait uninterruptibly for completion of the indicated request.
ru: По этому запросу отменяется ожидающая операция, указанная в I<unique>. По запросу не формируется ответ. Однако, само получение сообщения не отменяет указанную операцию. Ядро всё равно будет ждать ответа на указанную операцию (например, ошибку I<EINTR> или короткое чтение). Для указанной операции будет выдано не более одно запроса B<FUSE_INTERRUPT>. После выдачи указанной операции ядро будет непрерывно ожидать завершения указанного запроса.

source: Directly following the header is a filename to be looked up in the directory indicated by I<header-E<gt>nodeid>. The expected reply is of the form:
ru: Непосредственно после заголовка указывается имя файла, которое будет искаться в каталоге, указанном в I<header-E<gt>nodeid>. Ожидается ответ в виде:

source: struct fuse_entry_out { uint64_t nodeid; /* Inode ID */ uint64_t generation; /* Inode generation */ uint64_t entry_valid; uint64_t attr_valid; uint32_t entry_valid_nsec; uint32_t attr_valid_nsec; struct fuse_attr attr; };
ru: struct fuse_entry_out { uint64_t nodeid; /* идентификатор inode */ uint64_t generation; /* поколение inode */ uint64_t entry_valid; uint64_t attr_valid; uint32_t entry_valid_nsec; uint32_t attr_valid_nsec; struct fuse_attr attr; };

source: The combination of I<nodeid> and I<generation> must be unique for the filesystem's lifetime.
ru: Комбинация I<nodeid> и I<generation> должна быть уникальной на время существования файловой системы.

source: The interpretation of timeouts and I<attr> is as for B<FUSE_GETATTR>.
ru: Параметры сроков хранения и I<attr> такие же как в B<FUSE_GETATTR>.

source: The requested action is to flush any pending changes to the indicated file handle. No reply data is expected. However, an empty reply message still needs to be issued once the flush operation is complete.
ru: По этому запросу сбрасываются (flush) все ожидающие изменения для указанного файлового описателя. Данных в ответе не ожидается. Однако, всё равно требуется ответное сообщения после завершения операции сброса.

source: B<FUSE_RELEASE> and B<FUSE_RELEASEDIR>
ru: B<FUSE_RELEASE> и B<FUSE_RELEASEDIR>

source: These are the converse of B<FUSE_OPEN> and B<FUSE_OPENDIR> respectively. The daemon may now free any resources associated with the file handle I<fh> as the kernel will no longer refer to it. There is no reply data associated with this request, but a reply still needs to be issued once the request has been completely processed.
ru: Запросы, обратные B<FUSE_OPEN> и B<FUSE_OPENDIR>, соответственно. Служба теперь может освободить ресурсы, связанные с файловым описателем I<fh>, так как ядру он больше не нужен. Данных в ответе не посылается, но ответ нужно отправить после обработки запроса.

source: This operation implements B<statfs>(2) for this filesystem. There is no input data associated with this request. The expected reply data has the following structure:
ru: Данная операция реализует B<statfs>(2) для этой файловой системы. В запросе нет данных. В ответе ожидаются данные следующей структуры:

source: For the interpretation of these fields, see B<statfs>(2).
ru: Информацию об этих полях смотрите в B<statfs>(2).

source: ERRORS
ru: ОШИБКИ

source: Returned from B<read>(2) operations when the kernel's request is too large for the provided buffer and the request was B<FUSE_SETXATTR>.
ru: Возвращается из операций B<read>(2), когда запросы ядра слишком велики для предоставляемого буфера и запросом является B<FUSE_SETXATTR>.

source: Returned from B<write>(2) if validation of the reply failed. Not all mistakes in replies will be caught by this validation. However, basic mistakes, such as short replies or an incorrect I<unique> value, are detected.
ru: Возвращается из операции B<write>(2), если ответ не прошёл тест на правильность. При этом не все ошибки в ответах будут пойманы. Однако обнаруживаются простые ошибки, такие как короткие ответы или некорректное значение I<unique>.

source: Returned from B<read>(2) operations when the kernel's request is too large for the provided buffer.
ru: Возвращается из операции B<read>(2), когда запросы ядра слишком велики для предоставляемого буфера.

source: I<Note>: There are various ways in which incorrect use of these interfaces can cause operations on the provided filesystem's files and directories to fail with B<EIO>. Among the possible incorrect uses are:
ru: I<Замечание>: Есть несколько вариантов, в которых неправильное использование этих интерфейсов с предоставляемыми файловой системой файлами и каталогами может завершиться ошибкой B<EIO>. Например:

source: changing I<mode & S_IFMT> for an inode that has previously been reported to the kernel; or
ru: изменение I<mode & S_IFMT> для иноды, о которой ранее было сообщено ядру; или

source: giving replies to the kernel that are shorter than what the kernel expected.
ru: выдача более коротких ответов ядру, чем оно ожидает.

source: Returned from B<read>(2) and B<write>(2) if the FUSE filesystem was unmounted.
ru: Возвращается из операций B<read>(2) и B<write>(2), если файловая система FUSE была размонтирована.

source: Returned from operations on a I</dev/fuse> file descriptor that has not been mounted.
ru: Возвращается из операций над файловым дескриптором I</dev/fuse>, если он не был смонтирован.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: The FUSE filesystem is Linux-specific.
ru: Файловая система FUSE есть только в Linux.

source: The following messages are not yet documented in this manual page:
ru: Следующие сообщения пока не документированы в этой справочной странице:

source: fanotify - monitoring filesystem events
ru: fanotify - отслеживание событий в файловой системе

source: The fanotify API provides notification and interception of filesystem events. Use cases include virus scanning and hierarchical storage management. Currently, only a limited set of events is supported. In particular, there is no support for create, delete, and move events. (See B<inotify>(7) for details of an API that does notify those events.)
ru: Программный интерфейс fanotify уведомляет о событиях в файловой системе и перехватывает их. Например, его можно использовать для сканирования файлов на вирусы и управления иерархическим хранилищем. В настоящее время, поддерживается только ограниченный набор событий. В частности, не поддерживаются события создания, удаления и перемещения (о программном интерфейсе для этих событий смотрите в B<inotify>(7)).

source: Additional capabilities compared to the B<inotify>(7) API include the ability to monitor all of the objects in a mounted filesystem, the ability to make access permission decisions, and the possibility to read or modify files before access by other applications.
ru: Дополнительные возможности по сравнению с программным интерфейсом B<inotify>(7): способность отслеживать все объекты в смонтированной файловой системе, давать права на доступ и читать или изменять файлы перед тем как доступ получат другие приложения.

source: The following system calls are used with this API: B<fanotify_init>(2), B<fanotify_mark>(2), B<read>(2), B<write>(2), and B<close>(2).
ru: В программный интерфейс входят следующие системные вызовы: B<fanotify_init>(2), B<fanotify_mark>(2), B<read>(2), B<write>(2) и B<close>(2).

source: fanotify_init(), fanotify_mark(), and notification groups
ru: Вызовы fanotify_init(), fanotify_mark() и группы уведомлений

source: The B<fanotify_init>(2) system call creates and initializes an fanotify notification group and returns a file descriptor referring to it.
ru: Системный вызов B<fanotify_init>(2) создаёт и инициализирует группу уведомления fanotify и возвращает указывающий на неё файловый дескриптор.

source: An fanotify notification group is a kernel-internal object that holds a list of files, directories, filesystems, and mount points for which events shall be created.
ru: Группа уведомления fanotify — это внутренний объект ядра, в котором хранится список файлов, каталогов, файловых систем и точек монтирования, для которых должны создаваться события.

source: For each entry in an fanotify notification group, two bit masks exist: the I<mark> mask and the I<ignore> mask. The mark mask defines file activities for which an event shall be created. The ignore mask defines activities for which no event shall be generated. Having these two types of masks permits a filesystem, mount point, or directory to be marked for receiving events, while at the same time ignoring events for specific objects under a mount point or directory.
ru: У каждой записи в группе уведомления fanotify есть две битовые маски: I<меток> и I<игнорирования>. В маске меток указывается для каких действий на файлами должны создаваться события. В маске игнорирования указывается для каких действий не должны создаваться события. Имея маски таких типов можно пометить файловую систему, точку монтирования или каталог для получения событий, и в тоже время игнорировать события для определённых объектов в этой точке монтирования или каталоге.

source: The B<fanotify_mark>(2) system call adds a file, directory, filesystem or mount point to a notification group and specifies which events shall be reported (or ignored), or removes or modifies such an entry.
ru: Системный вызов B<fanotify_mark>(2) добавляет файл, каталог, файловую систему или точку монтирования в группу уведомления и задаёт какие события должны отслеживаться (или игнорироваться), или удаляет или изменяет нужную запись.

source: A possible usage of the ignore mask is for a file cache. Events of interest for a file cache are modification of a file and closing of the same. Hence, the cached directory or mount point is to be marked to receive these events. After receiving the first event informing that a file has been modified, the corresponding cache entry will be invalidated. No further modification events for this file are of interest until the file is closed. Hence, the modify event can be added to the ignore mask. Upon receiving the close event, the modify event can be removed from the ignore mask and the file cache entry can be updated.
ru: Возможное применение маски игнорирования — кэш файлов. Интересующие события для файлового кэша — изменение файла и закрытие. Для этого добавляем кэшируемый каталог или точку монтирования для приёма этих событий. После получения первого события об изменении файла, соответствующая запись кэша помечается как недействительная. Дальнейшие события об изменении файла нас не интересуют, пока файл не будет закрыт. Для этого событие об изменении можно добавить в маску игнорирования. При получении события о закрытии, событие об изменении можно удалить из маски игнорирования и запись файлового кэша можно обновить.

source: The entries in the fanotify notification groups refer to files and directories via their inode number and to mounts via their mount ID. If files or directories are renamed or moved within the same mount, the respective entries survive. If files or directories are deleted or moved to another mount or if filesystems or mounts are unmounted, the corresponding entries are deleted.
ru: Записи в группе уведомления fanotify ссылаются на файл и каталог по номеру иноды (inode), а на точку монтирования — через ID монтирования. При переименовании или перемещении файла или каталога внутри той же точки монтирования соответствующая запись остаётся. Если файл или каталог удаляется или перемещается в другую точку монтирования, или если файловая система или точка монтирования размонтируется, то соответствующая запись удаляется.

source: The event queue
ru: Очередь событий

source: As events occur on the filesystem objects monitored by a notification group, the fanotify system generates events that are collected in a queue. These events can then be read (using B<read>(2) or similar) from the fanotify file descriptor returned by B<fanotify_init>(2).
ru: Для возникающих событий с объектами файловой системы, которые отслеживаются группой уведомления, система fanotify генерирует события и помещает их в очередь. После этого события можно прочитать (с помощью B<read>(2) и подобных) из файлового дескриптора fanotify, возвращённого B<fanotify_init>(2).

source: Two types of events are generated: I<notification> events and I<permission> events. Notification events are merely informative and require no action to be taken by the receiving application with the exception being that the file descriptor provided within a generic event must be closed. The closing of file descriptors for each event applies only to applications that have initialized fanotify without using B<FAN_REPORT_FID> (see below). Permission events are requests to the receiving application to decide whether permission for a file access shall be granted. For these events, the recipient must write a response which decides whether access is granted or not.
ru: Генерируется два типа событий: события I<уведомления> и события I<доступа>. Уведомляющие события просто информируют и не требуют действия от принявшего приложения, за исключением того, что файловый дескриптор, передаваемый в событии общего типа, должен быть закрыт. Закрытие файловых дескрипторов для каждого события применяется только приложениями, которые инициализировали fanotify без использования B<FAN_REPORT_FID> (смотрите ниже). События доступа запрашивают получившее приложение о разрешении доступа к файлу. Для этих событий получатель должен написать ответ, давать ли доступ или нет.

source: An event is removed from the event queue of the fanotify group when it has been read. Permission events that have been read are kept in an internal list of the fanotify group until either a permission decision has been taken by writing to the fanotify file descriptor or the fanotify file descriptor is closed.
ru: Событие удаляется из очереди событий группы fanotify после прочтения. События доступа, которые были прочитаны, остаются во внутреннем списке группы fanotify до тех пор, пока решение о доступе не будет записано в файловый дескриптор fanotify, или файловый дескриптор fanotify не будет закрыт.

source: Reading fanotify events
ru: Чтение событий fanotify

source: Calling B<read>(2) for the file descriptor returned by B<fanotify_init>(2) blocks (if the flag B<FAN_NONBLOCK> is not specified in the call to B<fanotify_init>(2)) until either a file event occurs or the call is interrupted by a signal (see B<signal>(7)).
ru: Вызов B<read>(2) с файловым дескриптором, полученным от B<fanotify_init>(2), блокирует выполнение (если не указан флаг B<FAN_NONBLOCK> в вызове B<fanotify_init>(2)) до тех пор, пока не произойдёт файловое событие или вызов не будет прерван сигналом (смотрите B<signal>(7)).

source: The use of the B<FAN_REPORT_FID> flag in B<fanotify_init>(2) influences what data structures are returned to the event listener for each event. After a successful B<read>(2), the read buffer contains one or more of the following structures:
ru: При указании флага B<FAN_REPORT_FID> в B<fanotify_init>(2) структуры данных возвращаются слушателю событий в каждом событии. После успешного выполнения B<read>(2) буфер чтения содержит одну или более следующих структур:

source: In the case where B<FAN_REPORT_FID> is supplied as one of the flags to B<fanotify_init>(2), you should also expect to receive the structure detailed below following the generic I<fanotify_event_metadata> structure within the read buffer:
ru: Если в B<fanotify_init>(2) среди флагов указан и B<FAN_REPORT_FID>, то вы также должны ожидать структуру после общей структуры I<fanotify_event_metadata> в буфере чтения:

source: For performance reasons, it is recommended to use a large buffer size (for example, 4096 bytes), so that multiple events can be retrieved by a single B<read>(2).
ru: Для увеличения производительности рекомендуется использовать буфер большого размера (например, 4096 байт) для того, чтобы получить несколько событий за один вызов B<read>(2).

source: The return value of B<read>(2) is the number of bytes placed in the buffer, or -1 in case of an error (but see BUGS).
ru: Возвращаемое B<read>(2) значение — количество байт помещённых в буфер, или -1 в случае ошибки (но смотрите ДЕФЕКТЫ).

source: The fields of the I<fanotify_event_metadata> structure are as follows:
ru: Поля структуры I<fanotify_event_metadata>:

source: This is the length of the data for the current event and the offset to the next event in the buffer. Without B<FAN_REPORT_FID>, the value of I<event_len> is always B<FAN_EVENT_METADATA_LEN>. With B<FAN_REPORT_FID>, I<event_len> also includes the variable length file identifier.
ru: Длина данных текущего события и смещение на следующее событие в буфере. Без B<FAN_REPORT_FID> значение I<event_len> всегда равно B<FAN_EVENT_METADATA_LEN>. С B<FAN_REPORT_FID> значение I<event_len> также включает идентификатор файла переменной длины.

source: This field holds a version number for the structure. It must be compared to B<FANOTIFY_METADATA_VERSION> to verify that the structures returned at run time match the structures defined at compile time. In case of a mismatch, the application should abandon trying to use the fanotify file descriptor.
ru: Номер версии структуры. Он должен сравниваться с B<FANOTIFY_METADATA_VERSION> для проверки того, что структуры, возвращаемые во время выполнения, соответствуют структурам, определённым во время компиляция. В случае несоответствия приложение должно прекратить попытки использовать файловый дескриптор fanotify.

source: This field is not used.
ru: Не используется.

source: This is the length of the structure. The field was introduced to facilitate the implementation of optional headers per event type. No such optional headers exist in the current implementation.
ru: Длина структуры. Это поле было добавлено для облегчения реализации необязательных заголовков разных типов событий. В текущей реализации такие необязательные заголовки отсутствуют.

source: This is a bit mask describing the event (see below).
ru: Битовая маска, описывающая событие (смотрите далее).

source: This is an open file descriptor for the object being accessed, or B<FAN_NOFD> if a queue overflow occurred. If the fanotify file descriptor has been initialized using B<FAN_REPORT_FID>, applications should expect this value to be set to B<FAN_NOFD> for each event that is received. The file descriptor can be used to access the contents of the monitored file or directory. The reading application is responsible for closing this file descriptor.
ru: Открытый файловый дескриптор объекта доступа или B<FAN_NOFD>, если возникло переполнение очереди. Если файловый дескриптор fanotify инициализирован с использованием B<FAN_REPORT_FID>,то приложения должны ожидать, что это значение равно B<FAN_NOFD> у каждого полученного события. Файловый дескриптор можно использовать для доступа к содержимому отслеживаемого файла или каталога. Читающее приложение ответственно за закрытие этого файлового дескриптора.

source: When calling B<fanotify_init>(2), the caller may specify (via the I<event_f_flags> argument) various file status flags that are to be set on the open file description that corresponds to this file descriptor. In addition, the (kernel-internal) B<FMODE_NONOTIFY> file status flag is set on the open file description. This flag suppresses fanotify event generation. Hence, when the receiver of the fanotify event accesses the notified file or directory using this file descriptor, no additional events will be created.
ru: Когда вызывается B<fanotify_init>(2) вызывающий может указать (в аргументе I<event_f_flags>) различные флаги состояния файла, которые будут установлены на открытом файловом дескрипторе, соответствующем этому файловому дескриптору. Также, на отрываемом файловом дескрипторе устанавливается (внутри ядра) флаг состояния файла B<FMODE_NONOTIFY>. Этот флаг подавляет генерацию событий fanotify. Таким образом, когда получатель события fanotify обратится к отслеживаемому файлу или каталогу через этот файловый дескриптор, дополнительных событий создано не будет.

source: If flag B<FAN_REPORT_TID> was set in B<fanotify_init>(2), this is the TID of the thread that caused the event. Otherwise, this the PID of the process that caused the event.
ru: Если в B<fanotify_init>(2) установлен флаг B<FAN_REPORT_TID>, то это TID нити, из-за которой возникло событие. В противном случае это PID процесса, из-за которой возникло событие.

source: A program listening to fanotify events can compare this PID to the PID returned by B<getpid>(2), to determine whether the event is caused by the listener itself, or is due to a file access by another process.
ru: Программа, слушающая события fanotify, может сравнить этот PID с PID, возвращаемым B<getpid>(2), для проверки, что событие не возникло из-за самого слушающего, а из-за доступа к файлу другого процесса.

source: The bit mask in I<mask> indicates which events have occurred for a single filesystem object. Multiple bits may be set in this mask, if more than one event occurred for the monitored filesystem object. In particular, consecutive events for the same filesystem object and originating from the same process may be merged into a single event, with the exception that two permission events are never merged into one queue entry.
ru: В битовой маске I<mask> указывают события, произошедшие с одиночным объектом файловой системы. В маске может быть установлено несколько бит, если было более одного события с отслеживаемым объектом файловой системы. В частности, возникшие друг за другом события с одним объектом файловой системы и произошедшие из-за одного процесса могут быть объединены в одно событие, за исключением того, что два события доступа никогда не объединяются в одном элементе очереди.

source: The bits that may appear in I<mask> are as follows:
ru: Биты маски I<mask>:

source: A file or a directory (but see BUGS) was accessed (read).
ru: Доступ (на чтение) к файлу или каталогу (но смотрите ДЕФЕКТЫ).

source: A file or a directory was opened.
ru: Файл или каталог открыт.

source: A file was opened with the intent to be executed. See NOTES in B<fanotify_mark>(2) for additional details.
ru: Файл открыт для выполнения. Смотрите ЗАМЕЧАНИЯ в B<fanotify_mark>(2).
