Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: In this case, the file descriptor associated with the stream need not be closed if the call to B<freopen>() succeeds. It is implementation-defined which changes of mode are permitted (if any), and under what circumstances.
ru: В этом случае файловый дескриптор, связанный с потоком, не нужно закрывать, если вызов B<freopen>() завершился без ошибок. Допустимость изменения режима и при каких условиях определяется реализацией.

source: The primary use of the B<freopen>() function is to change the file associated with a standard text stream (I<stderr>, I<stdin>, or I<stdout>).
ru: Основной задачей функции B<freopen>() является смена файла, связанного со стандартным текстовым потоком (I<stderr>, I<stdin> или I<stdout>).

source: Upon successful completion B<fopen>(), B<fdopen>() and B<freopen>() return a I<FILE> pointer. Otherwise, NULL is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<fopen>(), B<fdopen>() и B<freopen>() возвращается указатель I<FILE>. В противном случае возвращается NULL и I<errno> присваивается код ошибки.

source: The I<mode> provided to B<fopen>(), B<fdopen>(), or B<freopen>() was invalid.
ru: Передано неверное значение I<mode> в B<fopen>(), B<fdopen>() или B<freopen>().

source: The B<fopen>(), B<fdopen>() and B<freopen>() functions may also fail and set I<errno> for any of the errors specified for the routine B<malloc>(3).
ru: Функции B<fopen>(), B<fdopen>() и B<freopen>() могут также завершаться с ошибками и устанавливают значение I<errno> равным какому-либо значению из определённых в B<malloc>(3).

source: The B<fopen>() function may also fail and set I<errno> for any of the errors specified for the routine B<open>(2).
ru: Функция B<fopen>() при ошибках устанавливает значение I<errno> равным какому-либо значению из определённых в B<open>(2).

source: The B<fdopen>() function may also fail and set I<errno> for any of the errors specified for the routine B<fcntl>(2).
ru: Функция B<fdopen>() при ошибках устанавливает значение I<errno> равным какому-либо значению из определённых в B<fcntl>(2).

source: The B<freopen>() function may also fail and set I<errno> for any of the errors specified for the routines B<open>(2), B<fclose>(3), and B<fflush>(3).
ru: Функция B<freopen>() при ошибках устанавливает I<errno> равным какому-либо значению из определённых в B<open>(2), B<fclose>(3) и B<fflush>(3).

source: The GNU C library allows the following extensions for the string specified in I<mode>:
ru: Библиотека GNU C предоставляет следующие расширения строки в I<mode>:

source: B<c> (since glibc 2.3.3)
ru: B<c> (начиная с glibc 2.3.3)

source: Do not make the open operation, or subsequent read and write operations, thread cancellation points. This flag is ignored for B<fdopen>().
ru: Не выполнять операцию открытия, последующие чтение и запись, точки отмены нити (thread cancellation points). Этот флаг игнорируется для B<fdopen>().

source: B<e> (since glibc 2.7)
ru: B<e> (начиная с glibc 2.7)

source: Open the file with the B<O_CLOEXEC> flag. See B<open>(2) for more information. This flag is ignored for B<fdopen>().
ru: Открыть файл с флагом B<O_CLOEXEC>. Подробности смотрите в B<open>(2). Этот флаг игнорируется для B<fdopen>().

source: B<m> (since glibc 2.3)
ru: B<m> (начиная с glibc 2.3)

source: Attempt to access the file using B<mmap>(2), rather than I/O system calls (B<read>(2), B<write>(2)). Currently, use of B<mmap>(2) is attempted only for a file opened for reading.
ru: Пытаться получить доступ к файлу с помощью B<mmap>(2), а не с помощью системных операций ввода-вывода (B<read>(2), B<write>(2)). В настоящее время B<mmap>(2) используется только для файла, открытого на чтение.

source: Open the file exclusively (like the B<O_EXCL> flag of B<open>(2)). If the file already exists, B<fopen>() fails, and sets I<errno> to B<EEXIST>. This flag is ignored for B<fdopen>().
ru: Открыть файл в монопольном режиме (как с флагом B<O_EXCL> у B<open>(2)). Если файл уже существует, то B<fopen>() завершается с ошибкой и устанавливает значение I<errno> равное B<EEXIST>. Этот флаг игнорируется для B<fdopen>().

source: In addition to the above characters, B<fopen>() and B<freopen>() support the following syntax in I<mode>:
ru: В дополнении к этим символам, для B<fopen>() и B<freopen>() поддерживается следующий синтаксис в I<mode>:

source: B< ,ccs=>I<string>
ru: B< ,ccs=>I<строка>

source: The given I<string> is taken as the name of a coded character set and the stream is marked as wide-oriented. Thereafter, internal conversion functions convert I/O to and from the character set I<string>. If the B<,ccs=>I<string> syntax is not specified, then the wide-orientation of the stream is determined by the first file operation. If that operation is a wide-character operation, the stream is marked wide-oriented, and functions to convert to the coded character set are loaded.
ru: Передаваемая I<строка> используется как имя набора символов и поток помечается как широкосимвольный. С того момента внутренние функции преобразования перекодируют данные ввода-вывода в соответствии с набором символов с именем I<строка>. Если синтаксис B<,ccs=>I<строка> не указан, то широкосимвольность потока определяется по первой файловой операции. Если это операция является широкосимвольной, то поток помечается как широкосимвольный и загружаются функции для перекодировки.

source: When parsing for individual flag characters in I<mode> (i.e., the characters preceding the "ccs" specification), the glibc implementation of B<fopen>() and B<freopen>() limits the number of characters examined in I<mode> to 7 (or, in glibc versions before 2.14, to 6, which was not enough to include possible specifications such as "rb+cmxe"). The current implementation of B<fdopen>() parses at most 5 characters in I<mode>.
ru: При анализе отдельных флагов в I<mode> (т. е., символов перед «ccs») реализация glibc для B<fopen>() и B<freopen>() ограничивает количество обрабатываемых в I<mode> символов 7-ю (или, в glibc до версии 2.14, 6-ю, что было недостаточно для включения всех возможных флагов, например «rb+cmxe»). Текущая реализация B<fdopen>() анализирует в I<mode> не более 5 символов.

source: ftime - return date and time
ru: ftime - возвращает дату и время

source: This function returns the current time as seconds and milliseconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC). The time is returned in I<tp>, which is declared as follows:
ru: Данная функция возвращает текущее время в секундах и миллисекундах, прошедших начиная с эпохи (Epoch), 1970-01-01 00:00:00 +0000 (UTC). Время возвращается в I<tp>, определённой следующим образом:

source: Here I<time> is the number of seconds since the Epoch, and I<millitm> is the number of milliseconds since I<time> seconds since the Epoch. The I<timezone> field is the local timezone measured in minutes of time west of Greenwich (with a negative value indicating minutes east of Greenwich). The I<dstflag> field is a flag that, if nonzero, indicates that Daylight Saving time applies locally during the appropriate part of the year.
ru: В данной структуре I<time> — это количество секунд с начала эпохи; I<millitm> — количество миллисекунд, прошедших после I<time> секунд с начала эпохи. Поле I<timezone> — локальный часовой пояс, измеряемый в минутах западнее Гринвича (отрицательные значения означают минуты восточнее Гринвича). Поле I<dstflag> — флаг, ненулевое значение которого указывает, что в соответствующее время года используется летнее время.

source: POSIX.1-2001 says that the contents of the I<timezone> and I<dstflag> fields are unspecified; avoid relying on them.
ru: В POSIX.1-2001 сказано, что содержимое полей I<timezone> и I<dstflag> не определено; не используйте их.

source: This function always returns 0. (POSIX.1-2001 specifies, and some systems document, a -1 error return.)
ru: Эта функция всегда возвращает 0 (в POSIX.1-2001, а также в некоторых системах возвращается -1 при ошибке).

source: 4.2BSD, POSIX.1-2001. POSIX.1-2008 removes the specification of B<ftime>().
ru: 4.2BSD, POSIX.1-2001. В POSIX.1-2008 спецификация B<ftime>() удалена.

source: This function is obsolete. Don't use it. If the time in seconds suffices, B<time>(2) can be used; B<gettimeofday>(2) gives microseconds; B<clock_gettime>(2) gives nanoseconds but is not as widely available.
ru: Эта функция устарела. Не используйте её. В случаях, когда достаточно секунд, можно использовать B<time>(2); B<gettimeofday>(2) позволяет работать с микросекундами; функция B<clock_gettime>(3) позволяет работать с наносекундами, однако она пока ещё не очень широко распространена.

source: Early glibc2 is buggy and returns 0 in the I<millitm> field; glibc 2.1.1 is correct again.
ru: Ранние версии glibc2 работают некорректно и возвращают 0 в поле I<millitm>; начиная с glibc 2.1.1 эта ошибка исправлена.
