Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Since version 2.3.3, rather than invoking the kernel's B<fork>() system call, the glibc B<fork>() wrapper that is provided as part of the NPTL threading implementation invokes B<clone>(2) with flags that provide the same effect as the traditional system call. (A call to B<fork>() is equivalent to a call to B<clone>(2) specifying I<flags> as just B<SIGCHLD>.) The glibc wrapper invokes any fork handlers that have been established using B<pthread_atfork>(3).
ru: Начиная с версии 2.3.3, вместо того, чтобы вызывать системный вызов B<fork>(), обёрточная функция B<fork>() в glibc, как часть реализации нитей NPTL, вызывает B<clone>(2) с флагами, которые обеспечивают поведение традиционного системного вызова (вызов B<fork>() эквивалентен вызову B<clone>(2), если значение равно I<flags> B<SIGCHLD>). Обёртка в glibc вызывает все обработчики при ветвлении (fork), которые были зарегистрированы с помощью B<pthread_atfork>(3).

source: See B<pipe>(2) and B<wait>(2).
ru: Смотрите B<pipe>(2) и B<wait>(2).

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
ru: I<Замечание>: В glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: The B<futex>() system call provides a method for waiting until a certain condition becomes true. It is typically used as a blocking construct in the context of shared-memory synchronization. When using futexes, the majority of the synchronization operations are performed in user space. A user-space program employs the B<futex>() system call only when it is likely that the program has to block for a longer time until the condition becomes true. Other B<futex>() operations can be used to wake any processes or threads waiting for a particular condition.
ru: Системный вызов B<futex>() предоставляет программам метод для ожидания пока определённое условие не станет истинным. Обычно, этот системный вызов используется блокирующая конструкция в контексте синхронизации общей памяти. При использовании фьютексов основные операции синхронизации выполняются в пространстве пользователя. Программы пользовательского пространства выполняются системный вызов B<futex>() только когда нужно, чтобы программа вошла в режим ожидания на долгий срок, пока условие не станет истинным. Также B<futex>() можно использовать для пробуждения процессов или нитей, ожидающих определённого условия.

source: A futex is a 32-bit value\(emreferred to below as a I<futex word>\(emwhose address is supplied to the B<futex>() system call. (Futexes are 32 bits in size on all platforms, including 64-bit systems.) All futex operations are governed by this value. In order to share a futex between processes, the futex is placed in a region of shared memory, created using (for example) B<mmap>(2) or B<shmat>(2). (Thus, the futex word may have different virtual addresses in different processes, but these addresses all refer to the same location in physical memory.) In a multithreaded program, it is sufficient to place the futex word in a global variable shared by all threads.
ru: Фьютекс это 32-битное значение — называемое далее I<словом фьютекса> — чей адрес передаётся в системный вызов B<futex>() (фьютексы имеют размер в 32 бита на всех платформах, включая 64-битные системы). Все операции с фьютексами выполняются с этим значением. Чтобы сделать фьюетекс общим между процессами, фьютекс помещается в область общем памяти, создаваемой с помощью (например) B<mmap>(2) или B<shmat>(2) (то есть слово фьютекса может иметь различающиеся виртуальные адреса в разных процессах, но эти адреса всё равно указывают на одну область в физической памяти). В многонитевых программах достаточно поместить слово фьютекса в глобальную переменную, доступную из всех нитей.

source: When executing a futex operation that requests to block a thread, the kernel will block only if the futex word has the value that the calling thread supplied (as one of the arguments of the B<futex>() call) as the expected value of the futex word. The loading of the futex word's value, the comparison of that value with the expected value, and the actual blocking will happen atomically and will be totally ordered with respect to concurrent operations performed by other threads on the same futex word. Thus, the futex word is used to connect the synchronization in user space with the implementation of blocking by the kernel. Analogously to an atomic compare-and-exchange operation that potentially changes shared memory, blocking via a futex is an atomic compare-and-block operation.
ru: Когда выполняется операция с фьютексом, запрашивается блокировка нити, которую выполняет ядро только, если слово фьютекса имеет значение, которое передаёт вызывающая нить (в одном из аргументов вызова B<futex>()) равное ожидаемому значению слова фьютекса. Загрузка значения слова фьютекса, сравнение этого значения с ожидаемым и реальная блокировка выполняется автоматически и будет полностью упорядочена в соответствии с одновременными операциями, выполняемыми другими нитями на тем же словом фьютекса. Таким образом, слово фьютекса используется для обеспечения синхронизации в пользовательском пространстве реализованной через блокировку ядром. По аналогии с атомарной операцией сравнения-и-обмена, которая, потенциально, изменяет общую память, блокировка через фьютекс является атомарной операцией сравнения-и-блокировки.

source: One use of futexes is for implementing locks. The state of the lock (i.e., acquired or not acquired) can be represented as an atomically accessed flag in shared memory. In the uncontended case, a thread can access or modify the lock state with atomic instructions, for example atomically changing it from not acquired to acquired using an atomic compare-and-exchange instruction. (Such instructions are performed entirely in user mode, and the kernel maintains no information about the lock state.) On the other hand, a thread may be unable to acquire a lock because it is already acquired by another thread. It then may pass the lock's flag as a futex word and the value representing the acquired state as the expected value to a B<futex>() wait operation. This B<futex>() operation will block if and only if the lock is still acquired (i.e., the value in the futex word still matches the "acquired state"). When releasing the lock, a thread has to first reset the lock state to not acquired and then execute a futex operation that wakes threads blocked on the lock flag used as a futex word (this can be further optimized to avoid unnecessary wake-ups). See B<futex>(7) for more detail on how to use futexes.
ru: Одним из применений фьютексов является реализация блокировок. Состояние блокировки (т. е., получена или не получена) может быть представлено в виде атомарно доступного флага в общей памяти. При отсутствии конкурентов, нить может получить доступ или изменить состояние блокировки атомарными инструкциями, например атомарно изменяя её значение с не полученной на полученную с помощью атомарной инструкции сравнения-и-обмена (эти инструкции целиком выполняются в пользовательском режим, и ядро с состоянием блокировки ничего не делает). С другой стороны, нить может не получить блокировку, так как она уже получена другой нитью. После этого она может передать флаг блокировки в виде слова фьютекса, значением которого будет ожидаемое значение состояния получения в операции ожидания B<futex>(). Операция B<futex>() блокируется, только когда блокировка всё ещё имеется (т. е., значение слова фьютекса совпадает с «состояния получения»). При освобождении блокировки нить сначала сбрасывает состояние блокировки в не полученное, а затем вызывает операцию фьютекса, которая пробуждает нить, заблокированную флагом блокировки, используя его как слово фьютекса (в дальнейшем это может быть оптимизировано для устранения ненужных пробуждений). О том, как использовать фьютексы, смотрите B<futex>(7).

source: Besides the basic wait and wake-up futex functionality, there are further futex operations aimed at supporting more complex use cases.
ru: Кроме основных операций ожидания и пробуждения у фьютексов есть и другие операции, для более сложных случаев применения.

source: Note that no explicit initialization or destruction is necessary to use futexes; the kernel maintains a futex (i.e., the kernel-internal implementation artifact) only while operations such as B<FUTEX_WAIT>, described below, are being performed on a particular futex word.
ru: Заметим, что для использования фьютексов не требуется явных действий по инициализации и удалению; ядро поддерживает фьютексы (т. е., внутренняя часть реализации ядра) только в операции B<FUTEX_WAIT>, описанной далее, обрабатывая определённое слово фьютекса.

source: Arguments
ru: Аргументы

source: The I<uaddr> argument points to the futex word. On all platforms, futexes are four-byte integers that must be aligned on a four-byte boundary. The operation to perform on the futex is specified in the I<futex_op> argument; I<val> is a value whose meaning and purpose depends on I<futex_op>.
ru: В аргументе I<uaddr> указывает слово фьютекса. На всех платформах фьютексы это целые числа размером в четыре байта, которые должны быть выровнены по четырёх байтовой границе. Операция, выполняемая с фьютексом, задаётся в аргументе I<futex_op>; какое значение будет задаваться в I<val>, зависит от I<futex_op>.

source: The remaining arguments (I<timeout>, I<uaddr2>, and I<val3>) are required only for certain of the futex operations described below. Where one of these arguments is not required, it is ignored.
ru: Остальные аргументы (I<timeout>, I<uaddr2> и I<val3>) требуются только для определённых операций с фьютексами и описаны далее. Там, где эти аргументы не нужны, они игнорируются.

source: For several blocking operations, the I<timeout> argument is a pointer to a I<timespec> structure that specifies a timeout for the operation. However, notwithstanding the prototype shown above, for some operations, the least significant four bytes of this argument are instead used as an integer whose meaning is determined by the operation. For these operations, the kernel casts the I<timeout> value first to I<unsigned long>, then to I<uint32_t>, and in the remainder of this page, this argument is referred to as I<val2> when interpreted in this fashion.
ru: Для некоторых операций блокировки аргументом I<timeout> является указатель на структуру I<timespec>, в которой задаётся время ожидания операции. Однако, несмотря на прототип, показанный выше, для некоторых операций используются только младшие четыре байта этого аргумента вместо целого числа, назначение которого определяется операцией. Для этих операций ядро преобразует значение I<timeout> сначала к I<unsigned long>, затем к I<uint32_t>. Отсюда и до конца страницы этот аргумент будет называться I<val2>, когда он интерпретируется в такой манере.

source: Where it is required, the I<uaddr2> argument is a pointer to a second futex word that is employed by the operation.
ru: Там, где требуется, аргумент I<uaddr2> представляет собой указатель на второе слово фьютекса, которое используется операцией.

source: The interpretation of the final integer argument, I<val3>, depends on the operation.
ru: Интерпретация последнего целочисленного аргумента, I<val3>, зависит от операции.

source: Futex operations
ru: Операции с фьютексами

source: The I<futex_op> argument consists of two parts: a command that specifies the operation to be performed, bit-wise ORed with zero or more options that modify the behaviour of the operation. The options that may be included in I<futex_op> are as follows:
ru: Аргумент I<futex_op> состоит из двух частей: команды, задающей выполняемую операцию, и объединённые биты нуля или более параметров, которые изменяют поведение операции. Параметры, которые можно включать в I<futex_op>:

source: B<FUTEX_PRIVATE_FLAG> (since Linux 2.6.22)
ru: B<FUTEX_PRIVATE_FLAG> (начиная с Linux 2.6.22)

source: This option bit can be employed with all futex operations. It tells the kernel that the futex is process-private and not shared with another process (i.e., it is being used for synchronization only between threads of the same process). This allows the kernel to make some additional performance optimizations.
ru: Этот параметр может быть использован для всех операций с фьютексами. Он указывает ядру, что фьютекс доступен только для одного процесса и недоступен другим процессам (т. е., используется для синхронизации только между нитями одного процесса). Это позволяет ядру выполнять некоторые дополнительные оптимизации для производительности.

source: As a convenience, I<E<lt>linux/futex.hE<gt>> defines a set of constants with the suffix B<_PRIVATE> that are equivalents of all of the operations listed below, but with the B<FUTEX_PRIVATE_FLAG> ORed into the constant value. Thus, there are B<FUTEX_WAIT_PRIVATE>, B<FUTEX_WAKE_PRIVATE>, and so on.
ru: Для удобства, в I<E<lt>linux/futex.hE<gt>> определён набор констант с суффиксом B<_PRIVATE>, которые эквивалентны всем операциям, перечисленным ниже, но с добавленным константным значением флага B<FUTEX_PRIVATE_FLAG>. То есть, существуют B<FUTEX_WAIT_PRIVATE>, B<FUTEX_WAKE_PRIVATE> и т. д.

source: B<FUTEX_CLOCK_REALTIME> (since Linux 2.6.28)
ru: B<FUTEX_CLOCK_REALTIME> (начиная с Linux 2.6.28)

source: This option bit can be employed only with the B<FUTEX_WAIT_BITSET>, B<FUTEX_WAIT_REQUEUE_PI>, and (since Linux 4.5) B<FUTEX_WAIT> operations.
ru: Этот бит параметра может применяться только с операциями B<FUTEX_WAIT_BITSET>, B<FUTEX_WAIT_REQUEUE_PI> и B<FUTEX_WAIT> (начиная с Linux 4.5).

source: If this option is set, the kernel measures the I<timeout> against the B<CLOCK_REALTIME> clock.
ru: Если он указан, то ядро измеряет I<timeout> по часам B<CLOCK_REALTIME>.

source: If this option is not set, the kernel measures the I<timeout> against the B<CLOCK_MONOTONIC> clock.
ru: Если он не указан, то ядро измеряет I<timeout> по часам B<CLOCK_MONOTONIC>.

source: The operation specified in I<futex_op> is one of the following:
ru: Операцией в I<futex_op> может быть одно из:

source: B<FUTEX_WAIT> (since Linux 2.6.0)
ru: B<FUTEX_WAIT> (начиная с Linux 2.6.0)

source: This operation tests that the value at the futex word pointed to by the address I<uaddr> still contains the expected value I<val>, and if so, then sleeps waiting for a B<FUTEX_WAKE> operation on the futex word. The load of the value of the futex word is an atomic memory access (i.e., using atomic machine instructions of the respective architecture). This load, the comparison with the expected value, and starting to sleep are performed atomically and totally ordered with respect to other futex operations on the same futex word. If the thread starts to sleep, it is considered a waiter on this futex word. If the futex value does not match I<val>, then the call fails immediately with the error B<EAGAIN>.
ru: Эта операция проверяет, что значение слова фьютекса, на которое указывает адрес I<uaddr> по прежнему содержит ожидаемое значение I<val> и если это так, то засыпает, ожидая операции B<FUTEX_WAKE> для этого слова фьютекса. Загрузка значения слова фьютекса является атомарным доступом к памяти (т. е., используются атомарные машинные инструкции соответствующей архитектуры). Эта загрузка, сравнение с ожидаемым значением и запуск сна выполняются атомарно и целиком упорядочены относительно других фьютекс-операций с этим словом фьютекса. Если нить начала засыпать, то считается что она — ожидающий этого слова фьютекса. Если значение фьютекса не совпадает с I<val>, то вызов немедленно завершается с ошибкой B<EAGAIN>.

source: The purpose of the comparison with the expected value is to prevent lost wake-ups. If another thread changed the value of the futex word after the calling thread decided to block based on the prior value, and if the other thread executed a B<FUTEX_WAKE> operation (or similar wake-up) after the value change and before this B<FUTEX_WAIT> operation, then the calling thread will observe the value change and will not start to sleep.
ru: Целью сравнения с ожидаемым значением является предотвращение потери пробуждения. Если другая нить изменит значение слова фьютекса после того, как вызывающая нить решила заблокироваться из-за предыдущего значения и если другая нить выполнила операцию B<FUTEX_WAKE> (или подобное пробуждение) после изменения значения и до этой операции B<FUTEX_WAIT>, то вызывающая нить увидит эту смену значения и не станет впадать в сон.

source: If the I<timeout> is not NULL, the structure it points to specifies a timeout for the wait. (This interval will be rounded up to the system clock granularity, and is guaranteed not to expire early.) The timeout is by default measured according to the B<CLOCK_MONOTONIC> clock, but, since Linux 4.5, the B<CLOCK_REALTIME> clock can be selected by specifying B<FUTEX_CLOCK_REALTIME> in I<futex_op>. If I<timeout> is NULL, the call blocks indefinitely.
ru: Если значение I<timeout> не равно NULL, то структура, на которую он указывает, определяет время ожидания (этот интервал будет округлён до точности системных часов, и гарантируется, что он не наступит раньше положенного). По умолчанию время ожидания измеряется по часам B<CLOCK_MONOTONIC>, но начиная с Linux 4.5 можно выбрать часы B<CLOCK_REALTIME>, указав B<FUTEX_CLOCK_REALTIME> в I<futex_op>. Если I<timeout> равно NULL, то вызов блокируется бессрочно.

source: I<Note>: for B<FUTEX_WAIT>, I<timeout> is interpreted as a I<relative> value. This differs from other futex operations, where I<timeout> is interpreted as an absolute value. To obtain the equivalent of B<FUTEX_WAIT> with an absolute timeout, employ B<FUTEX_WAIT_BITSET> with I<val3> specified as B<FUTEX_BITSET_MATCH_ANY>.
ru: I<Замечание>: при B<FUTEX_WAIT> значение I<timeout> интерпретируется как I<относительное>. В этом отличие от других операций над фьютексами, в которых I<timeout> интерпретируется как абсолютное значение. Чтобы получить эквивалент B<FUTEX_WAIT> с абсолютным временем ожидания укажите B<FUTEX_WAIT_BITSET> в I<val3> вместе с B<FUTEX_BITSET_MATCH_ANY>.

source: The arguments I<uaddr2> and I<val3> are ignored.
ru: Аргументы I<uaddr2> и I<val3> игнорируются.

source: B<FUTEX_WAKE> (since Linux 2.6.0)
ru: B<FUTEX_WAKE> (начиная с Linux 2.6.0)

source: This operation wakes at most I<val> of the waiters that are waiting (e.g., inside B<FUTEX_WAIT>) on the futex word at the address I<uaddr>. Most commonly, I<val> is specified as either 1 (wake up a single waiter) or B<INT_MAX> (wake up all waiters). No guarantee is provided about which waiters are awoken (e.g., a waiter with a higher scheduling priority is not guaranteed to be awoken in preference to a waiter with a lower priority).
ru: Эта операция пробуждает не больше I<val> процессов, ожидающих (например, внутри B<FUTEX_WAIT>) слово фьютекса по адресу I<uaddr>. Чаще всего, I<val> присваивают или 1 (пробудить одного ожидающего), или B<INT_MAX> (пробудить всех ожидающих). Не гарантируется, что разбудят каких-то определённых ожидающих (например, что ожидающий с большим приоритетом планировщика будет разбужен раньше ожидающего, имеющего меньший приоритет).

source: The arguments I<timeout>, I<uaddr2>, and I<val3> are ignored.
ru: Аргументы I<timeout>, I<uaddr2> и I<val3> игнорируются.

source: B<FUTEX_FD> (from Linux 2.6.0 up to and including Linux 2.6.25)
ru: B<FUTEX_FD> (начиная с Linux 2.6.0 и по Linux 2.6.25 включительно)

source: This operation creates a file descriptor that is associated with the futex at I<uaddr>. The caller must close the returned file descriptor after use. When another process or thread performs a B<FUTEX_WAKE> on the futex word, the file descriptor indicates as being readable with B<select>(2), B<poll>(2), and B<epoll>(7)
ru: Эта операция создаёт файловый дескриптор, который связан с фьютексом по адресу I<uaddr>. Вызывающий должен закрыть возвращённый файловый дескриптор после использования. Если другой процесс или нить выполняет операцию B<FUTEX_WAKE> со словом фьютекса, то файловый дескриптор будет отмечен как доступный для чтения в B<select>(2), B<poll>(2) и B<epoll>(7).

source: The file descriptor can be used to obtain asynchronous notifications: if I<val> is nonzero, then, when another process or thread executes a B<FUTEX_WAKE>, the caller will receive the signal number that was passed in I<val>.
ru: Файловый дескриптор можно использовать для получения асинхронных уведомлений: если I<val> не равно нулю, то когда другой процесс или нить выполняют B<FUTEX_WAKE>, то вызывающий примет сигнал с номером, который был указан в I<val>.

source: The arguments I<timeout>, I<uaddr2> and I<val3> are ignored.
ru: Аргументы I<timeout>, I<uaddr2> и I<val3> игнорируются.

source: Because it was inherently racy, B<FUTEX_FD> has been removed from Linux 2.6.26 onward.
ru: Так как по своей природе операция B<FUTEX_FD> приводит к состязательности, она была удалена из Linux, начиная с версии 2.6.26.

source: B<FUTEX_REQUEUE> (since Linux 2.6.0)
ru: B<FUTEX_REQUEUE> (начиная с Linux 2.6.0)

source: This operation performs the same task as B<FUTEX_CMP_REQUEUE> (see below), except that no check is made using the value in I<val3>. (The argument I<val3> is ignored.)
ru: Эта операция выполняет ту же задачу, что и B<FUTEX_CMP_REQUEUE> (смотрите далее), за исключением того, что она не проверяет используемое значение в I<val3> (аргумент I<val3> игнорируется).

source: B<FUTEX_CMP_REQUEUE> (since Linux 2.6.7)
ru: B<FUTEX_CMP_REQUEUE> (начиная с Linux 2.6.7)

source: This operation first checks whether the location I<uaddr> still contains the value I<val3>. If not, the operation fails with the error B<EAGAIN>. Otherwise, the operation wakes up a maximum of I<val> waiters that are waiting on the futex at I<uaddr>. If there are more than I<val> waiters, then the remaining waiters are removed from the wait queue of the source futex at I<uaddr> and added to the wait queue of the target futex at I<uaddr2>. The I<val2> argument specifies an upper limit on the number of waiters that are requeued to the futex at I<uaddr2>.
ru: Сначала эта операция проверяет, что по адресу I<uaddr> по прежнему содержится значение I<val3>. Если нет, то операция завершается с ошибкой B<EAGAIN>. В противном случае, операция пробуждает не более I<val> ожидающих, которые ждут фьютекс по адресу I<uaddr>. Если существует более I<val> ожидающих, то оставшиеся ожидающие удаляются из очереди ожидания фьютекса-источника по адресу I<uaddr> и добавляются в очередь ожидания фьютекса-назначения по адресу I<uaddr2>. В аргументе I<val2> задаётся верхний предел количества ожидающих, которые перемещаются в очередь фьютекса по адресу I<uaddr2>.

source: The load from I<uaddr> is an atomic memory access (i.e., using atomic machine instructions of the respective architecture). This load, the comparison with I<val3>, and the requeueing of any waiters are performed atomically and totally ordered with respect to other operations on the same futex word.
ru: Загрузка из I<uaddr> является атомарным доступом к памяти (т. е., используются атомарные машинные инструкции соответствующей архитектуры). Эта загрузка, сравнение с I<val3> и перестановка в очередь ожидающих выполняются атомарно и целиком упорядочены относительно других фьютекс-операций с этим словом фьютекса.
