Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: A FIFO special file (a named pipe) is similar to a pipe, except that it is accessed as part of the filesystem. It can be opened by multiple processes for reading or writing. When processes are exchanging data via the FIFO, the kernel passes all data internally without writing it to the filesystem. Thus, the FIFO special file has no contents on the filesystem; the filesystem entry merely serves as a reference point so that processes can access the pipe using a name in the filesystem.
ru: Специальный файл FIFO (именованный канал) подобен каналу, за исключением того, что доступен как часть файловой системы. Его можно открывать из нескольких процессов на чтении или запись. Когда процессы обмениваются данными через FIFO, ядро передаёт все данные без их записи в файловую систему. То есть, специальный файл FIFO не хранит содержимое в файловой системе; запись в файловой системе служит просто местом, посредством которого процессы могут получить доступ к каналу, используя имя в файловой системе.

source: The kernel maintains exactly one pipe object for each FIFO special file that is opened by at least one process. The FIFO must be opened on both ends (reading and writing) before data can be passed. Normally, opening the FIFO blocks until the other end is opened also.
ru: Ядро поддерживает один объект канала для каждого специального файла FIFO, который открыт хотя бы одним процессом. Для того, чтобы пропускать данные, FIFO должен быть открыт как для чтения, так и для записи. Обычно, при открытии FIFO он блокируется до тех пор, пока вышеописанные условия не будут выполнены.

source: A process can open a FIFO in nonblocking mode. In this case, opening for read-only succeeds even if no one has opened on the write side yet and opening for write-only fails with B<ENXIO> (no such device or address) unless the other end has already been opened.
ru: Процесс может открыть FIFO в неблокирующем режиме. В этом случае открытие только для чтения выполняется без ошибки, даже если другая сторона ещё не открыла его для записи, и открытие только на запись завершается ошибкой B<ENXIO> (нет такого устройства или адреса), если другая сторона к этому моменту не была открыта на чтение.

source: Under Linux, opening a FIFO for read and write will succeed both in blocking and nonblocking mode. POSIX leaves this behavior undefined. This can be used to open a FIFO for writing while there are no readers available. A process that uses both ends of the connection in order to communicate with itself should be very careful to avoid deadlocks.
ru: В Linux открытие FIFO для чтения и записи может быть осуществлено в блокирующем и неблокирующем режимах. Так как POSIX не описывает эти положения, это может быть использовано для открытия FIFO для чтения в отсутствие считывающих процессов. Процесс, использующий этот файл для чтения и записи (для связи с самим собой), не должен допустить возникновения блокировок (deadlocks).

source: For details of the semantics of I/O on FIFOs, see B<pipe>(7).
ru: Подробную информацию о семантике ввода-вывода FIFO смотрите в B<pipe>(7).

source: When a process tries to write to a FIFO that is not opened for read on the other side, the process is sent a B<SIGPIPE> signal.
ru: Если процесс попытается записать данные в FIFO, который не открыт для чтения, то ему посылается сигнал B<SIGPIPE>.

source: FIFO special files can be created by B<mkfifo>(3), and are indicated by I<ls\ -l> with the file type \(aqp\(aq.
ru: Специальные файлы FIFO могут быть созданы с помощью B<mkfifo>(3); при выводе I<ls\ -l> они отображаются с типом файла «p».

source: futex - fast user-space locking
ru: futex - быстрая блокировка в пользовательском пространстве

source: The Linux kernel provides futexes ("Fast user-space mutexes") as a building block for fast user-space locking and semaphores. Futexes are very basic and lend themselves well for building higher-level locking abstractions such as mutexes, condition variables, read-write locks, barriers, and semaphores.
ru: Ядро Linux предоставляет фьютексы (futexes, «быстрые мьютексы (mutexes, взаимоисключающие блокировки) в пользовательском пространстве») в качестве строительного блока для быстрой блокировки в пользовательском пространстве и семафоров. Фьютексы очень просты и полезны для создания высокоуровневых абстракций блокировок, таких как мьютексы, условных переменных, блокировок чтения-записи, барьеров и семафоров.

source: Most programmers will in fact not be using futexes directly but will instead rely on system libraries built on them, such as the Native POSIX Thread Library (NPTL) (see B<pthreads>(7)).
ru: Большинство программистов, фактически, не используют фьютексы напрямую, а полагаются на системные библиотеки, которые на них построены, такие как Native POSIX Thread Library (NPTL) (смотрите B<pthreads>(7)).

source: A futex is identified by a piece of memory which can be shared between processes or threads. In these different processes, the futex need not have identical addresses. In its bare form, a futex has semaphore semantics; it is a counter that can be incremented and decremented atomically; processes can wait for the value to become positive.
ru: Фьютекс отождествляется с участком памяти, который может быть общим для процессов или нитей. В этих процессах фьютекс может быть доступен по разным адресам. В своей основе фьютекс имеет семантику семафора; это счётчик, который можно увеличивать и уменьшать атомарно; процессы могут ждать пока значение не станет положительным.

source: Futex operation occurs entirely in user space for the noncontended case. The kernel is involved only to arbitrate the contended case. As any sane design will strive for noncontention, futexes are also optimized for this situation.
ru: Работа с фьютексом выполняется полностью в пользовательском пространстве при отсутствии конфликта (noncontended case). Ядро привлекается только для разрешения конфликтов. Так как все проектные решения стремятся к отсутствию конфликтов, фьютексы также оптимизированы под эту ситуацию.

source: In its bare form, a futex is an aligned integer which is touched only by atomic assembler instructions. This integer is four bytes long on all platforms. Processes can share this integer using B<mmap>(2), via shared memory segments, or because they share memory space, in which case the application is commonly called multithreaded.
ru: В своей основе фьютекс — это целое число, которое изменяется только атомарными инструкциями ассемблера. Это целое число размером 4 байта на всех платформах. Процессы могут совместно использовать это число посредством B<mmap>(2), сегментов общей памяти или общего пространства памяти (share memory space, в этом случае приложение, обычно, называют многонитевым).

source: Semantics
ru: Поведение

source: Any futex operation starts in user space, but it may be necessary to communicate with the kernel using the B<futex>(2) system call.
ru: Любое действие с фьютексом начинается в пользовательском пространстве, но может потребовать обращения к ядру через системный вызов B<futex>(2).

source: To "up" a futex, execute the proper assembler instructions that will cause the host CPU to atomically increment the integer. Afterward, check if it has in fact changed from 0 to 1, in which case there were no waiters and the operation is done. This is the noncontended case which is fast and should be common.
ru: Для «установки» фьютекса выполняются соответствующие ассемблерные инструкции, которые заставляют ЦП машины атомарно увеличить целое число. Далее проверяется, было ли действительно изменено значение с 0 на 1, то есть не было ожидающих и операция выполнена. Это бесконфликтный вариант, выполняется быстро и должен возникать чаще всего.

source: In the contended case, the atomic increment changed the counter from -1 (or some other negative number). If this is detected, there are waiters. User space should now set the counter to 1 and instruct the kernel to wake up any waiters using the B<FUTEX_WAKE> operation.
ru: При возникновении конфликта, атомарное увеличение изменяет счётчик с -1 (или другого отрицательного числа). Это означает, что есть ожидающие. В пользовательском пространстве теперь нужно присвоить счётчику 1 и дать команду ядру пробудить всех ожидающих с помощью операции B<FUTEX_WAKE>.

source: Waiting on a futex, to "down" it, is the reverse operation. Atomically decrement the counter and check if it changed to 0, in which case the operation is done and the futex was uncontended. In all other circumstances, the process should set the counter to -1 and request that the kernel wait for another process to up the futex. This is done using the B<FUTEX_WAIT> operation.
ru: Ожидание фьютекса, его «сброс», является обратной операцией. Происходит атомарное уменьшение счётчика и проверка того, стал ли он равен 0, то есть операция выполнена и фьютекс был неконфликтным. Во всех других случаях, процесс должен присвоить счётчику -1 и запросить ядро об ожидании другого процесса, устанавливающего фьютекс. Это выполняется с помощью операции B<FUTEX_WAIT>.

source: The B<futex>(2) system call can optionally be passed a timeout specifying how long the kernel should wait for the futex to be upped. In this case, semantics are more complex and the programmer is referred to B<futex>(2) for more details. The same holds for asynchronous futex waiting.
ru: В системном вызове B<futex>(2) можно указать время ожидания, то есть как долго ядро должно ждать установку фьютекса, В этом случае семантика более сложна и программисту нужно обратиться к B<futex>(2). Это тоже самое что и ожидания асинхронного фьютекса.

source: Initial futex support was merged in Linux 2.5.7 but with different semantics from those described above. Current semantics are available from Linux 2.5.40 onward.
ru: Впервые поддержка фьютексов появилась в Linux 2.5.7, но с другой семантикой. Текущая семантика используется в Linux с версии 2.5.40.

source: To reiterate, bare futexes are not intended as an easy-to-use abstraction for end users. Implementors are expected to be assembly literate and to have read the sources of the futex user-space library referenced below.
ru: Ещё раз повторим: в чистом виде фьютексы не являются лёгкой в использовании абстракцией для конечных пользователей. Использующие их программисты должны иметь хороший запас знаний об ассемблере и уметь читать исходный код библиотеки фьютексов для пользовательского пространства, указанной далее.

source: This man page illustrates the most common use of the B<futex>(2) primitives; it is by no means the only one.
ru: В этой справочной странице показано самое распространённое использование примитивов B<futex>(2), которое ни в коем случае не единственное.

source: I<Fuss, Futexes and Furwocks: Fast Userlevel Locking in Linux> (proceedings of the Ottawa Linux Symposium 2002), futex example library, futex-*.tar.bz2 E<.UR ftp://ftp.kernel.org\:/pub\:/linux\:/kernel\:/people\:/rusty/> E<.UE .>
ru: I<Fuss, Futexes and Furwocks: Fast Userlevel Locking in Linux> (доклад с Ottawa Linux Symposium 2002), пример в библиотеке futex, futex-*.tar.bz2 E<.UR ftp://ftp.kernel.org\:/pub\:/linux\:/kernel\:/people\:/rusty/> E<.UE .>

source: fork - create a child process
ru: fork - создаёт дочерний процесс

source: B<fork>() creates a new process by duplicating the calling process. The new process is referred to as the I<child> process. The calling process is referred to as the I<parent> process.
ru: Вызов B<fork>() создаёт новый процесс посредством копирования вызывающего процесса. Новый процесс считается I<дочерним> процессом. Вызывающий процесс считается I<родительским> процессом.

source: The child process and the parent process run in separate memory spaces. At the time of B<fork>() both memory spaces have the same content. Memory writes, file mappings (B<mmap>(2)), and unmappings (B<munmap>(2)) performed by one of the processes do not affect the other.
ru: Дочерний и родительский процессы находятся в отдельных пространствах памяти. Сразу после B<fork>() эти пространства имеют одинаковое содержимое. Запись в память, отображение файлов (B<mmap>(2)) и снятие отображения (B<munmap>(2)), выполненных в одном процессе, ничего не изменяет в другом.

source: The child process is an exact duplicate of the parent process except for the following points:
ru: Дочерний процесс является точной копией родительского процесса за исключением следующих моментов:

source: The child has its own unique process ID, and this PID does not match the ID of any existing process group (B<setpgid>(2)) or session.
ru: Потомок имеет свой уникальный идентификатор процесса, и этот PID (идентификатор процесса) не совпадает ни с одним существующим идентификатором группы процессов (B<setpgid>(2)) или сеансов.

source: The child's parent process ID is the same as the parent's process ID.
ru: Идентификатор родительского процесса у потомка равен идентификатору родительского процесса.

source: The child does not inherit its parent's memory locks (B<mlock>(2), B<mlockall>(2)).
ru: Потомок не наследует блокировки памяти родителя (B<mlock>(2), B<mlockall>(2)).

source: Process resource utilizations (B<getrusage>(2)) and CPU time counters (B<times>(2)) are reset to zero in the child.
ru: Счётчики использования ресурсов (B<getrusage>(2)) и времени ЦП у потомка сброшены в 0.

source: The child's set of pending signals is initially empty (B<sigpending>(2)).
ru: Набор ожидающих сигналов потомка изначально пуст (B<sigpending>(2)).

source: The child does not inherit semaphore adjustments from its parent (B<semop>(2)).
ru: Потомок не наследует значения семафоров родителя (B<semop>(2)).

source: The child does not inherit process-associated record locks from its parent (B<fcntl>(2)). (On the other hand, it does inherit B<fcntl>(2) open file description locks and B<flock>(2) locks from its parent.)
ru: Потомок не наследует связанные с процессом блокировки родителя (B<fcntl>(2)) (с другой стороны, он наследует блокировки файловых описаний B<fcntl>(2) и блокировки B<flock>(2)).

source: The child does not inherit timers from its parent (B<setitimer>(2), B<alarm>(2), B<timer_create>(2)).
ru: Потомок не наследует таймеры родителя (B<setitimer>(2), B<alarm>(2), B<timer_create>(2)).

source: The child does not inherit outstanding asynchronous I/O operations from its parent (B<aio_read>(3), B<aio_write>(3)), nor does it inherit any asynchronous I/O contexts from its parent (see B<io_setup>(2)).
ru: Потомок не наследует ожидающие выполнения операции асинхронного ввода-вывода (B<aio_read>(3), B<aio_write>(3)) и контексты асинхронного ввода-вывода родителя (см. B<io_setup>(2)).

source: The process attributes in the preceding list are all specified in POSIX.1. The parent and child also differ with respect to the following Linux-specific process attributes:
ru: Все перечисленные атрибуты указаны в POSIX.1. Родитель и потомок также отличаются по следующим атрибутам процесса, которые есть только в Linux:

source: The child does not inherit directory change notifications (dnotify) from its parent (see the description of B<F_NOTIFY> in B<fcntl>(2)).
ru: Потомок не наследует уведомления об изменении каталога (dnotify) родителя (смотрите описание B<F_NOTIFY> в B<fcntl>(2)).

source: The B<prctl>(2) B<PR_SET_PDEATHSIG> setting is reset so that the child does not receive a signal when its parent terminates.
ru: Настройка B<PR_SET_PDEATHSIG> у B<prctl>(2) сбрасывается, и поэтому потомок не принимает сигнал о завершении работы родителя.

source: The default timer slack value is set to the parent's current timer slack value. See the description of B<PR_SET_TIMERSLACK> in B<prctl>(2).
ru: Резервное значение по умолчанию устанавливается равным родительскому текущему резервному значению таймера. Смотрите описание B<PR_SET_TIMERSLACK> в B<prctl>(2).

source: Memory mappings that have been marked with the B<madvise>(2) B<MADV_DONTFORK> flag are not inherited across a B<fork>().
ru: Отображение памяти, помеченное с помощью флага B<MADV_DONTFORK> через B<madvise>(2), при B<fork>() не наследуется.

source: Memory in address ranges that have been marked with the B<madvise>(2) B<MADV_WIPEONFORK> flag is zeroed in the child after a B<fork>(). (The B<MADV_WIPEONFORK> setting remains in place for those address ranges in the child.)
ru: Память в диапазонах адресов, которые были помечены с помощью B<madvise>(2) флагом B<MADV_WIPEONFORK>, обнуляются в потомке после B<fork>() (флаг B<MADV_WIPEONFORK> остаётся в потомке у этих диапазонов адресов).

source: The termination signal of the child is always B<SIGCHLD> (see B<clone>(2)).
ru: Сигнал завершения работы потомка всегда B<SIGCHLD> (см. B<clone>(2)).

source: The port access permission bits set by B<ioperm>(2) are not inherited by the child; the child must turn on any bits that it requires using B<ioperm>(2).
ru: Биты прав доступа к порту, установленные с помощью B<ioperm>(2), не наследуются потомком; потомок должен установить все нужные ему биты с помощью B<ioperm>(2).

source: Note the following further points:
ru: Также стоит учитывать следующее:

source: The child process is created with a single thread\(emthe one that called B<fork>(). The entire virtual address space of the parent is replicated in the child, including the states of mutexes, condition variables, and other pthreads objects; the use of B<pthread_atfork>(3) may be helpful for dealing with problems that this can cause.
ru: Процесс потомка создаётся с одиночной нитью — той, которая вызвала B<fork>(). Всё виртуальное адресное пространство родителя копируется в потомок, включая состояние мьютексов, условных переменных и других объектов pthreads; в случае проблем с этим может помочь B<pthread_atfork>(3).

source: After a B<fork>() in a multithreaded program, the child can safely call only async-signal-safe functions (see B<signal-safety>(7)) until such time as it calls B<execve>(2).
ru: В многонитевой программе после B<fork>() потомок может безопасно вызывать только безопасные-асинхронные-сигнальные функции (смотрите B<signal-safety>(7)) до тех пор, пока не вызовет B<execve>(2).

source: The child inherits copies of the parent's set of open file descriptors. Each file descriptor in the child refers to the same open file description (see B<open>(2)) as the corresponding file descriptor in the parent. This means that the two file descriptors share open file status flags, file offset, and signal-driven I/O attributes (see the description of B<F_SETOWN> and B<F_SETSIG> in B<fcntl>(2)).
ru: Потомок наследует копии набора открытых файловых дескрипторов родителя. Каждый файловый дескриптор в потомке ссылается на то же описание файла что и родитель (смотрите B<open>(2)). Это означает, что два файловых дескриптора совместно используют флаги состояния открытого файла, смещение файла и атрибуты ввода-вывода, управляемые сигналами (смотрите описание B<F_SETOWN> и B<F_SETSIG> в B<fcntl>(2)).

source: The child inherits copies of the parent's set of open message queue descriptors (see B<mq_overview>(7)). Each file descriptor in the child refers to the same open message queue description as the corresponding file descriptor in the parent. This means that the two file descriptors share the same flags (I<mq_flags>).
ru: Потомок наследует копии набора файловых дескрипторов открытых очередей сообщений родителя (смотрите B<mq_overview>(7)). Каждый файловый дескриптор в потомке ссылается на то же описание открытой очереди сообщений что и родитель. Это означает, что два файловых дескриптора совместно используют флаги (I<mq_flags>).

source: The child inherits copies of the parent's set of open directory streams (see B<opendir>(3)). POSIX.1 says that the corresponding directory streams in the parent and child I<may> share the directory stream positioning; on Linux/glibc they do not.
ru: Потомок наследует копии набора потоков открытых каталогов родителя (смотрите B<opendir>(3)). В POSIX.1 сказано, что соответствующие потоки каталогов в родителе и потомке I<могут> совместно использовать позицию в потоке каталога; в Linux/glibc они не могут этого делать.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On success, the PID of the child process is returned in the parent, and 0 is returned in the child. On failure, -1 is returned in the parent, no child process is created, and I<errno> is set appropriately.
ru: При успешном завершении родителю возвращается PID процесса-потомка, а процессу-потомку возвращается 0. При ошибке родительскому процессу возвращается -1, процесс-потомок не создаётся, а значение I<errno> устанавливается в соответствующее значение.

source: A system-imposed limit on the number of threads was encountered. There are a number of limits that may trigger this error:
ru: Возникло системного ограничение на количество нитей. Есть несколько ограничений, которые могут вызвать эту ошибку:

source: the B<RLIMIT_NPROC> soft resource limit (set via B<setrlimit>(2)), which limits the number of processes and threads for a real user ID, was reached;
ru: B<RLIMIT_NPROC> (задаётся с помощью B<setrlimit>(2)), который ограничивает количество процессов и ните для реального ID пользователя;

source: the kernel's system-wide limit on the number of processes and threads, I</proc/sys/kernel/threads-max>, was reached (see B<proc>(5));
ru: было достигнуто системное ограничение ядра на количество процессов и нитей, I</proc/sys/kernel/threads-max> (смотрите B<proc>(5));

source: the maximum number of PIDs, I</proc/sys/kernel/pid_max>, was reached (see B<proc>(5)); or
ru: достигнуто максимальное количество PID, I</proc/sys/kernel/pid_max> (смотрите B<proc>(5)); или

source: the PID limit (I<pids.max>) imposed by the cgroup "process number" (PIDs) controller was reached.
ru: достигнуто ограничение на PID (I<pids.max>), наложенное контроллером cgroup на «номер процесса» (PID).

source: The caller is operating under the B<SCHED_DEADLINE> scheduling policy and does not have the reset-on-fork flag set. See B<sched>(7).
ru: Вызывающий работает по алгоритму планирования B<SCHED_DEADLINE> и у него не установлен флаг сброса-при-fork (reset-on-fork). Смотрите B<sched>(7).

source: B<fork>() failed to allocate the necessary kernel structures because memory is tight.
ru: Вызов B<fork>() завершился с ошибкой из-за невозможности разместить необходимые структуры ядра, потому что слишком мало памяти.

source: An attempt was made to create a child process in a PID namespace whose "init" process has terminated. See B<pid_namespaces>(7).
ru: Была попытка создания дочерний процесс в пространстве имён PID, чей процесс «init» завершил работу. Смотрите B<pid_namespaces>(7).

source: B<fork>() is not supported on this platform (for example, hardware without a Memory-Management Unit).
ru: Вызов B<fork>() не поддерживается на этой платформе (например, из-за того, что аппаратное обеспечение не содержит блока управления памятью (MMU)).

source: B<ERESTARTNOINTR> (since Linux 2.6.17)
ru: B<ERESTARTNOINTR> (начиная с Linux 2.6.17)

source: System call was interrupted by a signal and will be restarted. (This can be seen only during a trace.)
ru: Системный вызов был прерван сигналом и перезапущен (может быть замечено только при трассировке).

source: Under Linux, B<fork>() is implemented using copy-on-write pages, so the only penalty that it incurs is the time and memory required to duplicate the parent's page tables, and to create a unique task structure for the child.
ru: В Linux, B<fork>() реализован с помощью «копирования страниц при записи» (copy-on-write, COW), поэтому расходы на вызов состоят из времени и памяти, требуемой на копирование страничных таблиц родителя и создания уникальной структуры, описывающей задачу.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром
