Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Open file description locks placed via the same open file description (i.e., via the same file descriptor, or via a duplicate of the file descriptor created by B<fork>(2), B<dup>(2), B<fcntl>() B<F_DUPFD>, and so on) are always compatible: if a new lock is placed on an already locked region, then the existing lock is converted to the new lock type. (Such conversions may result in splitting, shrinking, or coalescing with an existing lock as discussed above.)
ru: Блокировки открытых файловых описаний, полученные для одного и того же файлового описания (т. е., для одного и того же файлового дескриптора или его копии, созданной в результате B<fork>(2), B<dup>(2), B<fcntl>() B<F_DUPFD> и т. п.), всегда совместимы: если новая блокировка помещается на уже заблокированную область, то существующая блокировка преобразуется в блокировку нового типа (такие преобразования могут приводить к разделению, сокращению или объединению существующей блокировки, как описывалось ранее).

source: On the other hand, open file description locks may conflict with each other when they are acquired via different open file descriptions. Thus, the threads in a multithreaded program can use open file description locks to synchronize access to a file region by having each thread perform its own B<open>(2) on the file and applying locks via the resulting file descriptor.
ru: С другой стороны, блокировки открытых файловых описаний могут конфликтовать друг с другом, когда они запрашиваются через разные открытые файловые описания. То есть, нити в многонитевых программах могут использовать блокировки открытых файловых описаний для синхронизации доступа к области файла, если каждая нить выполняет отдельный вызов B<open>(2) на файл и применяет блокировки для получаемого файлового дескриптора.

source: As with traditional advisory locks, the third argument to B<fcntl>(), I<lock>, is a pointer to an I<flock> structure. By contrast with traditional record locks, the I<l_pid> field of that structure must be set to zero when using the commands described below.
ru: Как и у обычных блокировок, третий аргумент B<fcntl>(), I<lock>, является указателем на структуру I<flock>. Но в отличие от обычных блокировок при использовании команд, описанных далее, поле I<l_pid> этой структуры должно иметь значение 0.

source: The commands for working with open file description locks are analogous to those used with traditional locks:
ru: Команды для работы с блокировками открытых файловых описаний аналогичны используемым для обычных блокировок:

source: Acquire an open file description lock (when I<l_type> is B<F_RDLCK> or B<F_WRLCK>) or release an open file description lock (when I<l_type> is B<F_UNLCK>) on the bytes specified by the I<l_whence>, I<l_start>, and I<l_len> fields of I<lock>. If a conflicting lock is held by another process, this call returns -1 and sets I<errno> to B<EAGAIN>.
ru: Установить блокировку открытого файлового описания (когда I<l_type> равен B<F_RDLCK> или B<F_WRLCK>) или снять блокировку открытого файлового описания (когда I<l_type> равен B<F_UNLCK>) байтов, указанных полями I<l_whence>, I<l_start> и I<l_len> структуры I<lock>. Если конфликтующая блокировка удерживается другим процессом, то данный вызов вернёт -1 и установит значение I<errno> в B<EAGAIN>.

source: As for B<F_OFD_SETLK>, but if a conflicting lock is held on the file, then wait for that lock to be released. If a signal is caught while waiting, then the call is interrupted and (after the signal handler has returned) returns immediately (with return value -1 and I<errno> set to B<EINTR>; see B<signal>(7)).
ru: Как B<F_OFD_SETLK>, но если конфликтующая блокировка удерживается на файле, то выполняется ожидание снятия этой блокировки. Если во время ожидания поступил сигнал, то данный вызов прерывается и (после возврата из обработчика сигнала) из него происходит немедленный возврат (возвращается значение -1 и I<errno> устанавливается в B<EINTR>; см. B<signal>(7)).

source: On input to this call, I<lock> describes an open file description lock we would like to place on the file. If the lock could be placed, B<fcntl>() does not actually place it, but returns B<F_UNLCK> in the I<l_type> field of I<lock> and leaves the other fields of the structure unchanged. If one or more incompatible locks would prevent this lock being placed, then details about one of these locks are returned via I<lock>, as described above for B<F_GETLK>.
ru: В начала данного вызова значение I<lock> описывает блокировку открытого файлового описания, которую мы бы хотели создать на файле. Если блокировка возможна, то в действительности B<fcntl>() её не создаёт, а возвращает B<F_UNLCK> в поле I<l_type> у I<lock>, оставляя остальные поля неизменными. Если есть одна или более несовместимых блокировок, препятствующих получению, то в I<lock> возвращается подробная информация об этих блокировках, как описывалось выше для B<F_GETLK>.

source: In the current implementation, no deadlock detection is performed for open file description locks. (This contrasts with process-associated record locks, for which the kernel does perform deadlock detection.)
ru: В текущей реализации для блокировок открытых файловых описаний обнаружение взаимных блокировок не выполняется (в этом отличие от попроцессных блокировок, для которых ядро выполняет обнаружение взаимных блокировок).

source: Mandatory locking
ru: Обязательная (mandatory) блокировка

source: I<Warning>: the Linux implementation of mandatory locking is unreliable. See BUGS below. Because of these bugs, and the fact that the feature is believed to be little used, since Linux 4.5, mandatory locking has been made an optional feature, governed by a configuration option (B<CONFIG_MANDATORY_FILE_LOCKING>). This is an initial step toward removing this feature completely.
ru: I<Предупреждение>: реализация Linux обязательного блокирования ненадёжна. Смотрите раздел ДЕФЕКТЫ далее. Из-за этих дефектов и того факта, что это свойство, вероятно, мало где будет использоваться, начиная с Linux 4.5 обязательная блокировка был сделана необязательной, и включается параметром настройки (B<CONFIG_MANDATORY_FILE_LOCKING>). Это первый шаг последующего полного удаления данного свойства.

source: By default, both traditional (process-associated) and open file description record locks are advisory. Advisory locks are not enforced and are useful only between cooperating processes.
ru: По умолчанию, обычные (связанные с процессом) блокировки и блокировки открытого файлового описания являются консультативными. Консультативные блокировки не обязательны к выполнению и полезны только в сотрудничающих процессах.

source: Both lock types can also be mandatory. Mandatory locks are enforced for all processes. If a process tries to perform an incompatible access (e.g., B<read>(2) or B<write>(2)) on a file region that has an incompatible mandatory lock, then the result depends upon whether the B<O_NONBLOCK> flag is enabled for its open file description. If the B<O_NONBLOCK> flag is not enabled, then the system call is blocked until the lock is removed or converted to a mode that is compatible with the access. If the B<O_NONBLOCK> flag is enabled, then the system call fails with the error B<EAGAIN>.
ru: Оба типа блокировки могут быть также обязательными. Если процесс пытается получить несовместимый доступ (например, B<read>(2) и B<write>(2)) к области файла, на которую установлена несовместимая обязательная блокировка, то результат зависит от состояния флага B<O_NONBLOCK> в описании этого открытого файла. Если флаг B<O_NONBLOCK> не установлен, то системный вызов блокируется до удаления блокировки или преобразуется в режим, который совместим с доступом. Если флаг B<O_NONBLOCK> установлен, то системный вызов завершается с ошибкой B<EAGAIN>.

source: To make use of mandatory locks, mandatory locking must be enabled both on the filesystem that contains the file to be locked, and on the file itself. Mandatory locking is enabled on a filesystem using the "-o mand" option to B<mount>(8), or the B<MS_MANDLOCK> flag for B<mount>(2). Mandatory locking is enabled on a file by disabling group execute permission on the file and enabling the set-group-ID permission bit (see B<chmod>(1) and B<chmod>(2)).
ru: Чтобы использовать обязательные блокировки, обязательное блокирование должно быть включено в файловой системе, содержащей файл, и на самом файле. Обязательное блокирование включается в файловой системе с помощью параметра «-o mand» команды B<mount>(8) или с помощью флага B<MS_MANDLOCK> в B<mount>(2). Обязательное блокирование включается на файле посредством отключения права исполнения группе и установкой бита set-group-ID (см. B<chmod>(1) и B<chmod>(2)).

source: Mandatory locking is not specified by POSIX. Some other systems also support mandatory locking, although the details of how to enable it vary across systems.
ru: Обязательная блокировка не описана в POSIX. В некоторых других системах обязательная блокировка также поддерживается, хотя процесс её создания различен.

source: Lost locks
ru: Потерянные блокировки

source: When an advisory lock is obtained on a networked filesystem such as NFS it is possible that the lock might get lost. This may happen due to administrative action on the server, or due to a network partition (i.e., loss of network connectivity with the server) which lasts long enough for the server to assume that the client is no longer functioning.
ru: При получении консультативной блокировки на сетевой файловой системе, например NFS, возможна её потеря. Это может случиться из-за административного действия или сетевой проблемы (т. е., потеря связи с сервером), которая длится достаточно долго для того, чтобы сервер посчитал клиента за неработающего.

source: When the filesystem determines that a lock has been lost, future B<read>(2) or B<write>(2) requests may fail with the error B<EIO>. This error will persist until the lock is removed or the file descriptor is closed. Since Linux 3.12, this happens at least for NFSv4 (including all minor versions).
ru: Когда файловая система определяет, что блокировка потеряна, последующие запросы B<read>(2) или B<write>(2) могут завершиться ошибкой B<EIO>. Эта ошибка будет повторяться до тех пор, пока блокировка не удалится или не закроется файловый дескриптор. Начиная с Linux 3.12, так работает, по крайней мере, NFSv4 (включая все предыдущие версии).

source: Some versions of UNIX send a signal (B<SIGLOST>) in this circumstance. Linux does not define this signal, and does not provide any asynchronous notification of lost locks.
ru: Некоторые версии UNIX при таких обстоятельствах посылают сигнал (B<SIGLOST>). В Linux такой сигнал не определён и не существует какого-либо асинхронного уведомления о потере блокировки.

source: Managing signals
ru: Управление сигналами

source: B<F_GETOWN>, B<F_SETOWN>, B<F_GETOWN_EX>, B<F_SETOWN_EX>, B<F_GETSIG> and B<F_SETSIG> are used to manage I/O availability signals:
ru: Для управления сигналами доступности ввода/вывода используются команды B<F_GETOWN>, B<F_SETOWN>, B<F_GETOWN_EX>, B<F_SETOWN_EX>, B<F_GETSIG> и B<F_SETSIG>:

source: Return (as the function result) the process ID or process group currently receiving B<SIGIO> and B<SIGURG> signals for events on file descriptor I<fd>. Process IDs are returned as positive values; process group IDs are returned as negative values (but see BUGS below). I<arg> is ignored.
ru: Получить (как результат работы функции) идентификатор процесса или группы процесса, который в текущий момент принимает сигналы B<SIGIO> и B<SIGURG> для событий на файловом дескрипторе I<fd>. Идентификатор процесса возвращается как положительное число; идентификатор группы возвращается как отрицательное число (но см. раздел ДЕФЕКТЫ далее). Аргумент I<arg> игнорируется.

source: Set the process ID or process group ID that will receive B<SIGIO> and B<SIGURG> signals for events on the file descriptor I<fd>. The target process or process group ID is specified in I<arg>. A process ID is specified as a positive value; a process group ID is specified as a negative value. Most commonly, the calling process specifies itself as the owner (that is, I<arg> is specified as B<getpid>(2)).
ru: Установить идентификатор процесса или группы процесса, которые будут принимать сигналы B<SIGIO> и B<SIGURG> для событий на файловом дескрипторе I<fd>. Идентификатор целевого процесса или группы процессов задаётся в аргументе I<arg>. Идентификатор процесса задаётся положительным числом, идентификатор группы задаётся отрицательным числом. Обычно, вызывающий процесс указывает самого себя в качестве владельца (то есть в I<arg> указывается результат B<getpid>(2)).

source: As well as setting the file descriptor owner, one must also enable generation of signals on the file descriptor. This is done by using the B<fcntl>() B<F_SETFL> command to set the B<O_ASYNC> file status flag on the file descriptor. Subsequently, a B<SIGIO> signal is sent whenever input or output becomes possible on the file descriptor. The B<fcntl>() B<F_SETSIG> command can be used to obtain delivery of a signal other than B<SIGIO>.
ru: Помимо установки владельца дескриптора файла, также нужно включить генерацию сигналов для файлового дескриптора. Это делается посредством установки флага состояния B<O_ASYNC> в файловом дескрипторе с помощью B<fcntl>() с командой B<F_SETFL>. После этого сигнал B<SIGIO> посылается всякий раз, когда для данного файлового дескриптора становится возможным ввод или вывод. Для включения доставки сигнала, отличного от B<SIGIO>, можно использовать команду B<F_SETSIG> вызова B<fcntl>().

source: Sending a signal to the owner process (group) specified by B<F_SETOWN> is subject to the same permissions checks as are described for B<kill>(2), where the sending process is the one that employs B<F_SETOWN> (but see BUGS below). If this permission check fails, then the signal is silently discarded. I<Note>: The B<F_SETOWN> operation records the caller's credentials at the time of the B<fcntl>() call, and it is these saved credentials that are used for the permission checks.
ru: Отправка сигнала процессу-владельцу (группе), указанному с помощью B<F_SETOWN> — такая же проверка прав, как описано в B<kill>(2), где посылающий процесс один из тех, который может пользоваться B<F_SETOWN> (но смотрите раздел ДЕФЕКТЫ далее). Если проверка не проходит, то сигнал просто отбрасывается. I<Замечание>: операция B<F_SETOWN> сохраняет мандаты вызывающего на момент вызова B<fcntl>(), и эти сохранённые мандаты затем используются при проверке прав.

source: If the file descriptor I<fd> refers to a socket, B<F_SETOWN> also selects the recipient of B<SIGURG> signals that are delivered when out-of-band data arrives on that socket. (B<SIGURG> is sent in any situation where B<select>(2) would report the socket as having an "exceptional condition".)
ru: Если файловый дескриптор I<fd> указывает на сокет, то по команде B<F_SETOWN> для него также выбирается получатель сигналов B<SIGURG>, которые доставляются, когда на сокет поступают внеполосные данные. (B<SIGURG> посылается во всех ситуациях, когда вызов B<select>(2) говорит, что сокет находится в состоянии "исключительной ситуации".)

source: The following was true in 2.6.x kernels up to and including kernel 2.6.11:
ru: Следующее верно для ядер 2.6.x, до 2.6.11 включительно:

source: If a nonzero value is given to B<F_SETSIG> in a multithreaded process running with a threading library that supports thread groups (e.g., NPTL), then a positive value given to B<F_SETOWN> has a different meaning: instead of being a process ID identifying a whole process, it is a thread ID identifying a specific thread within a process. Consequently, it may be necessary to pass B<F_SETOWN> the result of B<gettid>(2) instead of B<getpid>(2) to get sensible results when B<F_SETSIG> is used. (In current Linux threading implementations, a main thread's thread ID is the same as its process ID. This means that a single-threaded program can equally use B<gettid>(2) or B<getpid>(2) in this scenario.) Note, however, that the statements in this paragraph do not apply to the B<SIGURG> signal generated for out-of-band data on a socket: this signal is always sent to either a process or a process group, depending on the value given to B<F_SETOWN>.
ru: Если для B<F_SETSIG> передаётся ненулевое значение в многонитевой процесс, работающий с библиотекой нитей (например, NPTL), которая обеспечивает поддержку групп нитей, то положительное значение, переданное B<F_SETOWN>, имеет другой смысл: вместо указания ID процесса, описывающего весь процесс, она является ID нити, указывающим на определённую нить процесса. Поэтому может понадобиться передать в B<F_SETOWN> результат B<gettid>(2), а не B<getpid>(2), чтобы получить правильный результат при использовании B<F_SETSIG>. (В имеющихся реализациях Linux ID главной нити совпадает с ID процесса. Это означает, что в программе с одной нитью можно использовать любой вызов, B<gettid>(2) или B<getpid>(2), в этом случае.) Однако заметим, что утверждения этого абзаца не применимы к сигналу B<SIGURG>, генерируемому для внеполосных данных сокета: этот сигнал всегда посылается или процессу или группе процессов, в зависимости от значения, указанного для B<F_SETOWN>.

source: The above behavior was accidentally dropped in Linux 2.6.12, and won't be restored. From Linux 2.6.32 onward, use B<F_SETOWN_EX> to target B<SIGIO> and B<SIGURG> signals at a particular thread.
ru: Описанное выше поведение было случайно удалено из Linux 2.6.12, и так и не восстановлено. Начиная с Linux 2.6.32 используйте B<F_SETOWN_EX> при назначении сигналов B<SIGIO> и B<SIGURG> для определённой нити.

source: B<F_GETOWN_EX> (I<struct f_owner_ex *>) (since Linux 2.6.32)
ru: B<F_GETOWN_EX> (I<struct f_owner_ex *>) (начиная с Linux 2.6.32)

source: Return the current file descriptor owner settings as defined by a previous B<F_SETOWN_EX> operation. The information is returned in the structure pointed to by I<arg>, which has the following form:
ru: Получить настройки владения текущим файловым дескриптором, установленные предыдущей командой B<F_SETOWN_EX>. Информация возвращается в структуре, указанной в I<arg>, которая имеет следующий вид:

source: The I<type> field will have one of the values B<F_OWNER_TID>, B<F_OWNER_PID>, or B<F_OWNER_PGRP>. The I<pid> field is a positive integer representing a thread ID, process ID, or process group ID. See B<F_SETOWN_EX> for more details.
ru: Поле I<type> будет равно: B<F_OWNER_TID>, B<F_OWNER_PID> или B<F_OWNER_PGRP>. Значением поля I<pid> будет положительное целое, представляющее ID нити, ID процесса или ID группы процессов. Подробности смотрите в описании B<F_SETOWN_EX>.

source: B<F_SETOWN_EX> (I<struct f_owner_ex *>) (since Linux 2.6.32)
ru: B<F_SETOWN_EX> (I<struct f_owner_ex *>) (начиная с Linux 2.6.32)

source: This operation performs a similar task to B<F_SETOWN>. It allows the caller to direct I/O availability signals to a specific thread, process, or process group. The caller specifies the target of signals via I<arg>, which is a pointer to a I<f_owner_ex> structure. The I<type> field has one of the following values, which define how I<pid> is interpreted:
ru: Эта команда выполняет задачу, подобную B<F_SETOWN>. Она позволяет вызывающему назначить сигналы доступности ввода-вывода определённой нити, процессу или группе процессов. Вызывающий указывает приёмник сигналов в I<arg>, выражаемый указателем на структуру I<f_owner_ex>. Поле I<type> имеет одно из следующих значений, которое определяет чем считать I<pid>:

source: Send the signal to the thread whose thread ID (the value returned by a call to B<clone>(2) or B<gettid>(2)) is specified in I<pid>.
ru: Посылать сигнал нити, чей ID (значение, возвращаемое вызовом B<clone>(2) или B<gettid>(2)) указан в I<pid>.

source: Send the signal to the process whose ID is specified in I<pid>.
ru: Посылать сигнал процессу, чей ID указан в I<pid>.

source: Send the signal to the process group whose ID is specified in I<pid>. (Note that, unlike with B<F_SETOWN>, a process group ID is specified as a positive value here.)
ru: Посылать сигнал группе процессов, чей ID указан в I<pid>. (Заметим, что в отличие от B<F_SETOWN>, ID группы процессов здесь задаётся как положительное значение.)

source: Return (as the function result) the signal sent when input or output becomes possible. A value of zero means B<SIGIO> is sent. Any other value (including B<SIGIO>) is the signal sent instead, and in this case additional info is available to the signal handler if installed with B<SA_SIGINFO>. I<arg> is ignored.
ru: Получить (как результат функции) сигнал, посылаемый, когда становится возможным ввод или вывод. Значение 0 означает сигнал B<SIGIO>. Любое другое значение (включая B<SIGIO>) является другим сигналом, и в этом случае для обработчика сигнала доступна дополнительная информация, если он был установлен с B<SA_SIGINFO>. Аргумент I<arg> игнорируется.

source: Set the signal sent when input or output becomes possible to the value given in I<arg>. A value of zero means to send the default B<SIGIO> signal. Any other value (including B<SIGIO>) is the signal to send instead, and in this case additional info is available to the signal handler if installed with B<SA_SIGINFO>.
ru: Установить сигнал, который будет посылаться когда станет возможен ввод или вывод, в значение, указанное в I<arg>. Значение 0 означает сигнал по умолчанию B<SIGIO>. Любое другое значение (включая B<SIGIO>) является другим сигналом, и в этом случае, для обработчика сигнала доступна дополнительная информация, если он был установлен с B<SA_SIGINFO>.

source: By using B<F_SETSIG> with a nonzero value, and setting B<SA_SIGINFO> for the signal handler (see B<sigaction>(2)), extra information about I/O events is passed to the handler in a I<siginfo_t> structure. If the I<si_code> field indicates the source is B<SI_SIGIO>, the I<si_fd> field gives the file descriptor associated with the event. Otherwise, there is no indication which file descriptors are pending, and you should use the usual mechanisms (B<select>(2), B<poll>(2), B<read>(2) with B<O_NONBLOCK> set etc.) to determine which file descriptors are available for I/O.
ru: В случае использования B<F_SETSIG> с ненулевым значением и установкой B<SA_SIGINFO> для обработчика сигнала (см. B<sigaction>(2)) обработчику передаётся дополнительная информация о событиях ввода/вывода в структуре I<siginfo_t>. Если поле I<si_code> показывает, что источник \(em B<SI_SIGIO>, то поле I<si_fd> содержит файловый дескриптор, ассоциированный с событием. В противном случае не существует никакого механизма, чтобы сообщить с каким файловым дескриптором связан полученный сигнал, и вы должны использовать обычные механизмы (B<select>(2), B<poll>(2), B<read>(2) с установленным B<O_NONBLOCK> и т.д.), чтобы определить какой файловый дескриптор доступен для ввода/вывода.

source: Note that the file descriptor provided in I<si_fd> is the one that was specified during the B<F_SETSIG> operation. This can lead to an unusual corner case. If the file descriptor is duplicated (B<dup>(2) or similar), and the original file descriptor is closed, then I/O events will continue to be generated, but the I<si_fd> field will contain the number of the now closed file descriptor.
ru: Заметим, что файловый дескриптор, предоставляемый в I<si_fd>, тот же, что указывался при операции B<F_SETSIG>. Это может привести к редкой тупиковой ситуации. Если с файлового дескриптора делался дубль (B<dup>(2) или подобным вызовом), и оригинальный файловый дескриптор закрыт, то события ввода-вывода будут продолжать генерироваться, но поле I<si_fd> будет содержать номер теперь уже закрытого файлового дескриптора.
