Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: If I<fn>() returns nonzero, then the tree walk is terminated and the value returned by I<fn>() is returned as the result of B<ftw>() or B<nftw>().
ru: Если I<fn>() возвращает ненулевое значение, то обход дерева прекращается и значение, полученное от I<fn>(), возвращается в качестве результата B<ftw>() или B<nftw>().

source: If B<nftw>() is called with the B<FTW_ACTIONRETVAL> flag, then the only nonzero value that should be used by I<fn>() to terminate the tree walk is B<FTW_STOP>, and that value is returned as the result of B<nftw>().
ru: Если B<nftw>() вызывается с флагом B<FTW_ACTIONRETVAL>, то для прекращения обхода дерева I<fn>() должна вернуть ненулевое значение B<FTW_STOP>, и это значение возвращается в качестве результата B<nftw>().

source: B<nftw>() is available under glibc since version 2.1.
ru: Функция B<nftw>() доступна в glibc начиная с версии 2.1.

source: POSIX.1-2001, POSIX.1-2008, SVr4, SUSv1. POSIX.1-2008 marks B<ftw>() as obsolete.
ru: POSIX.1-2001, POSIX.1-2008, SVr4, SUSv1. В POSIX.1-2008 функция B<ftw>() помечена как устаревшая.

source: POSIX.1-2008 notes that the results are unspecified if I<fn> does not preserve the current working directory.
ru: В POSIX.1-2008 отмечено, что результат непредсказуем, если I<fn> не сохраняет текущий рабочий каталог.

source: The function B<nftw>() and the use of B<FTW_SL> with B<ftw>() were introduced in SUSv1.
ru: Функция B<nftw>() и использование B<FTW_SL> с B<ftw>() впервые появились в SUSv1.

source: In some implementations (e.g., glibc), B<ftw>() will never use B<FTW_SL>, on other systems B<FTW_SL> occurs only for symbolic links that do not point to an existing file, and again on other systems B<ftw>() will use B<FTW_SL> for each symbolic link. If I<fpath> is a symbolic link and B<stat>(2) failed, POSIX.1-2008 states that it is undefined whether B<FTW_NS> or B<FTW_SL> is passed in I<typeflag>. For predictable results, use B<nftw>().
ru: В некоторых реализациях (например, glibc), B<ftw>() никогда не использует B<FTW_SL>, в других системах B<FTW_SL> возникает только для символьных ссылок, которые не указывают на существующий файл, или даже B<ftw>() будет использовать B<FTW_SL> для каждой символьной ссылки. Если I<fpath> — символьная ссылка и B<stat>(2) завершается с ошибкой, то следуя POSIX.1-2008 нельзя понять что передаётся в I<typeflag>: B<FTW_NS> или B<FTW_SL>. Для предсказуемости результатов используйте B<nftw>().

source: In the specification of B<nftw>(), POSIX.1 notes that when B<FTW_NS> is passed as the I<typeflag> argument of I<fn>(), then the contents of the buffer pointed to by the I<sb> argument are undefined. The standard makes no such statement for the case where B<FTW_SLN> is passed in I<typeflag>, with the implication that the contents of the buffer pointed to by I<sb> are defined. And indeed this is the case on most implementations: the buffer pointed to by I<sb> contains the results produced by applying B<lstat>(2) to the symbolic link. In early glibc, the behavior was the same. However, since glibc 2.4, the contents of the buffer pointed to by I<sb> are undefined when B<FTW_SLN> is passed in I<typeflag>. This change I<appears> to be an unintended regression, but it is not (yet) clear if the behavior will be restored to that provided in the original glibc implementation (and on other implementations).
ru: В спецификации POSIX.1 на B<nftw>() отмечено, что при передаче B<FTW_NS> в аргументе I<typeflag> для I<fn>(), содержимое буфера, на который указывает аргумент I<sb>, не определено. Стандарт не утверждает это для случая, когда в I<typeflag> передаётся B<FTW_SLN> и подразумевается, что содержимое буфера, на который указывает I<sb>, является определённым. И действительно, этот так для большинства реализаций: буфер, на который указывает I<sb>, содержит результаты работы B<lstat>(2) для символьной ссылки. В ранних glibc поведение было тем же самым. Однако начиная с glibc 2.4 содержимое буфера, на который указывает I<sb>, не определено при передаче B<FTW_SLN> в I<typeflag>. Это изменение, I<вероятно>, вызовет непреднамеренную регрессию, но (пока) не ясно, будет ли восстановлено поведение, предоставляемое первоначальной реализацией glibc (и другими реализациями).

source: The following program traverses the directory tree under the path named in its first command-line argument, or under the current directory if no argument is supplied. It displays various information about each file. The second command-line argument can be used to specify characters that control the value assigned to the I<flags> argument when calling B<nftw>().
ru: Следующая программа обходит дерево каталогов начиная с пути, указанном в первом аргументе командой строки или начиная с текущего каталога, если аргумент не указан. Она отображает различную информацию о каждом файле. Во втором параметре можно указать символы, которые управляют содержимым аргумента I<flags> у B<nftw>().

source: return 0; /* To tell nftw() to continue */ }
ru: return 0; /* говорит nftw() продолжать */ }

source: fseeko, ftello - seek to or report file position
ru: fseeko, ftello - изменить или сообщить положение в файле

source: (defining the obsolete _LARGEFILE_SOURCE macro also works)
ru: (с определением устаревшего макроса _LARGEFILE_SOURCE также сработает)

source: The B<fseeko>() and B<ftello>() functions are identical to B<fseek>(3) and B<ftell>(3) (see B<fseek>(3)), respectively, except that the I<offset> argument of B<fseeko>() and the return value of B<ftello>() is of type I<off_t> instead of I<long>.
ru: Функции B<fseeko>() и B<ftello>() идентичны функциям B<fseek>(3) и B<ftell>(3) (смотрите B<fseek>(3)), соответственно, за исключением того, что аргумент I<offset> функции B<fseeko>() и возвращаемое значение функции B<ftello>() вместо типа I<long> имеют тип I<off_t>.

source: On some architectures, both I<off_t> and I<long> are 32-bit types, but defining B<_FILE_OFFSET_BITS> with the value 64 (before including I<any> header files) will turn I<off_t> into a 64-bit type.
ru: На некоторых архитектурах аргументы I<off_t> и I<long> являются 32-битными типами, но если определить B<_FILE_OFFSET_BITS> со значением 64 (до включения I<каких-либо> заголовочных файлов), то I<off_t> станет 64-битным типом.

source: On successful completion, B<fseeko>() returns 0, while B<ftello>() returns the current offset. Otherwise, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<fseeko>() возвращает 0, B<ftello>() возвращает текущее смещение. При ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: See the ERRORS in B<fseek>(3).
ru: Смотрите ОШИБКИ в B<fseek>(3).

source: These functions are available under glibc since version 2.1.
ru: Эти функции доступны в glibc начиная с версии 2.1.

source: fgetwc, getwc - read a wide character from a FILE stream
ru: fgetwc, getwc - считывает широкий символ из потока FILE

source: The B<fgetwc>() function is the wide-character equivalent of the B<fgetc>(3) function. It reads a wide character from I<stream> and returns it. If the end of stream is reached, or if I<ferror(stream)> becomes true, it returns B<WEOF>. If a wide-character conversion error occurs, it sets I<errno> to B<EILSEQ> and returns B<WEOF>.
ru: Функция B<fgetwc>() — это эквивалент функции B<fgetc>(3), но для широких символов. Она читает широкий символ из I<stream> и возвращает его. Если достигнут конец потока или значение I<ferror(stream)> истинно, то функция возвращает B<WEOF>. Если при преобразовании в широкий символ возникает ошибка, то значение переменной I<errno> устанавливается равным B<EILSEQ> и возвращается B<WEOF>.

source: The B<getwc>() function or macro functions identically to B<fgetwc>(). It may be implemented as a macro, and may evaluate its argument more than once. There is no reason ever to use it.
ru: Функция B<getwc>() — это функция, или макрос, идентичный B<fgetwc>(). Она может быть реализована в виде макроса, и может вычислять свой аргумент более одного раза. Вообще нет смысла использовать эту функцию.

source: The B<fgetwc>() function returns the next wide-character from the stream, or B<WEOF>. In the event of an error, I<errno> is set to indicate the cause.
ru: Функция B<fgetwc>() возвращает следующий широкий символ из потока или B<WEOF>. При ошибке в I<errno> записывается соответствующее значение.

source: Apart from the usual ones, there is
ru: Кроме обычных могут возникать:

source: The data obtained from the input stream does not form a valid character.
ru: Данные, полученные из входного потока, не содержат корректного символа.

source: The behavior of B<fgetwc>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<fgetwc>() зависит от категории B<LC_CTYPE> текущей локали.

source: In the absence of additional information passed to the B<fopen>(3) call, it is reasonable to expect that B<fgetwc>() will actually read a multibyte sequence from the stream and then convert it to a wide character.
ru: Из-за отсутствия дополнительной информации, передаваемой в B<fopen>(3), закономерно ожидать, что B<fgetwc>() на самом деле читает многобайтовую последовательность из потока, а затем преобразует её в широкий символ.

source: fpathconf, pathconf - get configuration values for files
ru: fpathconf, pathconf - получают параметры настроек для файлов

source: B<fpathconf>() gets a value for the configuration option I<name> for the open file descriptor I<fd>.
ru: B<fpathconf>() получает значение параметра настроек I<name> для открытого дескриптора файла I<fd>.

source: B<pathconf>() gets a value for configuration option I<name> for the filename I<path>.
ru: B<pathconf>() получает значение параметра настроек I<name> для файла с именем I<path>.

source: The corresponding macros defined in I<E<lt>unistd.hE<gt>> are minimum values; if an application wants to take advantage of values which may change, a call to B<fpathconf>() or B<pathconf>() can be made, which may yield more liberal results.
ru: Соответствующие макросы, определённые в I<E<lt>unistd.hE<gt>>, выдают минимальные значения; если приложение собирается использовать изменяющиеся значения, то необходимо вызывать функции B<fpathconf>() или B<pathconf>(), которые выдают более гибкий результат.

source: Setting I<name> equal to one of the following constants returns the following configuration options:
ru: При установке значения I<name> в следующие константы возвращаются соответствующие им параметры настройки:

source: The maximum number of links to the file. If I<fd> or I<path> refer to a directory, then the value applies to the whole directory. The corresponding macro is B<_POSIX_LINK_MAX>.
ru: Максимальное количество ссылок на файл. Если I<fd> или I<path> указывают на каталог, то значение применяется ко всему каталогу. Соответствует макросу B<_POSIX_LINK_MAX>.

source: The maximum length of a formatted input line, where I<fd> or I<path> must refer to a terminal. The corresponding macro is B<_POSIX_MAX_CANON>.
ru: Максимальная длина отформатированной строки ввода, причём, I<fd> или I<path> должны указывать на терминал. Соответствует макросу B<_POSIX_MAX_CANON>.

source: The maximum length of an input line, where I<fd> or I<path> must refer to a terminal. The corresponding macro is B<_POSIX_MAX_INPUT>.
ru: Максимальная длина строки ввода, причём, I<fd> или I<path> должны указывать на терминал. Соответствует макросу B<_POSIX_MAX_INPUT>.

source: The maximum length of a filename in the directory I<path> or I<fd> that the process is allowed to create. The corresponding macro is B<_POSIX_NAME_MAX>.
ru: Максимальная длина имени файла в каталоге I<path> или I<fd>, которую разрешено использовать процессу при создании файла. Соответствует макросу B<_POSIX_NAME_MAX>.

source: The maximum length of a relative pathname when I<path> or I<fd> is the current working directory. The corresponding macro is B<_POSIX_PATH_MAX>.
ru: Максимальная длина относительного имени файла, где I<path> или I<fd> являются текущим рабочим каталогом. Соответствует макросу B<_POSIX_PATH_MAX>.

source: The maximum number of bytes that can be written atomically to a pipe of FIFO. For B<fpathconf>(), I<fd> should refer to a pipe or FIFO. For B<fpathconf>(), I<path> should refer to a FIFO or a directory; in the latter case, the returned value corresponds to FIFOs created in that directory. The corresponding macro is B<_POSIX_PIPE_BUF>.
ru: Максимальное количество байт, которое может быть атомарно записано в канал FIFO. Для B<fpathconf>() значение I<fd> должно указывать на канал или FIFO. Для B<fpathconf>() значение I<path> должно указывать на FIFO или каталог; в последнем случае возвращаемое значение соответствует FIFO, созданному в этом каталоге. Соответствует макросу B<_POSIX_PIPE_BUF>.

source: This returns a positive value if the use of B<chown>(2) and B<fchown>(2) for changing a file's user ID is restricted to a process with appropriate privileges, and changing a file's group ID to a value other than the process's effective group ID or one of its supplementary group IDs is restricted to a process with appropriate privileges. According to POSIX.1, this variable shall always be defined with a value other than -1. The corresponding macro is B<_POSIX_CHOWN_RESTRICTED>.
ru: Возвращает положительное значение, если использование B<chown>(2) и B<fchown>(2) для изменения идентификатора пользователя файла ограничено для процесса с соответствующими правами и изменение идентификатора группы файла на значение, отличающееся от идентификатора эффективной группы процесса или его вспомогательных идентификаторов групп, ограничено для процесса с соответствующими правами. Согласно POSIX.1, эта переменная всегда должна быть определена со значением не равным -1. Соответствует макросу B<_POSIX_CHOWN_RESTRICTED>.

source: If I<fd> or I<path> refers to a directory, then the return value applies to all files in that directory.
ru: Если I<fd> или I<path> указывают на каталог, то возвращаемое значение относится ко всем файлам в этом каталоге.

source: This returns nonzero if accessing filenames longer than B<_POSIX_NAME_MAX> generates an error. The corresponding macro is B<_POSIX_NO_TRUNC>.
ru: Возвращает ненулевое значение, если при доступе к файловым именам длиннее, чем B<_POSIX_NAME_MAX>, возникает ошибка. Соответствует макросу B<_POSIX_NO_TRUNC>.

source: This returns nonzero if special character processing can be disabled, where I<fd> or I<path> must refer to a terminal.
ru: Возвращает ненулевое значение, если обработка спецсимволов может быть отключена, при этом I<fd> или I<path> должны указывать на терминал.

source: The return value of these functions is one of the following:
ru: Возвращаемым значением этих функций может быть одно из:

source: On error, -1 is returned and I<errno> is set to indicate the cause of the error (for example, B<EINVAL>, indicating that I<name> is invalid).
ru: При ошибке возвращается -1, а в I<errno> содержится код ошибки (например, B<EINVAL> означает, что некорректно I<name>).

source: If I<name> corresponds to a maximum or minimum limit, and that limit is indeterminate, -1 is returned and I<errno> is not changed. (To distinguish an indeterminate limit from an error, set I<errno> to zero before the call, and then check whether I<errno> is nonzero when -1 is returned.)
ru: Если I<name> соответствует максимальному или минимальному ограничителю и этот ограничитель не определён, то возвращается -1 и I<errno> не изменяется (чтобы отличать неопределённый ограничитель от ошибки, сбросьте I<errno> в ноль пере вызовом, а затем проверьте, что I<errno> не равно нулю, если возвращается -1).

source: If I<name> corresponds to an option, a positive value is returned if the option is supported, and -1 is returned if the option is not supported.
ru: Если I<name> соответствует параметру, то возвращается положительное значение, если параметр поддерживается и -1, если параметр не поддерживается.

source: Otherwise, the current value of the option or limit is returned. This value will not be more restrictive than the corresponding value that was described to the application in I<E<lt>unistd.hE<gt>> or I<E<lt>limits.hE<gt>> when the application was compiled.
ru: В противном случае возвращается текущее значение параметра или ограничителя. Это значение будет не более ограничивающем чем соответствующее значение, которое было показано приложению в I<E<lt>unistd.hE<gt>> или I<E<lt>limits.hE<gt>> при компиляции.

source: (B<pathconf>()) Search permission is denied for one of the directories in the path prefix of I<path>.
ru: (B<pathconf>()) Запрещён поиск в одном из каталогов пути I<path>.

source: (B<fpathconf>()) I<fd> is not a valid file descriptor.
ru: (B<fpathconf>()) Значение I<fd> не является правильным файловым дескриптором.

source: I<name> is invalid.
ru: Неверное значение I<name>.

source: The implementation does not support an association of I<name> with the specified file.
ru: Реализация не поддерживает связь I<name> с указанным файлом.

source: (B<pathconf>()) Too many symbolic links were encountered while resolving I<path>.
ru: (B<pathconf>()) Во время определения I<path> встретилось слишком много символьных ссылок.

source: (B<pathconf>()) I<path> is too long.
ru: (B<pathconf>()) Слишком длинное значение аргумента I<path>.

source: (B<pathconf>()) A component of I<path> does not exist, or I<path> is an empty string.
ru: (B<pathconf>()) Компонент пути I<path> не существует или в I<path> указана пустая строка.

source: (B<pathconf>()) A component used as a directory in I<path> is not in fact a directory.
ru: (B<pathconf>()) Компонент пути, использованный как каталог в I<path>, в действительности таковым не является.

source: Files with name lengths longer than the value returned for I<name> equal to B<_PC_NAME_MAX> may exist in the given directory.
ru: Файлы, имена которых длиннее, чем значение, возвращаемое для I<name> и равны B<_PC_NAME_MAX>, могут существовать в заданном каталоге.

source: Some returned values may be huge; they are not suitable for allocating memory.
ru: Некоторые возвращаемые значения могут быть огромны; соответствующие им объекты невозможно разместить в памяти.

source: fts, fts_open, fts_read, fts_children, fts_set, fts_close - traverse a file hierarchy
ru: fts, fts_open, fts_read, fts_children, fts_set, fts_close - обход файловой иерархии

source: The fts functions are provided for traversing file hierarchies. A simple overview is that the B<fts_open>() function returns a "handle" (of type I<FTS\ *>) that refers to a file hierarchy "stream". This handle is then supplied to the other fts functions. The function B<fts_read>() returns a pointer to a structure describing one of the files in the file hierarchy. The function B<fts_children>() returns a pointer to a linked list of structures, each of which describes one of the files contained in a directory in the hierarchy.
ru: Функции fts созданы для обхода файловой иерархии. Обзорное описание: функция B<fts_open>() возвращает «описатель» (с типом I<FTS\ *>), который указывает на «поток» файловой иерархии. Далее он используется другими функциями fts. Функция B<fts_read>() возвращает указатель на структуру, описывающую один из файлов в файловой иерархии. Функция B<fts_children>() возвращает указатель на связанный список структур, каждая из которых описывает один из файлов, содержащихся в каталоге иерархии.

source: In general, directories are visited two distinguishable times; in preorder (before any of their descendants are visited) and in postorder (after all of their descendants have been visited). Files are visited once. It is possible to walk the hierarchy "logically" (visiting the files that symbolic links point to) or physically (visiting the symbolic links themselves), order the walk of the hierarchy or prune and/or revisit portions of the hierarchy.
ru: В общем случае, каталоги обходятся двумя разными путями — в прямом порядке (перед тем, как обработаны их потомки) и в обратном порядке (после того, как обработаны все потомки). Файлы обрабатываются только один раз. Возможен «логический» обход иерархии (обрабатываются файлы, на которые указывают символьные ссылки) и «физический» (обрабатываются сами символьные ссылки), то есть обход иерархии сократится или какая-то часть будет пройдена повторно.

source: Two structures (and associated types) are defined in the include file I<E<lt>fts.hE<gt>>. The first type is I<FTS>, the structure that represents the file hierarchy itself. The second type is I<FTSENT>, the structure that represents a file in the file hierarchy. Normally, an I<FTSENT> structure is returned for every file in the file hierarchy. In this manual page, "file" and "FTSENT structure" are generally interchangeable.
ru: В файле I<E<lt>fts.hE<gt>> определены две структуры (связанные с ними типы). Первая — структура I<FTS>, представляющая саму иерархию файлов. Вторая — структура I<FTSENT>, представляющая файл в иерархии файлов. Обычно, структура I<FTSENT> возвращается для каждого файла в файловой иерархии. В этой справочной странице понятия «файл» и «структура FTSENT» взаимозаменяемы.

source: The I<FTSENT> structure contains fields describing a file. The structure contains at least the following fields (there are additional fields that should be considered private to the implementation):
ru: Структура I<FTSENT> содержит поля, описывающие файл. На имеет, по меньшей мере, следующие поля (есть и дополнительные поля, но для реализации они должны считаться скрытыми):

source: typedef struct _ftsent { unsigned short fts_info; /* flags for FTSENT structure */ char *fts_accpath; /* access path */ char *fts_path; /* root path */ short fts_pathlen; /* strlen(fts_path) + strlen(fts_name) */ char *fts_name; /* filename */ short fts_namelen; /* strlen(fts_name) */ short fts_level; /* depth (-1 to N) */ int fts_errno; /* file errno */ long fts_number; /* local numeric value */ void *fts_pointer; /* local address value */ struct _ftsent *fts_parent; /* parent directory */ struct _ftsent *fts_link; /* next file structure */ struct _ftsent *fts_cycle; /* cycle structure */ struct stat *fts_statp; /* stat(2) information */ } FTSENT;
ru: typedef struct _ftsent { unsigned short fts_info; /* флаги для структуры FTSENT */ char *fts_accpath; /* путь доступа */ char *fts_path; /* начальный путь */ short fts_pathlen; /* strlen(fts_path) + strlen(fts_name) */ char *fts_name; /* имя файла */ short fts_namelen; /* strlen(fts_name) */ short fts_level; /* глубина (от -1 до N) */ int fts_errno; /* файловый errno */ long fts_number; /* локальное числовое значение */ void *fts_pointer; /* локальное значение адреса */ struct _ftsent *fts_parent; /* родительский каталог */ struct _ftsent *fts_link; /* структура следующего файла */ struct _ftsent *fts_cycle; /* циклическая структура */ struct stat *fts_statp; /* информация stat(2) */ } FTSENT;

source: These fields are defined as follows:
ru: Эти поля определены следующим образом:

source: One of the following values describing the returned I<FTSENT> structure and the file it represents. With the exception of directories without errors (B<FTS_D>), all of these entries are terminal, that is, they will not be revisited, nor will any of their descendants be visited.
ru: Одно из следующих значений описывает возвращённую структуру I<FTSENT> и файл, который она представляет. За исключением каталогов без ошибок (B<FTS_D>), все эти элементы являются конечными, то есть они не будут повторно обходиться, а их потомки не будут обходиться вообще.

source: A directory being visited in preorder.
ru: Каталог, посещаемый в прямом порядке.

source: A directory that causes a cycle in the tree. (The I<fts_cycle> field of the I<FTSENT> structure will be filled in as well.)
ru: Каталог, вызвавший зацикливание в дереве (также будет заполнено поле I<fts_cycle> структуры I<FTSENT>).
