Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Typical values to specify for I<val> are 0 or 1. (Specifying B<INT_MAX> is not useful, because it would make the B<FUTEX_CMP_REQUEUE> operation equivalent to B<FUTEX_WAKE>.) The limit value specified via I<val2> is typically either 1 or B<INT_MAX>. (Specifying the argument as 0 is not useful, because it would make the B<FUTEX_CMP_REQUEUE> operation equivalent to B<FUTEX_WAIT>.)
ru: Типичными значениями I<val> являются 0 или 1 (указание B<INT_MAX> бесполезно, так как это сделало бы операцию B<FUTEX_CMP_REQUEUE> эквивалентной B<FUTEX_WAKE>). Значение ограничения, указанное в I<val2>, обычно, или 1 или B<INT_MAX> (указание 0 бесполезно, так как это сделало бы операцию B<FUTEX_CMP_REQUEUE> эквивалентной B<FUTEX_WAIT>).

source: The B<FUTEX_CMP_REQUEUE> operation was added as a replacement for the earlier B<FUTEX_REQUEUE>. The difference is that the check of the value at I<uaddr> can be used to ensure that requeueing happens only under certain conditions, which allows race conditions to be avoided in certain use cases.
ru: Операция B<FUTEX_CMP_REQUEUE> была добавлена в качестве замены имевшейся B<FUTEX_REQUEUE>. Различие в том, что проверку значения по адресу I<uaddr> можно использовать для гарантии того, что перестановка в очередь произойдёт только при определённых условиях, что в определённых случаях позволит избежать состязательности.

source: Both B<FUTEX_REQUEUE> and B<FUTEX_CMP_REQUEUE> can be used to avoid "thundering herd" wake-ups that could occur when using B<FUTEX_WAKE> in cases where all of the waiters that are woken need to acquire another futex. Consider the following scenario, where multiple waiter threads are waiting on B, a wait queue implemented using a futex:
ru: И B<FUTEX_REQUEUE> и B<FUTEX_CMP_REQUEUE> можно использовать для недопущения «нашествия орды» из пробудившихся, которое может произойти при использовании B<FUTEX_WAKE> в случаях, когда всем разбуженным ожидающим требуется заблокировать другой фьютекс. Рассмотрим следующий сценарий, где несколько ожидающих нитей ждут B, очередь ожидания реализована с помощью фьютекса:

source: If a waker thread used B<FUTEX_WAKE>, then all waiters waiting on B would be woken up, and they would all try to acquire lock A. However, waking all of the threads in this manner would be pointless because all except one of the threads would immediately block on lock A again. By contrast, a requeue operation wakes just one waiter and moves the other waiters to lock A, and when the woken waiter unlocks A then the next waiter can proceed.
ru: Если пробуждающая нить использует B<FUTEX_WAKE>, то все ожидающие,ждущие B, проснулись бы, и попытались получить блокировку A. Однако пробуждение всех нитей таким образом было бы нецелесообразно, так как все кроме одной нити снова немедленно бы заблокировались в ожидании A. В отличие от этого, операция перестановки в очередь разбудит только одного ожидающего и переместит остальных ожидающих в ожидание блокировки A, и когда разбуженный ожидающий разблокирует A, то следующий ожидающий сможет продолжить работу.

source: B<FUTEX_WAKE_OP> (since Linux 2.6.14)
ru: B<FUTEX_WAKE_OP> (начиная с Linux 2.6.14)

source: This operation was added to support some user-space use cases where more than one futex must be handled at the same time. The most notable example is the implementation of B<pthread_cond_signal>(3), which requires operations on two futexes, the one used to implement the mutex and the one used in the implementation of the wait queue associated with the condition variable. B<FUTEX_WAKE_OP> allows such cases to be implemented without leading to high rates of contention and context switching.
ru: Эта операция была добавлена для работы в некоторых случаях из пользовательского пространства, в которых нужно одновременно учитывать несколько фьютексов. Самый известный пример — реализация B<pthread_cond_signal>(3), которая требует операций для работы с двумя фьютексами: один для реализации мьютекса, а другой для реализации очереди ожидания, связанной с переменной условия. Операция B<FUTEX_WAKE_OP> позволяет это реализовать без увеличения состязательности и контекстного переключения.

source: The B<FUTEX_WAKE_OP> operation is equivalent to executing the following code atomically and totally ordered with respect to other futex operations on any of the two supplied futex words:
ru: Операция B<FUTEX_WAKE_OP> эквивалентна выполнению следующего кода, при чём, атомарно и полностью упорядочено в соответствии с другими фьютекс-операциями, выполняемыми над двумя указанными словами фьютекса:

source: In other words, B<FUTEX_WAKE_OP> does the following:
ru: Иначе говоря, B<FUTEX_WAKE_OP> делает следующее:

source: saves the original value of the futex word at I<uaddr2> and performs an operation to modify the value of the futex at I<uaddr2>; this is an atomic read-modify-write memory access (i.e., using atomic machine instructions of the respective architecture)
ru: сохраняет первоначальное значение слова фьютекса по адресу I<uaddr2> и выполняет операцию изменения значения фьютекса по адресу I<uaddr2>; это атомарная операция с памятью по чтению-изменению-записи (т. е., используются атомарные машинные инструкции на соответствующей архитектуре);

source: wakes up a maximum of I<val> waiters on the futex for the futex word at I<uaddr>; and
ru: пробуждает не более I<val> ожидающих у фьютекса слова фьютекса по адресу I<uaddr>; и

source: dependent on the results of a test of the original value of the futex word at I<uaddr2>, wakes up a maximum of I<val2> waiters on the futex for the futex word at I<uaddr2>.
ru: в зависимости от результата проверки первоначального значения слова фьютекса по адресу I<uaddr2>, пробуждает не более I<val2> ожидающих у фьютекса слова фьютекса по адресу I<uaddr2>.

source: The operation and comparison that are to be performed are encoded in the bits of the argument I<val3>. Pictorially, the encoding is:
ru: Операция и сравнение, которое будет выполнено, кодируется в битах аргумента I<val3>. Графически, кодирование выглядит так:

source: +---+---+-----------+-----------+ |op |cmp| oparg | cmparg | +---+---+-----------+-----------+ 4 4 12 12 E<lt>== # of bits
ru: +---+---+-----------+-----------+ |оп |сра| аргоп | аргсра | +---+---+-----------+-----------+ 4 4 12 12 E<lt>== кол-во бит

source: Expressed in code, the encoding is:
ru: В виде кода это выглядит так:

source: In the above, I<op> and I<cmp> are each one of the codes listed below. The I<oparg> and I<cmparg> components are literal numeric values, except as noted below.
ru: Указанные выше I<op> и I<cmp> могут содержат один из кодов, перечисленных далее. Компоненты I<oparg> и I<cmparg> являются числовыми литералами, с учётом замечаний далее.

source: The I<op> component has one of the following values:
ru: Компонент I<op> может иметь одно из следующих значений:

source: In addition, bit-wise ORing the following value into I<op> causes I<(1\ E<lt>E<lt>\ oparg)> to be used as the operand:
ru: Также, битовое сложение следующего значения с I<op> приводит к использованию I<(1\ E<lt>E<lt>\ oparg)> в качестве операнда:

source: FUTEX_OP_ARG_SHIFT 8 /* Use (1 E<lt>E<lt> oparg) as operand */
ru: FUTEX_OP_ARG_SHIFT 8 /* исп. (1 E<lt>E<lt> oparg) как операнд */

source: The I<cmp> field is one of the following:
ru: В поле I<cmp> может быть одно из:

source: FUTEX_OP_CMP_EQ 0 /* if (oldval == cmparg) wake */ FUTEX_OP_CMP_NE 1 /* if (oldval != cmparg) wake */ FUTEX_OP_CMP_LT 2 /* if (oldval E<lt> cmparg) wake */ FUTEX_OP_CMP_LE 3 /* if (oldval E<lt>= cmparg) wake */ FUTEX_OP_CMP_GT 4 /* if (oldval E<gt> cmparg) wake */ FUTEX_OP_CMP_GE 5 /* if (oldval E<gt>= cmparg) wake */
ru: FUTEX_OP_CMP_EQ 0 /* если (oldval == cmparg) — пробудить */ FUTEX_OP_CMP_NE 1 /* если (oldval != cmparg) — пробудить */ FUTEX_OP_CMP_LT 2 /* если (oldval E<lt> cmparg) — пробудить */ FUTEX_OP_CMP_LE 3 /* если (oldval E<lt>= cmparg) — пробудить */ FUTEX_OP_CMP_GT 4 /* если (oldval E<gt> cmparg) — пробудить */ FUTEX_OP_CMP_GE 5 /* если (oldval E<gt>= cmparg) — пробудить */

source: The return value of B<FUTEX_WAKE_OP> is the sum of the number of waiters woken on the futex I<uaddr> plus the number of waiters woken on the futex I<uaddr2>.
ru: Возвращаемое значение операции B<FUTEX_WAKE_OP> — сумма количества разбуженных ожидающих фьютекса I<uaddr> и количества разбуженных ожидающих фьютекса I<uaddr2>.

source: B<FUTEX_WAIT_BITSET> (since Linux 2.6.25)
ru: B<FUTEX_WAIT_BITSET> (начиная с Linux 2.6.25)

source: This operation is like B<FUTEX_WAIT> except that I<val3> is used to provide a 32-bit bit mask to the kernel. This bit mask, in which at least one bit must be set, is stored in the kernel-internal state of the waiter. See the description of B<FUTEX_WAKE_BITSET> for further details.
ru: Эта операция подобна B<FUTEX_WAIT>, за исключением того, что I<val3> используется для передачи 32-битной маски в ядро. Данная битовая маска, в которой должен быть установлен хотя бы один бит, хранится в ядре во внутреннем состоянии ожидающего. Подробности смотрите в описании B<FUTEX_WAKE_BITSET>.

source: If I<timeout> is not NULL, the structure it points to specifies an absolute timeout for the wait operation. If I<timeout> is NULL, the operation can block indefinitely.
ru: Если значение I<timeout> не равно NULL, то структура, на которую он указывает, определяет абсолютное время ожидания. Если I<timeout> равно NULL, то операция блокируется бессрочно.

source: The I<uaddr2> argument is ignored.
ru: Аргумент I<uaddr2> игнорируется.

source: B<FUTEX_WAKE_BITSET> (since Linux 2.6.25)
ru: B<FUTEX_WAKE_BITSET> (начиная с Linux 2.6.25)

source: This operation is the same as B<FUTEX_WAKE> except that the I<val3> argument is used to provide a 32-bit bit mask to the kernel. This bit mask, in which at least one bit must be set, is used to select which waiters should be woken up. The selection is done by a bit-wise AND of the "wake" bit mask (i.e., the value in I<val3>) and the bit mask which is stored in the kernel-internal state of the waiter (the "wait" bit mask that is set using B<FUTEX_WAIT_BITSET>). All of the waiters for which the result of the AND is nonzero are woken up; the remaining waiters are left sleeping.
ru: Данная операция подобна B<FUTEX_WAKE>, за исключением того, что I<val3> используется для передачи 32-битной маски в ядро. Данная битовая маска, в которой должен быть установлен хотя бы один бит, используется для выбора ожидающих, которые должны быть разбужены. Выбор выполняется путём побитового И битовой маски «wake» (т. е., значения I<val3>) и битовой маски, которая хранится в ядре во внутреннем состоянии ожидающего (битовая маска «wait», устанавливающаяся с помощью B<FUTEX_WAIT_BITSET>). Все ожидающие, для которых результат побитового И не равен нулю, пробуждаются; оставшиеся ожидающие продолжают спать.

source: The effect of B<FUTEX_WAIT_BITSET> and B<FUTEX_WAKE_BITSET> is to allow selective wake-ups among multiple waiters that are blocked on the same futex. However, note that, depending on the use case, employing this bit-mask multiplexing feature on a futex can be less efficient than simply using multiple futexes, because employing bit-mask multiplexing requires the kernel to check all waiters on a futex, including those that are not interested in being woken up (i.e., they do not have the relevant bit set in their "wait" bit mask).
ru: Влияние B<FUTEX_WAIT_BITSET> и B<FUTEX_WAKE_BITSET> позволяет выбирать пробуждающихся из многих ожидающих, которые заблокированы на один фьютекс. Однако заметим, что в зависимости от варианта применения, использование данного свойства комбинирования битовой маски с фьютексом может быть менее эффективно, чем простое использование нескольких фьютексов, так как использование комбинирования битовой маски требует от ядра проверки всех ожидающих фьютекса, включая тех, которые и не нужно было бы будить (т. е., у них неподходящий набор бит в их битовой маске «wait»).

source: The constant B<FUTEX_BITSET_MATCH_ANY>, which corresponds to all 32 bits set in the bit mask, can be used as the I<val3> argument for B<FUTEX_WAIT_BITSET> and B<FUTEX_WAKE_BITSET>. Other than differences in the handling of the I<timeout> argument, the B<FUTEX_WAIT> operation is equivalent to B<FUTEX_WAIT_BITSET> with I<val3> specified as B<FUTEX_BITSET_MATCH_ANY>; that is, allow a wake-up by any waker. The B<FUTEX_WAKE> operation is equivalent to B<FUTEX_WAKE_BITSET> with I<val3> specified as B<FUTEX_BITSET_MATCH_ANY>; that is, wake up any waiter(s).
ru: Константу B<FUTEX_BITSET_MATCH_ANY>, которая соответствует всем установленным битам в 32-битной маске, можно использовать в аргументе I<val3> для B<FUTEX_WAIT_BITSET> и B<FUTEX_WAKE_BITSET>. Кроме различий в обработке аргумента I<timeout>, операция B<FUTEX_WAIT> эквивалентна B<FUTEX_WAIT_BITSET> с I<val3>, равным B<FUTEX_BITSET_MATCH_ANY>, то есть разрешается будить любого пробуждающего. Операция B<FUTEX_WAKE> эквивалентна B<FUTEX_WAKE_BITSET> с I<val3>, равным B<FUTEX_BITSET_MATCH_ANY>, то есть пробуждается любой(ые) пробуждающий.

source: The I<uaddr2> and I<timeout> arguments are ignored.
ru: Аргументы I<uaddr2> и I<timeout> игнорируются.

source: Priority-inheritance futexes
ru: Наследование приоритета из-за фьютексов

source: Linux supports priority-inheritance (PI) futexes in order to handle priority-inversion problems that can be encountered with normal futex locks. Priority inversion is the problem that occurs when a high-priority task is blocked waiting to acquire a lock held by a low-priority task, while tasks at an intermediate priority continuously preempt the low-priority task from the CPU. Consequently, the low-priority task makes no progress toward releasing the lock, and the high-priority task remains blocked.
ru: В Linux поддерживается наследование приоритета из-за фьютексов priority-inheritance (PI), так как требуется решать проблему обратного приоритета, которая встречается у обычных блокировок фьютексов. Проблема обратного приоритета возникает, когда задача с высоким приоритетом блокируется в ожидании получения блокировки, которую удерживает задача с низким приоритетом, в то время как задачи со средним приоритетом постоянно вытесняют задачу с низким приоритетом с ЦП. В следствии этого, выполнение задачи с низким приоритетом никак не продвигается к освобождению блокировки, и задача с высоким приоритетом остаётся заблокированной.

source: Priority inheritance is a mechanism for dealing with the priority-inversion problem. With this mechanism, when a high-priority task becomes blocked by a lock held by a low-priority task, the priority of the low-priority task is temporarily raised to that of the high-priority task, so that it is not preempted by any intermediate level tasks, and can thus make progress toward releasing the lock. To be effective, priority inheritance must be transitive, meaning that if a high-priority task blocks on a lock held by a lower-priority task that is itself blocked by a lock held by another intermediate-priority task (and so on, for chains of arbitrary length), then both of those tasks (or more generally, all of the tasks in a lock chain) have their priorities raised to be the same as the high-priority task.
ru: Наследование приоритета — это механизм, который решает проблему обратного приоритета. С его помощью, когда задача с высоким приоритетом блокируется из-за удержания блокировки задачей с низким приоритетом, приоритет задачи с низким приоритетом временно повышается до приоритета, имеющегося у заблокированной задачи, и поэтому не происходит вытеснения задачами с средним приоритетом, что способствует ускорению освобождения блокировки. Чтобы это работало, наследование приоритета должно быть транзитивным, то есть если задача с высоким приоритетом заблокирована, из-за удержания блокировки задачей с низким приоритетом, которая сама заблокирована из-за удержания блокировки другой задачей со средним приоритетом (и так далее, по цепочке произвольной длины), то для обеих этих задач (или, шире, всех задач в заблокированной цепочке) повышается приоритет, который равен приоритету задачи с высоким приоритетом.

source: From a user-space perspective, what makes a futex PI-aware is a policy agreement (described below) between user space and the kernel about the value of the futex word, coupled with the use of the PI-futex operations described below. (Unlike the other futex operations described above, the PI-futex operations are designed for the implementation of very specific IPC mechanisms.)
ru: Со стороны пользовательского пространства фьютекс является PI из-за следования соглашениям (описанных далее) между пользовательским пространством и ядром о значении слова фьютекса и применяемым операциям над PI-фьютексами, описанным далее (в отличие от других операций с фьютексами, описанных выше, операции с PI-фьютексами разработаны для реализации очень специфичных механизмов IPC).

source: The PI-futex operations described below differ from the other futex operations in that they impose policy on the use of the value of the futex word:
ru: Операции с PI-фьютексами, описанные далее, отличаются от других операций с фьютексами в том, что они следуют политике использования значения слова фьютекса:

source: If the lock is not acquired, the futex word's value shall be 0.
ru: Если блокировка не получена, то значение слова фьютекса должно быть равно 0.

source: If the lock is acquired, the futex word's value shall be the thread ID (TID; see B<gettid>(2)) of the owning thread.
ru: Если блокировка получена, то значение слова фьютекса должно быть равно ID нити (TID; смотрите B<gettid>(2)), которой оно принадлежит.

source: If the lock is owned and there are threads contending for the lock, then the B<FUTEX_WAITERS> bit shall be set in the futex word's value; in other words, this value is:
ru: Если блокировка получена и есть претендующие на неё нити, то в значении слова фьютекса должен быть установлен бит B<FUTEX_WAITERS>; иначе говоря, это значение равно:

source: (Note that is invalid for a PI futex word to have no owner and B<FUTEX_WAITERS> set.)
ru: (заметим, что некорректное слово PI-фьютекса не имеет владельца и B<FUTEX_WAITERS>)

source: With this policy in place, a user-space application can acquire an unacquired lock or release a lock using atomic instructions executed in user mode (e.g., a compare-and-swap operation such as I<cmpxchg> on the x86 architecture). Acquiring a lock simply consists of using compare-and-swap to atomically set the futex word's value to the caller's TID if its previous value was 0. Releasing a lock requires using compare-and-swap to set the futex word's value to 0 if the previous value was the expected TID.
ru: С этой действующей политикой приложение пространства пользователя может получить свободную блокировку или освободить блокировку с помощью атомарных инструкций, выполняемых в пользовательском режиме (например, операцией сравнение-и-обмен I<cmpxchg> на архитектуре x86). Получение блокировки состоит просто из использования сравнения-и-обмена для атомарного изменения значения слова фьютекса на TID вызывающего, если предыдущее значение было равно 0. Для освобождения блокировки требуется использовать сравнение-и-обмен для изменения значения слова фьютекса на 0, если предыдущее значение равно ожидаемому TID.

source: If a futex is already acquired (i.e., has a nonzero value), waiters must employ the B<FUTEX_LOCK_PI> operation to acquire the lock. If other threads are waiting for the lock, then the B<FUTEX_WAITERS> bit is set in the futex value; in this case, the lock owner must employ the B<FUTEX_UNLOCK_PI> operation to release the lock.
ru: Если фьютекс уже получен (т. е. имеет ненулевое значение), то ожидающие должны применить операцию B<FUTEX_LOCK_PI> для получения блокировки. Если другие нити ждут блокировку, то в значении фьютекса установлен бит B<FUTEX_WAITERS>; в этом случае владелец блокировки должен применить операцию B<FUTEX_UNLOCK_PI> для освобождения блокировки.

source: In the cases where callers are forced into the kernel (i.e., required to perform a B<futex>() call), they then deal directly with a so-called RT-mutex, a kernel locking mechanism which implements the required priority-inheritance semantics. After the RT-mutex is acquired, the futex value is updated accordingly, before the calling thread returns to user space.
ru: В случаях, когда вызывающие переходят в ядро (т. е., требуется выполнение вызова B<futex>()), после этого они напрямую работают с так называемым RT-мьютексом, механизмом блокировок ядра, которым реализована требуемая семантика наследования приоритета. После получения RT-мьютекса, значение фьютекса обновляется соответствующим образом, перед возврата вызывающей нити в пространство пользователя.

source: It is important to note that the kernel will update the futex word's value prior to returning to user space. (This prevents the possibility of the futex word's value ending up in an invalid state, such as having an owner but the value being 0, or having waiters but not having the B<FUTEX_WAITERS> bit set.)
ru: Важно упомянуть, что ядро обновит значение слова фьютекса до возврата в пространство пользователя (это предотвращает возможность попадания значения слова фьютекса в некорректное состояние, такое, что имея владельца, значение равно 0, или имея ожидающих, не установлен бит B<FUTEX_WAITERS>).

source: If a futex has an associated RT-mutex in the kernel (i.e., there are blocked waiters) and the owner of the futex/RT-mutex dies unexpectedly, then the kernel cleans up the RT-mutex and hands it over to the next waiter. This in turn requires that the user-space value is updated accordingly. To indicate that this is required, the kernel sets the B<FUTEX_OWNER_DIED> bit in the futex word along with the thread ID of the new owner. User space can detect this situation via the presence of the B<FUTEX_OWNER_DIED> bit and is then responsible for cleaning up the stale state left over by the dead owner.
ru: Если фьютекс связан с RT-мьютексом в ядре (т. е., есть заблокированные ожидающие) и владелец фьютекса/RT-мьютекса неожиданно завершился, то ядро очищает RT-мьютекс и передаёт его следующему ожидающему. Это, в свою очередь, требует, чтобы значение в пользовательском пространстве было изменено соответствующим образом. Для сообщения о необходимости этого ядро изменяет бит B<FUTEX_OWNER_DIED> в слове фьютекса вместе со сменой ID нити нового владельца. Пользовательское пространство может определить такую ситуацию по установленному биту B<FUTEX_OWNER_DIED> и затем, соответствующим образом, очистить устаревшее состояние, возникшее из-за закончившего работу владельца.

source: PI futexes are operated on by specifying one of the values listed below in I<futex_op>. Note that the PI futex operations must be used as paired operations and are subject to some additional requirements:
ru: PI-фьютексы обрабатываются при указании в I<futex_op> одного из значений, перечисленных далее. Заметим, что операции с PI-фьютексами должны использовать попарно и учитывать некоторые дополнительные требования:

source: B<FUTEX_LOCK_PI> and B<FUTEX_TRYLOCK_PI> pair with B<FUTEX_UNLOCK_PI>. B<FUTEX_UNLOCK_PI> must be called only on a futex owned by the calling thread, as defined by the value policy, otherwise the error B<EPERM> results.
ru: Парой к операциям B<FUTEX_LOCK_PI> и B<FUTEX_TRYLOCK_PI> является B<FUTEX_UNLOCK_PI>. Операция B<FUTEX_UNLOCK_PI> должна применяться только к фьютексам, принадлежащим вызывающей нити, определённой значением политики, или же возникнет ошибка B<EPERM>.
