Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Certain of the operations below are supported only since a particular Linux kernel version. The preferred method of checking whether the host kernel supports a particular operation is to invoke B<fcntl>() with the desired I<cmd> value and then test whether the call failed with B<EINVAL>, indicating that the kernel does not recognize this value.
ru: Некоторые операции, описанные далее, поддерживаются только начиная с определённой версии ядра Linux. Корректным методом проверки доступности операции в ядре является вызов B<fcntl>() с желаемой операцией в I<cmd> и сравнение кода возврата вызов с B<EINVAL>, который указывает на неподдерживаемость значения ядром.

source: Duplicating a file descriptor
ru: Создание дубликата файлового дескриптора

source: Duplicate the file descriptor I<fd> using the lowest-numbered available file descriptor greater than or equal to I<arg>. This is different from B<dup2>(2), which uses exactly the file descriptor specified.
ru: Создаёт копию файлового дескриптора I<fd>, используя и наименьший доступный номер файлового дескриптора, который больше или равен I<arg>. Отличие от B<dup2>(2) в том, что там файловый дескриптор задаётся явно.

source: On success, the new file descriptor is returned.
ru: При успешном выполнении этой команды, возвращается новый файловый дескриптор.

source: See B<dup>(2) for further details.
ru: Дополнительную информацию смотрите в B<dup>(2).

source: B<F_DUPFD_CLOEXEC> (I<int>; since Linux 2.6.24)
ru: B<F_DUPFD_CLOEXEC> (I<int>; начиная с Linux 2.6.24)

source: As for B<F_DUPFD>, but additionally set the close-on-exec flag for the duplicate file descriptor. Specifying this flag permits a program to avoid an additional B<fcntl>() B<F_SETFD> operation to set the B<FD_CLOEXEC> flag. For an explanation of why this flag is useful, see the description of B<O_CLOEXEC> in B<open>(2).
ru: Как B<F_DUPFD>, но на новом файловом дескрипторе дополнительно устанавливается флаг закрытия-при-выполнении. Установка этого флага позволяет программам не делать дополнительный вызов B<fcntl>() с командой B<F_SETFD> для установки флага B<FD_CLOEXEC>. О том, зачем нужен этот флаг, смотрите описание B<O_CLOEXEC> в B<open>(2).

source: File descriptor flags
ru: Флаги файлового дескриптора

source: The following commands manipulate the flags associated with a file descriptor. Currently, only one such flag is defined: B<FD_CLOEXEC>, the close-on-exec flag. If the B<FD_CLOEXEC> bit is set, the file descriptor will automatically be closed during a successful B<execve>(2). (If the B<execve>(2) fails, the file descriptor is left open.) If the B<FD_CLOEXEC> bit is not set, the file descriptor will remain open across an B<execve>(2).
ru: Следующие команды работают с флагами, связанными с файловым дескриптором. В настоящее время определён только один флаг: B<FD_CLOEXEC>, флаг close-on-exec. Если бит B<FD_CLOEXEC> равен 1, то файловый дескриптор будет автоматически закрыт при успешном вызове B<execve>(2) (если B<execve>(2) завершится с ошибкой, то файловый дескриптор останется открытым). Если бит B<FD_CLOEXEC> равен 0, то файловый дескриптор останется открытым после B<execve>(2).

source: Return (as the function result) the file descriptor flags; I<arg> is ignored.
ru: Вернуть (как результат функции) флаги файлового дескриптора; значение I<arg> игнорируется.

source: Set the file descriptor flags to the value specified by I<arg>.
ru: Установить флаги файлового дескриптора согласно значению, указанному в аргументе I<arg>.

source: In multithreaded programs, using B<fcntl>() B<F_SETFD> to set the close-on-exec flag at the same time as another thread performs a B<fork>(2) plus B<execve>(2) is vulnerable to a race condition that may unintentionally leak the file descriptor to the program executed in the child process. See the discussion of the B<O_CLOEXEC> flag in B<open>(2) for details and a remedy to the problem.
ru: В многонитевых программах использование B<fcntl>() с B<F_SETFD> для установки флага close-on-exec в то время как другая нить выполняет B<fork>(2) плюс B<execve>(2) приводит к состязательности, что может вызвать передачу файлового дескриптора программе, запущенной в дочернем процессе. Смотрите обсуждение флага B<O_CLOEXEC> в B<open>(2) и решение проблемы.

source: File status flags
ru: Флаги состояния файла

source: Each open file description has certain associated status flags, initialized by B<open>(2) and possibly modified by B<fcntl>(). Duplicated file descriptors (made with B<dup>(2), B<fcntl>(F_DUPFD), B<fork>(2), etc.) refer to the same open file description, and thus share the same file status flags.
ru: Каждое описание открытого файла имеет несколько связанных с ним флагов состояния, которые инициализируются вызовом B<open>(2) и, возможно, изменяются затем вызовом B<fcntl>(). Эти флаги совместно используются копиями файловых дескрипторов (сделанными с помощью B<dup>(2), B<fcntl>(F_DUPFD), B<fork>(2) и т.д.), которые указывают на одно описание открытого файла.

source: The file status flags and their semantics are described in B<open>(2).
ru: Эти флаги состояния и их смысл описаны в B<open>(2).

source: Return (as the function result) the file access mode and the file status flags; I<arg> is ignored.
ru: Вернуть (как результат функции) режим доступа к файлу и флаги состояния файла; значение I<arg> игнорируется.

source: Set the file status flags to the value specified by I<arg>. File access mode (B<O_RDONLY>, B<O_WRONLY>, B<O_RDWR>) and file creation flags (i.e., B<O_CREAT>, B<O_EXCL>, B<O_NOCTTY>, B<O_TRUNC>) in I<arg> are ignored. On Linux, this command can change only the B<O_APPEND>, B<O_ASYNC>, B<O_DIRECT>, B<O_NOATIME>, and B<O_NONBLOCK> flags. It is not possible to change the B<O_DSYNC> and B<O_SYNC> flags; see BUGS, below.
ru: Установить флаги состояния файла согласно значению, указанному в аргументе I<arg>. Режим доступа к файлу (B<O_RDONLY>, B<O_WRONLY>, B<O_RDWR>) и флаги создания файла (т. е., B<O_CREAT>, B<O_EXCL>, B<O_NOCTTY>, B<O_TRUNC>) в I<arg> игнорируются. В Linux эта команда может изменять только флаги B<O_APPEND>, B<O_ASYNC>, B<O_DIRECT>, B<O_NOATIME> и B<O_NONBLOCK>. Невозможно изменить флаги B<O_DSYNC> и B<O_SYNC>; смотрите ДЕФЕКТЫ далее.

source: Advisory record locking
ru: Консультативная (advisory) блокировка

source: Linux implements traditional ("process-associated") UNIX record locks, as standardized by POSIX. For a Linux-specific alternative with better semantics, see the discussion of open file description locks below.
ru: В Linux реализована обычная («попроцессная») блокировка UNIX, стандартизованная POSIX. Описание Linux-альтернативную блокировку открытых файловых описаний с лучшей семантикой смотрите далее.

source: B<F_SETLK>, B<F_SETLKW>, and B<F_GETLK> are used to acquire, release, and test for the existence of record locks (also known as byte-range, file-segment, or file-region locks). The third argument, I<lock>, is a pointer to a structure that has at least the following fields (in unspecified order).
ru: Команды B<F_SETLK>, B<F_SETLKW> и B<F_GETLK> используются для установки, снятия и тестирования существования блокировок записей (также известных как блокировки байтового диапазона, сегмента или области файла). Третий аргумент, I<lock>, является указателем на структуру, которая имеет, по крайней мере, следующие поля (в произвольном порядке):

source: struct flock { ... short l_type; /* Type of lock: F_RDLCK, F_WRLCK, F_UNLCK */ short l_whence; /* How to interpret l_start: SEEK_SET, SEEK_CUR, SEEK_END */ off_t l_start; /* Starting offset for lock */ off_t l_len; /* Number of bytes to lock */ pid_t l_pid; /* PID of process blocking our lock (set by F_GETLK and F_OFD_GETLK) */ ... };
ru: struct flock { ... short l_type; /* Тип блокировки: F_RDLCK, F_WRLCK, F_UNLCK */ short l_whence; /* Как интерпретировать l_start: SEEK_SET, SEEK_CUR, SEEK_END */ off_t l_start; /* Начальное смещение блокировки */ off_t l_len; /* Количество блокируемых байт */ pid_t l_pid; /* PID процесса, блокирующего нашу блокировку (только для F_GETLK и F_OFD_GETLK) */ ... };

source: The I<l_whence>, I<l_start>, and I<l_len> fields of this structure specify the range of bytes we wish to lock. Bytes past the end of the file may be locked, but not bytes before the start of the file.
ru: Поля I<l_whence>, I<l_start> и I<l_len> этой структуры задают диапазон байт, который мы хотим заблокировать. Могут блокироваться байты за концом файла, но не перед началом файла.

source: I<l_start> is the starting offset for the lock, and is interpreted relative to either: the start of the file (if I<l_whence> is B<SEEK_SET>); the current file offset (if I<l_whence> is B<SEEK_CUR>); or the end of the file (if I<l_whence> is B<SEEK_END>). In the final two cases, I<l_start> can be a negative number provided the offset does not lie before the start of the file.
ru: I<l_start> \(em это начальное смещение для блокировки, которое интерпретируется как начало файла (если значение I<l_whence> равно B<SEEK_SET>); как текущая позиция в файле (если значение I<l_whence> равно B<SEEK_CUR>); как конец файла (если значение I<l_whence> равно B<SEEK_END>). В последних двух случаях, I<l_start> может иметь отрицательное значение, предоставляя смещение, которого не может указать до начала файла.

source: I<l_len> specifies the number of bytes to be locked. If I<l_len> is positive, then the range to be locked covers bytes I<l_start> up to and including I<l_start>+I<l_len>-1. Specifying 0 for I<l_len> has the special meaning: lock all bytes starting at the location specified by I<l_whence> and I<l_start> through to the end of file, no matter how large the file grows.
ru: В I<l_len> задаётся количество байт, которые нужно заблокировать. Если I<l_len> положительно, то диапазон блокировки начинается со I<l_start> и кончается I<l_start>+I<l_len>-1 включительно. Если в I<l_len> указан 0, то блокируются все байты начиная с места, указанного I<l_whence> и I<l_start> и до конца файла, независимо от величины файла.

source: POSIX.1-2001 allows (but does not require) an implementation to support a negative I<l_len> value; if I<l_len> is negative, the interval described by I<lock> covers bytes I<l_start>+I<l_len> up to and including I<l_start>-1. This is supported by Linux since kernel versions 2.4.21 and 2.5.49.
ru: POSIX.1-2001 позволяет (но не требует) реализации поддерживать отрицательное значение I<l_len>; если I<l_len> отрицательно, то интервал, описываемый I<lock>, имеет размер I<l_start>+I<l_len> до I<l_start>-1 включительно. Это поддерживается в Linux начиная с ядер версии 2.4.21 и 2.5.49.

source: The I<l_type> field can be used to place a read (B<F_RDLCK>) or a write (B<F_WRLCK>) lock on a file. Any number of processes may hold a read lock (shared lock) on a file region, but only one process may hold a write lock (exclusive lock). An exclusive lock excludes all other locks, both shared and exclusive. A single process can hold only one type of lock on a file region; if a new lock is applied to an already-locked region, then the existing lock is converted to the new lock type. (Such conversions may involve splitting, shrinking, or coalescing with an existing lock if the byte range specified by the new lock does not precisely coincide with the range of the existing lock.)
ru: Поле I<l_type> может быть использовано для указания типа блокировки файла: чтение (B<F_RDLCK>) или запись (B<F_WRLCK>). Любое количество процессов могут удерживать блокировку на чтение (общая блокировка) области файла, но только один процесс может удерживать блокировку на запись (эксклюзивная блокировка). Эксклюзивная блокировка исключает все другие блокировки, как общие так и эксклюзивные. Один процесс может удерживать только один тип блокировки области файла; если происходит новая блокировка уже заблокированной области, то существующая блокировка преобразуется в новый тип блокировки. (Такие преобразования могут привести к разбиению, уменьшению или срастанию с существующей блокировкой, если диапазон байт, заданный для новой блокировки, неточно совпадает с диапазоном существующей блокировки.)

source: Acquire a lock (when I<l_type> is B<F_RDLCK> or B<F_WRLCK>) or release a lock (when I<l_type> is B<F_UNLCK>) on the bytes specified by the I<l_whence>, I<l_start>, and I<l_len> fields of I<lock>. If a conflicting lock is held by another process, this call returns -1 and sets I<errno> to B<EACCES> or B<EAGAIN>. (The error returned in this case differs across implementations, so POSIX requires a portable application to check for both errors.)
ru: Установить блокировку (когда I<l_type> равен B<F_RDLCK> или B<F_WRLCK>) или снять блокировку (когда I<l_type> равен B<F_UNLCK>) байтов, указанных полями I<l_whence>, I<l_start> и I<l_len> структуры I<lock>. Если конфликтующая блокировка удерживается другим процессом, то данный вызов вернёт -1 и установит значение I<errno> в B<EACCES> или B<EAGAIN> (ошибка, возвращаемая в этом случае, в разных реализациях разная, поэтому в POSIX для переносимых приложений требуется проверять оба значения).

source: As for B<F_SETLK>, but if a conflicting lock is held on the file, then wait for that lock to be released. If a signal is caught while waiting, then the call is interrupted and (after the signal handler has returned) returns immediately (with return value -1 and I<errno> set to B<EINTR>; see B<signal>(7)).
ru: Как B<F_SETLK>, но если конфликтующая блокировка удерживается на файле, то выполняется ожидание снятия этой блокировки. Если во время ожидания поступил сигнал, то данный вызов прерывается и (после возврата из обработчика сигнала) из него происходит немедленный возврат (возвращается значение -1 и I<errno> устанавливается в B<EINTR>; см. B<signal>(7)).

source: On input to this call, I<lock> describes a lock we would like to place on the file. If the lock could be placed, B<fcntl>() does not actually place it, but returns B<F_UNLCK> in the I<l_type> field of I<lock> and leaves the other fields of the structure unchanged.
ru: При входе в этот вызов, I<lock> описывает блокировку, которую мы хотели бы установить на файл. Если такая блокировка не может быть установлена, B<fcntl>() не устанавливает её, но возвращает B<F_UNLCK> в поле I<l_type> структуры I<lock> и оставляет другие поля структуры неизменёнными.

source: If one or more incompatible locks would prevent this lock being placed, then B<fcntl>() returns details about one of those locks in the I<l_type>, I<l_whence>, I<l_start>, and I<l_len> fields of I<lock>. If the conflicting lock is a traditional (process-associated) record lock, then the I<l_pid> field is set to the PID of the process holding that lock. If the conflicting lock is an open file description lock, then I<l_pid> is set to -1. Note that the returned information may already be out of date by the time the caller inspects it.
ru: Если одна или более несовместимых блокировок мешают установке этой блокировки, то B<fcntl>() возвращает подробности об одной из этих блокировок в полях I<l_type>, I<l_whence>, I<l_start> и I<l_len> структуры I<lock>. Если конфликтующая блокировка является обычной (попроцессной), то в I<l_pid> записывается значение PID того процесса, который удерживает блокировку. Если конфликтующая блокировка является блокировку открытого файлового описания, в I<l_pid> записывается -1. Заметим, что возвращаемая информация может уже устареть в момент проверки вызывающим.

source: In order to place a read lock, I<fd> must be open for reading. In order to place a write lock, I<fd> must be open for writing. To place both types of lock, open a file read-write.
ru: Для того, чтобы установить блокировку на чтение, I<fd> должен быть открыт на чтение. Для того, чтобы установить блокировку на запись, I<fd> должен быть открыт на запись. Чтобы установить оба типа блокировки, дескриптор должен быть открыт на запись и на чтение.

source: When placing locks with B<F_SETLKW>, the kernel detects I<deadlocks>, whereby two or more processes have their lock requests mutually blocked by locks held by the other processes. For example, suppose process A holds a write lock on byte 100 of a file, and process B holds a write lock on byte 200. If each process then attempts to lock the byte already locked by the other process using B<F_SETLKW>, then, without deadlock detection, both processes would remain blocked indefinitely. When the kernel detects such deadlocks, it causes one of the blocking lock requests to immediately fail with the error B<EDEADLK>; an application that encounters such an error should release some of its locks to allow other applications to proceed before attempting regain the locks that it requires. Circular deadlocks involving more than two processes are also detected. Note, however, that there are limitations to the kernel's deadlock-detection algorithm; see BUGS.
ru: При размещении блокировок с помощью B<F_SETLKW>, ядро обнаруживает I<взаимные блокировки> (deadlocks), при которых два и более процессов создают запросы на блокировку, блокируемые блокировками, удерживаемые другими процессами. Например, предположим, что процесс А удерживает блокировку на запись файла в байт 100, а процесс Б удерживает блокировку на запись в байт 200. Если каждый процесс затем попытается заблокировать байт, который уже заблокирован другим процессом с помощью B<F_SETLKW>, то без обнаружения взаимных блокировок оба процесса останутся заблокированными навсегда. Когда ядро обнаруживает такие взаимные блокировки оно сразу же завершает одну из блокирующих блокировок с ошибкой B<EDEADLK>; приложение, встретившее такую ошибку, должно освободить одну из своих блокировок перед попыткой восстановить блокировки, которые ему нужны, позволив другому приложению продолжить работу. Зацикленные взаимные блокировки обнаруживаются и для более двух процессов. Однако заметим, что есть ограничения в алгоритме обнаружения взаимных блокировок; смотрите ДЕФЕКТЫ.

source: As well as being removed by an explicit B<F_UNLCK>, record locks are automatically released when the process terminates.
ru: Также как и при снятии блокировки через явное указание B<F_UNLCK>, блокировка автоматически снимается, когда процесс завершается.

source: Record locks are not inherited by a child created via B<fork>(2), but are preserved across an B<execve>(2).
ru: Блокировки не наследуются потомком, созданным через B<fork>(2), но сохраняются при вызове B<execve>(2).

source: Because of the buffering performed by the B<stdio>(3) library, the use of record locking with routines in that package should be avoided; use B<read>(2) and B<write>(2) instead.
ru: Поскольку буферизация выполняется через библиотеку B<stdio>(3), использование блокировок с функциями в этом пакете нужно избегать; вместо этих функций используйте B<read>(2) и B<write>(2).

source: The record locks described above are associated with the process (unlike the open file description locks described below). This has some unfortunate consequences:
ru: Записи о блокировках, описанных выше, связаны с процессом (в отличие от блокировках открытых файловых описаний, описанных далее). Это приводит к некоторым печальным последствиям:

source: If a process closes I<any> file descriptor referring to a file, then all of the process's locks on that file are released, regardless of the file descriptor(s) on which the locks were obtained. This is bad: it means that a process can lose its locks on a file such as I</etc/passwd> or I</etc/mtab> when for some reason a library function decides to open, read, and close the same file.
ru: Если процесс закрывает I<любой> файловый дескриптор, ссылающийся на файл, то освобождаются все блокировки процесса для этого файла, независимо от файлового дескриптора(ов), на который получена блокировка. Это плохо: это означает, что процесс может потерять свои блокировки на файл, такой как I</etc/passwd> или I</etc/mtab>, когда какой-либо причине библиотечная функция решает их открыть, прочитать и закрыть.

source: The threads in a process share locks. In other words, a multithreaded program can't use record locking to ensure that threads don't simultaneously access the same region of a file.
ru: Нити процесса совместно используют блокировки процесса. Другими словами многонитевая программа не может использовать блокировку для разграничения доступа к одной области файла среди нитей.

source: Open file description locks solve both of these problems.
ru: Блокировки открытых файловых описаний решают обе эти проблемы.

source: Open file description locks (non-POSIX)
ru: Блокировки открытых файловых описаний (не POSIX)

source: Open file description locks are advisory byte-range locks whose operation is in most respects identical to the traditional record locks described above. This lock type is Linux-specific, and available since Linux 3.15. (There is a proposal with the Austin Group to include this lock type in the next revision of POSIX.1.) For an explanation of open file descriptions, see B<open>(2).
ru: Блокировки открытых файловых описаний являются консультативными блокировками диапазона байт, чьё действие почти идентично обычным блокировкам, описанным выше. Данный тип блокировок есть только в Linux и доступен с версии 3.15 (есть предложение в Austin Group включить данный тип блокировки в следующую версию POSIX.1). Описание открытых файловых описаний смотрите в B<open>(2).

source: The principal difference between the two lock types is that whereas traditional record locks are associated with a process, open file description locks are associated with the open file description on which they are acquired, much like locks acquired with B<flock>(2). Consequently (and unlike traditional advisory record locks), open file description locks are inherited across B<fork>(2) (and B<clone>(2) with B<CLONE_FILES>), and are only automatically released on the last close of the open file description, instead of being released on any close of the file.
ru: Принципиальное различие между двумя типами блокировок в том, что обычные блокировки связаны с процессом, а блокировки открытых файловых описаний связаны с открытым файловым описанием, для которого они получены (очень похоже на блокировки, получаемые с помощью B<flock>(2). В следствие этого (и в отличие от обычных консультативных блокировок), блокировки открытых файловых описаний наследуются при B<fork>(2) (и при B<clone>(2) с B<CLONE_FILES>), и освобождаются только автоматически при последнем закрытии открытого файлового описания, а не при любом закрытии файла.

source: Conflicting lock combinations (i.e., a read lock and a write lock or two write locks) where one lock is an open file description lock and the other is a traditional record lock conflict even when they are acquired by the same process on the same file descriptor.
ru: Конфликт комбинаций блокировок (блокировка чтения и блокировка записи или две блокировки записи), при котором одна блокировка — открытое файловое описание, а другая — обычная блокировка, конфликтуют даже когда они запрашиваются одним процессом для одного и того же файлового дескриптора.
