Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: If possible, the GNU C Library defines a macro B<FE_NOMASK_ENV> which represents an environment where every exception raised causes a trap to occur. You can test for this macro using B<#ifdef>. It is defined only if B<_GNU_SOURCE> is defined. The C99 standard does not define a way to set individual bits in the floating-point mask, for example, to trap on specific flags. Since version 2.2, glibc supports the functions B<feenableexcept>() and B<fedisableexcept>() to set individual floating-point traps, and B<fegetexcept>() to query the state.
ru: Если возможно, библиотека GNU C определяет макрос B<FE_NOMASK_ENV>, представляющий окружение, в котором при каждом возбуждении исключения срабатывает ловушка (trap). Вы можете проверить этот макрос с помощью B<#ifdef>. Он определён, только при определении B<_GNU_SOURCE>. В стандарте C99 нет способа установить отдельные биты в маске плавающей запятой, например, чтобы отловить определённые флаги. Начиная с версии 2.2, в glibc поддерживаются функции B<feenableexcept>() и B<fedisableexcept>(), которые устанавливают отдельные ловушки плавающей запятой, и B<fegetexcept>() для получения состояния.

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>fenv.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>fenv.hE<gt>>

source: The B<feenableexcept>() and B<fedisableexcept>() functions enable (disable) traps for each of the exceptions represented by I<excepts> and return the previous set of enabled exceptions when successful, and -1 otherwise. The B<fegetexcept>() function returns the set of all currently enabled exceptions.
ru: Функции B<feenableexcept>() и B<fedisableexcept>() включают (отключают) ловушки для каждого исключения, представленного в I<excepts>, и при успешном выполнении возвращают старый набор включённых исключений, и -1 в противном случае. Функция B<fegetexcept>() возвращает набор всех включённых в данных момент исключений.

source: C99 specifies that the value of B<FLT_ROUNDS> should reflect changes to the current rounding mode, as set by B<fesetround>(). Currently, this does not occur: B<FLT_ROUNDS> always has the value 1.
ru: В C99 указано, что значение B<FLT_ROUNDS> должно отражать изменения текущего режима округления, устанавливаемого с помощью B<fesetround>(). В настоящее время это не выполняется: значение B<FLT_ROUNDS> всегда равно 1.

source: fpclassify, isfinite, isnormal, isnan, isinf - floating-point classification macros
ru: fpclassify, isfinite, isnormal, isnan, isinf - макросы классификации чисел с плавающей запятой

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: Floating point numbers can have special values, such as infinite or NaN. With the macro B<fpclassify(>I<x>B<)> you can find out what type I<x> is. The macro takes any floating-point expression as argument. The result is one of the following values:
ru: У чисел с плавающей запятой есть специальные значения, например для бесконечности или NaN. С помощью макроса B<fpclassify(>I<x>B<)> вы можете выяснить тип I<x>. В качестве аргумента макрос принимает любое выражение с плавающей запятой. Результатом будет одно из следующих значений:

source: I<x> is "Not a Number".
ru: Значение I<x> не является числом («Not a Number»).

source: I<x> is either positive infinity or negative infinity.
ru: Значение I<x> стремится к плюс или минус бесконечности.

source: I<x> is zero.
ru: Значение I<x> равно нулю.

source: I<x> is too small to be represented in normalized format.
ru: Значение I<x> слишком мало для представления в нормализованном формате.

source: if nothing of the above is correct then it must be a normal floating-point number.
ru: Если значение не равно ни одному из вышеперечисленных, то это обычное число с плавающей запятой.

source: The other macros provide a short answer to some standard questions.
ru: Остальные макросы предоставляют короткие ответы на некоторые стандартные вопросы.

source: returns a nonzero value if
ru: возвращает ненулевое значение, если

source: returns a nonzero value if (fpclassify(x) == FP_NORMAL)
ru: возвращает ненулевое значение, если (fpclassify(x) == FP_NORMAL)

source: returns a nonzero value if (fpclassify(x) == FP_NAN)
ru: возвращает ненулевое значение, если (fpclassify(x) == FP_NAN)

source: returns 1 if I<x> is positive infinity, and -1 if I<x> is negative infinity.
ru: возвращает 1, если I<x> равно положительной бесконечности и -1, если I<x> равно отрицательной бесконечности.

source: For B<isinf>(), the standards merely say that the return value is nonzero if and only if the argument has an infinite value.
ru: Про B<isinf>() в стандартах лишь сказано, что этот макрос возвращает ненулевое значение, если только аргумент равен бесконечности.

source: In glibc 2.01 and earlier, B<isinf>() returns a nonzero value (actually: 1) if I<x> is positive infinity or negative infinity. (This is all that C99 requires.)
ru: В glibc 2.01 и более ранних B<isinf>() возвращает ненулевое значение (а именно 1), если I<x> равно положительной или отрицательной бесконечности (это всё, что требует C99).

source: fpurge, __fpurge - purge a stream
ru: fpurge, __fpurge - вычищает поток

source: /* unsupported */ B<#include E<lt>stdio.hE<gt>>
ru: /* не поддерживается */ B<#include E<lt>stdio.hE<gt>>

source: /* supported */ B<#include E<lt>stdio.hE<gt>> B<#include E<lt>stdio_ext.hE<gt>>
ru: /* поддерживается */ B<#include E<lt>stdio.hE<gt>> B<#include E<lt>stdio_ext.hE<gt>>

source: The function B<fpurge>() clears the buffers of the given stream. For output streams this discards any unwritten output. For input streams this discards any input read from the underlying object but not yet obtained via B<getc>(3); this includes any text pushed back via B<ungetc>(3). See also B<fflush>(3).
ru: Функция B<fpurge>() очищает буферы указанного потока. При этом для потоков вывода отбрасываются все незаписанные данные. Для потоков ввода отбрасывается все данные, полученные от объекта, но ещё не выбранные B<getc>(3), в том числе, любой текст, занесённый с помощью B<ungetc>(3). Смотрите также B<fflush>(3).

source: The function B<__fpurge>() does precisely the same, but without returning a value.
ru: Функция B<__fpurge>() делает то же самое, но не возвращает никакого значения.

source: Upon successful completion B<fpurge>() returns 0. On error, it returns -1 and sets I<errno> appropriately.
ru: При успешном выполнении B<fpurge>() возвращает 0. При ошибке возвращается -1 и переменная I<errno> устанавливается соответствующим образом.

source: I<stream> is not an open stream.
ru: Значение I<stream> не является открытым потоком.

source: These functions are nonstandard and not portable. The function B<fpurge>() was introduced in 4.4BSD and is not available under Linux. The function B<__fpurge>() was introduced in Solaris, and is present in glibc 2.1.95 and later.
ru: Эти функции нестандартны и не являются переносимыми. Функция B<fpurge>() появилась из BSD 4.4 и отсутствует в Linux. Функция B<__fpurge>() появилась из Solaris и включена в glibc начиная с версии 2.1.95.

source: Usually it is a mistake to want to discard input buffers.
ru: Как правило, отбрасывать содержимое буферов ввода является ошибкой.

source: futimes, lutimes - change file timestamps
ru: futimes, lutimes - изменяют метки времени файла

source: B<futimes>(), B<lutimes>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE
ru: B<futimes>(), B<lutimes>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE

source: B<futimes>() changes the access and modification times of a file in the same way as B<utimes>(2), with the difference that the file whose timestamps are to be changed is specified via a file descriptor, I<fd>, rather than via a pathname.
ru: Функция B<futimes>() изменяет время доступа и изменения файла также как это делает B<utimes>(2); единственное отличие в том, что файл чьи временные метки изменяются, указывается в виде файлового дескриптора, I<fd>, а не в виде пути.

source: B<lutimes>() changes the access and modification times of a file in the same way as B<utimes>(2), with the difference that if I<filename> refers to a symbolic link, then the link is not dereferenced: instead, the timestamps of the symbolic link are changed.
ru: Функция B<lutimes>() изменяет время доступа и изменения файла также как это делает B<utimes>(2); единственное отличие в том, что если I<filename> является символьной ссылкой, то ссылка не разыменовывается — изменяются метки времени самой ссылки.

source: Errors are as for B<utimes>(2), with the following additions for B<futimes>():
ru: Возникают те же ошибки что и для B<utimes>(2), а также дополнительно для B<futimes>():

source: I<fd> is not a valid file descriptor.
ru: Значение I<fd> не является правильным файловым дескриптором.

source: The I</proc> filesystem could not be accessed.
ru: Нет доступа к файловой системе I</proc>.

source: The following additional error may occur for B<lutimes>():
ru: Для B<lutimes>() может возникать следующая дополнительная ошибка:

source: The kernel does not support this call; Linux 2.6.22 or later is required.
ru: Ядро не поддерживает этот вызов; требуется Linux версии 2.6.22 или новее.

source: B<futimes>() is available since glibc 2.3. B<lutimes>() is available since glibc 2.6, and is implemented using the B<utimensat>(2) system call, which is supported since kernel 2.6.22.
ru: Функция B<futimes>() доступна в glibc начиная с версии 2.3. Функция B<lutimes>() доступа в glibc начиная с версии 2.6, и реализована на основе системного вызова B<utimensat>(2), который поддерживается в ядре начиная с версии 2.6.22.

source: These functions are not specified in any standard. Other than Linux, they are available only on the BSDs.
ru: Эти функции не определены ни в одном стандарте. Помимо Linux, они доступны только в некоторых BSD.

source: fgetgrent - get group file entry
ru: fgetgrent - возвращает запись из файла групп

source: B<fgetgrent>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _SVID_SOURCE
ru: B<fgetgrent>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _SVID_SOURCE

source: The B<fgetgrent>() function returns a pointer to a structure containing the group information from the file referred to by I<stream>. The first time it is called it returns the first entry; thereafter, it returns successive entries. The file referred to by I<stream> must have the same format as I</etc/group> (see B<group>(5)).
ru: Функция B<fgetgrent>() возвращает указатель на структуру, содержащую информацию о группах из файла, на который ссылается I<stream>. Во время первого вызова функция возвращает первую запись; в дальнейшем она возвращает все последующие записи. Формат файла, на который указывает I<stream>, должен быть таким же как у I</etc/group> (смотрите B<group>(5)).

source: The I<group> structure is defined in I<E<lt>grp.hE<gt>> as follows:
ru: Структура I<group> определена в I<E<lt>grp.hE<gt>> следующим образом:

source: struct group { char *gr_name; /* group name */ char *gr_passwd; /* group password */ gid_t gr_gid; /* group ID */ char **gr_mem; /* NULL-terminated array of pointers to names of group members */ };
ru: struct group { char *gr_name; /* имя группы */ char *gr_passwd; /* пароль группы */ gid_t gr_gid; /* ID группы */ char **gr_mem; /* массив, указателей имён членов группы, оканчивающийся NULL */ };

source: The B<fgetgrent>() function returns a pointer to a I<group> structure, or NULL if there are no more entries or an error occurs. In the event of an error, I<errno> is set to indicate the cause.
ru: Функция B<fgetgrent>() возвращает указатель на структуру I<group> или NULL, если больше записей не найдено или произошла ошибка. При ошибке I<errno> присваивается соответствующее значение.

source: Insufficient memory to allocate I<group> structure.
ru: Недостаточно памяти для структуры I<group>.

source: ftok - convert a pathname and a project identifier to a System V IPC key
ru: ftok - преобразует путь и идентификатор проекта в ключ System V IPC

source: The B<ftok>() function uses the identity of the file named by the given I<pathname> (which must refer to an existing, accessible file) and the least significant 8 bits of I<proj_id> (which must be nonzero) to generate a I<key_t> type System V IPC key, suitable for use with B<msgget>(2), B<semget>(2), or B<shmget>(2).
ru: Функция B<ftok>() использует отличительные свойства (identity) файла с именем I<pathname> (которое должно указывать на существующий и доступный файл) и младшие 8 бит аргумента I<proj_id> (который должен быть не равен нулю) для генерации ключа System V IPC I<key_t>, который пригоден для работы с B<msgget>(2), B<semget>(2) или B<shmget>(2).

source: The resulting value is the same for all pathnames that name the same file, when the same value of I<proj_id> is used. The value returned should be different when the (simultaneously existing) files or the project IDs differ.
ru: Возвращаемое значение одинаково для всех имён, указывающих на один и тот же файл при одинаковом значении I<proj_id>. Возвращаемое значение будет отличаться, когда (одновременно существующие) файлы или идентификаторы проекта различаются.

source: On success, the generated I<key_t> value is returned. On failure -1 is returned, with I<errno> indicating the error as for the B<stat>(2) system call.
ru: При успешном выполнении возвращается сгенерированное значение I<key_t>. При ошибке возвращается -1, а в переменную I<errno> записывается код ошибки согласно системному вызову B<stat>(2).

source: On some ancient systems, the prototype was:
ru: В некоторых старых системах прототип выглядел как:

source: Today, I<proj_id> is an I<int>, but still only 8 bits are used. Typical usage has an ASCII character I<proj_id>, that is why the behavior is said to be undefined when I<proj_id> is zero.
ru: В наши дни I<proj_id> имеет тип I<int>, хотя, как правило, по-прежнему из него используется только 8 бит. Обычно, при вызове этой функции в качестве I<proj_id> передаётся символ ASCII, именно поэтому поведение функции считается не определённым, если I<proj_id> равен нулю.

source: Of course, no guarantee can be given that the resulting I<key_t> is unique. Typically, a best-effort attempt combines the given I<proj_id> byte, the lower 16 bits of the inode number, and the lower 8 bits of the device number into a 32-bit result. Collisions may easily happen, for example between files on I</dev/hda1> and files on I</dev/sda1>.
ru: Естественно, не гарантируется, что возвращаемый I<key_t> уникален. Обычно производится объединение указанного байта I<proj_id> с младшими 16 битами номера inode и младшими 8 битам номера устройства в 32-битный результат. Легко могут возникать повторения, например между файлами на I</dev/hda1> и файлами на I</dev/sda1>.

source: fopen, fdopen, freopen - stream open functions
ru: fopen, fdopen, freopen - функции для открытия потоков

source: The B<fopen>() function opens the file whose name is the string pointed to by I<pathname> and associates a stream with it.
ru: Функция B<fopen>() открывает файл с именем, которое задано в виде строки в I<pathname>, и связывает его с потоком.

source: The argument I<mode> points to a string beginning with one of the following sequences (possibly followed by additional characters, as described below):
ru: Параметр I<mode> указывает на строку, начинающуюся с одной из следующих последовательностей (за ними могут следовать дополнительные символы, описанные далее):

source: Open text file for reading. The stream is positioned at the beginning of the file.
ru: Открыть текстовый файл для чтения. Поток совмещается с началом файла.

source: Open for reading and writing. The stream is positioned at the beginning of the file.
ru: Открыть для чтения и записи. Поток совмещается с началом файла.

source: Truncate file to zero length or create text file for writing. The stream is positioned at the beginning of the file.
ru: Обрезать файл до нулевой длины или создать текстовый файл для записи. Поток совмещается с началом файла.

source: Open for reading and writing. The file is created if it does not exist, otherwise it is truncated. The stream is positioned at the beginning of the file.
ru: Открыть для чтения и записи. Файл создаётся, если его не существует, в противном случае он обрезается. Поток совмещается с началом файла.

source: Open for appending (writing at end of file). The file is created if it does not exist. The stream is positioned at the end of the file.
ru: Открыть для добавления (записи в конец файла). Файл создаётся, если его не существует. Поток совмещается с концом файла.

source: Open for reading and appending (writing at end of file). The file is created if it does not exist. Output is always appended to the end of the file. POSIX is silent on what the initial read position is when using this mode. For glibc, the initial file position for reading is at the beginning of the file, but for Android/BSD/MacOS, the initial file position for reading is at the end of the file.
ru: Открыть для чтения и добавления (записи в конец файла). Файл создаётся, если не существует. Вывод всегда добавляется в конец файла. В POSIX ничего не упоминается о начальном положении при чтении, когда используется данный режим. В glibc начальное положение в файле для чтения устанавливается в начало файла, но в Android/BSD/MacOS начальное положение в файле для чтения устанавливается в конец файла.

source: The I<mode> string can also include the letter \(aqb\(aq either as a last character or as a character between the characters in any of the two-character strings described above. This is strictly for compatibility with C89 and has no effect; the \(aqb\(aq is ignored on all POSIX conforming systems, including Linux. (Other systems may treat text files and binary files differently, and adding the \(aqb\(aq may be a good idea if you do I/O to a binary file and expect that your program may be ported to non-UNIX environments.)
ru: Строка I<mode> может также содержать символ «b» в качестве последнего символа или символа между двумя символами в любых описанных выше двухсимвольных комбинациях. Это требуется только для совместимости с C89 и не оказывает никакого влияния; символ «b» игнорируется во всех POSIX-совместимых системах, включая Linux. Другие системы могут по-разному обращаться с текстовыми и двоичными файлами, и добавление «b» может оказаться полезным, если вы осуществляете ввод-вывод в двоичный файл и ожидаете, что ваша программа может быть перенесена в не UNIX окружение.

source: See NOTES below for details of glibc extensions for I<mode>.
ru: О имеющихся расширениях I<mode> в glibc смотрите ЗАМЕЧАНИЯ далее.

source: Any created file will have the mode B<S_IRUSR> | B<S_IWUSR> | B<S_IRGRP> | B<S_IWGRP> | B<S_IROTH> | B<S_IWOTH> (0666), as modified by the process's umask value (see B<umask>(2)).
ru: Любой созданный файл будет иметь атрибуты B<S_IRUSR> | B<S_IWUSR> | B<S_IRGRP> | B<S_IWGRP> | B<S_IROTH> | B<S_IWOTH> (0666), как изменённые в соответствии со значением umask процесса (смотрите B<umask>(2)).

source: Reads and writes may be intermixed on read/write streams in any order. Note that ANSI C requires that a file positioning function intervene between output and input, unless an input operation encounters end-of-file. (If this condition is not met, then a read is allowed to return the result of writes other than the most recent.) Therefore it is good practice (and indeed sometimes necessary under Linux) to put an B<fseek>(3) or B<fgetpos>(3) operation between write and read operations on such a stream. This operation may be an apparent no-op (as in I<fseek(..., 0L, SEEK_CUR)> called for its synchronizing side effect).
ru: Чтение и запись могут перемешиваться друг с другом в потоке, открытом для чтения/записи, в любом порядке). Заметим, что в ANSI C требуется, чтобы между выводом и вводом использовались функции позиционирования в файле, если операция ввода не встретила конец файла. Если это условие не выполняется, то при чтении разрешается возвращать результат, не совпадающий с данными самой последней записи. Поэтому рекомендуется (а иногда и действительно необходимо в Linux) использовать функции B<fseek>(3) или B<fgetpos>(3) между операциями чтения и записи в одном потоке. Эти операции могут фактически быть пустыми (например, I<fseek(..., 0L, SEEK_CUR)>, вызванная для того, чтобы возник её побочный эффект синхронизации).

source: Opening a file in append mode (B<a> as the first character of I<mode>) causes all subsequent write operations to this stream to occur at end-of-file, as if preceded the call:
ru: Открытие файла в режиме дописывания (B<a> в качестве первого символа I<mode>) приводит к тому, что все последующие операции записи в этот поток производятся в конец файла, как если бы перед ними была вызвана:

source: The file descriptor associated with the stream is opened as if by a call to B<open>(2) with the following flags:
ru: Файловый дескриптор, связанный с потоком, открывается как при вызове B<open>(2) со следующими флагами:

source: fopen() mode
ru: режим fopen()

source: open() flags
ru: флаги open()

source: The B<fdopen>() function associates a stream with the existing file descriptor, I<fd>. The I<mode> of the stream (one of the values "r", "r+", "w", "w+", "a", "a+") must be compatible with the mode of the file descriptor. The file position indicator of the new stream is set to that belonging to I<fd>, and the error and end-of-file indicators are cleared. Modes "w" or "w+" do not cause truncation of the file. The file descriptor is not dup'ed, and will be closed when the stream created by B<fdopen>() is closed. The result of applying B<fdopen>() to a shared memory object is undefined.
ru: Функция B<fdopen>() связывает поток с существующим дескриптором файла I<fd>. Режим I<mode> потока (одно из следующих значений: «r», «r+», «w», ,w+», «a», «a+») должен быть совместим с режимом дескриптора файла. Указатель положения в файле в новом потоке принимает значение, равное значению у I<fd>, а указатели ошибок и конца файла очищаются. Режимы «w» или «w+» не обрезают файл. При этом не делается копия дескриптора файла и он будет закрыт одновременно с закрытием потока, созданного B<fdopen>(). Результат применения B<fdopen>() к общему объекту памяти не определён.

source: The B<freopen>() function opens the file whose name is the string pointed to by I<pathname> and associates the stream pointed to by I<stream> with it. The original stream (if it exists) is closed. The I<mode> argument is used just as in the B<fopen>() function.
ru: Функция B<freopen>() открывает файл с именем I<pathname> и связывает его с потоком, указанным в I<stream>. Исходный поток (если такой существовал) закрывается. Значение параметра I<mode> такое же как для функции B<fopen>().

source: If the I<pathname> argument is a null pointer, B<freopen>() changes the mode of the stream to that specified in I<mode>; that is, B<freopen>() reopens the pathname that is associated with the stream. The specification for this behavior was added in the C99 standard, which says:
ru: Если значение I<pathname> равно указателю null, то B<freopen>() изменяет режим потока на указанный в I<mode>; то есть, B<freopen>() переоткрывает pathname, связанный с потоком. Описание этого поведения было добавлено в стандарт C99, где сказано:
