Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_f/*.po
Languages: ru

source: Since Linux 2.6.37, the kernel supports a compatibility mode that allows B<flock>() locks (and also B<fcntl>(2) byte region locks) to be treated as local; see the discussion of the I<local_lock> option in B<nfs>(5).
ru: Начиная с Linux 2.6.37, ядро поддерживает режим совместимости, позволяющий считать блокировки B<flock>() (а также байтовые диапазоны блокировки B<fcntl>(2)) локальными; смотрите описание параметра I<local_lock> в B<nfs>(5).

source: I<Documentation/filesystems/locks.txt> in the Linux kernel source tree (I<Documentation/locks.txt> in older kernels)
ru: I<Documentation/filesystem/locks.txt> в исходном коде ядра Linux (в старых ядрах — I<Documentation/locks.txt>)

source: fanotify_mark - add, remove, or modify an fanotify mark on a filesystem object
ru: fanotify_mark - добавляет, удаляет или изменяет метку fanotify для объекта файловой системы

source: For an overview of the fanotify API, see B<fanotify>(7).
ru: Обзор программного интерфейса fanotify смотрите в B<fanotify>(7).

source: B<fanotify_mark>() adds, removes, or modifies an fanotify mark on a filesystem object. The caller must have read permission on the filesystem object that is to be marked.
ru: Системный вызов B<fanotify_mark>() добавляет, удаляет или изменяет метку fanotify для объекта файловой системы. Вызывающий должен иметь право на чтение помеченного объекта файловой системы.

source: The I<fanotify_fd> argument is a file descriptor returned by B<fanotify_init>(2).
ru: Аргумент I<fanotify_fd> — файловый дескриптор, возвращаемый B<fanotify_init>(2).

source: I<flags> is a bit mask describing the modification to perform. It must include exactly one of the following values:
ru: Аргумент I<flags> — битовая маска, описывающая выполняемое изменение. Она должна содержать только одно значение из:

source: The events in I<mask> will be added to the mark mask (or to the ignore mask). I<mask> must be nonempty or the error B<EINVAL> will occur.
ru: События в I<mask> будут добавлены в маску меток (или в маску игнорирования). Если значение I<mask> пусто, то возвращается ошибка B<EINVAL>.

source: The events in argument I<mask> will be removed from the mark mask (or from the ignore mask). I<mask> must be nonempty or the error B<EINVAL> will occur.
ru: События в I<mask> будут удалены из маски меток (или маски игнорирования). Если значение I<mask> пусто, то возвращается ошибка B<EINVAL>.

source: Remove either all marks for filesystems, all marks for mounts, or all marks for directories and files from the fanotify group. If I<flags> contains B<FAN_MARK_MOUNT>, all marks for mounts are removed from the group. If I<flags> contains B<FAN_MARK_FILESYSTEM>, all marks for filesystems are removed from the group. Otherwise, all marks for directories and files are removed. No flag other than and at most one of the flags B<FAN_MARK_MOUNT> or B<FAN_MARK_FILESYSTEM> can be used in conjunction with B<FAN_MARK_FLUSH>. I<mask> is ignored.
ru: Удалить все метки файловых систем, все метки монтирований или все метки каталогов и файлов из группы fanotify. Если в I<flags> содержится B<FAN_MARK_MOUNT>, то все метки монтирований удаляются из группы. Если в I<flags> содержится B<FAN_MARK_FILESYSTEM>, то все метки файловых систем удаляются из группы. В противном случае удаляются все метки и каталогов и файлов. Вместе с B<FAN_MARK_FLUSH> может быть указан только либо B<FAN_MARK_MOUNT>, либо B<FAN_MARK_FILESYSTEM>.Значение I<mask> игнорируется.

source: If none of the values above is specified, or more than one is specified, the call fails with the error B<EINVAL>.
ru: Если не задано ни одно из этих значений, или указано больше одного, то вызов завершается с ошибкой B<EINVAL>.

source: In addition, zero or more of the following values may be ORed into I<flags>:
ru: Кроме этого в I<flags> могут быть указаны (побитовым сложением):

source: If I<pathname> is a symbolic link, mark the link itself, rather than the file to which it refers. (By default, B<fanotify_mark>() dereferences I<pathname> if it is a symbolic link.)
ru: Если I<pathname> — символьная ссылка, то помечается сама ссылка, а не файл, на который она ссылается (по умолчанию B<fanotify_mark>() разыменовывает I<pathname>, если это символьная ссылка).

source: If the filesystem object to be marked is not a directory, the error B<ENOTDIR> shall be raised.
ru: Если объект файловой системы для пометки не является каталогом, то возвращается ошибка B<ENOTDIR>.

source: Mark the mount point specified by I<pathname>. If I<pathname> is not itself a mount point, the mount point containing I<pathname> will be marked. All directories, subdirectories, and the contained files of the mount point will be monitored. This value cannot be used if the I<fanotify_fd> file descriptor has been initialized with the flag B<FAN_REPORT_FID> or if any of the new directory modification events are provided as a I<mask>. Attempting to do so will result in the error B<EINVAL> being returned.
ru: Пометить точку монтирования, заданную в I<pathname>. Если само значение I<pathname> не является точкой монтирования, то будет помечена точка монтирования, которая содержит I<pathname>. Будут отслеживаться все каталоги, подкаталоги и содержащиеся в точке монтирования файлы. Это значение нельзя использовать, если файловый дескриптор I<fanotify_fd> инициализирован с флагом B<FAN_REPORT_FID> или если в качестве маски I<mask> указано любое событие изменения нового каталога. Результатом попытки это сделать будет возврат ошибки B<EINVAL>.

source: B<FAN_MARK_FILESYSTEM> (since Linux 4.20)
ru: B<FAN_MARK_FILESYSTEM> (начиная с Linux 4.20)

source: Mark the filesystem specified by I<pathname>. The filesystem containing I<pathname> will be marked. All the contained files and directories of the filesystem from any mount point will be monitored.
ru: Пометить файловую систему, заданную в I<pathname>. Будет помечена файловая система, содержащая I<pathname>. Будут отслеживаться все файлы и каталоги файловой системы любой точки монтирования.

source: The events in I<mask> shall be added to or removed from the ignore mask.
ru: События в I<mask> должны быть добавлены или удалены из маски игнорирования.

source: The ignore mask shall survive modify events. If this flag is not set, the ignore mask is cleared when a modify event occurs for the ignored file or directory.
ru: Маска игнорирования должна остаться неизменной при событиях изменения. Если этот флаг не указан, то маска игнорирования очищается при появлении событий изменения игнорируемого файла или каталога.

source: I<mask> defines which events shall be listened for (or which shall be ignored). It is a bit mask composed of the following values:
ru: В I<mask> указывается какие события должны прослушиваться (или игнорироваться). Данная битовая маска состоит из следующих значений:

source: Create an event when a file or directory (but see BUGS) is accessed (read).
ru: Создать событие при доступе (для чтения) к файлу или каталогу (но смотрите ДЕФЕКТЫ).

source: Create an event when a file is modified (write).
ru: Создать событие при изменении (при записи) файла.

source: Create an event when a writable file is closed.
ru: Создать событие при закрытии файла, открытого на запись.

source: Create an event when a read-only file or directory is closed.
ru: Создать событие при закрытии файла или каталога, открытого только для чтения.

source: Create an event when a file or directory is opened.
ru: Создать событие при открытии файла или каталога.

source: B<FAN_OPEN_EXEC> (since Linux 5.0)
ru: B<FAN_OPEN_EXEC> (начиная с Linux 5.0)

source: Create an event when a file is opened with the intent to be executed. See NOTES for additional details.
ru: Создать событие при открытии файла для начала выполнения. Подробней об этом в ЗАМЕЧАНИЯХ.

source: B<FAN_ATTRIB> (since Linux 5.1)
ru: B<FAN_ATTRIB> (начиная с Linux 5.1)

source: Create an event when the metadata for a file or directory has changed.
ru: Создать событие при изменении метаданных файла или каталога.

source: B<FAN_CREATE> (since Linux 5.1)
ru: B<FAN_CREATE> (начиная с Linux 5.1)

source: Create an event when a file or directory has been created in a marked parent directory.
ru: Создать событие при создании файла или каталога в помеченном родительском каталоге.

source: B<FAN_DELETE> (since Linux 5.1)
ru: B<FAN_DELETE> (начиная с Linux 5.1)

source: Create an event when a file or directory has been deleted in a marked parent directory.
ru: Создать событие при удалении файла или каталога в помеченном родительском каталоге.

source: B<FAN_DELETE_SELF> (since Linux 5.1)
ru: B<FAN_DELETE_SELF> (начиная с Linux 5.1)

source: Create an event when a marked file or directory itself is deleted.
ru: Создать событие при удалении самого помеченного файла или каталога.

source: B<FAN_MOVED_FROM> (since Linux 5.1)
ru: B<FAN_MOVED_FROM> (начиная с Linux 5.1)

source: Create an event when a file or directory has been moved from a marked parent directory.
ru: Создать событие при перемещении файла или каталога из помеченного родительского каталога.

source: B<FAN_MOVED_TO> (since Linux 5.1)
ru: B<FAN_MOVED_TO> (начиная с Linux 5.1)

source: Create an event when a file or directory has been moved to a marked parent directory.
ru: Создать событие при перемещении файла или каталога в помеченный родительский каталог.

source: B<FAN_MOVE_SELF> (since Linux 5.1)
ru: B<FAN_MOVE_SELF> (начиная с Linux 5.1)

source: Create an event when a marked file or directory itself has been moved.
ru: Создать событие при перемещении самого помеченного файла или каталога.

source: Create an event when an overflow of the event queue occurs. The size of the event queue is limited to 16384 entries if B<FAN_UNLIMITED_QUEUE> is not set in B<fanotify_init>(2).
ru: Создать событие при переполнении очереди сообщений. Размер очереди сообщений ограничен 16384 элементами, если в B<fanotify_init>(2) не указан B<FAN_UNLIMITED_QUEUE>.

source: Create an event when a permission to open a file or directory is requested. An fanotify file descriptor created with B<FAN_CLASS_PRE_CONTENT> or B<FAN_CLASS_CONTENT> is required.
ru: Создать событие при запросе открытия файла или каталога. Требуется файловый дескриптор fanotify, созданный с B<FAN_CLASS_PRE_CONTENT> или B<FAN_CLASS_CONTENT>.

source: B<FAN_OPEN_EXEC_PERM> (since Linux 5.0)
ru: B<FAN_OPEN_EXEC_PERM> (начиная с Linux 5.0)

source: Create an event when a permission to open a file for execution is requested. An fanotify file descriptor created with B<FAN_CLASS_PRE_CONTENT> or B<FAN_CLASS_CONTENT> is required. See NOTES for additional details.
ru: Создать событие при запросе открытия файла или каталога на выполнение. Требуется файловый дескриптор fanotify, созданный с B<FAN_CLASS_PRE_CONTENT> или B<FAN_CLASS_CONTENT>. Дополнительная информация представлена в ЗАМЕЧАНИЯХ.

source: Create an event when a permission to read a file or directory is requested. An fanotify file descriptor created with B<FAN_CLASS_PRE_CONTENT> or B<FAN_CLASS_CONTENT> is required.
ru: Создать событие при запросе чтения файла или каталога. Требуется файловый дескриптор fanotify, созданный с B<FAN_CLASS_PRE_CONTENT> или B<FAN_CLASS_CONTENT>.

source: Create events for directories\(emfor example, when B<opendir>(3), B<readdir>(3) (but see BUGS), and B<closedir>(3) are called. Without this flag, only events for files are created. The B<FAN_ONDIR> flag is reported in an event mask only if the I<fanotify_fd> file descriptor has been initialized with the flag B<FAN_REPORT_FID>. In the context of directory entry events, such as B<FAN_CREATE>, B<FAN_DELETE>, B<FAN_MOVED_FROM>, and B<FAN_MOVED_TO> for example, specifying the flag B<FAN_ONDIR> is required in order to create events when subdirectory entries are modified (i.e., B<mkdir>(2)/ B<rmdir>(2)). Subdirectory entry modification events will never be merged with nonsubdirectory entry modification events. This flag is never reported individually within an event and is always supplied in conjunction with another event type.
ru: Создать события для каталогов, например, когда вызывается B<opendir>(3), B<readdir>(3) (но смотрите ДЕФЕКТЫ) и B<closedir>(3). Без этого флага события создаются только для файлов. Флаг B<FAN_ONDIR> возвращается в маске событий только, если файловый дескриптор I<fanotify_fd> инициализирован с флагом B<FAN_REPORT_FID>. В контексте события элементов каталога, например таких как B<FAN_CREATE>, B<FAN_DELETE>, B<FAN_MOVED_FROM>и B<FAN_MOVED_TO>, требуется задавать флаг B<FAN_ONDIR> для создания событий, когда изменяются элементы подкаталогов (т. е., B<mkdir>(2)/ B<rmdir>(2)). События изменения элемента подкаталога никогда не будут объединены с с событиями изменений элементов не подкаталога. Этот флаг никогда не возвращается один в событии и всегда задаётся вместе с другим типом события.

source: Events for the immediate children of marked directories shall be created. The flag has no effect when marking mounts and filesystems. Note that events are not generated for children of the subdirectories of marked directories. To monitor complete directory trees it is necessary to mark the relevant mount.
ru: Должны создаваться события для прямых потомков помеченных каталогов. Флаг не влияет на помеченные точки монтирования и файловые системы. Заметим, что события не генерируются для потомков подкаталогов помеченных каталогов. Для слежения за всем деревом каталогов нужно пометить соответствующую точку монтирования.

source: The following composed values are defined:
ru: Определены следующие составные значения:

source: A file is closed (B<FAN_CLOSE_WRITE>|B<FAN_CLOSE_NOWRITE>).
ru: Файл закрыт (B<FAN_CLOSE_WRITE>|B<FAN_CLOSE_NOWRITE>).

source: A file or directory has been moved (B<FAN_MOVED_FROM>|B<FAN_MOVED_TO>).
ru: Файл или каталог был перемещён (B<FAN_MOVED_FROM>|B<FAN_MOVED_TO>).

source: The filesystem object to be marked is determined by the file descriptor I<dirfd> and the pathname specified in I<pathname>:
ru: Объект файловой системы для пометки задаётся файловым дескриптором I<dirfd> и путём, указанным в I<pathname>:

source: If I<pathname> is NULL, I<dirfd> defines the filesystem object to be marked.
ru: Если значение I<pathname> равно NULL, то в I<dirfd> указан объект файловой системы для пометки.

source: If I<pathname> is NULL, and I<dirfd> takes the special value B<AT_FDCWD>, the current working directory is to be marked.
ru: Если значение I<pathname> равно NULL и I<dirfd> равно специальному значению B<AT_FDCWD>, то помечается текущий рабочий каталог.

source: If I<pathname> is absolute, it defines the filesystem object to be marked, and I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то им определяется объект файловой системы для пометки, а I<dirfd> игнорируется.

source: If I<pathname> is relative, and I<dirfd> does not have the value B<AT_FDCWD>, then the filesystem object to be marked is determined by interpreting I<pathname> relative the directory referred to by I<dirfd>.
ru: Если в I<pathname> задан относительный путь и I<dirfd> не равно B<AT_FDCWD>, то помечаемый объект файловой системы определяется из I<pathname> относительно каталога, заданного в I<dirfd>.

source: If I<pathname> is relative, and I<dirfd> has the value B<AT_FDCWD>, then the filesystem object to be marked is determined by interpreting I<pathname> relative the current working directory.
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно B<AT_FDCWD>, то помечаемый объект файловой системы определяется из I<pathname> относительно текущего рабочего каталога.

source: On success, B<fanotify_mark>() returns 0. On error, -1 is returned, and I<errno> is set to indicate the error.
ru: При успешном выполнении B<fanotify_mark>() возвращает 0; при ошибке возвращается -1, а в I<errno> задаётся причина ошибки.

source: An invalid file descriptor was passed in I<fanotify_fd>.
ru: В I<fanotify_fd> передан некорректный файловый дескриптор.

source: An invalid value was passed in I<flags> or I<mask>, or I<fanotify_fd> was not an fanotify file descriptor.
ru: В I<flags> или I<mask> указано некорректное значение, или в I<fanotify_fd> не файловый дескриптор fanotify.

source: The fanotify file descriptor was opened with B<FAN_CLASS_NOTIF> or B<FAN_REPORT_FID> and mask contains a flag for permission events (B<FAN_OPEN_PERM> or B<FAN_ACCESS_PERM>).
ru: Файловый дескриптор fanotify был открыт с B<FAN_CLASS_NOTIF> или B<FAN_REPORT_FID> и маска содержит флаг для событий доступа (B<FAN_OPEN_PERM> или B<FAN_ACCESS_PERM>).

source: The filesystem object indicated by I<dirfd> and I<pathname> does not exist. This error also occurs when trying to remove a mark from an object which is not marked.
ru: Объект файловой системы, указанный в I<dirfd> и I<pathname>, не существует. Эта ошибка также возникает при попытке удаления метки с не помеченного объекта.

source: The necessary memory could not be allocated.
ru: Невозможно выделить необходимую память.

source: The number of marks exceeds the limit of 8192 and the B<FAN_UNLIMITED_MARKS> flag was not specified when the fanotify file descriptor was created with B<fanotify_init>(2).
ru: Количество меток превышает ограничение в 8192 и флаг B<FAN_UNLIMITED_MARKS> не был указан при создании файлового дескриптора fanotify с помощью B<fanotify_init>(2).

source: This kernel does not implement B<fanotify_mark>(). The fanotify API is available only if the kernel was configured with B<CONFIG_FANOTIFY>.
ru: В этом ядре не реализован B<fanotify_mark>(). Программный интерфейс fanotify доступен только, если ядро было собрано с параметром B<CONFIG_FANOTIFY>.

source: I<flags> contains B<FAN_MARK_ONLYDIR>, and I<dirfd> and I<pathname> do not specify a directory.
ru: В значении I<flags> содержится B<FAN_MARK_ONLYDIR>, а в I<dirfd> и I<pathname> указан не каталог.

source: The filesystem object indicated by I<pathname> resides within a filesystem subvolume (e.g., B<btrfs>(5)) which uses a different I<fsid> than its root superblock. This error can be returned only when an fanotify file descriptor returned by B<fanotify_init>(2) has been created with B<FAN_REPORT_FID>.
ru: Объект файловой системы, указанный в I<pathname>, располагается в подтоме файловой системы (например, B<btrfs>(5)), которая использует I<fsid> отличный от используемого в её корневом суперблоке. Эта ошибка может вернуться только, когда файловый дескриптор fanotify, возвращаемый B<fanotify_init>(2), был создан с флагом B<FAN_REPORT_FID>.

source: The filesystem object indicated by I<pathname> is not associated with a filesystem that supports I<fsid> (e.g., B<tmpfs>(5)). This error can be returned only when an fanotify file descriptor returned by B<fanotify_init>(2) has been created with B<FAN_REPORT_FID>.
ru: Объект файловой системы, указанный в I<pathname>, не связан с файловой системой, которая поддерживает I<fsid> (например, B<tmpfs>(5)). Эта ошибка может вернуться только, когда файловый дескриптор fanotify, возвращаемый B<fanotify_init>(2), был создан с флагом B<FAN_REPORT_FID>.

source: The object indicated by I<pathname> is associated with a filesystem that does not support the encoding of file handles. This error can be returned only when an fanotify file descriptor returned by B<fanotify_init>(2) has been created with B<FAN_REPORT_FID>.
ru: Объект, указанный в I<pathname>, связан с файловой системой, которая не поддерживает кодирование файловых описателей. Эта ошибка может вернуться только, когда файловый дескриптор fanotify, возвращаемый B<fanotify_init>(2), был создан с флагом B<FAN_REPORT_FID>.

source: B<fanotify_mark>() was introduced in version 2.6.36 of the Linux kernel and enabled in version 2.6.37.
ru: Вызов B<fanotify_mark>() появился в версии 2.6.36 ядра Linux и был включён в версии 2.6.37.

source: FAN_OPEN_EXEC and FAN_OPEN_EXEC_PERM
ru: FAN_OPEN_EXEC и FAN_OPEN_EXEC_PERM

source: When using either B<FAN_OPEN_EXEC> or B<FAN_OPEN_EXEC_PERM> within the I<mask>, events of these types will be returned only when the direct execution of a program occurs. More specifically, this means that events of these types will be generated for files that are opened using B<execve>(2), B<execveat>(2), or B<uselib>(2). Events of these types will not be raised in the situation where an interpreter is passed (or reads) a script file for interpretation.
ru: При использовании B<FAN_OPEN_EXEC> или B<FAN_OPEN_EXEC_PERM> в I<mask> события этих типов будут возвращаться только, когда происходит непосредственное выполнение программы. Точнее говоря, события этих типов будут сгенерированы для файлов, которые открываются с помощью B<execve>(2), B<execveat>(2) или B<uselib>(2). События данных типов не будут возникать в ситуации, когда интерпретатору передаётся (или он читает) файл интерпретируемого сценария.

source: Additionally, if a mark has also been placed on the Linux dynamic linker, a user should also expect to receive an event for it when an ELF object has been successfully opened using B<execve>(2) or B<execveat>(2).
ru: Также, если метка помещается на динамический компоновщик Linux, то пользователь должен также ожидать приём сообщения, когда он открывает объект ELF с помощью B<execve>(2) или B<execveat>(2).

source: For example, if the following ELF binary were to be invoked and a B<FAN_OPEN_EXEC> mark has been placed on /:
ru: Например, если вызывается следующий двоичный ELF и меткой B<FAN_OPEN_EXEC> отмечен /:

source: The listening application in this case would receive B<FAN_OPEN_EXEC> events for both the ELF binary and interpreter, respectively:
ru: Слушающее приложение в этом случае получило бы события B<FAN_OPEN_EXEC> для исполняемого файла ELF и интерпретатора, соответственно:

source: The following bugs were present in Linux kernels before version 3.16:
ru: В ядрах Linux до версии 3.16 существуют следующие дефекты:

source: If I<flags> contains B<FAN_MARK_FLUSH>, I<dirfd> and I<pathname> must specify a valid filesystem object, even though this object is not used.
ru: Если I<flags> содержит B<FAN_MARK_FLUSH>, то I<dirfd> и I<pathname> должны задавать корректный объект файловой системы, даже если этот объект не используется.

source: B<readdir>(2) does not generate a B<FAN_ACCESS> event.
ru: Вызов B<readdir>(2) не генерирует событие B<FAN_ACCESS>.

source: If B<fanotify_mark>() is called with B<FAN_MARK_FLUSH>, I<flags> is not checked for invalid values.
ru: Если B<fanotify_mark>() вызван с B<FAN_MARK_FLUSH>, то значение I<flags> не проверяется на корректность.

source: fcntl - manipulate file descriptor
ru: fcntl - работа с файловым дескриптором

source: B<fcntl>() performs one of the operations described below on the open file descriptor I<fd>. The operation is determined by I<cmd>.
ru: B<fcntl>() позволяет выполнять различные команды над открытым файловым дескриптором I<fd>. Команда определяется содержимым аргумента I<cmd>.

source: B<fcntl>() can take an optional third argument. Whether or not this argument is required is determined by I<cmd>. The required argument type is indicated in parentheses after each I<cmd> name (in most cases, the required type is I<int>, and we identify the argument using the name I<arg>), or I<void> is specified if the argument is not required.
ru: B<fcntl>() может принимать необязательный третий аргумент. Необходимость его указания зависит от значения, указанного в I<cmd>. Тип необходимого аргумента указан в скобках после каждого имени значения I<cmd> (в большинстве случаев требуется тип I<int>, и мы определяем аргумент с помощью имени I<arg>), или указывается I<void>, если аргумент не нужен.
