Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Although technically B<man> is a troff macro package, in reality a large number of other tools process man page files that don't implement all of troff's abilities. Thus, it's best to avoid some of troff's more exotic abilities where possible to permit these other tools to work correctly. Avoid using the various troff preprocessors (if you must, go ahead and use B<tbl>(1), but try to use the B<IP> and B<TP> commands instead for two-column tables). Avoid using computations; most other tools can't process them. Use simple commands that are easy to translate to other formats. The following troff macros are believed to be safe (though in many cases they will be ignored by translators): B<\e">, B<.>, B<ad>, B<bp>, B<br>, B<ce>, B<de>, B<ds>, B<el>, B<ie>, B<if>, B<fi>, B<ft>, B<hy>, B<ig>, B<in>, B<na>, B<ne>, B<nf>, B<nh>, B<ps>, B<so>, B<sp>, B<ti>, B<tr>.
ru: Хотя технически B<man> и является пакетом макросов troff, большое количество других инструментов обработки файлов справочных страниц не реализуют все свойства troff. То есть, лучше не использовать некоторые экзотические возможности troff, если нужно чтобы такие инструменты работали правильно. Не используйте различные препроцессоры troff (если очень нужно, то, конечно, используйте B<tbl>(1), но старайтесь использовать команды B<IP> и B<TP> вместо двухколоночных таблиц). Не применяйте вычисления; большинство инструментов не обрабатывают их. Используйте простые команды, которые легко транслировать в другие форматы. Следующие макросы troff можно использовать без проблем (хотя во многих случаях они будут игнорироваться трансляторами): B<\e">, B<.>, B<ad>, B<bp>, B<br>, B<ce>, B<de>, B<ds>, B<el>, B<ie>, B<if>, B<fi>, B<ft>, B<hy>, B<ig>, B<in>, B<na>, B<ne>, B<nf>, B<nh>, B<ps>, B<so>, B<sp>, B<ti>, B<tr>.

source: You may also use many troff escape sequences (those sequences beginning with \e). When you need to include the backslash character as normal text, use \ee. Other sequences you may use, where x or xx are any characters and N is any digit, include: B<\e\(aq>, B<\e\(ga>, B<\e->, B<\e.>, B<\e">, B<\e%>, B<\e*x>, B<\e*(xx>, B<\e(xx>, B<\e$N>, B<\enx>, B<\en(xx>, B<\efx>, and B<\ef(xx>. Avoid using the escape sequences for drawing graphics.
ru: Также можно использовать много экранированных последовательностей troff (начинающихся с \e). Если нужно включить обратную косую черту в текст используйте \ee. Можно использовать другие последовательности (здесь x или xx могут быть любыми символами и N любой цифрой): B<\e\(aq>, B<\e\(ga>, B<\e->, B<\e.>, B<\e">, B<\e%>, B<\e*x>, B<\e*(xx>, B<\e(xx>, B<\e$N>, B<\enx>, B<\en(xx>, B<\efx> и B<\ef(xx>. Не используйте экранированные последовательности для рисования графики.

source: Do not use the optional parameter for B<bp> (break page). Use only positive values for B<sp> (vertical space). Don't define a macro (B<de>) with the same name as a macro in this or the mdoc macro package with a different meaning; it's likely that such redefinitions will be ignored. Every positive indent (B<in>) should be paired with a matching negative indent (although you should be using the B<RS> and B<RE> macros instead). The condition test (B<if,ie>) should only have \(aqt\(aq or \(aqn\(aq as the condition. Only translations (B<tr>) that can be ignored should be used. Font changes (B<ft> and the B<\ef> escape sequence) should only have the values 1, 2, 3, 4, R, I, B, P, or CW (the ft command may also have no parameters).
ru: Не используйте необязательный параметр B<bp> (разрыв страницы). Используйте только положительные значения для B<sp> (вертикальный отступ). Не определяйте макрос (B<de>) с тем же именем как в этом пакете или пакете макросов mdoc с другим смыслом; такое переопределение, вероятнее всего, будет проигнорировано. Каждый положительный отступ (B<in>) должен составлять пару с отрицательным отступом (хотя для этого лучше использовать макросы B<RS> и B<RE>). В проверке условия (B<if,ie>) нужно использовать только \(aqt\(aq или \(aqn\(aq в качестве условия. Должны использоваться только трансляции (B<tr>), которые можно игнорировать. Для изменения шрифта (экранированные последовательности B<ft> и B<\ef>) должны использоваться только значения 1, 2, 3, 4, R, I, B, P или CW (также команда ft может указываться без параметров).

source: If you use capabilities beyond these, check the results carefully on several tools. Once you've confirmed that the additional capability is safe, let the maintainer of this document know about the safe command or sequence that should be added to this list.
ru: Если кроме этих возможностей вы используете какие-то другие, то внимательно проверяйте результат на нескольких инструментах. После положительной проверки дополнительной возможности, напишите об этом сопровождающему этого документа о безопасной команде или последовательности, которая будет вставлена в этот список.

source: By all means include full URLs (or URIs) in the text itself; some tools such as B<man2html>(1) can automatically turn them into hypertext links. You can also use the B<UR> and B<UE> macros to identify links to related information. If you include URLs, use the full URL (e.g., E<.UR http://www.kernel.org> E<.UE )> to ensure that tools can automatically find the URLs.
ru: Всегда включайте полные URL (или URI) в сам текст; некоторые инструменты, например B<man2html>(1), могут автоматически преобразовывать их в гипертекстовые ссылки. Для обозначения ссылок также вы можете использовать макросы B<UR> и B<UE>. При добавлении URL используйте полный URL (например, E<.UR http://www.kernel.org> E<.UE )>, чтобы инструменты могли автоматически найти URL.

source: Tools processing these files should open the file and examine the first nonwhitespace character. A period (.) or single quote (\(aq) at the beginning of a line indicates a troff-based file (such as man or mdoc). A left angle bracket (E<lt>) indicates an SGML/XML-based file (such as HTML or Docbook). Anything else suggests simple ASCII text (e.g., a "catman" result).
ru: Инструменты, обрабатывающие эти файлы, должны открыть файл и исследовать первый непробельный символ. Считается, что точка (.) или одинарная кавычка (\(aq) в начале строки указывает, что файл в формате troff (man или mdoc). Левая угловая скобка (E<lt>) указывает, что файл в SGML/XML-подобном формате (HTML или Docbook). При нахождении любого другого символа считается, что это простой текст ASCII (например, результат «catman»).

source: Many man pages begin with B<\(aq\e"> followed by a space and a list of characters, indicating how the page is to be preprocessed. For portability's sake to non-troff translators we recommend that you avoid using anything other than B<tbl>(1), and Linux can detect that automatically. However, you might want to include this information so your man page can be handled by other (less capable) systems. Here are the definitions of the preprocessors invoked by these characters:
ru: Много справочных страниц начинаются с B<\(aq\e">, после которого идёт пробел и список символов, указывающих как страница должна быть предварительно обработана. Для совместимости с не troff подобными трансляторами, мы рекомендуем не использовать что-либо кроме B<tbl>(1), и Linux может обнаружить это автоматически. Однако вы можете захотеть включить эту информацию для того, чтобы ваша справочная страница могла быть обработана другими (менее развитыми) системами. Вот определения препроцессоров, вызываемых этими символами:

source: Most of the macros describe formatting (e.g., font type and spacing) instead of marking semantic content (e.g., this text is a reference to another page), compared to formats like mdoc and DocBook (even HTML has more semantic markings). This situation makes it harder to vary the B<man> format for different media, to make the formatting consistent for a given media, and to automatically insert cross-references. By sticking to the safe subset described above, it should be easier to automate transitioning to a different reference page format in the future.
ru: Большинство макросов служат для форматирования (например, тип шрифта и интервал), а не для маркировки семантического содержания (например, что текст — ссылка на другую страницу), если сравнивать с форматами mdoc и DocBook (даже в HTML больше семантической маркировки). Это усложняет создание формата B<man> для разных носителей, чтобы выдать непротиворечивый результат для определённого носителя и автоматически вставить перекрестные ссылки. Использование безопасного подмножества, описанного выше, должно упростить автоматизацию перехода между разными форматами ссылок в будущем.

source: The Sun macro B<TX> is not implemented.
ru: Макрос Sun B<TX> не реализован.

source: mkdir, mkdirat - create a directory
ru: mkdir, mkdirat - создаёт каталог

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>sys/stat.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> >/* определения констант AT_* */ B<#include E<lt>sys/stat.hE<gt>>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (смотрите B<feature_test_macros>(7)):

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: B<mkdir>() attempts to create a directory named I<pathname>.
ru: Функция B<mkdir>() пытается создать каталог с именем I<pathname>.

source: The argument I<mode> specifies the mode for the new directory (see B<inode>(7)). It is modified by the process's I<umask> in the usual way: in the absence of a default ACL, the mode of the created directory is (I<mode> & ~I<umask> & 0777). Whether other I<mode> bits are honored for the created directory depends on the operating system. For Linux, see NOTES below.
ru: В аргументе I<mode> задаются права доступа к новому каталогу (смотрите B<inode>(7)). Эти права стандартным образом изменяются с помощью согласно I<umask> процесса: при отсутствии списка доступа по умолчанию права на созданный каталог будут рассчитаны как (I<mode> & ~I<umask> & 0777). Другие биты I<mode> на создаваемый каталог зависят от операционной системы. Для Linux они описаны в ЗАМЕЧАНИЯХ.

source: The newly created directory will be owned by the effective user ID of the process. If the directory containing the file has the set-group-ID bit set, or if the filesystem is mounted with BSD group semantics (I<mount -o bsdgroups> or, synonymously I<mount -o grpid>), the new directory will inherit the group ownership from its parent; otherwise it will be owned by the effective group ID of the process.
ru: Создаваемый каталог будет принадлежать фактическому владельцу процесса. Если у родительского каталога установлен флаг set-group-ID, или файловая система смонтирована с семантикой групп в стиле BSD (I<mount -o bsdgroups> или, что одно и тоже, I<mount -o grpid>), то новый каталог унаследует группу владельца от своего родительского каталога; в противном случае группой владельцем станет фактическая группа процесса.

source: If the parent directory has the set-group-ID bit set, then so will the newly created directory.
ru: Если у родительского каталога установлен бит set-group-ID, то он будет установлен также и у создаваемого каталога.

source: The B<mkdirat>() system call operates in exactly the same way as B<mkdir>(), except for the differences described here.
ru: Системный вызов B<mkdirat>() работает также как системный вызов B<mkdir>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<mkdir>() for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<mkdir>()).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<mkdir>()).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<mkdir>()).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то I<dirfd> игнорируется.

source: See B<openat>(2) for an explanation of the need for B<mkdirat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<mkdirat>().

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: B<mkdir>() and B<mkdirat>() return zero on success, or -1 if an error occurred (in which case, I<errno> is set appropriately).
ru: При успешном выполнении вызовов B<mkdir>() и B<mkdirat>() возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: ERRORS
ru: ОШИБКИ

source: The parent directory does not allow write permission to the process, or one of the directories in I<pathname> did not allow search permission. (See also B<path_resolution>(7).)
ru: У процесса нет прав на запись в родительский каталог, или в одном из каталогов в I<pathname> не разрешён поиск (смотрите также B<path_resolution>(7)).

source: The user's quota of disk blocks or inodes on the filesystem has been exhausted.
ru: Исчерпана пользовательская квота на дисковые блоки или иноды файловой системы.

source: I<pathname> already exists (not necessarily as a directory). This includes the case where I<pathname> is a symbolic link, dangling or not.
ru: I<pathname> уже существует (и необязательно как каталог). В этом случае I<pathname> может быть символьной ссылкой, повисшей или нет.

source: I<pathname> points outside your accessible address space.
ru: Аргумент I<pathname> указывает за пределы доступного адресного пространства.

source: The final component ("basename") of the new directory's I<pathname> is invalid (e.g., it contains characters not permitted by the underlying filesystem).
ru: Последний компонент («основная часть» (basename)) нового каталога I<pathname> некорректен (например, содержит недопустимые в нижележащей файловой системе символы).

source: Too many symbolic links were encountered in resolving I<pathname>.
ru: Во время определения I<pathname> встретилось слишком много символьных ссылок.

source: The number of links to the parent directory would exceed B<LINK_MAX>.
ru: Количество ссылок на родительский каталог превысило бы B<LINK_MAX>.

source: I<pathname> was too long.
ru: I<pathname> слишком длинен.

source: A directory component in I<pathname> does not exist or is a dangling symbolic link.
ru: Один из каталогов в I<pathname> не существует или является повисшей символьной ссылкой.

source: Insufficient kernel memory was available.
ru: Недостаточное количество памяти ядра.

source: The device containing I<pathname> has no room for the new directory.
ru: На устройстве, содержащем I<pathname>, нет места для создания нового каталога.

source: The new directory cannot be created because the user's disk quota is exhausted.
ru: Новый каталог не может быть создан, так как превышена пользовательская дисковая квота.

source: A component used as a directory in I<pathname> is not, in fact, a directory.
ru: Компонент пути, использованный как каталог в I<pathname>, в действительности таковым не является.

source: The filesystem containing I<pathname> does not support the creation of directories.
ru: Файловая система, содержащая I<pathname>, не поддерживает создание каталогов.

source: I<pathname> refers to a file on a read-only filesystem.
ru: I<pathname> указывает на файл в файловой системе, доступной только для чтения.

source: The following additional errors can occur for B<mkdirat>():
ru: В B<mkdirat>() дополнительно могут возникнуть следующие ошибки:

source: I<dirfd> is not a valid file descriptor.
ru: I<dirfd> не является правильным файловым дескриптором.

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
ru: Значение I<pathname> содержит относительный путь и I<dirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог.

source: B<mkdirat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Вызов B<mkdirat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: Under Linux, apart from the permission bits, the B<S_ISVTX> I<mode> bit is also honored.
ru: В Linux кроме битов прав, в I<mode> учитывается также бит B<S_ISVTX>.

source: There are many infelicities in the protocol underlying NFS. Some of these affect B<mkdir>().
ru: В протоколе, на котором работает NFS, есть множество недоработок. Некоторые из них влияют на B<mkdir>().

source: Glibc notes
ru: Замечания по glibc

source: On older kernels where B<mkdirat>() is unavailable, the glibc wrapper function falls back to the use of B<mkdir>(). When I<pathname> is a relative pathname, glibc constructs a pathname based on the symbolic link in I</proc/self/fd> that corresponds to the I<dirfd> argument.
ru: В старых ядрах, где B<mkdirat>() отсутствует, обёрточная функция glibc использует B<mkdir>(). Если I<pathname> является относительным путём, то glibc собирает путь относительно символической ссылки в I</proc/self/fd>, которая соответствует аргументу I<dirfd>.

source: mmap, munmap - map or unmap files or devices into memory
ru: mmap, munmap - отображает файлы или устройства в памяти, или удаляет их отображение

source: See NOTES for information on feature test macro requirements.
ru: Информацию по требованиям макроса тестирования свойств смотрите в разделе ЗАМЕЧАНИЯ.

source: B<mmap>() creates a new mapping in the virtual address space of the calling process. The starting address for the new mapping is specified in I<addr>. The I<length> argument specifies the length of the mapping (which must be greater than 0).
ru: Вызов B<mmap>() создаёт новое отображение в виртуальном адресном пространстве вызывающего процесса. Адрес начала нового отображения указывается в I<addr>. В аргументе I<length> задаётся длина отображения (должна быть больше 0).

source: If I<addr> is NULL, then the kernel chooses the (page-aligned) address at which to create the mapping; this is the most portable method of creating a new mapping. If I<addr> is not NULL, then the kernel takes it as a hint about where to place the mapping; on Linux, the kernel will pick a nearby page boundary (but always above or equal to the value specified by I</proc/sys/vm/mmap_min_addr>) and attempt to create the mapping there. If another mapping already exists there, the kernel picks a new address that may or may not depend on the hint. The address of the new mapping is returned as the result of the call.
ru: Если значение I<addr> равно NULL, то ядро само выбирает адрес (выровненный по странице), по которому создаётся отображение; это наиболее переносимый метод создания нового отображения. Если значение I<addr> не равно NULL, то ядро учитывает это при размещении отображения; в Linux ядро выберет ближайшую к границе страницу (но всегда выше или равною значению, заданному в I</proc/sys/vm/mmap_min_addr>) и попытается создать отображение. Если по этому адресу уже есть отображение, то ядро выберет новый адрес, который может и не зависеть от подсказки. Адрес нового отображения возвращается как результат вызова.

source: The contents of a file mapping (as opposed to an anonymous mapping; see B<MAP_ANONYMOUS> below), are initialized using I<length> bytes starting at offset I<offset> in the file (or other object) referred to by the file descriptor I<fd>. I<offset> must be a multiple of the page size as returned by I<sysconf(_SC_PAGE_SIZE)>.
ru: Содержимое файлового отображения (в отличие от анонимного отображения; смотрите B<MAP_ANONYMOUS> далее) инициализируется данными из файла (или объекта), на который указывает файловый дескриптор I<fd>, длиной I<length> байт, начиная со смещения I<offset>. Значение I<offset> должно быть кратно размеру (возвращается I<sysconf(_SC_PAGE_SIZE)>) страницы.

source: After the B<mmap>() call has returned, the file descriptor, I<fd>, can be closed immediately without invalidating the mapping.
ru: После возврата из вызова B<mmap>() файловый дескриптор I<fd> может быть немедленно закрыт без признания отображения недействительным.

source: The I<prot> argument describes the desired memory protection of the mapping (and must not conflict with the open mode of the file). It is either B<PROT_NONE> or the bitwise OR of one or more of the following flags:
ru: В аргументе I<prot> указывается желаемая защита памяти отображения (не должна конфликтовать с режимом открытого файла). Значением может быть B<PROT_NONE> или побитово сложенные (OR) следующие флаги:

source: Pages may be executed.
ru: Страницы доступны для исполнения.

source: Pages may be read.
ru: Страницы доступны для чтения.

source: Pages may be written.
ru: Страницы доступны для записи.

source: Pages may not be accessed.
ru: Страницы недоступны.

source: The I<flags> argument determines whether updates to the mapping are visible to other processes mapping the same region, and whether updates are carried through to the underlying file. This behavior is determined by including exactly one of the following values in I<flags>:
ru: В аргументе I<flags> задаётся будут ли изменения отображения видимы другим процессам, отображающим ту же область, и будут ли изменения перенесены в отображённый файл. Данное поведение определяется в I<flags> одним из следующих значений:

source: Share this mapping. Updates to the mapping are visible to other processes mapping the same region, and (in the case of file-backed mappings) are carried through to the underlying file. (To precisely control when updates are carried through to the underlying file requires the use of B<msync>(2).)
ru: Сделать отображение общим. Изменения отображения видимы всем процессам, отображающим ту же область и (если отображение выполняется из файла) изменения заносятся в отображённый файл (для более точного контроля над изменениями файла нужно использовать B<msync>(2)).

source: B<MAP_SHARED_VALIDATE> (since Linux 4.15)
ru: B<MAP_SHARED_VALIDATE> (начиная с Linux 4.15)

source: This flag provides the same behavior as B<MAP_SHARED> except that B<MAP_SHARED> mappings ignore unknown flags in I<flags>. By contrast, when creating a mapping using B<MAP_SHARED_VALIDATE>, the kernel verifies all passed flags are known and fails the mapping with the error B<EOPNOTSUPP> for unknown flags. This mapping type is also required to be able to use some mapping flags (e.g., B<MAP_SYNC>).
ru: Данный флаг представляет тоже, что и B<MAP_SHARED>, отображения B<MAP_SHARED> игнорируют неизвестные флаги I<flags>. Если же отображение создаётся с B<MAP_SHARED_VALIDATE>, ядро проверят, что ему известны все переданные флаги и завершает отображение ошибкой B<EOPNOTSUPP>, если есть неизвестные флаги. Этот тип отображения также требуется для использования некоторых флагов отображения (например, B<MAP_SYNC>).

source: Create a private copy-on-write mapping. Updates to the mapping are not visible to other processes mapping the same file, and are not carried through to the underlying file. It is unspecified whether changes made to the file after the B<mmap>() call are visible in the mapped region.
ru: Создать закрытое отображение с механизмом копирования при записи. Изменения отображения невидимы другим процессам, отображающим тот же файл, и сам файл не изменяется. Не определено, будут ли видимы в отображённой области изменения в файле, сделанные после вызова B<mmap>().
