Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: fprintf(stderr, "Usage: %s [options]\en", prog_name); fprintf(stderr, "Options are:\en"); fprintf(stderr, "-s send message using msgsnd()\en"); fprintf(stderr, "-r read message using msgrcv()\en"); fprintf(stderr, "-t message type (default is 1)\en"); fprintf(stderr, "-k message queue key (default is 1234)\en"); exit(EXIT_FAILURE); }
ru: fprintf(stderr, "Использование: %s [параметры]\en", prog_name); fprintf(stderr, "Параметры:\en"); fprintf(stderr, "-s отправить сообщение с помощью msgsnd()\en"); fprintf(stderr, "-r прочитать сообщение с помощью msgrcv()\en"); fprintf(stderr, "-t тип сообщения (по умолчанию 1)\en"); fprintf(stderr, "-k ключ очереди сообщения (по умолчанию 1234)\en"); exit(EXIT_FAILURE); }

source: time(&t); snprintf(msg.mtext, sizeof(msg.mtext), "a message at %s", ctime(&t));
ru: time(&t); snprintf(msg.mtext, sizeof(msg.mtext), "дата сообщения %s", ctime(&t));

source: if (msgsnd(qid, (void *) &msg, sizeof(msg.mtext), IPC_NOWAIT) == -1) { perror("msgsnd error"); exit(EXIT_FAILURE); } printf("sent: %s\en", msg.mtext); }
ru: if (msgsnd(qid, (void *) &msg, sizeof(msg.mtext), IPC_NOWAIT) == -1) { perror("msgsnd error"); exit(EXIT_FAILURE); } printf("отправка: %s\en", msg.mtext); }

source: if (msgrcv(qid, (void *) &msg, sizeof(msg.mtext), msgtype, MSG_NOERROR | IPC_NOWAIT) == -1) { if (errno != ENOMSG) { perror("msgrcv"); exit(EXIT_FAILURE); } printf("No message available for msgrcv()\en"); } else printf("message received: %s\en", msg.mtext); }
ru: if (msgrcv(qid, (void *) &msg, sizeof(msg.mtext), msgtype, MSG_NOERROR | IPC_NOWAIT) == -1) { if (errno != ENOMSG) { perror("msgrcv"); exit(EXIT_FAILURE); } printf("С помощью msgrcv() сообщений не получено\en"); } else printf("приём: %s\en", msg.mtext); }

source: while ((opt = getopt(argc, argv, "srt:k:")) != -1) { switch (opt) { case \(aqs\(aq: mode = 1; break; case \(aqr\(aq: mode = 2; break; case \(aqt\(aq: msgtype = atoi(optarg); if (msgtype E<lt>= 0) usage(argv[0], "-t option must be greater than 0\en"); break; case \(aqk\(aq: msgkey = atoi(optarg); break; default: usage(argv[0], "Unrecognized option\en"); } }
ru: while ((opt = getopt(argc, argv, "srt:k:")) != -1) { switch (opt) { case \(aqs\(aq: mode = 1; break; case \(aqr\(aq: mode = 2; break; case \(aqt\(aq: msgtype = atoi(optarg); if (msgtype E<lt>= 0) usage(argv[0], "параметр -t должен быть больше 0\en"); break; case \(aqk\(aq: msgkey = atoi(optarg); break; default: usage(argv[0], "Неизвестный параметр\en"); } }

source: if (mode == 0) usage(argv[0], "must use either -s or -r option\en");
ru: if (mode == 0) usage(argv[0], "нужно указать параметр -s или -r\en");

source: move_pages - move individual pages of a process to another node
ru: move_pages - перемещает отдельные страницы процесса на другой узел

source: Link with I<-lnuma>.
ru: Компонуется при указании параметра I<-lnuma>.

source: B<move_pages>() moves the specified I<pages> of the process I<pid> to the memory nodes specified by I<nodes>. The result of the move is reflected in I<status>. The I<flags> indicate constraints on the pages to be moved.
ru: Вызов B<move_pages>() перемещает указанные в I<pages> страницы процесса с I<pid> в память узлов, заданных в I<nodes>. Результат перемещения отражается в I<status>. В I<flags> задаются ограничения на перемещаемые страницы.

source: I<pid> is the ID of the process in which pages are to be moved. If I<pid> is 0, then B<move_pages>() moves pages of the calling process.
ru: Значение I<pid> представляет собой идентификатор процесса, в котором перемещаются страницы. Если I<pid> равен 0, то B<move_pages>() перемещается страницы вызывающего процесса.

source: To move pages in another process requires the following privileges:
ru: Для перемещения страниц в другом процессе требуются следующие права:

source: In kernels up to and including Linux 4.12: the caller must be privileged (B<CAP_SYS_NICE>) or the real or effective user ID of the calling process must match the real or saved-set user ID of the target process.
ru: В ядрах до Linux 4.12 включительно: вызывающий должен иметь права (B<CAP_SYS_NICE>) или реальный или эффективный пользовательский ID вызывающего процесса должен совпадать с реальным или сохранённым пользовательским ID целевого процесса.

source: The older rules allowed the caller to discover various virtual address choices made by the kernel that could lead to the defeat of address-space-layout randomization for a process owned by the same UID as the caller, the rules were changed starting with Linux 4.13. Since Linux 4.13, permission is governed by a ptrace access mode B<PTRACE_MODE_READ_REALCREDS> check with respect to the target process; see B<ptrace>(2).
ru: Старые правила позволяли вызывающему обнаруживать различные виртуальные адреса, выбранные ядром, что лишает смысла случайность расположения раскладки адресного пространства процесса, принадлежащему тому же UID что и вызывающий; правила были изменены в Linux 4.13. Начиная с Linux 4.13, права регулируются проверкой режима доступа ptrace B<PTRACE_MODE_READ_REALCREDS> целевого процесса; смотрите B<ptrace>(2).

source: I<count> is the number of pages to move. It defines the size of the three arrays I<pages>, I<nodes>, and I<status>.
ru: В аргументе I<count> задаётся количество перемещаемых страниц. Он определяет размер трёх массивов: I<pages>, I<nodes> и I<status>.

source: I<pages> is an array of pointers to the pages that should be moved. These are pointers that should be aligned to page boundaries. Addresses are specified as seen by the process specified by I<pid>.
ru: Аргумент I<pages> представляет собой массив указателей на страницы, которые должны быть перемещены. Данные указатели должны быть выровнены на границу страницы. Адреса указываются в том же виде, в каком доступны процессу с заданным I<pid>.

source: I<nodes> is an array of integers that specify the desired location for each page. Each element in the array is a node number. I<nodes> can also be NULL, in which case B<move_pages>() does not move any pages but instead will return the node where each page currently resides, in the I<status> array. Obtaining the status of each page may be necessary to determine pages that need to be moved.
ru: Аргумент I<nodes> представляет собой массив целых, которыми задаются желаемые местоположения каждой страницы. Каждый элемент массива представляет собой номер узла. Также, значением I<nodes> может быть NULL; в этом случае B<move_pages>() не перемещает страницы, а записывает в массив I<status> номер узла, на котором расположена каждая страница в данный момент. Получение состояния каждой страницы может потребоваться для определения страниц, которые нужно переместить.

source: I<status> is an array of integers that return the status of each page. The array contains valid values only if B<move_pages>() did not return an error.
ru: Аргумент I<status> представляет собой массив целых, которым определяется состояние каждой страницы. Массив содержит правильные значения только, если вызов B<move_pages>() не завершился с ошибкой.

source: I<flags> specify what types of pages to move. B<MPOL_MF_MOVE> means that only pages that are in exclusive use by the process are to be moved. B<MPOL_MF_MOVE_ALL> means that pages shared between multiple processes can also be moved. The process must be privileged (B<CAP_SYS_NICE>) to use B<MPOL_MF_MOVE_ALL>.
ru: В аргументе I<flags> указываются типы перемещаемых страниц. Флаг B<MPOL_MF_MOVE> означает, что будут перемещены только страницы, которые монопольно используются процессом. Флаг B<MPOL_MF_MOVE_ALL> означает, что также будут перемещены страницы, которые используются совместно с другими процессами. Для использования флага B<MPOL_MF_MOVE_ALL> процесс должен быть привилегированным (B<CAP_SYS_NICE>).

source: Page states in the status array
ru: Состояние страницы в массиве состояний

source: The following values can be returned in each element of the I<status> array.
ru: В каждом элементе массива I<status> могут возвращаться следующие значения:

source: Identifies the node on which the page resides.
ru: Номер узла, в котором расположена страница.

source: The page is mapped by multiple processes and can be moved only if B<MPOL_MF_MOVE_ALL> is specified.
ru: Страница отображается несколькими процессами и может быть перемещена только, если указан флаг B<MPOL_MF_MOVE_ALL>.

source: The page is currently busy and cannot be moved. Try again later. This occurs if a page is undergoing I/O or another kernel subsystem is holding a reference to the page.
ru: Страница в данный момент занята и не может быть перемещена. Попробуйте позднее. Такое случается, если со страницей выполняется операция ввода-вывода или другая подсистема ядра удерживается ссылку на эту страницу.

source: This is a zero page or the memory area is not mapped by the process.
ru: Это нулевая страница или область памяти не отображена процессом.

source: Unable to write back a page. The page has to be written back in order to move it since the page is dirty and the filesystem does not provide a migration function that would allow the move of dirty pages.
ru: Не удалось выполнить обратную запись на страницу. Для перемещения требуется выполнить обратную запись, так как данные страницы неактуальны (dirty), но файловая система не предоставляет функцию переноса (migration), которая позволила бы переместить неактуальные страницы.

source: A dirty page cannot be moved. The filesystem does not provide a migration function and has no ability to write back pages.
ru: Нельзя переместить неактуальные страницы. Файловая система не предоставляет функцию переноса (migration), поэтому нет возможности выполнить обратную запись на страницы.

source: The page is not present.
ru: Страница отсутствует.

source: Unable to allocate memory on target node.
ru: Не удалось выделить память на узле назначения.

source: On success B<move_pages>() returns zero. On error, it returns -1, and sets I<errno> to indicate the error.
ru: При нормальном завершении работы B<move_pages>() возвращает ноль. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Too many pages to move.
ru: Слишком много перемещаемых страниц.

source: One of the target nodes is not allowed by the current cpuset.
ru: Один из узлов назначения не разрешён для текущего набора ЦП.

source: Parameter array could not be accessed.
ru: Недоступен массив параметров.

source: Flags other than B<MPOL_MF_MOVE> and B<MPOL_MF_MOVE_ALL> was specified or an attempt was made to migrate pages of a kernel thread.
ru: Указаны флаги, отличные от B<MPOL_MF_MOVE> и B<MPOL_MF_MOVE_ALL>, или предпринята попытка переместить (migrate) страницы нити ядра.

source: One of the target nodes is not online.
ru: Один из узлов назначения недоступен (not online).

source: No pages were found that require moving. All pages are either already on the target node, not present, had an invalid address or could not be moved because they were mapped by multiple processes.
ru: Не найдены страницы, которые требуется переместить. Все страницы или уже на узле назначения, отсутствуют, имеют неправильный адрес, или не могут быть перемещены, так как отображены несколькими процессами.

source: The caller specified B<MPOL_MF_MOVE_ALL> without sufficient privileges (B<CAP_SYS_NICE>). Or, the caller attempted to move pages of a process belonging to another user but did not have privilege to do so (B<CAP_SYS_NICE>).
ru: Вызывающий указал флаг B<MPOL_MF_MOVE_ALL>, но у него не хватает привилегий (B<CAP_SYS_NICE>). Или вызывающий попытался переместить страницы процесса, принадлежащие другому пользователю, но не имеет привилегий для этого (B<CAP_SYS_NICE>).

source: Process does not exist.
ru: Процесс не существует.

source: B<move_pages>() first appeared on Linux in version 2.6.18.
ru: Вызов B<move_pages>() впервые появился в Linux в ядре версии 2.6.18.

source: This system call is Linux-specific.
ru: Данный вызов есть только в Linux.

source: For information on library support, see B<numa>(7).
ru: Информация о библиотеке доступна в B<numa>(7).

source: Use B<get_mempolicy>(2) with the B<MPOL_F_MEMS_ALLOWED> flag to obtain the set of nodes that are allowed by the current cpuset. Note that this information is subject to change at any time by manual or automatic reconfiguration of the cpuset.
ru: Используйте B<get_mempolicy>(2) с флагом B<MPOL_F_MEMS_ALLOWED> для получения набора узлов, которые доступны в текущем наборе ЦП. Заметим, что эта информация может измениться в любое время вручную или при автоматической перенастройке набора ЦП.

source: Use of this function may result in pages whose location (node) violates the memory policy established for the specified addresses (See B<mbind>(2)) and/or the specified process (See B<set_mempolicy>(2)). That is, memory policy does not constrain the destination nodes used by B<move_pages>().
ru: Использование этого вызова может привести к тому, что расположение страниц (на узле) нарушит политику памяти, установленную для заданных адресов (см. B<mbind>(2)) и/или заданного процесса (см. B<set_mempolicy>(2)). То есть политика памяти не ограничивает узлы назначения, используемые B<move_pages>().

source: The I<E<lt>numaif.hE<gt>> header is not included with glibc, but requires installing I<libnuma-devel> or a similar package.
ru: Заголовочный файл I<E<lt>numaif.hE<gt>> не включён в glibc, его можно найти в пакете с именем I<libnuma-devel> или подобным названием.

source: membarrier - issue memory barriers on a set of threads
ru: membarrier - задаёт барьеры памяти в наборе нитей

source: The B<membarrier>() system call helps reducing the overhead of the memory barrier instructions required to order memory accesses on multi-core systems. However, this system call is heavier than a memory barrier, so using it effectively is I<not> as simple as replacing memory barriers with this system call, but requires understanding of the details below.
ru: Системный вызов B<membarrier>() помогает сократить накладные расходы инструкций барьера памяти, которые требуются при доступе к памяти в многоядерных системах. Однако данный системный вызов затратнее чем барьер памяти, поэтому чтобы использовать его эффективно I<недостаточно> просто заменить им барьеры памяти, требуется понимание описанного далее.

source: Use of memory barriers needs to be done taking into account that a memory barrier always needs to be either matched with its memory barrier counterparts, or that the architecture's memory model doesn't require the matching barriers.
ru: При использовании барьеров памяти нужно принимать во внимание, что барьер памяти всегда должен или иметь противоположную сторону барьера, или что модель памяти архитектуры этого не требует.

source: There are cases where one side of the matching barriers (which we will refer to as "fast side") is executed much more often than the other (which we will refer to as "slow side"). This is a prime target for the use of B<membarrier>(). The key idea is to replace, for these matching barriers, the fast-side memory barriers by simple compiler barriers, for example:
ru: При работе бывает, что одна сторона барьера (которую будем называть «быстрой стороной») применяется чаще чем другая (которую будем называть «медленной стороной»). Это основная цель использования B<membarrier>(). Основная идея в замене этих барьеров: быстрые стороны барьеров — простыми барьерами компилятора:

source: and replace the slow-side memory barriers by calls to B<membarrier>().
ru: а медленные стороны барьеров — вызовами B<membarrier>().

source: This will add overhead to the slow side, and remove overhead from the fast side, thus resulting in an overall performance increase as long as the slow side is infrequent enough that the overhead of the B<membarrier>() calls does not outweigh the performance gain on the fast side.
ru: Это добавит накладных расходов к медленной стороне и удалит расходы у быстрой стороны, что в результате повысит общую производительность в зависимости от того, как часто используются вызовы B<membarrier>() у медленной стороны, из-за которой возникают издержки, и не перевесит ли это увеличение производительности быстрой стороны.

source: The I<cmd> argument is one of the following:
ru: Аргумент I<cmd> может принимать одно из следующих значений:

source: B<MEMBARRIER_CMD_QUERY> (since Linux 4.3)
ru: B<MEMBARRIER_CMD_QUERY> (начиная с Linux 4.3)

source: Query the set of supported commands. The return value of the call is a bit mask of supported commands. B<MEMBARRIER_CMD_QUERY>, which has the value 0, is not itself included in this bit mask. This command is always supported (on kernels where B<membarrier>() is provided).
ru: Запросить набор поддерживаемых команд. Возвращаемое вызовом значение представляет собой битовую маску поддерживаемых команд. Сама команда B<MEMBARRIER_CMD_QUERY> имеет значение 0 и не включается в эту маску. Данная команда поддерживается всегда (в ядрах с поддержкой B<membarrier>()).

source: B<MEMBARRIER_CMD_GLOBAL> (since Linux 4.16)
ru: B<MEMBARRIER_CMD_GLOBAL> (начиная с Linux 4.16)

source: Ensure that all threads from all processes on the system pass through a state where all memory accesses to user-space addresses match program order between entry to and return from the B<membarrier>() system call. All threads on the system are targeted by this command.
ru: Проверить, что все потоки всех процессов в системе прошли через состояние, где все доступы к памяти по адресам пространства пользователя соответствуют программному порядку между входом и возвратом из системного вызова B<membarrier>(). Все потоки в системе являются целью этой команды.

source: B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> (since Linux 4.16)
ru: B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> (начиная с Linux 4.16)

source: Execute a memory barrier on all running threads of all processes that previously registered with B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.
ru: Установить барьер памяти во всех выполняющихся нитях всех процессов, которые были ранее зарегистрированы с помощью B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.

source: Upon return from the system call, the calling thread has a guarantee that all running threads have passed through a state where all memory accesses to user-space addresses match program order between entry to and return from the system call (non-running threads are de facto in such a state). This guarantee is provided only for the threads of processes that previously registered with B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.
ru: После возврата из системного вызова вызвавшей нити гарантируется, что все выполняющиеся нити прошли через состояние, где все доступы к памяти по адресам пространства пользователя соответствуют программному порядку между входом и возвратом из системного вызова (не выполняющиеся нити уже в таком состоянии). Это гарантируется только для нитей процессов, которые были ранее зарегистрированы с помощью B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.

source: Given that registration is about the intent to receive the barriers, it is valid to invoke B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> from a process that has not employed B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.
ru: Учтите, что регистрация о намерении получать барьеры допускается вызовом B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> только из процесса, который не использовал B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>.

source: The "expedited" commands complete faster than the non-expedited ones; they never block, but have the downside of causing extra overhead.
ru: «Курируемые» (expedited) команды выполняются быстрее чем не курируемые; они никогда не блокируются, но на них приходятся дополнительные издержки.

source: B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED> (since Linux 4.16)
ru: B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED> (начиная с Linux 4.16)

source: Register the process's intent to receive B<MEMBARRIER_CMD_GLOBAL_EXPEDITED> memory barriers.
ru: Зарегистрировать намерение процесса получать барьеры памяти B<MEMBARRIER_CMD_GLOBAL_EXPEDITED>.

source: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED> (since Linux 4.14)
ru: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED> (начиная с Linux 4.14)

source: Execute a memory barrier on each running thread belonging to the same process as the calling thread.
ru: Применить барьер памяти на все выполняющиеся нити, принадлежащие тому же процессу, что и вызвавшая нить.

source: Upon return from the system call, the calling thread has a guarantee that all its running thread siblings have passed through a state where all memory accesses to user-space addresses match program order between entry to and return from the system call (non-running threads are de facto in such a state). This guarantee is provided only for threads in the same process as the calling thread.
ru: После возврата из системного вызова вызвавшей нити гарантируется, что все выполняющиеся, одноуровневые с ней нити прошли через состояние, где все доступы к памяти по адресам пространства пользователя соответствуют программному порядку между входом и возвратом из системного вызова (невыполняющиеся нити уже в таком состоянии). Это гарантируется только для нитей того же процесса, что и вызвавшая нить.

source: A process must register its intent to use the private expedited command prior to using it.
ru: Процессу нужно регистрировать своё намерение использовать частную курируемую команду до её использования.

source: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED> (since Linux 4.14)
ru: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED> (начиная с Linux 4.14)

source: Register the process's intent to use B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>.
ru: Зарегистрировать намерение процесса использовать B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>.

source: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> (since Linux 4.16)
ru: B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> (начиная с Linux 4.16)

source: In addition to providing the memory ordering guarantees described in B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, upon return from system call the calling thread has a guarantee that all its running thread siblings have executed a core serializing instruction. This guarantee is provided only for threads in the same process as the calling thread.
ru: В дополнении к гарантии упорядочивания памяти, описанной в B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, после возврата из системного вызова вызвавшей нити гарантируется, что все выполняющиеся, одноуровневые с ней нити выполнили ядерную инструкцию сериализации (core serializing instruction). Это гарантируется только для нитей того же процесса, что и вызвавшая нить.

source: The "expedited" commands complete faster than the non-expedited ones, they never block, but have the downside of causing extra overhead.
ru: «Курируемые» (expedited) команды выполняются быстрее чем не курируемые; они никогда не блокируются, но на них приходятся дополнительные издержки.

source: A process must register its intent to use the private expedited sync core command prior to using it.
ru: Процессу нужно регистрировать своё намерение использовать частную курируемую ядерную команду синхронизации до её использования.

source: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> (since Linux 4.16)
ru: B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> (начиная с Linux 4.16)

source: Register the process's intent to use B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE>.
ru: Зарегистрировать намерение процесса использовать B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE>.

source: B<MEMBARRIER_CMD_SHARED> (since Linux 4.3)
ru: B<MEMBARRIER_CMD_SHARED> (начиная с Linux 4.3)

source: This is an alias for B<MEMBARRIER_CMD_GLOBAL> that exists for header backward compatibility.
ru: Псевдоним B<MEMBARRIER_CMD_GLOBAL>, существует для обратной совместимости в заголовке.
