Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Unknown I<flags> were specified or B<MCL_ONFAULT> was specified without either B<MCL_FUTURE> or B<MCL_CURRENT>.
ru: Неизвестное значение в I<flags> или B<MCL_ONFAULT> задан без B<MCL_FUTURE> или B<MCL_CURRENT>.

source: For B<munlockall>():
ru: У B<munlockall>():

source: (Linux 2.6.8 and earlier) The caller was not privileged (B<CAP_IPC_LOCK>).
ru: (Linux 2.6.8 и более ранних) Вызывающий процесс не имеет достаточно прав (B<CAP_IPC_LOCK>).

source: B<mlock2>() is available since Linux 4.4; glibc support was added in version 2.27.
ru: Системный вызов B<mlock2>() появился в Linux 4.4; поддержка в glibc началась с версии 2.27.

source: mlock2 () is Linux specific.
ru: Функция mlock2() , определена только в Linux.

source: On POSIX systems on which B<mlock>() and B<munlock>() are available, B<_POSIX_MEMLOCK_RANGE> is defined in I<E<lt>unistd.hE<gt>> and the number of bytes in a page can be determined from the constant B<PAGESIZE> (if defined) in I<E<lt>limits.hE<gt>> or by calling I<sysconf(_SC_PAGESIZE)>.
ru: В POSIX-системах, в которых доступны B<mlock>() и B<munlock>(), значение B<_POSIX_MEMLOCK_RANGE> определено в I<E<lt>unistd.hE<gt>>, а количество байт в странице можно определить из константы B<PAGESIZE> (если определена) в I<E<lt>limits.hE<gt>> или вызвав I<sysconf(_SC_PAGESIZE)>.

source: On POSIX systems on which B<mlockall>() and B<munlockall>() are available, B<_POSIX_MEMLOCK> is defined in I<E<lt>unistd.hE<gt>> to a value greater than 0. (See also B<sysconf>(3).)
ru: В POSIX-системах, в которых доступны B<mlockall>() и B<munlockall>(), значение B<_POSIX_MEMLOCK>, определенное в I<E<lt>unistd.hE<gt>>, больше нуля (см. также B<sysconf>(3)).

source: Memory locking has two main applications: real-time algorithms and high-security data processing. Real-time applications require deterministic timing, and, like scheduling, paging is one major cause of unexpected program execution delays. Real-time applications will usually also switch to a real-time scheduler with B<sched_setscheduler>(2). Cryptographic security software often handles critical bytes like passwords or secret keys as data structures. As a result of paging, these secrets could be transferred onto a persistent swap store medium, where they might be accessible to the enemy long after the security software has erased the secrets in RAM and terminated. (But be aware that the suspend mode on laptops and some desktop computers will save a copy of the system's RAM to disk, regardless of memory locks.)
ru: Блокировка памяти используется, в основном, в двух случаях: в алгоритмах реального времени и при работе с секретными данными. Программам реального времени необходима предсказуемость времени выполнения, а страничный обмен (наряду с системой переключения процессов) может привести к неожиданным задержкам в работе. Такие приложения часто переключаются в режим реального времени при помощи вызовы B<sched_setscheduler>(2). Криптографические системы защиты данных очень часто содержат важные данные, например, пароли или секретные ключи, в структурах данных. В результате страничного обмена эти данные могут попасть в область подкачки, находящуюся на устройстве длительного хранения, где к этим данным после того, как они пропадут из ОЗУ, может получить доступ практически кто угодно. (Помните, что в режиме приостановки (suspend) на ноутбуках и некоторых компьютерах на жёсткий диск сохраняется копия памяти ОЗУ системы, независимо от блокировок памяти).

source: Real-time processes that are using B<mlockall>() to prevent delays on page faults should reserve enough locked stack pages before entering the time-critical section, so that no page fault can be caused by function calls. This can be achieved by calling a function that allocates a sufficiently large automatic variable (an array) and writes to the memory occupied by this array in order to touch these stack pages. This way, enough pages will be mapped for the stack and can be locked into RAM. The dummy writes ensure that not even copy-on-write page faults can occur in the critical section.
ru: Процессы реального времени, использующие B<mlockall>() для устранения задержек при страничных прерываниях (page fault), должны зарезервировать достаточно заблокированных страниц стека до входа в критический ко времени участок, для того, чтобы вызов функции не мог привести к страничному прерыванию. Это можно выполнить с помощью вызова функции, которая выделит место под достаточно большую автоматическую переменную (массив) и выполнит запись в память для того, чтобы этот массив занял место в странице стека. Таким путём будет отображено достаточно страниц для стека, которые можно заблокировать в ОЗУ. Бесполезная запись нужна для того, чтобы в критическом участке не возникло страничное прерывание для копирования страницы при записи.

source: Memory locks are not inherited by a child created via B<fork>(2) and are automatically removed (unlocked) during an B<execve>(2) or when the process terminates. The B<mlockall>() B<MCL_FUTURE> and B<MCL_FUTURE | MCL_ONFAULT> settings are not inherited by a child created via B<fork>(2) and are cleared during an B<execve>(2).
ru: Блокировка памяти не наследуется дочерними процессами, созданными при помощи B<fork>(2), и автоматически удаляется (разблокируется) при выполнении B<execve>(2) или при завершении работы процесса. Установка B<MCL_FUTURE> и B<MCL_FUTURE | MCL_ONFAULT> в B<mlockall>() не наследуется потомком, созданными при помощи B<fork>(2), и автоматически стирается при выполнении B<execve>(2).

source: Note that B<fork>(2) will prepare the address space for a copy-on-write operation. The consequence is that any write access that follows will cause a page fault that in turn may cause high latencies for a real-time process. Therefore, it is crucial not to invoke B<fork>(2) after an B<mlockall>() or B<mlock>() operation\(emnot even from a thread which runs at a low priority within a process which also has a thread running at elevated priority.
ru: Заметим, что that B<fork>(2) подготовит адресное пространство для операции копирования при записи. Следовательно, любой последующий доступ на запись приведёт к страничному отказу, который, в свою очередь, может привести к большим задержкам в процессах реального времени. Поэтому, существенно важно не вызывать B<fork>(2) после операции B<mlockall>() или B<mlock>() — даже для нитей, которые выполняются с низким приоритетом внутри процесса, который также имеет нить, выполняющуюся с более высоким приоритетом.

source: The memory lock on an address range is automatically removed if the address range is unmapped via B<munmap>(2).
ru: Блокировка памяти адресного диапазона автоматически удаляется, если этот диапазон становится неотображаемым с помощью вызова B<munmap>(2).

source: Memory locks do not stack, that is, pages which have been locked several times by calls to B<mlock>(), B<mlock2>(), or B<mlockall>() will be unlocked by a single call to B<munlock>() for the corresponding range or by B<munlockall>(). Pages which are mapped to several locations or by several processes stay locked into RAM as long as they are locked at least at one location or by at least one process.
ru: Блокировки памяти не накапливаются, то есть, если страница была заблокирована вызовами B<mlock>(), B<mlock2>() или B<mlockall>() несколько раз, то она будет разблокирована единственным вызовом B<munlock>() для соответствующего диапазона или с помощью вызова B<munlockall>(). Страницы, которые были отображены в несколько мест или несколькими процессами, останутся заблокированными в ОЗУ до тех пор, пока они блокируются хотя бы в одном месте или хотя бы в одном процессе.

source: If a call to B<mlockall>() which uses the B<MCL_FUTURE> flag is followed by another call that does not specify this flag, the changes made by the B<MCL_FUTURE> call will be lost.
ru: Если послед вызова B<mlockall>() с флагом B<MCL_FUTURE> идёт другой вызов, у которого нет этого флага, то изменения, сделанные вызовом с B<MCL_FUTURE> будут потеряны.

source: The B<mlock2>() B<MLOCK_ONFAULT> flag and the B<mlockall>() B<MCL_ONFAULT> flag allow efficient memory locking for applications that deal with large mappings where only a (small) portion of pages in the mapping are touched. In such cases, locking all of the pages in a mapping would incur a significant penalty for memory locking.
ru: Флаг B<MLOCK_ONFAULT> у B<mlock2>() и B<MCL_ONFAULT> у B<mlockall>() позволяют эффективно блокировать память в приложениях, которые работают с большим количеством отображений, где только задействуется часть (малая) страниц в отображении. В таких случаях блокировка всех страниц в отображении приводила бы к значительным простоям из-за блокировки памяти.

source: Under Linux, B<mlock>(), B<mlock2>(), and B<munlock>() automatically round I<addr> down to the nearest page boundary. However, the POSIX.1 specification of B<mlock>() and B<munlock>() allows an implementation to require that I<addr> is page aligned, so portable applications should ensure this.
ru: В Linux, B<mlock>(), B<mlock2>() и B<munlock>() автоматически округляют I<addr> в меньшую сторону к размеру границы ближайшей страницы. Однако, в POSIX.1 указано, что реализации B<mlock>() и B<munlock>() разрешено требовать, чтобы значение I<addr> было выровнено по размеру страницы, поэтому переносимые приложения должны выполнять выравнивание.

source: The I<VmLck> field of the Linux-specific I</proc/[pid]/status> file shows how many kilobytes of memory the process with ID I<PID> has locked using B<mlock>(), B<mlock2>(), B<mlockall>(), and B<mmap>(2) B<MAP_LOCKED>.
ru: В поле I<VmLck>, имеющемся только в Linux файле I</proc/[pid]/status>, показано сколько килобайт памяти заблокировал процесс с идентификатором I<PID> с помощью B<mlock>(), B<mlock2>(), B<mlockall>() и B<mmap>(2) с флагом B<MAP_LOCKED>.

source: Limits and permissions
ru: Ограничения и права доступа

source: In Linux 2.6.8 and earlier, a process must be privileged (B<CAP_IPC_LOCK>) in order to lock memory and the B<RLIMIT_MEMLOCK> soft resource limit defines a limit on how much memory the process may lock.
ru: В Linux версии 2.6.8 и более ранних для блокировки памяти процесс должен иметь мандат (B<CAP_IPC_LOCK>), а мягкое ограничение ресурса B<RLIMIT_MEMLOCK> определяет как много памяти можно заблокировать.

source: Since Linux 2.6.9, no limits are placed on the amount of memory that a privileged process can lock and the B<RLIMIT_MEMLOCK> soft resource limit instead defines a limit on how much memory an unprivileged process may lock.
ru: Начиная с Linux 2.6.9, привилегированный процесс не имеет ограничения на ограничиваемое количество памяти, а мягкое ограничение ресурса B<RLIMIT_MEMLOCK> определяет предел ограничиваемой памяти для непривилегированных процессов.

source: In Linux 4.8 and earlier, a bug in the kernel's accounting of locked memory for unprivileged processes (i.e., without B<CAP_IPC_LOCK>) meant that if the region specified by I<addr> and I<len> overlapped an existing lock, then the already locked bytes in the overlapping region were counted twice when checking against the limit. Such double accounting could incorrectly calculate a "total locked memory" value for the process that exceeded the B<RLIMIT_MEMLOCK> limit, with the result that B<mlock>() and B<mlock2>() would fail on requests that should have succeeded. This bug was fixed in Linux 4.9
ru: В Linux 4.8 и старее имеется дефект учёта блокированной памяти непривилегированных процессов (т. е., без B<CAP_IPC_LOCK>) в ядре, состоящий в том, что если область, указанная I<addr> и I<len> перекрывает существующую блокировку, то при проверке ограничений уже заблокированные байты перекрывающей области учитываются дважды. Из-за такого двойного учёта может некорректно вычисляться значение «общего количества заблокированной памяти», и процесс, который превышает ограничение B<RLIMIT_MEMLOCK>, в результате B<mlock>() и B<mlock2>() получит ошибку при запросах, которые должны выполняться успешно. Этот дефект был исправлен в Linux 4.9.

source: In the 2.4 series Linux kernels up to and including 2.4.17, a bug caused the B<mlockall>() B<MCL_FUTURE> flag to be inherited across a B<fork>(2). This was rectified in kernel 2.4.18.
ru: В ветви 2.4 ядер Linux до версии 2.4.17 включительно есть дефект, из-за которого флаг B<MCL_FUTURE> у B<mlockall>() наследуется при B<fork>(2). Он устранён в версии 2.4.18.

source: Since kernel 2.6.9, if a privileged process calls I<mlockall(MCL_FUTURE)> and later drops privileges (loses the B<CAP_IPC_LOCK> capability by, for example, setting its effective UID to a nonzero value), then subsequent memory allocations (e.g., B<mmap>(2), B<brk>(2)) will fail if the B<RLIMIT_MEMLOCK> resource limit is encountered.
ru: Начиная с ядра версии 2.6.9, если привилегированный процесс вызывает I<mlockall(MCL_FUTURE)> и, позднее, отказывается от прав (теряет мандат B<CAP_IPC_LOCK>, например, устанавливая свой эффективный UID в ненулевое значение), то последующие выделения памяти (например, с помощью B<mmap>(2), B<brk>(2)) будут завершаться с ошибкой при достижении предела ресурса B<RLIMIT_MEMLOCK>.

source: mremap - remap a virtual memory address
ru: mremap - изменяет отображение адреса виртуальной памяти

source: B<mremap>() expands (or shrinks) an existing memory mapping, potentially moving it at the same time (controlled by the I<flags> argument and the available virtual address space).
ru: Вызов B<mremap>() увеличивает (или уменьшает) размер существующего отображения памяти, при необходимости, перемещая его (это контролируется аргументом I<flags> и доступным виртуальным адресным пространством).

source: I<old_address> is the old address of the virtual memory block that you want to expand (or shrink). Note that I<old_address> has to be page aligned. I<old_size> is the old size of the virtual memory block. I<new_size> is the requested size of the virtual memory block after the resize. An optional fifth argument, I<new_address>, may be provided; see the description of B<MREMAP_FIXED> below.
ru: В I<old_address> указывается старый адрес блока виртуальной памяти, который вы хотите изменить. Заметим, что I<old_address> должен быть выровнен по границе страницы. В I<old_size> задаётся старый размер блока виртуальной памяти. В I<new_size> задаётся запрашиваемый размер блока виртуальной памяти после изменения. Описание необязательного пятого аргумента I<new_address> смотрите далее в параграфе о B<MREMAP_FIXED>.

source: If the value of I<old_size> is zero, and I<old_address> refers to a shareable mapping (see B<mmap>(2) B<MAP_SHARED>), then B<mremap>() will create a new mapping of the same pages. I<new_size> will be the size of the new mapping and the location of the new mapping may be specified with I<new_address>; see the description of B<MREMAP_FIXED> below. If a new mapping is requested via this method, then the B<MREMAP_MAYMOVE> flag must also be specified.
ru: Если значение I<old_size> равно нулю и I<old_address> указывает на общее отображение (смотрите B<mmap>(2) B<MAP_SHARED>), то B<mremap>() создаст новое отображение тех же страниц.Размер нового отображения будет равен значению I<new_size>, а расположение можно указать в I<new_address>; смотрите описание B<MREMAP_FIXED> далее. Если новое отображение запрашивается через этот метод, то также должен быть указан флаг B<MREMAP_MAYMOVE>.

source: In Linux the memory is divided into pages. A user process has (one or) several linear virtual memory segments. Each virtual memory segment has one or more mappings to real memory pages (in the page table). Each virtual memory segment has its own protection (access rights), which may cause a segmentation violation if the memory is accessed incorrectly (e.g., writing to a read-only segment). Accessing virtual memory outside of the segments will also cause a segmentation violation.
ru: В Linux память делится на страницы. Пользовательскому процессу выделяется один или несколько непрерывных сегментов виртуальной памяти. Каждый из этих сегментов имеет одно или несколько отображений в реальных страницах памяти (в таблице страниц). У каждого виртуального сегмента памяти есть своя защита (права доступа), которые можно нарушить, если произвести попытку некорректного доступа (например, записать информацию в сегмент, который доступен только для чтения). Доступ к виртуальной памяти за пределами сегментов также приводит к ошибке сегментации.

source: B<mremap>() uses the Linux page table scheme. B<mremap>() changes the mapping between virtual addresses and memory pages. This can be used to implement a very efficient B<realloc>(3).
ru: Вызов B<mremap>() использует схему табличных страниц Linux. B<mremap>() изменяет отображение между виртуальными адресами и страницами памяти. Это можно использовать при реализации очень эффективной функции B<realloc>(3).

source: The I<flags> bit-mask argument may be 0, or include the following flag:
ru: Аргумент битовой маски I<flags> может быть равен 0 или содержать следующие флаги:

source: By default, if there is not sufficient space to expand a mapping at its current location, then B<mremap>() fails. If this flag is specified, then the kernel is permitted to relocate the mapping to a new virtual address, if necessary. If the mapping is relocated, then absolute pointers into the old mapping location become invalid (offsets relative to the starting address of the mapping should be employed).
ru: По умолчанию, если для расширения отображения недостаточно пространства в текущем расположении, то вызов B<mremap>() завершается с ошибкой. Если указан флаг, то, если нужно, ядру разрешается переместить отображение на новый виртуальный адрес. Если отображение перемещено, то абсолютные указатели в старом расположении отображения становятся недействительными (должно быть выполнено смещение относительно начального адреса отображения).

source: B<MREMAP_FIXED> (since Linux 2.3.31)
ru: B<MREMAP_FIXED> (начиная с Linux 2.3.31)

source: This flag serves a similar purpose to the B<MAP_FIXED> flag of B<mmap>(2). If this flag is specified, then B<mremap>() accepts a fifth argument, I<void\ *new_address>, which specifies a page-aligned address to which the mapping must be moved. Any previous mapping at the address range specified by I<new_address> and I<new_size> is unmapped. If B<MREMAP_FIXED> is specified, then B<MREMAP_MAYMOVE> must also be specified.
ru: Этот флаг играет ту же роль, что и B<MAP_FIXED> для B<mmap>(2). Если указан этот флаг, то B<mremap>() учитывает пятый аргумент I<void\ *new_address>, в котором задан выровненный на страницу адрес, куда должно быть перемещено отображение. Все предыдущие отображения в адресном диапазоне, задаваемом I<new_address> и I<new_size>, удаляются. При указании B<MREMAP_FIXED> также должен быть указан B<MREMAP_MAYMOVE>.

source: If the memory segment specified by I<old_address> and I<old_size> is locked (using B<mlock>(2) or similar), then this lock is maintained when the segment is resized and/or relocated. As a consequence, the amount of memory locked by the process may change.
ru: Если сегмент памяти, указанный I<old_address> и I<old_size>, заблокирован (с помощью B<mlock>(2) или подобного вызова), то эта блокировка останется при изменении/перемещении сегмента. Следовательно, количество заблокированной процессом памяти может измениться.

source: On success B<mremap>() returns a pointer to the new virtual memory area. On error, the value B<MAP_FAILED> (that is, I<(void\ *)\ -1>) is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<mremap>() возвращается указатель на новую виртуальную область памяти. При ошибке, возвращается значение B<MAP_FAILED> (то есть I<(void\ *)\ -1>), а I<errno> устанавливается в соответствующее значение.

source: The caller tried to expand a memory segment that is locked, but this was not possible without exceeding the B<RLIMIT_MEMLOCK> resource limit.
ru: Вызывающий пытается расширить заблокированный сегмент памяти, но это невозможно без превышения предела ресурса B<RLIMIT_MEMLOCK>.

source: "Segmentation fault." Some address in the range I<old_address> to I<old_address>+I<old_size> is an invalid virtual memory address for this process. You can also get B<EFAULT> even if there exist mappings that cover the whole address space requested, but those mappings are of different types.
ru: «Ошибка сегментации (Segmentation fault).» Один из адресов в диапазоне от I<old_address> до I<old_address>+I<old_size> является некорректным адресом виртуальной памяти для этого процесса. Также вы можете получить B<EFAULT> даже если существующие отображения покрывают всё запрошенное адресное пространство, но имеют различные типы.

source: An invalid argument was given. Possible causes are:
ru: Указан недопустимый аргумент. Возможные причины:

source: I<old_address> was not page aligned;
ru: не выровнено значение адреса I<old_address>;

source: a value other than B<MREMAP_MAYMOVE> or B<MREMAP_FIXED> was specified in I<flags>;
ru: помимо B<MREMAP_MAYMOVE> или B<MREMAP_FIXED> в I<flags> указано что-то ещё;

source: I<new_size> was zero;
ru: значение I<new_size> равно нулю;

source: I<new_size> or I<new_address> was invalid;
ru: некорректное значение I<new_size> или I<new_address>;

source: the new address range specified by I<new_address> and I<new_size> overlapped the old address range specified by I<old_address> and I<old_size>;
ru: новый диапазон адресов, указанный I<new_address> и I<new_size>, перекрывает старый диапазон адресов, указанный I<old_address> и I<old_size>;

source: B<MREMAP_FIXED> was specified without also specifying B<MREMAP_MAYMOVE>;
ru: задан B<MREMAP_FIXED> без B<MREMAP_MAYMOVE>;

source: I<old_size> was zero and I<old_address> does not refer to a shareable mapping (but see BUGS);
ru: значение I<old_size> равно нулю и I<old_address> не указывает на общее отображение (но смотрите ДЕФЕКТЫ);

source: I<old_size> was zero and the B<MREMAP_MAYMOVE> flag was not specified.
ru: значение I<old_size> равно нулю и не указан флаг B<MREMAP_MAYMOVE>.

source: The memory area cannot be expanded at the current virtual address, and the B<MREMAP_MAYMOVE> flag is not set in I<flags>. Or, there is not enough (virtual) memory available.
ru: Область памяти не может быть расширена от текущего виртуального адреса и в I<flags> не указано значение B<MREMAP_MAYMOVE>. Или недостаточно свободной (виртуальной) памяти.

source: This call is Linux-specific, and should not be used in programs intended to be portable.
ru: Данный вызов существует только в Linux и не должен использоваться в программах, которые должны быть переносимыми.

source: Prior to version 2.4, glibc did not expose the definition of B<MREMAP_FIXED>, and the prototype for B<mremap>() did not allow for the I<new_address> argument.
ru: До версии 2.4, в glibc не был определён флаг B<MREMAP_FIXED>, а прототип B<mremap>() не позволял указывать аргумент I<new_address>.

source: If B<mremap>() is used to move or expand an area locked with B<mlock>(2) or equivalent, the B<mremap>() call will make a best effort to populate the new area but will not fail with B<ENOMEM> if the area cannot be populated.
ru: Если B<mremap>() используется для перемещения или расширения области, заблокированной B<mlock>(2) или эквивалентом, то вызов B<mremap>() постарается заполнить новую область, но не завершится с ошибкой B<ENOMEM>, если область невозможно заполнить.
