Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: The I<msg_prio> argument is a nonnegative integer that specifies the priority of this message. Messages are placed on the queue in decreasing order of priority, with newer messages of the same priority being placed after older messages with the same priority. See B<mq_overview>(7) for details on the range for the message priority.
ru: Значение аргумента I<msg_prio> представляет собой неотрицательное целое, которым определяется приоритет этого сообщения. Сообщения помещаются в очередь в порядке уменьшения приоритета, самые новые сообщения с одинаковым приоритетом размещаются после старых с тем же приоритетом. Описание диапазона приоритета сообщения смотрите в B<mq_overview>(7).

source: If the message queue is already full (i.e., the number of messages on the queue equals the queue's I<mq_maxmsg> attribute), then, by default, B<mq_send>() blocks until sufficient space becomes available to allow the message to be queued, or until the call is interrupted by a signal handler. If the B<O_NONBLOCK> flag is enabled for the message queue description, then the call instead fails immediately with the error B<EAGAIN>.
ru: Если очередь сообщений заполнена (т. е., количество сообщений в очереди равно атрибуту очереди I<mq_maxmsg>), то по умолчанию B<mq_send>() блокируется до появления места для записи сообщения, или пока вызов не будет прерван обработчиком сигнала. Если в описании очереди сообщений включён флаг B<O_NONBLOCK>, то вместо этого вызов сразу завершается с ошибкой B<EAGAIN>.

source: B<mq_timedsend>() behaves just like B<mq_send>(), except that if the queue is full and the B<O_NONBLOCK> flag is not enabled for the message queue description, then I<abs_timeout> points to a structure which specifies how long the call will block. This value is an absolute timeout in seconds and nanoseconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC), specified in the following structure:
ru: Функция B<mq_timedsend>() действует подобно B<mq_send>(), за исключением того, что если очередь пуста и в описании очереди сообщений не установлен флаг B<O_NONBLOCK>, то I<abs_timeout> указывает на структуру, в которой задаётся длительность блокировки вызова. Это абсолютное значение задаётся в секундах и наносекундах начиная с Эпохи, 1970-01-01 00:00:00 +0000 (UTC), в структуре вида:

source: If the message queue is full, and the timeout has already expired by the time of the call, B<mq_timedsend>() returns immediately.
ru: Если очередь сообщений полна и вышло время ожидания на момент вызова, то B<mq_timedsend>() сразу же завершается.

source: On success, B<mq_send>() and B<mq_timedsend>() return zero; on error, -1 is returned, with I<errno> set to indicate the error.
ru: При успешном выполнении B<mq_send>() и B<mq_timedsend>() возвращается ноль; при ошибке возвращается -1, а в I<errno> помещается код ошибки.

source: The queue was full, and the B<O_NONBLOCK> flag was set for the message queue description referred to by I<mqdes>.
ru: Очередь была полна и в описании очереди сообщений, на которое ссылается I<mqdes>, указан флаг B<O_NONBLOCK>.

source: The descriptor specified in I<mqdes> was invalid or not opened for writing.
ru: В I<mqdes> указан некорректный или не открытый на запись дескриптор.

source: I<msg_len> was greater than the I<mq_msgsize> attribute of the message queue.
ru: I<msg_len> больше, чем свойство очереди сообщений I<mq_msgsize>.

source: On Linux, B<mq_timedsend>() is a system call, and B<mq_send>() is a library function layered on top of that system call.
ru: В Linux B<mq_timedsend>() является системным вызовом, а B<mq_send>() — библиотечной функцией, реализованной на основе этого системного вызова:

source: mempcpy, wmempcpy - copy memory area
ru: mempcpy, wmempcpy — копирует участок памяти

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>string.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>string.hE<gt>>

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>wchar.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>wchar.hE<gt>>

source: The B<mempcpy>() function is nearly identical to the B<memcpy>(3) function. It copies I<n> bytes from the object beginning at I<src> into the object pointed to by I<dest>. But instead of returning the value of I<dest> it returns a pointer to the byte following the last written byte.
ru: Функция B<mempcpy>() почти идентична B<memcpy>(3). Она копирует I<n> байт из I<src> в I<dest>, но вместо возвращения значения I<dest>, она возвращает указатель на байт, следующий за последним записанным байтом.

source: This function is useful in situations where a number of objects shall be copied to consecutive memory positions.
ru: Она удобна если требуется скопировать несколько участков памяти в другой участок последовательно, чтобы они располагались в нем друг за другом.

source: The B<wmempcpy>() function is identical but takes I<wchar_t> type arguments and copies I<n> wide characters.
ru: B<wmempcpy>() делает тоже самое, но принимает I<wchar_t> тип аргументов и копирует I<n> широких символов.

source: B<mempcpy>() first appeared in glibc in version 2.1.
ru: Впервые B<mempcpy>() появилась в glibc версии 2.1.

source: This function is a GNU extension.
ru: Эта функция является расширением GNU.

source: The I<pad> argument specifies the amount of free space to leave untrimmed at the top of the heap. If this argument is 0, only the minimum amount of memory is maintained at the top of the heap (i.e., one page or less). A nonzero argument can be used to maintain some trailing space at the top of the heap in order to allow future allocations to be made without having to extend the heap with B<sbrk>(2).
ru: Аргумент I<pad> определяет размер свободного пространства, оставляемого на верху кучи. Если он 0, то поддерживается минимум памяти (одна страница или меньше). Если значение отлично от нуля, то освобождается пространство для будущего распределения без необходимости использовать B<sbrk>(2).

source: The B<malloc_trim>() function returns 1 if memory was actually released back to the system, or 0 if it was not possible to release any memory.
ru: B<malloc_trim>() возвращает 1 если память была освобождена, 0 если это не возможно.

source: No errors are defined.
ru: Ошибки не установлены.

source: This function is automatically called by B<free>(3) in certain circumstances; see the discussion of B<M_TOP_PAD> and B<M_TRIM_THRESHOLD> in B<mallopt>(3).
ru: Эта функция автоматически вызывается функцией B<free>(3) в определенных обстоятельствах. Смотрите обсуждение B<M_TOP_PAD> и B<M_TRIM_THRESHOLD> в B<mallopt>(3).

source: mbrtowc - convert a multibyte sequence to a wide character
ru: mbrtowc - преобразовывает мультибайтовую последовательность в широкий символ

source: The main case for this function is when I<s> is not NULL and I<pwc> is not NULL. In this case, the B<mbrtowc>() function inspects at most I<n> bytes of the multibyte string starting at I<s>, extracts the next complete multibyte character, converts it to a wide character and stores it at I<*pwc>. It updates the shift state I<*ps>. If the converted wide character is not L\(aq\e0\(aq (the null wide character), it returns the number of bytes that were consumed from I<s>. If the converted wide character is L\(aq\e0\(aq, it resets the shift state I<*ps> to the initial state and returns 0.
ru: В основном, функция предназначена для работы, когда I<s> и I<pwc> не равны NULL. В этом случае функция B<mbrtowc>() просматривает не более I<n> байт многобайтовой строки, начинающейся с I<s>, извлекает следующий полный многобайтовый символ, преобразует его в широкий символ и сохраняет его в I<*pwc>. При этом обновляется состояние сдвига I<*ps>. Если преобразованный широкий символ не равен L\(aq\e0\(aq (широкий символ null), то возвращается количество байт, которое было выбрано из I<s>. Если преобразованный широкий символ равен L\(aq\e0\(aq, то состояние сдвига I<*ps> сбрасывается в начальное состояние и возвращается 0.

source: If the I<n> bytes starting at I<s> do not contain a complete multibyte character, B<mbrtowc>() returns I<(size_t)\ -2>. This can happen even if I<n> E<gt>= I<MB_CUR_MAX>, if the multibyte string contains redundant shift sequences.
ru: Если в I<n> байтах, начиная с I<s>, не содержится полного многобайтового символа, то B<mbrtowc>() возвращает I<(size_t)\ -2>. Это может произойти даже, если I<n> E<gt>= I<MB_CUR_MAX>, если в многобайтовой строке содержится лишние сдвиговые последовательности.

source: If the multibyte string starting at I<s> contains an invalid multibyte sequence before the next complete character, B<mbrtowc>() returns I<(size_t)\ -1> and sets I<errno> to B<EILSEQ>. In this case, the effects on I<*ps> are undefined.
ru: Если многобайтовая строка, начинающаяся с I<s>, содержит некорректную многобайтовую последовательность до следующего полного символа, то B<mbrtowc>() возвращает I<(size_t)\ -1> и присваивает I<errno> значение B<EILSEQ>. В этом случае влияние на I<*ps> не определено.

source: A different case is when I<s> is not NULL but I<pwc> is NULL. In this case, the B<mbrtowc>() function behaves as above, except that it does not store the converted wide character in memory.
ru: Ещё случай, когда I<s> не равно NULL, а I<pwc> равно NULL. В этом случае функция B<mbrtowc>() действует как описано выше, но не сохраняет преобразованный широкий символ в памяти.

source: A third case is when I<s> is NULL. In this case, I<pwc> and I<n> are ignored. If the conversion state represented by I<*ps> denotes an incomplete multibyte character conversion, the B<mbrtowc>() function returns I<(size_t)\ -1>, sets I<errno> to B<EILSEQ>, and leaves I<*ps> in an undefined state. Otherwise, the B<mbrtowc>() function puts I<*ps> in the initial state and returns 0.
ru: И третий случай, когда I<s> равно NULL. В этом случае I<pwc> и I<n> игнорируются. Если состояние преобразования, представляемое I<*ps> означает неполный многобайтовый символ, то функция B<mbrtowc>() возвращает I<(size_t)\ -1>, присваивает I<errno> значение B<EILSEQ> и оставляет I<*ps> в неопределённом состоянии. Иначе функция B<mbrtowc>() изменяет I<*ps> в начальное состояние и возвращает 0.

source: In all of the above cases, if I<ps> is NULL, a static anonymous state known only to the B<mbrtowc>() function is used instead. Otherwise, I<*ps> must be a valid I<mbstate_t> object. An I<mbstate_t> object I<a> can be initialized to the initial state by zeroing it, for example using
ru: Во всех вышеперечисленных случаях, если I<ps> равно NULL, то используется статическое анонимное состояние, известное только функции B<mbrtowc>(). Иначе I<*ps> должен быть корректным объектом I<mbstate_t>. Объект I<mbstate_t> I<a> может быть переведён в начальное состояние, если его обнулить, например с помощью

source: The B<mbrtowc>() function returns the number of bytes parsed from the multibyte sequence starting at I<s>, if a non-L\(aq\e0\(aq wide character was recognized. It returns 0, if a L\(aq\e0\(aq wide character was recognized. It returns I<(size_t)\ -1> and sets I<errno> to B<EILSEQ>, if an invalid multibyte sequence was encountered. It returns I<(size_t)\ -2> if it couldn't parse a complete multibyte character, meaning that I<n> should be increased.
ru: Функция B<mbrtowc>() возвращает количество байт, просмотренных в многобайтовой последовательности, начинающейся с I<s>, если при этом был получен широкий символ не равный L\(aq\e0\(aq. Она возвращает 0, если был получен широкий символ L\(aq\e0\(aq. Она возвращает I<(size_t)\ -1> и присваивает I<errno> значение B<EILSEQ>, если встречена некорректная многобайтовая последовательность. Она возвращает I<(size_t)\ -2>, если не удалось найти полную многобайтовую последовательность, что означает, что I<n> должно быть увеличено.

source: The behavior of B<mbrtowc>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mbrtowc>() зависит от категории B<LC_CTYPE> текущей локали.

source: memccpy - copy memory area
ru: memccpy - копирование участка памяти

source: The B<memccpy>() function copies no more than I<n> bytes from memory area I<src> to memory area I<dest>, stopping when the character I<c> is found.
ru: Функция B<memccpy>() копирует не более I<n> байт из участка памяти I<src> в участок памяти I<dest>, останавливаясь, если найдётся символ I<c>.

source: If the memory areas overlap, the results are undefined.
ru: Если области памяти перекрываются, то результаты не определены.

source: The B<memccpy>() function returns a pointer to the next character in I<dest> after I<c>, or NULL if I<c> was not found in the first I<n> characters of I<src>.
ru: Функция B<memccpy>() возвращает указатель на следующий символ в I<dest> после I<c>, или NULL, если I<c> не найден в первых I<n> символах I<src>.

source: mblen - determine number of bytes in next multibyte character
ru: mblen - вычисляет количество байтов в следующем многобайтовом символе

source: If I<s> is not NULL, the B<mblen>() function inspects at most I<n> bytes of the multibyte string starting at I<s> and extracts the next complete multibyte character. It uses a static anonymous shift state known only to the B<mblen>() function. If the multibyte character is not the null wide character, it returns the number of bytes that were consumed from I<s>. If the multibyte character is the null wide character, it returns 0.
ru: Если I<s> не равно NULL, то функция B<mblen>() просматривает не более I<n> байт в многобайтовой строке, начинающейся с I<s> и извлекает следующий полный многобайтовый символ. Изменяется анонимное состояние сдвига, известное только функции B<mblen>(). Если многобайтовый символ не является широким символом null, то возвращается количество байт, которые использовались из I<s>. Если многобайтовый символ является широким символом null, то возвращается 0.

source: If the I<n> bytes starting at I<s> do not contain a complete multibyte character, B<mblen>() returns -1. This can happen even if I<n> is greater than or equal to I<MB_CUR_MAX>, if the multibyte string contains redundant shift sequences.
ru: Если в I<n> байтах, начиная с I<s>, не содержится полного многобайтового символа, то B<mblen>() возвращает -1. Это может произойти даже, если I<n> больше или равно I<MB_CUR_MAX>, если в многобайтовой строке содержится лишние сдвиговые последовательности.

source: If the multibyte string starting at I<s> contains an invalid multibyte sequence before the next complete character, B<mblen>() also returns -1.
ru: Если многобайтовая строка, начинающаяся с I<s>, содержит некорректную многобайтовую последовательность до следующего полного символа, то B<mblen>() также возвращает -1.

source: If I<s> is NULL, the B<mblen>() function resets the shift state, known to only this function, to the initial state, and returns nonzero if the encoding has nontrivial shift state, or zero if the encoding is stateless.
ru: Если значение I<s> равно NULL, то функция B<mblen>() обнуляет состояние сдвига (известное только этой функции), переводя его начальное положение, и возвращает ненулевое значение, если кодировка имеет необычное состояние сдвига; ноль будет возвращён, если кодировка не имеет сдвига.

source: The B<mblen>() function returns the number of bytes parsed from the multibyte sequence starting at I<s>, if a non-null wide character was recognized. It returns 0, if a null wide character was recognized. It returns -1, if an invalid multibyte sequence was encountered or if it couldn't parse a complete multibyte character.
ru: Функция B<mblen>() возвращает количество байт, просмотренных в многобайтовой последовательности, начинающейся с I<s>, если при этом был распознан широкий символ не равный null. Она возвращает 0, если был получен широкий символ null. Она возвращает -1, если встречена некорректная многобайтовая последовательность или если невозможно найти полный многобайтовый символ.

source: The behavior of B<mblen>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mblen>() зависит от категории B<LC_CTYPE> текущей локали.

source: The function B<mbrlen>(3) provides a better interface to the same functionality.
ru: Функция B<mbrlen>(3) предоставляет лучший интерфейс с теми же возможностями.

source: mbsrtowcs - convert a multibyte string to a wide-character string
ru: mbsrtowcs - преобразует многобайтовую строку в строку широких символов

source: If I<dest> is not NULL, the B<mbsrtowcs>() function converts the multibyte string I<*src> to a wide-character string starting at I<dest>. At most I<len> wide characters are written to I<dest>. The shift state I<*ps> is updated. The conversion is effectively performed by repeatedly calling I<mbrtowc(dest, *src, n, ps)> where I<n> is some positive number, as long as this call succeeds, and then incrementing I<dest> by one and I<*src> by the number of bytes consumed. The conversion can stop for three reasons:
ru: Если I<dest> не равно NULL, то функция B<mbsrtowcs>() преобразует многобайтовую строку I<*src> в строку широких символов, начинающуюся с I<dest>. В I<dest> будет записано не более I<len> символов. Обновляется состояние сдвига I<*ps>. Эффективное выполнение преобразования осуществляется повторяющимися вызовами I<mbrtowc(dest, *src, n, ps)>, где I<n> — некое положительное число, и пока вызов завершается успешно, увеличивая I<dest> на единицу и I<*src> на количество использованных байт. Преобразование может остановиться по трём причинам:

source: An invalid multibyte sequence has been encountered. In this case, I<*src> is left pointing to the invalid multibyte sequence, I<(size_t)\ -1> is returned, and I<errno> is set to B<EILSEQ>.
ru: Во входных данных обнаружена неправильная многобайтовая последовательность. В этом случае I<*src> по-прежнему указывает на неправильную многобайтовую последовательность, возвращается I<(size_t)\ -1> и I<errno> присваивается B<EILSEQ>.

source: I<len> non-L\(aq\e0\(aq wide characters have been stored at I<dest>. In this case, I<*src> is left pointing to the next multibyte sequence to be converted, and the number of wide characters written to I<dest> is returned.
ru: В I<dest> было сохранено I<len> не равных L\(aq\e0\(aq широких символов. В этом случае I<*src> продолжит указывать на следующую непреобразованную многобайтовую последовательность и будет возвращено количество широких символов, записанных в I<dest>.

source: The multibyte string has been completely converted, including the terminating null wide character (\(aq\e0\(aq), which has the side effect of bringing back I<*ps> to the initial state. In this case, I<*src> is set to NULL, and the number of wide characters written to I<dest>, excluding the terminating null wide character, is returned.
ru: Многобайтовая строка была полностью преобразована, включая завершающий широкий символ null (\(aq\e0\(aq) (побочный эффект: I<*ps> возвращается в начальное состояние). В этом случае I<*src> устанавливается равным NULL и возвращается количество широких символов, записанных в I<dest>, не считая завершающего широкого символа null.

source: If I<dest> is NULL, I<len> is ignored, and the conversion proceeds as above, except that the converted wide characters are not written out to memory, and that no length limit exists.
ru: Если значение I<dest> равно NULL, то I<len> игнорируется и преобразование выполняется как описано выше, исключая то, что преобразованные широкие символы не записываются в память и нет ограничения по длине.

source: In both of the above cases, if I<ps> is NULL, a static anonymous state known only to the B<mbsrtowcs>() function is used instead.
ru: В обоих перечисленных случаях, если I<ps> равно NULL, то используется статическое анонимное состояние, известное только функции B<mbsrtowcs>().

source: The programmer must ensure that there is room for at least I<len> wide characters at I<dest>.
ru: Программист должен проверить, что в I<dest> есть место по крайней мере для I<len> широких символов.

source: The B<mbsrtowcs>() function returns the number of wide characters that make up the converted part of the wide-character string, not including the terminating null wide character. If an invalid multibyte sequence was encountered, I<(size_t)\ -1> is returned, and I<errno> set to B<EILSEQ>.
ru: Функция B<mbsrtowcs>() возвращает количество широких символов, которые составили преобразованную часть широкосимвольной строки, не включая конечный широкий символ null. Если обнаружена некорректная многобайтовая последовательность, то возвращается I<(size_t)\ -1>, а I<errno> присваивается B<EILSEQ>.

source: The behavior of B<mbsrtowcs>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mbsrtowcs>() зависит от категории B<LC_CTYPE> текущей локали.

source: Passing NULL as I<ps> is not multithread safe.
ru: Передавать NULL в качестве I<ps> небезопасно при работе с нитями.

source: malloc_info - export malloc state to a stream
ru: malloc_info - экспортирует состояние malloc в поток

source: The B<malloc_info>() function exports an XML string that describes the current state of the memory-allocation implementation in the caller. The string is printed on the file stream I<stream>. The exported string includes information about all arenas (see B<malloc>(3)).
ru: Функция B<malloc_info>() экспортирует строку XML, описывающую текущее состояние реализации выделения памяти вызывающего. Строка печатается в файловый поток I<stream>. В экспортируемой строке содержится информация о всех областях (arenas) (смотрите B<malloc>(3)).

source: As currently implemented, I<options> must be zero.
ru: В текущей реализации значение I<options> должно быть равно нулю.

source: On success, B<malloc_info>() returns 0; on error, it returns -1, with I<errno> set to indicate the cause.
ru: При успешном выполнении B<malloc_info>() возвращается 0; при ошибке возвращается -1, а в I<errno> помещается код ошибки.

source: I<options> was nonzero.
ru: Значение I<options> не равно.

source: B<malloc_info>() was added to glibc in version 2.10.
ru: Функция B<malloc_info>() впервые появилась в glibc 2.10.

source: The memory-allocation information is provided as an XML string (rather than a C structure) because the information may change over time (according to changes in the underlying implementation). The output XML string includes a version field.
ru: Информация о выделении памяти предоставляется в виде строки XML (а не в структуре C), так как структура со временем может меняться (при изменении в реализации). Возвращаемая строка XML содержит поле версии.

source: The B<open_memstream>(3) function can be used to send the output of B<malloc_info>() directly into a buffer in memory, rather than to a file.
ru: Для отправки вывода B<malloc_info>() в буфер памяти, а не в файл можно использовать функцию B<open_memstream>(3).

source: The B<malloc_info>() function is designed to address deficiencies in B<malloc_stats>(3) and B<mallinfo>(3).
ru: Функция B<malloc_info>() разработана для компенсации нехватки данных из B<malloc_stats>(3) и B<mallinfo>(3).
