Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: The I<mountflags> and I<data> arguments should match the values used in the original B<mount>() call, except for those parameters that are being deliberately changed.
ru: Аргументы I<mountflags> и I<data> должны совпадать со значениями, используемыми в первоначальном вызове B<mount>(), за исключением параметров, которые были преднамеренно изменены.

source: The following I<mountflags> can be changed: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (whose effect is to clear the B<MS_NOATIME> and B<MS_RELATIME> flags), and B<MS_SYNCHRONOUS>. Attempts to change the setting of the B<MS_DIRSYNC> and B<MS_SILENT> flags during a remount are silently ignored. Note that changes to per-superblock flags are visible via all mount points of the associated filesystem (because the per-superblock flags are shared by all mount points).
ru: В I<mountflags> можно изменять: B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_NOATIME>, B<MS_NODEV>, B<MS_NODIRATIME>, B<MS_NOEXEC>, B<MS_NOSUID>, B<MS_RELATIME>, B<MS_RDONLY>, B<MS_STRICTATIME> (стирает флаги B<MS_NOATIME> и B<MS_RELATIME>) и B<MS_SYNCHRONOUS>. Попытка изменить флаги B<MS_DIRSYNC> и B<MS_SILENT> при перементировании игнорируется без ошибки. Заметим, что изменения флагов суперблока видимы на всех точках монтирования файловой системы (так как флаги суперблока едины для всех точек монтирования).

source: Since Linux 3.17, if none of B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>, or B<MS_STRICTATIME> is specified in I<mountflags>, then the remount operation preserves the existing values of these flags (rather than defaulting to B<MS_RELATIME>).
ru: Начиная с Linux 3.17, если не одно из значений B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>, или B<MS_STRICTATIME> не указано в I<mountflags> , то при перемонтировании сохраняются текущие значения этих флагов (а не изменяются на значение по умолчанию B<MS_RELATIME>).

source: will make access through this mountpoint read-only, without affecting other mount points.
ru: будет обеспечен доступ к этой точке монтирования в режиме только для чтения, без изменения других точек монтирования.

source: Creating a bind mount
ru: Создание привязки монтирования

source: If I<mountflags> includes B<MS_BIND> (available since Linux 2.4), then perform a bind mount. A bind mount makes a file or a directory subtree visible at another point within the single directory hierarchy. Bind mounts may cross filesystem boundaries and span B<chroot>(2) jails.
ru: Если I<mountflags> содержит B<MS_BIND> (доступен, начиная с Linux 2.4), то выполняется привязка монтирования. Привязка монтирования делает видимым файл или поддерево каталогов в другой точке внутри одной иерархии каталогов. Привязки монтирования могут быть в разных файловых системах и перекрывают заключения B<chroot>(2).

source: The I<filesystemtype> and I<data> arguments are ignored.
ru: Аргументы I<filesystemtype> и I<data> игнорируются.

source: The remaining bits (other than B<MS_REC>, described below) in the I<mountflags> argument are also ignored. (The bind mount has the same mount options as the underlying mount point.) However, see the discussion of remounting above, for a method of making an existing bind mount read-only.
ru: Остальные биты (кроме B<MS_REC>, описано ниже) в аргументе I<mountflags> также игнорируются. Однако посмотрите обсуждение перемонтирования, представленное выше, о том, как сделать существующую привязку монтирования доступной только для чтения.

source: By default, when a directory is bind mounted, only that directory is mounted; if there are any submounts under the directory tree, they are not bind mounted. If the B<MS_REC> flag is also specified, then a recursive bind mount operation is performed: all submounts under the I<source> subtree (other than unbindable mounts) are also bind mounted at the corresponding location in the I<target> subtree.
ru: По умолчанию, когда каталогу назначена привязка монтирования, монтируется только этот каталог; если существуют другие подмонтирования в дереве каталогов, то им не назначается привязка монтирования. Если также указан флаг B<MS_REC>, то выполняется операция рекурсивной привязки монтирования: всем подмонтированиям в поддереве I<source> (отличным от непривязываемых монтирований) также назначается привязка монтирования в соответствующее расположение к поддереве I<target>.

source: Changing the propagation type of an existing mount
ru: Изменение типа распространения существующего монтирования

source: If I<mountflags> includes one of B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE> (all available since Linux 2.6.15), then the propagation type of an existing mount is changed. If more than one of these flags is specified, an error results.
ru: Если I<mountflags> содержит один из флагов B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, или B<MS_UNBINDABLE> (все доступны начиная с Linux 2.6.15), то тип распространения существующего монтирования изменяется. Если указано сразу несколько из этих флагов, то возвращается ошибка.

source: The only other flags that can be specified while changing the propagation type are B<MS_REC> (described below) and B<MS_SILENT> (which is ignored).
ru: При смене типа распространения можно изменять только флаги B<MS_REC> (описан ниже) и B<MS_SILENT> (игнорируется).

source: The I<source>, I<filesystemtype>, and I<data> arguments are ignored.
ru: Аргументы I<source>, I<filesystemtype> и I<data> игнорируются.

source: The meanings of the propagation type flags are as follows:
ru: Назначение флагов типа распространения следующее:

source: Make this mount point shared. Mount and unmount events immediately under this mount point will propagate to the other mount points that are members of this mount's peer group. Propagation here means that the same mount or unmount will automatically occur under all of the other mount points in the peer group. Conversely, mount and unmount events that take place under peer mount points will propagate to this mount point.
ru: Делает эту точку монтирования общей. События монтирования и размонтирования этой точки сразу же распространяются на другие точки монтирования, являющиеся членами её равноправной группы. Распространение здесь означает, что монтирование или размонтирование автоматически происходит и у всех остальных точек монтирования в равноправной группе. И наоборот, события монтирования и размонтирования, возникшие у точек монтирования равноправной группы, будут распространены и на эту точку монтирования.

source: Make this mount point private. Mount and unmount events do not propagate into or out of this mount point.
ru: События монтирования и размонтирования не распространяются в эту точку и от этой точки.

source: If this is a shared mount point that is a member of a peer group that contains other members, convert it to a slave mount. If this is a shared mount point that is a member of a peer group that contains no other members, convert it to a private mount. Otherwise, the propagation type of the mount point is left unchanged.
ru: Если это общая точка монтирования, которая является членом непустой равноправной группы, то она преобразуется в подчинённую точку монтирования. Если это общая точка монтирования, которая является членом пустой равноправной группы, то она преобразуется в индивидуальную точку. В противном случае тип распространения точки монтирования не изменяется.

source: When a mount point is a slave, mount and unmount events propagate into this mount point from the (master) shared peer group of which it was formerly a member. Mount and unmount events under this mount point do not propagate to any peer.
ru: Если точка монтирования подчинённая, то события монтирования и размонтирования распространяются на эту точку монтирования из (главной) общей равноправной группы, в которую она раньше входила. События монтирования и размонтирования этой точки не распространяются на членов группы.

source: A mount point can be the slave of another peer group while at the same time sharing mount and unmount events with a peer group of which it is a member.
ru: Точка монтирования может быть подчинённой одной равноправной группе и в тоже время может распространять события в другую группу, где она является членом.

source: Make this mount unbindable. This is like a private mount, and in addition this mount can't be bind mounted. When a recursive bind mount (B<mount>() with the B<MS_BIND> and B<MS_REC> flags) is performed on a directory subtree, any unbindable mounts within the subtree are automatically pruned (i.e., not replicated) when replicating that subtree to produce the target subtree.
ru: Делает эту точку монтирования непривязываемой. Она подобна индивидуальной точке монтирования плюс недоступна привязка монтирования. При рекурсивной привязке (B<mount>() с флагами B<MS_BIND> и B<MS_REC>) в поддереве каталога все непривязываемые монтирования внутри поддерева автоматически удаляются (т. е., не копируются) при копировании этого поддерева для создания целевого поддерева.

source: By default, changing the propagation type affects only the I<target> mount point. If the B<MS_REC> flag is also specified in I<mountflags>, then the propagation type of all mount points under I<target> is also changed.
ru: По умолчанию, изменение типа распространения касается только I<target> точки монтирования. Если в I<mountflags> также указан флаг B<MS_REC>, то тип распространения всех точек монтирования ниже I<target> также изменяется.

source: For further details regarding mount propagation types (including the default propagation type assigned to new mounts), see B<mount_namespaces>(7).
ru: Дополнительную информацию по типам распространения монтирования (включая тип распространения по умолчанию, назначаемый новым точкам монтирования) смотрите в B<mount_namespaces>(7).

source: Moving a mount
ru: Перемещение точки монтирования

source: If I<mountflags> contains the flag B<MS_MOVE> (available since Linux 2.4.18), then move a subtree: I<source> specifies an existing mount point and I<target> specifies the new location to which that mount point is to be relocated. The move is atomic: at no point is the subtree unmounted.
ru: Если в I<mountflags> содержится флаг B<MS_MOVE> (доступен, начиная с Linux 2.4.18), то перемещается поддерево: в I<source> задаётся существующая точка монтирования, а I<target> указывается новое расположение, в которое будет перемещена точка монтирования. Перемещение атомарно: поддерево всегда смонтировано.

source: The remaining bits in the I<mountflags> argument are ignored, as are the I<filesystemtype> and I<data> arguments.
ru: Оставшиеся биты в аргументе I<mountflags> игнорируются, как и аргументы I<filesystemtype> и I<data>.

source: Creating a new mount point
ru: Создание новой точки монтирования

source: If none of B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE> is specified in I<mountflags>, then B<mount>() performs its default action: creating a new mount point. I<source> specifies the source for the new mount point, and I<target> specifies the directory at which to create the mount point.
ru: В том случае, если ни одно из значений B<MS_REMOUNT>, B<MS_BIND>, B<MS_MOVE>, B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, или B<MS_UNBINDABLE> не указано в I<mountflags>, вызов B<mount>() выполняет действие по умолчанию: создаёт новую точку монтирования. В I<source> задаётся источник новой точки монтирования, а значение I<target> указывает каталог, в котором будет создана точка монтирования.

source: The I<filesystemtype> and I<data> arguments are employed, and further bits may be specified in I<mountflags> to modify the behavior of the call.
ru: Используются аргументы I<filesystemtype> и I<data>, дополнительные параметры для изменения поведения могут быть указаны в I<mountflags>.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The error values given below result from filesystem type independent errors. Each filesystem type may have its own special errors and its own special behavior. See the Linux kernel source code for details.
ru: Коды ошибок, описанные ниже, не зависят от типа файловой системы. У каждой файловой системы могут быть свои коды ошибок и своё собственное поведение. Подробности смотрите в исходном коде ядра Linux.

source: A component of a path was not searchable. (See also B<path_resolution>(7).)
ru: Поиск запрещён из-за одной части пути, которая не доступна для просмотра и поиск (см. подробнее в B<path_resolution>(7)).

source: Mounting a read-only filesystem was attempted without giving the B<MS_RDONLY> flag.
ru: Было предпринята попытка монтирования файловой системы доступной только на чтение, но без флага B<ms_rdonly>.

source: The file system may be read-only for various reasons, including: it resides on a read-only optical disk; it is resides on a device with a physical switch that has been set to mark the device read-only; the filesystem implementation was compiled with read-only support; or errors were detected when initially mounting the filesystem, so that it was marked read-only and can't be remounted as read-write (until the errors are fixed).
ru: Файловая система может быть доступна только для чтения по разным причинам: она расположена на оптическом диске, доступном только для чтения; она располагается на устройстве с физической коммутацией, которое было отмечено как доступное только для чтения; реализация файловой системы скомпилирована с поддержкой только на чтение; обнаружены ошибки при первоначальном монтировании файловой системы, из-за чего она была помечена как доступная только для чтения и её невозможно перемонтировать как доступную для чтения/записи (пока не будут исправлены ошибки).

source: Some filesystems instead return the error B<EROFS> on an attempt to mount a read-only filesystem.
ru: При попытке монтирования файловой системы только для чтениянекоторые файловые системы вместо этого возвращают ошибку B<EROFS>.

source: The block device I<source> is located on a filesystem mounted with the B<MS_NODEV> option.
ru: Блочное устройство I<source> расположено в файловой системе, которая смонтирована с параметром B<MS_NODEV>.

source: An attempt was made to stack a new mount directly on top of an existing mount point that was created in this mount namespace with the same I<source> and I<target>.
ru: Попытка выполнить новое монтирование непосредственно поверх существующей точки монтирования, которая была создана в этом пространстве имён монтирования с тем же I<источником> и I<назначением>.

source: I<source> cannot be remounted read-only, because it still holds files open for writing.
ru: I<source> не может быть перемонтирован с доступом только на чтение, потому что он все ещё содержит файлы, открытые для записи.

source: One of the pointer arguments points outside the user address space.
ru: Один из аргументов-указателей указывает на каталог за пределами пользовательского адресного пространства.

source: I<source> had an invalid superblock.
ru: I<источник> имеет недоступный суперблок.

source: A remount operation (B<MS_REMOUNT>) was attempted, but I<source> was not already mounted on I<target>.
ru: Была предпринята попытка перемонтирования (B<MS_REMOUNT>), но I<source> еще не был смонтирован в I<target>.

source: A move operation (B<MS_MOVE>) was attempted, but I<source> was not a mount point, or was \(aq/\(aq.
ru: Была предпринята попытка перемещения (B<MS_MOVE>), но I<source> не являлся точкой монтирования или был \(aq/\(aq.

source: I<mountflags> includes more than one of B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE>.
ru: I<mountflags> включает более одного значения из B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, или B<MS_UNBINDABLE>.

source: I<mountflags> includes B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE> and also includes a flag other than B<MS_REC> or B<MS_SILENT>.
ru: I<mountflags> включает B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, или B<MS_UNBINDABLE> а также включает флаг, отличный от B<MS_REC> или B<MS_SILENT>.

source: An attempt was made to bind mount an unbindable mount.
ru: Была попытка выполнить связанное монтирование, как несвязанное монтирование.

source: In an unprivileged mount namespace (i.e., a mount namespace owned by a user namespace that was created by an unprivileged user), a bind mount operation (B<MS_BIND>) was attempted without specifying (B<MS_REC>), which would have revealed the filesystem tree underneath one of the submounts of the directory being bound.
ru: В непривилегированном пространстве имён монтирования (т. е., пространстве имён монтирования, принадлежащем пространству имён пользователя, которое было создано непривилегированным пользователем) выполнялась операция связанного монтирования (B<MS_BIND>) без указания (B<MS_REC>), которая привела бы к открытию дерева файловой системы, находящемся ниже одного из подмонтирований каталога, к которому выполнялось связывание.

source: Too many links encountered during pathname resolution.
ru: Во время разбора имён найдено слишком много ссылок.

source: A move operation was attempted, and I<target> is a descendant of I<source>.
ru: Сделана попытка перемещения, но I<цель> оказалась подкаталогом I<источника>.

source: (In case no block device is required:) Table of dummy devices is full.
ru: (В случае, если не требуются блочные устройства): таблица фиктивных устройств переполнена.

source: A pathname was longer than B<MAXPATHLEN>.
ru: Значение пути длиннее чем B<MAXPATHLEN>.

source: I<filesystemtype> not configured in the kernel.
ru: Тип из I<filesystemtype> в ядре не настроен.

source: A pathname was empty or had a nonexistent component.
ru: Указан пустой путь или одна из его частей не существует.

source: The kernel could not allocate a free page to copy filenames or data into.
ru: Ядро не может выделить свободную страницу для копирования имени файла или данных.

source: I<source> is not a block device (and a device was required).
ru: Значение I<source> не является блочным устройством (а устройство было запрошено).

source: I<target>, or a prefix of I<source>, is not a directory.
ru: Значение I<target> или префикс I<source> не является каталогом.

source: The major number of the block device I<source> is out of range.
ru: Старший номер блочного устройства I<source> вне допустимого диапазона.

source: The caller does not have the required privileges.
ru: Вызывающий процесс не имеет требуемых привилегий.

source: Mounting a read-only filesystem was attempted without giving the B<MS_RDONLY> flag. See B<EACCES>, above.
ru: Было предпринята попытка монтирования файловой системы доступной только на чтение без флага B<MS_RDONLY>. Смотрите описание B<EACCES>, приведённое выше.

source: The definitions of B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME>, and B<MS_UNBINDABLE> were added to glibc headers in version 2.12.
ru: Определения B<MS_DIRSYNC>, B<MS_MOVE>, B<MS_PRIVATE>, B<MS_REC>, B<MS_RELATIME>, B<MS_SHARED>, B<MS_SLAVE>, B<MS_STRICTATIME> и B<MS_UNBINDABLE> были добавлены в заголовочные файлы glibc начиная с версии 2.12.

source: This function is Linux-specific and should not be used in programs intended to be portable.
ru: Данная функция есть только в Linux и не должна использоваться в программах, которые задуманы как переносимые.

source: Since Linux 2.4 a single filesystem can be mounted at multiple mount points, and multiple mounts can be stacked on the same mount point.
ru: Начиная с Linux 2.4 одна файловая система может быть смонтирована в множество точек монтирования, также множественное монтирование может осуществляться в одну точку.

source: The I<mountflags> argument may have the magic number 0xC0ED (B<MS_MGC_VAL>) in the top 16 bits. (All of the other flags discussed in DESCRIPTION occupy the low order 16 bits of I<mountflags>.) Specifying B<MS_MGC_VAL> was required in kernel versions prior to 2.4, but since Linux 2.4 is no longer required and is ignored if specified.
ru: В верхних 16 битах аргумента I<mountflags> может содержаться магическое число 0xC0ED (B<MS_MGC_VAL>) (все остальные флаги из ОПИСАНИЯ находятся в младших 16 битах I<mountflags>). Указание B<MS_MGC_VAL> было требованием ядра до версии 2.4, но начиная с Linux 2.4 этого больше не нужно, и число игнорируется, если указано.

source: The original B<MS_SYNC> flag was renamed B<MS_SYNCHRONOUS> in 1.1.69 when a different B<MS_SYNC> was added to I<E<lt>mman.hE<gt>>.
ru: Изначальный флаг B<MS_SYNC> был переименован в B<MS_SYNCHRONOUS> в 1.1.69, когда в I<E<lt>mman.hE<gt>> был добавлен другой флаг B<MS_SYNC>.

source: Before Linux 2.4 an attempt to execute a set-user-ID or set-group-ID program on a filesystem mounted with B<MS_NOSUID> would fail with B<EPERM>. Since Linux 2.4 the set-user-ID and set-group-ID bits are just silently ignored in this case.
ru: До Linux 2.4 попытка выполнения программ set-UID или set-GID на файловой системе, подключённой с параметром B<MS_NOSUID>, вызывает ошибку B<EPERM>. Начиная с Linux 2.4 биты set-UID и set-GID в этом случае негласно игнорируются.

source: Per-process namespaces
ru: Попроцессные пространства имён

source: Starting with kernel 2.4.19, Linux provides per-process mount namespaces. A mount namespace is the set of filesystem mounts that are visible to a process. Mount-point namespaces can be (and usually are) shared between multiple processes, and changes to the namespace (i.e., mounts and unmounts) by one process are visible to all other processes sharing the same namespace. (The pre-2.4.19 Linux situation can be considered as one in which a single namespace was shared by every process on the system.)
ru: Начиная с ядра версии 2.4.19, Linux предоставляет попроцессные пространства имён монтирования. Пространство имён монтирования — это набор смонтированных файловых систем, которые видимы процессу. Пространства имён точек монтирования могут (обычно так и есть) совместно использоваться несколькими процессами, и изменение пространства имён (т.е., монтирование и размонтирование) одним процессом видимы всеми остальными процессами, использующими одно общее пространство имён. (Поведение до версии 2.4.19 в Linux можно рассматривать так, как если бы всеми процессами в системе использовалось одно пространство имён.)

source: A child process created by B<fork>(2) shares its parent's mount namespace; the mount namespace is preserved across an B<execve>(2).
ru: Процесс-потомок, создаваемый B<fork>(2), использует родительское пространство имён монтирования совместно с родителем; пространство имён монтирования сохраняется при вызове B<execve>(2).
