Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Before Linux 4.14, if I<old_size> was zero and the mapping referred to by I<old_address> was a private mapping (B<mmap>(2) B<MAP_PRIVATE>), B<mremap>() created a new private mapping unrelated to the original mapping. This behavior was unintended and probably unexpected in user-space applications (since the intention of B<mremap>() is to create a new mapping based on the original mapping). Since Linux 4.14, B<mremap>() fails with the error B<EINVAL> in this scenario.
ru: До Linux 4.14, если I<old_size> равно нулю и отображение, на которое указывает I<old_address> — частное отображение (B<mmap>(2) B<MAP_PRIVATE>), то вызов B<mremap>() создавал новое частное отображение, не относящееся к первоначальному отображению. Такое поведение не предусматривалось и, вероятно, не ожидается в приложениях пользовательского пространства (так предназначение B<mremap>() — создание нового отображения на основе первоначального). Начиная с Linux 4.14, в этом случае B<mremap>() завершается ошибкой B<EINVAL>.

source: Your favorite text book on operating systems for more information on paged memory (e.g., I<Modern Operating Systems> by Andrew S.\& Tanenbaum, I<Inside Linux> by Randolf Bentson, I<The Design of the UNIX Operating System> by Maurice J.\& Bach)
ru: Описание страничной памяти в вашей любимой книге по операционным системам (например, I<Современные операционные системы> Эндрю С.\& Таненбаума, I<Внутри Linux> Рэндольфа Бентсона, I<Архитектура операционной системы UNIX > Мориса Дж.\& Баха)

source: mbind - set memory policy for a memory range
ru: mbind - устанавливает политику на область памяти

source: Link with I<-lnuma>.
ru: Компонуется при указании параметра I<-lnuma>.

source: B<mbind>() sets the NUMA memory policy, which consists of a policy mode and zero or more nodes, for the memory range starting with I<addr> and continuing for I<len> bytes. The memory policy defines from which node memory is allocated.
ru: Вызов B<mbind>() устанавливает политику памяти NUMA, состоящую из режима политики и нуля или более узлов, на область памяти, начинающуюся с I<addr> и длиной I<len> байт. Политикой памяти задаётся на каком узле будет выделяться память.

source: If the memory range specified by the I<addr> and I<len> arguments includes an "anonymous" region of memory\(emthat is a region of memory created using the B<mmap>(2) system call with the B<MAP_ANONYMOUS>\(emor a memory-mapped file, mapped using the B<mmap>(2) system call with the B<MAP_PRIVATE> flag, pages will be allocated only according to the specified policy when the application writes (stores) to the page. For anonymous regions, an initial read access will use a shared page in the kernel containing all zeros. For a file mapped with B<MAP_PRIVATE>, an initial read access will allocate pages according to the memory policy of the thread that causes the page to be allocated. This may not be the thread that called B<mbind>().
ru: Если область памяти, заданная аргументами I<addr> и I<len>, включает «анонимную» область памяти — область памяти, созданную с помощью системного вызова B<mmap>(2) с аргументом B<MAP_ANONYMOUS> — или файл, отображённый в память с помощью вызова B<mmap>(2) с флагом B<MAP_PRIVATE>, то страницы будут выделены в соответствии с указанной политикой только когда приложение выполняет запись (сохранение) страницы. Для анонимных областей при первоначальном доступе на чтение будет использоваться общая страница ядра, содержащая только нули. Для отображённого файла с флагом B<MAP_PRIVATE>, при первоначальном доступе на чтение будут выделены страницы в соответствии с политикой памяти нити, для которой происходит выделение страницы. Это может быть не та нить, которая вызвала B<mbind>().

source: The specified policy will be ignored for any B<MAP_SHARED> mappings in the specified memory range. Rather the pages will be allocated according to the memory policy of the thread that caused the page to be allocated. Again, this may not be the thread that called B<mbind>().
ru: Указанная политика в заданной области памяти будет игнорироваться для всех отображений B<MAP_SHARED>. Скорее всего, страницы будут выделены согласно политике памяти нити, для которой происходит выделение страницы. Но опять таки, это может быть не та нить, которая вызвала B<mbind>().

source: If the specified memory range includes a shared memory region created using the B<shmget>(2) system call and attached using the B<shmat>(2) system call, pages allocated for the anonymous or shared memory region will be allocated according to the policy specified, regardless of which process attached to the shared memory segment causes the allocation. If, however, the shared memory region was created with the B<SHM_HUGETLB> flag, the huge pages will be allocated according to the policy specified only if the page allocation is caused by the process that calls B<mbind>() for that region.
ru: Если заданная область памяти включает общую область памяти, созданную с помощью системного вызова B<shmget>(2) и подключённую с помощью системного вызова B<shmat>(2), то страницы, выделяемые для анонимной или общей области памяти, будут выделены согласно указанной политике, независимо от того, какой процесс подключил сегмент общей памяти, что вызвало выделение. Однако, если общая область памяти была создана с флагом B<SHM_HUGETLB>, то огромные страницы будут выделяться согласно указанной политике, только если выделение страницы происходит из-за процесса, который вызвал B<mbind>() для этой области.

source: By default, B<mbind>() has an effect only for new allocations; if the pages inside the range have been already touched before setting the policy, then the policy has no effect. This default behavior may be overridden by the B<MPOL_MF_MOVE> and B<MPOL_MF_MOVE_ALL> flags described below.
ru: По умолчанию, B<mbind>() учитывается только при новых выделениях; если страницы внутри области уже были использованы до настройки политики, то политика не применяется. Такое поведение можно изменить с помощью флагов B<MPOL_MF_MOVE> и B<MPOL_MF_MOVE_ALL>, описанных далее.

source: The I<mode> argument must specify one of B<MPOL_DEFAULT>, B<MPOL_BIND>, B<MPOL_INTERLEAVE>, B<MPOL_PREFERRED>, or B<MPOL_LOCAL> (which are described in detail below). All policy modes except B<MPOL_DEFAULT> require the caller to specify the node or nodes to which the mode applies, via the I<nodemask> argument.
ru: В аргументе I<mode> должно быть указано одно из следующих значений: B<MPOL_DEFAULT>, B<MPOL_BIND>, B<MPOL_INTERLEAVE>, B<MPOL_PREFERRED> или B<MPOL_LOCAL> (описано далее). Для всех режимов политики, за исключением B<MPOL_DEFAULT>, требуется, чтобы вызывающий указывал в аргументе I<nodemask> узел или узлы, для которых применяется режим.

source: The I<mode> argument may also include an optional I<mode flag>. The supported I<mode flags> are:
ru: Аргумент I<mode> также может содержать необязательный I<флаг режима>. Поддерживаемые I<флаги режима>:

source: B<MPOL_F_STATIC_NODES> (since Linux-2.6.26)
ru: B<MPOL_F_STATIC_NODES> (начиная с Linux-2.6.26)

source: A nonempty I<nodemask> specifies physical node IDs. Linux does not remap the I<nodemask> when the thread moves to a different cpuset context, nor when the set of nodes allowed by the thread's current cpuset context changes.
ru: В аргументе I<nodemask> указываются идентификаторы физических узлов. Linux не пересоставляет I<nodemask>, если нить перемещается в другой контекст набора процессоров или когда изменяется набор узлов, который доступен нити согласно текущему контексту набора процессоров.

source: B<MPOL_F_RELATIVE_NODES> (since Linux-2.6.26)
ru: B<MPOL_F_RELATIVE_NODES> (начиная с Linux-2.6.26)

source: A nonempty I<nodemask> specifies node IDs that are relative to the set of node IDs allowed by the thread's current cpuset.
ru: В аргументе I<nodemask> указываются идентификаторы узлов из набора идентификаторов узлов, разрешённых нити текущим контекстом набора процессоров.

source: I<nodemask> points to a bit mask of nodes containing up to I<maxnode> bits. The bit mask size is rounded to the next multiple of I<sizeof(unsigned long)>, but the kernel will use bits only up to I<maxnode>. A NULL value of I<nodemask> or a I<maxnode> value of zero specifies the empty set of nodes. If the value of I<maxnode> is zero, the I<nodemask> argument is ignored. Where a I<nodemask> is required, it must contain at least one node that is on-line, allowed by the thread's current cpuset context (unless the B<MPOL_F_STATIC_NODES> mode flag is specified), and contains memory.
ru: В I<nodemask> содержится битовая маска узлов, в которой содержится до I<maxnode> бит. Размер битовой маски округляется до следующего кратного значения I<sizeof(unsigned long)>, но ядром будет использовано только до I<maxnode> бит. Значением NULL в I<nodemask> или значением I<maxnode> равным 0 задаётся пустой набор узлов. Если значение I<maxnode> равно 0, то аргумент I<nodemask> игнорируется. Там, где требуется I<nodemask>, его значение должно содержать, как минимум, один работающий узел, который разрешён нити текущим контекстом набора процессоров (если не указан флаг B<MPOL_F_STATIC_NODES>) и у которого имеется память.

source: The I<mode> argument must include one of the following values:
ru: Аргумент I<mode> должен включать одно из следующих значений:

source: This mode requests that any nondefault policy be removed, restoring default behavior. When applied to a range of memory via B<mbind>(), this means to use the thread memory policy, which may have been set with B<set_mempolicy>(2). If the mode of the thread memory policy is also B<MPOL_DEFAULT>, the system-wide default policy will be used. The system-wide default policy allocates pages on the node of the CPU that triggers the allocation. For B<MPOL_DEFAULT>, the I<nodemask> and I<maxnode> arguments must be specify the empty set of nodes.
ru: Этот режим запрашивает удаление любой политики не по умолчанию и восстановление поведения по умолчанию. Если он применяется к области памяти посредством B<mbind>(), то это означает использование политики памяти нити, которая могла быть установлена с помощью B<set_mempolicy>(2). Если режим политики памяти нити также равен B<MPOL_DEFAULT>, то будет задействована системная политика по умолчанию. При системной политике по умолчанию выделяются страницы на том узле ЦП, на котором было запрошено выделение. Для B<MPOL_DEFAULT> в аргументах I<nodemask> и I<maxnode> должен быть указан пустой набор узлов.

source: This mode specifies a strict policy that restricts memory allocation to the nodes specified in I<nodemask>. If I<nodemask> specifies more than one node, page allocations will come from the node with sufficient free memory that is closest to the node where the allocation takes place. Pages will not be allocated from any node not specified in the IR nodemask . (Before Linux 2.6.26, page allocations came from the node with the lowest numeric node ID first, until that node contained no free memory. Allocations then came from the node with the next highest node ID specified in I<nodemask> and so forth, until none of the specified nodes contained free memory.)
ru: Этот режим задаёт жёсткую политику, при которой выделение памяти ограничено узлами, заданными в I<nodemask>. Если в I<nodemask> указано более одного узла, то выделение страниц начнётся с узла с достаточным объёмом свободной памяти, который наиболее близок к узлу, где запрошено выделение. Страницы не выделяются на узлах, не указанных в IR nodemask(до Linux 2.6.26 выделение страниц происходило начиная с узла с меньшим номером идентификатора, и продолжится до тех пор, пока на нём не кончится свободная память. Затем выделение продолжится на узле со следующим большим номером идентификатора, указанного в I<nodemask>, и т.д. до тех пор, пока на всех заданных узлах не закончится свободная память).

source: This mode specifies that page allocations be interleaved across the set of nodes specified in I<nodemask>. This optimizes for bandwidth instead of latency by spreading out pages and memory accesses to those pages across multiple nodes. To be effective the memory area should be fairly large, at least 1\ MB or bigger with a fairly uniform access pattern. Accesses to a single page of the area will still be limited to the memory bandwidth of a single node.
ru: Этот режим задаёт, что при выделении страниц нужно выполнять чередование узлов, которые указаны в I<nodemask>. Это оптимизирует использование полосы пропускания, но не задержку, вовлекая при доступ к страницам и памяти множество узлов. Чтобы это дало эффект, область памяти должна быть достаточно большой, не менее 1\ МБ или более, и характер доступа должен быть достаточно равномерным. Доступ к одной странице области будет по прежнему ограничен размером полосы пропускания одного узла.

source: This mode sets the preferred node for allocation. The kernel will try to allocate pages from this node first and fall back to other nodes if the preferred nodes is low on free memory. If I<nodemask> specifies more than one node ID, the first node in the mask will be selected as the preferred node. If the I<nodemask> and I<maxnode> arguments specify the empty set, then the memory is allocated on the node of the CPU that triggered the allocation.
ru: В этом режиме устанавливается предпочтительный узел для выделения. Ядро сначала будет пытаться выделить страницы на этом узле и перейдёт на другие узлы, если на предпочтительном узле недостаточно свободной памяти. Если в I<nodemask> задано более одного идентификатора узла, то в качестве предпочтительного будет выбран первый из маски. Если в аргументах I<nodemask> и I<maxnode> указан пустой набор, то память будет выделена на узле ЦП, на котором запросили выделение.

source: B<MPOL_LOCAL> (since Linux 3.8)
ru: B<MPOL_LOCAL> (начиная с Linux 3.8)

source: This mode specifies "local allocation"; the memory is allocated on the node of the CPU that triggered the allocation (the "local node"). The I<nodemask> and I<maxnode> arguments must specify the empty set. If the "local node" is low on free memory, the kernel will try to allocate memory from other nodes. The kernel will allocate memory from the "local node" whenever memory for this node is available. If the "local node" is not allowed by the thread's current cpuset context, the kernel will try to allocate memory from other nodes. The kernel will allocate memory from the "local node" whenever it becomes allowed by the thread's current cpuset context. By contrast, B<MPOL_DEFAULT> reverts to the memory policy of the thread (which may be set via B<set_mempolicy>(2)); that policy may be something other than "local allocation".
ru: Этот режим устанавливает «локальное выделение»; памяти выделяется на узле с ЦП, на котором запросили выделение («локальный узел»). Аргументы I<nodemask> и I<maxnode> должны содержать пустой набор. Если на «локальном узле» не хватает свободной памяти, то ядро попытается выделить память на других узлах. Ядро выделит памяти на «локальном узле» сколько бы ни было на нём памяти. Если «локальный узел» не разрешён для нити текущим контекстом набора процессоров, то ядро попытается выделить память на других узлах. Ядро выделит памяти на «локальном узле» независимо от того, станет ли он разрешённым для нити текущим контекстом набора процессоров. В отличии от этого , B<MPOL_DEFAULT> восстанавливает политику памяти нити (которая может быть задана с помощью B<set_mempolicy>(2)); эта политика может быть другой, не «локальным выделением».

source: If B<MPOL_MF_STRICT> is passed in I<flags> and I<mode> is not B<MPOL_DEFAULT>, then the call fails with the error B<EIO> if the existing pages in the memory range don't follow the policy.
ru: Если в I<flags> указан B<MPOL_MF_STRICT> и I<mode> не равно B<MPOL_DEFAULT>, то вызов завершается ошибкой B<EIO>, если существующие страницы в области памяти не следуют политике.

source: If B<MPOL_MF_MOVE> is specified in I<flags>, then the kernel will attempt to move all the existing pages in the memory range so that they follow the policy. Pages that are shared with other processes will not be moved. If B<MPOL_MF_STRICT> is also specified, then the call fails with the error B<EIO> if some pages could not be moved.
ru: Если в I<flags> указан B<MPOL_MF_MOVE>, то ядро будет пытаться переместить все существующие страницы в области памяти так, чтобы они следовали политике. Страницы, используемые совместно с другими процессами, перемещаться не будут. Если также указан B<MPOL_MF_STRICT>, что вызов завершается ошибкой B<EIO>, если страницы не могут быть перемещены.

source: If B<MPOL_MF_MOVE_ALL> is passed in I<flags>, then the kernel will attempt to move all existing pages in the memory range regardless of whether other processes use the pages. The calling thread must be privileged (B<CAP_SYS_NICE>) to use this flag. If B<MPOL_MF_STRICT> is also specified, then the call fails with the error B<EIO> if some pages could not be moved.
ru: Если в I<flags> указан B<MPOL_MF_MOVE_ALL>, то ядро будет пытаться переместить все существующие страницы в области памяти независимо от того, используются ли они другими процессами. Для использования данного флага вызывающая нить должна быть привилегированной (B<CAP_SYS_NICE>). Если также указан B<MPOL_MF_STRICT>, то вызов завершается ошибкой B<EIO>, если некоторые страницы нельзя переместить.

source: On success, B<mbind>() returns 0; on error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<mbind>() возвращается 0. При ошибке возвращается -1, а в I<errno> содержится код ошибки.

source: Part or all of the memory range specified by I<nodemask> and I<maxnode> points outside your accessible address space. Or, there was an unmapped hole in the specified memory range specified by I<addr> and I<len>.
ru: Часть или вся область памяти, заданная в I<nodemask> и I<maxnode>, указывает за пределы доступного адресного пространства. Или в области памяти, задаваемой I<addr> и I<len>, есть неотображаемая дыра (hole).

source: An invalid value was specified for I<flags> or I<mode>; or I<addr + len> was less than I<addr>; or I<addr> is not a multiple of the system page size. Or, I<mode> is B<MPOL_DEFAULT> and I<nodemask> specified a nonempty set; or I<mode> is B<MPOL_BIND> or B<MPOL_INTERLEAVE> and I<nodemask> is empty. Or, I<maxnode> exceeds a kernel-imposed limit. Or, I<nodemask> specifies one or more node IDs that are greater than the maximum supported node ID. Or, none of the node IDs specified by I<nodemask> are on-line and allowed by the thread's current cpuset context, or none of the specified nodes contain memory. Or, the I<mode> argument specified both B<MPOL_F_STATIC_NODES> and B<MPOL_F_RELATIVE_NODES>.
ru: В I<flags> или I<mode> указано неправильное значение; или I<addr + len> меньше чем I<addr>; или I<addr> не кратен системному размеру страницы. Или I<mode> равен B<MPOL_DEFAULT> и в I<nodemask> задан непустой набор; или I<mode> равен B<MPOL_BIND> или B<MPOL_INTERLEAVE> и значение I<nodemask> пусто. Или значение I<maxnode> превышает устанавливаемое ядром ограничение. Или в I<nodemask> задан один или более идентификаторов узлов, номер которого больше чем максимально поддерживаемый. Или в I<nodemask> не задано ни одного идентификатора узла, включённого в данный момент и разрешённого нити текущим контекстом набора процессоров, или ни один из указанных узлов не содержит память. Или в аргументе I<mode> указаны сразу B<MPOL_F_STATIC_NODES> и B<MPOL_F_RELATIVE_NODES>.

source: B<MPOL_MF_STRICT> was specified and an existing page was already on a node that does not follow the policy; or B<MPOL_MF_MOVE> or B<MPOL_MF_MOVE_ALL> was specified and the kernel was unable to move all existing pages in the range.
ru: Был указан B<MPOL_MF_STRICT> и существующая страница была уже на узле, что не следует политике; или был указан B<MPOL_MF_MOVE> или B<MPOL_MF_MOVE_ALL> и ядро не смогло переместить все существующие страницы области.

source: The I<flags> argument included the B<MPOL_MF_MOVE_ALL> flag and the caller does not have the B<CAP_SYS_NICE> privilege.
ru: Аргумент I<flags> содержит флаг B<MPOL_MF_MOVE_ALL> и вызывающий не имеет мандата B<CAP_SYS_NICE>.

source: The B<mbind>() system call was added to the Linux kernel in version 2.6.7.
ru: Системный вызов B<mbind>() был добавлен в ядро Linux версии 2.6.7.

source: NUMA policy is not supported on a memory-mapped file range that was mapped with the B<MAP_SHARED> flag.
ru: Политика NUMA не поддерживается для области памяти отображения файла, который отображён с флагом B<MAP_SHARED>.

source: The B<MPOL_DEFAULT> mode can have different effects for B<mbind>() and B<set_mempolicy>(2). When B<MPOL_DEFAULT> is specified for B<set_mempolicy>(2), the thread's memory policy reverts to the system default policy or local allocation. When B<MPOL_DEFAULT> is specified for a range of memory using B<mbind>(), any pages subsequently allocated for that range will use the thread's memory policy, as set by B<set_mempolicy>(2). This effectively removes the explicit policy from the specified range, "falling back" to a possibly nondefault policy. To select explicit "local allocation" for a memory range, specify a I<mode> of B<MPOL_LOCAL> or B<MPOL_PREFERRED> with an empty set of nodes. This method will work for B<set_mempolicy>(2), as well.
ru: Режим B<MPOL_DEFAULT> может по разному влиять на B<mbind>() и B<set_mempolicy>(2). Когда указан B<MPOL_DEFAULT> для B<set_mempolicy>(2), политика памяти нити возвращается к политике по умолчанию или локальному выделению. Когда B<MPOL_DEFAULT> указан для области памяти, используемой B<mbind>(), все страницы, последовательно выделяемые для этой области, будут использовать политику памяти нити, которая задана с помощью B<set_mempolicy>(2). Это эффективно удаляет явную политику из указанной области, «откатываясь» к возможной политике не по умолчанию. Для выбора явного «локального выделения» области памяти, укажите в I<mode> значение B<MPOL_LOCAL> или B<MPOL_PREFERRED> с пустым набором узлов. Этот метод также сработает и в вызове B<set_mempolicy>(2).

source: Support for huge page policy was added with 2.6.16. For interleave policy to be effective on huge page mappings the policied memory needs to be tens of megabytes or larger.
ru: Поддержка политики для огромных страниц была добавлена в версию 2.6.16. Для эффективной работы политики чередования на огромных страничных отображениях, контролируемая память должна измеряться десятками мегабайт или больше.

source: B<MPOL_MF_STRICT> is ignored on huge page mappings.
ru: Режим B<MPOL_MF_STRICT> игнорируется для огромных страничных отображений.

source: B<MPOL_MF_MOVE> and B<MPOL_MF_MOVE_ALL> are available only on Linux 2.6.16 and later.
ru: Режимы B<MPOL_MF_MOVE> и B<MPOL_MF_MOVE_ALL> доступны только в Linux 2.6.16 и новее.

source: mq_getsetattr - get/set message queue attributes
ru: mq_getsetattr - получить/установить атрибуты очереди сообщений

source: Do not use this system call.
ru: Не используйте этот системный вызов.

source: This is the low-level system call used to implement B<mq_getattr>(3) and B<mq_setattr>(3). For an explanation of how this system call operates, see the description of B<mq_setattr>(3).
ru: Этот низкоуровневый системный вызов используется для реализации функций B<mq_getattr>(3) и B<mq_setattr>(3). Более подробно о работе этого системного вызова можно узнать на странице B<mq_setattr>(3).

source: This interface is nonstandard; avoid its use.
ru: Этот интерфейс является нестандартным, не используйте его.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2). (Actually, never call it unless you are writing a C library!)
ru: Glibc не предоставляет обертку (wrapper) для этого системного вызова; используйте B<syscall>(2). (Даже не вызывайте его, если не пишете C библиотеку!)
