Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: The program below takes up to four command-line arguments, of which the first three are mandatory. The first argument specifies the number of threads that the program should create. All of the threads, including the main thread, allocate the number of blocks of memory specified by the second argument. The third argument controls the size of the blocks to be allocated. The main thread creates blocks of this size, the second thread created by the program allocates blocks of twice this size, the third thread allocates blocks of three times this size, and so on.
ru: Программа, представленная ниже, принимает до четырёх параметров командной строки, три из которых обязательны. В первом параметре задаётся количество нитей, которые должна создать программа. Все нити, включая главную нить, выделяют количество блоков памяти, заданное в втором параметре. В третьем параметре задаётся размер выделяемых блоков. Главная нить создает блоки этого размера, вторая нить создаваемая программой, выделяет блоки двукратного размера, третья нить выделяет блоки трёхкратного размера и так далее.

source: The program calls B<malloc_info>() twice to display the memory-allocation state. The first call takes place before any threads are created or memory allocated. The second call is performed after all threads have allocated memory.
ru: Чтобы показать состояние выделения памяти программа дважды вызывает B<malloc_info>(). Первый раз вызов делается до создания нитей и выделения памяти. Второй вызов выполняется после того, как все нити выделят память.

source: In the following example, the command-line arguments specify the creation of one additional thread, and both the main thread and the additional thread allocate 10000 blocks of memory. After the blocks of memory have been allocated, B<malloc_info>() shows the state of two allocation arenas.
ru: В следующем примере аргументами командной строки задаётся создание одной дополнительной нити и что главная и дополнительная нить выделяют 10000 блоков памяти. После того, как блоки памяти выделены, B<malloc_info>() показывает состояние двух областей выделения.

source: $ B<getconf GNU_LIBC_VERSION> glibc 2.13 $ B<./a.out 1 10000 100> ============ Before allocating blocks ============ E<lt>malloc version="1"E<gt> E<lt>heap nr="0"E<gt> E<lt>sizesE<gt> E<lt>/sizesE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="135168"/E<gt> E<lt>system type="max" size="135168"/E<gt> E<lt>aspace type="total" size="135168"/E<gt> E<lt>aspace type="mprotect" size="135168"/E<gt> E<lt>/heapE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="135168"/E<gt> E<lt>system type="max" size="135168"/E<gt> E<lt>aspace type="total" size="135168"/E<gt> E<lt>aspace type="mprotect" size="135168"/E<gt> E<lt>/mallocE<gt>
ru: $ B<getconf GNU_LIBC_VERSION> glibc 2.13 $ B<./a.out 1 10000 100> ============ до выделения блоков ============ E<lt>malloc version="1"E<gt> E<lt>heap nr="0"E<gt> E<lt>sizesE<gt> E<lt>/sizesE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="135168"/E<gt> E<lt>system type="max" size="135168"/E<gt> E<lt>aspace type="total" size="135168"/E<gt> E<lt>aspace type="mprotect" size="135168"/E<gt> E<lt>/heapE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="135168"/E<gt> E<lt>system type="max" size="135168"/E<gt> E<lt>aspace type="total" size="135168"/E<gt> E<lt>aspace type="mprotect" size="135168"/E<gt> E<lt>/mallocE<gt>

source: ============ After allocating blocks ============ E<lt>malloc version="1"E<gt> E<lt>heap nr="0"E<gt> E<lt>sizesE<gt> E<lt>/sizesE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="1081344"/E<gt> E<lt>system type="max" size="1081344"/E<gt> E<lt>aspace type="total" size="1081344"/E<gt> E<lt>aspace type="mprotect" size="1081344"/E<gt> E<lt>/heapE<gt> E<lt>heap nr="1"E<gt> E<lt>sizesE<gt> E<lt>/sizesE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="1032192"/E<gt> E<lt>system type="max" size="1032192"/E<gt> E<lt>aspace type="total" size="1032192"/E<gt> E<lt>aspace type="mprotect" size="1032192"/E<gt> E<lt>/heapE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="2113536"/E<gt> E<lt>system type="max" size="2113536"/E<gt> E<lt>aspace type="total" size="2113536"/E<gt> E<lt>aspace type="mprotect" size="2113536"/E<gt> E<lt>/mallocE<gt>
ru: ============ после выделения блоков ============ E<lt>malloc version="1"E<gt> E<lt>heap nr="0"E<gt> E<lt>sizesE<gt> E<lt>/sizesE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="1081344"/E<gt> E<lt>system type="max" size="1081344"/E<gt> E<lt>aspace type="total" size="1081344"/E<gt> E<lt>aspace type="mprotect" size="1081344"/E<gt> E<lt>/heapE<gt> E<lt>heap nr="1"E<gt> E<lt>sizesE<gt> E<lt>/sizesE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="1032192"/E<gt> E<lt>system type="max" size="1032192"/E<gt> E<lt>aspace type="total" size="1032192"/E<gt> E<lt>aspace type="mprotect" size="1032192"/E<gt> E<lt>/heapE<gt> E<lt>total type="fast" count="0" size="0"/E<gt> E<lt>total type="rest" count="0" size="0"/E<gt> E<lt>system type="current" size="2113536"/E<gt> E<lt>system type="max" size="2113536"/E<gt> E<lt>aspace type="total" size="2113536"/E<gt> E<lt>aspace type="mprotect" size="2113536"/E<gt> E<lt>/mallocE<gt>

source: /* The multiplier \(aq(2 + tn)\(aq ensures that each thread (including the main thread) allocates a different amount of memory */
ru: /* Множитель \(aq(2 + tn)\(aq для обеспечения того, что каждая нить (включая главную) выделяет разное количество памяти */

source: sleep(100); /* Sleep until main thread terminates */ return NULL; }
ru: sleep(100); /* Спим, пока главная нить не завершит работу */ return NULL; }

source: printf("============ Before allocating blocks ============\en"); malloc_info(0, stdout);
ru: printf("============ до выделения блоков ============\en"); malloc_info(0, stdout);

source: /* Create threads that allocate different amounts of memory */
ru: /* Создаём нити, которые выделяют разное количество памяти */

source: /* If we add a sleep interval after the start-up of each thread, the threads likely won\(aqt contend for malloc mutexes, and therefore additional arenas won\(aqt be allocated (see malloc(3)). */
ru: /* если мы добавим задержку после запуска каждой нити, то нити, вероятно, не будут бороться за мьютекс malloc, и поэтому дополнительные области выделены не будут (смотрите malloc(3)) */

source: /* The main thread also allocates some memory */
ru: /* главная нить также выделяет память */

source: sleep(2); /* Give all threads a chance to complete allocations */
ru: sleep(2); /* ждём, чтобы потоки успели выделить память */

source: printf("\en============ After allocating blocks ============\en"); malloc_info(0, stdout);
ru: printf("\en============ после выделения блоков ============\en"); malloc_info(0, stdout);

source: MB_LEN_MAX - maximum multibyte length of a character across all locales
ru: MB_LEN_MAX - максимальная длина многобайтового символа, для всех локалей

source: The B<MB_LEN_MAX> macro is the maximum number of bytes needed to represent a single wide character, in any of the supported locales.
ru: Макрос B<MB_LEN_MAX> представляет собой максимальное количества байтов, необходимых для представления единственного широкого символа, в любой из поддерживаемых локалей.

source: A constant integer greater than zero.
ru: Это постоянное значение больше нуля.

source: The entities B<MB_LEN_MAX> and I<sizeof(wchar_t)> are totally unrelated. In glibc, B<MB_LEN_MAX> is typically 16 (6 in glibc versions earlier than 2.2), while I<sizeof(wchar_t)> is 4.
ru: Элементы B<MB_LEN_MAX> и I<sizeof(wchar_t)> никак не связаны друг с другом. В glibc значение B<MB_LEN_MAX>, обычно, равно 16 (6 в glibc до версии 2.2), а I<sizeof(wchar_t)> равно 4.

source: MB_CUR_MAX - maximum length of a multibyte character in the current locale
ru: MB_CUR_MAX - максимальная длина многобайтового символа, для текущей локали

source: The B<MB_CUR_MAX> macro defines an integer expression giving the maximum number of bytes needed to represent a single wide character in the current locale. This value is locale dependent and therefore not a compile-time constant.
ru: Макрос B<MB_CUR_MAX> определяет целочисленное выражение, задающее максимальное количества байтов необходимых для представления единственного широкого символа в текущей локали. Данное значение зависит от локали и поэтому не является постоянным времени-компиляции.

source: An integer in the range [1, B<MB_LEN_MAX>]. The value 1 denotes traditional 8-bit encoded characters.
ru: Целое число в диапазоне [1, B<MB_LEN_MAX>]. Значение 1 обозначает традиционное 8-разрядное кодирование символов.

source: memmove - copy memory area
ru: memmove - копирует область памяти

source: The B<memmove>() function copies I<n> bytes from memory area I<src> to memory area I<dest>. The memory areas may overlap: copying takes place as though the bytes in I<src> are first copied into a temporary array that does not overlap I<src> or I<dest>, and the bytes are then copied from the temporary array to I<dest>.
ru: Функция B<memmove>() копирует I<n> байт из участка памяти I<src> в I<dest>. Адреса участков могут перекрываться — в этом случае из I<src> байты копируются во временный массив, который не пересекается с I<src> или I<dest>, после чего они копируются из него в I<dest>.

source: The B<memmove>() function returns a pointer to I<dest>.
ru: Функция B<memmove>() возвращает указатель на I<dest>.

source: mbstowcs - convert a multibyte string to a wide-character string
ru: mbstowcs - преобразует многобайтовую строку в строку широких символов

source: If I<dest> is not NULL, the B<mbstowcs>() function converts the multibyte string I<src> to a wide-character string starting at I<dest>. At most I<n> wide characters are written to I<dest>. The sequence of characters in the string I<src> shall begin in the initial shift state. The conversion can stop for three reasons:
ru: Если значение I<dest> не равно NULL, то функция B<mbstowcs>() преобразует многобайтовую строку I<src> в широкосимвольную строку начиная с I<dest>. В I<dest> будет записано не более I<n> широких символов. Последовательность символов в строке I<src> должна начинаться с начального состояния. Преобразование может прекратиться по трём причинам:

source: An invalid multibyte sequence has been encountered. In this case, I<(size_t)\ -1> is returned.
ru: Во входных данных находится неправильная многобайтовая последовательность. В этом случае возвращается I<(size_t)\ -1>.

source: I<n> non-L\(aq\e0\(aq wide characters have been stored at I<dest>. In this case, the number of wide characters written to I<dest> is returned, but the shift state at this point is lost.
ru: В I<dest> было сохранено I<n> не равных L\(aq\e0\(aq широких символов. В этом случае будет возвращено количество широких символов, записанных в I<dest>, но состояние сдвига в этой точке теряется.

source: The multibyte string has been completely converted, including the terminating null character (\(aq\e0\(aq). In this case, the number of wide characters written to I<dest>, excluding the terminating null wide character, is returned.
ru: Многобайтовая строка была полностью преобразована, включая завершающий символ null (\(aq\e0\(aq). В этом случае возвращается количество записанных в I<dest> широких символов, не считая завершающий широкий символ null.

source: The programmer must ensure that there is room for at least I<n> wide characters at I<dest>.
ru: Программист должен проверить, что в I<dest> есть место по крайней мере для I<n> широких символов.

source: If I<dest> is NULL, I<n> is ignored, and the conversion proceeds as above, except that the converted wide characters are not written out to memory, and that no length limit exists.
ru: Если значение I<dest> равно NULL, то I<n> игнорируется и преобразование выполняется как описано выше, исключая то, что преобразованные широкие символы не записываются в память и нет ограничения по длине.

source: In order to avoid the case 2 above, the programmer should make sure I<n> is greater than or equal to I<mbstowcs(NULL,src,0)+1>.
ru: Для того, чтобы избежать ограничения пункта 2, программист должен удостовериться, что значение I<n> больше или равно I<mbstowcs(NULL,src,0)+1>.

source: The B<mbstowcs>() function returns the number of wide characters that make up the converted part of the wide-character string, not including the terminating null wide character. If an invalid multibyte sequence was encountered, I<(size_t)\ -1> is returned.
ru: Функция B<mbstowcs>() возвращает количество широких символов, которые составили преобразованную часть широкосимвольной строки, не включая конечный широкий символ null Если обнаружена некорректная многобайтовая последовательность, то возвращается I<(size_t)\ -1>.

source: The behavior of B<mbstowcs>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mbstowcs>() зависит от категории B<LC_CTYPE> текущей локали.

source: The function B<mbsrtowcs>(3) provides a better interface to the same functionality.
ru: Функция B<mbsrtowcs>(3) предоставляет лучший интерфейс с теми же возможностями.

source: The program below illustrates the use of B<mbstowcs>(), as well as some of the wide character classification functions. An example run is the following:
ru: В программе, представленной ниже, показано использование B<mbstowcs>(), а также некоторые функции классификации широких символов. Пример запуска:

source: $ ./t_mbstowcs de_DE.UTF-8 Grüße! Length of source string (excluding terminator): 8 bytes 6 multibyte characters
ru: $ ./t_mbstowcs de_DE.UTF-8 Grüße! Длина исходной строки (без конечного символа): 8 байт 6 многобайтовых символов

source: Wide character string is: Grüße! (6 characters) G alpha upper r alpha lower ü alpha lower ß alpha lower e alpha lower ! !alpha
ru: Строка широких символов: Grüße! (6 символов) G буква заглавная r буква строчная ü буква строчная ß буква строчная e буква строчная ! !буква

source: int main(int argc, char *argv[]) { size_t mbslen; /* Number of multibyte characters in source */ wchar_t *wcs; /* Pointer to converted wide character string */ wchar_t *wp;
ru: int main(int argc, char *argv[]) { size_t mbslen; /* количество многобайтовых символов в источнике */ wchar_t *wcs; /* указатель на преобразованную строку широких символов */ wchar_t *wp;

source: if (argc E<lt> 3) { fprintf(stderr, "Usage: %s E<lt>localeE<gt> E<lt>stringE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 3) { fprintf(stderr, "Использование: %s E<lt>локальE<gt> E<lt>строкаE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: /* Apply the specified locale */
ru: /* применяем указанную локаль */

source: /* Calculate the length required to hold argv[2] converted to a wide character string */
ru: /* вычисляем длину, которая требуется для хранения argv[2], преобразованной в строку широких символов */

source: /* Describe the source string to the user */
ru: /* опишем исходную строку пользователю */

source: printf("Length of source string (excluding terminator):\en"); printf(" %zu bytes\en", strlen(argv[2])); printf(" %zu multibyte characters\en\en", mbslen);
ru: printf("Длина исходной строки (без конечного символа):\en"); printf(" %zu байт\en", strlen(argv[2])); printf(" %zu многобайтовых символов\en\en", mbslen);

source: /* Allocate wide character string of the desired size. Add 1 to allow for terminating null wide character (L\(aq\e0\(aq). */
ru: /* выделим место под строку широких символов желаемого размера. Добавим 1 для конечного широкого символа null (L\(aq\e0\(aq). */

source: /* Convert the multibyte character string in argv[2] to a wide character string */
ru: /* преобразуем многобайтовую строку из argv[2] в строку широких символов */

source: printf("Wide character string is: %ls (%zu characters)\en", wcs, mbslen);
ru: printf("Строка широких символов: %ls (%zu символов)\en", wcs, mbslen);

source: /* Now do some inspection of the classes of the characters in the wide character string */
ru: /* теперь посмотрим на классы символов в строке широких символов */

source: if (!iswalpha(*wp)) printf("!"); printf("alpha ");
ru: if (!iswalpha(*wp)) printf("!"); printf("буква ");

source: if (iswalpha(*wp)) { if (iswupper(*wp)) printf("upper ");
ru: if (iswalpha(*wp)) { if (iswupper(*wp)) printf("заглавная ");

source: if (iswlower(*wp)) printf("lower "); }
ru: if (iswlower(*wp)) printf("строчная "); }

source: mbsinit - test for initial shift state
ru: mbsinit - проверяет начальное состояние сдвига

source: Character conversion between the multibyte representation and the wide character representation uses conversion state, of type I<mbstate_t>. Conversion of a string uses a finite-state machine; when it is interrupted after the complete conversion of a number of characters, it may need to save a state for processing the remaining characters. Such a conversion state is needed for the sake of encodings such as ISO-2022 and UTF-7.
ru: Преобразование многобайтового представления символов в представление в виде широких символов (и наоборот) происходит с помощью состояния преобразования (тип I<mbstate_t>). Преобразование строк происходит с помощью конечного автомата; если преобразование прерывается после некоторого количества символов, то может потребоваться сохранить состояние для обработки остальных символов. Это состояние преобразования необходимо, к примеру, для кодировок ISO-2022 и UTF-7.

source: The initial state is the state at the beginning of conversion of a string. There are two kinds of state: the one used by multibyte to wide character conversion functions, such as B<mbsrtowcs>(3), and the one used by wide character to multibyte conversion functions, such as B<wcsrtombs>(3), but they both fit in a I<mbstate_t>, and they both have the same representation for an initial state.
ru: Начальное состояние — это состояние в начале преобразования строки. Есть два типа состояния: первое используется функциями преобразования многобайтовых символов в широкие (B<mbsrtowcs>(3)); второе используется функциями преобразования широких символов в многобайтовые (B<wcsrtombs>(3)). Для начального состояния обоих типов используется тип I<mbstate_t>.

source: For 8-bit encodings, all states are equivalent to the initial state. For multibyte encodings like UTF-8, EUC-*, BIG5 or SJIS, the wide character to multibyte conversion functions never produce non-initial states, but the multibyte to wide-character conversion functions like B<mbrtowc>(3) do produce non-initial states when interrupted in the middle of a character.
ru: Все состояния 8-битных кодировок соответствуют начальному состоянию. Для многобайтовых кодировок (UTF-8, EUC-*, BIG5 или SJIS) функции преобразования широкого символа в многобайтовый никогда не создают не исходные состояния, а функции преобразования многобайтового символа в широкий (например, B<mbrtowc>(3)) создают не исходные состояния, если прерываются на середине символа.

source: One possible way to create an I<mbstate_t> in initial state is to set it to zero:
ru: Одним из способов создания I<mbstate_t> в начальном состоянии является присвоение нулевого значения:

source: On Linux, the following works as well, but might generate compiler warnings:
ru: В Linux также работает и следующее, но может привести к появлению предупреждения компилятора:

source: The function B<mbsinit>() tests whether I<*ps> corresponds to an initial state.
ru: Функция B<mbsinit>() проверяет I<*ps> на соответствие начальному состоянию.

source: B<mbsinit>() returns nonzero if I<*ps> is an initial state, or if I<ps> is NULL. Otherwise, it returns 0.
ru: Функция B<mbsinit>() возвращает ненулевое значение, если I<*ps> находится в начальном состоянии, или если I<ps> равно NULL. В противном случае возвращается 0.

source: The behavior of B<mbsinit>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mbsinit>() зависит от категории B<LC_CTYPE> текущей локали.

source: mpool - shared memory buffer pool
ru: mpool - общий массив буферов памяти

source: I<Note well>: This page documents interfaces provided in glibc up until version 2.1. Since version 2.2, glibc no longer provides these interfaces. Probably, you are looking for the APIs provided by the I<libdb> library instead.
ru: I<Примечание>: В этой странице описаны интерфейсы, предоставляемые glibc до версии 2.1. Начиная с версии 2.2, glibc больше не поддерживает эти интерфейсы. Вероятно, вы ищите API, предоставляемое библиотекой I<libdb>.

source: I<Mpool> is the library interface intended to provide page oriented buffer management of files. The buffers may be shared between processes.
ru: Целью библиотечного интерфейса I<mpool> является обеспечение управления буферными страницами файлов. Буферы могут использоваться несколькими процессами.

source: The function B<mpool_open>() initializes a memory pool. The I<key> argument is the byte string used to negotiate between multiple processes wishing to share buffers. If the file buffers are mapped in shared memory, all processes using the same key will share the buffers. If I<key> is NULL, the buffers are mapped into private memory. The I<fd> argument is a file descriptor for the underlying file, which must be seekable. If I<key> is non-NULL and matches a file already being mapped, the I<fd> argument is ignored.
ru: Функция B<mpool_open>() инициализирует массив памяти. Параметр I<key> является строкой байтов для согласования процессов, желающих совместно использовать буферы. Если файловые буферы отображены в общей памяти, то все процессы, использующие данный одинаковый параметр, будут совместно использовать буферы. Если параметр I<key> равен NULL, то буферы отображаются в локальной (private) памяти. Параметр I<fd> является файловым дескриптором связанного файла, который должен быть доступен для поиска. Если значение I<key> не равно NULL и совпадает с уже отображённым файлом, то параметр I<fd> игнорируется.

source: The I<pagesize> argument is the size, in bytes, of the pages into which the file is broken up. The I<maxcache> argument is the maximum number of pages from the underlying file to cache at any one time. This value is not relative to the number of processes which share a file's buffers, but will be the largest value specified by any of the processes sharing the file.
ru: В параметре I<pagesize> указывается размер (в байтах) страниц, в которых располагается файл. В параметре I<maxcache> задаётся максимальное количество страниц файла, которое можно кэшировать в любой момент времени. Это значение не связано с количеством процессов, которые совместно используют буферы файла, но будет наибольшим значением из определённых процессами, совместно использующими файл.
