Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: before calling a mathematical function.
ru: перед тем, как вызвать математическую функцию.

source: Upon return from the mathematical function, if I<errno> is nonzero, or the following call (see B<fenv>(3)) returns nonzero
ru: По возврату из математической функции, если переменная I<errno> ненулевая, а так же следующий вызов (смотрите B<fenv>(3)) вернул ненулевое значение

source: then an error occurred in the mathematical function.
ru: то ошибка произошла в математической функции.

source: The error conditions that can occur for mathematical functions are described below.
ru: Условия возникновения математических ошибок приведены ниже.

source: Domain error
ru: Ошибка области

source: A I<domain error> occurs when a mathematical function is supplied with an argument whose value falls outside the domain for which the function is defined (e.g., giving a negative argument to B<log>(3)). When a domain error occurs, math functions commonly return a NaN (though some functions return a different value in this case); I<errno> is set to B<EDOM>, and an "invalid" (B<FE_INVALID>) floating-point exception is raised.
ru: I<Ошибка области> возникает, когда математической функции передаётся аргумент, чьё значение выходит за границы области, ожидаемой функцией (например, передача отрицательного значения в функцию B<log>(3)). Когда возникает ошибка области, чаще всего, математические функции возвращают NaN (хотя некоторые функции в этом случае возвращают другое значение); I<errno> присваивается B<EDOM> возникает исключение плавающей запятой «invalid» (B<FE_INVALID>).

source: Pole error
ru: Ошибка особой точки

source: A I<pole error> occurs when the mathematical result of a function is an exact infinity (e.g., the logarithm of 0 is negative infinity). When a pole error occurs, the function returns the (signed) value B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, depending on whether the function result type is I<double>, I<float>, or I<long double>. The sign of the result is that which is mathematically correct for the function. I<errno> is set to B<ERANGE>, and a "divide-by-zero" (B<FE_DIVBYZERO>) floating-point exception is raised.
ru: I<Ошибка особой точки> возникает, когда результат математической функции должен быть равен бесконечности (например, логарифм 0 равен отрицательной бесконечности). Когда возникает ошибка особой точки функция возвращает значение (со знаком) B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, в зависимости от типа результата функции — I<double>, I<float> или I<long double>. Знак результата будет математически корректным для функции. Переменной I<errno> присваивается значение B<ERANGE> и возникает исключение плавающей запятой «divide-by-zero» (B<FE_DIVBYZERO>).

source: Range error
ru: Ошибка диапазона

source: A I<range error> occurs when the magnitude of the function result means that it cannot be represented in the result type of the function. The return value of the function depends on whether the range error was an overflow or an underflow.
ru: I<Ошибка диапазона> возникает, когда величина результата функции не может быть представлена типом результата функции. Возвращаемое значение функции зависит от того, было ли при ошибке диапазона переполнение или исчерпание.

source: A floating result I<overflows> if the result is finite, but is too large to represented in the result type. When an overflow occurs, the function returns the value B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, depending on whether the function result type is I<double>, I<float>, or I<long double>. I<errno> is set to B<ERANGE>, and an "overflow" (B<FE_OVERFLOW>) floating-point exception is raised.
ru: Результат с плавающей запятой I<переполнен>, если он является конечным значением, но слишком большим для представления типом результата. При возникновении переполнения функция возвращает значение B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, в зависимости от того, каков тип результата функции — I<double>, I<float> или I<long double>. Переменной I<errno> присваивается значение B<ERANGE> и возникает переполнение плавающей запятой «overflow» (B<FE_OVERFLOW>).

source: A floating result I<underflows> if the result is too small to be represented in the result type. If an underflow occurs, a mathematical function typically returns 0.0 (C99 says a function shall return "an implementation-defined value whose magnitude is no greater than the smallest normalized positive number in the specified type"). I<errno> may be set to B<ERANGE>, and an "overflow" (B<FE_UNDERFLOW>) floating-point exception may be raised.
ru: Результат с плавающей запятой I<потерял значимость>, если он слишком мал для представления типом результата. При возникновении исчерпаемости математическая функция, обычно, возвращает 0.0 (в C99 сказано, что функция должна возвращать «определяемое реализацией» значение, чья величина не больше, чем самое маленькое положительное число заданного типа»). Переменной I<errno> может быть присвоено значение B<ERANGE> и может возникать переполнение плавающей запятой «overflow» (B<FE_UNDERFLOW>).

source: Some functions deliver a range error if the supplied argument value, or the correct function result, would be I<subnormal>. A subnormal value is one that is nonzero, but with a magnitude that is so small that it can't be presented in normalized form (i.e., with a 1 in the most significant bit of the significand). The representation of a subnormal number will contain one or more leading zeros in the significand.
ru: Некоторые функции возвращают ошибку диапазона, ели значение аргумента или правильный результат функции был бы I<субнормальным>. Субнормальное значение — ненулевое значение, но его величина так мала, что не может быть представлена в нормализованном виде (т. е., есть 1 с самом значимом бите значащей части). Представление субнормального числа будет содержать один или более начальных нулей в значащей части.

source: The I<math_errhandling> identifier specified by C99 and POSIX.1 is not supported by glibc. This identifier is supposed to indicate which of the two error-notification mechanisms (I<errno>, exceptions retrievable via B<fettestexcept>(3)) is in use. The standards require that at least one be in use, but permit both to be available. The current (version 2.8) situation under glibc is messy. Most (but not all) functions raise exceptions on errors. Some also set I<errno>. A few functions set I<errno>, but don't raise an exception. A very few functions do neither. See the individual manual pages for details.
ru: Идентификатор I<math_errhandling>, определённый в C99 и POSIX.1, не поддерживается в glibc. Данный идентификатор предполагается для указания какой из двух способов использован для уведомления об ошибке (I<errno>, исключение, извлекаемое с помощью B<fettestexcept>(3)). Стандарты требуют, чтобы использовался какой-то один, но допускают быть доступным обоим. На данный момент (версия 2.8) ситуация в glibc запутанная. Большинство (но не все) функций вызывают при ошибке исключение. Некоторые также изменяют I<errno>. Несколько функций изменяют I<errno>, но не вызывают исключение. Очень малое количество функций не делают ни того, ни другого. Всё это описано в их справочных страницах.

source: To avoid the complexities of using I<errno> and B<fetestexcept>(3) for error checking, it is often advised that one should instead check for bad argument values before each call. For example, the following code ensures that B<log>(3)'s argument is not a NaN and is not zero (a pole error) or less than zero (a domain error):
ru: Чтобы при проверке ошибок избежать сложностей с использованием I<errno> и B<fetestexcept>(3) часто советуют перед вызовом проверять аргументы на некорректные значения. Например, следующий код проверяет, что аргумент B<log>(3) не равен NaN и не равен нулю (ошибка особой точки) или меньше нуля (ошибка области):

source: if (isnan(x) || islessequal(x, 0)) { /* Deal with NaN / pole error / domain error */ }
ru: if (isnan(x) || islessequal(x, 0)) { /* обработка NaN / ошибки особой точки / ошибки области */ }

source: The discussion on this page does not apply to the complex mathematical functions (i.e., those declared by I<E<lt>complex.hE<gt>>), which in general are not required to return errors by C99 and POSIX.1.
ru: Данная страница не применима к комплексным математическим функциям (описанным в I<E<lt>complex.hE<gt>>), для которых в C99 and POSIX.1, обычно, не требуется возвращать ошибки.

source: The B<gcc>(1) I<-fno-math-errno> option causes the executable to employ implementations of some mathematical functions that are faster than the standard implementations, but do not set I<errno> on error. (The B<gcc>(1) I<-ffast-math> option also enables I<-fno-math-errno>.) An error can still be tested for using B<fetestexcept>(3).
ru: Параметр B<gcc>(1) I<-fno-math-errno> заставляет в исполняемых файлах вызывать реализации некоторых математических функций, которые быстрее стандартных, но не изменяющие I<errno> при ошибке (параметр B<gcc>(1) I<-ffast-math> также включает I<-fno-math-errno>.) Возникновение ошибки по-прежнему можно проверить с помощью B<fetestexcept>(3).

source: man - macros to format man pages
ru: man - макросы для форматирования справочных страниц

source: B<groff -Tascii -man> I<file> \&...
ru: B<groff -Tascii -man> I<файл> \&...

source: B<groff -Tps -man> I<file> \&...
ru: B<groff -Tps -man> I<файл> \&...

source: This manual page explains the B<groff an.tmac> macro package (often called the B<man> macro package). This macro package should be used by developers when writing or porting man pages for Linux. It is fairly compatible with other versions of this macro package, so porting man pages should not be a major problem (exceptions include the NET-2 BSD release, which uses a totally different macro package called mdoc; see B<mdoc>(7)).
ru: В этой справочной странице описывается макет макросов B<groff an.tmac> (часто называемый макетом макросов B<man>). Данный пакет макросов должен использоваться разработчиками для написания или переноса справочных страниц в Linux. Он относительно совместим с другими версиями этого пакета макросов, так что перенос справочных страниц не должен быть большой проблемой (кроме выпуска NET-2 BSD, в котором используется полностью другой пакет макросов mdoc; смотрите B<mdoc>(7)).

source: Note that NET-2 BSD mdoc man pages can be used with B<groff> simply by specifying the B<-mdoc> option instead of the B<-man> option. Using the B<-mandoc> option is, however, recommended, since this will automatically detect which macro package is in use.
ru: Заметим, что справочные страницы NET-2 BSD mdoc можно использовать с B<groff> просто указав параметра B<-mdoc> вместо B<-man>. Однако рекомендуется использовать параметр B<-mandoc>, так как это включает автоматическое определение какой пакет макросов использовать.

source: For conventions that should be employed when writing man pages for the Linux I<man-pages> package, see B<man-pages>(7).
ru: Соглашения, которые нужно соблюдать при написании справочных страниц для пакета Linux I<man-pages> смотрите в B<man-pages>(7).

source: The first command in a man page (after comment lines, that is, lines that start with B<.\e">) should be
ru: Первой командой в справочной странице (после комментариев, то есть строк, которые начинаются с B<.\e">) должна быть

source: For details of the arguments that should be supplied to the B<TH> command, see B<man-pages>(7).
ru: Описание аргументов команды B<TH> смотрите в B<man-pages>(7).

source: Note that BSD mdoc-formatted pages begin with the B<Dd> command, not the B<TH> command.
ru: Заметим, что страницы, отформатированные под BSD mdoc, начинаются с команды B<Dd>, а не B<TH>.

source: Sections
ru: Разделы

source: Sections are started with B<\&.SH> followed by the heading name.
ru: Разделы начинаются с макроса B<\&.SH>, за которым следует название заголовка.

source: The only mandatory heading is NAME, which should be the first section and be followed on the next line by a one-line description of the program:
ru: Единственным обязательным заголовком является ИМЯ, оно должно быть первым разделом и снабжаться однострочным описанием программы на следующей строке:

source: \&.SH NAME
ru: \&.SH ИМЯ

source: item \e- description
ru: элемент \e- описание

source: It is extremely important that this format is followed, and that there is a backslash before the single dash which follows the item name. This syntax is used by the B<mandb>(8) program to create a database of short descriptions for the B<whatis>(1) and B<apropos>(1) commands. (See B<lexgrog>(1) for further details on the syntax of the NAME section.)
ru: Чрезвычайно важно следовать этому формату, и ставить наклонную черту влево перед одиночным минусом, который указывается после названия объекта. Этот синтаксис используется программой B<mandb>(8) при создании базы данных кратких описаний для команд B<whatis>(1) и B<apropos>(1) (описание синтаксиса раздела ИМЯ смотрите в B<lexgrog>(1)).

source: For a list of other sections that might appear in a manual page, see B<man-pages>(7).
ru: Список разделов, которые могут присутствовать в справочной странице, смотрите в B<man-pages>(7).

source: Fonts
ru: Шрифты

source: The commands to select the type face are:
ru: Команды для выбора начертания шрифта:

source: Bold
ru: Полужирный

source: Bold alternating with italics (especially useful for function specifications)
ru: Полужирный курсив (часто применяется при описании функций)

source: Bold alternating with Roman (especially useful for referring to other manual pages)
ru: Полужирный прямой (часто применяется для ссылок на другие справочные страницы)

source: Italics
ru: Курсив

source: Italics alternating with bold
ru: Курсив, чередующийся с полужирным

source: Italics alternating with Roman
ru: Курсив, чередующийся с прямым

source: Roman alternating with bold
ru: Прямой, чередующийся с полужирным

source: Roman alternating with italics
ru: Прямой, чередующийся с курсивом

source: Small alternating with bold
ru: Капитель, чередующаяся с полужирным

source: Small (useful for acronyms)
ru: Капитель (полезна для аббревиатур)

source: Traditionally, each command can have up to six arguments, but the GNU implementation removes this limitation (you might still want to limit yourself to 6 arguments for portability's sake). Arguments are delimited by spaces. Double quotes can be used to specify an argument which contains spaces. All of the arguments will be printed next to each other without intervening spaces, so that the B<\&.BR> command can be used to specify a word in bold followed by a mark of punctuation in Roman. If no arguments are given, the command is applied to the following line of text.
ru: Традиционно, у каждой команды может быть до шести аргументов, но в реализации GNU удалено это ограничение (вы могли бы ограничить себя 6 аргументами с целью переносимости). Аргументы разделяются пробелами. Для указания аргумента с пробелами можно использовать двойные кавычки. Все аргументы будут выведены друг за другом без разделяющих пробелов, поэтому для выделения слова жирным и последующим знаком пунктуации прямым можно использовать команду B<\&.BR> Если аргументы не заданы, то команда применяется к следующей строке текста.

source: Other macros and strings
ru: Другие макросы и строки

source: Below are other relevant macros and predefined strings. Unless noted otherwise, all macros cause a break (end the current line of text). Many of these macros set or use the "prevailing indent." The "prevailing indent" value is set by any macro with the parameter I<i> below; macros may omit I<i> in which case the current prevailing indent will be used. As a result, successive indented paragraphs can use the same indent without respecifying the indent value. A normal (nonindented) paragraph resets the prevailing indent value to its default value (0.5 inches). By default, a given indent is measured in ens; try to use ens or ems as units for indents, since these will automatically adjust to font size changes. The other key macro definitions are:
ru: Далее описываются другие сопутствующие макросы и предопределённые строки. Если не указано обратного, все макросы выполняют разрыв (конец текста в текущей строке). Многие из этих макросов изменяют или используют «преобладающий отступ». Это значение изменяется любым макросом с параметром I<i> ниже; в макросы можно не указывать I<i> и в этом случае будет использован текущий преобладающий отступ. Это позволяет использовать единый отступ для рядом стоящих параграфов без указания значения отступа. Обычный (без отступа) параграф сбрасывает значение преобладающего отступа в значение по умолчанию (0.5 дюйма). По умолчанию, задаваемый отступ измеряется в ens; старайтесь использовать для отступов единицы измерения ens или ems, так как при этом автоматически выбирается правильный размер шрифта. Другие основные макросы:

source: Normal paragraphs
ru: Обычные параграфы

source: Same as B<\&.PP> (begin a new paragraph).
ru: Тоже что и B<\&.PP> (начало нового параграфа).

source: Begin a new paragraph and reset prevailing indent.
ru: Начинает новый параграф и сбрасывает преобладающий отступ.

source: Relative margin indent
ru: Относительная граница отступа

source: Start relative margin indent: moves the left margin I<i> to the right (if I<i> is omitted, the prevailing indent value is used). A new prevailing indent is set to 0.5 inches. As a result, all following paragraph(s) will be indented until the corresponding B<\&.RE>.
ru: Начало относительной границы отступа: левая граница I<i> перемещается вправо (если I<i> не задано, то используется преобладающий отступ). Новым значением преобладающего отступа становится 0.5 дюйма. В результате все последующие параграфы будут иметь отступ пока не появится соответствующий B<\&.RE>.

source: End relative margin indent and restores the previous value of the prevailing indent.
ru: Завершает учёт относительной границы отступа и восстанавливает предыдущее значение преобладающего отступа.

source: Indented paragraph macros
ru: Макросы параграфа с отступом

source: Begin paragraph with a hanging indent (the first line of the paragraph is at the left margin of normal paragraphs, and the rest of the paragraph's lines are indented).
ru: Начинает параграф с висящим отступом (первая строка параграфа имеет левую границу как у обычных параграфов, а остальные строки параграфа имеют отступ).

source: Indented paragraph with optional hanging tag. If the tag I<x> is omitted, the entire following paragraph is indented by I<i>. If the tag I<x> is provided, it is hung at the left margin before the following indented paragraph (this is just like B<\&.TP> except the tag is included with the command instead of being on the following line). If the tag is too long, the text after the tag will be moved down to the next line (text will not be lost or garbled). For bulleted lists, use this macro with \e(bu (bullet) or \e(em (em dash) as the tag, and for numbered lists, use the number or letter followed by a period as the tag; this simplifies translation to other formats.
ru: Параграф с отступом и необязательным весящим тегом. Если тег I<x> не указан, то весь последующий параграф имеет отступ I<i>. Если тег I<x> задан, то он висит у левой границы перед последующим параграфом с отступом (как при B<\&.TP>, то тег стоит рядом с командой, а не на следующей строке). Если тег слишком длинный, то текст после тега будет помещён вниз на следующую строку (текст не теряется или искажается). Для списков с маркером используйте этот макрос с \e(bu (маркер) или \e(em (тире) в качестве тега, а для нумерованных списков в качестве тега используйте цифру или букву с точкой; это упрощает трансляцию в другие форматы.

source: Begin paragraph with hanging tag. The tag is given on the next line, but its results are like those of the B<\&.IP> command.
ru: Начинает параграф с висящим тегом. Тег задаётся на следующей строке, но результат будет подобен команде B<\&.IP>.

source: Hypertext link macros
ru: Макросы гиперссылок

source: Insert a hypertext link to the URI (URL) I<url>, with all text up to the following B<\&.UE> macro as the link text.
ru: Вставляет гипертекстовую ссылку в URI (URL) I<url> в виде текста ссылки, окружая её текстом до следующего макроса B<\&.UE>.

source: [I<trailer>] Terminate the link text of the preceding B<\&.UR> macro, with the optional I<trailer> (if present, usually a closing parenthesis and/or end-of-sentence punctuation) immediately following. For non-HTML output devices (e.g., B<man -Tutf8>), the link text is followed by the URL in angle brackets; if there is no link text, the URL is printed as its own link text, surrounded by angle brackets. (Angle brackets may not be available on all output devices.) For the HTML output device, the link text is hyperlinked to the URL; if there is no link text, the URL is printed as its own link text.
ru: [I<trailer>] Завершает текст ссылки из макроса B<\&.UR> необязательным I<trailer> (если есть, то это, обычно закрывающая круглая скобка и/или знак конца элемента), указываем тут же. Для устройств, не выводящих HTML (например, B<man -Tutf8>), текст ссылки указывается после URL в угловых скобках; если текста нет, то URL печатается как ссылка, окружённая в квадратных скобках (угловые скобки могут отсутствовать на некоторых устройствах). Для устройств выводящих HTML, текст ссылки ведёт на URL; если текста нет, то печатается URL как ссылка.

source: These macros have been supported since GNU Troff 1.20 (2009-01-05) and Heirloom Doctools Troff since 160217 (2016-02-17).
ru: Эти макросы поддерживаются в GNU Troff начиная с версии 1.20 (2009-01-05) и в Heirloom Doctools Troff начиная с версии 160217 (2016-02-17).

source: Miscellaneous macros
ru: Различные макросы

source: Reset tabs to default tab values (every 0.5 inches); does not cause a break.
ru: Сбрасывает значение табуляций в умолчательное (каждые 0.5 дюйма); не приводит к разрыву.

source: Set inter-paragraph vertical distance to d (if omitted, d=0.4v); does not cause a break.
ru: Устанавливает вертикальное расстояние между параграфами равным d (если не указано, то d=0.4v); не приводит к разрыву.

source: Subheading I<t> (like B<\&.SH>, but used for a subsection inside a section).
ru: Подзаголовок I<t> (как B<\&.SH>, но используется для подраздела внутри раздела).

source: Predefined strings
ru: Предопределенные строки

source: The B<man> package has the following predefined strings:
ru: В пакете B<man> есть следующие предопределённые строки:

source: Registration Symbol: \*R
ru: Символ регистрации прав: \*R

source: Change to default font size
ru: Изменяет размер шрифта по умолчанию

source: Trademark Symbol: \*(Tm
ru: Това́рный знак: \*(Tm

source: Left angled double quote: ``
ru: Двойная кавычка с наклоном влево: ``

source: Right angled double quote: ''
ru: Двойная кавычка с наклоном вправо: "

source: Safe subset
ru: Безопасный набор
