Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Hook function pointers are never saved or restored by these functions, with two exceptions: if malloc checking (see B<mallopt>(3)) was in use when B<malloc_get_state>() was called, then B<malloc_set_state>() resets malloc checking hooks if possible; if malloc checking was not in use in the recorded state, but the caller has requested malloc checking, then the hooks are reset to 0.
ru: Эти функции никогда не сохраняют и не восстанавливают указатели на перехватывающие функции, но есть два исключения: если вызваны проверки malloc (смотрите B<mallopt>(3)), то, если возможно, B<malloc_get_state>() сбрасывает проверки malloc перехватывающих функций; если проверки malloc не используются в сохранённом состоянии, но вызывающий их запросил, то перехватывающие функции сбрасываются в 0.

source: __malloc_hook, __malloc_initialize_hook, __memalign_hook, __free_hook, __realloc_hook, __after_morecore_hook - malloc debugging variables
ru: __malloc_hook, __malloc_initialize_hook, __memalign_hook, __free_hook, __realloc_hook, __after_morecore_hook - переменные отладки malloc

source: The GNU C library lets you modify the behavior of B<malloc>(3), B<realloc>(3), and B<free>(3) by specifying appropriate hook functions. You can use these hooks to help you debug programs that use dynamic memory allocation, for example.
ru: Библиотека GNU C позволяет изменить поведение B<malloc>(3), B<realoc>(3) и B<free>(3), указав соответствующие «обрабатывающие» (hook) функции. Вы можете использовать эти функции-обработчики для отладки программ, использующих динамическое выделение памяти.

source: The variable B<__malloc_initialize_hook> points at a function that is called once when the malloc implementation is initialized. This is a weak variable, so it can be overridden in the application with a definition like the following:
ru: Переменная B<__ malloc_initialize_hook> указывает на функцию, которая однократно вызывается при инициализации реализации malloc. Это — слабая переменная, поэтому она может быть переопределена в приложении как показано далее:

source: Now the function I<my_init_hook>() can do the initialization of all hooks.
ru: Теперь функция I<my_init_hook>() может проинициализировать все функции-обработчики.

source: The four functions pointed to by B<__malloc_hook>, B<__realloc_hook>, B<__memalign_hook>, B<__free_hook> have a prototype like the functions B<malloc>(3), B<realloc>(3), B<memalign>(3), B<free>(3), respectively, except that they have a final argument I<caller> that gives the address of the caller of B<malloc>(3), etc.
ru: У четырёх функций, на которые указывают переменные B<__malloc_hook>, B<__realloc_hook>, B<__memalign_hook>, B<__free_hook>, имеются прототипы, подобные функциям B<malloc>(3), B<realloc>(3), B<memalign>(3), B<free>(3), соответственно, однако у них есть дополнительный последний параметр I<caller>, в который передаётся адрес вызывающего B<malloc>(3) и т.д.

source: The variable B<__after_morecore_hook> points at a function that is called each time after B<sbrk>(2) was asked for more memory.
ru: Переменная B<__ after_morecore_hook> указывает на функцию, которая вызывается каждый раз после того, как B<sbrk>(2) просят увеличить память.

source: The use of these hook functions is not safe in multithreaded programs, and they are now deprecated. From glibc 2.24 onwards, the B<__malloc_initialize_hook> variable has been removed from the API. Programmers should instead preempt calls to the relevant functions by defining and exporting functions such as "malloc" and "free".
ru: Использование этих обрабатывающих функций не безопасно в многонитевых программах, и теперь они считаются устаревшими. Начиная с glibc версии 2.24, переменная B<__ malloc_initialize_hook> была удалена из программного интерфейса. Теперь вместо неё программисты должны подменять вызовы соответствующих функций, определяя и экспортируя такие функции как «malloc» и «free».

source: Here is a short example of how to use these variables.
ru: Вот короткий пример того, как использовать эти переменные.

source: /* Prototypes for our hooks. */ static void my_init_hook(void); static void *my_malloc_hook(size_t, const void *);
ru: /* прототипы наших функций */ static void my_init_hook(void); static void *my_malloc_hook(size_t, const void *);

source: /* Variables to save original hooks. */ static void *(*old_malloc_hook)(size_t, const void *);
ru: /* переменные для сохранения имеющихся обрабатывающих функций */ static void *(*old_malloc_hook)(size_t, const void *);

source: /* Override initializing hook from the C library. */ void (*__malloc_initialize_hook) (void) = my_init_hook;
ru: /* переопределяем первоначальные функции библиотеки C */ void (*__malloc_initialize_hook) (void) = my_init_hook;

source: /* Restore all old hooks */ __malloc_hook = old_malloc_hook;
ru: /* Восстанавливаем старые функции */ __malloc_hook = old_malloc_hook;

source: /* Call recursively */ result = malloc(size);
ru: /* вызываем рекурсивно */ result = malloc(size);

source: /* Save underlying hooks */ old_malloc_hook = __malloc_hook;
ru: /* сохраняем нижележащие функции */ old_malloc_hook = __malloc_hook;

source: /* printf() might call malloc(), so protect it too. */ printf("malloc(%u) called from %p returns %p\en", (unsigned int) size, caller, result);
ru: /* printf() тоже может вызвать malloc(), поэтому его тоже надо защитить */ printf("malloc(%u) called from %p returns %p\en", (unsigned int) size, caller, result);

source: /* Restore our own hooks */ __malloc_hook = my_malloc_hook;
ru: /* восстанавливаем наши функции */ __malloc_hook = my_malloc_hook;

source: mq_unlink - remove a message queue
ru: mq_unlink - удаляет очередь сообщений

source: B<mq_unlink>() removes the specified message queue I<name>. The message queue name is removed immediately. The queue itself is destroyed once any other processes that have the queue open close their descriptors referring to the queue.
ru: Функция B<mq_unlink>() удаляет именованную очередь сообщений с именем I<name>. Имя очереди сообщений удаляется немедленно. А очередь сообщений уничтожается после того, как все остальные процессы, в которых она открыт, закроют её.

source: On success B<mq_unlink>() returns 0; on error, -1 is returned, with I<errno> set to indicate the error.
ru: При успешном выполнении B<mq_unlink>() возвращается 0; при ошибке возвращается -1, а в I<errno> помещается код ошибки.

source: The caller does not have permission to unlink this message queue.
ru: Вызывающий не имеет прав на доступ для отсоединения очереди сообщений.

source: There is no message queue with the given I<name>.
ru: Очередь сообщений с указанным I<name> отсутствует.

source: malloc_usable_size - obtain size of block of memory allocated from heap
ru: malloc_usable_size - размер блока отданного из кучи

source: The B<malloc_usable_size>() function returns the number of usable bytes in the block pointed to by I<ptr>, a pointer to a block of memory allocated by B<malloc>(3) or a related function.
ru: Функция B<malloc_usable_size>() возвращает число байт в блоке. Вычисляет размер блока на который указывает I<ptr>. В качестве параметра следует использовать указатель полученный от функции B<malloc>(3) или от функции связанной с ней.

source: B<malloc_usable_size>() returns the number of usable bytes in the block of allocated memory pointed to by I<ptr>. If I<ptr> is NULL, 0 is returned.
ru: Функция B<malloc_usable_size>() возвращает число байт в блоке выделенном B<malloc>(). Размер вычисляется для блока на который указывает I<ptr>. Если I<ptr> содержит NULL, то функция вернёт 0.

source: The value returned by B<malloc_usable_size>() may be greater than the requested size of the allocation because of alignment and minimum size constraints. Although the excess bytes can be overwritten by the application without ill effects, this is not good programming practice: the number of excess bytes in an allocation depends on the underlying implementation.
ru: Значение, возвращенное B<malloc_usable_size>(), может быть больше, чем то значение которое вы указали в B<malloc>(). Это происходит из-за выравнивания и ограничений на минимальный размер блока. Хотя изменение лишних байт не может привести к ошибкам, это не хорошая практика программирования: так как наличие и число лишних байт зависит от реализации B<malloc>.

source: The main use of this function is for debugging and introspection.
ru: В основном эта функция применяется для отладки и самоанализа.

source: malloc_stats - print memory allocation statistics
ru: malloc_stats — вывести статистику для выделенной памяти

source: The B<malloc_stats>() function prints (on standard error) statistics about memory allocated by B<malloc>(3) and related functions. For each arena (allocation area), this function prints the total amount of memory allocated and the total number of bytes consumed by in-use allocations. (These two values correspond to the I<arena> and I<uordblks> fields retrieved by B<mallinfo>(3).) In addition, the function prints the sum of these two statistics for all arenas, and the maximum number of blocks and bytes that were ever simultaneously allocated using B<mmap>(2).
ru: Функция B<malloc_stats>() печатает (через стандартный вывод ошибок) статистику о выделенной, при помощи B<malloc>(3) или других функций, памяти. Для каждой области выделяемой памяти (арене), эта функция печатает общее количество выделенной памяти и общее число затраченных на это байт. (Эти два значения соответствуют полям I<arena> и I<uordblks> возвращаемым B<mallinfo>(3)). В дополнение, функция печатает сумму этих двух статистик для всех арен и максимальное число блоков и байт, которые когда-либо были одновременно выделены при использовании B<mmap>(2).

source: More detailed information about memory allocations in the main arena can be obtained using B<mallinfo>(3).
ru: Для более детальной информации о выделении памяти в главной арене используйте B<mallinfo>(3).

source: malloc, free, calloc, realloc - allocate and free dynamic memory
ru: malloc, free, calloc, realloc - распределяет и освобождает динамическую память

source: _GNU_SOURCE Since glibc 2.29: _DEFAULT_SOURCE Glibc 2.28 and earlier: _GNU_SOURCE
ru: _GNU_SOURCE Начиная с glibc 2.29: _DEFAULT_SOURCE В glibc 2.28 и старее: _GNU_SOURCE

source: The B<malloc>() function allocates I<size> bytes and returns a pointer to the allocated memory. I<The memory is not initialized>. If I<size> is 0, then B<malloc>() returns either NULL, or a unique pointer value that can later be successfully passed to B<free>().
ru: Функция B<malloc>() распределяет I<size> байтов и возвращает указатель на распределённую память. I<Память при этом не инициализируется>. Если значение I<size> равно 0, то B<malloc>() возвращает или NULL, или уникальный указатель, который можно без опасений передавать B<free>().

source: The B<free>() function frees the memory space pointed to by I<ptr>, which must have been returned by a previous call to B<malloc>(), B<calloc>(), or B<realloc>(). Otherwise, or if I<free(ptr)> has already been called before, undefined behavior occurs. If I<ptr> is NULL, no operation is performed.
ru: Функция B<free>() освобождает место в памяти, указанное в I<ptr>, которое должно быть получено ранее вызовом функции B<malloc>(), B<calloc>() или B<realloc>(). Иначе (или если вызов I<free(ptr)> уже выполнялся) дальнейшее поведение не определено. Если значение I<ptr> равно NULL, то не выполняется никаких действий.

source: The B<calloc>() function allocates memory for an array of I<nmemb> elements of I<size> bytes each and returns a pointer to the allocated memory. The memory is set to zero. If I<nmemb> or I<size> is 0, then B<calloc>() returns either NULL, or a unique pointer value that can later be successfully passed to B<free>(). If the multiplication of I<nmemb> and I<size> would result in integer overflow, then B<calloc>() returns an error. By contrast, an integer overflow would not be detected in the following call to B<malloc>(), with the result that an incorrectly sized block of memory would be allocated:
ru: Функция B<сalloc>() распределяет память для массива размером I<nmemb> элементов по I<size> байтов каждый и возвращает указатель на распределённую память. Данные в выделенной памяти при этом обнуляются. Если значение I<nmemb> или I<size> равно 0, то B<calloc>() возвращает NULL или уникальный указатель, который можно без опасений передавать B<free>(). Если перемножение I<nmemb> и I<size> приводит к целочисленному переполнению, то B<calloc>() возвращает ошибку. Это отличает её от B<malloc>(), которая не обнаруживает целочисленное переполнение и возвращает блок памяти неправильного размера:

source: The B<realloc>() function changes the size of the memory block pointed to by I<ptr> to I<size> bytes. The contents will be unchanged in the range from the start of the region up to the minimum of the old and new sizes. If the new size is larger than the old size, the added memory will I<not> be initialized. If I<ptr> is NULL, then the call is equivalent to I<malloc(size)>, for all values of I<size>; if I<size> is equal to zero, and I<ptr> is not NULL, then the call is equivalent to I<free(ptr)>. Unless I<ptr> is NULL, it must have been returned by an earlier call to B<malloc>(), B<calloc>(), or B<realloc>(). If the area pointed to was moved, a I<free(ptr)> is done.
ru: Функция B<realloc>() меняет размер блока памяти, на который указывает I<ptr>, на размер, равный I<size> байт. Содержимое памяти не будет изменено от начала области в пределах наименьшего из старого и нового размеров. Если новый размер больше старого, то добавленная память I<не> будет инициализирована. Если значение I<ptr> равно NULL, то вызов эквивалентен I<malloc(size)> для всех значений I<size>; если значение I<size> равно нулю и I<ptr> не равно NULL, то вызов эквивалентен I<free(ptr)>. Если только значение I<ptr> не равно NULL, то должно быть возвращено ранее полученное значение от B<malloc>(), B<calloc>() или B<realloc>(). Если область была перемещена, то выполняется I<free(ptr)>.

source: The B<reallocarray>() function changes the size of the memory block pointed to by I<ptr> to be large enough for an array of I<nmemb> elements, each of which is I<size> bytes. It is equivalent to the call
ru: Функция B<reallocarray>() изменяет размер блока памяти, на который указывает I<ptr>, таким образом, чтобы он смог вместить массив из I<nmemb> элементов, каждый из которых занимает I<size> байт. Она эквивалентна вызову

source: However, unlike that B<realloc>() call, B<reallocarray>() fails safely in the case where the multiplication would overflow. If such an overflow occurs, B<reallocarray>() returns NULL, sets I<errno> to B<ENOMEM>, and leaves the original block of memory unchanged.
ru: Однако в отличие от вызова B<realloc>(), функция B<reallocarray>() безопасно завершается ошибкой в случае возникновения переполнения умножения. Если это происходит, то B<reallocarray>() возвращает NULL, присваивает I<errno> значение B<ENOMEM> и оставляет первоначальный блок памяти в неизменном виде.

source: The B<malloc>() and B<calloc>() functions return a pointer to the allocated memory, which is suitably aligned for any built-in type. On error, these functions return NULL. NULL may also be returned by a successful call to B<malloc>() with a I<size> of zero, or by a successful call to B<calloc>() with I<nmemb> or I<size> equal to zero.
ru: Функции B<malloc>() и B<calloc>() возвращают указатель на распределённую память, выровненную должным образом для любого встроенного типа. При ошибке возвращается NULL. Значение NULL также может быть получено при успешной работе вызова B<malloc>(), если значение I<size> равно нулю, или B<calloc>() — если значение I<nmemb> или I<size> равно нулю.

source: The B<free>() function returns no value.
ru: Функция B<free>() ничего не возвращает.

source: The B<realloc>() function returns a pointer to the newly allocated memory, which is suitably aligned for any built-in type and may be different from I<ptr>, or NULL if the request fails. If I<size> was equal to 0, either NULL or a pointer suitable to be passed to B<free>() is returned. If B<realloc>() fails, the original block is left untouched; it is not freed or moved.
ru: Функция B<realloc>() возвращает указатель на новую распределённую память, выровненную должным образом для любого встроенного типа. Возвращаемый указатель может отличаться от I<ptr>, или равняться NULL, если запрос завершился с ошибкой. Если значение I<size> было равно нулю, то возвращается либо NULL, либо указатель, который может быть передан B<free>(). Если B<realloc>() завершилась с ошибкой, то начальный блок памяти остаётся нетронутым: он не освобождается или перемещается.

source: On success, the B<reallocarray>() function returns a pointer to the newly allocated memory. On failure, it returns NULL and the original block of memory is left untouched.
ru: При успешном выполнении функция B<reallocarray>() возвращает указатель на новую выделенную память. При ошибке возвращается NULL, а первоначальный блок памяти не изменяется.

source: B<calloc>(), B<malloc>(), B<realloc>(), and B<reallocarray>() can fail with the following error:
ru: Функции B<calloc>(), B<malloc>(), B<realloc>() и B<reallocarray>() могут завершаться со следующей ошибкой:

source: Out of memory. Possibly, the application hit the B<RLIMIT_AS> or B<RLIMIT_DATA> limit described in B<getrlimit>(2).
ru: Не хватает памяти. Вероятно приложение достигнут лимит B<RLIMIT_AS> или B<RLIMIT_DATA>, описанный в B<getrlimit>(2).

source: B<reallocarray>() is a nonstandard extension that first appeared in OpenBSD 5.6 and FreeBSD 11.0.
ru: Функция B<reallocarray>() является нестандартным расширением, впервые появилась в OpenBSD 5.6 и FreeBSD 11.0.

source: By default, Linux follows an optimistic memory allocation strategy. This means that when B<malloc>() returns non-NULL there is no guarantee that the memory really is available. In case it turns out that the system is out of memory, one or more processes will be killed by the OOM killer. For more information, see the description of I</proc/sys/vm/overcommit_memory> and I</proc/sys/vm/oom_adj> in B<proc>(5), and the Linux kernel source file I<Documentation/vm/overcommit-accounting.rst>.
ru: По умолчанию, Linux придерживается оптимистичной стратегии распределения памяти. Это означает, что когда B<malloc>() возвращает значение не NULL, то нет никаких гарантий, что память в действительности доступна. Если обнаружится, что системе не хватает памяти, то один или несколько процессов будут завершены OOM. Дополнительную информацию можно получить из описания I</proc/sys/vm/overcommit_memory> и I</proc/sys/vm/oom_adj> в B<proc>(5) и файле из исходного кода ядра Linux I<Documentation/vm/overcommit-accounting.rst>.

source: Normally, B<malloc>() allocates memory from the heap, and adjusts the size of the heap as required, using B<sbrk>(2). When allocating blocks of memory larger than B<MMAP_THRESHOLD> bytes, the glibc B<malloc>() implementation allocates the memory as a private anonymous mapping using B<mmap>(2). B<MMAP_THRESHOLD> is 128\ kB by default, but is adjustable using B<mallopt>(3). Prior to Linux 4.7 allocations performed using B<mmap>(2) were unaffected by the B<RLIMIT_DATA> resource limit; since Linux 4.7, this limit is also enforced for allocations performed using B<mmap>(2).
ru: Обычно, B<malloc>() выделяет память из кучи и подгоняет размер кучи соответствующим образом с помощью B<sbrk>(2). Если выделяемый блок памяти больше чем B<MMAP_THRESHOLD> байт, то реализация B<malloc>() в glibc выделяет память с помощью B<mmap>(2) в виде частного анонимного отображения. По умолчанию, значение B<MMAP_THRESHOLD> равно 128\ КБ, но его можно изменить с помощью B<mallopt>(3). До Linux 4.7 на выделения, выполняемые с помощью B<mmap>(2), не влияет ограничитель ресурса B<RLIMIT_DATA>; начиная с Linux 4.7 это ограничение также применяется к выделениям, созданным с помощью B<mmap>(2).

source: To avoid corruption in multithreaded applications, mutexes are used internally to protect the memory-management data structures employed by these functions. In a multithreaded application in which threads simultaneously allocate and free memory, there could be contention for these mutexes. To scalably handle memory allocation in multithreaded applications, glibc creates additional I<memory allocation arenas> if mutex contention is detected. Each arena is a large region of memory that is internally allocated by the system (using B<brk>(2) or B<mmap>(2)), and managed with its own mutexes.
ru: Внутри данных функций для защиты от повреждений выделяемых структур данных управления памятью, используются мьютексы. В многонитевых приложениях, в которых нити одновременно выделяют и освобождают память, может возникнуть конфликт за обладание этими мьютексами. Чтобы расширить обработку выделения памяти в многонитевых приложениях библиотека glibc создаёт дополнительные I<области выделения памяти> (memory allocation arenas), если обнаруживается конфликт. Каждая область представляет собой большой кусок памяти, который внутренне выделен системой (с помощью B<brk>(2) или B<mmap>(2)) и управляется своими собственными мьютексами.

source: SUSv2 requires B<malloc>(), B<calloc>(), and B<realloc>() to set I<errno> to B<ENOMEM> upon failure. Glibc assumes that this is done (and the glibc versions of these routines do this); if you use a private malloc implementation that does not set I<errno>, then certain library routines may fail without having a reason in I<errno>.
ru: Стандарт SUSv2 требует, чтобы функции B<malloc>(), B<calloc>() и B<realloc>() при ошибках присваивали значение B<ENOMEM> переменной I<errno>. Glibc допускает, что это уже реализовано (и версии glibc этих функций делают это); если вы используете свою реализацию функции malloc, которая не изменяет I<errno>, то некоторые функции библиотеки могут закончить работу с ошибкой без указания причины в I<errno>.

source: Crashes in B<malloc>(), B<calloc>(), B<realloc>(), or B<free>() are almost always related to heap corruption, such as overflowing an allocated chunk or freeing the same pointer twice.
ru: Аварийные ситуации в B<malloc>(), B<calloc>(), B<realloc>() или B<free>() почти всегда связаны с повреждением кучи, например, с переполнением больших распределённых участков памяти или освобождением одного и того же указателя дважды.

source: The B<malloc>() implementation is tunable via environment variables; see B<mallopt>(3) for details.
ru: Реализация B<malloc>() настраивается с помощью переменных окружения; подробности смотрите в B<mallopt>(3).

source: For details of the GNU C library implementation, see E<.UR https://sourceware.org/glibc/wiki/MallocInternals> E<.UE .>
ru: Информацию о реализации в библиотеке GNU C смотрите в E<.UR https://sourceware.org/glibc/wiki/MallocInternals> E<.UE .>

source: mallinfo - obtain memory allocation information
ru: mallinfo — возвращает информацию о выделении памяти
