Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: For those few I<man-pages> pages in Sections 1 and 8, probably you just want to write I<GNU>.
ru: Для нескольких страниц I<man-pages> в Разделах 1 и 8, можно написать I<GNU>.

source: For system calls, just write I<Linux>. (An earlier practice was to write the version number of the kernel from which the manual page was being written/checked. However, this was never done consistently, and so was probably worse than including no version number. Henceforth, avoid including a version number.)
ru: Для системных вызовов — I<Linux>. (Ранее, стандартной практикой было писать версию ядра, используя которую был написана или проверена страница. Это никогда не было общепринятым. Так что не делайте этого).

source: For library calls that are part of glibc or one of the other common GNU libraries, just use I<GNU C Library>, I<GNU>, or an empty string.
ru: Для библиотечных вызовов, являющихся частью glibc или других библиотек GNU — I<GNU C Library>, I<GNU>, или пустую строку.

source: For Section 4 pages, use I<Linux>.
ru: Для страниц из Раздела 4 — I<Linux>.

source: In cases of doubt, just write I<Linux>, or I<GNU>.
ru: Если возникают сомнения — I<Linux> или I<GNU>.

source: I<manual>
ru: I<справочник>

source: The title of the manual (e.g., for Section 2 and 3 pages in the I<man-pages> package, use I<Linux Programmer's Manual>).
ru: Название справочника (например для Разделов 2, 3 в пакете I<man-pages> — I<Linux Programmer's Manual>).

source: Sections within a manual page
ru: Разделы внутри справочной страницы

source: The list below shows conventional or suggested sections. Most manual pages should include at least the B<highlighted> sections. Arrange a new manual page so that sections are placed in the order shown in the list.
ru: Следующий список содержит общепринятые и рекомендуемые разделы. Большинство справочных страниц должно включать в себя по крайней мере B<выделенные жирным> разделы. Соблюдайте очередность, как показано в списке.

source: B<NAME> B<SYNOPSIS> CONFIGURATION [Normally only in Section 4] B<DESCRIPTION> OPTIONS [Normally only in Sections 1, 8] EXIT STATUS [Normally only in Sections 1, 8] RETURN VALUE [Normally only in Sections 2, 3] ERRORS [Typically only in Sections 2, 3] ENVIRONMENT FILES VERSIONS [Normally only in Sections 2, 3] ATTRIBUTES [Normally only in Sections 2, 3] CONFORMING TO NOTES BUGS EXAMPLE B<SEE ALSO>
ru: B<ИМЯ> B<ОБЗОР> КОНФИГУРАЦИЯ [Как правило, только в разделе 4] B<ОПИСАНИЕ> ПАРАМЕТРЫ [Как правило, только в разделах 1, 8] КОД ВЫХОДА [Как правило, только в разделах 1, 8] ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ [Как правило, только в разделах 2, 3] ОШИБКИ [Обычно только в разделах 2, 3] ОКРУЖЕНИЕ ФАЙЛЫ ВЕРСИИ [Как правило, только в разделах 2, 3] АТРИБУТЫ [Как правило, только в разделах 2, 3] СООТВЕТСТВИЕ СТАНДАРТАМ ЗАМЕЧАНИЯ ДЕФЕКТЫ ПРИМЕРЫ B<СМОТРИ ТАКЖЕ>

source: I<Where a traditional heading would apply>, I<please use it>; this kind of consistency can make the information easier to understand. If you must, you can create your own headings if they make things easier to understand (this can be especially useful for pages in Sections 4 and 5). However, before doing this, consider whether you could use the traditional headings, with some subsections (I<.SS>) within those sections.
ru: I<Там, где обычно используются заголовки>, I<используйте их>; это правило может сделать информацию более доступной для понимания. Если это необходимо, Вы можете создать свои собственные заголовки, если они сделают текст более понятным (это может быть особенно полезным для страниц в разделах 4 и 5). Тем не менее, прежде чем создавать их, подумайте, можно ли обойтись традиционными заголовками с созданием своих собственных подразделов (I<.SS>) в пределах стандартных разделов.

source: The following list elaborates on the contents of each of the above sections.
ru: В приведённом ниже списке объясняется назначение каждого из разделов.

source: B<NAME>
ru: B<ИМЯ>

source: The name of this manual page.
ru: Название данной справочной страниц.

source: See B<man>(7) for important details of the line(s) that should follow the B<.SH NAME> command. All words in this line (including the word immediately following the "\e-") should be in lowercase, except where English or technical terminological convention dictates otherwise.
ru: Смотрите B<man>(7), чтобы ознакомиться с правилами написания заголовков, которые должны следовать за командой B<.SH NAME>. Все слова в этой строке (в том числе идущие сразу после «\e-») должны быть в нижнем регистре, за исключением тех случаев, когда правилами языка, на котором написана страница, или сложившейся практикой употребления технических терминов определено иное.

source: B<SYNOPSIS>
ru: B<ОБЗОР>

source: A brief summary of the command or function's interface.
ru: Краткое описание команды или интерфейса функции

source: For commands, this shows the syntax of the command and its arguments (including options); boldface is used for as-is text and italics are used to indicate replaceable arguments. Brackets ([]) surround optional arguments, vertical bars (|) separate choices, and ellipses (\&...) can be repeated. For functions, it shows any required data declarations or B<#include> directives, followed by the function declaration.
ru: Для команд здесь показываются синтаксис и аргументы (включая параметры); полужирное начертание используется для неизменяемого текста, а курсивом обозначаются меняющиеся аргументы. Квадратные скобки ([]) показывают необязательные аргументы, вертикальная черта (|) указывает на выбор одного из вариантов, многоточие (\&...) означает возможное повторение. Для функций показываются все необходимые объявления данных или B<#include> директивы с последующим объявлением функции.

source: Where a feature test macro must be defined in order to obtain the declaration of a function (or a variable) from a header file, then the SYNOPSIS should indicate this, as described in B<feature_test_macros>(7).
ru: Если для получения объявления функции (или переменной) из заголовочного файла требуется определить макрос тестирования свойств, то это указывается в ОБЗОРЕ согласно описанию из B<feature_test_macros>(7).

source: B<CONFIGURATION>
ru: B<КОНФИГУРАЦИЯ>

source: Configuration details for a device.
ru: Особенности настройки устройства

source: This section normally appears only in Section 4 pages.
ru: Этот раздел, как правило, присутствует только в разделе 4.

source: B<DESCRIPTION>
ru: B<ОПИСАНИЕ>

source: An explanation of what the program, function, or format does.
ru: Объяснение того, для чего предназначена программа, функция или формат

source: Discuss how it interacts with files and standard input, and what it produces on standard output or standard error. Omit internals and implementation details unless they're critical for understanding the interface. Describe the usual case; for information on command-line options of a program use the B<OPTIONS> section.
ru: Здесь описывается взаимодействие с файлами и стандартным вводом, и что записывается в стандартный вывода вывод или ошибок; не приводятся детали реализации, если они не критичны для понимания интерфейса; показывается типичное использование; информация о параметрах командной строки программы даётся в разделе B<OPTIONS>.

source: When describing new behavior or new flags for a system call or library function, be careful to note the kernel or C library version that introduced the change. The preferred method of noting this information for flags is as part of a B<.TP> list, in the following form (here, for a new system call flag):
ru: Если описывается новое поведение или новые флаги системного вызова или библиотечной функции, отметьте где введено изменение — версию ядра или библиотеки С. Данную информацию целесообразно приводить в виде части списка B<.TP> в следующем виде (здесь показан новый флаг системного вызова):

source: B<XYZ_FLAG> (since Linux 3.7)
ru: B<XYZ_FLAG> (начиная с Linux 3.7)

source: Description of flag...
ru: Описание флагов…

source: Including version information is especially useful to users who are constrained to using older kernel or C library versions (which is typical in embedded systems, for example).
ru: Включает информацию о версии, что особенно востребовано пользователями, которые вынуждены использовать старые версии ядра или библиотеки C (что характерно, например, для встраиваемых систем).

source: B<OPTIONS>
ru: B<ПАРАМЕТРЫ>

source: A description of the command-line options accepted by a program and how they change its behavior.
ru: Описание параметров командной строки и их влияния на поведение программы.

source: This section should appear only for Section 1 and 8 manual pages.
ru: Этот раздел как правило содержится только в разделах 1 и 8.

source: B<EXIT STATUS>
ru: B<КОД ВЫХОДА>

source: A list of the possible exit status values of a program and the conditions that cause these values to be returned.
ru: Перечень возможных значений кода выхода программы и ситуаций, при которых программа возвращает данное значение кода.

source: B<RETURN VALUE>
ru: B<ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ>

source: For Section 2 and 3 pages, this section gives a list of the values the library routine will return to the caller and the conditions that cause these values to be returned.
ru: Для разделов 2 и 3 эта секция содержит перечень значений, возвращаемых библиотеками вызывающей их программе и условия, при которых библиотеки возвращают данные значения.

source: B<ERRORS>
ru: B<ОШИБКИ>

source: For Section 2 and 3 manual pages, this is a list of the values that may be placed in I<errno> in the event of an error, along with information about the cause of the errors.
ru: В справочных страницах разделов 2 и 3 здесь описываются значения ошибок, которые могут быть помещены в I<errno>, а также приводится описание причин ошибок.

source: Where several different conditions produce the same error, the preferred approach is to create separate list entries (with duplicate error names) for each of the conditions. This makes the separate conditions clear, may make the list easier to read, and allows metainformation (e.g., kernel version number where the condition first became applicable) to be more easily marked for each condition.
ru: Если ошибка возникает при нескольких различных условиях, предпочтительней создавать отдельные записи списка (с повторением имени ошибки) для каждого из условий. Такое разделение делает условия более понятными, этот список проще читать и можно указывать метаинформацию (например, номер версии ядра, в котором условие начало действовать) на каждое условие.

source: I<The error list should be in alphabetical order>.
ru: I<Список ошибок должен быть в алфавитном порядке>.

source: B<ENVIRONMENT>
ru: B<ОКРУЖЕНИЕ>

source: A list of all environment variables that affect the program or function and how they affect it.
ru: Перечень переменных окружения, влияющих на программу и оказываемый ими эффект.

source: B<FILES>
ru: B<ФАЙЛЫ>

source: A list of the files the program or function uses, such as configuration files, startup files, and files the program directly operates on.
ru: Список файлов, используемых программой или функцией, таких как конфигурационные файлы, файлы запуска и файлы, с которыми непосредственно работает программа.

source: Give the full pathname of these files, and use the installation process to modify the directory part to match user preferences. For many programs, the default installation location is in I</usr/local>, so your base manual page should use I</usr/local> as the base.
ru: Указывайте полный путь к этим файлам, также используйте возможность изменить во время установки изменить путь в соответствии с предпочтениями пользователя.

source: B<ATTRIBUTES>
ru: B<АТРИБУТЫ>

source: A summary of various attributes of the function(s) documented on this page. See B<attributes>(7) for further details.
ru: Общая информация о различных атрибутах функции(функций), описанной на этой странице. Смотри B<attributes>(7) для получения дополнительных сведений.

source: B<VERSIONS>
ru: B<ВЕРСИИ>

source: A brief summary of the Linux kernel or glibc versions where a system call or library function appeared, or changed significantly in its operation.
ru: Краткое описание ядра Linux или версии glibc, где впервые появился системный вызов или функция библиотеки, либо существенно изменилось их действие.

source: As a general rule, every new interface should include a VERSIONS section in its manual page. Unfortunately, many existing manual pages don't include this information (since there was no policy to do so when they were written). Patches to remedy this are welcome, but, from the perspective of programmers writing new code, this information probably matters only in the case of kernel interfaces that have been added in Linux 2.4 or later (i.e., changes since kernel 2.2), and library functions that have been added to glibc since version 2.1 (i.e., changes since glibc 2.0).
ru: Как правило, описание каждого нового интерфейса должно включать раздел ВЕРСИИ в справочной странице. К сожалению, в многих справочных страницах эта информация отсутствует (когда они были написаны, не было правила, предписывающего делать это). Заплаты, исправляющие подобные недостатки, приветствуются, но, с точки зрения программистов, пишущих новый код, эта информация, вероятно, имеет значение только в том случае, если интерфейсы ядра были добавлены в Linux 2.4 или позже (т. е., отличаются от ядра 2.2), а для библиотечных функций, если изменения были добавлены начиная с glibc версии 2.1 (т. е., отличаются от glibc 2.0).

source: The B<syscalls>(2) manual page also provides information about kernel versions in which various system calls first appeared.
ru: Справочная страница B<syscalls>(2) также содержит информацию о версиях ядра, в которых были впервые реализованы различные системные вызовы.

source: B<CONFORMING TO>
ru: B<СООТВЕТСТВИЕ СТАНДАРТАМ>

source: A description of any standards or conventions that relate to the function or command described by the manual page.
ru: Описание любых стандартов или соглашений, относящихся к функции или команде, речь о которой идет на странице.

source: The preferred terms to use for the various standards are listed as headings in B<standards>(7).
ru: Предпочтительные обозначения для различных стандартов указаны в качестве заголовков на странице B<standards>(7).

source: For a page in Section 2 or 3, this section should note the POSIX.1 version(s) that the call conforms to, and also whether the call is specified in C99. (Don't worry too much about other standards like SUS, SUSv2, and XPG, or the SVr4 and 4.xBSD implementation standards, unless the call was specified in those standards, but isn't in the current version of POSIX.1.)
ru: Для страницы из раздела 2 или 3, данный раздел должен показывать версию POSIX.1, которой соответствует вызов, а также есть ли вызов в C99 (наличие в других стандартах, таких как SUS, SUSv2 и XPG, или реализациях стандартов SVr4 и 4.xBSD, не важно; если вызов был в этих стандартах, но отсутствует в текущей версии POSIX.1, то это стоит упомянуть).

source: If the call is not governed by any standards but commonly exists on other systems, note them. If the call is Linux-specific, note this.
ru: Если вызов не соответствует какому-либо стандарту, но существует во многих системах, также упомяните об этом. Если вызов есть только в Linux, то это также стоит отметить.

source: If this section consists of just a list of standards (which it commonly does), terminate the list with a period (\(aq.\(aq).
ru: Если данный раздел состоит только из списка стандартов (что, обычно, и есть), завершите список точкой (\(aq.\(aq).

source: B<NOTES>
ru: B<ЗАМЕЧАНИЯ>

source: Miscellaneous notes.
ru: Различные замечания.

source: For Section 2 and 3 man pages you may find it useful to include subsections (B<SS>) named I<Linux Notes> and I<Glibc Notes>.
ru: Для разделов 2 и 3 может быть полезным создание подразделов (B<SS>), озаглавленных I<Примечания для Linux> и I<Примечания для Glibc>.

source: In Section 2, use the heading I<C library/kernel differences> to mark off notes that describe the differences (if any) between the C library wrapper function for a system call and the raw system call interface provided by the kernel.
ru: В разделе 2 используйте заголовок I<Различия между ядром и библиотекой С>, чтобы отметить различия (если имеются) между системными вызовами функций библиотеки и ядра.

source: B<BUGS>
ru: B<ДЕФЕКТЫ>

source: A list of limitations, known defects or inconveniences, and other questionable activities.
ru: Перечень известных ошибок, ограничений, недостатков причиняющих неудобство а также других сомнительных свойств.

source: B<EXAMPLE>
ru: B<ПРИМЕРЫ>

source: One or more examples demonstrating how this function, file or command is used.
ru: Один или несколько примеров, демонстрирующих, каким образом данная функция, команда или файл используются.

source: For details on writing example programs, see I<Example programs> below.
ru: Для получения более подробной информации о написании примеров программ смотрите раздел I<Примеры программ> далее.

source: B<AUTHORS>
ru: B<АВТОРЫ>

source: A list of authors of the documentation or program.
ru: Список авторов документа или программы.

source: B<Use of an AUTHORS section is strongly discouraged>. Generally, it is better not to clutter every page with a list of (over time potentially numerous) authors; if you write or significantly amend a page, add a copyright notice as a comment in the source file. If you are the author of a device driver and want to include an address for reporting bugs, place this under the BUGS section.
ru: B<Использовать раздел АВТОРЫ настоятельно не рекомендуется>. Лучше не загромождать каждую страницу списком авторов (список со временем увеличивается); если вы написали или значительно исправили страницу, добавьте уведомление об авторском праве в виде комментария в исходный файл. Если вы автор драйвера устройства и хотите включить адрес для отправки сообщений об ошибках, то сделайте это в разделе ДЕФЕКТЫ.

source: B<SEE ALSO>
ru: B<СМОТРИ ТАКЖЕ>

source: A comma-separated list of related man pages, possibly followed by other related pages or documents.
ru: Разделённый запятыми список уместных справочных страниц, возможно, ведущих на другие страницы или документы.

source: The list should be ordered by section number and then alphabetically by name. Do not terminate this list with a period.
ru: Список должен быть упорядочен по номеру раздела, а затем по алфавиту. Не заканчивайте список точкой.

source: Where the SEE ALSO list contains many long manual page names, to improve the visual result of the output, it may be useful to employ the I<.ad l> (don't right justify) and I<.nh> (don't hyphenate) directives. Hyphenation of individual page names can be prevented by preceding words with the string "\e%".
ru: Если список B<СМОТРИТЕ ТАКЖЕ> содержит много длинных имён справочных страниц, то для улучшения визуального представления может быть полезно воспользоваться командами I<.ad l> (не выравнивать по правому краю) и I<.nh> (отключить перенос). Запретить перенос имён справочных страниц можно с помощью указания перед словом строки «\e%».

source: Given the distributed, autonomous nature of FOSS projects and their documentation, it is sometimes necessary\(emand in many cases desirable\(emthat the SEE ALSO section includes references to manual pages provided by other projects.
ru: Учитывая распределённую, автономную природу проектов FOSS и их документирование, иногда необходимо — и во многих случаях желательно — включать в раздел B<СМОТРИТЕ ТАКЖЕ> ссылки на справочные страницы из других проектов.

source: STYLE GUIDE
ru: РУКОВОДСТВО ПО СТИЛЮ ОФОРМЛЕНИЯ

source: The following subsections describe the preferred style for the I<man-pages> project. For details not covered below, the Chicago Manual of Style is usually a good source; try also grepping for preexisting usage in the project source tree.
ru: В следующих абзацах представлен предпочтительный стиль написания страница в проекте I<man-pages>. Если что-то не описано подробно, то следует придерживаться чикагского стилистического справочника (Chicago Manual of Style); также постарайтесь поискать схожие примеры в исходном коде дерева проекта.

source: Use of gender-neutral language
ru: Использование гендерно-нейтральных выражений

source: As far as possible, use gender-neutral language in the text of man pages. Use of "they" ("them", "themself", "their") as a gender-neutral singular pronoun is acceptable.
ru: Используйте гендерно-нейтральный язык в тексте справочных страниц насколько это возможно. Приемлемо использовать местоимения «они» («им», «себя», «их»).

source: Formatting conventions for manual pages describing commands
ru: Соглашения о форматировании справочных страниц, описывающих команды

source: For manual pages that describe a command (typically in Sections 1 and 8), the arguments are always specified using italics, I<even in the SYNOPSIS section>.
ru: Для справочных страниц, описывающих команду (как правило в разделах 1 и 8), аргументы всегда указываются с помощью курсива, I<даже в разделе ОБЗОР>.

source: The name of the command, and its options, should always be formatted in bold.
ru: Имя команд и их опции, всегда должны быть оформленными полужирным стилем.

source: Formatting conventions for manual pages describing functions
ru: Соглашения по оформлению справочных страниц, описывающих функции

source: For manual pages that describe functions (typically in Sections 2 and 3), the arguments are always specified using italics, I<even in the SYNOPSIS section>, where the rest of the function is specified in bold:
ru: В справочных страницах, которые описывают функции (обычно, в разделах 2 и 3), параметры всегда оформляются, используя курсив; I<даже в разделе ОБЗОР>, где остальная часть функции определена полужирным:

source: B< int myfunction(int >I<argc>B<, char **>I<argv>B<);>
ru: B< int имя_функции(int >I<argc>B<, char **>I<argv>B<);>

source: Variable names should, like argument names, be specified in italics.
ru: Имена переменных, как и имена параметров, должны быть оформлены курсивом.

source: Any reference to the subject of the current manual page should be written with the name in bold followed by a pair of parentheses in Roman (normal) font. For example, in the B<fcntl>(2) man page, references to the subject of the page would be written as: B<fcntl>(). The preferred way to write this in the source file is:
ru: Любая ссылка на тему текущей справочной страницы должна быть записана с именем оформленным полужирным, включая пару круглых скобок, в прямом(нормальном) шрифте. Например, на странице B<fcntl>(2), ссылки на тему страницы были бы записаны как: B<fcntl>(). Рекомендуемый способ записи в исходном файле:

source: (Using this format, rather than the use of "\efB...\efP()" makes it easier to write tools that parse man page source files.)
ru: (используйте этот формат вместо б\efB...\efP ()» — такой подход упрощает создание инструментов разбора исходных файлов справочных страниц)

source: Formatting conventions (general)
ru: Общие соглашения по оформлению
