Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: static int matherr_ret = 0; /* Value that matherr() should return */ static int change_retval = 0; /* Should matherr() change function\(aqs return value? */ static double new_retval; /* New function return value */
ru: static int matherr_ret = 0; /* значение, которое должна вернуть matherr() */ static int change_retval = 0; /* должна ли matherr() изменять возвращаемое функцией значение? */ static double new_retval; /* новое значение, возвращаемое функцией */

source: int matherr(struct exception *exc) { fprintf(stderr, "matherr %s exception in %s() function\en", (exc-E<gt>type == DOMAIN) ? "DOMAIN" : (exc-E<gt>type == OVERFLOW) ? "OVERFLOW" : (exc-E<gt>type == UNDERFLOW) ? "UNDERFLOW" : (exc-E<gt>type == SING) ? "SING" : (exc-E<gt>type == TLOSS) ? "TLOSS" : (exc-E<gt>type == PLOSS) ? "PLOSS" : "???", exc-E<gt>name); fprintf(stderr, " args: %f, %f\en", exc-E<gt>arg1, exc-E<gt>arg2); fprintf(stderr, " retval: %f\en", exc-E<gt>retval);
ru: int matherr(struct exception *exc) { fprintf(stderr, "исключение matherr %s в функции %s()\en", (exc-E<gt>type == DOMAIN) ? "DOMAIN" : (exc-E<gt>type == OVERFLOW) ? "OVERFLOW" : (exc-E<gt>type == UNDERFLOW) ? "UNDERFLOW" : (exc-E<gt>type == SING) ? "SING" : (exc-E<gt>type == TLOSS) ? "TLOSS" : (exc-E<gt>type == PLOSS) ? "PLOSS" : "???", exc-E<gt>name); fprintf(stderr, " арг: %f, %f\en", exc-E<gt>arg1, exc-E<gt>arg2); fprintf(stderr, " возвр.знач.: %f\en", exc-E<gt>retval);

source: if (argc E<lt> 2) { fprintf(stderr, "Usage: %s E<lt>argvalE<gt>" " [E<lt>matherr-retE<gt> [E<lt>new-func-retvalE<gt>]]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 2) { fprintf(stderr, "Использование: %s E<lt>аргE<gt>" " [E<lt>рез-matherrE<gt> [E<lt>рез-нов-функE<gt>]]\en", argv[0]); exit(EXIT_FAILURE); }

source: mktemp - make a unique temporary filename
ru: mktemp - создаёт уникальное имя для временного файла

source: Since glibc 2.12:
ru: Начиная с glibc 2.12:

source: (_XOPEN_SOURCE\ E<gt>=\ 500) && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: (_XOPEN_SOURCE\ E<gt>=\ 500) && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* Glibc начиная с 2.19: */ _DEFAULT_SOURCE || /* Glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: Before glibc 2.12:
ru: До glibc 2.12:

source: I<Never use this function>; see BUGS.
ru: I<Никогда не используйте эту функцию>; см. ДЕФЕКТЫ

source: The B<mktemp>() function generates a unique temporary filename from I<template>. The last six characters of I<template> must be XXXXXX and these are replaced with a string that makes the filename unique. Since it will be modified, I<template> must not be a string constant, but should be declared as a character array.
ru: Функция B<mktemp>() генерирует на основе шаблона I<template> уникальное имя для временного файла. Последние шесть символов I<template> должны быть равны XXXXXX, они будут заменены на строку, которая сделает имя файла уникальным. Так как I<template> будет меняться, он должен быть объявлен не строковой константой, а массивом символов.

source: The B<mktemp>() function always returns I<template>. If a unique name was created, the last six bytes of I<template> will have been modified in such a way that the resulting name is unique (i.e., does not exist already) If a unique name could not be created, I<template> is made an empty string, and I<errno> is set to indicate the error.
ru: Функция B<mktemp>() всегда возвращает I<template>. При создании уникального имени последние шесть байтов I<template> заменяются так, что имя становится уникальным (то есть, такого имени ещё нет). Если уникальное имя невозможно создать, I<template> будет равно пустой строке, а I<errno> будет назначен код ошибки.

source: The last six characters of I<template> were not XXXXXX.
ru: Последние шесть символов I<template> не равны XXXXXX.

source: 4.3BSD, POSIX.1-2001. POSIX.1-2008 removes the specification of B<mktemp>().
ru: 4.3BSD, POSIX.1-2001. В POSIX.1-2008 спецификация B<mktemp>() удалена.

source: Never use B<mktemp>(). Some implementations follow 4.3BSD and replace XXXXXX by the current process ID and a single letter, so that at most 26 different names can be returned. Since on the one hand the names are easy to guess, and on the other hand there is a race between testing whether the name exists and opening the file, every use of B<mktemp>() is a security risk. The race is avoided by B<mkstemp>(3) and B<mkdtemp>(3).
ru: Никогда не используйте B<mktemp>(). Некоторые реализации следуют 4.3BSD и заменяют XXXXXX текущим ID процесса и одним символом, поэтому может быть возвращено только 26 уникальных имен. С одной стороны такие имена легко подобрать, а с другой есть вероятность возникновения состязательности при проверке существования имени и открытия файла, поэтому каждое использование B<mktemp>() является угрозой безопасности. Состязательность не может возникнуть, если использовать функции B<mkstemp>(3) и B<mkdtemp>(3).

source: mkdtemp - create a unique temporary directory
ru: mkdtemp - создание временного каталога с уникальным именем

source: /* Since glibc 2.19: */ _DEFAULT_SOURCE
ru: /* Начиная с glibc 2.19: */ _DEFAULT_SOURCE

source: || /* Glibc 2.19 and earlier: */ _BSD_SOURCE
ru: || /* glibc 2.19 и старше: */ _BSD_SOURCE

source: || /* Since glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L
ru: || /* начиная с glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L

source: The B<mkdtemp>() function generates a uniquely named temporary directory from I<template>. The last six characters of I<template> must be XXXXXX and these are replaced with a string that makes the directory name unique. The directory is then created with permissions 0700. Since it will be modified, I<template> must not be a string constant, but should be declared as a character array.
ru: Функция B<mkdtemp>() создаёт временный каталог с уникальным именем на основе I<template>. Последние шесть символов I<template> должны быть равны XXXXXX; они будут заменены на строку, которая и сделает имя каталога уникальным. После этого будет создан каталог с правами 0700. Так как I<template> меняется, он не должен быть строковой константой, а должен быть объявлен как массив символов.

source: The B<mkdtemp>() function returns a pointer to the modified template string on success, and NULL on failure, in which case I<errno> is set appropriately.
ru: В случае успеха B<mkdtemp>() возвращает указатель на изменённую строку шаблона (template), в случае неудачи \(em NULL, при этом I<errno> устанавливается в соответствующее значение.

source: The last six characters of I<template> were not XXXXXX. Now I<template> is unchanged.
ru: Последние шесть символов I<template> не равны XXXXXX. I<template> не изменён.

source: Also see B<mkdir>(2) for other possible values for I<errno>.
ru: См. также в B<mkdir>(2) другие возможные значения I<errno>.

source: Available since glibc 2.1.91.
ru: Доступна в glibc с версии 2.1.91.

source: POSIX.1-2008. This function is present on the BSDs.
ru: POSIX.1-2008. Данная функция есть в реализациях BSD.

source: mcheck, mcheck_check_all, mcheck_pedantic, mprobe - heap consistency checking
ru: mcheck, mcheck_check_all, mcheck_pedantic, mprobe - проверяет целостность кучи

source: The B<mcheck>() function installs a set of debugging hooks for the B<malloc>(3) family of memory-allocation functions. These hooks cause certain consistency checks to be performed on the state of the heap. The checks can detect application errors such as freeing a block of memory more than once or corrupting the bookkeeping data structures that immediately precede a block of allocated memory.
ru: Функция B<mcheck>() устанавливает набор отладочных ловушек (hooks) на семейство функций выделения памяти B<malloc>(3). Эти ловушки выполняют определённые проверки целостности состояния кучи. Проверками обнаруживаются следующие ошибки приложения: многократное освобождение одного блока памяти, повреждение структур данных служебной информации, расположенных непосредственно перед блоком выделенной памяти.

source: To be effective, the B<mcheck>() function must be called before the first call to B<malloc>(3) or a related function. In cases where this is difficult to ensure, linking the program with I<-lmcheck> inserts an implicit call to B<mcheck>() (with a NULL argument) before the first call to a memory-allocation function.
ru: Для эффективной работы функция B<mcheck>() должна вызываться перед первым вызовом B<malloc>(3) или подобной функции. В случаях, когда это трудно проверить, компоновка программы с параметром I<-lmcheck> вставляет неявный вызов B<mcheck>() (с аргументом NULL) перед первым вызовом функции выделения памяти.

source: The B<mcheck_pedantic>() function is similar to B<mcheck>(), but performs checks on all allocated blocks whenever one of the memory-allocation functions is called. This can be very slow!
ru: Функция B<mcheck_pedantic>() похожа на B<mcheck>(), но выполняет проверку всех выделенных блоков каждый раз, когда вызывается функция выделения памяти. Она может работать очень медленно!

source: The B<mcheck_check_all>() function causes an immediate check on all allocated blocks. This call is effective only if B<mcheck>() is called beforehand.
ru: Функция B<mcheck_check_all>() выполняет немедленную проверку всех выделенных блоков. Этот вызов эффективно работает только, если перед этим была вызвана B<mcheck>().

source: If the system detects an inconsistency in the heap, the caller-supplied function pointed to by I<abortfunc> is invoked with a single argument, I<mstatus>, that indicates what type of inconsistency was detected. If I<abortfunc> is NULL, a default function prints an error message on I<stderr> and calls B<abort>(3).
ru: Если система обнаруживает целостность кучи, то вызывается функция, которую указал вызывающий в I<abortfunc> с единственным аргументом I<mstatus>, который показывает, какой тип рассогласованности обнаружен. Если I<abortfunc> равно NULL, то функция по умолчанию печатает сообщение об ошибке в I<stderr> и вызывает B<abort>(3).

source: The B<mprobe>() function performs a consistency check on the block of allocated memory pointed to by I<ptr>. The B<mcheck>() function should be called beforehand (otherwise B<mprobe>() returns B<MCHECK_DISABLED>).
ru: Функция B<mprobe>() выполняет проверку целостности блока выделенной памяти, на который указывает I<ptr>. Перед этим должна вызываться функция B<mcheck>() (в противном случае B<mprobe>() возвращает B<MCHECK_DISABLED>).

source: The following list describes the values returned by B<mprobe>() or passed as the I<mstatus> argument when I<abortfunc> is invoked:
ru: Далее перечислены значения, возвращаемые B<mprobe>() или передаваемые в аргументе I<mstatus> при вызове I<abortfunc>:

source: B<MCHECK_DISABLED> (B<mprobe>() only)
ru: B<MCHECK_DISABLED> (только B<mprobe>())

source: B<mcheck>() was not called before the first memory allocation function was called. Consistency checking is not possible.
ru: Не вызвана функция B<mcheck>() до первого вызова функции выделения памяти. Проверка несоответствий невозможна.

source: B<MCHECK_OK> (B<mprobe>() only)
ru: B<MCHECK_OK> (только B<mprobe>())

source: No inconsistency detected.
ru: Никаких несоответствий не обнаружено.

source: Memory preceding an allocated block was clobbered.
ru: Память, предшествующая выделенному блоку, была затёрта.

source: Memory following an allocated block was clobbered.
ru: Память после выделенного блока была затёрта.

source: A block of memory was freed twice.
ru: Блок памяти был освобожден дважды.

source: B<mcheck>() and B<mcheck_pedantic>() return 0 on success, or -1 on error.
ru: При успешном выполнении B<mcheck>() и B<mcheck_pedantic>() возвращают 0, а в случае ошибки возвращают -1.

source: The B<mcheck_pedantic>() and B<mcheck_check_all>() functions are available since glibc 2.2. The B<mcheck>() and B<mprobe>() functions are present since at least glibc 2.0
ru: Функции B<mcheck_pedantic>() и B<mcheck_check_all>() доступны начиная с glibc 2.2. Функции B<mcheck>() и B<mprobe>() появились, как минимум, начиная с glibc 2.0.

source: These functions are GNU extensions.
ru: Эти функции являются расширениями GNU.

source: Linking a program with I<-lmcheck> and using the B<MALLOC_CHECK_> environment variable (described in B<mallopt>(3)) cause the same kinds of errors to be detected. But, using B<MALLOC_CHECK_> does not require the application to be relinked.
ru: Компоновка программы с I<-lmcheck> и использование переменной окружения B<MALLOC_CHECK_> (описана в B<mallopt>(3)) обнаруживают ошибки схожим образом. Но при использовании B<MALLOC_CHECK_> не требуется перекомпоновывать приложение.

source: The program below calls B<mcheck>() with a NULL argument and then frees the same block of memory twice. The following shell session demonstrates what happens when running the program:
ru: Программа, представленная ниже, вызывает B<mcheck>() с аргументом NULL и затем освобождает один и тот же блок дважды. В следующем сеансе оболочки показано что случается при запуске программы:

source: $B< ./a.out> About to free
ru: $B< ./a.out> Освобождаем

source: About to free a second time block freed twice Aborted (core dumped)
ru: Освобождаем второй раз блок освобождён дважды Aborted (core dumped)

source: if (mcheck(NULL) != 0) { fprintf(stderr, "mcheck() failed\en");
ru: if (mcheck(NULL) != 0) { fprintf(stderr, "ошибка mcheck()\en");

source: fprintf(stderr, "About to free\en"); free(p); fprintf(stderr, "\enAbout to free a second time\en"); free(p);
ru: fprintf(stderr, "Освобождаем\en"); free(p); fprintf(stderr, "\enОсвобождаем второй раз\en"); free(p);

source: mallopt - set memory allocation parameters
ru: mallopt - задаёт параметры выделения памяти

source: The B<mallopt>() function adjusts parameters that control the behavior of the memory-allocation functions (see B<malloc>(3)). The I<param> argument specifies the parameter to be modified, and I<value> specifies the new value for that parameter.
ru: Функция B<mallopt>() подстраивает параметры, которые управляют поведением функций выделения памяти (смотрите B<malloc>(3)). В аргументе I<param> указывается изменяемый параметр, а в I<value> — новое значение этого параметра.

source: The following values can be specified for I<param>:
ru: В I<param> можно указать следующие значения:

source: If this parameter has a nonzero value, it defines a hard limit on the maximum number of arenas that can be created. An arena represents a pool of memory that can be used by B<malloc>(3) (and similar) calls to service allocation requests. Arenas are thread safe and therefore may have multiple concurrent memory requests. The trade-off is between the number of threads and the number of arenas. The more arenas you have, the lower the per-thread contention, but the higher the memory usage.
ru: Если этот параметр не равен нулю, то он определяет жёсткое ограничение на максимальное количество площадок (arenas), которое можно создать. Площадка представляет собой общий набор буферов (pool) памяти, который может использовать вызов B<malloc>(3) (и подобные) для обслуживания запросов выделения. Площадки безопасны в нитях и поэтому могут использоваться при одновременных запросах выделения. Нужно соблюдать соотношение между количеством нитей и количеством площадок. Чем больше площадок, тем меньше состязаний между нитями, но большее потребление памяти.

source: The default value of this parameter is 0, meaning that the limit on the number of arenas is determined according to the setting of B<M_ARENA_TEST>.
ru: Значение по умолчанию данного параметра равно 0, то есть ограничение на количество площадок будет определяться по B<M_ARENA_TEST>.

source: This parameter has been available since glibc 2.10 via B<--enable-experimental-malloc>, and since glibc 2.15 by default. In some versions of the allocator there was no limit on the number of created arenas (e.g., CentOS 5, RHEL 5).
ru: Этот параметр доступен начиная с glibc 2.10 при указании B<--enable-experimental-malloc>, и начиная с glibc 2.15 — по умолчанию. В некоторых версиях механизм выделения не имел ограничения на количество создаваемых площадок (например, в CentOS 5, RHEL 5).

source: When employing newer glibc versions, applications may in some cases exhibit high contention when accessing arenas. In these cases, it may be beneficial to increase B<M_ARENA_MAX> to match the number of threads. This is similar in behavior to strategies taken by tcmalloc and jemalloc (e.g., per-thread allocation pools).
ru: При использовании более новых версий glibc приложения могут, в некоторых случаях, встретить высокую состязательность при доступе к площадкам. В этих случаях может быть выгодно увеличить B<M_ARENA_MAX> для соответствия количеству нитей. Такое поведение подобно стратегиям, используемым tcmalloc и jemalloc (например, общие наборы буферов выделения для каждой нити).

source: This parameter specifies a value, in number of arenas created, at which point the system configuration will be examined to determine a hard limit on the number of created arenas. (See B<M_ARENA_MAX> for the definition of an arena.)
ru: Этим параметром определяется значение на количество создаваемых площадок; в соответствии с ним будут исследоваться системные настройки для оценки жёсткого ограничения на количество создаваемых площадок (определение площадки смотрите в описании B<M_ARENA_MAX>).

source: The computation of the arena hard limit is implementation-defined and is usually calculated as a multiple of the number of available CPUs. Once the hard limit is computed, the result is final and constrains the total number of arenas.
ru: Вычисленное жёсткое ограничение на площадки определяется реализацией и, обычно, кратно количеству доступных ЦП. После вычисления жёсткого ограничения, результат окончательный и ограничивает общее количество площадок.

source: The default value for the B<M_ARENA_TEST> parameter is 2 on systems where I<sizeof(long)> is 4; otherwise the default value is 8.
ru: Значение по умолчанию для параметра B<M_ARENA_TEST> равно 2 в системах, где I<sizeof(long)> равно 4; в противном случае значение по умолчанию равно 8.

source: This parameter has been available since glibc 2.10 via B<--enable-experimental-malloc>, and since glibc 2.15 by default.
ru: Этот параметр доступен начиная с glibc 2.10 при указании B<--enable-experimental-malloc>, и начиная с glibc 2.15 — по умолчанию.

source: The value of B<M_ARENA_TEST> is not used when B<M_ARENA_MAX> has a nonzero value.
ru: Значение B<M_ARENA_TEST> не используется, если B<M_ARENA_MAX> не равно нулю.

source: Setting this parameter controls how glibc responds when various kinds of programming errors are detected (e.g., freeing the same pointer twice). The 3 least significant bits (2, 1, and 0) of the value assigned to this parameter determine the glibc behavior, as follows:
ru: Значение данного параметра управляет тем, как glibc действует при обнаружении различных программных ошибок (например, освобождение одного указателя дважды). Поведение glibc задаётся тремя битами (2, 1 и 0) указанного значения:

source: Bit 0
ru: Бит 0

source: If this bit is set, then print a one-line message on I<stderr> that provides details about the error. The message starts with the string "***\ glibc detected\ ***", followed by the program name, the name of the memory-allocation function in which the error was detected, a brief description of the error, and the memory address where the error was detected.
ru: Если этот бит установлен, то печатается сообщение в I<stderr> с подробностями ошибки. Сообщение начинается со строки «***\ glibc detected\ ***», далее идёт имя программы, имя функции выделения памяти, в которой возникла ошибка, краткое описание ошибки и адрес памяти, где обнаружена ошибка.

source: Bit 1
ru: Бит 1

source: If this bit is set, then, after printing any error message specified by bit 0, the program is terminated by calling B<abort>(3). In glibc versions since 2.4, if bit 0 is also set, then, between printing the error message and aborting, the program also prints a stack trace in the manner of B<backtrace>(3), and prints the process's memory mapping in the style of I</proc/[pid]/maps> (see B<proc>(5)).
ru: Если этот бит установлен, то после печати сообщения об ошибке, если указано битом 0, программа завершается вызовом B<abort>(3). В glibc с версии 2.4, если также установлен бит 0, то между печатью сообщения об ошибке и завершением программа также печатает трассировку стека подобную B<backtrace>(3), и печатает отображение памяти процесса в стиле I</proc/[pid]/maps> (смотрите B<proc>(5)).

source: Bit 2 (since glibc 2.4)
ru: Бит 2 (начиная с glibc 2.4)

source: This bit has an effect only if bit 0 is also set. If this bit is set, then the one-line message describing the error is simplified to contain just the name of the function where the error was detected and the brief description of the error.
ru: Этот бит учитывается только если установлен бит 0. Если данный бит установлен, то выдаваемое сообщение об ошибке упрощается до имени функции, где обнаружена ошибка и короткого описания ошибки.

source: The remaining bits in I<value> are ignored.
ru: Оставшиеся биты в I<value> игнорируются.

source: Combining the above details, the following numeric values are meaningful for B<M_CHECK_ACTION>:
ru: Объединяя выше описанное, получаются следующие числовые значения, влияющие на B<M_CHECK_ACTION>:

source: Ignore error conditions; continue execution (with undefined results).
ru: Игнорировать условия ошибки; продолжить выполнение (с неопределенными результатами).

source: Print a detailed error message and continue execution.
ru: Вывести подробное сообщение об ошибке и продолжить выполнение.

source: Abort the program.
ru: Прервать программу.

source: Print detailed error message, stack trace, and memory mappings, and abort the program.
ru: Вывести подробное сообщение об ошибке, трассировку стека и отображения памяти, а затем прервать программу.

source: Print a simple error message and continue execution.
ru: Вывести простое сообщение об ошибке и продолжить выполнение.

source: Print simple error message, stack trace, and memory mappings, and abort the program.
ru: Вывести простое сообщение об ошибке, трассировку стека и отображения памяти, и прервать программу.

source: Since glibc 2.3.4, the default value for the B<M_CHECK_ACTION> parameter is 3. In glibc version 2.3.3 and earlier, the default value is 1.
ru: Начиная с glibc 2.3.4, значение параметра B<M_CHECK_ACTION> по умолчанию равно 3. В glibc версии 2.3.3 и старее значением по умолчанию было 1.

source: Using a nonzero B<M_CHECK_ACTION> value can be useful because otherwise a crash may happen much later, and the true cause of the problem is then very hard to track down.
ru: Использование ненулевого значения B<M_CHECK_ACTION> может быть полезно, так как в противном случае падение может случиться позднее и будет сложно отследить реальную причину проблемы.

source: This parameter specifies the maximum number of allocation requests that may be simultaneously serviced using B<mmap>(2). This parameter exists because some systems have a limited number of internal tables for use by B<mmap>(2), and using more than a few of them may degrade performance.
ru: Данным параметром задаётся максимальное количество запросов выделения, которые может одновременно выполнить B<mmap>(2). Этот параметр существует, так как в некоторых системах ограничено количество внутренних таблиц, используемых B<mmap>(2), и использование больше определённого количество снижает производительность.
