Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: The I<flags> argument is currently unused and must be specified as 0.
ru: В настоящее время аргумент I<flags> не используется и должен равняться 0.

source: All memory accesses performed in program order from each targeted thread are guaranteed to be ordered with respect to B<membarrier>().
ru: Все доступы к памяти, выполняемые в программном порядке из каждого целевого потока, гарантированно упорядочены в отношении B<membarrier>().

source: If we use the semantic I<barrier()> to represent a compiler barrier forcing memory accesses to be performed in program order across the barrier, and I<smp_mb()> to represent explicit memory barriers forcing full memory ordering across the barrier, we have the following ordering table for each pairing of I<barrier()>, B<membarrier>() and I<smp_mb()>. The pair ordering is detailed as (O: ordered, X: not ordered):
ru: Если использовать семантику I<barrier()> для представления барьера компилятора, обеспечивающего доступа к памяти, выполняемого в программном порядке для пересечения барьера, и I<smp_mb()> — для представления явных барьеров памяти, обеспечивающих полный упорядоченный доступ к памяти через барьер, то получится следующая упорядочивающая таблица для каждой пары I<barrier()>, B<membarrier>() и I<smp_mb()>. Наличие порядка в паре показано знаком (O: упорядочено, X: не упорядочено):

source: On success, the B<MEMBARRIER_CMD_QUERY> operation returns a bit mask of supported commands, and the B<MEMBARRIER_CMD_GLOBAL>, B<MEMBARRIER_CMD_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE>, and B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> operations return zero. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении операции B<MEMBARRIER_CMD_QUERY> возвращается битовая маска поддерживаемых команд, а операции B<MEMBARRIER_CMD_GLOBAL>, B<MEMBARRIER_CMD_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_GLOBAL_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED>, B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> и B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> возвращают ноль. При ошибке возвращается -1 и в I<errno> устанавливается соответствующее значение.

source: For a given command, with I<flags> set to 0, this system call is guaranteed to always return the same value until reboot. Further calls with the same arguments will lead to the same result. Therefore, with I<flags> set to 0, error handling is required only for the first call to B<membarrier>().
ru: Для данной команды, если флаг I<flags> равен 0, то системный вызов всегда гарантирует возврат одного и того же значения до перезагрузки. Последующие вызовы с теми же аргументами всегда возвращают тот же результат. Поэтому, если I<flags> равен 0, то обработка ошибок требуется только при первом вызове B<membarrier>().

source: I<cmd> is invalid, or I<flags> is nonzero, or the B<MEMBARRIER_CMD_GLOBAL> command is disabled because the I<nohz_full> CPU parameter has been set, or the B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> and B<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> commands are not implemented by the architecture.
ru: Неверное значение I<cmd>, значение I<flags> не равно нулю, отключена команда B<MEMBARRIER_CMD_GLOBAL>, так как указан параметр ЦП I<nohz_full> или команды B<MEMBARRIER_CMD_PRIVATE_EXPEDITED_SYNC_CORE> иB<MEMBARRIER_CMD_REGISTER_PRIVATE_EXPEDITED_SYNC_CORE> не реализованы для архитектуры.

source: The B<membarrier>() system call is not implemented by this kernel.
ru: Системный вызов B<membarrier>() не реализован в данном ядре.

source: The current process was not registered prior to using private expedited commands.
ru: Текущий процесс не зарегистрирован до использования частных курируемых команд.

source: The B<membarrier>() system call was added in Linux 4.3.
ru: Системный вызов B<membarrier>() впервые появился в Linux версии 4.3.

source: B<membarrier>() is Linux-specific.
ru: Вызов B<membarrier>() есть только в Linux.

source: A memory barrier instruction is part of the instruction set of architectures with weakly-ordered memory models. It orders memory accesses prior to the barrier and after the barrier with respect to matching barriers on other cores. For instance, a load fence can order loads prior to and following that fence with respect to stores ordered by store fences.
ru: Инструкция барьера памяти является частью системы команд архитектуры со слабо упорядоченными моделями памяти. Она упорядочивает доступ к памяти до барьера и после барьера в соответствии совпадающими барьерами на других ядрах. Например, загрузка барьера (fence) может упорядочить загрузку до и после этого барьера в соответствии порядком хранилища, установленного барьерами хранилища.

source: Program order is the order in which instructions are ordered in the program assembly code.
ru: Программный порядок — это порядок, в котором инструкции упорядочены в ассемблерном коде программы.

source: Examples where B<membarrier>() can be useful include implementations of Read-Copy-Update libraries and garbage collectors.
ru: Вызов B<membarrier>() может быть полезным для реализации библиотек чтения-копирования-обновления или сборщиков мусора.

source: Assuming a multithreaded application where "fast_path()" is executed very frequently, and where "slow_path()" is executed infrequently, the following code (x86) can be transformed using B<membarrier>():
ru: Предполагая, что в многонитевой программе «fast_path()» выполняется очень часто, а «slow_path()» — редко, следующий код (x86) можно преобразовать используя B<membarrier>():

source: /* * Real applications would call fast_path() and slow_path() * from different threads. Call those from main() to keep * this example short. */
ru: /* * В реальных приложениях вызовы fast_path() и slow_path() * были бы в разных нитях. Их вызов из main() сделан только * для укорачивания данного примера. */

source: /* * read_b == 0 implies read_a == 1 and * read_a == 0 implies read_b == 1. */
ru: /* * read_b == 0 подразумевает read_a == 1 и * read_a == 0 подразумевает read_b == 1. */

source: The code above transformed to use B<membarrier>() becomes:
ru: Этот же код, переписанный с использованием B<membarrier>():

source: /* Check that membarrier() is supported. */
ru: /* Проверка поддержки в функции membarrier() */

source: if (!(ret & MEMBARRIER_CMD_GLOBAL)) { fprintf(stderr, "membarrier does not support MEMBARRIER_CMD_GLOBAL\en"); return -1; }
ru: if (!(ret & MEMBARRIER_CMD_GLOBAL)) { fprintf(stderr, "membarrier не поддерживает MEMBARRIER_CMD_GLOBAL\en"); return -1; }

source: mincore - determine whether pages are resident in memory
ru: mincore - определяет, хранятся ли страницы в памяти

source: B<mincore>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<mincore>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: B<mincore>() returns a vector that indicates whether pages of the calling process's virtual memory are resident in core (RAM), and so will not cause a disk access (page fault) if referenced. The kernel returns residency information about the pages starting at the address I<addr>, and continuing for I<length> bytes.
ru: B<mincore>() возвращает вектор, описывающий страницы виртуальной памяти вызывающего процесса, которые находятся в физической памяти (core, RAM) и поэтому доступ к ним не приводит к обращению к дискам. Ядро возвращает информацию о страницах, которые расположены начиная с адреса I<addr> и занимают I<length> байт.

source: The I<addr> argument must be a multiple of the system page size. The I<length> argument need not be a multiple of the page size, but since residency information is returned for whole pages, I<length> is effectively rounded up to the next multiple of the page size. One may obtain the page size (B<PAGE_SIZE>) using I<sysconf(_SC_PAGESIZE)>.
ru: Значение аргумента I<addr> должно быть кратно размеру системной страницы. Значение аргумента I<length> может быть не кратно размеру страницы, но так как возвращается информация по целым страницам, I<length> округляется до следующего значения, кратного размеру страницы. Размер страницы (B<PAGE_SIZE>) может быть получен с помощью I<sysconf(_SC_PAGESIZE)>.

source: The I<vec> argument must point to an array containing at least I<(length+PAGE_SIZE-1) / PAGE_SIZE> bytes. On return, the least significant bit of each byte will be set if the corresponding page is currently resident in memory, and be clear otherwise. (The settings of the other bits in each byte are undefined; these bits are reserved for possible later use.) Of course the information returned in I<vec> is only a snapshot: pages that are not locked in memory can come and go at any moment, and the contents of I<vec> may already be stale by the time this call returns.
ru: Аргумент I<vec> должен указывать на массив размером не менее I<(length+PAGE_SIZE-1) / PAGE_SIZE> байт. При возврате самый младший значимый бит каждого байта будет установлен, если соответствующая страница находится в памяти, и будет сброшен, если это не так. (Значения других битов каждого байта не определено; эти биты зарезервированы для использования в будущем.) Естественно, информация, возвращаемая в I<vec>, носит моментальный характер: страницы, которые не заблокированы в памяти, могут быть удалены из неё или добавлены в любой момент, и содержимое I<vec> может стать неактуальным уже на момент возврата из вызова.

source: On success, B<mincore>() returns zero. On error, -1 is returned, and I<errno> is set appropriately.
ru: При нормальном завершении работы B<mincore>() возвращает ноль. При ошибках возвращается -1, а переменной I<errno> присваивается соответствующее значение.

source: B<EAGAIN> kernel is temporarily out of resources.
ru: B<EAGAIN> ядру временно не хватает ресурсов.

source: I<vec> points to an invalid address.
ru: I<vec> указывает на неправильный адрес.

source: I<addr> is not a multiple of the page size.
ru: Значение I<addr> не кратно размеру страницы.

source: I<length> is greater than (I<TASK_SIZE> - I<addr>). (This could occur if a negative value is specified for I<length>, since that value will be interpreted as a large unsigned integer.) In Linux 2.6.11 and earlier, the error B<EINVAL> was returned for this condition.
ru: Значение I<length> больше чем (I<TASK_SIZE> - I<addr>). (Это может произойти, если в I<length> указано отрицательное значение, так как это значение воспринимается как большое беззнаковое целое.) В Linux 2.6.11 и более ранних версиях в этом случае возвращалась ошибка B<EINVAL>.

source: I<addr> to I<addr> + I<length> contained unmapped memory.
ru: С адреса I<addr> по адрес I<addr> + I<length> содержится память без отображения.

source: Available since Linux 2.3.99pre1 and glibc 2.2.
ru: Доступен начиная с Linux 2.3.99pre1 и glibc 2.2.

source: B<mincore>() is not specified in POSIX.1, and it is not available on all UNIX implementations.
ru: Системный вызов B<mincore>() не определён в стандарте POSIX.1 и отсутствует во всех реализациях UNIX.

source: Before kernel 2.6.21, B<mincore>() did not return correct information for B<MAP_PRIVATE> mappings, or for nonlinear mappings (established using B<remap_file_pages>(2)).
ru: До ядра версии 2.6.21, B<mincore>() не возвращал правильные данные для отображений B<MAP_PRIVATE> или для нелинейных отображений (заданных с помощью B<remap_file_pages>(2)).

source: mprotect, pkey_mprotect - set protection on a region of memory
ru: mprotect, pkey_mprotect - контролирует доступ к области памяти

source: B<mprotect>() changes the access protections for the calling process's memory pages containing any part of the address range in the interval [I<addr>,\ I<addr>+I<len>-1]. I<addr> must be aligned to a page boundary.
ru: Вызов B<mprotect>() изменяет параметры доступа страниц памяти вызывающего процесса, которые содержатся, даже частично, в адресном диапазоне [I<addr>,\ I<addr>+I<len>-1]. Значение I<addr> должно быть выровнено на границу страницы.

source: If the calling process tries to access memory in a manner that violates the protections, then the kernel generates a B<SIGSEGV> signal for the process.
ru: Если вызывающий процесс нарушает защиту доступа к памяти, то ядро посылает процессу сигнал B<SIGSEGV>.

source: I<prot> is a combination of the following access flags: B<PROT_NONE> or a bitwise-or of the other values in the following list:
ru: Значение I<prot> представляет собой комбинацию следующих флагов доступа: B<PROT_NONE> или побитово сложенные другие значения из следующего списка:

source: The memory cannot be accessed at all.
ru: Доступ к памяти запрещён.

source: The memory can be read.
ru: Память можно читать.

source: The memory can be modified.
ru: Память можно изменять.

source: The memory can be executed.
ru: Память можно выполнять.

source: B<PROT_SEM> (since Linux 2.5.7)
ru: B<PROT_SEM> (начиная с Linux 2.5.7)

source: The memory can be used for atomic operations. This flag was introduced as part of the B<futex>(2) implementation (in order to guarantee the ability to perform atomic operations required by commands such as B<FUTEX_WAIT>), but is not currently used in on any architecture.
ru: Память можно использовать для атомарных операций. Этот флаг появился как часть реализации B<futex>(2) (для гарантии способности выполнять атомарные операции, требуемые таким командам как B<FUTEX_WAIT>), но пока не используется ни в одной архитектуре.

source: B<PROT_SAO> (since Linux 2.6.26)
ru: B<PROT_SAO> (начиная с Linux 2.6.26)

source: The memory should have strong access ordering. This feature is specific to the PowerPC architecture (version 2.06 of the architecture specification adds the SAO CPU feature, and it is available on POWER 7 or PowerPC A2, for example).
ru: Память должна иметь строгий порядок доступа. Это свойство есть только в архитектуре PowerPC (в спецификации архитектуры версии 2.06 добавлено свойство ЦП SAO и оно доступно, например, на POWER 7 или PowerPC A2).

source: Additionally (since Linux 2.6.0), I<prot> can have one of the following flags set:
ru: Также (начиная с Linux 2.6.0), I<prot> может содержать один из следующих установленных флагов:

source: Apply the protection mode up to the end of a mapping that grows upwards. (Such mappings are created for the stack area on architectures\(emfor example, HP-PARISC\(emthat have an upwardly growing stack.)
ru: Применить режим защиты до конца отображения, которое растёт вверх (такие отображения создаются для области стека например в архитектуре HP-PARISC, где стек растёт вверх).

source: Apply the protection mode down to the beginning of a mapping that grows downward (which should be a stack segment or a segment mapped with the B<MAP_GROWSDOWN> flag set).
ru: Применить режим защиты до начала отображения, которое растёт вниз (которое должно быть сегментом стека или сегментом, отображённым с установленным флагом B<MAP_GROWSDOWN>).

source: Like B<mprotect>(), B<pkey_mprotect>() changes the protection on the pages specified by I<addr> and I<len>. The I<pkey> argument specifies the protection key (see B<pkeys>(7)) to assign to the memory. The protection key must be allocated with B<pkey_alloc>(2) before it is passed to B<pkey_mprotect>(). For an example of the use of this system call, see B<pkeys>(7).
ru: Подобно B<mprotect>(), вызов B<pkey_mprotect>() изменяет защиту страниц, указанных I<addr> и I<len>. Аргумент I<pkey> содержит ключ защиты (смотрите B<pkeys>(7)), назначаемый памяти. Ключ защиты должен быть выделен с помощью B<pkey_alloc>(2) до передачи в B<pkey_mprotect>(). Пример использования этого системного вызова смотрите в B<pkeys>(7).

source: On success, B<mprotect>() and B<pkey_mprotect>() return zero. On error, these system calls return -1, and I<errno> is set appropriately.
ru: При успешном выполнении B<mprotect>() и B<pkey_mprotect>() возвращают 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The memory cannot be given the specified access. This can happen, for example, if you B<mmap>(2) a file to which you have read-only access, then ask B<mprotect>() to mark it B<PROT_WRITE>.
ru: Нельзя задать этот вид доступа. Например, это может случиться, если при вызове B<mmap>(2) файл доступен только на чтение, а запрос B<mprotect>() был B<PROT_WRITE>.

source: I<addr> is not a valid pointer, or not a multiple of the system page size.
ru: Значение I<addr> не является правильным указателем или не кратен размеру системной страницы.

source: (B<pkey_mprotect>()) I<pkey> has not been allocated with B<pkey_alloc>(2)
ru: (B<pkey_mprotect>()) I<pkey> не был выделен с помощью B<pkey_alloc>(2).

source: Both B<PROT_GROWSUP> and B<PROT_GROWSDOWN> were specified in I<prot>.
ru: В I<prot> указаны оба флага, B<PROT_GROWSUP> и B<PROT_GROWSDOWN>.

source: Invalid flags specified in I<prot>.
ru: Указано неверное значение в I<prot>.

source: (PowerPC architecture) B<PROT_SAO> was specified in I<prot>, but SAO hardware feature is not available.
ru: (архитектура PowerPC ) В I<prot> указан B<PROT_SAO>, но недоступно аппаратное свойство SAO.

source: Internal kernel structures could not be allocated.
ru: Не удалось выделить место под внутренние структуры ядра.

source: Addresses in the range [I<addr>, I<addr>+I<len>-1] are invalid for the address space of the process, or specify one or more pages that are not mapped. (Before kernel 2.4.19, the error B<EFAULT> was incorrectly produced for these cases.)
ru: Адреса в диапазоне [I<addr>, I<addr>+I<len>-1] некорректны для адресного пространства процесса, или одна или более указанных страниц не отображена (до ядра версии 2.4.19 в этих случаях некорректно возвращалась ошибка B<EFAULT>).

source: Changing the protection of a memory region would result in the total number of mappings with distinct attributes (e.g., read versus read/write protection) exceeding the allowed maximum. (For example, making the protection of a range B<PROT_READ> in the middle of a region currently protected as B<PROT_READ|PROT_WRITE> would result in three mappings: two read/write mappings at each end and a read-only mapping in the middle.)
ru: Изменение защиты области памяти привело бы к превышению разрешённого максимума на количество отображений с различающимися атрибутами (защита на чтение и на чтение/запись). Например, защита диапазона B<PROT_READ> в середине области, которая сейчас защищена B<PROT_READ|PROT_WRITE>, привела бы к трём отображениям: два отображения на концах, доступных на чтение/запись и доступное только для чтение отображение посередине.

source: B<pkey_mprotect>() first appeared in Linux 4.9; library support was added in glibc 2.27.
ru: Вызов B<pkey_mprotect>() впервые появился в Linux 4.9; поддержка в библиотеке glibc добавлена в версии 2.27.

source: B<mprotect>(): POSIX.1-2001, POSIX.1-2008, SVr4. POSIX says that the behavior of B<mprotect>() is unspecified if it is applied to a region of memory that was not obtained via B<mmap>(2).
ru: B<mprotect>(): В POSIX.1-2001, POSIX.1-2008, SVr4 сказано, что поведение B<mprotect>() не определено, если переданная область памяти не получена через B<mmap>(2).

source: B<pkey_mprotect>() is a nonportable Linux extension.
ru: Вызов B<pkey_mprotect> является непереносимым расширением Linux.

source: On Linux, it is always permissible to call B<mprotect>() on any address in a process's address space (except for the kernel vsyscall area). In particular, it can be used to change existing code mappings to be writable.
ru: В Linux всегда можно вызвать B<mprotect>() с любым адресом из адресного пространства процесса (за исключением области ядра vsyscall). В частности, это можно использовать для изменения отображений существующего кода на записываемые.

source: Whether B<PROT_EXEC> has any effect different from B<PROT_READ> depends on processor architecture, kernel version, and process state. If B<READ_IMPLIES_EXEC> is set in the process's personality flags (see B<personality>(2)), specifying B<PROT_READ> will implicitly add B<PROT_EXEC>.
ru: Отличается ли действие B<PROT_EXEC> от B<PROT_READ> зависит от архитектуры процессора, версии ядра и состояния процесса. Если в флагах специализаций процессора установлен B<READ_IMPLIES_EXEC> (смотрите B<personality>(2)), то указание B<PROT_READ> подразумевает добавление B<PROT_EXEC>.

source: On some hardware architectures (e.g., i386), B<PROT_WRITE> implies B<PROT_READ>.
ru: На некоторых аппаратных архитектурах (например, i386) B<PROT_WRITE> подразумевает B<PROT_READ>.

source: POSIX.1 says that an implementation may permit access other than that specified in I<prot>, but at a minimum can allow write access only if B<PROT_WRITE> has been set, and must not allow any access if B<PROT_NONE> has been set.
ru: В POSIX.1 сказано, что реализация может разрешить доступ отличный от указанного в I<prot>, но для доступа на запись должен быть обязательно установлен флаг B<PROT_WRITE>, и любой доступ должен быть запрещён, если установлен флаг B<PROT_NONE>.

source: Applications should be careful when mixing use of B<mprotect>() and B<pkey_mprotect>(). On x86, when B<mprotect>() is used with I<prot> set to B<PROT_EXEC> a pkey is may be allocated and set on the memory implicitly by the kernel, but only when the pkey was 0 previously.
ru: В приложениях нужно осторожно использовать B<mprotect>() и B<pkey_mprotect>() вместе. На x86, если B<mprotect>() используется с установленным в I<prot> значением B<PROT_EXEC>, то pkey может быть выделен и установлен ядром в память неявным образом, но только если до этого pkey был равен 0.

source: The program below demonstrates the use of B<mprotect>(). The program allocates four pages of memory, makes the third of these pages read-only, and then executes a loop that walks upward through the allocated region modifying bytes.
ru: Программа, представленная далее, показывает использование B<mprotect>(). Она выделяет четыре страницы памяти, делает третью доступной только на чтение, а затем запускает цикл, который проходит по выделенной области, меняя байты.

source: An example of what we might see when running the program is the following:
ru: Результат работы программы:

source: $B< ./a.out> Start of region: 0x804c000 Got SIGSEGV at address: 0x804e000
ru: $B< ./a.out> Начало области: 0x804c000 Получен SIGSEGV при адресе: 0x804e000

source: static void handler(int sig, siginfo_t *si, void *unused) { /* Note: calling printf() from a signal handler is not safe (and should not be done in production programs), since printf() is not async-signal-safe; see signal-safety(7). Nevertheless, we use printf() here as a simple way of showing that the handler was called. */
ru: static void handler(int sig, siginfo_t *si, void *unused) { /* Замечание: вызов printf() из обработчика сигнала небезопасен (и не должен выполняться в готовых программах), так как printf() не async-signal-safe; смотрите signal-safety(7). Тем не менее, здесь мы используем printf(), так как это простой способ показать когда вызывается обработчик. */

source: printf("Got SIGSEGV at address: 0x%lx\en", (long) si-E<gt>si_addr); exit(EXIT_FAILURE); }
ru: printf("Получен SIGSEGV при адресе: 0x%lx\en", (long) si-E<gt>si_addr); exit(EXIT_FAILURE); }

source: /* Allocate a buffer aligned on a page boundary; initial protection is PROT_READ | PROT_WRITE */
ru: /* выделить буфер с выравниванием на границу страницы; начальная защита: PROT_READ | PROT_WRITE */

source: printf("Start of region: 0x%lx\en", (long) buffer);
ru: printf("Начало области: 0x%lx\en", (long) buffer);

source: printf("Loop completed\en"); /* Should never happen */ exit(EXIT_SUCCESS); }
ru: printf("Цикл завершён\en"); /* никогда не должно случиться */ exit(EXIT_SUCCESS); }
