Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Below are shown two example programs that demonstrate the use of B<memfd_create>() and the file sealing API.
ru: Далее показано два примера программы, в которых продемонстрировано использование B<memfd_create>() и программный интерфейс опечатывания файла.

source: The first program, I<t_memfd_create.c>, creates a B<tmpfs>(5) file using B<memfd_create>(), sets a size for the file, maps it into memory, and optionally places some seals on the file. The program accepts up to three command-line arguments, of which the first two are required. The first argument is the name to associate with the file, the second argument is the size to be set for the file, and the optional third argument is a string of characters that specify seals to be set on file.
ru: Первая программа, I<t_memfd_create.c>, создаёт файл B<tmpfs>(5) с помощью B<memfd_create>(), изменяет его размер, отображает в память и, возможно, накладывает несколько печатей на файл. Программа принимает не более трёх аргументов командной строки, два первых обязательные. Первым аргументом задаётся имя файла, во втором — размер файла, а в необязательном третьем — строка символов, задающих устанавливаемые печати на файл.

source: The second program, I<t_get_seals.c>, can be used to open an existing file that was created via B<memfd_create>() and inspect the set of seals that have been applied to that file.
ru: Вторая программа, I<t_get_seals.c>, может использоваться для открытия существующего файла, созданного B<memfd_create>(), и проверки набора печатей, применённых к файлу.

source: The following shell session demonstrates the use of these programs. First we create a B<tmpfs>(5) file and set some seals on it:
ru: Следующий пример сеанса показывает как использовать программу. Сначала создаётся файл B<tmpfs>(5) и накладываются печати:

source: At this point, the I<t_memfd_create> program continues to run in the background. From another program, we can obtain a file descriptor for the file created by B<memfd_create>() by opening the I</proc/[pid]/fd> file that corresponds to the file descriptor opened by B<memfd_create>(). Using that pathname, we inspect the content of the I</proc/[pid]/fd> symbolic link, and use our I<t_get_seals> program to view the seals that have been placed on the file:
ru: После этого программа I<t_memfd_create> продолжает выполняться в фоновом режиме. Из другой программы можно получить дескриптор файла, созданный B<memfd_create>(), открыв файл I</proc/[pid]/fd>, который соответствует файловому дескриптору, открытому B<memfd_create>(). Используя это имя, можно просмотреть содержимое символьной ссылки I</proc/[pid]/fd> и использовать программу I<t_get_seals> для просмотра печатей, которые установлены на файл:

source: $ B<readlink /proc/11775/fd/3> /memfd:my_memfd_file (deleted) $ B<./t_get_seals /proc/11775/fd/3> Existing seals: WRITE SHRINK
ru: $ B<readlink /proc/11775/fd/3> /memfd:my_memfd_file (удалён) $ B<./t_get_seals /proc/11775/fd/3> Наложенные печати: WRITE SHRINK

source: Program source: t_memfd_create.c
ru: Исходный код программы: t_memfd_create.c

source: if (argc E<lt> 3) { fprintf(stderr, "%s name size [seals]\en", argv[0]); fprintf(stderr, "\et\(aqseals\(aq can contain any of the " "following characters:\en"); fprintf(stderr, "\et\etg - F_SEAL_GROW\en"); fprintf(stderr, "\et\ets - F_SEAL_SHRINK\en"); fprintf(stderr, "\et\etw - F_SEAL_WRITE\en"); fprintf(stderr, "\et\etS - F_SEAL_SEAL\en"); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 3) { fprintf(stderr, "%s имя размер [печати]\en", argv[0]); fprintf(stderr, "\et в \(aqпечати\(aq могут быть " "следующие символы:\en"); fprintf(stderr, "\et\etg - F_SEAL_GROW\en"); fprintf(stderr, "\et\ets - F_SEAL_SHRINK\en"); fprintf(stderr, "\et\etw - F_SEAL_WRITE\en"); fprintf(stderr, "\et\etS - F_SEAL_SEAL\en"); exit(EXIT_FAILURE); }

source: /* Create an anonymous file in tmpfs; allow seals to be placed on the file */
ru: /* Создаётся анонимный файл в tmpfs; на файл накладываются указанные печати */

source: /* Size the file as specified on the command line */
ru: /* Размер файл как указано в командной строке */

source: /* Code to map the file and populate the mapping with data omitted */
ru: /* Здесь может быть код для отображения файла и заполнения данными */

source: /* If a \(aqseals\(aq command-line argument was supplied, set some seals on the file */
ru: /* Если в командной строке задан параметр \(aqпечати\(aq, то накладываем их на файл */

source: /* Keep running, so that the file created by memfd_create() continues to exist */
ru: /* Продолжаем выполнение для того, чтобы файл, созданный memfd_create(), продолжал существовать */

source: Program source: t_get_seals.c
ru: Исходный код программы: t_get_seals.c

source: printf("Existing seals:"); if (seals & F_SEAL_SEAL) printf(" SEAL"); if (seals & F_SEAL_GROW) printf(" GROW"); if (seals & F_SEAL_WRITE) printf(" WRITE"); if (seals & F_SEAL_SHRINK) printf(" SHRINK"); printf("\en");
ru: printf("Наложенные печати:"); if (seals & F_SEAL_SEAL) printf(" SEAL"); if (seals & F_SEAL_GROW) printf(" GROW"); if (seals & F_SEAL_WRITE) printf(" WRITE"); if (seals & F_SEAL_SHRINK) printf(" SHRINK"); printf("\en");

source: /* Code to map the file and access the contents of the resulting mapping omitted */
ru: /* Здесь может быть код для отображения и доступа к содержимому файла */

source: mknod, mknodat - create a special or ordinary file
ru: mknod, mknodat - создаёт специальный или обычный файл

source: The system call B<mknod>() creates a filesystem node (file, device special file, or named pipe) named I<pathname>, with attributes specified by I<mode> and I<dev>.
ru: Системный вызов B<mknod>() создаёт запись (node) в файловой системе (обычный файл, файл устройства или именованный канал) с именем I<pathname> и атрибутами, заданными в I<mode> и I<dev>.

source: The I<mode> argument specifies both the file mode to use and the type of node to be created. It should be a combination (using bitwise OR) of one of the file types listed below and zero or more of the file mode bits listed in B<inode>(7).
ru: В аргументе I<mode> указывается используемый режим файла и тип создаваемого узла. В этом параметре должна быть битовая комбинация (используя побитовое логическое сложение ИЛИ) нуля или более режимов файла, перечисленных в B<inode>(7).

source: The file mode is modified by the process's I<umask> in the usual way: in the absence of a default ACL, the permissions of the created node are (I<mode> & ~I<umask>).
ru: Режим файла изменяется согласно значению I<umask> процесса: при отсутствии списка контроля доступа по умолчанию права на создаваемый узел становятся равны (I<mode> & ~I<umask>).

source: The file type must be one of B<S_IFREG>, B<S_IFCHR>, B<S_IFBLK>, B<S_IFIFO>, or B<S_IFSOCK> to specify a regular file (which will be created empty), character special file, block special file, FIFO (named pipe), or UNIX domain socket, respectively. (Zero file type is equivalent to type B<S_IFREG>.)
ru: Для указания обычного файла, специального символьного файла, специального блочного файла, FIFO (именованного канала) или доменного сокета UNIX типом должен быть один из B<S_IFREG>, B<S_IFCHR>, B<S_IFBLK>, B<S_IFIFO> или B<S_IFSOCK>, соответственно (нулевой тип файла эквивалентен типу B<S_IFREG>).

source: If the file type is B<S_IFCHR> or B<S_IFBLK>, then I<dev> specifies the major and minor numbers of the newly created device special file (B<makedev>(3) may be useful to build the value for I<dev>); otherwise it is ignored.
ru: Если тип файла равен B<S_IFCHR> или B<S_IFBLK>, то в I<dev> задаётся основной и вспомогательный номера создаваемого специального файла устройства (B<makedev>(3) может оказаться полезной при создании значения для I<dev>); в остальных случаях аргумент игнорируется.

source: If I<pathname> already exists, or is a symbolic link, this call fails with an B<EEXIST> error.
ru: Если I<pathname> уже существует, или является символьной ссылкой, то вызов завершается с ошибкой B<EEXIST>.

source: The newly created node will be owned by the effective user ID of the process. If the directory containing the node has the set-group-ID bit set, or if the filesystem is mounted with BSD group semantics, the new node will inherit the group ownership from its parent directory; otherwise it will be owned by the effective group ID of the process.
ru: Созданный файл будет принадлежать ID эффективного владельца процесса. Если в правах доступа к каталогу, в котором находится файл, установлен бит set-group-ID, или если файловая система смонтирована с семантикой групп BSD, то новый файл унаследует группу-владельца от своего родительского каталога; в противном случае группой-владельцем станет ID эффективной группы процесса.

source: The B<mknodat>() system call operates in exactly the same way as B<mknod>(), except for the differences described here.
ru: Системный вызов B<mknodat>() работает также как системный вызов B<mknod>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<mknod>() for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<mknod>()).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<mknod>()).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<mknod>()).

source: See B<openat>(2) for an explanation of the need for B<mknodat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<mknodat>().

source: B<mknod>() and B<mknodat>() return zero on success, or -1 if an error occurred (in which case, I<errno> is set appropriately).
ru: При успешном выполнении вызовов B<mknod>() и B<mknodat>() возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The parent directory does not allow write permission to the process, or one of the directories in the path prefix of I<pathname> did not allow search permission. (See also B<path_resolution>(7).)
ru: У процесса нет прав на запись в родительский каталог, или в одном из каталогов в I<pathname> не разрешён поиск (смотрите также B<path_resolution>(7)).

source: I<pathname> already exists. This includes the case where I<pathname> is a symbolic link, dangling or not.
ru: I<pathname> уже существует. В этом случае I<pathname> может быть символьной ссылкой, повисшей или нет.

source: I<mode> requested creation of something other than a regular file, device special file, FIFO or socket.
ru: В аргументе I<mode> указано значение, отличное от значения для обычного файла, специального файла устройства, FIFO или сокета.

source: The device containing I<pathname> has no room for the new node.
ru: На устройстве, содержащем I<pathname>, нет места для создания нового элемента.

source: I<mode> requested creation of something other than a regular file, FIFO (named pipe), or UNIX domain socket, and the caller is not privileged (Linux: does not have the B<CAP_MKNOD> capability); also returned if the filesystem containing I<pathname> does not support the type of node requested.
ru: В аргументе I<mode> запрошено создание чего-то, отличного от обычного файла, специального файла устройства, FIFO (именованного канала) или доменного сокета UNIX, и у вызвавшего процесса нет прав (Linux: не имеет мандата B<CAP_MKNOD>); также завершается, если файловая система, содержащая I<pathname>, не поддерживает тип запрашиваемой ноды.

source: The following additional errors can occur for B<mknodat>():
ru: В B<mknodat>() дополнительно могут возникнуть следующие ошибки:

source: B<mknodat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Вызов B<mknodat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: B<mknod>(): SVr4, 4.4BSD, POSIX.1-2001 (but see below), POSIX.1-2008.
ru: B<mknod>(): SVr4, 4.4BSD, POSIX.1-2001 (но смотрите ниже), POSIX.1-2008.

source: POSIX.1-2001 says: "The only portable use of B<mknod>() is to create a FIFO-special file. If I<mode> is not B<S_IFIFO> or I<dev> is not 0, the behavior of B<mknod>() is unspecified." However, nowadays one should never use B<mknod>() for this purpose; one should use B<mkfifo>(3), a function especially defined for this purpose.
ru: В POSIX.1-2001 сказано: «Единственный способ, которым можно использовать B<mknod>() в переносимых программах это создание специального файла FIFO. Если значение I<mode> не равно B<S_IFIFO> или I<dev> не равно 0, то поведение B<mknod>() не определено.» Однако, в настоящее время никогда не используйте B<mknod>() для этой цели; вместо этого используйте функцию B<mkfifo>(3), которая создана специально для этого.

source: Under Linux, B<mknod>() cannot be used to create directories. One should make directories with B<mkdir>(2).
ru: В Linux вызов B<mknod>() не может использоваться для создания каталогов. Для этого есть системный вызов B<mkdir>(2).

source: There are many infelicities in the protocol underlying NFS. Some of these affect B<mknod>() and B<mknodat>().
ru: В протоколе, на котором работает NFS, есть множество недоработок. Некоторые из них влияют на B<mknod>() и B<mknodat>().

source: madvise - give advice about use of memory
ru: madvise - отсылает предложения по использованию памяти

source: Since glibc 2.19:
ru: Начиная с glibc 2.19:

source: Up to and including glibc 2.19:
ru: Начиная с glibc 2.19:

source: The B<madvise>() system call is used to give advice or directions to the kernel about the address range beginning at address I<addr> and with size I<length> bytes In most cases, the goal of such advice is to improve system or application performance.
ru: Системный вызов B<madvise>() используется, чтобы дать совет или указать направление ядру о диапазоне адресов, начинающемся с адреса I<addr> и имеющем размер I<length> байт. В большинстве случаев, целью такого совета является повышение производительности системы или приложения.

source: Initially, the system call supported a set of "conventional" I<advice> values, which are also available on several other implementations. (Note, though, that B<madvise>() is not specified in POSIX.) Subsequently, a number of Linux-specific I<advice> values have been added.
ru: Первоначально, системный вызов поддерживал набор «стандартных» значений I<advice>, которые также доступны и в некоторых других реализациях (однако отметим, что B<madvise>() отсутствует в POSIX). В последствии было добавлено несколько значений I<advice>, имеющихся только в Linux.

source: Conventional advice values
ru: Стандартные значения предложений

source: The I<advice> values listed below allow an application to tell the kernel how it expects to use some mapped or shared memory areas, so that the kernel can choose appropriate read-ahead and caching techniques. These I<advice> values do not influence the semantics of the application (except in the case of B<MADV_DONTNEED>), but may influence its performance. All of the I<advice> values listed here have analogs in the POSIX-specified B<posix_madvise>(3) function, and the values have the same meanings, with the exception of B<MADV_DONTNEED>.
ru: Значения I<advice>, перечисленные далее, позволяют приложению указать ядру как оно будет использовать некоторые отображённые или общие области памяти, чтобы ядро могло выбрать подходящие методы упреждающего чтения и кэширования. Эти значения I<advice> не влияют на семантику приложения (за исключением B<MADV_DONTNEED>), но могут повлиять на его производительность. Все перечисленные здесь значения I<advice> имеют аналоги в определённой POSIX функции B<posix_madvise>(3) и имеют тот же смысл, за исключением B<MADV_DONTNEED>.

source: The advice is indicated in the I<advice> argument, which is one of the following:
ru: В I<advice> помещается нужное предложения, одно из:

source: No special treatment. This is the default.
ru: Нет никаких специальных указаний. Используется по умолчанию.

source: Expect page references in random order. (Hence, read ahead may be less useful than normally.)
ru: Ожидать обращение к страницам в случайном порядке (здесь упреждающее чтение может быть менее эффективным).

source: Expect page references in sequential order. (Hence, pages in the given range can be aggressively read ahead, and may be freed soon after they are accessed.)
ru: Ожидать последовательного обращения к страницам (здесь к страницам в заданном диапазоне можно применить агрессивное упреждающее чтение и быстро высвободить их сразу после доступа).

source: Expect access in the near future. (Hence, it might be a good idea to read some pages ahead.)
ru: Ожидать доступа в ближайшем будущем (здесь можно применить упреждающее чтение нескольких страниц).

source: Do not expect access in the near future. (For the time being, the application is finished with the given range, so the kernel can free resources associated with it.)
ru: В ближайшем будущем не ожидается доступ (в настоящее время приложение закончило работу с данным диапазоном, поэтому ядро может освободить ресурсы, связанные с приложением).

source: After a successful B<MADV_DONTNEED> operation, the semantics of memory access in the specified region are changed: subsequent accesses of pages in the range will succeed, but will result in either repopulating the memory contents from the up-to-date contents of the underlying mapped file (for shared file mappings, shared anonymous mappings, and shmem-based techniques such as System V shared memory segments) or zero-fill-on-demand pages for anonymous private mappings.
ru: После успешного выполнения операции B<MADV_DONTNEED> семантика доступа к памяти в заданной области изменяется: последующий доступ к страницам в области будет успешным, но будет приводить к или повторному заполнению памяти актуальным содержимым из нижележащего отображённого файла (для общих отображений файла, общих анонимных отображений и методов на основе shmem, таких как сегментов общей памяти System V) или к заполнению нулями страниц по требованию у частных анонимных отображений.

source: Note that, when applied to shared mappings, B<MADV_DONTNEED> might not lead to immediate freeing of the pages in the range. The kernel is free to delay freeing the pages until an appropriate moment. The resident set size (RSS) of the calling process will be immediately reduced however.
ru: Заметим, что при применении к общим отображениям операция B<MADV_DONTNEED> может не приводить к немедленному освобождению страниц области. Ядро может задержать освобождение до подходящего момента. Однако размер постоянно занимаемой памяти (RSS) вызывающего процесса будет сокращён сразу же.

source: B<MADV_DONTNEED> cannot be applied to locked pages, Huge TLB pages, or B<VM_PFNMAP> pages. (Pages marked with the kernel-internal B<VM_PFNMAP> flag are special memory areas that are not managed by the virtual memory subsystem. Such pages are typically created by device drivers that map the pages into user space.)
ru: Операция B<MADV_DONTNEED> не может применяться к заблокированным страницам, страницам Huge TLB или страницам B<VM_PFNMAP> (страницы, помеченные внутренним флагом ядра B<VM_PFNMAP> представляют собой специальные области памяти, которые не управляются из подсистемы виртуальной памяти; обычно, эти страницы создаются драйверами устройств, которые отображают страницы в пользовательское пространство).

source: Linux-specific advice values
ru: Значения предложений, имеющиеся только в Linux

source: The following Linux-specific I<advice> values have no counterparts in the POSIX-specified B<posix_madvise>(3), and may or may not have counterparts in the B<madvise>() interface available on other implementations. Note that some of these operations change the semantics of memory accesses.
ru: Следующие значения I<advice> имеются только в Linux и не имеют аналога в определённой POSIX функции B<posix_madvise>(3), а также могут не иметь аналога и в других реализациях интерфейса B<madvise>(). Заметим, что некоторые из этих операций изменяют семантику доступа к памяти.

source: B<MADV_REMOVE> (since Linux 2.6.16)
ru: B<MADV_REMOVE> (начиная с Linux 2.6.16)

source: Free up a given range of pages and its associated backing store. This is equivalent to punching a hole in the corresponding byte range of the backing store (see B<fallocate>(2)). Subsequent accesses in the specified address range will see bytes containing zero.
ru: Освободить указанный диапазон страниц и связанные с ним хранилища. Эквивалентен пробивке отверстия в соответствующем диапазоне байт хранилища (смотрите B<fallocate>(2)). Последующий доступ к указанному адресному диапазону будет возвращать байты с нулями.

source: The specified address range must be mapped shared and writable. This flag cannot be applied to locked pages, Huge TLB pages, or B<VM_PFNMAP> pages.
ru: Указываемый адресный диапазон должен быть общим и доступным на запись отображением. Этот флаг не может применять к заблокированным страницам, страницам Huge TLB или страницам B<VM_PFNMAP>.

source: In the initial implementation, only B<tmpfs>(5) was supported B<MADV_REMOVE>; but since Linux 3.5, any filesystem which supports the B<fallocate>(2) B<FALLOC_FL_PUNCH_HOLE> mode also supports B<MADV_REMOVE>. Hugetlbfs fails with the error B<EINVAL> and other filesystems fail with the error B<EOPNOTSUPP>.
ru: В первоначальной реализации B<MADV_REMOVE> поддерживался только в B<tmpfs>(5), но начиная с Linux 3.5 все файловые системы, поддерживающие B<fallocate>(2) с режимом B<FALLOC_FL_PUNCH_HOLE>, также поддерживают B<MADV_REMOVE>. Hugetlbfs возвращает ошибку B<EINVAL>, а другие файловые системы возвращают ошибку B<EOPNOTSUPP>.

source: B<MADV_DONTFORK> (since Linux 2.6.16)
ru: B<MADV_DONTFORK> (начиная с Linux 2.6.16)

source: Do not make the pages in this range available to the child after a B<fork>(2). This is useful to prevent copy-on-write semantics from changing the physical location of a page if the parent writes to it after a B<fork>(2). (Such page relocations cause problems for hardware that DMAs into the page.)
ru: Сделать недоступными страницы в указанном диапазоне для потомка после B<fork>(2). Это полезно для предотвращения изменения физического расположения страницы копирования-при-записи, если родитель будет изменять её после B<fork>(2) (перемещение таких страниц вызывает проблемы для оборудования, обращающегося к страницам через DMA).

source: B<MADV_DOFORK> (since Linux 2.6.16)
ru: B<MADV_DOFORK> (начиная с Linux 2.6.16)

source: Undo the effect of B<MADV_DONTFORK>, restoring the default behavior, whereby a mapping is inherited across B<fork>(2).
ru: Отменить действие B<MADV_DONTFORK>, восстановить поведение по умолчанию, в силу чего происходит наследование отображения после B<fork>(2).

source: B<MADV_HWPOISON> (since Linux 2.6.32)
ru: B<MADV_HWPOISON> (начиная с Linux 2.6.32)
