Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: printf("Read %zd bytes from MQ\en", nr); free(buf); exit(EXIT_SUCCESS); /* Terminate the process */ }
ru: printf("Read %zd bytes from MQ\en", nr); free(buf); exit(EXIT_SUCCESS); /* Завершение процесса */ }

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>mq-nameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s E<lt>mq-nameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: sev.sigev_notify = SIGEV_THREAD; sev.sigev_notify_function = tfunc; sev.sigev_notify_attributes = NULL; sev.sigev_value.sival_ptr = &mqdes; /* Arg. to thread func. */ if (mq_notify(mqdes, &sev) == -1) handle_error("mq_notify");
ru: sev.sigev_notify = SIGEV_THREAD; sev.sigev_notify_function = tfunc; sev.sigev_notify_attributes = NULL; sev.sigev_value.sival_ptr = &mqdes; /* аргументы функции нити */ if (mq_notify(mqdes, &sev) == -1) handle_error("mq_notify");

source: pause(); /* Process will be terminated by thread function */ }
ru: pause(); /* процесс будет завершён из функции нити */ }

source: makecontext, swapcontext - manipulate user context
ru: makecontext, swapcontext - управляет пользовательским контекстом

source: In a System V-like environment, one has the type I<ucontext_t> defined in I<E<lt>ucontext.hE<gt>> and the four functions B<getcontext>(3), B<setcontext>(3), B<makecontext>() and B<swapcontext>() that allow user-level context switching between multiple threads of control within a process.
ru: В окружении, подобном SysV, имеется тип данных I<mcontext_t>, определённый в файле I<E<lt>ucontext.hE<gt>>, и четыре функции — B<getcontext>(3), B<setcontext>(3), B<makecontext>() и B<swapcontext>(), которые позволяют контексту пользовательского уровня переключаться между несколькими нитями внутри одного процесса.

source: For the type and the first two functions, see B<getcontext>(3).
ru: Описание типа и первых двух функций смотрите в B<getcontext>(3).

source: The B<makecontext>() function modifies the context pointed to by I<ucp> (which was obtained from a call to B<getcontext>(3)). Before invoking B<makecontext>(), the caller must allocate a new stack for this context and assign its address to I<ucp-E<gt>uc_stack>, and define a successor context and assign its address to I<ucp-E<gt>uc_link>.
ru: Функция B<makecontext>() изменяет контекст, на который указывает I<ucp> (полученный из вызова B<getcontext>(3)). Перед вызовом B<makecontext>(), вызывающий должен выделить новый стек для этого контекста и присвоить его адрес I<ucp-E<gt>uc_stack>, и определить последующий контекст и присвоить его адрес I<ucp-E<gt>uc_link>.

source: When this context is later activated (using B<setcontext>(3) or B<swapcontext>()) the function I<func> is called, and passed the series of integer (I<int>) arguments that follow I<argc>; the caller must specify the number of these arguments in I<argc>. When this function returns, the successor context is activated. If the successor context pointer is NULL, the thread exits.
ru: Позднее, когда этот контекст активируется (с помощью B<setcontext>(3) или B<swapcontext>()), вызывается функция I<func> и ей передаётся набор целочисленных аргументов (I<int>), указанных после I<argc>; вызывающий должен указать количество этих аргументов в I<argc>. После возврата из функции активируется последующий контекст. Если указатель последующего контекста равен NULL, то нить завершается.

source: The B<swapcontext>() function saves the current context in the structure pointed to by I<oucp>, and then activates the context pointed to by I<ucp>.
ru: Функция B<swapcontext>() сохраняет текущий контекст в структуру, на которую указывает I<oucp>, и после этого активирует контекст, на который указывает I<ucp>.

source: When successful, B<swapcontext>() does not return. (But we may return later, in case I<oucp> is activated, in which case it looks like B<swapcontext>() returns 0.) On error, B<swapcontext>() returns -1 and sets I<errno> appropriately.
ru: При успешном выполнении B<swapcontext>() не возвращает выполнение (но мы можем вернуться позднее при активации I<oucp> и это будет выглядеть как если бы B<swapcontext>() вернула 0). При ошибке B<swapcontext>() возвращает -1 и изменяет I<errno> соответствующим образом.

source: Insufficient stack space left.
ru: Осталось недостаточно стекового пространства.

source: B<makecontext>() and B<swapcontext>() are provided in glibc since version 2.1.
ru: Функции B<makecontext>() и B<swapcontext>() появились в glibc начиная с версии 2.1.

source: SUSv2, POSIX.1-2001. POSIX.1-2008 removes the specifications of B<makecontext>() and B<swapcontext>(), citing portability issues, and recommending that applications be rewritten to use POSIX threads instead.
ru: SUSv2, POSIX.1-2001. В POSIX.1-2008 удалены определения B<makecontext>() и B<swapcontext>() со ссылкой на проблемы с переносимостью и рекомендацией переписать приложение с использование нитей POSIX.

source: The interpretation of I<ucp-E<gt>uc_stack> is just as in B<sigaltstack>(2), namely, this struct contains the start and length of a memory area to be used as the stack, regardless of the direction of growth of the stack. Thus, it is not necessary for the user program to worry about this direction.
ru: Назначение I<ucp-E<gt>uc_stack> подобно описанному в B<sigaltstack>(2), а именно: данная структура содержит начало и размер области памяти, которая будет использоваться как стек, независимо от направления роста стека. То есть, в пользовательской программе нет необходимости учитывать это направление.

source: On architectures where I<int> and pointer types are the same size (e.g., x86-32, where both types are 32 bits), you may be able to get away with passing pointers as arguments to B<makecontext>() following I<argc>. However, doing this is not guaranteed to be portable, is undefined according to the standards, and won't work on architectures where pointers are larger than I<int>s. Nevertheless, starting with version 2.8, glibc makes some changes to B<makecontext>(), to permit this on some 64-bit architectures (e.g., x86-64).
ru: В архитектурах, где тип I<int> и указатель имеют одинаковый размер (например, x86-32, оба типа имеют размер 32 бита), вы можете передавать указатели в аргументах B<makecontext>() после I<argc>. Однако, это не гарантирует переносимость, не определено в стандарте и не работает на архитектурах, где указатели больше I<int>. Тем не менее, начиная с версии 2.8, в glibc внесены изменения в B<makecontext>(), которые позволяют это и на некоторых 64-битных архитектурах (например, x86-64).

source: The example program below demonstrates the use of B<getcontext>(3), B<makecontext>(), and B<swapcontext>(). Running the program produces the following output:
ru: В программе, показанной далее, демонстрируется использование B<getcontext>(3), B<makecontext>() и B<swapcontext>(). Вот результат запуска этой программы:

source: $B< ./a.out> main: swapcontext(&uctx_main, &uctx_func2) func2: started func2: swapcontext(&uctx_func2, &uctx_func1) func1: started func1: swapcontext(&uctx_func1, &uctx_func2) func2: returning func1: returning main: exiting
ru: $B< ./a.out> main: swapcontext(&uctx_main, &uctx_func2) func2: запущена func2: swapcontext(&uctx_func2, &uctx_func1) func1: запущена func1: swapcontext(&uctx_func1, &uctx_func2) func2: возврат func1: возврат main: выход

source: static void func1(void) { printf("func1: started\en"); printf("func1: swapcontext(&uctx_func1, &uctx_func2)\en"); if (swapcontext(&uctx_func1, &uctx_func2) == -1) handle_error("swapcontext"); printf("func1: returning\en"); }
ru: static void func1(void) { printf("func1: запущена\en"); printf("func1: swapcontext(&uctx_func1, &uctx_func2)\en"); if (swapcontext(&uctx_func1, &uctx_func2) == -1) handle_error("swapcontext"); printf("func1: возврат\en"); }

source: static void func2(void) { printf("func2: started\en"); printf("func2: swapcontext(&uctx_func2, &uctx_func1)\en"); if (swapcontext(&uctx_func2, &uctx_func1) == -1) handle_error("swapcontext"); printf("func2: returning\en"); }
ru: static void func2(void) { printf("func2: запущена\en"); printf("func2: swapcontext(&uctx_func2, &uctx_func1)\en"); if (swapcontext(&uctx_func2, &uctx_func1) == -1) handle_error("swapcontext"); printf("func2: возврат\en"); }

source: if (getcontext(&uctx_func2) == -1) handle_error("getcontext"); uctx_func2.uc_stack.ss_sp = func2_stack; uctx_func2.uc_stack.ss_size = sizeof(func2_stack); /* Successor context is f1(), unless argc E<gt> 1 */ uctx_func2.uc_link = (argc E<gt> 1) ? NULL : &uctx_func1; makecontext(&uctx_func2, func2, 0);
ru: if (getcontext(&uctx_func2) == -1) handle_error("getcontext"); uctx_func2.uc_stack.ss_sp = func2_stack; uctx_func2.uc_stack.ss_size = sizeof(func2_stack); /* последующий контекст — f1(), если argc E<gt> 1 */ uctx_func2.uc_link = (argc E<gt> 1) ? NULL : &uctx_func1; makecontext(&uctx_func2, func2, 0);

source: printf("main: exiting\en"); exit(EXIT_SUCCESS); }
ru: printf("main: выход\en"); exit(EXIT_SUCCESS); }

source: memmem - locate a substring
ru: memmem - ищет подстроку

source: The B<memmem>() function finds the start of the first occurrence of the substring I<needle> of length I<needlelen> in the memory area I<haystack> of length I<haystacklen>.
ru: Функция B<memmem>() ищет начало первого появления подстроки I<needle> длинной I<needlelen> в области памяти I<haystack> размером I<haystacklen>.

source: The B<memmem>() function returns a pointer to the beginning of the substring, or NULL if the substring is not found.
ru: Функция B<memmem>() возвращает указатель на начало подстроки или NULL, если подстрока не найдена.

source: This function is not specified in POSIX.1, but is present on a number of other systems.
ru: Эта функция не определена в POSIX.1, однако доступна в некоторых других системах.

source: In glibc 2.0, if I<needle> is empty, B<memmem>() returns a pointer to the last byte of I<haystack>. This is fixed in glibc 2.1.
ru: В glibc 2.0, если I<needle> пусто, то B<memmem>() возвращает указатель на последний байт I<haystack>. Это исправлено в glibc 2.1.

source: mkstemp, mkostemp, mkstemps, mkostemps - create a unique temporary file
ru: mkstemp, mkostemp, mkstemps, mkostemps - создаёт временный файл с уникальным именем

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* версии glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: B<mkstemps>(): /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: B<mkstemps>(): /* glibc начиная с 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: The B<mkstemp>() function generates a unique temporary filename from I<template>, creates and opens the file, and returns an open file descriptor for the file.
ru: Функция B<mktemp>() генерирует на основе шаблона I<template> уникальное имя для временного файла, создаёт и открывает файл, после чего возвращает дескриптор открытого файла.

source: The last six characters of I<template> must be "XXXXXX" and these are replaced with a string that makes the filename unique. Since it will be modified, I<template> must not be a string constant, but should be declared as a character array.
ru: Последние шесть символов I<template> должны быть равны "XXXXXX", они будут заменены на строку, которая сделает имя файла уникальным. Так как I<template> будет меняться, он должна быть объявлен не строковой константой, а массивом символов.

source: The file is created with permissions 0600, that is, read plus write for owner only. The returned file descriptor provides both read and write access to the file. The file is opened with the B<open>(2) B<O_EXCL> flag, guaranteeing that the caller is the process that creates the file.
ru: Файл создается с правами 0600, то есть читать и записывать в него может только владелец. Возвращаемый дескриптор файла предоставляет доступ к файлу как на чтение, так и на запись. Файл открывается с помощью B<open>(2) с флагом B<O_EXCL>, что гарантирует, что вызывающий является процессом, создавшим файл.

source: The B<mkostemp>() function is like B<mkstemp>(), with the difference that the following bits\(emwith the same meaning as for B<open>(2)\(emmay be specified in I<flags>: B<O_APPEND>, B<O_CLOEXEC>, and B<O_SYNC>. Note that when creating the file, B<mkostemp>() includes the values B<O_RDWR>, B<O_CREAT>, and B<O_EXCL> in the I<flags> argument given to B<open>(2); including these values in the I<flags> argument given to B<mkostemp>() is unnecessary, and produces errors on some systems.
ru: Функция B<mkostemp>() подобна B< mkstemp>(), но отличие в том, что следующие биты (с теми же значениями что и для B<open>(2)) могут быть указаны в I<flags>: B<O_APPEND>, B<O_CLOEXEC> и B<O_SYNC>. Заметим, что при создании файла B<mkostemp>() включает значения B<O_RDWR>, B<O_CREAT> и B<O_EXCL> в аргумент I<flags> при вызове B<open>(2); добавлять эти значения в аргумент I<flags> при вызове B<mkostemp>() необязательно и это приводит к ошибках в некоторых системах.

source: The B<mkstemps>() function is like B<mkstemp>(), except that the string in I<template> contains a suffix of I<suffixlen> characters. Thus, I<template> is of the form I<prefixXXXXXXsuffix>, and the string XXXXXX is modified as for B<mkstemp>().
ru: Функция B<mkstemps>() похожа на B<mkstemp>(), за исключением строки в I<template>, которая содержит символы суффикса I<suffixlen>. Таким образом, I<template> будет приобретать вид I<prefixXXXXXXsuffix>, а строка XXXXXX будет меняться так же, как и для B<mkstemp>().

source: The B<mkostemps>() function is to B<mkstemps>() as B<mkostemp>() is to B<mkstemp>().
ru: Функция B<mkostemps>() является аналогом B<mkstemps>(), подобно как B<mkostemp>() является аналогом B<mkstemp>().

source: On success, these functions return the file descriptor of the temporary file. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении данные функции возвращают дескриптор временного файла. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Could not create a unique temporary filename. Now the contents of I<template> are undefined.
ru: Невозможно создать уникальное имя временного файла. Содержимое I<template> теперь не определено.

source: For B<mkstemp>() and B<mkostemp>(): The last six characters of I<template> were not XXXXXX; now I<template> is unchanged.
ru: Для B<mkstemp>() и B<mkostemp>(): последние шесть символов I<template> не равны XXXXXX. I<template> не изменён.

source: For B<mkstemps>() and B<mkostemps>(): I<template> is less than I<(6 + suffixlen)> characters long, or the last 6 characters before the suffix in I<template> were not XXXXXX.
ru: Для B<mkstemps>() и B<mkostemps>(): количество символов I<template> меньше, чем I<(6 + suffixlen)> или последние 6 символов до суффикса в I<template> не равны XXXXXX.

source: These functions may also fail with any of the errors described for B<open>(2).
ru: Данные функции также могут завершиться ошибками, описанными в B<open>(2).

source: B<mkostemp>() is available since glibc 2.7. B<mkstemps>() and B<mkostemps>() are available since glibc 2.11.
ru: B<mkostemp>() впервые появилась в glibc 2.7. B<mkstemps>() и B<mkostemps>() доступны в glibc с версии 2.11.

source: B<mkstemps>(): unstandardized, but appears on several other systems.
ru: B<mkstemps>() не стандартизована, однако может присутствовать на некоторых системах.

source: B<mkostemp>() and B<mkostemps>(): are glibc extensions.
ru: B<mkostemp>() и B<mkstemp>(): являются расширениями glibc.

source: In glibc versions 2.06 and earlier, the file is created with permissions 0666, that is, read and write for all users. This old behavior may be a security risk, especially since other UNIX flavors use 0600, and somebody might overlook this detail when porting programs. POSIX.1-2008 adds a requirement that the file be created with mode 0600.
ru: В версиях glibc 2.06 и ниже файл создавался с правами 0666, то есть читать и записывать в него могли все пользователи. Это старое поведение может быть небезопасным, особенно когда в других UNIX используются права 0600, и кто-то может не заметить это отличие при переносе программы. В POSIX.1-2008 добавлено требование, что файл должен создаваться с правами 0600.

source: More generally, the POSIX specification of B<mkstemp>() does not say anything about file modes, so the application should make sure its file mode creation mask (see B<umask>(2)) is set appropriately before calling B<mkstemp>() (and B<mkostemp>()).
ru: В более общем смысле, в спецификации POSIX для B<mkstemp>() ничего не сказано о правах на файл, поэтому программа должна сама проверить до вызова B<mkstemp>() (и B<mkostemp>()), что маска создания файла (смотрите B<umask>(2)) уставлена в правильное значение.

source: mq_close - close a message queue descriptor
ru: mq_close - закрывает дескриптор очереди сообщений

source: B<mq_close>() closes the message queue descriptor I<mqdes>.
ru: B<mq_close>() закрывает дескриптор очереди сообщений I<mqdes>.

source: If the calling process has attached a notification request (see (B<mq_notify>(3)) to this message queue via I<mqdes>, then this request is removed, and another process can now attach a notification request.
ru: Если к вызывающему процессу присоединён запрос уведомления (смотрите (B<mq_notify>(3)) от этой очереди сообщений через I<mqdes>, то этот запрос удаляется, и теперь другой процесс может присоединить запрос уведомлений.

source: On success B<mq_close>() returns 0; on error, -1 is returned, with I<errno> set to indicate the error.
ru: При успешном выполнении B<mq_close>() возвращается 0; при ошибке возвращается -1, а в I<errno> помещается код ошибки.

source: All open message queues are automatically closed on process termination, or upon B<execve>(2).
ru: Все открытые очереди сообщений автоматически закрываются при завершении процесса или после B<execve>(2).

source: mq_open - open a message queue
ru: mq_open - открывает очередь сообщений

source: B<#include E<lt>fcntl.hE<gt>> /* For O_* constants */ B<#include E<lt>sys/stat.hE<gt>> /* For mode constants */ B<#include E<lt>mqueue.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt>> /* Постоянные вида O_* */ B<#include E<lt>sys/stat.hE<gt>> /* Постоянные для mode */ B<#include E<lt>mqueue.hE<gt>>

source: B<mq_open>() creates a new POSIX message queue or opens an existing queue. The queue is identified by I<name>. For details of the construction of I<name>, see B<mq_overview>(7).
ru: Функция B<mq_open>() создает новую очередь сообщений POSIX или открывает существующую очередь. Очередь опознаётся по имени I<name>. Для получения дополнительной информации о создании имени I<name>, смотрите B<mq_overview>(7).

source: The I<oflag> argument specifies flags that control the operation of the call. (Definitions of the flags values can be obtained by including I<E<lt>fcntl.hE<gt>>.) Exactly one of the following must be specified in I<oflag>:
ru: В параметре I<oflag> задаются флаги, которые управляют работой вызова (значения флагов могут быть получены при включении I<E<lt>fcntl.hE<gt>>). Поместить в параметр I<oflag> можно только один из ниже приведенных флагов:

source: Open the queue to receive messages only.
ru: Открыть очередь только для получения сообщений.

source: Open the queue to send messages only.
ru: Открыть очередь только для отправки сообщений.

source: Open the queue to both send and receive messages.
ru: Открыть очередь для отправки и получения сообщений.

source: Zero or more of the following flags can additionally be I<OR>ed in I<oflag>:
ru: Также в I<oflag> можно добавить ноль и более флагов, объединённых через ИЛИ:

source: B<O_CLOEXEC> (since Linux 2.6.26)
ru: B<O_CLOEXEC> (начиная с Linux 2.6.26)

source: Set the close-on-exec flag for the message queue descriptor. See B<open>(2) for a discussion of why this flag is useful.
ru: Установить флаг close-on-exec на файловом дескрипторе очереди сообщений. Описание полезности этого флага смотрите в B<open>(2).

source: Create the message queue if it does not exist. The owner (user ID) of the message queue is set to the effective user ID of the calling process. The group ownership (group ID) is set to the effective group ID of the calling process.
ru: Создать очередь сообщений, если она не существует. Владельцем (ID пользователя) очереди сообщений назначается эффективный ID пользователя вызывающего процесса. Владельцем-группой (ID группы) назначается эффективный ID группы вызывающего процесса.

source: If B<O_CREAT> was specified in I<oflag>, and a queue with the given I<name> already exists, then fail with the error B<EEXIST>.
ru: Если в поле I<oflag> выставлен флаг B<O_CREAT> и очередь с заданным именем I<name> уже существует, то завершить вызов ошибкой B<EEXIST>.

source: Open the queue in nonblocking mode. In circumstances where B<mq_receive>(3) and B<mq_send>(3) would normally block, these functions instead fail with the error B<EAGAIN>.
ru: Открыть очередь в неблокирующем режиме. При обстоятельствах, из-за которых B<mq_receive>(3) и B<mq_send>(3), обычно, блокируются, теперь эти функции будут завершаться ошибкой B<EAGAIN>.

source: If B<O_CREAT> is specified in I<oflag>, then two additional arguments must be supplied. The I<mode> argument specifies the permissions to be placed on the new queue, as for B<open>(2). (Symbolic definitions for the permissions bits can be obtained by including I<E<lt>sys/stat.hE<gt>>.) The permissions settings are masked against the process umask.
ru: Если в I<oflag> указан B<O_CREAT>, требуется задать два дополнительных аргумента. В аргументе I<mode> задаются права доступа к новой очереди, как для B<open>(2) (символические определения бит прав можно получить, включив I<E<lt>sys/stat.hE<gt>>). В настройках прав учитывается umask процесса.

source: The fields of the I<struct mq_attr> pointed to I<attr> specify the maximum number of messages and the maximum size of messages that the queue will allow. This structure is defined as follows:
ru: В полях структуры I<struct mq_attr>, на которую указывает I<attr>, задаётся максимальное количество сообщений и максимальный размер сообщений, разрешённых в очереди. Эта структура определена следующим образом:

source: struct mq_attr { long mq_flags; /* Flags (ignored for mq_open()) */ long mq_maxmsg; /* Max. # of messages on queue */ long mq_msgsize; /* Max. message size (bytes) */ long mq_curmsgs; /* # of messages currently in queue (ignored for mq_open()) */ };
ru: struct mq_attr { long mq_flags; /* флаги (игнорируются в mq_open()) */ long mq_maxmsg; /* макс. кол-во сообщений в очереди */ long mq_msgsize; /* макс. размер сообщения (в байтах) */ long mq_curmsgs; /* кол-во сообщений в очереди в данный момент (игнорируется в mq_open()) */ };

source: Only the I<mq_maxmsg> and I<mq_msgsize> fields are employed when calling B<mq_open>(); the values in the remaining fields are ignored.
ru: В функции B<mq_open>() используются только поля I<mq_maxmsg> и I<mq_msgsize>; остальные значения полей игнорируются.

source: If I<attr> is NULL, then the queue is created with implementation-defined default attributes. Since Linux 3.5, two I</proc> files can be used to control these defaults; see B<mq_overview>(7) for details.
ru: Если I<attr> равно NULL, то очередь создаётся с атрибутами по умолчанию, зависящими от реализации. Начиная с Linux 3.5, для управления атрибутами по умолчанию можно управлять через два файла в I</proc>; подробности смотрите в B<mq_overview>(7).
