Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: struct mallinfo { int arena; /* Non-mmapped space allocated (bytes) */ int ordblks; /* Number of free chunks */ int smblks; /* Number of free fastbin blocks */ int hblks; /* Number of mmapped regions */ int hblkhd; /* Space allocated in mmapped regions (bytes) */ int usmblks; /* Maximum total allocated space (bytes) */ int fsmblks; /* Space in freed fastbin blocks (bytes) */ int uordblks; /* Total allocated space (bytes) */ int fordblks; /* Total free space (bytes) */ int keepcost; /* Top-most, releasable space (bytes) */ };
ru: struct mallinfo { int arena; /* не размеченная область памяти выделенная под кучу (в байтах) */ int ordblks; /* Количество свободных блоков */ int smblks; /* Количество свободных блоков fastbin */ int hblks; /* Количество размеченных областей */ int hblkhd; /* Пространство, выделенное в размеченных областях (в байтах) */ int usmblks; /* Максимум общей выделенной области (в байтах) */ int fsmblks; /* Пространство в освобожденных fastbin блоках (в байтах) */ int uordblks; /* Общее выделенное пространство (в байтах) */ int fordblks; /* Общее свободное пространство (в байтах) */ int keepcost; /* Верхнее пространство, которое можно освободить (в байтах) */ };

source: The fields of the I<mallinfo> structure contain the following information:
ru: Поля структуры I<mallinfo> содержат следующую информацию:

source: The total amount of memory allocated by means other than B<mmap>(2) (i.e., memory allocated on the heap). This figure includes both in-use blocks and blocks on the free list.
ru: Общее количество памяти, выделенной способами отличными от B<mmap>(2) (т. е., память, выделенная из кучи). Это значение включает используемые и свободные блоки из списка.

source: The number of ordinary (i.e., non-fastbin) free blocks.
ru: Количество обычных (т. е., не fastbin) свободных блоков.

source: The number of fastbin free blocks (see B<mallopt>(3)).
ru: Количество свободных блоков fastbin (смотрите B<mallopt>(3)).

source: The number of blocks currently allocated using B<mmap>(2). (See the discussion of B<M_MMAP_THRESHOLD> in B<mallopt>(3).)
ru: Количество блоков, выделенных с помощью B<mmap>(2) на настоящий момент (смотрите описание B<M_MMAP_THRESHOLD> в B<mallopt>(3)).

source: The number of bytes in blocks currently allocated using B<mmap>(2).
ru: Количество байт в блоках, выделенных с помощью B<mmap>(2) на настоящий момент.

source: The "highwater mark" for allocated space\(emthat is, the maximum amount of space that was ever allocated. This field is maintained only in nonthreading environments.
ru: «Верхняя отметка» выделенного пространства, то есть максимальное количество места, которое когда-либо выделялось. Это поле изменяется только в окружениях без нитей.

source: The total number of bytes in fastbin free blocks.
ru: Общее количество байт в свободных блоках fastbin.

source: The total number of bytes used by in-use allocations.
ru: Общее количество байт, в используемой выделенной памяти.

source: The total number of bytes in free blocks.
ru: Общее количество байт в свободных блоках.

source: The total amount of releasable free space at the top of the heap. This is the maximum number of bytes that could ideally (i.e., ignoring page alignment restrictions, and so on) be released by B<malloc_trim>(3).
ru: Общее количество освобождаемого свободного пространства сверху кучи. Это значение является максимальным количеством байт, которое будет освобождено B<malloc_trim>(3) в идеальном случае (т. е., без учёта ограничений по выравниванию и т. п.).

source: B<mallinfo>() would access some global internal objects. If modify them with non-atomically, may get inconsistent results. The identifier I<mallopt> in I<const:mallopt> mean that B<mallopt>() would modify the global internal objects with atomics, that make sure B<mallinfo>() is safe enough, others modify with non-atomically maybe not.
ru: Функция B<mallinfo>() получила бы доступ к некоторым глобальным внутренним переменным. Если изменять их не атомарно, то можно нарушить целостность результатов. Идентификатор I<mallopt> в I<const:mallopt> означает, что B<mallopt>() изменяла бы глобальные внутренние переменные атомарно, что делает B<mallinfo>() достаточно безопасной, но другие изменения могут выполняться не атомарно.

source: This function is not specified by POSIX or the C standards. A similar function exists on many System V derivatives, and was specified in the SVID.
ru: Эта функция не определена в стандартах POSIX и С. Подобная функция существует на многих производных от System V и была определена в SVID.

source: B<Information is returned for only the main memory allocation area.> Allocations in other arenas are excluded. See B<malloc_stats>(3) and B<malloc_info>(3) for alternatives that include information about other arenas.
ru: B<Информация возвращается только для главной области выделяемой памяти.> Выделение в других областях не учитываются. Альтернативой, возвращаемой информацию о других частях, являются B<malloc_stats>(3) и B<malloc_info>(3).

source: The fields of the I<mallinfo> structure are typed as I<int>. However, because some internal bookkeeping values may be of type I<long>, the reported values may wrap around zero and thus be inaccurate.
ru: Поля структуры I<mallinfo> имеют тип I<int>. Однако, из-за того, что некоторые внутренние значения поддержки (bookkeeping) могут иметь тип I<long>, возвращаемые значения могут быть близкими к нулю и поэтому не точны.

source: The program below employs B<mallinfo>() to retrieve memory allocation statistics before and after allocating and freeing some blocks of memory. The statistics are displayed on standard output.
ru: Программа, представленная ниже, вызывает B<mallinfo>() для получения статистики по выделенной памяти перед и после выделения и освобождения нескольких блоков памяти. Статистика выдаётся в стандартный вывод.

source: The first two command-line arguments specify the number and size of blocks to be allocated with B<malloc>(3).
ru: Первые два параметра командной строки определяют количество и размер блоков, которые будут выделены с помощью B<malloc>(3).

source: The remaining three arguments specify which of the allocated blocks should be freed with B<free>(3). These three arguments are optional, and specify (in order): the step size to be used in the loop that frees blocks (the default is 1, meaning free all blocks in the range); the ordinal position of the first block to be freed (default 0, meaning the first allocated block); and a number one greater than the ordinal position of the last block to be freed (default is one greater than the maximum block number). If these three arguments are omitted, then the defaults cause all allocated blocks to be freed.
ru: В оставшихся трёх аргументах задаётся какие из выделенных блоков должны быть освобождены с помощью B<free>(3). Эти аргументы необязательны и определяют (по порядку): размер шага, используемый в цикле освобождения блоков (по умолчанию 1, что приводит к освобождению всех блоков диапазона); порядковая позиция первого освобождаемого блока (по умолчанию 0, то есть первый выделенный блок); номер, на единицу больший порядковой позиции последнего освобождаемого блока (по умолчанию, на единицу больше, чем максимальное количество блоков). Если эти аргументы не указаны, то по умолчанию освобождаются все выделенные блоки.

source: In the following example run of the program, 1000 allocations of 100 bytes are performed, and then every second allocated block is freed:
ru: Пример запуска программы, где память выделяется 1000 раз по 100 байт, а затем освобождается каждый второй выделенный блок:

source: $ B<./a.out 1000 100 2> ============== Before allocating blocks ============== Total non-mmapped bytes (arena): 0 # of free chunks (ordblks): 1 # of free fastbin blocks (smblks): 0 # of mapped regions (hblks): 0 Bytes in mapped regions (hblkhd): 0 Max. total allocated space (usmblks): 0 Free bytes held in fastbins (fsmblks): 0 Total allocated space (uordblks): 0 Total free space (fordblks): 0 Topmost releasable block (keepcost): 0
ru: $ B<./a.out 1000 100 2> ============== перед выделением блоков ============== всего неотображённых байт (часть): 0 кол-во свободных порций (ordblks): 1 кол-во свободных блоков fastbin (smblks): 0 кол-во отображённых областей (hblks): 0 байтов в отображённых областях (hblkhd): 0 максимальное количество выделенного пространства (usmblks): 0 свободных байт в fastbins (fsmblks): 0 полное выделенное пространство (uordblks): 0 полное свободное пространство (fordblks): 0 освобождаемых блоков сверху (keepcost): 0

source: ============== After allocating blocks ============== Total non-mmapped bytes (arena): 135168 # of free chunks (ordblks): 1 # of free fastbin blocks (smblks): 0 # of mapped regions (hblks): 0 Bytes in mapped regions (hblkhd): 0 Max. total allocated space (usmblks): 0 Free bytes held in fastbins (fsmblks): 0 Total allocated space (uordblks): 104000 Total free space (fordblks): 31168 Topmost releasable block (keepcost): 31168
ru: ============== после выделения блоков ============== всего неотображённых байт (часть): 1 кол-во свободных порций (ordblks): 0 кол-во свободных блоков fastbin (smblks): 0 кол-во отображённых областей (hblks): 0 байтов в отображённых областях (hblkhd): 0 максимальное количество выделенного пространства (usmblks): 0 свободных байт в fastbins (fsmblks): 0 полное выделенное пространство (uordblks): 104000 полное свободное пространство (fordblks): 31168 освобождаемых блоков сверху (keepcost): 31168

source: ============== After freeing blocks ============== Total non-mmapped bytes (arena): 135168 # of free chunks (ordblks): 501 # of free fastbin blocks (smblks): 0 # of mapped regions (hblks): 0 Bytes in mapped regions (hblkhd): 0 Max. total allocated space (usmblks): 0 Free bytes held in fastbins (fsmblks): 0 Total allocated space (uordblks): 52000 Total free space (fordblks): 83168 Topmost releasable block (keepcost): 31168
ru: ============== после освобождения блоков ============== всего неотображённых байт (часть): 135168 кол-во свободных порций (ordblks): 501 кол-во свободных блоков fastbin (smblks): 0 кол-во отображённых областей (hblks): 0 байтов в отображённых областях (hblkhd): 0 максимальное количество выделенного пространства (usmblks): 0 свободных байт в fastbins (fsmblks): 0 полное выделенное пространство (uordblks): 52000 полное свободное пространство (fordblks): 83168 освобождаемых блоков сверху (keepcost): 31168

source: printf("Total non-mmapped bytes (arena): %d\en", mi.arena); printf("# of free chunks (ordblks): %d\en", mi.ordblks); printf("# of free fastbin blocks (smblks): %d\en", mi.smblks); printf("# of mapped regions (hblks): %d\en", mi.hblks); printf("Bytes in mapped regions (hblkhd): %d\en", mi.hblkhd); printf("Max. total allocated space (usmblks): %d\en", mi.usmblks); printf("Free bytes held in fastbins (fsmblks): %d\en", mi.fsmblks); printf("Total allocated space (uordblks): %d\en", mi.uordblks); printf("Total free space (fordblks): %d\en", mi.fordblks); printf("Topmost releasable block (keepcost): %d\en", mi.keepcost); }
ru: printf("всего неотображённых байт (часть): %d\en", mi.arena); printf("кол-во свободных порций (ordblks): %d\en", mi.ordblks); printf("кол-во свободных блоков fastbin (smblks): %d\en", mi.smblks); printf("кол-во отображённых областей (hblks): %d\en", mi.hblks); printf("байтов в отображённых областях (hblkhd): %d\en", mi.hblkhd); printf("максимальное количество выделенного пространства (usmblks): %d\en", mi.usmblks); printf("свободных байт в fastbins (fsmblks): %d\en", mi.fsmblks); printf("полное выделенное пространство (uordblks): %d\en", mi.uordblks); printf("полное свободное пространство (fordblks): %d\en", mi.fordblks); printf("освобождаемых блоков сверху (keepcost): %d\en", mi.keepcost); }

source: if (argc E<lt> 3 || strcmp(argv[1], "--help") == 0) { fprintf(stderr, "%s num-blocks block-size [free-step " "[start-free [end-free]]]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 3 || strcmp(argv[1], "--help") == 0) { fprintf(stderr, "%s кол-во блоков размер блока [шаг освобождения" "[начало освобождения [конец освобождения]]]\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("============== Before allocating blocks ==============\en"); display_mallinfo();
ru: printf("============== перед выделением блоков ==============\en"); display_mallinfo();

source: for (j = 0; j E<lt> numBlocks; j++) { if (numBlocks E<gt>= MAX_ALLOCS) { fprintf(stderr, "Too many allocations\en"); exit(EXIT_FAILURE); }
ru: for (j = 0; j E<lt> numBlocks; j++) { if (numBlocks E<gt>= MAX_ALLOCS) { fprintf(stderr, "слишком много выделений\en"); exit(EXIT_FAILURE); }

source: printf("\en============== After allocating blocks ==============\en"); display_mallinfo();
ru: printf("\en============== после выделения блоков ==============\en"); display_mallinfo();

source: printf("\en============== After freeing blocks ==============\en"); display_mallinfo();
ru: printf("\en============== после освобождения блоков ==============\en"); display_mallinfo();

source: mtrace, muntrace - malloc tracing
ru: mtrace, muntrace - трассировка malloc

source: The B<mtrace>() function installs hook functions for the memory-allocation functions (B<malloc>(3), B<realloc>(3) B<memalign>(3), B<free>(3)). These hook functions record tracing information about memory allocation and deallocation. The tracing information can be used to discover memory leaks and attempts to free nonallocated memory in a program.
ru: Функция B<mtrace>() устанавливает перехватывающие функции (hook functions) на функции выделения памяти (B<malloc>(3), B<realloc>(3), B<memalign>(3), B<free>(3)). Эти перехватывающие функции записывают трассировочную информация о выделении и освобождении памяти. Информация о трассировке может использоваться в программе для обнаружения утечек памяти и попыток освобождения не выделенной памяти.

source: The B<muntrace>() function disables the hook functions installed by B<mtrace>(), so that tracing information is no longer recorded for the memory-allocation functions. If no hook functions were successfully installed by B<mtrace>(), B<muntrace>() does nothing.
ru: Функция B<muntrace>() отключает перехватывающие функции, установленные B<mtrace>() и трассировка функций выделения памяти больше не выполняется. Если B<mtrace>() не установила перехватывающие функции, то B<muntrace>() ничего не делает.

source: When B<mtrace>() is called, it checks the value of the environment variable B<MALLOC_TRACE>, which should contain the pathname of a file in which the tracing information is to be recorded. If the pathname is successfully opened, it is truncated to zero length.
ru: При вызове B<mtrace>() она проверяет значение переменной окружения B<MALLOC_TRACE>, в которой должен содержаться путь к файлу для записи информации о трассировке. При открытии этого файла он обрезается до нулевой длины.

source: If B<MALLOC_TRACE> is not set, or the pathname it specifies is invalid or not writable, then no hook functions are installed, and B<mtrace>() has no effect. In set-user-ID and set-group-ID programs, B<MALLOC_TRACE> is ignored, and B<mtrace>() has no effect.
ru: Если B<MALLOC_TRACE> не существует или указанный путь некорректен или недоступен для записи, то перехватывающие функции не устанавливаются и B<mtrace>() ничего не делает. Для программ с установленными set-user-ID и set-group-ID переменная B<MALLOC_TRACE> игнорируется и B<mtrace>() ничего не делает.

source: In normal usage, B<mtrace>() is called once at the start of execution of a program, and B<muntrace>() is never called.
ru: В обычной работе B<mtrace>() вызывается один раз в начале выполнения программы, а B<muntrace>() никогда не вызывается.

source: The tracing output produced after a call to B<mtrace>() is textual, but not designed to be human readable. The GNU C library provides a Perl script, B<mtrace>(1), that interprets the trace log and produces human-readable output. For best results, the traced program should be compiled with debugging enabled, so that line-number information is recorded in the executable.
ru: Результат трассировки после вызова B<mtrace>() имеет текстовый формат, не предназначенный для чтения человеком. В библиотеке GNU C есть сценарий Perl, B<mtrace>(1), который преобразует журнал трассировки в читаемый вид. Для лучших результатов трассируемая программа должна быть скомпилирована с включённой отладкой для того, чтобы в исполняемый файл попала информация c номерами строк.

source: The tracing performed by B<mtrace>() incurs a performance penalty (if B<MALLOC_TRACE> points to a valid, writable pathname).
ru: Трассировка, выполняемая B<mtrace>(), ухудшает производительность (если B<MALLOC_TRACE> указывает на корректный, доступный на запись файл).

source: The line-number information produced by B<mtrace>(1) is not always precise: the line number references may refer to the previous or following (nonblank) line of the source code.
ru: Информация о номере строки, выдаваемая в B<mtrace>(1), не всегда точна: номер строки может ссылаться на предыдущую или следующую (не пустую) строку исходного кода.

source: The shell session below demonstrates the use of the B<mtrace>() function and the B<mtrace>(1) command in a program that has memory leaks at two different locations. The demonstration uses the following program:
ru: Далее представлен пример работы функции B<mtrace>() и команды B<mtrace>(1) для программы с утечкой памяти в двух местах. Для демонстрации используется следующая программа:

source: for (j = 0; j E<lt> 2; j++) malloc(100); /* Never freed--a memory leak */
ru: for (j = 0; j E<lt> 2; j++) malloc(100); /* никогда не освобождается — утечка памяти */

source: calloc(16, 16); /* Never freed--a memory leak */ exit(EXIT_SUCCESS); }
ru: calloc(16, 16); /* Никогда не освобождается — утечка памяти */ exit(EXIT_SUCCESS); }

source: When we run the program as follows, we see that B<mtrace>() diagnosed memory leaks at two different locations in the program:
ru: При выполнении этой программы мы видим, что B<mtrace>() обнаружила утечку памяти в двух местах программы:

source: The first two messages about unfreed memory correspond to the two B<malloc>(3) calls inside the I<for> loop. The final message corresponds to the call to B<calloc>(3) (which in turn calls B<malloc>(3)).
ru: Первые два сообщения о не освобожденной памяти относятся к двум вызовам B<malloc>(3), сделанным внутри цикла I<for>. Заключительное сообщение относится к вызову B<calloc>(3) (которая, в свою очередь, вызывает B<malloc>(3)).

source: mkfifo, mkfifoat - make a FIFO special file (a named pipe)
ru: mkfifo, mkfifoat - создают специальный файл очереди FIFO (именованный канал)

source: B<mkfifo>() makes a FIFO special file with name I<pathname>. I<mode> specifies the FIFO's permissions. It is modified by the process's B<umask> in the usual way: the permissions of the created file are B<(>I<mode>B< & ~umask)>.
ru: Функция B<mkfifo>() создаёт специальный файл FIFO с именем I<pathname> и правами доступа I<mode>. Как обычно, в правах учитывается значение I<umask> процесса: права на создаваемый файл вычисляются как B<(I<mode> & ~I<umask>)>.

source: A FIFO special file is similar to a pipe, except that it is created in a different way. Instead of being an anonymous communications channel, a FIFO special file is entered into the filesystem by calling B<mkfifo>().
ru: Специальный файл FIFO подобен каналу, за исключением того, что он создаётся другим способом. Вызов B<mkfifo>() вместо безымянного канала взаимодействия создаёт специальный файл FIFO, расположенный в файловой системе.

source: Once you have created a FIFO special file in this way, any process can open it for reading or writing, in the same way as an ordinary file. However, it has to be open at both ends simultaneously before you can proceed to do any input or output operations on it. Opening a FIFO for reading normally blocks until some other process opens the same FIFO for writing, and vice versa. See B<fifo>(7) for nonblocking handling of FIFO special files.
ru: После создания специального файла FIFO, любой процесс может открывать его для чтения или записи, как если бы он открывал обычный файл. Однако прежде чем вы сможете что-либо сделать, его необходимо открыть с обоих концов, притом одновременно. Открытие FIFO для чтения обычно блокируется, пока какой-нибудь другой процесс не откроет его для записи, и наоборот. Описание работы со специальными файлами FIFO в неблокирующем режиме смотрите в B<fifo>(7).

source: The B<mkfifoat>() function operates in exactly the same way as B<mkfifo>(), except for the differences described here.
ru: Функция B<mkfifoat>() работает также как как B<mkfifo>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<mkfifo>() for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<mkfifo>(3)).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<mkfifo>()).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<mkfifo>(3)).

source: On success B<mkfifo>() and B<mkfifoat>() return 0. In the case of an error, -1 is returned (in which case, I<errno> is set appropriately).
ru: При успешном выполнении вызовы B<mkfifo>() и B<mkfifoat>() возвращают 0. В случае ошибки возвращают -1, а I<errno> устанавливается в соответствующее значение.

source: One of the directories in I<pathname> did not allow search (execute) permission.
ru: Один из каталогов содержащихся в I<pathname> не позволяет выполнить поиск, так как правами запрещено исполнение.

source: Either the total length of I<pathname> is greater than B<PATH_MAX>, or an individual filename component has a length greater than B<NAME_MAX>. In the GNU system, there is no imposed limit on overall filename length, but some filesystems may place limits on the length of a component.
ru: Если длина полного имени файла (включая путь) I<pathname> больше чем B<PATH_MAX> или длина имени файла больше чем B<NAME_MAX>. В общем случае в системах, соответствующих стандарту GNU, отсутствует ограничение на длину полного имени файла, однако некоторые файловые системы могут устанавливать ограничение на длину отдельного компонента.

source: The directory or filesystem has no room for the new file.
ru: В каталоге или файловой системе закончились места для новых файлов.

source: I<pathname> refers to a read-only filesystem.
ru: I<pathname> указывает на файловую систему, доступную только для чтения.

source: The following additional errors can occur for B<mkfifoat>():
ru: Следующие дополнительные ошибки могут быть характерны для B<mkfifoat>():

source: I<pathname> is a relative path and I<dirfd> is a file descriptor referring to a file other than a directory.
ru: I<pathname> является относительным путем, а I<dirfd> является файловым дескриптором, указывающим на файл, отличный от каталога.

source: B<mkfifoat>() was added to glibc in version 2.4. It is implemented using B<mknodat>(2), available on Linux since kernel 2.6.16.
ru: Функция B<mkfifoat>() была добавлена в glibc 2.4. Она реализована с помощью системного вызова B<mknodat>(2), доступного в ядре Linux начиная с версии 2.6.16.
