Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: When we examine the mount points in the second mount namespace, we see that in this case the new mount has been propagated to the slave mount point, and that the new mount is itself a slave mount (to peer group 4):
ru: Если посмотреть точки монтирования во втором пространстве имён монтирования, то можно увидеть, что на этот раз новая точка монтирования передалась в подчинённую точку монтирования и что эта новая точка монтирования сама является подчинённой (равноправной группе 4):

source: MS_UNBINDABLE example
ru: Пример MS_UNBINDABLE

source: One of the primary purposes of unbindable mounts is to avoid the "mount point explosion" problem when repeatedly performing bind mounts of a higher-level subtree at a lower-level mount point. The problem is illustrated by the following shell session.
ru: Одним из основных назначений непривязываемых точек монтирования является решение проблемы «взрыва точек монтирования» — повторяющееся выполнение привязки точки монтирования поддерева верхнего уровня в точках монтирования нижнего уровня. Эта проблема показана в сеансе далее.

source: Suppose we have a system with the following mount points:
ru: Предположим, что имеется система с следующими точками монтирования:

source: Suppose furthermore that we wish to recursively bind mount the root directory under several users' home directories. We do this for the first user, and inspect the mount points:
ru: Предположим, что нужно рекурсивно привязать точки монтирования корневого каталога в нескольких пользовательских домашних каталогах. Сделаем это для первого пользователя и посмотрим точки монтирования:

source: When we repeat this operation for the second user, we start to see the explosion problem:
ru: Повторяя эту операцию для второго пользователя сталкиваемся с проблемой взрывного роста:

source: Under I</home/henry>, we have not only recursively added the I</mntX> and I</mntY> mounts, but also the recursive mounts of those directories under I</home/cecilia> that were created in the previous step. Upon repeating the step for a third user, it becomes obvious that the explosion is exponential in nature:
ru: В I</home/henry> рекурсивно добавились не только точки монтирования I</mntX> и I</mntY>, но и рекурсивные точки монтирования этих каталогов, смонтированных в I</home/cecilia>, который мы создали на предыдущем шаге. Далее повторяя процесс для третьего пользователя, станет очевидно, что взрывной рост происходит экспоненциально:

source: The mount explosion problem in the above scenario can be avoided by making each of the new mounts unbindable. The effect of doing this is that recursive mounts of the root directory will not replicate the unbindable mounts. We make such a mount for the first user:
ru: Проблемы взрывного роста монтирования в показанном сценарии можно избежать, если делать каждое новое монтирование непривязываемым. В этом случае рекурсивное монтирование корневого каталоге не копирует непривязываемые точки монтирования. Сделаем такое монтирование для первого пользователя:

source: Before going further, we show that unbindable mounts are indeed unbindable:
ru: Перед тем как продолжить, посмотрим, что непривязываемые точки монтирования действительно нельзя привязать:

source: In some cases useful info is found in syslog - try dmesg | tail or so.
ru: В некоторых случаях полезная информация может быть найдена в syslog - попробуйте dmesg | tail или что-то в этом роде.

source: Now we create unbindable recursive bind mounts for the other two users:
ru: Теперь создадим непривязываемое рекурсивное монтирования для остальных пользователей:

source: Upon examining the list of mount points, we see there has been no explosion of mount points, because the unbindable mounts were not replicated under each user's directory:
ru: Если посмотреть список точек монтирования, то можно увидеть, что взрывного роста не произошло, так как непривязываемые точки монтирования не скопировались в каждый пользовательский каталог:

source: Propagation type transitions
ru: Переходы типов распространения

source: The following table shows the effect that applying a new propagation type (i.e., I<mount --make-xxxx>) has on the existing propagation type of a mount point. The rows correspond to existing propagation types, and the columns are the new propagation settings. For reasons of space, "private" is abbreviated as "priv" and "unbindable" as "unbind".
ru: В следующей таблице показано как влияет применение нового типа распространения (т. е., I<mount --make-xxxx>) на текущий тип распространения точки монтирования. Строки соответствуют существующим типам распространения, а столбцы — заданию нового типа распространения. Из-за нехватки места «индивидуальная» тип сокращён до «инд», а «непривязываемая» до «неприв».

source: make-shared
ru: сделать-общим

source: make-slave
ru: сделать-подчинён

source: make-priv
ru: сделать-инд

source: make-unbind
ru: сделать-неприв

source: shared
ru: общий

source: slave/priv [1]
ru: общий/инд [1]

source: priv
ru: инд

source: unbind
ru: неприв

source: slave
ru: подчинён

source: slave+shared
ru: подчинён+общий

source: slave [2]
ru: подчинён [2]

source: private
ru: инд

source: priv [2]
ru: инд [2]

source: unbindable
ru: неприв

source: unbind [2]
ru: неприв [2]

source: Note the following details to the table:
ru: Замечания к таблице:

source: If a shared mount is the only mount in its peer group, making it a slave automatically makes it private.
ru: Если общая точка монтирования смонтирована только в её равноправной группе, то изменение её типа на подчинённый автоматически делает её индивидуальной.

source: Slaving a nonshared mount has no effect on the mount.
ru: Подчинение не общей точки монтирования не влияет на монтирование.

source: Bind (MS_BIND) semantics
ru: Семантика привязывания (MS_BIND)

source: Suppose that the following command is performed:
ru: Предположим, что выполняется следующая команда:

source: Here, I<A> is the source mount point, I<B> is the destination mount point, I<a> is a subdirectory path under the mount point I<A>, and I<b> is a subdirectory path under the mount point I<B>. The propagation type of the resulting mount, I<B/b>, depends on the propagation types of the mount points I<A> and I<B>, and is summarized in the following table.
ru: Здесь I<A> — исходная точка монтирования, I<B> — целевая точка монтирования, I<a> — подкаталог в точке монтирования I<A> и I<b> — подкаталог в точке монтирования I<B>. Тип распространения получаемой точки, I<B/b>, зависит от типов распространения точек монтирования I<A> и I<B>, и рассчитывается по следующей таблице:

source: source(A)
ru: исход(A)

source: dest(B)
ru: цель(B)

source: shared |
ru: общий |

source: invalid
ru: некорректно

source: nonshared |
ru: не_общий |

source: Note that a recursive bind of a subtree follows the same semantics as for a bind operation on each mount in the subtree. (Unbindable mounts are automatically pruned at the target mount point.)
ru: Заметим, что рекурсивное привязывание поддерева имеет такую же семантику как в операции привязывания каждой точки монтирования в поддереве (непривязываемые точки монтирования автоматически убираются из целевой точки монтирования).

source: For further details, see I<Documentation/filesystems/sharedsubtree.txt> in the kernel source tree.
ru: Дополнительную информацию смотрите в файле I<Documentation/filesystems/sharedsubtree.txt> дерева исходного кода ядра.

source: Move (MS_MOVE) semantics
ru: Семантика перемещения (MS_MOVE)

source: Here, I<A> is the source mount point, I<B> is the destination mount point, and I<b> is a subdirectory path under the mount point I<B>. The propagation type of the resulting mount, I<B/b>, depends on the propagation types of the mount points I<A> and I<B>, and is summarized in the following table.
ru: Здесь I<A> — исходная точка монтирования, I<B> — целевая точка монтирования и I<b> — подкаталог в точке монтирования I<B>. Тип распространения получаемой точки, I<B/b>, зависит от типов распространения точек монтирования I<A> и I<B>, и рассчитывается по следующей таблице:

source: Note: moving a mount that resides under a shared mount is invalid.
ru: Замечание: перемещение точки монтирования, располагающейся ниже общей точки, некорректно.

source: Mount semantics
ru: Семантики монтирования

source: Suppose that we use the following command to create a mount point:
ru: Предположим, что для создания точки монтирования используется следующая команда:

source: Here, I<B> is the destination mount point, and I<b> is a subdirectory path under the mount point I<B>. The propagation type of the resulting mount, I<B/b>, follows the same rules as for a bind mount, where the propagation type of the source mount is considered always to be private.
ru: Здесь I<B> — целевая точка монтирования и I<b> — подкаталог в точке монтирования I<B>. Тип распространения получаемой точки, I<B/b>, получается таким же как при привязывании, где тип распространения исходной точки монтирования всегда равен индивидуальному.

source: Unmount semantics
ru: Семантики размонтирования

source: Suppose that we use the following command to tear down a mount point:
ru: Предположим, что для размонтирования точки используется следующая команда:

source: Here, I<A> is a mount point on I<B/b>, where I<B> is the parent mount and I<b> is a subdirectory path under the mount point I<B>. If B<B> is shared, then all most-recently-mounted mounts at I<b> on mounts that receive propagation from mount I<B> and do not have submounts under them are unmounted.
ru: Здесь I<A> точка монтирования на I<B/b>, где I<B> — родительская точка монтирования и I<b> — подкаталог в точке монтирования I<B>. Если B<B> имеет общий тип распространения, то все последние монтирования в I<b>, получающие события от точки монтирования I<B> и не имеющие подмонтирований внутри, будут размонтированы.

source: The /proc/[pid]/mountinfo propagate_from tag
ru: Метка /proc/[pid]/mountinfo propagate_from

source: The I<propagate_from:X> tag is shown in the optional fields of a I</proc/[pid]/mountinfo> record in cases where a process can't see a slave's immediate master (i.e., the pathname of the master is not reachable from the filesystem root directory) and so cannot determine the chain of propagation between the mounts it can see.
ru: Метка I<propagate_from:X> появляется в необязательных полях записи I</proc/[pid]/mountinfo> в случаях, когда процесс не может видеть непосредственного мастера (т. е., путь к мастеру недоступен из корневого каталога файловой системы) и поэтому не может определить цепочку распространения между точками монтирования, которые он может видеть.

source: In the following example, we first create a two-link master-slave chain between the mounts I</mnt>, I</tmp/etc>, and I</mnt/tmp/etc>. Then the B<chroot>(1) command is used to make the I</tmp/etc> mount point unreachable from the root directory, creating a situation where the master of I</mnt/tmp/etc> is not reachable from the (new) root directory of the process.
ru: В следующем примере сначала создаётся двусвязная цепочка мастер-подчинённый между точками монтирования I</mnt>, I</tmp/etc> и I</mnt/tmp/etc>. Затем используется команда B<chroot>(1), чтобы сделать точку монтирования I</tmp/etc> недоступной из корневого каталога, что создаёт ситуацию, где мастер для I</mnt/tmp/etc> недоступен из (нового) корневого каталога процесса.

source: First, we bind mount the root directory onto I</mnt> and then bind mount I</proc> at I</mnt/proc> so that after the later B<chroot>(1) the B<proc>(5) filesystem remains visible at the correct location in the chroot-ed environment.
ru: Сначала привяжем корневой каталог в I</mnt>, а затем привяжем I</proc> в I</mnt/proc>, чтобы после этого в правильном месте chroot-окружения для B<chroot>(1) осталась доступной файловая система B<proc>(5).

source: Next, we ensure that the I</mnt> mount is a shared mount in a new peer group (with no peers):
ru: Теперь убедимся, что точка монтирования I</mnt> является общей в новой равноправной группе (без членов):

source: # B<mount --make-private /mnt> # Isolate from any previous peer group # B<mount --make-shared /mnt> # B<cat /proc/self/mountinfo | grep \(aq/mnt\(aq | sed \(aqs/ - .*//\(aq> 239 61 8:2 / /mnt ... shared:102 248 239 0:4 / /mnt/proc ... shared:5
ru: # B<mount --make-private /mnt> # Изолировать от любой предыдущей группы # B<mount --make-shared /mnt> # B<cat /proc/self/mountinfo | grep \(aq/mnt\(aq | sed \(aqs/ - .*//\(aq> 239 61 8:2 / /mnt ... shared:102 248 239 0:4 / /mnt/proc ... shared:5

source: Next, we bind mount I</mnt/etc> onto I</tmp/etc>:
ru: Теперь привяжем I</mnt/etc> к I</tmp/etc>:

source: Initially, these two mount points are in the same peer group, but we then make the I</tmp/etc> a slave of I</mnt/etc>, and then make I</tmp/etc> shared as well, so that it can propagate events to the next slave in the chain:
ru: Первоначально, эти две точки монтирования были в одной равноправной группе, но мы сделали I</tmp/etc> подчинённой I</mnt/etc>, а затем сделали I</tmp/etc> общей, так чтобы она могла распространять события следующему подчинённому в цепочке:

source: Then we bind mount I</tmp/etc> onto I</mnt/tmp/etc>. Again, the two mount points are initially in the same peer group, but we then make I</mnt/tmp/etc> a slave of I</tmp/etc>:
ru: Затем мы привязали I</tmp/etc> в I</mnt/tmp/etc>. Опять же, две точки монтирования первоначально были в одной равноправной группе, но позднее мы сделали I</mnt/tmp/etc> подчинённой I</tmp/etc>:

source: From the above, we see that I</mnt> is the master of the slave I</tmp/etc>, which in turn is the master of the slave I</mnt/tmp/etc>.
ru: Из показанного выше можно видеть, что I</mnt> является главной для подчинённой I</tmp/etc>, которая, в свою очередь, является главной для подчинённой I</mnt/tmp/etc>.

source: We then B<chroot>(1) to the I</mnt> directory, which renders the mount with ID 267 unreachable from the (new) root directory:
ru: Теперь выполним B<chroot>(1) в каталог I</mnt>, который делает точку монтирования с ID 267 недоступной из (нового корневого каталога:

source: When we examine the state of the mounts inside the chroot-ed environment, we see the following:
ru: Если мы проверим состояние точек монтирования внутри окружения chroot, то увидим следующее:

source: Above, we see that the mount with ID 273 is a slave whose master is the peer group 105. The mount point for that master is unreachable, and so a I<propagate_from> tag is displayed, indicating that the closest dominant peer group (i.e., the nearest reachable mount in the slave chain) is the peer group with the ID 102 (corresponding to the I</mnt> mount point before the B<chroot>(1) was performed.
ru: Здесь мы видим, что точка монтирования с ID 273 является подчинённой для главной, которая входит в равноправную группу 105. Точка монтирования этой главной недоступна и поэтому появилась метка I<propagate_from>, показывающая, что идентификатор ближайшей ведущей равноправной группы (т. е., ближайшая достижимая точка монтирования в подчинённой цепи) равен 102 (соответствует точке монтирования I</mnt> до выполнения B<chroot>(1)).

source: VERSIONS
ru: ВЕРСИИ

source: Mount namespaces first appeared in Linux 2.4.19.
ru: Пространство имён монтирования впервые появилось в Linux 2.4.19.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: Namespaces are a Linux-specific feature.
ru: Пространства имён есть только в Linux.

source: Notwithstanding the fact that the default propagation type for new mount points is in many cases B<MS_PRIVATE>, B<MS_SHARED> is typically more useful. For this reason, B<systemd>(1) automatically remounts all mount points as B<MS_SHARED> on system startup. Thus, on most modern systems, the default propagation type is in practice B<MS_SHARED>.
ru: Несмотря на то, что тип распространения по умолчанию для новой точки монтирования во многих случаях равен B<MS_PRIVATE>, обычно, тип B<MS_SHARED> полезнее. По этой причине, при запуске системы B<systemd>(1) автоматически перемонтирует все точки монтирования как B<MS_SHARED>. Таким образом, в современных системах типом распространения по умолчанию практически является B<MS_SHARED>.

source: Since, when one uses B<unshare>(1) to create a mount namespace, the goal is commonly to provide full isolation of the mount points in the new namespace, B<unshare>(1) (since I<util-linux> version 2.27) in turn reverses the step performed by B<systemd>(1), by making all mount points private in the new namespace. That is, B<unshare>(1) performs the equivalent of the following in the new mount namespace:
ru: При создании пространства имён монтирования с помощью B<unshare>(1) чаще всего требуется создать полную изоляцию точек монтирования в новом пространстве имён, и B<unshare>(1) (начиная с I<util-linux> версии 2.27) отменяет изменения B<systemd>(1), делая все точки монтирования индивидуальными в новом пространстве имён. То есть B<unshare>(1) в новом пространстве имён монтирования выполняет эквивалент следующего:

source: To prevent this, one can use the I<--propagation\ unchanged> option to B<unshare>(1).
ru: Чтобы этого не происходило в B<unshare>(1) можно использовать параметр I<--propagation\ unchanged>.

source: For a discussion of propagation types when moving mounts (B<MS_MOVE>) and creating bind mounts (B<MS_BIND>), see I<Documentation/filesystems/sharedsubtree.txt>.
ru: Описание типов распространения при перемещении точек монтирования (B<MS_MOVE>) и создании привязок монтирования (B<MS_BIND>) смотрите в I<Documentation/filesystems/sharedsubtree.txt>.

source: I<Documentation/filesystems/sharedsubtree.txt> in the kernel source tree.
ru: Файл I<Documentation/filesystems/sharedsubtree.txt> в дереве исходного кода ядра Linux.

source: man-pages - conventions for writing Linux man pages
ru: man-pages — правила написания справочных страниц Linux

source: B<man> [I<section>] I<title>
ru: B<man> [I<раздел>] I<имя>

source: This page describes the conventions that should be employed when writing man pages for the Linux I<man-pages> project, which documents the user-space API provided by the Linux kernel and the GNU C library. The project thus provides most of the pages in Section 2, many of the pages that appear in Sections 3, 4, and 7, and a few of the pages that appear in Sections 1, 5, and 8 of the man pages on a Linux system. The conventions described on this page may also be useful for authors writing man pages for other projects.
ru: На этой странице описаны правила, которые необходимо применять при написании справочных страниц для проекта I<man-pages> Linux, который, в свою очередь, документирует программный интерфейс пространства пользователя, предоставляемый ядром Linux и библиотекой GNU C. Таким образом, проект отвечает за большинство страниц из Раздела 2, за многие страницы из Разделов 3, 4, и 7, и за несколько страниц из Разделов 1, 5 и 8 справочной системы Linux. Данные правила также могут быть полезны при написании справочных страниц для других проектов.

source: Sections of the manual pages
ru: Разделы справочных страниц

source: The manual Sections are traditionally defined as follows:
ru: Традиционно они следующие:

source: B<1 User commands (Programs)>
ru: B<1 Команды пользователя (Программы)>

source: Those commands that can be executed by the user from within a shell.
ru: Команды, которые пользователь запустить из оболочки.

source: B<2 System calls>
ru: B<2 Системные вызовы>

source: Those functions which wrap operations performed by the kernel.
ru: Функции, являющиеся оберткой операций, выполняемых ядром.

source: B<3 Library calls>
ru: B<3 Библиотечные вызовы>

source: All library functions excluding the system call wrappers (Most of the I<libc> functions).
ru: Все библиотечные функции (в основном функции I<libc>), за исключением представленных в Разделе 2.

source: B<4 Special files (devices)>
ru: B<4 Специальные файлы (устройства)>

source: Files found in I</dev> which allow to access to devices through the kernel.
ru: Файлы из I</dev>, дающие доступ к устройствам через ядро.

source: B<5 File formats and configuration files>
ru: B<5 Форматы файлов и конфигурационные фалы>

source: Describes various human-readable file formats and configuration files.
ru: Описывает различные подходящие для чтения форматы файлов и конфигурационные файлы.

source: B<6 Games>
ru: B<6 Игры>

source: Games and funny little programs available on the system.
ru: Игры и забавные небольшие программы

source: B<7 Overview, conventions, and miscellaneous>
ru: B<7 Обзоры, соглашения и разное>

source: Overviews or descriptions of various topics, conventions and protocols, character set standards, the standard filesystem layout, and miscellaneous other things.
ru: Описания или обзоры, касающиеся различных тем, соглашений и протоколов, а также наборов символов, стандартный шаблон файловой системы, разное.

source: B<8 System management commands>
ru: B<8 Команды для системного администрирования>

source: Commands like B<mount>(8), many of which only root can execute.
ru: Команды подобные B<mount>(8), большинство из которых могут запускаться только суперпользователем.

source: Macro package
ru: Пакет макросов

source: New manual pages should be marked up using the B<groff an.tmac> package described in B<man>(7). This choice is mainly for consistency: the vast majority of existing Linux manual pages are marked up using these macros.
ru: Новые справочные страницы должны размечаться с помощью пакета B<groff an.tmac>, описанного в B<man>(7). Данный выбор основан, в основном, на том, что большинство из существующих страниц Linux размечены с помощью этих макросов.

source: Conventions for source file layout
ru: Правила, касающиеся формата исходных файлов

source: Please limit source code line length to no more than about 75 characters wherever possible. This helps avoid line-wrapping in some mail clients when patches are submitted inline.
ru: Длина строки не должна превышать 75 символов. В некоторых почтовых клиентах это помогает избежать переноса строк в заплатах, встроенные в письмо.

source: New sentences should be started on new lines. This makes it easier to see the effect of patches, which often operate at the level of individual sentences.
ru: Новые операторы — с новой строки. Это облегчает возможность просмотра изменений после применения заплат, которые зачастую изменяют отдельные строки кода.

source: Title line
ru: Заголовок

source: The first command in a man page should be a B<TH> command:
ru: Первой должна быть команда B<TH>:

source: B<\&.TH> I<title section date source manual>
ru: B<\&.TH> I<заголовок раздел дата источник справочник>

source: where:
ru: где:

source: I<title>
ru: I<заголовок>

source: The title of the man page, written in all caps (e.g., I<MAN-PAGES>).
ru: Название страницы, написанное заглавными буквами (например I<MAN-PAGES>).

source: I<section>
ru: I<раздел>

source: The section number in which the man page should be placed (e.g., I<7>).
ru: Номер раздела для размещения страницы (например I<7>).

source: I<date>
ru: I<дата>

source: The date of the last nontrivial change that was made to the man page. (Within the I<man-pages> project, the necessary updates to these timestamps are handled automatically by scripts, so there is no need to manually update them as part of a patch.) Dates should be written in the form YYYY-MM-DD.
ru: Дата последнего значительного изменения справочной страницы (в проекте I<man-pages> необходимые обновления временных отметок выполняются автоматически при помощи сценариев, вручную устанавливать её заплатой не нужно). Дата должна иметь вид YYYY-MM-DD, т. е. год-месяц-день.

source: I<source>
ru: I<источник>

source: The source of the command, function, or system call.
ru: Источник команды, функции, системного вызова.
