Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: On success, B<mq_open>() returns a message queue descriptor for use by other message queue functions. On error, B<mq_open>() returns I<(mqd_t)\ -1>, with I<errno> set to indicate the error.
ru: При успешном выполнении B<mq_open>() возвращает файловый дескриптор очереди для использования в других функциях работы с очередями сообщений. При ошибке B<mq_open>() возвращает I<(mqd_t)\ -1>, а в I<errno> записывается код ошибки.

source: The queue exists, but the caller does not have permission to open it in the specified mode.
ru: Очередь существует, но вызывающий не имеет прав для её открытия с заданным в I<mode> режиме.

source: I<name> contained more than one slash.
ru: Поле I<name> содержит больше чем одну косую черту.

source: Both B<O_CREAT> and B<O_EXCL> were specified in I<oflag>, but a queue with this I<name> already exists.
ru: В I<oflag> указаны B<O_CREAT> и B<O_EXCL>, но очередь I<name> уже существует.

source: I<name> doesn't follow the format in B<mq_overview>(7).
ru: Параметр I<name> не соответствует формату, описанному в B<mq_overview>(7).

source: B<O_CREAT> was specified in I<oflag>, and I<attr> was not NULL, but I<attr-E<gt>mq_maxmsg> or I<attr-E<gt>mq_msqsize> was invalid. Both of these fields must be greater than zero. In a process that is unprivileged (does not have the B<CAP_SYS_RESOURCE> capability), I<attr-E<gt>mq_maxmsg> must be less than or equal to the I<msg_max> limit, and I<attr-E<gt>mq_msgsize> must be less than or equal to the I<msgsize_max> limit. In addition, even in a privileged process, I<attr-E<gt>mq_maxmsg> cannot exceed the B<HARD_MAX> limit. (See B<mq_overview>(7) for details of these limits.)
ru: В I<oflag> указан B<O_CREAT> и I<attr> не равно NULL, но в I<attr-E<gt>mq_maxmsg> или I<attr-E<gt>mq_msqsize> содержится некорректное значение. Оба этих поля должны быть больше нуля. Если процесс без прав (не имеет мандата B<CAP_SYS_RESOURCE>), то I<attr-E<gt>mq_maxmsg> должно быть меньше или равно ограничению I<msg_max> и I<attr-E<gt>mq_msgsize> должно быть меньше или равно ограничению I<msgsize_max>. Также, даже для привилегированных процессов, значение I<attr-E<gt>mq_maxmsg> не должно превышать ограничения B<HARD_MAX> (описание ограничений смотрите в B<mq_overview>(7)).

source: The per-process limit on the number of open file and message queue descriptors has been reached (see the description of B<RLIMIT_NOFILE> in B<getrlimit>(2)).
ru: Было достигнуто ограничение на количество открытых дескрипторов файлов и очередей сообщений (смотрите описание B<RLIMIT_NOFILE> в B<getrlimit>(2)).

source: I<name> was too long.
ru: Слишком длинное значение аргумента I<name>.

source: The system-wide limit on the total number of open files and message queues has been reached.
ru: Достигнуто ограничение на общее количество открытых файлов в системе и очередей сообщений.

source: The B<O_CREAT> flag was not specified in I<oflag>, and no queue with this I<name> exists.
ru: В I<oflag> не указан B<O_CREAT> и не существует очередь I<name>.

source: I<name> was just "/" followed by no other characters.
ru: В I<name> есть только «/» и нет других символов.

source: Insufficient space for the creation of a new message queue. This probably occurred because the I<queues_max> limit was encountered; see B<mq_overview>(7).
ru: Недостаточно места для создания новой очереди сообщений. Вероятно, это произошло из-за ограничения I<queues_max>; смотрите B<mq_overview>(7).

source: The B<mq_open>() library function is implemented on top of a system call of the same name. The library function performs the check that the I<name> starts with a slash (/), giving the B<EINVAL> error if it does not. The kernel system call expects I<name> to contain no preceding slash, so the C library function passes I<name> without the preceding slash (i.e., I<name+1>) to the system call.
ru: Библиотечная функция B<mq_open>() реализована поверх системного вызова с тем же именем. Библиотечная функция выполняет проверку того, что I<name> начинается с косой черты (/) и выдаёт ошибку B<EINVAL>, если это не так. Системный вызов ядра ожидает I<name> без начальной косой черты, поэтому библиотечная функция C передаёт в системный вызов I<name> без начальной косой черты (т. е., I<name+1>).

source: In kernels before 2.6.14, the process umask was not applied to the permissions specified in I<mode>.
ru: В ядрах до версии 2.6.14, значение umask процесса не накладывалось на права, указанные в I<mode>.

source: modf, modff, modfl - extract signed integral and fractional values from floating-point number
ru: modf, modff, modfl - извлекает целое и дробное значение со знаком из числа с плавающей запятой

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions break the argument I<x> into an integral part and a fractional part, each of which has the same sign as I<x>. The integral part is stored in the location pointed to by I<iptr>.
ru: Эти функции разбивают аргумент I<x> на целую и дробную части, каждая из которых имеет такой же знак, как и I<x>. Целая часть сохраняется месте, на которое указывает I<iptr>.

source: These functions return the fractional part of I<x>.
ru: Данные функции возвращают дробную часть от I<x>.

source: If I<x> is a NaN, a NaN is returned, and I<*iptr> is set to a NaN.
ru: Если I<x> имеет значение NaN, будет возвращено NaN и I<*iptr> установится в NaN.

source: If I<x> is positive infinity (negative infinity), +0 (-0) is returned, and I<*iptr> is set to positive infinity (negative infinity).
ru: Если I<x> стремится к плюс или минус бесконечности, будет возвращено значение +0 (-0) и I<*iptr> установится в плюс или минус бесконечность.

source: No errors occur.
ru: Ошибки не возникают.

source: The variant returning I<double> also conforms to SVr4, 4.3BSD, C89.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD, C89.

source: mbrlen - determine number of bytes in next multibyte character
ru: mbrlen - вычисляет количество байт в следующем многобайтовом символе

source: The B<mbrlen>() function inspects at most I<n> bytes of the multibyte string starting at I<s> and extracts the next complete multibyte character. It updates the shift state I<*ps>. If the multibyte character is not the null wide character, it returns the number of bytes that were consumed from I<s>. If the multibyte character is the null wide character, it resets the shift state I<*ps> to the initial state and returns 0.
ru: Функция B<mbrlen>() просматривает не более I<n> байт в многобайтовой строке, начинающейся с I<s> и извлекает следующий полный многобайтовый символ. Она изменяет состояние сдвига I<*ps>. Если многобайтовый символ не является широким символом null, то возвращается количество байт, которые использовались из I<s>. Если многобайтовый символ является широким символом null, состояние сдвига I<*ps> сбрасывается в начальное и возвращается 0.

source: If the I<n> bytes starting at I<s> do not contain a complete multibyte character, B<mbrlen>() returns I<(size_t)\ -2>. This can happen even if I<n> E<gt>= I<MB_CUR_MAX>, if the multibyte string contains redundant shift sequences.
ru: Если в I<n> байтах, начиная с I<s>, не содержится полного многобайтового символа, то B<mbrlen>() возвращает I<(size_t)\ -2>. Это может произойти даже, если I<n> E<gt>= I<MB_CUR_MAX>, если в многобайтовой строке содержится лишние сдвиговые последовательности.

source: If the multibyte string starting at I<s> contains an invalid multibyte sequence before the next complete character, B<mbrlen>() returns I<(size_t)\ -1> and sets I<errno> to B<EILSEQ>. In this case, the effects on I<*ps> are undefined.
ru: Если многобайтовая строка, начинающаяся с I<s>, содержит некорректную многобайтовую последовательность до следующего полного символа, то B<mbrlen>() возвращает I<(size_t)\ -1> и присваивает I<errno> значение B<EILSEQ>. В этом случае влияние на I<*ps> не определено.

source: If I<ps> is NULL, a static anonymous state known only to the B<mbrlen>() function is used instead.
ru: Если I<ps> равно NULL, то используется статическое анонимное состояние, известное только функции B<mbrlen>().

source: The B<mbrlen>() function returns the number of bytes parsed from the multibyte sequence starting at I<s>, if a non-null wide character was recognized. It returns 0, if a null wide character was recognized. It returns I<(size_t)\ -1> and sets I<errno> to B<EILSEQ>, if an invalid multibyte sequence was encountered. It returns I<(size_t)\ -2> if it couldn't parse a complete multibyte character, meaning that I<n> should be increased.
ru: Функция B<mbrlen>() возвращает количество байт, просмотренных в многобайтовой последовательности, начинающейся с I<s>, если при этом был получен широкий символ не равный null. Она возвращает 0, если был получен широкий символ null. Она возвращает I<(size_t)\ -1> и присваивает I<errno> значение B<EILSEQ>, если встречена некорректная многобайтовая последовательность. Она возвращает I<(size_t)\ -2>, если не удалось найти полную многобайтовую последовательность, что означает, что I<n> должно быть увеличено.

source: The behavior of B<mbrlen>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mbrlen>() зависит от категории B<LC_CTYPE> текущей локали.

source: memcpy - copy memory area
ru: memcpy - копирует участок памяти

source: The B<memcpy>() function copies I<n> bytes from memory area I<src> to memory area I<dest>. The memory areas must not overlap. Use B<memmove>(3) if the memory areas do overlap.
ru: Функция B<memcpy>() копирует I<n> байт из участка памяти I<src> в участок памяти I<dest>. Адреса участков памяти не должны перекрываться друг другом. Если это неизбежно, используйте B<memmove>(3).

source: The B<memcpy>() function returns a pointer to I<dest>.
ru: Функция B<memcpy>() возвращает указатель на I<dest>.

source: Failure to observe the requirement that the memory areas do not overlap has been the source of significant bugs. (POSIX and the C standards are explicit that employing B<memcpy>() with overlapping areas produces undefined behavior.) Most notably, in glibc 2.13 a performance optimization of B<memcpy>() on some platforms (including x86-64) included changing the order in which bytes were copied from I<src> to I<dest>.
ru: Несоблюдение требования не перекрытия областей памяти является источником серьёзных ошибок (в стандартах POSIX и C явно указано, что выполнение B<memcpy>() над перекрывающимися областями приводит к непредсказуемому поведению). Что особенно важно, в glibc 2.13 для оптимизации производительности B<memcpy>() на некоторых платформах (включая x86-64) изменён порядок копирования байт из I<src> в I<dest>.

source: This change revealed breakages in a number of applications that performed copying with overlapping areas. Under the previous implementation, the order in which the bytes were copied had fortuitously hidden the bug, which was revealed when the copying order was reversed. In glibc 2.14, a versioned symbol was added so that old binaries (i.e., those linked against glibc versions earlier than 2.14) employed a B<memcpy>() implementation that safely handles the overlapping buffers case (by providing an "older" B<memcpy>() implementation that was aliased to B<memmove>(3)).
ru: Это изменение привело к поломкам многих приложений, которые выполняли копирование перекрывающихся областей. В предыдущей реализации порядок, в котором копировались байты, случайно скрывал ошибку, который выявилась при изменении порядка копирования. В glibc 2.14 был добавлен символ версии для того, чтобы старые двоичные файлы (т.е., скомпонованные с версиями glibc до 2.14) вызывали реализацию B<memcpy>(), которая безопасно обрабатывает случай перекрывающихся буферов (предоставляя «старую» реализацию B<memcpy>(), которая была просто ещё одним именем B<memmove>(3)).

source: memchr, memrchr, rawmemchr - scan memory for a character
ru: memchr, memrchr, rawmemchr - выполняют поиск символа в памяти

source: The B<memchr>() function scans the initial I<n> bytes of the memory area pointed to by I<s> for the first instance of I<c>. Both I<c> and the bytes of the memory area pointed to by I<s> are interpreted as I<unsigned char>.
ru: Функция B<memchr>() сканирует первые I<n> байт участка памяти, указанного в I<s>, в поисках экземпляра I<c>. Считается, что байты в памяти, указанной I<s>, и значение I<c> имеют тип I<unsigned char>.

source: The B<memrchr>() function is like the B<memchr>() function, except that it searches backward from the end of the I<n> bytes pointed to by I<s> instead of forward from the beginning.
ru: Функция B<memrchr>() похожа на B<memchr>(), за исключением того, что она ищет в участке I<n> байт, указанных в I<s>, не сначала, а с конца.

source: The B<rawmemchr>() function is similar to B<memchr>(): it assumes (i.e., the programmer knows for certain) that an instance of I<c> lies somewhere in the memory area starting at the location pointed to by I<s>, and so performs an optimized search for I<c> (i.e., no use of a count argument to limit the range of the search). If an instance of I<c> is not found, the results are unpredictable. The following call is a fast means of locating a string's terminating null byte:
ru: Функция B<rawmemchr>() похожа на B<memchr>(): она подразумевает (то есть программист в этом уверен), что экземпляр I<c> точно находится где-то в памяти начало которой указано I<s>, и при это производит оптимизированный поиск символа I<c> (то есть, не используется счётчик для ограничения диапазона поиска). Если экземпляр I<c> не найден, то результат непредсказуем. Следующий вызов является примером быстрого поиска завершающего строку байта null:

source: The B<memchr>() and B<memrchr>() functions return a pointer to the matching byte or NULL if the character does not occur in the given memory area.
ru: Функции B<memchr>() и B<memrchr>() возвращают указатель на совпавший байт, либо NULL, если в указанном участке памяти искомого байта нет.

source: The B<rawmemchr>() function returns a pointer to the matching byte, if one is found. If no matching byte is found, the result is unspecified.
ru: Функция B<rawmemchr>() возвращает указатель на совпавший байт (если он был обнаружен). Если совпадений не найдено, результат не определён.

source: B<rawmemchr>() first appeared in glibc in version 2.1.
ru: Функция B<rawmemchr>() впервые появилась в glibc 2.1.

source: B<memrchr>() first appeared in glibc in version 2.2.
ru: Функция B<memrchr>() впервые появилась в glibc 2.2.

source: The B<memrchr>() function is a GNU extension, available since glibc 2.1.91.
ru: Функция B<memrchr>() является расширением GNU, доступным в glibc начиная с версии 2.1.91.

source: The B<rawmemchr>() function is a GNU extension, available since glibc 2.1.
ru: Функция B<rawmemchr>() является расширением GNU, доступным в glibc начиная с версии 2.1.

source: mbsnrtowcs - convert a multibyte string to a wide-character string
ru: mbsnrtowcs - преобразует многобайтовую строку в строку широких символов

source: The B<mbsnrtowcs>() function is like the B<mbsrtowcs>(3) function, except that the number of bytes to be converted, starting at I<*src>, is limited to at most I<nms> bytes.
ru: Функция B<mbsnrtowcs>() похожа на функцию B<mbsrtowcs>(3), исключая то, что количество преобразуемых байт, начиная с I<*src>, ограничено I<nms> байтами.

source: If I<dest> is not NULL, the B<mbsnrtowcs>() function converts at most I<nms> bytes from the multibyte string I<*src> to a wide-character string starting at I<dest>. At most I<len> wide characters are written to I<dest>. The shift state I<*ps> is updated. The conversion is effectively performed by repeatedly calling I<mbrtowc(dest, *src, n, ps)> where I<n> is some positive number, as long as this call succeeds, and then incrementing I<dest> by one and I<*src> by the number of bytes consumed. The conversion can stop for three reasons:
ru: Если I<dest> не равно NULL, то функция B<mbsnrtowcs>() преобразует не более I<nms> байт многобайтовой строки I<*src> в строку широких символов, начинающуюся с I<dest>. В I<dest> будет записано не более I<len> символов. Обновляется состояние сдвига I<*ps>. Эффективное выполнение преобразования осуществляется повторяющимися вызовами I<mbrtowc(dest, *src, n, ps)>, где I<n> — некое положительное число, и пока вызов завершается успешно, увеличивая I<dest> на единицу и I<*src> на количество использованных байт. Преобразование может остановиться по трём причинам:

source: The I<nms> limit forces a stop, or I<len> non-L\(aq\e0\(aq wide characters have been stored at I<dest>. In this case, I<*src> is left pointing to the next multibyte sequence to be converted, and the number of wide characters written to I<dest> is returned.
ru: Остановка происходит, если достигнуто ограничение I<nms> или в I<dest> было сохранено I<len> не равных L\(aq\e0\(aq широких символов. В этом случае I<*src> продолжит указывать на следующую непреобразованную многобайтовую последовательность и будет возвращено количество широких символов, записанных в I<dest>.

source: The multibyte string has been completely converted, including the terminating null wide character (\(aq\e0\(aq) (which has the side effect of bringing back I<*ps> to the initial state). In this case, I<*src> is set to NULL, and the number of wide characters written to I<dest>, excluding the terminating null wide character, is returned.
ru: Многобайтовая строка была полностью преобразована, включая завершающий широкий символ null (\(aq\e0\(aq) (побочный эффект: I<*ps> возвращается в начальное состояние). В этом случае I<*src> устанавливается равным NULL и возвращается количество широких символов, записанных в I<dest>, не считая завершающего широкого символа null.

source: According to POSIX.1, if the input buffer ends with an incomplete character, it is unspecified whether conversion stops at the end of the previous character (if any), or at the end of the input buffer. The glibc implementation adopts the former behavior.
ru: Если входной буфер заканчивается неполным символом, в POSIX.1 не указано где остановится преобразование — в конце предыдущего символа (если есть) или в конце входного буфера. В реализации glibc принят первый вариант.

source: If I<dest> is NULL, I<len> is ignored, and the conversion proceeds as above, except that the converted wide characters are not written out to memory, and that no destination length limit exists.
ru: Если значение I<dest> равно NULL, то I<len> игнорируется и преобразование выполняется как описано выше, исключая то, что преобразованные широкие символы не записываются в память и нет ограничения на длину строки назначения.

source: In both of the above cases, if I<ps> is NULL, a static anonymous state known only to the B<mbsnrtowcs>() function is used instead.
ru: В обоих перечисленных случаях, если I<ps> равно NULL, то используется статическое анонимное состояние, известное только функции B<mbsnrtowcs>().

source: The B<mbsnrtowcs>() function returns the number of wide characters that make up the converted part of the wide-character string, not including the terminating null wide character. If an invalid multibyte sequence was encountered, I<(size_t)\ -1> is returned, and I<errno> set to B<EILSEQ>.
ru: Функция B<mbsnrtowcs>() возвращает количество широких символов, которые составили преобразованную часть широкосимвольной строки, не включая конечный широкий символ null. Если обнаружена некорректная многобайтовая последовательность, то возвращается I<(size_t)\ -1>, а I<errno> присваивается B<EILSEQ>.

source: The behavior of B<mbsnrtowcs>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mbsnrtowcs>() зависит от категории B<LC_CTYPE> текущей локали.

source: malloc_get_state, malloc_set_state - record and restore state of malloc implementation
ru: malloc_get_state, malloc_set_state - сохраняют и восстанавливают состояние в реализации malloc

source: I<Note>: these function are removed in glibc version 2.25.
ru: I<Примечание>: эта функция была удалена в glibc версии 2.25.

source: The B<malloc_get_state>() function records the current state of all B<malloc>(3) internal bookkeeping variables (but not the actual contents of the heap or the state of B<malloc_hook>(3) functions pointers). The state is recorded in a system-dependent opaque data structure dynamically allocated via B<malloc>(3), and a pointer to that data structure is returned as the function result. (It is the caller's responsibility to B<free>(3) this memory.)
ru: Функция B<malloc_get_state>() записывает текущее состояние всех внутренних служебных переменных B<malloc>(3) (но не фактическое содержимое кучи или состояние указателей функций B<malloc_hook>(3)). Состояние сохраняется в системно-зависимой структуре данных с закрытым форматом, динамически выделенной через B<malloc>(3), и указатель на эту структуру данных возвращается как результат функции (вызывающий является ответственным за вызов B<free>(3) для этой памяти).

source: The B<malloc_set_state>() function restores the state of all B<malloc>(3) internal bookkeeping variables to the values recorded in the opaque data structure pointed to by I<state>.
ru: Функция B<malloc_set_state>() восстанавливает значения состояния внутренних служебных переменных B<malloc>(3) из сохранённой структуры закрытого формата, на которую указывает I<state>.

source: On success, B<malloc_get_state>() returns a pointer to a newly allocated opaque data structure. On error (for example, memory could not be allocated for the data structure), B<malloc_get_state>() returns NULL.
ru: При успешном выполнении B<malloc_get_state>() возвращает указатель на только что выделенную структуру с закрытым форматом. При ошибке (например, если не получилось выделить память под структуру) B<malloc_get_state>() возвращает NULL.

source: On success, B<malloc_set_state>() returns 0. If the implementation detects that I<state> does not point to a correctly formed data structure, B<malloc_set_state>() returns -1. If the implementation detects that the version of the data structure referred to by I<state> is a more recent version than this implementation knows about, B<malloc_set_state>() returns -2.
ru: При успешном выполнении B<malloc_set_state>() возвращается 0. Если реализация обнаруживает, что I<state> не указывает на корректную структуру с данными, то B<malloc_set_state>() возвращает -1. Если реализация обнаруживает, что версия структуры данных, на которую ссылается I<state>, новее чем известно реализации, то B<malloc_set_state>() возвращает -2.

source: These functions are useful when using this B<malloc>(3) implementation as part of a shared library, and the heap contents are saved/restored via some other method. This technique is used by GNU Emacs to implement its "dumping" function.
ru: Эти функции полезны при использовании реализации B<malloc>(3) в виде общей библиотеки, а содержимое кучи сохраняется/восстанавливается каким-то другим способом. Это используется в GNU Emacs для реализации своей функции «выгрузки».
