Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Return a I<msginfo> structure containing the same information as for B<IPC_INFO>, except that the following fields are returned with information about system resources consumed by message queues: the I<msgpool> field returns the number of message queues that currently exist on the system; the I<msgmap> field returns the total number of messages in all queues on the system; and the I<msgtql> field returns the total number of bytes in all messages in all queues on the system.
ru: Возвращает структуру I<msginfo>, содержащую такую же информацию что и при операции B<IPC_INFO>, за исключением того, что возвращаемые значения полей содержат информацию о системных ресурсах, потребляемых очередями сообщений: в поле I<msgpool> возвращается количество очередей сообщений, которые в данный момент находятся в системе; в поле I<msgmap> возвращается общее количество сообщений во всех очередях системы; в поле I<msgtql> возвращается общее количество байт во всех сообщениях во всех очередях системы.

source: B<MSG_STAT> (Linux-specific)
ru: B<MSG_STAT> (есть только в Linux)

source: Return a I<msqid_ds> structure as for B<IPC_STAT>. However, the I<msqid> argument is not a queue identifier, but instead an index into the kernel's internal array that maintains information about all message queues on the system.
ru: Возвращает структуру I<msqid_ds> как в операции B<IPC_STAT>. Однако аргумент I<msqid> является не уникальным идентификатором, а индексом во внутреннем массиве ядра, в котором содержится информации о всех очередях сообщений в системе.

source: B<MSG_STAT_ANY> (Linux-specific, since Linux 4.17)
ru: B<MSG_STAT_ANY> (есть только в Linux, начиная с Linux 4.17)

source: Return a I<msqid_ds> structure as for B<MSG_STAT>. However, I<msg_perm.mode> is not checked for read access for I<msqid> meaning that any user can employ this operation (just as any user may read I</proc/sysvipc/msg> to obtain the same information).
ru: Возвращает структуру I<msqid_ds> как для B<MSG_STAT>. Однако I<msg_perm.mode> не проверяется на доступность чтения для I<msqid>, что означает, что эту операцию может выполнять пользователь (как и любой пользователь, который может прочитать эту же информацию из I</proc/sysvipc/msg>).

source: On success, B<IPC_STAT>, B<IPC_SET>, and B<IPC_RMID> return 0. A successful B<IPC_INFO> or B<MSG_INFO> operation returns the index of the highest used entry in the kernel's internal array recording information about all message queues. (This information can be used with repeated B<MSG_STAT> or B<MSG_STAT_ANY> operations to obtain information about all queues on the system.) A successful B<MSG_STAT> or B<MSG_STAT_ANY> operation returns the identifier of the queue whose index was given in I<msqid>.
ru: При успешном выполнении B<IPC_STAT>, B<IPC_SET> и B<IPC_RMID> возвращается 0. При успешном выполнении операции B<IPC_INFO> или B<MSG_INFO> возвращается индекс самого последнего использованного элемента во внутреннем массиве ядра, в котором записана информация о всех очередях сообщений. (Эта информация может быть использована при повторяющихся операциях B<MSG_STAT> и B<MSG_STAT_ANY> для получения информации о всех очередях системы.) При успешном выполнении операции B<MSG_STAT> или B<MSG_STAT_ANY> возвращается идентификатор очереди, чей индекс был указан в I<msqid>.

source: On error, -1 is returned with I<errno> indicating the error.
ru: В случае ошибки возвращается -1, а в I<errno> записывается значение ошибки.

source: On failure, I<errno> is set to one of the following:
ru: В случае возникновения ошибки I<errno> может принимать следующие значения:

source: The argument I<cmd> is equal to B<IPC_STAT> or B<MSG_STAT>, but the calling process does not have read permission on the message queue I<msqid>, and does not have the B<CAP_IPC_OWNER> capability in the user namespace that governs its IPC namespace.
ru: Значение аргумента I<cmd> равно B<IPC_STAT> или B<MSG_STAT>, но вызывающий процесс не имеет прав на чтение очереди сообщений I<msqid>, и не имеет мандата B<CAP_IPC_OWNER> в пространстве имён пользователя, которое управляет его пространством имён IPC.

source: The argument I<cmd> has the value B<IPC_SET> or B<IPC_STAT>, but the address pointed to by I<buf> isn't accessible.
ru: Значение аргумента I<cmd> равно B<IPC_SET> или B<IPC_STAT>, но адрес, указанный в I<buf>, недоступен.

source: The message queue was removed.
ru: Очередь сообщений была удалена.

source: Invalid value for I<cmd> or I<msqid>. Or: for a B<MSG_STAT> operation, the index value specified in I<msqid> referred to an array slot that is currently unused.
ru: Неверное значение I<cmd> или I<msqid>. Или: для операции B<MSG_STAT> значение индекса, указанного в I<msqid>, ссылается на слот массива, который в данный момент не используется.

source: The argument I<cmd> has the value B<IPC_SET> or B<IPC_RMID>, but the effective user ID of the calling process is not the creator (as found in I<msg_perm.cuid>) or the owner (as found in I<msg_perm.uid>) of the message queue, and the caller is not privileged (Linux: does not have the B<CAP_SYS_ADMIN> capability).
ru: Значение аргумента I<cmd> равно B<IPC_SET> или B<IPC_RMID>, но эффективный пользовательский идентификатор вызывающего процесса не равен идентификатору создателя (I<msg_perm.cuid>) или владельца (I<msg_perm.uid>) очереди сообщений, и вызывающий не имеет прав (Linux: не имеет мандата B<CAP_SYS_ADMIN>).

source: An attempt (B<IPC_SET>) was made to increase I<msg_qbytes> beyond the system parameter B<MSGMNB>, but the caller is not privileged (Linux: does not have the B<CAP_SYS_RESOURCE> capability).
ru: Была предпринята попытка (B<IPC_SET>) увеличить I<msg_qbytes> и нарушить границы системного параметра B<MSGMNB>, но вызывающий не имеет прав (Linux: не имеет мандата B<CAP_SYS_RESOURCE>).

source: The inclusion of I<E<lt>sys/types.hE<gt>> and I<E<lt>sys/ipc.hE<gt>> isn't required on Linux or by any version of POSIX. However, some old implementations required the inclusion of these header files, and the SVID also documented their inclusion. Applications intended to be portable to such old systems may need to include these header files.
ru: Включение файлов I<E<lt>sys/types.hE<gt>> и I<E<lt>sys/ipc.hE<gt>> не требуется в Linux или любых версий POSIX. Однако, некоторые старые реализации требуют включения данных заголовочных файлов, и это также требуется по SVID. В приложениях, которые нужно перенести на такие старые системы, может потребоваться включить данных заголовочные файлы.

source: The B<IPC_INFO>, B<MSG_STAT> and B<MSG_INFO> operations are used by the B<ipcs>(1) program to provide information on allocated resources. In the future these may modified or moved to a I</proc> filesystem interface.
ru: Операции B<IPC_INFO>, B<MSG_STAT> и B<MSG_INFO> используются программой B<ipcs>(1) для получения информации о выделенных ресурсах. В будущем для этого может быть задействован интерфейс файловой системы I</proc>.

source: Various fields in the I<struct msqid_ds> were typed as I<short> under Linux 2.2 and have become I<long> under Linux 2.4. To take advantage of this, a recompilation under glibc-2.1.91 or later should suffice. (The kernel distinguishes old and new calls by an B<IPC_64> flag in I<cmd>.)
ru: Различные поля в I<struct msqid_ds>, которые имели тип I<short> в Linux 2.2, в Linux 2.4 теперь имеют тип I<long>. Чтобы воспользоваться этим преимуществом достаточно пересобрать программу с glibc-2.1.91 или более новой версией. (Ядро различает старые и новые вызовы по флагу B<IPC_64> в I<cmd>.)

source: memfd_create - create an anonymous file
ru: memfd_create - создаёт анонимный файл

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>sys/mman.hE<gt>>

source: B<memfd_create>() creates an anonymous file and returns a file descriptor that refers to it. The file behaves like a regular file, and so can be modified, truncated, memory-mapped, and so on. However, unlike a regular file, it lives in RAM and has a volatile backing storage. Once all references to the file are dropped, it is automatically released. Anonymous memory is used for all backing pages of the file. Therefore, files created by B<memfd_create>() have the same semantics as other anonymous memory allocations such as those allocated using B<mmap>(2) with the B<MAP_ANONYMOUS> flag.
ru: Вызов B<memfd_create>() создаёт анонимный файл и возвращает ссылающийся на него файловый дескриптор. Анонимный файл ведёт себя как обычный файл и может быть изменён, обрезан, отображён в память и т.д. Однако в отличие от обычного файла он располагается в ОЗУ и не имеет энергонезависимого хранилища. Как только все ссылки на файл удаляются, он автоматически исчезает. Анонимные файлы располагаются в анонимной памяти. Поэтому у файлов, создаваемых B<memfd_create>(), такая же семантика как и областей анонимной памяти, выделяемой с помощью B<mmap>(2) с флагом B<MAP_ANONYMOUS>.

source: The initial size of the file is set to 0. Following the call, the file size should be set using B<ftruncate>(2). (Alternatively, the file may be populated by calls to B<write>(2) or similar.)
ru: Первоначально, размер файла равен 0. После этого вызова нужно задать размер файла с помощью B<ftruncate>(2) (или заполнить файл с помощью B<write>(2) или подобными).

source: The name supplied in I<name> is used as a filename and will be displayed as the target of the corresponding symbolic link in the directory I</proc/self/fd/>. The displayed name is always prefixed with I<memfd:> and serves only for debugging purposes. Names do not affect the behavior of the file descriptor, and as such multiple files can have the same name without any side effects.
ru: Имя, указанное в I<name>, используется в качестве имени файла и будет показываться как цель соответствующей символьной ссылки в каталоге. I</proc/self/fd/>. Отображаемое имя всегда начинается с I<memfd:> и служит только для отладки. Имена не влияют на поведение файлового дескриптора и поэтому несколько файлов могут иметь одно имя без каких-либо последствий.

source: The following values may be bitwise ORed in I<flags> to change the behavior of B<memfd_create>():
ru: Для изменения поведения B<memfd_create>() можно использовать следующие значения I<flags> (через OR):

source: Set the close-on-exec (B<FD_CLOEXEC>) flag on the new file descriptor. See the description of the B<O_CLOEXEC> flag in B<open>(2) for reasons why this may be useful.
ru: Устанавливает флаг close-on-exec (B<FD_CLOEXEC>) для нового открытого файлового дескриптора. Смотрите описание флага B<O_CLOEXEC> в B<open>(2) для того, чтобы узнать как это может пригодиться.

source: Allow sealing operations on this file. See the discussion of the B<F_ADD_SEALS> and B<F_GET_SEALS> operations in B<fcntl>(2), and also NOTES, below. The initial set of seals is empty. If this flag is not set, the initial set of seals will be B<F_SEAL_SEAL>, meaning that no other seals can be set on the file.
ru: Разрешает операции опечатывания (sealing) файла. Описание операций B<F_ADD_SEALS> и B<F_GET_SEALS> смотрите в B<fcntl>(2), а также в ЗАМЕЧАНИЯ ниже. Первоначально набор печатей пуст. Если этот флаг не установлен, то начальным набором печатей будет B<F_SEAL_SEAL>, означающий запрещение установки печатей на файл.

source: B<MFD_HUGETLB> (since Linux 4.14)
ru: B<MFD_HUGETLB> (начиная с Linux 4.14)

source: The anonymous file will be created in the hugetlbfs filesystem using huge pages. See the Linux kernel source file I<Documentation/admin-guide/mm/hugetlbpage.rst> for more information about hugetlbfs. Specifying both B<MFD_HUGETLB> and B<MFD_ALLOW_SEALING> in I<flags> is supported since Linux 4.16.
ru: В файловой системе hugetlbfs, использующей огромные страницы, будет создан анонимный файл. В файле исходного кода Linux I<Documentation/admin-guide/mm/hugetlbpage.rst> дана подробная информация о hugetlbfs. Одновременное указание B<MFD_HUGETLB> и B<MFD_ALLOW_SEALING> в I<flags> поддерживается начиная с Linux 4.16.

source: Used in conjunction with B<MFD_HUGETLB> to select alternative hugetlb page sizes (respectively, 2\ MB, 1\ GB, ...) on systems that support multiple hugetlb page sizes. Definitions for known huge page sizes are included in the header file I<E<lt>linux/memfd.hE<gt>.>
ru: Используется как дополнение к B<MFD_HUGETLB> для выбора размера страницы hugetlb (соответственно, 2\ МБ, 1\ ГБ, …) в системах, которые поддерживают различные размеры страниц hugetlb. Определения размеров огромных страниц включены в заголовочный файл I<E<lt>linux/memfd.hE<gt>.>

source: For details on encoding huge page sizes not included in the header file, see the discussion of the similarly named constants in B<mmap>(2).
ru: Дополнительную информацию о кодировании размеров огромных страниц, отсутствующих в заголовочном файле, смотрите в описании сходных по имени констант в B<mmap>(2).

source: Unused bits in I<flags> must be 0.
ru: Неиспользуемые биты в I<flags> должны быть равны 0.

source: As its return value, B<memfd_create>() returns a new file descriptor that can be used to refer to the file. This file descriptor is opened for both reading and writing (B<O_RDWR>) and B<O_LARGEFILE> is set for the file descriptor.
ru: В качестве возвращаемого значения B<memfd_create>() возвращает новый файловый дескриптор, который можно использовать для обращения к файлу. Данный файловый дескриптор открыт на чтение и запись (B<O_RDWR>) и в файловом дескрипторе установлен флаг B<O_LARGEFILE>.

source: With respect to B<fork>(2) and B<execve>(2), the usual semantics apply for the file descriptor created by B<memfd_create>(). A copy of the file descriptor is inherited by the child produced by B<fork>(2) and refers to the same file. The file descriptor is preserved across B<execve>(2), unless the close-on-exec flag has been set.
ru: При вызове B<fork>(2) и B<execve>(2) с файловым дескриптором, созданным B<memfd_create>(), применяется обычная семантика. Копия файлового дескриптора наследуется потомком, созданным B<fork>(2), указывает на тот же файл. Файловый дескриптор сохраняется при после B<execve>(2), если не установлен флаг close-on-exec.

source: On success, B<memfd_create>() returns a new file descriptor. On error, -1 is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<memfd_create>() возвращает новый файловый дескриптор. При ошибке возвращается -1, и I<errno> устанавливается в соответствующее значение.

source: The address in I<name> points to invalid memory.
ru: Некорректный адрес в I<name>.

source: I<flags> included unknown bits.
ru: В I<flags> указаны неизвестные биты.

source: I<name> was too long. (The limit is 249 bytes, excluding the terminating null byte.)
ru: Значение I<name> было слишком длинным (ограничено 249 байтами, не считая конечный байт null).

source: Both B<MFD_HUGETLB> and B<MFD_ALLOW_SEALING> were specified in I<flags>.
ru: В I<flags> указаны B<MFD_HUGETLB> и B<MFD_ALLOW_SEALING> одновременно.

source: The per-process limit on the number of open file descriptors has been reached.
ru: Было достигнуто ограничение по количеству открытых файловых дескрипторов на процесс.

source: There was insufficient memory to create a new anonymous file.
ru: Недостаточно памяти для создания нового анонимного файла.

source: The B<memfd_create>() system call first appeared in Linux 3.17; glibc support was added in version 2.27.
ru: Системный вызов B<memfd_create>() появился в Linux 3.17; поддержка в glibc началась с версии 2.27.

source: The B<memfd_create>() system call is Linux-specific.
ru: Системный вызов B<memfd_create>() есть только в Linux.

source: The B<memfd_create>() system call provides a simple alternative to manually mounting a B<tmpfs>(5) filesystem and creating and opening a file in that filesystem. The primary purpose of B<memfd_create>() is to create files and associated file descriptors that are used with the file-sealing APIs provided by B<fcntl>(2).
ru: Системный вызов B<memfd_create>() предоставляет простую альтернативу ручному монтированию файловой системы B<tmpfs>(5), созданию и открытию файла в этой файловой системе. Основным предназначением B<memfd_create>() является создание файлов и соответствующих файловых дескрипторов, которые используются с программным интерфейсом опечатывания файлов, предоставляемым B<fcntl>(2).

source: The B<memfd_create>() system call also has uses without file sealing (which is why file-sealing is disabled, unless explicitly requested with the B<MFD_ALLOW_SEALING> flag). In particular, it can be used as an alternative to creating files in I<tmp> or as an alternative to using the B<open>(2) B<O_TMPFILE> in cases where there is no intention to actually link the resulting file into the filesystem.
ru: Системный вызов B<memfd_create>() также используется и без опечатывания файла (вот почему опечатывание файлов отключено, если этого не запросить явно с помощью флага B<MFD_ALLOW_SEALING>). В частности, он может использоваться как альтернатива созданию файлов в I<tmp> или использованию B<open>(2) с B<O_TMPFILE> в случаях, когда не требуется реальная ссылка на конечный файл в файловой системе.

source: File sealing
ru: Опечатывание файла (file sealing)

source: In the absence of file sealing, processes that communicate via shared memory must either trust each other, or take measures to deal with the possibility that an untrusted peer may manipulate the shared memory region in problematic ways. For example, an untrusted peer might modify the contents of the shared memory at any time, or shrink the shared memory region. The former possibility leaves the local process vulnerable to time-of-check-to-time-of-use race conditions (typically dealt with by copying data from the shared memory region before checking and using it). The latter possibility leaves the local process vulnerable to B<SIGBUS> signals when an attempt is made to access a now-nonexistent location in the shared memory region. (Dealing with this possibility necessitates the use of a handler for the B<SIGBUS> signal.)
ru: Ели файл не опечатан, то процессы, которые связываются через общую память, должны или доверять друг другу, или учитывать возможность того, что недоверенная сторона может работать с общей памятью проблемным способом. Например, недоверенная сторона может изменить содержимое общей памяти в любое время или уменьшить область общей памяти. Первая возможность делает локальный процесс уязвимым к состязательности условий «момент проверки — момент использования» (обычно решается копированием данных из области общей памяти перед проверкой и использованием). Последняя возможность делает локальный процесс уязвимым к сигналам B<SIGBUS>, которые возникают при попытке получить доступ к теперь несуществующему расположению в области общей памяти (решается использованием обработчика сигнала B<SIGBUS>).

source: Dealing with untrusted peers imposes extra complexity on code that employs shared memory. Memory sealing enables that extra complexity to be eliminated, by allowing a process to operate secure in the knowledge that its peer can't modify the shared memory in an undesired fashion.
ru: Взаимодействие с недоверенными сторонами приводит к усложнению кода для работы с общей памятью. Опечатывание памяти позволяет устранить эту сложность, позволяя процессу безопасно работать, зная что его партнёр не может изменить общую память нежелательным способом.

source: An example of the usage of the sealing mechanism is as follows:
ru: В примере использования механизма опечатывания происходит следующее:

source: The first process creates a B<tmpfs>(5) file using B<memfd_create>(). The call yields a file descriptor used in subsequent steps.
ru: Первый процесс создаёт файл B<tmpfs>(5) с помощью B<memfd_create>(). Вызов возвращает файловый дескриптор, используемый далее.

source: The first process sizes the file created in the previous step using B<ftruncate>(2), maps it using B<mmap>(2), and populates the shared memory with the desired data.
ru: Первый процесс задаёт размер файла, созданного ранее, с помощью B<ftruncate>(2), отображает его с помощью B<mmap>(2) и заполняется общую память нужными данными.

source: The first process uses the B<fcntl>(2) B<F_ADD_SEALS> operation to place one or more seals on the file, in order to restrict further modifications on the file. (If placing the seal B<F_SEAL_WRITE>, then it will be necessary to first unmap the shared writable mapping created in the previous step.)
ru: Первый процесс использует B<fcntl>(2) с операцией B<F_ADD_SEALS> для установки одной или более печатей на файл, чтобы в дальнейшем ограничить изменение файла (если устанавливается печать B<F_SEAL_WRITE>, то сначала нужно удалить общее доступное на запись отображение, созданное ранее).

source: A second process obtains a file descriptor for the B<tmpfs>(5) file and maps it. Among the possible ways in which this could happen are the following:
ru: Второй процесс получает файловый дескриптор файла B<tmpfs>(5) и отображает его. Варианты того, как это можно сделать:

source: The process that called B<memfd_create>() could transfer the resulting file descriptor to the second process via a UNIX domain socket (see B<unix>(7) and B<cmsg>(3)). The second process then maps the file using B<mmap>(2).
ru: Процесс, вызвавший B<memfd_create>(), может переслать полученный файловый дескриптор второму процессу через доменный сокет UNIX (смотрите B<unix>(7) и B<cmsg>(3)). Второй процесс затем отображает файл с помощью B<mmap>(2).

source: The second process is created via B<fork>(2) and thus automatically inherits the file descriptor and mapping. (Note that in this case and the next, there is a natural trust relationship between the two processes, since they are running under the same user ID. Therefore, file sealing would not normally be necessary.)
ru: Второй процесс создаётся с помощью B<fork>(2) и, таким образом, наследует файловый дескриптор и отображение (заметим, что в этом случае и следующем образуется природное доверие между двумя процессами, так как они работают с правами одного пользовательского идентификатора. Поэтому опечатывание файла здесь не нужно).

source: The second process opens the file I</proc/E<lt>pidE<gt>/fd/E<lt>fdE<gt>>, where I<E<lt>pidE<gt>> is the PID of the first process (the one that called B<memfd_create>()), and I<E<lt>fdE<gt>> is the number of the file descriptor returned by the call to B<memfd_create>() in that process. The second process then maps the file using B<mmap>(2).
ru: Второй процесс открывает файл I</proc/E<lt>pidE<gt>/fd/E<lt>fdE<gt>>, где I<E<lt>pidE<gt>> — PID первого процесса (вызвавшего B<memfd_create>()), а I<E<lt>fdE<gt>> — номер файлового дескриптора, возвращённого вызовом B<memfd_create>() в этом процессе. Затем второй процесс отображает файл с помощью B<mmap>(2).

source: The second process uses the B<fcntl>(2) B<F_GET_SEALS> operation to retrieve the bit mask of seals that has been applied to the file. This bit mask can be inspected in order to determine what kinds of restrictions have been placed on file modifications. If desired, the second process can apply further seals to impose additional restrictions (so long as the B<F_SEAL_SEAL> seal has not yet been applied).
ru: Второй процесс использует B<fcntl>(2) с операцией B<F_GET_SEALS> для получения битовой маски печатей, которые были применены к файлу. Данная маска проверяется, чтобы определить какие ограничения наложены на изменения файла. Если требуется, то второй процесс может наложить дополнительные печати, что ещё ограничить действия (возможно до тех пор, пока не будет наложена печать B<F_SEAL_SEAL>).
