Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Filenames (whether pathnames, or references to header files) are always in italics (e.g., I<E<lt>stdio.hE<gt>>), except in the SYNOPSIS section, where included files are in bold (e.g., B<#include E<lt>stdio.hE<gt>>). When referring to a standard header file include, specify the header file surrounded by angle brackets, in the usual C way (e.g., I<E<lt>stdio.hE<gt>>).
ru: Имена файлов (также пути или ссылки на заголовочные файлы) всегда должны быть оформлены курсивом (например, I<E<lt>stdio.hE<gt>>), кроме раздела ОБЗОР, где включаемые файлы должны быть полужирным (например, B<#include E<lt>stdio.hE<gt>>). Тут ссылка на стандартный заголовочный файл включает имя заголовочного файл, окружённого угловыми скобками, это типично для C (например, I<E<lt>stdio.hE<gt>>).

source: Special macros, which are usually in uppercase, are in bold (e.g., B<MAXINT>). Exception: don't boldface NULL.
ru: Специальные макросы, которые обычно находятся в верхнем регистре, оформляют полужирным (например, B<MAXINT>). Исключение: не делайте полужирным NULL.

source: When enumerating a list of error codes, the codes are in bold (this list usually uses the B<\&.TP> macro).
ru: В списке, при перечислении кодов ошибок, коды оформляют полужирным (в этом списке обычно используют макрос B<\&.TP>).

source: Complete commands should, if long, be written as an indented line on their own, with a blank line before and after the command, for example
ru: Составные команды, если они длинные, должны быть записаны с отступом по линии, как самодостаточные, с пустой строкой перед и после команды, например

source: If the command is short, then it can be included inline in the text, in italic format, for example, I<man 7 man-pages>. In this case, it may be worth using nonbreaking spaces ("\e\ ") at suitable places in the command. Command options should be written in italics (e.g., I<-l>).
ru: Если команда короткая, то её можно включить прямо в текст как курсив, например I<man 7 man-pages>. В этом случае может потребоваться использовать неразрывные пробелы («\e\ ») в соответствующих местах команды. Параметры команды также должны быть выделены курсивом (например, I<-l>).

source: Expressions, if not written on a separate indented line, should be specified in italics. Again, the use of nonbreaking spaces may be appropriate if the expression is inlined with normal text.
ru: Выражения, если не записаны на отдельной строке с отступом, должны выделяться курсивом. Здесь также может потребоваться задавать неразрывные пробелы, если выражение встроено в обычный текст.

source: When showing example shell sessions, user input should be formatted in bold, for example
ru: При показе примера сеанса оболочки пользовательский ввод должен быть выделен жирным, например

source: Any reference to another man page should be written with the name in bold, I<always> followed by the section number, formatted in Roman (normal) font, without any separating spaces (e.g., B<intro>(2)). The preferred way to write this in the source file is:
ru: Все ссылки на другие справочные страницы должны выделяться жирным шрифтом, I<всегда> должен быть указан номер раздела шрифтом Roman (обычным) и без пробелов (например, B<intro>(2)). В исходном файле это лучше записывать так:

source: (Including the section number in cross references lets tools like B<man2html>(1) create properly hyperlinked pages.)
ru: (включение номера раздела в перекрёстных ссылках позволяет таким инструментам как B<man2html>(1) создавать правильные гиперссылки между страницами)

source: Control characters should be written in bold face, with no quotes; for example, B<^X>.
ru: Управляющие знаки следует писать полужирным шрифтом, без кавычек, как в примере B<^X>.

source: Spelling
ru: Орфография

source: Starting with release 2.59, I<man-pages> follows American spelling conventions (previously, there was a random mix of British and American spellings); please write all new pages and patches according to these conventions.
ru: Начиная с версии I<man-pages> следует при написании Американским соглашениям (до этого использовалось английское и американское написание); пишите новые страницы и присылайте заплаты с учётом этих соглашений.

source: Aside from the well-known spelling differences, there are a few other subtleties to watch for:
ru: Кроме известных различий в написании, есть несколько других тонкостей, которые следует учесть:

source: American English tends to use the forms "backward", "upward", "toward", and so on rather than the British forms "backwards", "upwards", "towards", and so on.
ru: Американский вариант английского языка имеет обыкновение использовать формы «backward» (назад), «upward» (вверх), «toward» (к) и т. д., а в британском варианте это «backwards», «upwards», «towards» и т. д.

source: BSD version numbers
ru: Номера версий BSD

source: The classical scheme for writing BSD version numbers is I<x.yBSD>, where I<x.y> is the version number (e.g., 4.2BSD). Avoid forms such as I<BSD 4.3>.
ru: Классической схемой обозначения версий BSD является I<x.yBSD>, где I<x.y> - номер версии (например, 4.2BSD). Избегайте написания в стиле I<BSD 4.3>.

source: Capitalization
ru: Печать заглавными буквами

source: In subsection ("SS") headings, capitalize the first word in the heading, but otherwise use lowercase, except where English usage (e.g., proper nouns) or programming language requirements (e.g., identifier names) dictate otherwise. For example:
ru: В заголовках разделов («SS») начинайте первое слово заголовка с заглавной буквы, а остальные буквы должны быть строчными, если обратного не требуют правила английского языка (например, имён собственных) или языка программирования (например, идентификаторы имён). Пример:

source: .SS Unicode under Linux
ru: .SS Юникод в Linux

source: Indentation of structure definitions, shell session logs, and so on
ru: Отступ при определении структур, содержимого журналов сеансов оболочек и т. п.

source: When structure definitions, shell session logs, and so on are included in running text, indent them by 4 spaces (i.e., a block enclosed by I<.in\ +4n> and I<.in>), format them using the I<.EX> and I<EE> macros, and surround them with suitable paragraph markers (either I<.PP> or I<.IP>). For example:
ru: При включении определений структур, журналов сеансов оболочек и т. п. в выполняемый текст, нужно использовать отступ в 4 пробела (т. е., блок заключается в I<.in\ +4n> и I<.in>), форматировать их с помощью макросов I<.EX> и I<EE> и окружить их подходящими маркерами параграфа (I<.PP> или I<.IP>). Пример:

source: Preferred terms
ru: Предпочтительные термины

source: The following table lists some preferred terms to use in man pages, mainly to ensure consistency across pages.
ru: В следующей таблице перечислены некоторые предпочтительные термины, для использования в справочных страницах, главным образом, для непротиворечивости информации на страницах.

source: Term
ru: Термин (перевод)

source: Avoid using
ru: Не используйте

source: Notes
ru: Замечания

source: bit mask
ru: bit mask (маска битов)

source: built-in
ru: built-in (встроенный)

source: Epoch
ru: Epoch (эпоха)

source: For the UNIX Epoch (00:00:00, 1 Jan 1970 UTC)
ru: Эпоха UNIX (00:00:00, 1 января 1970 UTC)

source: filename
ru: filename (имя файла)

source: filesystem
ru: filesystem (файловая система)

source: hostname
ru: hostname (имя узла)

source: lowercase
ru: lowercase (строчные)

source: pathname
ru: pathname (путь)

source: pseudoterminal
ru: pseudoterminal (псевдо-терминал)

source: privileged port
ru: privileged port (привилегированный порт)

source: real-time
ru: real-time (реальное время)

source: run time
ru: run time (время исполнения)

source: saved set-group-ID
ru: saved set-group-ID (сохранённый set-group-ID)

source: saved set-user-ID
ru: saved set-user-ID (сохранённый saved set-user-ID)

source: superuser
ru: superuser (суперпользователь)

source: superblock
ru: superblock (суперблок)

source: timestamp
ru: timestamp (метка времени)

source: timezone
ru: timezone (часовой пояс)

source: uppercase
ru: uppercase (прописные)

source: usable
ru: usable (приемлемый)

source: user space
ru: user space (пространство пользователя)

source: username
ru: username (имя пользователя)

source: Except if referring to result of "uname\ -m" or similar
ru: Кроме случая, когда ссылаются на результат «uname\ -m» или подобных

source: zeros
ru: zeros (нули)

source: See also the discussion I<Hyphenation of attributive compounds> below.
ru: Смотрите также I<Дефисы в составных терминах> далее.

source: Terms to avoid
ru: Термины, которых следует избегать

source: The following table lists some terms to avoid using in man pages, along with some suggested alternatives, mainly to ensure consistency across pages.
ru: В следующей таблице перечислены некоторые термины, которые лучше не использовать в справочных страницах и предлагаемые им альтернативы, использование которых поможет избежать противоречий между справочными страницами.

source: Avoid
ru: Не используйте

source: Use instead
ru: Для использования

source: 32-bit
ru: 32-bit (32-битный)

source: same for 8-bit, 16-bit, etc.
ru: это же с 8-bit, 16-bit и т. п.

source: current process
ru: current process (текущий процесс)

source: calling process
ru: calling process (вызывающий процесс)

source: A common mistake made by kernel programmers when writing man pages
ru: Частая ошибка, делаемая программистами ядра при написании справочных страниц

source: man page, manual page
ru: man page, manual page (справочная страница)

source: minus infinity
ru: minus infinity (минус бесконечность)

source: negative infinity
ru: negative infinity (отрицательная бесконечность)

source: unprivileged user
ru: unprivileged user (непривилегированный пользователь)

source: unprivileged
ru: непривилегированный

source: operating system
ru: operating system (операционная система)

source: plus infinity
ru: plus infinity (плюс бесконечность)

source: positive infinity
ru: positive infinity (положительная бесконечность)

source: terminal
ru: terminal (терминал)

source: UNIX systems
ru: UNIX systems (системы UNIX)

source: Trademarks
ru: Торговые марки

source: Use the correct spelling and case for trademarks. The following is a list of the correct spellings of various relevant trademarks that are sometimes misspelled:
ru: При упоминании торговых марок соблюдайте правильное написание с соблюдением регистра. Вот список правильного написания различных торговых марок, которые иногда указывают неправильно:

source: NULL, NUL, null pointer, and null character
ru: NULL, NUL, указатель null и символ null

source: A I<null pointer> is a pointer that points to nothing, and is normally indicated by the constant I<NULL>. On the other hand, I<NUL> is the I<null byte>, a byte with the value 0, represented in C via the character constant I<\(aq\e0\(aq>.
ru: I<Указатель null> — это указатель, который ни на что не указывает и, как правило, имеет значение константы I<NULL>. С другой стороны, I<NUL> представляет собой I<байт null>, байт со значением 0, который в C представляется символьной константой I<\(aq\e0\(aq>.

source: The preferred term for the pointer is "null pointer" or simply "NULL"; avoid writing "NULL pointer".
ru: Данный указатель лучше называть «указатель null» или просто «NULL»; не используйте «указатель NULL».

source: The preferred term for the byte is "null byte". Avoid writing "NUL", since it is too easily confused with "NULL". Avoid also the terms "zero byte" and "null character". The byte that terminates a C string should be described as "the terminating null byte"; strings may be described as "null-terminated", but avoid the use of "NUL-terminated".
ru: Для описания байта используйте «байт null». Не пишите «NUL», так как такое наименование легко спутать с «NULL». Также избегайте терминов «нулевой байт» и «символ null». Байт, которым заканчиваются строки в C, нужно описывать как «завершающий байт null» (terminating null byte); про строки можно сказать как «завершающиеся null» (null-terminated), но не используйте «завершающиеся NUL».

source: Hyperlinks
ru: Гиперссылки

source: For hyperlinks, use the I<.UR>/I<.UE> macro pair (see B<groff_man>(7)). This produces proper hyperlinks that can be used in a web browser, when rendering a page with, say:
ru: Для указания гиперссылок используйте пару макросов I<.UR>/I<.UE> (смотрите B<groff_man>(7)). Они создаёт корректные гиперссылки, которые можно использовать при просмотре в браузере, например так:

source: BROWSER=firefox man -H pagename
ru: BROWSER=firefox man -H имя_страницы

source: Use of e.g., i.e., etc., a.k.a., and similar
ru: Использование сокращений e.g. (например), i.e. (т. е.), a.k.a. (также известно как) и подобных

source: In general, the use of abbreviations such as "e.g.", "i.e.", "etc.", "cf.", and "a.k.a." should be avoided, in favor of suitable full wordings ("for example", "that is", "compare to", "and so on", "also known as").
ru: Обычно лучше не использовать сокращения вида «e.g.», «i.e.», «etc.», «cf.», «a.k.a.», а писать слова полностью («например», «то есть», «и так далее», «по сравнению с», «также известно как»).

source: The only place where such abbreviations may be acceptable is in I<short> parenthetical asides (e.g., like this one).
ru: Единственным приемлемым местом для их использования является I<короткая> сноска (как, напр., эта).

source: Always include periods in such abbreviations, as shown here. In addition, "e.g." and "i.e." should always be followed by a comma.
ru: Всегда указывайте точки в подобных аббревиатурах. Также после «напр.р» и «т.е.» всегда ставится запятая.

source: Em-dashes
ru: Длинное тире

source: The way to write an em-dash\(emthe glyph that appears at either end of this subphrase\(emin *roff is with the macro "\e(em". (On an ASCII terminal, an em-dash typically renders as two hyphens, but in other typographical contexts it renders as a long dash.) Em-dashes should be written I<without> surrounding spaces.
ru: Для написания тире — символический знак, который появится в конце этой фразы\(emв *roff используется макрос «\e(em» (на терминалах с ASCII тире, обычно, отображается в виде двух переносов, но в других типографских контекстах оно может выглядеть как длинное тире). Тире должно записываться I<без> окружающих его пробелов.

source: Hyphenation of attributive compounds
ru: Дефисы в составных терминах

source: Compound terms should be hyphenated when used attributively (i.e., to qualify a following noun). Some examples:
ru: Составные термины пишутся через дефис при использовании в качестве определителя (т. е., для уточнения последующего существительного). Примеры:

source: 32-bit value command-line argument floating-point number run-time check user-space function wide-character string
ru: 32-bit value (32-битное значение) command-line argument (аргумент командной строки) floating-point number (число с плавающей запятой) run-time check (проверка во время выполнения) user-space function (функция пространства пользователя) wide-character string (строка широких символов)

source: Hyphenation with multi, non, pre, re, sub, and so on
ru: Дефис с multi, non, pre, re, sub и т. п.

source: The general tendency in modern English is not to hyphenate after prefixes such as "multi", "non", "pre", "re", "sub", and so on. Manual pages should generally follow this rule when these prefixes are used in natural English constructions with simple suffixes. The following list gives some examples of the preferred forms:
ru: Общая тенденция на современном английском языке состоит в том, чтобы не ставить дефисы после префиксов «multi», «non», «pre», «re», «sub» и т. д. В справочных страницах, в основном, нужно следовать этому правилу, когда эти префиксы используются в естественных английских конструкциях с простыми суффиксами. В следующем списке приведены некоторые примеры правильного написания:

source: Hyphens should be retained when the prefixes are used in nonstandard English words, with trademarks, proper nouns, acronyms, or compound terms. Some examples:
ru: Дефисы должны быть сохранены после префиксов для нестандартных английских слов, торговых марок, имён собственных, акронимов или составных терминов. Несколько примеров:

source: Finally, note that "re-create" and "recreate" are two different verbs, and the former is probably what you want.
ru: И напоследок заметим, что «re-create» и «recreate» — это два различных глагола и первый, вероятно то, что нужно.

source: Real minus character
ru: Символ математического минуса

source: Where a real minus character is required (e.g., for numbers such as -1, for man page cross references such as B<utf-8>(7), or when writing options that have a leading dash, such as in I<ls\ -l>), use the following form in the man page source:
ru: Если требуется символ математического минуса (например, для чисел (-1), перекрёстных ссылок справочных страниц (B<utf-8>(7) или при записи параметров, у которых есть начальные тире (I<ls\ -l>)), используйте следующую форму записи в справочной странице:

source: This guideline applies also to code examples.
ru: Это правило применимо и в примерах кода.

source: Character constants
ru: Символьные константы

source: To produce single quotes that render well in both ASCII and UTF-8, use the following form for character constants in the man page source:
ru: Чтобы получить одинарные кавычки, которые хорошо отображаются и в ASCII и в UTF-8, используйте следующую форму записи символьных констант в справочной странице:

source: where I<C> is the quoted character. This guideline applies also to character constants used in code examples.
ru: где I<C> — символ в кавычках. Это правило применимо и в примерах кода.

source: Example programs and shell sessions
ru: Примеры программ и сценариев оболочки

source: Manual pages may include example programs demonstrating how to use a system call or library function. However, note the following:
ru: Справочные страницы могут включать примеры программ, демонстрирующие использование системных вызовов или библиотечных функций. При этом нужно учитывать ряд условий:

source: Example programs should be written in C.
ru: Примеры программ должны быть написаны на языке C.

source: An example program is necessary and useful only if it demonstrates something beyond what can easily be provided in a textual description of the interface. An example program that does nothing other than call an interface usually serves little purpose.
ru: Примеры программ необходимы и полезны лишь в тех случаях, когда они демонстрируют что-то сверх того, что может быть легко представлено в текстовом описании командного интерфейса. Примеры программ, которые не показывают ничего кроме вызова команды, как правило обладают незначительной полезностью.

source: Example programs should be fairly short (preferably less than 100 lines; ideally less than 50 lines).
ru: Примеры программ должны быть предельно короткими (желательно менее 100 строк; в идеале менее 50 строк)

source: Example programs should do error checking after system calls and library function calls.
ru: В примерах программ должна быть реализована проверка ошибок после системных вызовов и вызовов библиотечных функций.

source: Example programs should be complete, and compile without warnings when compiled with I<cc\ -Wall>.
ru: Примеры программ должны быть полными и компилироваться без предупреждений при использовании I<cc\ -Wall>.

source: Where possible and appropriate, example programs should allow experimentation, by varying their behavior based on inputs (ideally from command-line arguments, or alternatively, via input read by the program).
ru: Там, где это возможно и целесообразно, примеры программ должны демонстрировать эксперимент, изменяя свое поведение в зависимости от входных параметров (в идеале от параметров командной строки или получаемых программой через стандартный ввод).

source: Example programs should be laid out according to Kernighan and Ritchie style, with 4-space indents. (Avoid the use of TAB characters in source code!) The following command can be used to format your source code to something close to the preferred style:
ru: Примеры программ должны быть написаны в стиле Кернигана (Kernighan) и Ритчи (Ritchie), с отступом, состоящим из 4 пробелов. (Избегайте использования символа табуляции в исходном коде!) Следующие команды могут быть использованы для форматирования исходного кода в что-то близкое к предпочтительному стилю:

source: For consistency, all example programs should terminate using either of:
ru: Для удобства восприятия, все программы должны завершаться с использованием одного из вариантов:

source: Avoid using the following forms to terminate a program:
ru: Избегайте использования следующих форм завершения программы:

source: If there is extensive explanatory text before the program source code, mark off the source code with a subsection heading I<Program source>, as in:
ru: В случаях, когда примеру программы предшествует обширный пояснительный текст, определите код в подраздел и пометьте соответствующим заголовком I<Код программы>, как показано ниже:

source: .SS Program source
ru: .SS Код программы

source: Always do this if the explanatory text includes a shell session log.
ru: Всегда делайте это, если пояснительный текст включает примеры вывода в терминал.

source: If you include a shell session log demonstrating the use of a program or other system feature:
ru: Если включаете лог вывода в терминал, демонстрирующий использование программы или системной функции:

source: Place the session log above the source code listing
ru: Поместите лог терминала выше листинга кода программы.

source: Indent the session log by four spaces.
ru: Обозначьте лог терминала четырьмя пробелами.

source: Boldface the user input text, to distinguish it from output produced by the system.
ru: Выделите полужирным вводимый пользователем текст, чтобы отличить его от вывода системы.

source: For some examples of what example programs should look like, see B<wait>(2) and B<pipe>(2).
ru: Ознакомиться с тем, как должны выглядеть примеры программ Вы можете, прочитав B<wait>(2) и B<pipe>(2).

source: For canonical examples of how man pages in the I<man-pages> package should look, see B<pipe>(2) and B<fcntl>(2).
ru: В качестве канонического примера того, как должны выглядеть страницы в пакете I<man-pages>, смотрите B<pipe>(2) и B<fcntl>(2).

source: math_error - detecting errors from mathematical functions
ru: math_error - определение ошибок при выполнении математических функций

source: When an error occurs, most library functions indicate this fact by returning a special value (e.g., -1 or NULL). Because they typically return a floating-point number, the mathematical functions declared in I<E<lt>math.hE<gt>> indicate an error using other mechanisms. There are two error-reporting mechanisms: the older one sets I<errno>; the newer one uses the floating-point exception mechanism (the use of B<feclearexcept>(3) and B<fetestexcept>(3), as outlined below) described in B<fenv>(3).
ru: При возникновении ошибки большинство библиотечных функций возвращают специальное значение (например, -1 или NULL). Так как математические функции, объявленные в I<E<lt>math.hE<gt>>, обычно, возвращают число с плавающей запятой, то для выдачи ошибки используются другие способы. Есть два варианта вернуть сообщение об ошибке: старый — изменяя I<errno>; новый — используя механизм исключений плавающей запятой (с помощью B<feclearexcept>(3) и B<fetestexcept>(3) как описано ниже), описанный в B<fenv>(3).

source: A portable program that needs to check for an error from a mathematical function should set I<errno> to zero, and make the following call
ru: Переносимая программа, которой требуется проверка на ошибки в математических функциях, должна обнулить I<errno> и выполнить вызов
