Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: POSIX message queues allow processes to exchange data in the form of messages. This API is distinct from that provided by System V message queues (B<msgget>(2), B<msgsnd>(2), B<msgrcv>(2), etc.), but provides similar functionality.
ru: Очереди сообщений POSIX позволяют процессам обмениваться данными в виде сообщений. Данный программный интерфейс отличается от используемого в очередях сообщений System V (B<msgget>(2), B<msgsnd>(2), B<msgrcv>(2), etc.), но предоставляет схожие возможности.

source: Message queues are created and opened using B<mq_open>(3); this function returns a I<message queue descriptor> (I<mqd_t>), which is used to refer to the open message queue in later calls. Each message queue is identified by a name of the form I</somename>; that is, a null-terminated string of up to B<NAME_MAX> (i.e., 255) characters consisting of an initial slash, followed by one or more characters, none of which are slashes. Two processes can operate on the same queue by passing the same name to B<mq_open>(3).
ru: Очереди сообщений создаются и открываются с помощью B<mq_open>(3); эта функция возвращает I<дескриптор очереди сообщений> (I<mqd_t>), который используется в последующих вызовах для ссылки на открытую очередь сообщений. Каждая очередь сообщений описывается именем в виде I</некое_имя>; оно представляет собой строку с null в конце и длиной до B<NAME_MAX> (т. е., 255) символов, состоящую из начальной косой черты, одного и более символа (любого, кроме косой черты). Два процесса могут работать через одну очередь, если укажут одинаковое имя в B<mq_open>(3).

source: Messages are transferred to and from a queue using B<mq_send>(3) and B<mq_receive>(3). When a process has finished using the queue, it closes it using B<mq_close>(3), and when the queue is no longer required, it can be deleted using B<mq_unlink>(3). Queue attributes can be retrieved and (in some cases) modified using B<mq_getattr>(3) and B<mq_setattr>(3). A process can request asynchronous notification of the arrival of a message on a previously empty queue using B<mq_notify>(3).
ru: Сообщения передаются в и из очереди с помощью функций B<mq_send>(3) и B<mq_receive>(3). Когда процесс прекращает использовать очередь, он закрывает её с помощью функции B<mq_close>(3), и если очередь больше не нужна, то она может быть удалена с помощью функции B<mq_unlink>(3). Атрибуты очереди можно получить и (в некоторых случаях) изменить с помощью функций B<mq_getattr>(3) и B<mq_setattr>(3). Процесс может запросить асинхронное уведомление о поступлении сообщения в пустую очередь с помощью функции B<mq_notify>(3).

source: A message queue descriptor is a reference to an I<open message queue description> (see B<open>(2)). After a B<fork>(2), a child inherits copies of its parent's message queue descriptors, and these descriptors refer to the same open message queue descriptions as the corresponding message queue descriptors in the parent. Corresponding message queue descriptors in the two processes share the flags (I<mq_flags>) that are associated with the open message queue description.
ru: Дескриптор очереди сообщений — это ссылка на I<открытое описание очереди сообщений> (смотрите B<open>(2)). После вызова B<fork>(2) потомок наследует копии дескрипторов очередей сообщений родителя и эти дескрипторы ссылаются на те же открытые описания очередей сообщений родителя. Соответствующие дескрипторы очередей сообщений двух процессов используют общий флаг (I<mq_flags>), который связан с открытым описанием очереди сообщений.

source: Each message has an associated I<priority>, and messages are always delivered to the receiving process highest priority first. Message priorities range from 0 (low) to I<sysconf(_SC_MQ_PRIO_MAX)\ -\ 1> (high). On Linux, I<sysconf(_SC_MQ_PRIO_MAX)> returns 32768, but POSIX.1 requires only that an implementation support at least priorities in the range 0 to 31; some implementations provide only this range.
ru: У каждого сообщения есть I<приоритет>, и сначала в принимающий процесс всегда доставляются сообщения наивысшим приоритетом. Диапазон приоритетов сообщений: 0 (низший) — I<sysconf(_SC_MQ_PRIO_MAX)\ -\ 1> (высший). В Linux, I<sysconf(_SC_MQ_PRIO_MAX)> возвращает 32768, но в POSIX.1 требуется реализация поддержки только диапазона приоритетов от 0 до 31; некоторые реализации предоставляют только этот диапазон.

source: The remainder of this section describes some specific details of the Linux implementation of POSIX message queues.
ru: Далее в разделе описываются особенности реализации очередей сообщений POSIX в Linux.

source: Library interfaces and system calls
ru: Библиотечные интерфейсы и системные вызовы

source: In most cases the B<mq_*>() library interfaces listed above are implemented on top of underlying system calls of the same name. Deviations from this scheme are indicated in the following table:
ru: В большинстве случаев, перечисленные выше библиотечные интерфейсы B<mq_*>() реализуются поверх системных вызовов с теми же именами. Исключения из этого правила перечислены в следующей таблице:

source: Library interface
ru: Библиотечный интерфейс

source: System call
ru: Системный вызов

source: Versions
ru: Версии

source: POSIX message queues have been supported on Linux since kernel 2.6.6. Glibc support has been provided since version 2.3.4.
ru: Поддержка очередей сообщений POSIX началась в ядре Linux версии 2.6.6. Поддержка в glibc предоставляется с версии 2.3.4.

source: Kernel configuration
ru: Конфигурация ядра

source: Support for POSIX message queues is configurable via the B<CONFIG_POSIX_MQUEUE> kernel configuration option. This option is enabled by default.
ru: Поддержка очередей сообщений POSIX включается параметром настройки ядра B<CONFIG_POSIX_MQUEUE>. Данный параметр включён по умолчанию.

source: Persistence
ru: Устойчивость

source: POSIX message queues have kernel persistence: if not removed by B<mq_unlink>(3), a message queue will exist until the system is shut down.
ru: Очереди сообщений POSIX располагаются в ядре. Пока очередь не удалёна с помощью B<mq_unlink>(3), она остаётся в системе до её выключения.

source: Linking
ru: Компоновка

source: Programs using the POSIX message queue API must be compiled with I<cc -lrt> to link against the real-time library, I<librt>.
ru: Программы, в которых используется программный интерфейс очереди сообщений POSIX, для компоновки с библиотекой реального времени I<librt> должны компилироваться с помощью I<cc -lrt>.

source: /proc interfaces
ru: Интерфейсы /proc

source: The following interfaces can be used to limit the amount of kernel memory consumed by POSIX message queues and to set the default attributes for new message queues:
ru: Для ограничения потребления очередями сообщений POSIX памяти ядра и задания атрибутов по умолчанию для новых очередей сообщений, можно использовать следующие интерфейсы:

source: I</proc/sys/fs/mqueue/msg_default> (since Linux 3.5)
ru: I</proc/sys/fs/mqueue/msg_default> (начиная с Linux 3.5)

source: This file defines the value used for a new queue's I<mq_maxmsg> setting when the queue is created with a call to B<mq_open>(3) where I<attr> is specified as NULL. The default value for this file is 10. The minimum and maximum are as for I</proc/sys/fs/mqueue/msg_max>. A new queue's default I<mq_maxmsg> value will be the smaller of I<msg_default> and I<msg_max>. Up until Linux 2.6.28, the default I<mq_maxmsg> was 10; from Linux 2.6.28 to Linux 3.4, the default was the value defined for the I<msg_max> limit.
ru: В данном файле задаётся значение, которое используется для I<mq_maxmsg> в создаваемой новой очереди с помощью вызова B<mq_open>(3) со значением I<attr> равным NULL. Значение для этого файла по умолчанию равно 10. Минимальное и максимальные значение такие же как для I</proc/sys/fs/mqueue/msg_max>. Значение по умолчанию I<mq_maxmsg> у новой очереди будет меньше I<msg_default> и I<msg_max>. До Linux 2.6.28 значение I<mq_maxmsg> по умолчанию равнялось 10; с Linux 2.6.28 по Linux 3.4 значение по умолчанию равнялось ограничению I<msg_max>.

source: This file can be used to view and change the ceiling value for the maximum number of messages in a queue. This value acts as a ceiling on the I<attr-E<gt>mq_maxmsg> argument given to B<mq_open>(3). The default value for I<msg_max> is 10. The minimum value is 1 (10 in kernels before 2.6.28). The upper limit is B<HARD_MSGMAX>. The I<msg_max> limit is ignored for privileged processes (B<CAP_SYS_RESOURCE>), but the B<HARD_MSGMAX> ceiling is nevertheless imposed.
ru: Данный файл можно использовать для просмотра и изменения значения максимального количества сообщений в очереди. Это значение служит верхним пределом для аргумента I<attr-E<gt>mq_maxmsg>, указываемого в B<mq_open>(3). Значение I<msg_max> по умолчанию равно 10. Минимальное значение равно 1 (10 в ядрах до версии 2.6.28). Верхний предел равен B<HARD_MSGMAX>. Ограничитель I<msg_max> игнорируется для привилегированных процессов (B<CAP_SYS_RESOURCE>), но, тем не менее, учитывается предел B<HARD_MSGMAX>.

source: The definition of B<HARD_MSGMAX> has changed across kernel versions:
ru: Определение B<HARD_MSGMAX> изменялось в разных версиях ядра следующим образом:

source: Up to Linux 2.6.32: I<131072\ /\ sizeof(void\ *)>
ru: До Linux 2.6.32: I<131072\ /\ sizeof(void\ *)>

source: Linux 2.6.33 to 3.4: I<(32768\ *\ sizeof(void\ *) / 4)>
ru: Linux 2.6.33 по 3.4: I<(32768\ *\ sizeof(void\ *) / 4)>

source: Since Linux 3.5: 65,536
ru: Начиная с Linux 3.5: 65536

source: I</proc/sys/fs/mqueue/msgsize_default> (since Linux 3.5)
ru: I</proc/sys/fs/mqueue/msgsize_default> (начиная с Linux 3.5)

source: This file defines the value used for a new queue's I<mq_msgsize> setting when the queue is created with a call to B<mq_open>(3) where I<attr> is specified as NULL. The default value for this file is 8192 (bytes). The minimum and maximum are as for I</proc/sys/fs/mqueue/msgsize_max>. If I<msgsize_default> exceeds I<msgsize_max>, a new queue's default I<mq_msgsize> value is capped to the I<msgsize_max> limit. Up until Linux 2.6.28, the default I<mq_msgsize> was 8192; from Linux 2.6.28 to Linux 3.4, the default was the value defined for the I<msgsize_max> limit.
ru: В данном файле задаётся значение, которое используется для I<mq_msgsize> в создаваемой новой очереди с помощью вызова B<mq_open>(3) со значением I<attr> равным NULL. Значение для этого файла по умолчанию равно 8192 (байты). Минимальное и максимальные значение такие же как для I</proc/sys/fs/mqueue/msgsize_max>. Если I<msgsize_default> превышает I<msgsize_max>, то значение I<mq_msgsize> для новой очереди по умолчанию ограничивается I<msgsize_max>.До Linux 2.6.28 значение I<mq_msgsize> по умолчанию равнялось 8192; с Linux 2.6.28 по Linux 3.4 значение по умолчанию равнялось ограничению I<msgsize_max>.

source: This file can be used to view and change the ceiling on the maximum message size. This value acts as a ceiling on the I<attr-E<gt>mq_msgsize> argument given to B<mq_open>(3). The default value for I<msgsize_max> is 8192 bytes. The minimum value is 128 (8192 in kernels before 2.6.28). The upper limit for I<msgsize_max> has varied across kernel versions:
ru: Данный файл можно использовать для просмотра и изменения максимального размера сообщения. Это значение служит верхним пределом для аргумента I<attr-E<gt>mq_msgsize>, указываемого в B<mq_open>(3). Значение I<msgsize_max> по умолчанию равно 8192 байта. Минимальное значение равно 128 (8192 в ядрах до версии 2.6.28). Верхний предел I<msgsize_max> изменялся в разных версиях ядер следующим образом:

source: Before Linux 2.6.28, the upper limit is B<INT_MAX>.
ru: До Linux 2.6.28 верхний предел был равен B<INT_MAX>.

source: From Linux 2.6.28 to 3.4, the limit is 1,048,576.
ru: С Linux 2.6.28 по 3.4 предел равен 1048576.

source: Since Linux 3.5, the limit is 16,777,216 (B<HARD_MSGSIZEMAX>).
ru: Начиная с Linux 3.5 предел равен 16777216 (B<HARD_MSGSIZEMAX>).

source: The I<msgsize_max> limit is ignored for privileged process (B<CAP_SYS_RESOURCE>), but, since Linux 3.5, the B<HARD_MSGSIZEMAX> ceiling is enforced for privileged processes.
ru: Предел I<msgsize_max> игнорируется для привилегированных процессов (B<CAP_SYS_RESOURCE>), но, начиная с Linux 3.5, накладывается ограничение B<HARD_MSGSIZEMAX>.

source: This file can be used to view and change the system-wide limit on the number of message queues that can be created. The default value for I<queues_max> is 256. No ceiling is imposed on the I<queues_max> limit; privileged processes (B<CAP_SYS_RESOURCE>) can exceed the limit (but see BUGS).
ru: Данный файл можно использовать для просмотра и изменения системного ограничения на количество сообщений в очереди. Значение I<queues_max> по умолчанию равно 256. У I<queues_max> нет верхнего предела; привилегированные процессы (B<CAP_SYS_RESOURCE>) могут превышать ограничение (но смотрите ДЕФЕКТЫ).

source: Resource limit
ru: Ограничение ресурса

source: The B<RLIMIT_MSGQUEUE> resource limit, which places a limit on the amount of space that can be consumed by all of the message queues belonging to a process's real user ID, is described in B<getrlimit>(2).
ru: Ограничение ресурса B<RLIMIT_MSGQUEUE>, накладываемое на количество пространства, которое могут занять все очереди сообщений, принадлежащие процессу с реальным пользовательским ID, описано в B<getrlimit>(2).

source: Mounting the message queue filesystem
ru: Монтирование файловой системы очереди сообщений

source: On Linux, message queues are created in a virtual filesystem. (Other implementations may also provide such a feature, but the details are likely to differ.) This filesystem can be mounted (by the superuser) using the following commands:
ru: В Linux очереди сообщений создаются в виртуальной файловой системе (другие реализации могут делать также, но, вероятно, по-другому). Данная файловая система может быть смонтирована (суперпользователем) с помощью команд:

source: The sticky bit is automatically enabled on the mount directory.
ru: Закрепляющий бит устанавливается на каталог назначения автоматически.

source: After the filesystem has been mounted, the message queues on the system can be viewed and manipulated using the commands usually used for files (e.g., B<ls>(1) and B<rm>(1)).
ru: После примонтирования файловой системы очередь сообщений в системе можно просматривать и изменять с помощью команд как с обычными файлами (например, B<ls>(1) и B<rm>(1)).

source: The contents of each file in the directory consist of a single line containing information about the queue:
ru: Содержимое каждого файла в каталоге состоит из одной строки, в которой представлена информация об очереди:

source: These fields are as follows:
ru: Эти поля означают следующее:

source: Number of bytes of data in all messages in the queue (but see BUGS).
ru: Количество байтов данных во всех сообщениях очереди (но смотрите ДЕФЕКТЫ).

source: If this is nonzero, then the process with this PID has used B<mq_notify>(3) to register for asynchronous message notification, and the remaining fields describe how notification occurs.
ru: Если это значение не равно нулю, то процесс с данным PID использовал B<mq_notify>(3) для регистрации асинхронных уведомлений о сообщениях, а оставшиеся поля описывают как производится уведомление.

source: Notification method: 0 is B<SIGEV_SIGNAL>; 1 is B<SIGEV_NONE>; and 2 is B<SIGEV_THREAD>.
ru: Способ уведомления: 0 — B<SIGEV_SIGNAL>; 1 — B<SIGEV_NONE>; 2 — B<SIGEV_THREAD>.

source: Signal number to be used for B<SIGEV_SIGNAL>.
ru: Номер сигнала, который будет использован для B<SIGEV_SIGNAL>.

source: Linux implementation of message queue descriptors
ru: Реализация дескрипторов очереди сообщений в Linux

source: On Linux, a message queue descriptor is actually a file descriptor. (POSIX does not require such an implementation.) This means that a message queue descriptor can be monitored using B<select>(2), B<poll>(2), or B<epoll>(7). This is not portable.
ru: В Linux дескриптор очереди сообщений представляет собой файловый дескриптор (в POSIX не требуется этого от реализации). Это означает, что за дескриптором очереди сообщений можно следить с помощью B<select>(2), B<poll>(2) или B<epoll>(7). Это является непереносимым свойством.

source: The close-on-exec flag (see B<open>(2)) is automatically set on the file descriptor returned by B<mq_open>(2).
ru: Флаг close-on-exec (смотрите B<open>(2)) устанавливается автоматически на файловом дескрипторе, возвращаемом B<mq_open>(2).

source: IPC namespaces
ru: Пространства имён IPC

source: For a discussion of the interaction of System V IPC objects and IPC namespaces, see B<namespaces>(7).
ru: Обсуждение связи объектов System V IPC с пространствами IPC смотрите в B<namespaces>(7).

source: System V message queues (B<msgget>(2), B<msgsnd>(2), B<msgrcv>(2), etc.) are an older API for exchanging messages between processes. POSIX message queues provide a better designed interface than System V message queues; on the other hand POSIX message queues are less widely available (especially on older systems) than System V message queues.
ru: Очереди сообщений System V (B<msgget>(2), B<msgsnd>(2), B<msgrcv>(2) и т. д.) — более старый программный интерфейс обмена сообщениями между процессами. Очереди сообщений POSIX имеют более проработанный интерфейс чем очереди сообщений System V; с другой стороны, очереди сообщений POSIX не так широко распространены (особенно в старых системах) чем очереди сообщений System V.

source: Linux does not currently (2.6.26) support the use of access control lists (ACLs) for POSIX message queues.
ru: В Linux (версия 2.6.26) пока нет поддержки использования списков контроля доступа (ACL) для очередей сообщений POSIX.

source: In Linux versions 3.5 to 3.14, the kernel imposed a ceiling of 1024 (B<HARD_QUEUESMAX>) on the value to which the I<queues_max> limit could be raised, and the ceiling was enforced even for privileged processes. This ceiling value was removed in Linux 3.14, and patches to stable kernels 3.5.x to 3.13.x also removed the ceiling.
ru: В Linux версиях с 3.5 по 3.14 ядро устанавливает верхний предел в 1024 (B<HARD_QUEUESMAX>) на значение ограничения I<queues_max> и это влияет даже на привилегированные процессы. Это предельное значение было удалено в Linux 3.14, а также есть заплаты к стабильным ядрам версий с 3.5.x по 3.13.x для удаления этого предела.

source: As originally implemented (and documented), the QSIZE field displayed the total number of (user-supplied) bytes in all messages in the message queue. Some changes in Linux 3.5 inadvertently changed the behavior, so that this field also included a count of kernel overhead bytes used to store the messages in the queue. This behavioral regression was rectified in Linux 4.2 (and earlier stable kernel series), so that the count once more included just the bytes of user data in messages in the queue.
ru: Первоначально реализованное (и описанное) поле QSIZE показывало общее количество (пользовательских) байт всех сообщений в очереди. Некоторые изменения в Linux 3.5 непреднамеренно изменили это поведение, и поле стало также включать байты издержек ядра, которые требуются для хранения сообщений в очереди. Это было исправлено в Linux 4.2 (и более ранних стабильных ядрах), и теперь снова считаются байты только пользовательских сообщений в очереди.

source: An example of the use of various message queue functions is shown in B<mq_notify>(3).
ru: Пример использования функций работы с очередью сообщений смотрите в B<mq_notify>(3).

source: Linux User's Manual
ru: Руководство пользователя Linux

source: mailaddr - mail addressing description
ru: mailaddr - описание формата почтового адреса

source: This manual page gives a brief introduction to SMTP mail addresses, as used on the Internet. These addresses are in the general format
ru: В этой странице кратко описываются почтовые адреса SMTP, используемые в Интернете. Общий формат этих адресов:

source: user@domain
ru: пользователь@домен

source: where a domain is a hierarchical dot-separated list of subdomains. These examples are valid forms of the same address:
ru: где «домен» это иерархический список поддоменов, разделённых точками. Примеры корректных записей одного адреса:

source: The domain part ("monet.example.com") is a mail-accepting domain. It can be a host and in the past it usually was, but it doesn't have to be. The domain part is not case sensitive.
ru: Доменная часть («monet.example.com») является доменом, который принимает почту. Это может быть узел (и в прошлом, обычно, это так и было), а может и нет. В доменной части не учитывает регистр букв.

source: The local part ("john.doe") is often a username, but its meaning is defined by the local software. Sometimes it is case sensitive, although that is unusual. If you see a local-part that looks like garbage, it is usually because of a gateway between an internal e-mail system and the net, here are some examples:
ru: Локальная часть («john.doe») — это, часто, имя пользователя, но точное значение определяется локальным программным обеспечением. Иногда, здесь важен регистр букв, хотя это необычно. Если вы видите, что локальная часть выглядит бессмысленно, то, обычно,это из-за того, что существует шлюз между внутренней почтовой системой электронной почты и сетью, примеры:

source: (These are, respectively, an X.400 gateway, a gateway to an arbitrary internal mail system that lacks proper internet support, an UUCP gateway, and the last one is just boring username policy.)
ru: (здесь показан, соответственно, шлюз X.400, шлюз в произвольную внутреннюю почтовую систему без поддержки Интернета, шлюз UUCP и перенаправляющая пользователям политика).

source: The real-name part ("John Doe") can either be placed before E<lt>E<gt>, or in () at the end. (Strictly speaking the two aren't the same, but the difference is beyond the scope of this page.) The name may have to be quoted using "", for example, if it contains ".":
ru: Часть настоящего имени («John Doe») может указываться перед E<lt>E<gt> или в конце в () (строго говоря, такое размещение неравнозначно, но описание отличий лежит за границами этой страницы). Имя может быть заключено в "", например, если содержит «.»:

source: Abbreviation
ru: Сокращение

source: Some mail systems let users abbreviate the domain name. For instance, users at example.com may get away with "john.doe@monet" to send mail to John Doe. I<This behavior is deprecated.> Sometimes it works, but you should not depend on it.
ru: Некоторые почтовые системы позволяют пользователям не указывать доменное имя. Например, пользователи в example.com могут указать «john.doe@monet», чтобы отправить письмо John Doe. I<Так делать не рекомендуется.> Иногда это работает, но вы не должны на это полагаться.

source: In the past, sometimes one had to route a message through several hosts to get it to its final destination. Addresses which show these relays are termed "route-addrs". These use the syntax:
ru: В прошлом, иногда было нужно перенаправлять сообщение через несколько узлов, чтобы оно дошло до назначения. Адреса, в которых задаются ретрансляторы, называются «route-addrs». Для них используется синтаксис:

source: E<lt>@hosta,@hostb:user@hostcE<gt>
ru: E<lt>@узелА,@узелБ:пользователь@узелВE<gt>

source: This specifies that the message should be sent to hosta, from there to hostb, and finally to hostc. Many hosts disregard route-addrs and send directly to hostc.
ru: Здесь указывается, что сообщение должно быть послано узлуА, потом узлуБ и, наконец узлуВ. Многие узлы игнорируют route-addrs и посылают сообщение напрямую узлуВ.
