Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: msync - synchronize a file with a memory map
ru: msync - синхронизирует содержимое файла с его отображением в памяти

source: B<msync>() flushes changes made to the in-core copy of a file that was mapped into memory using B<mmap>(2) back to the filesystem. Without use of this call, there is no guarantee that changes are written back before B<munmap>(2) is called. To be more precise, the part of the file that corresponds to the memory area starting at I<addr> and having length I<length> is updated.
ru: Вызов B<msync>() сбрасывает изменения файла, который отображён в память с помощью B<mmap>(2), обратно в файловую систему. Без использования этого вызова нет никакой гарантии, что изменения будут записаны в файл до вызова B<munmap>(2). Если быть точнее, то на диск записывается часть файла, начинающаяся в памяти с адреса I<addr> длиной I<length>.

source: The I<flags> argument should specify exactly one of B<MS_ASYNC> and B<MS_SYNC>, and may additionally include the B<MS_INVALIDATE> bit. These bits have the following meanings:
ru: В аргументе I<flags> должен быть один из флагов B<MS_ASYNC> и B<MS_SYNC>, а также дополнительно можно указать B<MS_INVALIDATE>. Данные биты имеют следующее значение:

source: Specifies that an update be scheduled, but the call returns immediately.
ru: Запланировать обновление, но вызов завершается сразу.

source: Requests an update and waits for it to complete.
ru: Запланировать обновление и ждать его завершения.

source: Asks to invalidate other mappings of the same file (so that they can be updated with the fresh values just written).
ru: Считать недействительными другие отображения того же файла (для того, чтобы они могли обновиться до достоверных значений, которые запишутся).

source: B<MS_INVALIDATE> was specified in I<flags>, and a memory lock exists for the specified address range.
ru: В I<flags> указан B<MS_INVALIDATE>, но на указанный адресный диапазон есть блокировка в памяти.

source: I<addr> is not a multiple of PAGESIZE; or any bit other than B<MS_ASYNC> | B<MS_INVALIDATE> | B<MS_SYNC> is set in I<flags>; or both B<MS_SYNC> and B<MS_ASYNC> are set in I<flags>.
ru: Значение I<addr> не кратно PAGESIZE; в I<flags> установлен любой другой бит, отличный от B<MS_ASYNC> | B<MS_INVALIDATE> | B<MS_SYNC>; в I<flags> установлены сразу B<MS_SYNC> и B<MS_ASYNC>.

source: The indicated memory (or part of it) was not mapped.
ru: Указанная память (или её часть) не была отображена.

source: This call was introduced in Linux 1.3.21, and then used B<EFAULT> instead of B<ENOMEM>. In Linux 2.4.19, this was changed to the POSIX value B<ENOMEM>.
ru: Этот вызов появился в Linux 1.3.21, и в нём использовалось B<EFAULT> вместо B<ENOMEM>. В Linux 2.4.19 это было изменено на значение POSIX B<ENOMEM>.

source: On POSIX systems on which B<msync>() is available, both B<_POSIX_MAPPED_FILES> and B<_POSIX_SYNCHRONIZED_IO> are defined in I<E<lt>unistd.hE<gt>> to a value greater than 0. (See also B<sysconf>(3).)
ru: В системах POSIX, в которых доступен B<msync>(), значения B<_POSIX_MAPPED_FILES> и B<_POSIX_SYNCHRONIZED_IO>, определённые в I<E<lt>unistd.hE<gt>>, больше нуля. (См. также B<sysconf>(3).)

source: According to POSIX, either B<MS_SYNC> or B<MS_ASYNC> must be specified in I<flags>, and indeed failure to include one of these flags will cause B<msync>() to fail on some systems. However, Linux permits a call to B<msync>() that specifies neither of these flags, with semantics that are (currently) equivalent to specifying B<MS_ASYNC>. (Since Linux 2.6.19, B<MS_ASYNC> is in fact a no-op, since the kernel properly tracks dirty pages and flushes them to storage as necessary.) Notwithstanding the Linux behavior, portable, future-proof applications should ensure that they specify either B<MS_SYNC> or B<MS_ASYNC> in I<flags>.
ru: Согласно POSIX, в I<flags> должен быть указан или B<MS_SYNC>, или B<MS_ASYNC> и отказ включить один из этих флагов вызывает ошибку в B<msync>() на некоторых системах. Однако Linux позволяет вызывать B<msync>() без этих флагов, используя семантику, которая (в настоящее время) эквивалентна указанию B<MS_ASYNC> (начиная с Linux 2.6.19, B<MS_ASYNC>, фактически, ничего не делает, так как ядро правильно отслеживает грязные страницы и записывает их в место хранения при необходимости). Несмотря на поведение Linux, в переносимых, ориентированных на будущее приложениях в I<flags> должен быть указан или B<MS_SYNC>, или B<MS_ASYNC>.

source: migrate_pages - move all pages in a process to another set of nodes
ru: migrate_pages - переносит все страницы процесса на другой набор узлов

source: B<migrate_pages>() attempts to move all pages of the process I<pid> that are in memory nodes I<old_nodes> to the memory nodes in I<new_nodes>. Pages not located in any node in I<old_nodes> will not be migrated. As far as possible, the kernel maintains the relative topology relationship inside I<old_nodes> during the migration to I<new_nodes>.
ru: Вызов B<migrate_pages>() пытается перенести все страницы процесса с идентификатором I<pid>, находящиеся в памяти узлов I<old_nodes>, в память узлов I<new_nodes>. Страницы, не расположенные в узлах I<old_nodes>, не переносятся. При переносе на I<new_nodes> ядро в максимально возможной степени поддерживает относительную топологию связи внутри I<old_nodes>.

source: The I<old_nodes> and I<new_nodes> arguments are pointers to bit masks of node numbers, with up to I<maxnode> bits in each mask. These masks are maintained as arrays of unsigned I<long> integers (in the last I<long> integer, the bits beyond those specified by I<maxnode> are ignored). The I<maxnode> argument is the maximum node number in the bit mask plus one (this is the same as in B<mbind>(2), but different from B<select>(2)).
ru: Аргументы I<old_nodes> и I<new_nodes> представляют собой указатели на маски битов номеров узлов, до I<maxnode> в каждой маске. Эти маски обрабатываются как массивы беззнаковых целых I<long> (в последнем целом I<long> биты, лежащие за пределом I<maxnode>, игнорируются). Аргумент I<maxnode> представляет собой максимальный номер узла в битовой маске плюс 1 (также как в B<mbind>(2), но отличается от B<select>(2)).

source: The I<pid> argument is the ID of the process whose pages are to be moved. To move pages in another process, the caller must be privileged (B<CAP_SYS_NICE>) or the real or effective user ID of the calling process must match the real or saved-set user ID of the target process. If I<pid> is 0, then B<migrate_pages>() moves pages of the calling process.
ru: В аргументе I<pid> задаётся идентификатор процесса, чьи страницы будут перемещаться. Чтобы перемещать страницы не своего процесса, вызывающий должен быть привилегированным (B<CAP_SYS_NICE>) или реальный или эффективный ID пользователя вызывающего процесса должен совпадать с реальным или сохранённым ID пользователя процесса назначения. Если I<pid> равен 0, то B<migrate_pages>() перемещает страницы вызвавшего процесса.

source: Pages shared with another process will be moved only if the initiating process has the B<CAP_SYS_NICE> privilege.
ru: Совместно используемые с другими процессами страницы будут перемещаться только, если первоначальный процесс имеет мандат B<CAP_SYS_NICE>.

source: On success B<migrate_pages>() returns the number of pages that could not be moved (i.e., a return of zero means that all pages were successfully moved). On error, it returns -1, and sets I<errno> to indicate the error.
ru: При нормальном завершении работы B<migrate_pages>() возвращает количество неперемещённых страниц (то есть, ноль означает, что все страницы успешно перемещены). В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Part or all of the memory range specified by I<old_nodes>/I<new_nodes> and I<maxnode> points outside your accessible address space.
ru: Часть или весь диапазон памяти, заданный в I<old_nodes>/I<new_nodes> и I<maxnode>, указывает за пределы доступного адресного пространства.

source: The value specified by I<maxnode> exceeds a kernel-imposed limit. Or, I<old_nodes> or I<new_nodes> specifies one or more node IDs that are greater than the maximum supported node ID. Or, none of the node IDs specified by I<new_nodes> are on-line and allowed by the process's current cpuset context, or none of the specified nodes contain memory.
ru: Значение I<maxnode> превышает введённое ядром ограничение. В I<old_nodes> или I<new_nodes> задан один или более ID узлов, превышающих поддерживаемый максимальный ID узла. Или ни один из ID узлов, указанных в I<new_nodes>, включен и доступен из контекста текущего набора процессоров процесса, или ни один из узлов не содержит память.

source: Insufficient privilege (B<CAP_SYS_NICE>) to move pages of the process specified by I<pid>, or insufficient privilege (B<CAP_SYS_NICE>) to access the specified target nodes.
ru: Недостаточно прав (B<CAP_SYS_NICE>) для перемещения страниц процесса, заданного I<pid>, или недостаточно прав (B<CAP_SYS_NICE>) для доступа к указанным узлам назначения.

source: No process matching I<pid> could be found.
ru: Не найден процесс с указанным I<pid>.

source: The B<migrate_pages>() system call first appeared on Linux in version 2.6.16.
ru: Вызов B<migrate_pages>() впервые появился в Linux в ядре версии 2.6.16.

source: Use B<get_mempolicy>(2) with the B<MPOL_F_MEMS_ALLOWED> flag to obtain the set of nodes that are allowed by the calling process's cpuset. Note that this information is subject to change at any time by manual or automatic reconfiguration of the cpuset.
ru: Используйте B<get_mempolicy>(2) с флагом B<MPOL_F_MEMS_ALLOWED> для получения набора узлов, которые доступны в наборе ЦП вызывающему процессу. Заметим, что эта информация может измениться в любое время вручную или при автоматической перенастройке набора ЦП.

source: Use of B<migrate_pages>() may result in pages whose location (node) violates the memory policy established for the specified addresses (see B<mbind>(2)) and/or the specified process (see B<set_mempolicy>(2)). That is, memory policy does not constrain the destination nodes used by B<migrate_pages>().
ru: Использование B<migrate_pages>() может привести к тому, что расположение страниц (на узле) нарушит политику памяти, установленную для заданных адресов (см. B<mbind>(2)) и/или заданного процесса (см. B<set_mempolicy>(2)). То есть политика памяти не ограничивает узлы назначения, используемые B<migrate_pages>().

source: I<Documentation/vm/page_migration.rst> in the Linux kernel source tree
ru: Файл I<Documentation/vm/page_migration.rst> в дереве исходного кода ядра Linux

source: mmap2 - map files or devices into memory
ru: mmap2 - отображает файлы или устройства в память

source: This is probably not the system call that you are interested in; instead, see B<mmap>(2), which describes the glibc wrapper function that invokes this system call.
ru: Вероятно, вам нужен не сам системный вызов; смотрите B<mmap>(2), описывающую обёрточную функцию glibc, которая вызывает данный системный вызов.

source: The B<mmap2>() system call provides the same interface as B<mmap>(2), except that the final argument specifies the offset into the file in 4096-byte units (instead of bytes, as is done by B<mmap>(2)). This enables applications that use a 32-bit I<off_t> to map large files (up to 2^44 bytes).
ru: Системный вызов B<mmap2>() предоставляет тот же интерфейс что и B<mmap>(2), за исключением того, что последний аргумент задаёт смещение в файле в 4096-байтовых единицах (вместо байт, как это делается в B<mmap>(2)). Это позволяет приложениям использовать 32-битное значение I<off_t> для отображения больших файлов (до 2^44 байт).

source: On success, B<mmap2>() returns a pointer to the mapped area. On error, -1 is returned and I<errno> is set appropriately.
ru: При удачном завершении B<mmap2>() возвращает указатель на область отображения. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Problem with getting the data from user space.
ru: Проблема получения данных из пользовательского пространства.

source: (Various platforms where the page size is not 4096 bytes.) I<offset\ *\ 4096> is not a multiple of the system page size.
ru: (Различные платформы, где размер страницы не равен 4096 байтам.) Значение I<offset\ *\ 4096> не кратно размеру страницы системы.

source: B<mmap2>() can also return any of the errors described in B<mmap>(2).
ru: Вызов B<mmap2>() также может вернуть любую ошибку из описанных в B<mmap>(2).

source: B<mmap2>() is available since Linux 2.3.31.
ru: Вызов B<mmap2>() доступен начиная с Linux 2.3.31.

source: On architectures where this system call is present, the glibc B<mmap>() wrapper function invokes this system call rather than the B<mmap>(2) system call.
ru: На архитектурах, имеющих данный системный вызов, обёрточная функция glibc B<mmap>() вызывает данный системный вызов вместо системного вызова B<mmap>(2).

source: This system call does not exist on x86-64.
ru: Этот системный вызов отсутствует на x86-64.

source: On ia64, the unit for I<offset> is actually the system page size, rather than 4096 bytes.
ru: На ia64 единица I<offset> на самом деле имеет размер страницы системы, а не равна 4096 байтам.

source: mlock, mlock2, munlock, mlockall, munlockall - lock and unlock memory
ru: mlock, mlock2, munlock, mlockall, munlockall - блокируют и разблокируют память

source: B<mlock>(), B<mlock2>(), and B<mlockall>() lock part or all of the calling process's virtual address space into RAM, preventing that memory from being paged to the swap area.
ru: Вызовы B<mlock>(), B<mlock2>() и B<mlockall>() блокируют часть или всё виртуальное адресное пространство процесса в ОЗУ, запрещая эту память перемещать в пространство подкачки.

source: B<munlock>() and B<munlockall>() perform the converse operation, unlocking part or all of the calling process's virtual address space, so that pages in the specified virtual address range may once more to be swapped out if required by the kernel memory manager.
ru: Вызовы B<munlock>() и B<munlockall>() выполняют обратную операцию, разблокируя часть или всё виртуальное адресное пространство процесса, после чего страницы в этом диапазоне виртуальных адресов могут вытесняться в пространство подкачки, если того потребуется менеджеру памяти ядра.

source: Memory locking and unlocking are performed in units of whole pages.
ru: Размер блокировки и разблокировки памяти округляется до целых страниц.

source: mlock(), mlock2(), and munlock()
ru: mlock(), mlock2() и munlock()

source: B<mlock>() locks pages in the address range starting at I<addr> and continuing for I<len> bytes. All pages that contain a part of the specified address range are guaranteed to be resident in RAM when the call returns successfully; the pages are guaranteed to stay in RAM until later unlocked.
ru: Вызов B<mlock>() блокирует страницы в адресном диапазоне, начиная с I<addr> и длиной I<len> байтов. Все страницы, попадающие, даже частично, в заданную область, будут гарантировано помещены в ОЗУ, если системный вызов выполнился успешно; страницы гарантировано останутся в ОЗУ пока не будут разблокированы.

source: B<mlock2>() also locks pages in the specified range starting at I<addr> and continuing for I<len> bytes. However, the state of the pages contained in that range after the call returns successfully will depend on the value in the I<flags> argument.
ru: Вызов B<mlock2>() также блокирует страницы в адресном диапазоне, начиная с I<addr> и длиной I<len> байтов. Однако состояние страниц в этом диапазоне после успешного выполнения вызова будет зависеть от значения аргумента I<flags>.

source: The I<flags> argument can be either 0 or the following constant:
ru: Параметр I<flags> может принимать значение 0 или одну из следующих констант:

source: Lock pages that are currently resident and mark the entire range so that the remaining nonresident pages are locked when they are populated by a page fault.
ru: Блокировать страницы, которые в настоящее время уже есть в памяти и пометить весь диапазон так, чтобы оставшиеся вне памяти страницы блокировались, когда они будут заполнены из-за страничного промаха (fault).

source: If I<flags> is 0, B<mlock2>() behaves exactly the same as B<mlock>().
ru: Если параметр I<flags> равен 0, то B<mlock2>() ведёт себя точно так же как B<mlock>().

source: B<munlock>() unlocks pages in the address range starting at I<addr> and continuing for I<len> bytes. After this call, all pages that contain a part of the specified memory range can be moved to external swap space again by the kernel.
ru: Вызов B<munlock>() разблокирует страницы в области, начинающейся с адреса I<addr> и длиной I<len> байтов. После этого вызова все страницы, попадающие, даже частично, в заданную область, снова могут быть помещены ядром во внешнее пространство подкачки.

source: mlockall() and munlockall()
ru: mlockall() и munlockall()

source: B<mlockall>() locks all pages mapped into the address space of the calling process. This includes the pages of the code, data and stack segment, as well as shared libraries, user space kernel data, shared memory, and memory-mapped files. All mapped pages are guaranteed to be resident in RAM when the call returns successfully; the pages are guaranteed to stay in RAM until later unlocked.
ru: Вызов B<mlockall>() блокирует все страницы, отображённые в адресное пространство вызывающего процесса. Сюда входят страницы сегмента кода, данных и стека, а также общих библиотек, страницы с данными пользовательского пространства ядра, общей памяти и файлов, отображённых в память. Все отображённые страницы гарантировано останутся в ОЗУ, если системный вызов выполнился успешно; страницы гарантировано останутся в ОЗУ пока не будут разблокированы.

source: The I<flags> argument is constructed as the bitwise OR of one or more of the following constants:
ru: Аргумент I<flags> создаётся побитовым сложением одной или более следующих констант:

source: Lock all pages which are currently mapped into the address space of the process.
ru: Блокировать все страницы, которые в данный момент отображены в адресное пространство процесса.

source: Lock all pages which will become mapped into the address space of the process in the future. These could be, for instance, new pages required by a growing heap and stack as well as new memory-mapped files or shared memory regions.
ru: Блокировать все страницы, которые будут отображены в адресное пространство процесса в будущем. Это могут быть, например, новые страницы, затребованные для увеличения кучи и стека, а также новые отображённые в память файлы или области общей памяти.

source: B<MCL_ONFAULT> (since Linux 4.4)
ru: B<MCL_ONFAULT> (начиная с Linux 4.4)

source: Used together with B<MCL_CURRENT>, B<MCL_FUTURE>, or both. Mark all current (with B<MCL_CURRENT>) or future (with B<MCL_FUTURE>) mappings to lock pages when they are faulted in. When used with B<MCL_CURRENT>, all present pages are locked, but B<mlockall>() will not fault in non-present pages. When used with B<MCL_FUTURE>, all future mappings will be marked to lock pages when they are faulted in, but they will not be populated by the lock when the mapping is created. B<MCL_ONFAULT> must be used with either B<MCL_CURRENT> or B<MCL_FUTURE> or both.
ru: Используется вместе с B<MCL_CURRENT>, B<MCL_FUTURE> или обоими. Пометить все текущие (с B<MCL_CURRENT>) или будущие (с B<MCL_FUTURE>) отображения для блокировки страниц, когда они получаются при сбое (faulted in). При использовании с B<MCL_CURRENT> все существующие страницы блокируются, но B<mlockall>() не будет сбоить на несуществующих страницах. При использовании с B<MCL_FUTURE> все будущие отображения будут помечены для блокировки страниц при сбое, но они не будут заполнены из-за блокировки при создании отображения. Флаг B<MCL_ONFAULT> должен использовать одновременно с B<MCL_CURRENT> или B<MCL_FUTURE> или обоими.

source: If B<MCL_FUTURE> has been specified, then a later system call (e.g., B<mmap>(2), B<sbrk>(2), B<malloc>(3)), may fail if it would cause the number of locked bytes to exceed the permitted maximum (see below). In the same circumstances, stack growth may likewise fail: the kernel will deny stack expansion and deliver a B<SIGSEGV> signal to the process.
ru: Если указан флаг B<MCL_FUTURE>, то последующий системный вызов (например, B<mmap>(2), B<sbrk>(2), B<malloc>(3)), может завершиться с ошибкой, если бы его работа приводит к превышению разрешённого максимального числа блокируемых байт (см. ниже). Также этот флаг может остановить увеличение стека: ядро будет отказывать в увеличении стека и будет посылать процессу сигнал B<SIGSEGV>.

source: B<munlockall>() unlocks all pages mapped into the address space of the calling process.
ru: Вызов B<munlockall>() разблокирует все страницы, отображённые в адресное пространство вызывающего процесса.

source: On success, these system calls return 0. On error, -1 is returned, I<errno> is set appropriately, and no changes are made to any locks in the address space of the process.
ru: При успешном выполнении эти системные вызовы возвращают 0. При ошибке возвращается -1, устанавливается соответствующий код ошибки в I<errno>, и никакие блокировки не изменяются в адресном пространстве процесса.

source: (Linux 2.6.9 and later) the caller had a nonzero B<RLIMIT_MEMLOCK> soft resource limit, but tried to lock more memory than the limit permitted. This limit is not enforced if the process is privileged (B<CAP_IPC_LOCK>).
ru: (Linux 2.6.9 и новее) У вызывающего процесса установлено ненулевое мягкое ограничение ресурса B<RLIMIT_MEMLOCK>, но он пытается заблокировать больше памяти, чем это разрешено ограничением. Данное ограничение не учитывается у привилегированных процессов (B<CAP_IPC_LOCK>).

source: (Linux 2.4 and earlier) the calling process tried to lock more than half of RAM.
ru: (Linux 2.4 и в более ранних) Вызывающий процесс пытается заблокировать более половины ОЗУ.

source: The caller is not privileged, but needs privilege (B<CAP_IPC_LOCK>) to perform the requested operation.
ru: Вызывающий не имеет прав (B<CAP_IPC_LOCK>) для выполнения запрошенной операции.

source: For B<mlock>(), B<mlock2>(), and B<munlock>():
ru: Для B<mlock>(), B<mlock2>(), и B<munlock>():

source: Some or all of the specified address range could not be locked.
ru: Невозможно заблокировать некоторую часть или весь диапазон адресов.

source: The result of the addition I<addr>+I<len> was less than I<addr> (e.g., the addition may have resulted in an overflow).
ru: Результат добавления I<addr>+I<len> стал меньше чем I<addr> (например, добавление могло привести к переполнению).

source: (Not on Linux) I<addr> was not a multiple of the page size.
ru: (Не в Linux) Значение I<addr> не кратно размеру страницы.

source: Some of the specified address range does not correspond to mapped pages in the address space of the process.
ru: Часть указанного адресного диапазона не соответствует отображённым страницам адресного пространства процесса.

source: Locking or unlocking a region would result in the total number of mappings with distinct attributes (e.g., locked versus unlocked) exceeding the allowed maximum. (For example, unlocking a range in the middle of a currently locked mapping would result in three mappings: two locked mappings at each end and an unlocked mapping in the middle.)
ru: Блокировка и разблокировка области привела бы к превышению разрешённого максимума на количество отображений с различающимися атрибутами (блокированных и разблокированных). Например, разблокировка диапазона в середине области в данный момент блокированного отображения привела бы к трём отображениям: два блокированных отображения на концах и доступное разблокированное отображение посередине.

source: Unknown I<flags> were specified.
ru: Указан неизвестный флаг в I<flags>.

source: For B<mlockall>():
ru: У B<mlockall>():
