Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Poison the pages in the range specified by I<addr> and I<length> and handle subsequent references to those pages like a hardware memory corruption. This operation is available only for privileged (B<CAP_SYS_ADMIN>) processes. This operation may result in the calling process receiving a B<SIGBUS> and the page being unmapped.
ru: Испортить страницы в диапазоне, заданном I<addr> и I<length>, и обрабатывать последующие ссылки на эти страницы как при аппаратном повреждении памяти. Данная операция доступна только для привилегированных (B<CAP_SYS_ADMIN>) процессов. Она может привести к тому, что вызывающий процесс получит B<SIGBUS> и отображение страницы удалится.

source: This feature is intended for testing of memory error-handling code; it is available only if the kernel was configured with B<CONFIG_MEMORY_FAILURE>.
ru: Это свойство предназначено для тестирования кода обработки ошибок памяти; оно доступно только, если ядро было собрано с параметром B<CONFIG_MEMORY_FAILURE>.

source: B<MADV_MERGEABLE> (since Linux 2.6.32)
ru: B<MADV_MERGEABLE> (начиная с Linux 2.6.32)

source: Enable Kernel Samepage Merging (KSM) for the pages in the range specified by I<addr> and I<length>. The kernel regularly scans those areas of user memory that have been marked as mergeable, looking for pages with identical content. These are replaced by a single write-protected page (which is automatically copied if a process later wants to update the content of the page). KSM merges only private anonymous pages (see B<mmap>(2)).
ru: Включает слияние одинаковых страниц ядра (Kernel Samepage Merging, KSM) для страниц в диапазоне, указанном I<addr> и I<length>. Ядро периодически сканирует области пользовательской памяти, которые были помечены для слияния, разыскивая станицы с одинаковым содержимым. Такие страницы заменяются единственной страницей, защищённой от записи (которая автоматически копируется, если позднее процесс захочет изменить содержимое страницы). При KSM слияние выполняется только для частных анонимных страниц (смотрите B<mmap>(2)).

source: The KSM feature is intended for applications that generate many instances of the same data (e.g., virtualization systems such as KVM). It can consume a lot of processing power; use with care. See the Linux kernel source file I<Documentation/admin-guide/mm/ksm.rst> for more details.
ru: Возможность KSM предназначена для приложений, которые генерируют много экземпляров одинаковых данных (например, для систем виртуализации, таких как KVM). Эта возможность может нагрузить процессор; используйте осторожно. Дополнительную информацию можно найти в файле исходного кода ядра I<Documentation/admin-guide/mm/ksm.rst>.

source: The B<MADV_MERGEABLE> and B<MADV_UNMERGEABLE> operations are available only if the kernel was configured with B<CONFIG_KSM>.
ru: Операции B<MADV_MERGEABLE> и B<MADV_UNMERGEABLE> доступны только, если ядро собрано с параметром B<CONFIG_KSM>.

source: B<MADV_UNMERGEABLE> (since Linux 2.6.32)
ru: B<MADV_UNMERGEABLE> (начиная с Linux 2.6.32)

source: Undo the effect of an earlier B<MADV_MERGEABLE> operation on the specified address range; KSM unmerges whatever pages it had merged in the address range specified by I<addr> and I<length>.
ru: Отменить действие ранее применённой операции B<MADV_MERGEABLE> для указанного диапазона; KSM разделяет ранее объединённые страницы в диапазоне, заданном I<addr> и I<length>.

source: B<MADV_SOFT_OFFLINE> (since Linux 2.6.33)
ru: B<MADV_SOFT_OFFLINE> (начиная с Linux 2.6.33)

source: Soft offline the pages in the range specified by I<addr> and I<length>. The memory of each page in the specified range is preserved (i.e., when next accessed, the same content will be visible, but in a new physical page frame), and the original page is offlined (i.e., no longer used, and taken out of normal memory management). The effect of the B<MADV_SOFT_OFFLINE> operation is invisible to (i.e., does not change the semantics of) the calling process.
ru: Программно отключить страницы в диапазоне, указанном I<addr> и I<length>. Память каждой страницы в указанном диапазоне сохраняется (т. е., при следующем доступе будет выдано то же содержимое, но в новых физических границах страницы) и первоначальная страница отключается (т. е., больше не используется и не участвует при обычном управлении памятью). Эффект операции B<MADV_SOFT_OFFLINE> обычно незаметен (т. е., не изменяет семантику) для вызывающего процесса.

source: B<MADV_HUGEPAGE> (since Linux 2.6.38)
ru: B<MADV_HUGEPAGE> (начиная с Linux 2.6.38)

source: Enable Transparent Huge Pages (THP) for pages in the range specified by I<addr> and I<length>. Currently, Transparent Huge Pages work only with private anonymous pages (see B<mmap>(2)). The kernel will regularly scan the areas marked as huge page candidates to replace them with huge pages. The kernel will also allocate huge pages directly when the region is naturally aligned to the huge page size (see B<posix_memalign>(2)).
ru: Включает прозрачность огромных страниц (Transparent Huge Pages, THP) для страниц в диапазоне, указанном I<addr> и I<length>. В настоящий момент, THP работает только для закрытых (private) анонимных страниц (смотрите B<mmap>(2)). Ядро будет периодически сканировать области, помеченные как кандидаты в огромные страницы, для замены их огромными страницами. Ядро также будет непосредственно выделять огромные страницы, если область выравнена на аппаратный (naturally) размер огромной страницы при создании (смотрите B<posix_memalign>(2)).

source: This feature is primarily aimed at applications that use large mappings of data and access large regions of that memory at a time (e.g., virtualization systems such as QEMU). It can very easily waste memory (e.g., a 2\ MB mapping that only ever accesses 1 byte will result in 2\ MB of wired memory instead of one 4\ KB page). See the Linux kernel source file I<Documentation/admin-guide/mm/transhuge.rst> for more details.
ru: В основном, эта возможность предназначена для приложений, которые используют большие отображения данных и доступ к большим областям этой памяти за один приём (например, системы виртуализации, такие как QEMU). С её помощью можно очень легко занять память (например, на 2\ МБ отображение, из которого нужен только 1 байт, будет потрачено 2\ МБ реальной памяти вместо одной 4\ КБ страницы). Дополнительную информацию смотрите в файле I<Documentation/admin-guide/mm/transhuge.rst> из исходного кода ядра.

source: The B<MADV_HUGEPAGE> and B<MADV_NOHUGEPAGE> operations are available only if the kernel was configured with B<CONFIG_TRANSPARENT_HUGEPAGE>.
ru: Операции B<MADV_HUGEPAGE> и B<MADV_NOHUGEPAGE> доступны только, если ядро собрано с параметром B<CONFIG_TRANSPARENT_HUGEPAGE>.

source: B<MADV_NOHUGEPAGE> (since Linux 2.6.38)
ru: B<MADV_NOHUGEPAGE> (начиная с Linux 2.6.38)

source: Ensures that memory in the address range specified by I<addr> and I<length> will not be collapsed into huge pages.
ru: Проверить, что память адресного пространства, указанного в I<addr> и I<length>, не будет свёрнута в огромные страницы.

source: B<MADV_DONTDUMP> (since Linux 3.4)
ru: B<MADV_DONTDUMP> (начиная с Linux 3.4)

source: Exclude from a core dump those pages in the range specified by I<addr> and I<length>. This is useful in applications that have large areas of memory that are known not to be useful in a core dump. The effect of B<MADV_DONTDUMP> takes precedence over the bit mask that is set via the I</proc/[pid]/coredump_filter> file (see B<core>(5)).
ru: Исключить из дампа памяти страницы диапазона, задаваемого значениями I<addr> и I<length>. Это полезно в приложениях, которые занимают большие области в памяти, про которые известно, что они ничем не помогут будучи в дампе памяти. Действие B<MADV_DONTDUMP> имеет преимущество над битовой маской, которая устанавливается в файле I</proc/[pid]/coredump_filter> (смотрите B<core>(5)).

source: B<MADV_DODUMP> (since Linux 3.4)
ru: B<MADV_DODUMP> (начиная с Linux 3.4)

source: Undo the effect of an earlier B<MADV_DONTDUMP>.
ru: Отменяет действие, установленное ранее B<MADV_DONTDUMP>.

source: B<MADV_FREE> (since Linux 4.5)
ru: B<MADV_FREE> (начиная с Linux 4.5)

source: The application no longer requires the pages in the range specified by I<addr> and I<len>. The kernel can thus free these pages, but the freeing could be delayed until memory pressure occurs. For each of the pages that has been marked to be freed but has not yet been freed, the free operation will be canceled if the caller writes into the page. After a successful B<MADV_FREE> operation, any stale data (i.e., dirty, unwritten pages) will be lost when the kernel frees the pages. However, subsequent writes to pages in the range will succeed and then kernel cannot free those dirtied pages, so that the caller can always see just written data. If there is no subsequent write, the kernel can free the pages at any time. Once pages in the range have been freed, the caller will see zero-fill-on-demand pages upon subsequent page references.
ru: Приложению больше не требуются страницы в диапазоне, задаваемом I<addr> и I<len>, поэтому ядро может освободить эти страницы, но освобождение может быть отложено до тех пор, пока не понадобится память. Для каждой страницы, помеченной как свободная, но ещё не освобождённая, операция освобождения будет отменена, если вызывающий выполнит запись в эту страницу. После успешного выполнения операции B<MADV_FREE> все повисшие данные (т. е., изменённые (dirty) и не записанные страницы) будут потеряны в момент освобождения страниц ядром. Однако последующая запись в страницы в этом диапазоне будет успешной и поэтому ядро не сможет освободить эти изменённые страницы и вызывающий всегда может видеть только что записанные данные. Если последующей записи не было, то ядро может освободить страницы в любой момент. После освобождения страниц диапазона при последующем доступе вызывающий может видеть страницы заполненные нулями по требованию.

source: The B<MADV_FREE> operation can be applied only to private anonymous pages (see B<mmap>(2)). In Linux before version 4.12, when freeing pages on a swapless system, the pages in the given range are freed instantly, regardless of memory pressure.
ru: Операция B<MADV_FREE> может применяться только при частным анонимным страницам (смотрите B<mmap>(2)). В Linux до версии 4.12 страницы задаваемого диапазона в системе без подкачки освобождаются сразу, независимо от необходимости в памяти.

source: B<MADV_WIPEONFORK> (since Linux 4.14)
ru: B<MADV_WIPEONFORK> (начиная с Linux 4.14)

source: Present the child process with zero-filled memory in this range after a B<fork>(2). This is useful in forking servers in order to ensure that sensitive per-process data (for example, PRNG seeds, cryptographic secrets, and so on) is not handed to child processes.
ru: Выдать дочернему процессу заполненную нулями память в этом диапазоне после B<fork>(2). Это позволяет при ветвлении (forking) серверов стереть важные данные процесса (например, начальные значения PRNG, данные шифрования и т. п.) у дочерних процессов.

source: The B<MADV_WIPEONFORK> operation can be applied only to private anonymous pages (see B<mmap>(2)).
ru: Операция B<MADV_WIPEONFORK> применима только к частным анонимным страницам (смотрите B<mmap>(2)).

source: Within the child created by B<fork>(2), the B<MADV_WIPEONFORK> setting remains in place on the specified address range. This setting is cleared during B<execve>(2).
ru: В потомке, созданном B<fork>(2), значение B<MADV_WIPEONFORK> остаётся у указанного адресного диапазона. Это значение стирается при B<execve>(2).

source: B<MADV_KEEPONFORK> (since Linux 4.14)
ru: B<MADV_KEEPONFORK> (начиная с Linux 4.14)

source: Undo the effect of an earlier B<MADV_WIPEONFORK>.
ru: Отменяет действие, установленное ранее B<MADV_WIPEONFORK>.

source: On success, B<madvise>() returns zero. On error, it returns -1 and I<errno> is set appropriately.
ru: При нормальном завершении работы B<madvise>() возвращает ноль. При ошибке возвращается -1, а переменной I<errno> присваивается соответствующее значение.

source: I<advice> is B<MADV_REMOVE>, but the specified address range is not a shared writable mapping.
ru: В I<advice> указан B<MADV_REMOVE>, но описанный диапазон адресов не является общей памятью с разрешением на записи

source: A kernel resource was temporarily unavailable.
ru: Ресурс ядра временно недоступен.

source: The map exists, but the area maps something that isn't a file.
ru: Отображение существует, то область отображения не является файловой.

source: I<addr> is not page-aligned or I<length> is negative.
ru: Значение параметра I<addr> не выровнено по границе страницы или параметр I<length> содержит отрицательное число.

source: I<advice> is not a valid.
ru: Значение I<advice> недопустимо.

source: I<advice> is B<MADV_DONTNEED> or B<MADV_REMOVE> and the specified address range includes locked, Huge TLB pages, or B<VM_PFNMAP> pages.
ru: Значение I<advice> равно B<MADV_DONTNEED> или B<MADV_REMOVE>, а указанный адресный диапазон включает заблокированные, Huge TLB или B<VM_PFNMAP> страницы.

source: I<advice> is B<MADV_MERGEABLE> or B<MADV_UNMERGEABLE>, but the kernel was not configured with B<CONFIG_KSM>.
ru: Значение I<advice> равно B<MADV_MERGEABLE> или B<MADV_UNMERGEABLE>, но ядро было собрано без параметра B<CONFIG_KSM>.

source: I<advice> is B<MADV_FREE> or B<MADV_WIPEONFORK> but the specified address range includes file, Huge TLB, B<MAP_SHARED>, or B<VM_PFNMAP> ranges.
ru: Значение I<advice> равно B<MADV_FREE> или B<MADV_WIPEONFORK>, но в указанном адресном диапазоне содержится файл, Huge TLB, диапазоны B<MAP_SHARED> или B<VM_PFNMAP>.

source: (for B<MADV_WILLNEED>) Paging in this area would exceed the process's maximum resident set size.
ru: (для B<MADV_WILLNEED>) Выделение страницы в данной области превысило бы максимальный размер постоянно находящихся в памяти страниц для процесса (rss).

source: (for B<MADV_WILLNEED>) Not enough memory: paging in failed.
ru: (для B<MADV_WILLNEED>) Недостаточно памяти: не удалось выделить страницу

source: Addresses in the specified range are not currently mapped, or are outside the address space of the process.
ru: Адреса в указанном диапазоне в настоящее время не отображены, или лежит вне адресного пространства процесса.

source: I<advice> is B<MADV_HWPOISON>, but the caller does not have the B<CAP_SYS_ADMIN> capability.
ru: В переменной I<advice> содержится B<MADV_HWPOISON>, но вызывающий не имеет мандата B<CAP_SYS_ADMIN>.

source: Since Linux 3.18, support for this system call is optional, depending on the setting of the B<CONFIG_ADVISE_SYSCALLS> configuration option.
ru: Начиная с Linux 3.18 поддержка данного системного вызова необязательна, она зависит от того, собрано ли ядро с параметром B<CONFIG_ADVISE_SYSCALLS>.

source: B<madvise>() is not specified by any standards. Versions of this system call, implementing a wide variety of I<advice> values, exist on many other implementations. Other implementations typically implement at least the flags listed above under I<Conventional advice flags>, albeit with some variation in semantics.
ru: Вызов B<madvise>() не включён ни в один стандарт. Версии этого системного вызова, реализующие широкий набор значений I<advice>, существуют во многих других системах. В них, обычно, реализуются, как минимум, флаги перечисленные в I<Стандартные значения предложений>, хотя и с некоторыми различиями в семантике.

source: POSIX.1-2001 describes B<posix_madvise>(3) with constants B<POSIX_MADV_NORMAL>, B<POSIX_MADV_RANDOM>, B<POSIX_MADV_SEQUENTIAL>, B<POSIX_MADV_WILLNEED>, and B<POSIX_MADV_DONTNEED>, and so on, with behavior close to the similarly named flags listed above.
ru: В POSIX-2001 описана функция B<posix_madvise>(3) с константами B<POSIX_MADV_NORMAL>, B<POSIX_MADV_RANDOM>, B<POSIX_MADV_SEQUENTIAL>, B<POSIX_MADV_WILLNEED> и B<POSIX_MADV_DONTNEED>, и т. п., реализующая поведение близкое к флагам с именами, перечисленным выше.

source: Linux notes
ru: Замечания, касающиеся Linux

source: The Linux implementation requires that the address I<addr> be page-aligned, and allows I<length> to be zero. If there are some parts of the specified address range that are not mapped, the Linux version of B<madvise>() ignores them and applies the call to the rest (but returns B<ENOMEM> from the system call, as it should).
ru: Для реализации Linux требуется, чтобы адрес I<addr> был выровнен на границу страницы, а значение I<length> может быть нулевым. Если какие-то части указанного адресного диапазона не отображены, то версия Linux B<madvise>() игнорирует их и вызов применяется к оставшейся области (но возвращается значение B<ENOMEM>, как и должно).

source: msgget - get a System V message queue identifier
ru: msgget - возвращает идентификатор очереди сообщений System V

source: The B<msgget>() system call returns the System\ V message queue identifier associated with the value of the I<key> argument. It may be used either to obtain the identifier of a previously created message queue (when I<msgflg> is zero and I<key> does not have the value B<IPC_PRIVATE>), or to create a new set.
ru: Системный вызов B<msgget>() возвращает идентификатор очереди сообщений System\ V, связанный со значением аргумента I<key>. Его можно использовать для получения идентификатора уже созданной очереди сообщений (если I<msgflg> равно нулю и значение I<key> не равно B<IPC_PRIVATE>) или для создания новой.

source: A new message queue is created if I<key> has the value B<IPC_PRIVATE> or I<key> isn't B<IPC_PRIVATE>, no message queue with the given key I<key> exists, and B<IPC_CREAT> is specified in I<msgflg>.
ru: Новая очередь сообщений создаётся, если значение I<key> равно B<IPC_PRIVATE>, или если I<key> не равно B<IPC_PRIVATE>,не существует ни одной очереди сообщений с заданным ключом I<key> и в поле I<msgflg> указан флаг B<IPC_CREAT>.

source: If I<msgflg> specifies both B<IPC_CREAT> and B<IPC_EXCL> and a message queue already exists for I<key>, then B<msgget>() fails with I<errno> set to B<EEXIST>. (This is analogous to the effect of the combination B<O_CREAT | O_EXCL> for B<open>(2).)
ru: Если в I<msgflg> одновременно заданы B<IPC_CREAT> и B<IPC_EXCL> и с таким I<key> очередь сообщений уже существует, то B<msgget>() завершится с ошибкой и I<errno> будет равно B<EEXIST> (тот же эффект как для комбинации B<O_CREAT | O_EXCL> у B<open>(2)).

source: Upon creation, the least significant bits of the argument I<msgflg> define the permissions of the message queue. These permission bits have the same format and semantics as the permissions specified for the I<mode> argument of B<open>(2). (The execute permissions are not used.)
ru: При создании права доступа к очереди сообщений определяются младшими битами параметра I<msgflg>. Эти биты прав имеют тот же формат и значение, что и права в аргументе I<mode> у вызова B<open>(2) (право на исполнение не используется).

source: If a new message queue is created, then its associated data structure I<msqid_ds> (see B<msgctl>(2)) is initialized as follows:
ru: Если создаётся новая очередь сообщений, то этот системный вызов инициализирует структуру данных I<msqid_ds> (смотрите B<msgctl>(2)) следующим образом:

source: I<msg_perm.cuid> and I<msg_perm.uid> are set to the effective user ID of the calling process.
ru: Полям I<msg_perm.cuid> и I<msg_perm.uid> присваивается эффективный идентификатор пользователя вызывающего процесса.

source: I<msg_perm.cgid> and I<msg_perm.gid> are set to the effective group ID of the calling process.
ru: Полям I<msg_perm.cgid> и I<msg_perm.gid> присваивается эффективный идентификатор группы вызывающего процесса.

source: The least significant 9 bits of I<msg_perm.mode> are set to the least significant 9 bits of I<msgflg>.
ru: Младшим 9 битам I<msg_perm.mode> присваивается значение младших 9 битов I<msgflg>.

source: I<msg_qnum>, I<msg_lspid>, I<msg_lrpid>, I<msg_stime>, and I<msg_rtime> are set to 0.
ru: I<msg_qnum>, I<msg_lspid>, I<msg_lrpid>, I<msg_stime> и I<msg_rtime> присваивается 0.

source: I<msg_ctime> is set to the current time.
ru: В поле I<msg_ctime> записывается текущее время.

source: I<msg_qbytes> is set to the system limit B<MSGMNB>.
ru: В поле I<msg_qbytes> записывается системное ограничение B<MSGMNB>.

source: If the message queue already exists the permissions are verified, and a check is made to see if it is marked for destruction.
ru: Если очередь сообщений уже существует, то проверяются права доступа к ней и не помечена ли она для удаления.

source: If successful, the return value will be the message queue identifier (a nonnegative integer), otherwise -1 with I<errno> indicating the error.
ru: При успешном выполнении возвращается идентификатор очереди сообщений (неотрицательное целое), иначе возвращается -1, а переменной I<errno> присваивается номер ошибки.

source: On failure, I<errno> is set to one of the following values:
ru: При ошибке I<errno> устанавливается в одно из следующих значений:

source: A message queue exists for I<key>, but the calling process does not have permission to access the queue, and does not have the B<CAP_IPC_OWNER> capability in the user namespace that governs its IPC namespace.
ru: Очередь сообщений для ключа I<key> существует, но вызывающий процесс не имеет прав доступа к ней и не имеет мандата B<CAP_IPC_OWNER>, который управляет его пространством имён IPC.

source: B<IPC_CREAT> and B<IPC_EXCL> were specified in I<msgflg>, but a message queue already exists for I<key>.
ru: В I<msgflg> указаны B<IPC_CREAT> и B<IPC_EXCL>, но очередь сообщений уже существует для I<key>.

source: No message queue exists for I<key> and I<msgflg> did not specify B<IPC_CREAT>.
ru: Для ключа I<key> не существует очереди сообщений, но в I<msgflg> нет флага B<IPC_CREAT>.

source: A message queue has to be created but the system does not have enough memory for the new data structure.
ru: Очередь сообщений необходимо создать, но системе не хватает памяти для хранения новой структуры данных.

source: A message queue has to be created but the system limit for the maximum number of message queues (B<MSGMNI>) would be exceeded.
ru: Очередь сообщений необходимо создать, но лимит, определяющий количество очередей сообщений (B<MSGMNI>), уже достигнут.

source: B<IPC_PRIVATE> isn't a flag field but a I<key_t> type. If this special value is used for I<key>, the system call ignores everything but the least significant 9 bits of I<msgflg> and creates a new message queue (on success).
ru: B<IPC_PRIVATE> является не полем с флагами, а имеет тип I<key_t>. Если при работе с I<key> используется это специальное значение, то системный вызов игнорирует всё, кроме 9-ти младших битов в I<msgflg> и создаёт новую очередь сообщений (если это возможно).

source: The following is a system limit on message queue resources affecting a B<msgget>() call:
ru: На вызов B<msgget>() влияет системное ограничение по очередям сообщений:

source: System-wide limit on the number of message queues. Before Linux 3.19, the default value for this limit was calculated using a formula based on available system memory. Since Linux 3.19, the default value is 32,000. On Linux, this limit can be read and modified via I</proc/sys/kernel/msgmni>.
ru: Системное ограничение на максимальное количество очередей сообщений. В системах Linux до версии 3.19, значением по умолчанию этого ограничения рассчитывалось на основе формулы зависящей от доступной системной памяти. Начиная с Linux 3.19, значение по умолчанию равно 32000. В Linux это ограничение можно прочитать и изменять через I</proc/sys/kernel/msgmni>).

source: Until version 2.3.20, Linux would return B<EIDRM> for a B<msgget>() on a message queue scheduled for deletion.
ru: В Linux до версии 2.3.20 вызов B<msgget>() возвращал значение B<EIDRM>, если очередь сообщений была запланирована к удалению.
