Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Route-addrs are very unusual now. They occur sometimes in old mail archives. It is generally possible to ignore all but the "user@hostc" part of the address to determine the actual address.
ru: В настоящее время использование route-addrs выглядит очень необычно. Иногда их можно встретить в старых почтовых архивах. Обычно, для определения действительного адреса можно игнорировать всё, кроме части «пользователь@узелВ».

source: Every site is required to have a user or user alias designated "postmaster" to which problems with the mail system may be addressed. The "postmaster" address is not case sensitive.
ru: Для каждого сайта необходим пользователь или псевдоним, называемый «postmaster», которому можно сообщать о проблемах в почтовой системе. В адресе «postmaster» не учитывается регистр символов.

source: mount_namespaces - overview of Linux mount namespaces
ru: mount_namespaces - обзор пространств имён монтирования в Linux

source: For an overview of namespaces, see B<namespaces>(7).
ru: Обзор пространств имён смотрите в B<namespaces>(7).

source: Mount namespaces provide isolation of the list of mount points seen by the processes in each namespace instance. Thus, the processes in each of the mount namespace instances will see distinct single-directory hierarchies.
ru: Пространства имён монтирования позволяют изолировать список точек монтирования, видимый процессами в каждом экземпляре пространства имён. То есть, процессы в каждом из экземпляров пространства имён монтирования будут видеть разные иерархии в одном и том же каталоге.

source: The views provided by the I</proc/[pid]/mounts>, I</proc/[pid]/mountinfo>, and I</proc/[pid]/mountstats> files (all described in B<proc>(5)) correspond to the mount namespace in which the process with the PID I<[pid]> resides. (All of the processes that reside in the same mount namespace will see the same view in these files.)
ru: Данные файлов I</proc/[pid]/mounts>, I</proc/[pid]/mountinfo> и I</proc/[pid]/mountstats> (описаны в B<proc>(5)) соответствуют пространству имён монтирования, в котором расположен процесс с PID I<[pid]> (для всех процессов, которые расположены в одном пространстве имён монтирования, данные в этих файлах одинаковы).

source: When a process creates a new mount namespace using B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWNS> flag, the mount point list for the new namespace is a I<copy> of the caller's mount point list. Subsequent modifications to the mount point list (B<mount>(2) and B<umount>(2)) in either mount namespace will not (by default) affect the mount point list seen in the other namespace (but see the following discussion of shared subtrees).
ru: Когда процесс создаёт новое пространство имён монтирования с помощью B<clone>(2) или B<unshare>(2) с флагом B<CLONE_NEWNS> список точек монтирования для нового пространства имён представляет собой I<копию> списка точек монтирования вызывающего. Последующие изменения списка точек монтирования (B<mount>(2) и B<umount>(2)) в любом пространстве имён монтирования не влияют (по умолчанию) на список точек монтирования, видимый из другого пространства имён (но смотрите далее описание общих поддеревьев).

source: Restrictions on mount namespaces
ru: Ограничения у пространств имён монтирования

source: Note the following points with respect to mount namespaces:
ru: Отметим следующие моменты относительно пространств имён монтирования:

source: A mount namespace has an owner user namespace. A mount namespace whose owner user namespace is different from the owner user namespace of its parent mount namespace is considered a less privileged mount namespace.
ru: Владельцем пространства имён монтирования является владелец пользовательского пространство имён. Пространство имён монтирования, чей владелец пользовательского пространства имён отличается от владельца пользовательского пространства имён родительского пространства имён монтирования, считается менее привилегированным пространством имён монтирования.

source: When creating a less privileged mount namespace, shared mounts are reduced to slave mounts. (Shared and slave mounts are discussed below.) This ensures that mappings performed in less privileged mount namespaces will not propagate to more privileged mount namespaces.
ru: При создании менее привилегированного пространства имён монтирования количество общих точек монтирования сокращаются до списка подчинённых точек монтирования (про общие и подчинённые точки монтирования смотрите далее). Это гарантирует, что отображения, выполняемые в менее привилегированном пространстве имён монтирования, не распространятся в более привилегированные пространства имён монтирования.

source: Mounts that come as a single unit from more privileged mount are locked together and may not be separated in a less privileged mount namespace. (The B<unshare>(2) B<CLONE_NEWNS> operation brings across all of the mounts from the original mount namespace as a single unit, and recursive mounts that propagate between mount namespaces propagate as a single unit.)
ru: Точки монтирования, которые появились как единый блок из более привилегированного монтирования, объединяются и не могут быть разделены в менее привилегированном пространстве имён монтирования (операция B<unshare>(2) B<CLONE_NEWNS> переносит все точки монтирования из исходного пространства имён монтирования единым блоком и рекурсивные монтирования, которые передаются в нескольких пространствах имён монтирования, также единым блоком).

source: The B<mount>(2) flags B<MS_RDONLY>, B<MS_NOSUID>, B<MS_NOEXEC>, and the "atime" flags (B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>) settings become locked when propagated from a more privileged to a less privileged mount namespace, and may not be changed in the less privileged mount namespace.
ru: Значения флагов B<MS_RDONLY>, B<MS_NOSUID>, B<MS_NOEXEC> у B<mount>(2) и флагов «atime» (B<MS_NOATIME>, B<MS_NODIRATIME>, B<MS_RELATIME>) блокируются при передаче из более привилегированного в менее привилегированное пространство имён монтирования, и не могут быть изменены в менее привилегированном пространстве имён монтирования.

source: SHARED SUBTREES
ru: ОБЩИЕ ПОДДЕРЕВЬЯ

source: After the implementation of mount namespaces was completed, experience showed that the isolation that they provided was, in some cases, too great. For example, in order to make a newly loaded optical disk available in all mount namespaces, a mount operation was required in each namespace. For this use case, and others, the shared subtree feature was introduced in Linux 2.6.15. This feature allows for automatic, controlled propagation of mount and unmount I<events> between namespaces (or, more precisely, between the members of a I<peer group> that are propagating events to one another).
ru: После завершения реализации пространств имён монтирования опыт использования показал, что полученная изоляция, в некоторых случаях, слишком велика. Например, чтобы только что смонтированный оптический диск сделать доступным в во всех пространствах имён, требуется операция монтирования в каждом пространстве имён. Для этого случаях и других в Linux 2.6.15 были добавлены общие поддеревья. Это свойство предоставляет автоматическое, управляемое распространение I<событий> монтирования и размонтирования в пространствах имён (или, точнее, между членами I<равноправной группы>, которые обмениваются событиями между собой).

source: Each mount point is marked (via B<mount>(2)) as having one of the following I<propagation types>:
ru: Каждая точка монтирования помечается (в B<mount>(2)) одним из следующих I<типов распространения>:

source: This mount point shares events with members of a peer group. Mount and unmount events immediately under this mount point will propagate to the other mount points that are members of the peer group. I<Propagation> here means that the same mount or unmount will automatically occur under all of the other mount points in the peer group. Conversely, mount and unmount events that take place under peer mount points will propagate to this mount point.
ru: События такой точки монтирования являются общими с остальными членами равноправной группы. События монтирования и размонтирования этой точки сразу же распространяются на другие точки монтирования, являющиеся членами равноправной группы. То есть монтирование или размонтирование автоматически происходит и у всех остальных точек монтирования в равноправной группе. И наоборот, события монтирования и размонтирования, возникшие у точек монтирования равноправной группы, будут распространены и на эту точку монтирования.

source: This mount point is private; it does not have a peer group. Mount and unmount events do not propagate into or out of this mount point.
ru: Данная точка монтирования индивидуальна; у неё нет равноправной группы. События монтирования и размонтирования не распространяются от этой точки и на эту точку.

source: Mount and unmount events propagate into this mount point from a (master) shared peer group. Mount and unmount events under this mount point do not propagate to any peer.
ru: События монтирования и размонтирования распространяются на эту точку монтирования из (главной) общей равноправной группы. События монтирования и размонтирования этой точки не распространяются на членов группы.

source: Note that a mount point can be the slave of another peer group while at the same time sharing mount and unmount events with a peer group of which it is a member. (More precisely, one peer group can be the slave of another peer group.)
ru: Заметим, что точка монтирования может быть подчинённой одной равноправной группе и в тоже время может распространять события в другую группу, где она является членом (точнее, одна равноправная группа может быть подчинённой другой равноправной группе).

source: This is like a private mount, and in addition this mount can't be bind mounted. Attempts to bind mount this mount (B<mount>(2) with the B<MS_BIND> flag) will fail.
ru: Данный тип подобен индивидуальной точке монтирования, но дополнительно такая точка монтирования не может быть привязана (bind). Попытка привязать эту точку монтирования (B<mount>(2) с флагом B<MS_BIND>) завершится ошибкой.

source: When a recursive bind mount (B<mount>(2) with the B<MS_BIND> and B<MS_REC> flags) is performed on a directory subtree, any bind mounts within the subtree are automatically pruned (i.e., not replicated) when replicating that subtree to produce the target subtree.
ru: При рекурсивной привязке (B<mount>(2) с флагами B<MS_BIND> и B<MS_REC>) поддерева каталога все привязки внутри поддерева автоматически удаляются (т. е., не копируются) при копировании этого поддерева для создания целевого поддерева.

source: For a discussion of the propagation type assigned to a new mount, see NOTES.
ru: Описание типа распространения, назначаемого на новое монтирование, смотрите в ЗАМЕЧАНИЯХ.

source: The propagation type is a per-mount-point setting; some mount points may be marked as shared (with each shared mount point being a member of a distinct peer group), while others are private (or slaved or unbindable).
ru: Тип распространения имеется у каждой точки монтирования; некоторые точки монтирования могут быть помечены как общие (каждая общая точка монтирования является членом определённой равноправной группы), а некоторые как индивидуальные (или подчинённые или непривязываемые).

source: Note that a mount's propagation type determines whether mounts and unmounts of mount points I<immediately under> the mount point are propagated. Thus, the propagation type does not affect propagation of events for grandchildren and further removed descendant mount points. What happens if the mount point itself is unmounted is determined by the propagation type that is in effect for the I<parent> of the mount point.
ru: Заметим, что тип распространения монтирования определяет, будет ли монтирование или размонтирование распространяться точки монтирования, находящиеся I<на одну ступень ниже> точки, где возникло событие. То есть, тип распространения не влияет на распространение событий для внуков и в дальнейшем удаляемых потомков точки монтирования. Это случается, если сама точка монтирования размонтируется из-за действия типа распространения который, в сущности, влияние I<родительской> точки монтирования.

source: Members are added to a I<peer group> when a mount point is marked as shared and either:
ru: Члены добавляются в I<равноправную группу>, если точка монтирования помечается как общая, или:

source: the mount point is replicated during the creation of a new mount namespace; or
ru: точка монтирования копируется при создании нового пространства имён монтирования

source: a new bind mount is created from the mount point.
ru: создаётся новая привязка из точки монтирования

source: In both of these cases, the new mount point joins the peer group of which the existing mount point is a member.
ru: В обоих случаях новая точка монтирования присоединяется к равноправной группе, в которую входит существующая точка монтирования.

source: A new peer group is also created when a child mount point is created under an existing mount point that is marked as shared. In this case, the new child mount point is also marked as shared and the resulting peer group consists of all the mount points that are replicated under the peers of parent mount.
ru: Новая равноправная группа также создаётся, если дочерняя точка монтирования создана под существующей точкой монтирования, помеченной как общая. В этом случае, новая дочерняя точка монтирования также помечается как общая и получаемая равноправная группа состоит из всех точек монтирования, которые дублируются в равноправных группах родительской точки монтирования.

source: A mount ceases to be a member of a peer group when either the mount is explicitly unmounted, or when the mount is implicitly unmounted because a mount namespace is removed (because it has no more member processes).
ru: Точка монтирования перестаёт быть членом равноправной группы, когда происходит её явное размонтирование или неявное из-за удаления пространства имён монтирования (из-за отсутствия участвующих процессов).

source: The propagation type of the mount points in a mount namespace can be discovered via the "optional fields" exposed in I</proc/[pid]/mountinfo>. (See B<proc>(5) for details of this file.) The following tags can appear in the optional fields for a record in that file:
ru: Тип распространения точек монтирования в пространстве имён монтирования может узнать через «необязательные поля» в файле I</proc/[pid]/mountinfo> (описание файла смотрите в B<proc>(5)). В необязательных полях этого файла могут появляться следующие метки:

source: This mount point is shared in peer group I<X>. Each peer group has a unique ID that is automatically generated by the kernel, and all mount points in the same peer group will show the same ID. (These IDs are assigned starting from the value 1, and may be recycled when a peer group ceases to have any members.)
ru: Эта точка монтирования является общей в равноправной группе I<X>. Каждая равноправная группа имеет автоматически генерируемый ядром уникальный идентификатор, и у всех точек монтирования одной равноправной группы здесь будет одинаковый идентификатор (эти идентификаторы начинаются с 1 и могут повторно использоваться, когда в равноправной группе не останется членов).

source: This mount is a slave to shared peer group I<X>.
ru: Эта точка монтирования является подчинённой общей равноправной группе I<X>.

source: I<propagate_from:X> (since Linux 2.6.26)
ru: I<propagate_from:X> (начиная с Linux 2.6.26)

source: This mount is a slave and receives propagation from shared peer group I<X>. This tag will always appear in conjunction with a I<master:X> tag. Here, I<X> is the closest dominant peer group under the process's root directory. If I<X> is the immediate master of the mount, or if there is no dominant peer group under the same root, then only the I<master:X> field is present and not the I<propagate_from:X> field. For further details, see below.
ru: Эта точка монтирования является подчинённой и принимает события от общей равноправной группы I<X>. Данная метка всегда появляется вместе с меткой I<master:X>. Здесь I<X> это ближайшая главенствующая равноправная группа из корневого каталога процесса. Если I<X> является непосредственным владельцем точки монтирования, или в том же корне нет ближайшей главенствующей равноправной группы, то существует только поле I<master:X>, и поле I<propagate_from:X> отсутствует. Подробности смотрите ниже.

source: This is an unbindable mount.
ru: Точка монтирования является непривязываемой.

source: If none of the above tags is present, then this is a private mount.
ru: Если нет ни одной из вышеперечисленных меток, то точка монтирования является индивидуальной.

source: MS_SHARED and MS_PRIVATE example
ru: Пример MS_SHARED и MS_PRIVATE

source: Suppose that on a terminal in the initial mount namespace, we mark one mount point as shared and another as private, and then view the mounts in I</proc/self/mountinfo>:
ru: Предположим, что на терминале в первоначальном пространстве имён монтирования мы помечаем одну точку монтирования как общую, а другую — как индивидуальную, и затем смотрим точки монтирования в I</proc/self/mountinfo>:

source: From the I</proc/self/mountinfo> output, we see that I</mntS> is a shared mount in peer group 1, and that I</mntP> has no optional tags, indicating that it is a private mount. The first two fields in each record in this file are the unique ID for this mount, and the mount ID of the parent mount. We can further inspect this file to see that the parent mount point of I</mntS> and I</mntP> is the root directory, I</>, which is mounted as private:
ru: Из вывода I</proc/self/mountinfo> мы видим, что I</mntS> является общей точкой монтирования в равноправной группе 1, и что I</mntP> не имеет необязательных меток, то есть это индивидуальная точка монтирования. Первые два поля в каждой записи этого файла содержат уникальный идентификатор этой точки монтирования и идентификатор точки монтирования родительской точки монтирования. Далее в файле мы видим, что родительская точка монтирования I</mntS> и I</mntP> является корневым каталогом, I</>, которая смонтирована как индивидуальная:

source: On a second terminal, we create a new mount namespace where we run a second shell and inspect the mounts:
ru: На втором терминале мы создаём новое пространство имён монтирования, в котором запускаем вторую оболочку, и смотрим точки монтирования:

source: The new mount namespace received a copy of the initial mount namespace's mount points. These new mount points maintain the same propagation types, but have unique mount IDs. (The I<--propagation\ unchanged> option prevents B<unshare>(1) from marking all mounts as private when creating a new mount namespace, which it does by default.)
ru: Новое пространство имён монтирования получает копию точек монтирования из начального пространства имён монтирования. Эти новые точки монтирования имеют тот же тип распространения, но другие уникальные идентификаторы монтирования (при создании нового пространства имён монтирования передача параметра I<--propagation\ unchanged> программе B<unshare>(1) не даёт помечать все точки монтирования как индивидуальные (что делается по умолчанию)).

source: In the second terminal, we then create submounts under each of I</mntS> and I</mntP> and inspect the set-up:
ru: Далее на втором терминале мы создаём подмонтирования в каталоге I</mntS> и I</mntP> и смотрим что получилось:

source: From the above, it can be seen that I</mntS/a> was created as shared (inheriting this setting from its parent mount) and I</mntP/b> was created as a private mount.
ru: Из показанного выше мы видим, что I</mntS/a> была создана как общая (унаследовала от родительской точки монтирования), а I</mntP/b> — как индивидуальная точка монтирования.

source: Returning to the first terminal and inspecting the set-up, we see that the new mount created under the shared mount point I</mntS> propagated to its peer mount (in the initial mount namespace), but the new mount created under the private mount point I</mntP> did not propagate:
ru: Если вернуться на первый терминал и и ещё раз посмотреть параметры, то можно увидеть, что новая точка монтирования, созданная в общей точке монтирования I</mntS>, передалась в свою равноправную группу монтирования (в начальном пространстве имён монтирования), а новая точка монтирования, созданная в индивидуальной точке монтирования I</mntP>, нет:

source: MS_SLAVE example
ru: Пример MS_SLAVE

source: Making a mount point a slave allows it to receive propagated mount and unmount events from a master shared peer group, while preventing it from propagating events to that master. This is useful if we want to (say) receive a mount event when an optical disk is mounted in the master shared peer group (in another mount namespace), but want to prevent mount and unmount events under the slave mount from having side effects in other namespaces.
ru: Создание подчинённой точки монтирования позволяет ей принимать распространяемые события монтирования и размонтирования из главной общей равноправной группы, но запрещает распространять события в эту главную группу. Это полезно, если требуется, скажем, принимать событие монтирования оптического диска в главной общей равноправной группе (в другом пространстве имён монтирования), но не нужно, чтобы события монтирования и размонтирования в подчинённой точке монтирования передавались в другие пространства имён.

source: We can demonstrate the effect of slaving by first marking two mount points as shared in the initial mount namespace:
ru: Для демонстрации следствия подчинённости сначала создадим две общие точки монтирования в начальном пространстве имён монтирования:

source: On a second terminal, we create a new mount namespace and inspect the mount points:
ru: На втором терминале создадим новое пространство имён монтирования и посмотрим точки монтирования:

source: In the new mount namespace, we then mark one of the mount points as a slave:
ru: Далее в новом пространстве имён монтирования пометим одну из точек монтирования как подчинённую:

source: From the above output, we see that I</mntY> is now a slave mount that is receiving propagation events from the shared peer group with the ID 2.
ru: Из показанного выше видно, что I</mntY> теперь подчинённая точка монтирования, которая принимать распространяемые события от общей равноправной группы с ID 2.

source: Continuing in the new namespace, we create submounts under each of I</mntX> and I</mntY>:
ru: Далее в новом пространстве имён создадим подмонтирования в I</mntX> и I</mntY>:

source: When we inspect the state of the mount points in the new mount namespace, we see that I</mntX/a> was created as a new shared mount (inheriting the "shared" setting from its parent mount) and I</mntY/b> was created as a private mount:
ru: Если посмотреть состояние точек монтирования в новом пространстве имён монтирования можно увидеть, что I</mntX/a> создана как новая общая точка монтирования (наследует «общность» от родительской точки монтирования), а I</mntY/b> создана как индивидуальная точка монтирования:

source: Returning to the first terminal (in the initial mount namespace), we see that the mount I</mntX/a> propagated to the peer (the shared I</mntX>), but the mount I</mntY/b> was not propagated:
ru: Если вернуться на первый терминал (в начальное пространство имён монтирования), то можно увидеть, что точка монтирования I</mntX/a> передалась в свою равноправную группу (общую с I</mntX>), а точка монтирования I</mntY/b> нет:

source: Now we create a new mount point under I</mntY> in the first shell:
ru: Теперь создадим новую точку монтирования в I</mntY> в первом терминале:
