Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: msr - x86 CPU MSR access device
ru: msr - устройство доступа к MSR процессоров x86

source: DESCRIPTION
ru: ОПИСАНИЕ

source: I</dev/cpu/CPUNUM/msr> provides an interface to read and write the model-specific registers (MSRs) of an x86 CPU. I<CPUNUM> is the number of the CPU to access as listed in I</proc/cpuinfo>.
ru: Устройство I</dev/cpu/CPUNUM/msr> предоставляет интерфейс для чтения и записи в специальные регистры модели (model-specific registers, MSR) процессоров x86. В I<CPUNUM> задаётся номер процессора для доступа; номера перечислены в I</proc/cpuinfo>.

source: The register access is done by opening the file and seeking to the MSR number as offset in the file, and then reading or writing in chunks of 8 bytes. An I/O transfer of more than 8 bytes means multiple reads or writes of the same register.
ru: Доступ к регистру выполняется открытием файла и переходом в файле по смещению под номером нужного MSR; чтение и запись производится порциями по 8 байт. Ввод/вывод более 8 байт выполняется несколькими операциями чтения или записи в нужный регистр.

source: This file is protected so that it can be read and written only by the user I<root>, or members of the group I<root>.
ru: Файл доступен на чтение и запись только пользователю I<root> или членам группы I<root>.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: The I<msr> driver is not auto-loaded. On modular kernels you might need to use the following command to load it explicitly before use:
ru: Драйвер I<msr> автоматически не загружается. В модульных ядрах нужно выполнить загрузку явно:

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: mem, kmem, port - system memory, kernel memory and system ports
ru: mem, kmem, port - системная память, память ядра и порты системы

source: I</dev/mem> is a character device file that is an image of the main memory of the computer. It may be used, for example, to examine (and even patch) the system.
ru: Файл I</dev/mem> — это файл символьного устройства, представляющий образ физической памяти компьютера. Этот файл может быть использован для исследования системы (и даже для внесения в неё исправлений).

source: Byte addresses in I</dev/mem> are interpreted as physical memory addresses. References to nonexistent locations cause errors to be returned.
ru: Адреса байтов в I</dev/mem> рассматриваются как адреса физической памяти. При ссылках на несуществующие адреса возвращаются ошибки.

source: Examining and patching is likely to lead to unexpected results when read-only or write-only bits are present.
ru: Исследование системы или внесение в неё исправлений иногда приводят к непредвиденным результатам в том случае, если есть биты, которые разрешается только читать или только записывать.

source: Since Linux 2.6.26, and depending on the architecture, the B<CONFIG_STRICT_DEVMEM> kernel configuration option limits the areas which can be accessed through this file. For example: on x86, RAM access is not allowed but accessing memory-mapped PCI regions is.
ru: Начиная с версии Linux 2.6.26 и в зависимости от архитектуры, параметр настройки ядра B<CONFIG_STRICT_DEVMEM> ограничивает области, к которым можно получить доступ через этот файл. Например, на архитектуре x86 доступ к ОЗУ не разрешен, однако к отображенной в области PCI памяти доступ есть.

source: It is typically created by:
ru: Обычно, этот файл создается так:

source: The file I</dev/kmem> is the same as I</dev/mem>, except that the kernel virtual memory rather than physical memory is accessed. Since Linux 2.6.26, this file is available only if the B<CONFIG_DEVKMEM> kernel configuration option is enabled.
ru: Файл I</dev/kmem> идентичен файлу I</dev/mem> за исключением того, что обеспечивает доступ к виртуальной памяти ядра, а не к физической. Начиная с версии Linux 2.6.26, этот файл становится доступен только после включения параметра настройки ядра B<CONFIG_DEVKMEM>.

source: I</dev/port> is similar to I</dev/mem>, but the I/O ports are accessed.
ru: Файл I</dev/port> похож на I</dev/mem>, но предоставляет доступ к портам ввода-вывода.

source: FILES
ru: ФАЙЛЫ

source: mouse - serial mouse interface
ru: mouse - последовательный интерфейс мыши

source: CONFIGURATION
ru: НАСТРОЙКА

source: Serial mice are connected to a serial RS232/V24 dialout line, see B<ttyS>(4) for a description.
ru: Мышь подключается последовательному порту RS232/V24, описание смотрите в B<ttyS>(4).

source: Introduction
ru: Введение

source: The pinout of the usual 9 pin plug as used for serial mice is:
ru: Описание разъёма c 9 контактами, используемого для подключения мыши:

source: pin
ru: контакт

source: name
ru: название

source: used for
ru: назначение

source: Data
ru: Данные

source: -12 V, Imax = 10 mA
ru: -12 В, Iмакс = 10 мА

source: +12 V, Imax = 10 mA
ru: +12 В, Iмакс = 10 мА

source: Ground
ru: Земля

source: This is the specification, in fact 9 V suffices with most mice.
ru: Такое описание приводится в документации, почти любой мыши хватает 9 V.

source: The mouse driver can recognize a mouse by dropping RTS to low and raising it again. About 14 ms later the mouse will send 0x4D (\(aqM\(aq) on the data line. After a further 63 ms, a Microsoft-compatible 3-button mouse will send 0x33 (\(aq3\(aq).
ru: Драйвер мыши может распознать мышь, посылая низкий сигнал RTS и затем высокий. Примерно через 14 миллисекунд мышь пошлёт 0x4D (\(aqM\(aq) по линии данных. Ещё через 63 миллисекунды трёх-кнопочная Microsoft-совместимая мышь пошлёт 0x33 (\(aq3\(aq).

source: The relative mouse movement is sent as I<dx> (positive means right) and I<dy> (positive means down). Various mice can operate at different speeds. To select speeds, cycle through the speeds 9600, 4800, 2400, and 1200 bit/s, each time writing the two characters from the table below and waiting 0.1 seconds. The following table shows available speeds and the strings that select them:
ru: Относительное движение мыши посылается как I<dx> (положительное значение означает движение направо) и I<dy> (положительное значение означает движение вниз). Различные мыши могут работать на разных скоростях. Для определения скорости устанавливаются следующие её значения (по очереди): 9600, 4800, 2400 и 1200 бит/с; каждый раз при установке значения скорости пишутся 2 символа из таблицы, приведённой ниже, и после этого выполняется ожидание, равное 0,1 секунды. В таблице указаны скорости и символы, соответствующие им:

source: bit/s
ru: бит/с

source: string
ru: строка

source: The first byte of a data packet can be used for synchronization purposes.
ru: Первый байт из пакета данных может использоваться для синхронизации.

source: Microsoft protocol
ru: Протокол Microsoft

source: The B<Microsoft> protocol uses 1 start bit, 7 data bits, no parity and one stop bit at the speed of 1200 bits/sec. Data is sent to RxD in 3-byte packets. The I<dx> and I<dy> movements are sent as two's-complement, I<lb> (I<rb>) are set when the left (right) button is pressed:
ru: В протоколе B<Microsoft> используется один начальный бит, 7 битов данных (без проверки четности), один стоп-бит; протокол работает со скоростью 1200 бит/с. Данные пересылаются по RxD трёх-байтовыми пакетами. Движения по I<dx> и I<dy> пересылаются в коде дополнения до 2. Значения I<lb> (I<rb>), устанавливаемые при нажатии левой (правой) кнопки:

source: byte
ru: байт

source: 3-button Microsoft protocol
ru: Протокол Microsoft для трёх-кнопочной мыши

source: Original Microsoft mice only have two buttons. However, there are some three button mice which also use the Microsoft protocol. Pressing or releasing the middle button is reported by sending a packet with zero movement and no buttons pressed. (Thus, unlike for the other two buttons, the status of the middle button is not reported in each packet.)
ru: Первоначально мышь Microsoft имела две кнопки. Но есть несколько трёх-кнопочных мышей, также использующих протокол Microsoft. О нажатии или отпускании средней кнопки сообщается отправкой пакета с нулевым движением и ненажатыми клавишами. (Таким образом, в отличие от двух других кнопок, состояние средней в каждом пакете не передаётся).

source: Logitech protocol
ru: Протокол Logitech

source: Logitech serial 3-button mice use a different extension of the Microsoft protocol: when the middle button is up, the above 3-byte packet is sent. When the middle button is down a 4-byte packet is sent, where the 4th byte has value 0x20 (or at least has the 0x20 bit set). In particular, a press of the middle button is reported as 0,0,0,0x20 when no other buttons are down.
ru: Трёх-кнопочная мышь Logitech представляет собой расширенный вариант протокола Microsoft: когда средняя кнопка отпущена, посылается вышеописанный трёх-байтовый пакет, а когда она нажата, посылается четырёх-байтовый пакет, где четвёртый байт имеет значение 0x20 (или, как минимум, в нём установлен бит 0x20). В частности, о нажатии средней кнопки сообщается с помощью пакета 0,0,0,0x20 при том, что остальные кнопки остаются ненажатыми.

source: Mousesystems protocol
ru: Протокол Mousesystems

source: The B<Mousesystems> protocol uses 1 start bit, 8 data bits, no parity and two stop bits at the speed of 1200 bits/sec. Data is sent to RxD in 5-byte packets. I<dx> is sent as the sum of the two two's-complement values, I<dy> is send as negated sum of the two two's-complement values. I<lb> (I<mb>, I<rb>) are cleared when the left (middle, right) button is pressed:
ru: В протоколе B<Mousesystems> используется один начальный бит, 8 битов данных, без проверки чётности и два стоп-бита при скорости 1200 бит/с. Данные посылаются по RxD пяти-байтовыми пакетами. I<dx> посылается как сумма значений в коде дополнения до 2, I<dy> посылается как отрицательная сумма значений в коде дополнения до 2. I<lb> (I<mb>, I<rb>) обнуляются при нажатии левой (средней, правой) кнопки:

source: Bytes 4 and 5 describe the change that occurred since bytes 2 and 3 were transmitted.
ru: Четвёртый и пятый байты описывают изменения, произошедшие за время передачи второго и третьего байта.

source: Sun protocol
ru: Протокол Sun

source: The B<Sun> protocol is the 3-byte version of the above 5-byte Mousesystems protocol: the last two bytes are not sent.
ru: Протокол B<Sun> представляет собой трёх-байтовую версию протокола Mousesystems (описанного выше): два последних байта не отсылаются.

source: MM protocol
ru: Протокол MM

source: The B<MM> protocol uses 1 start bit, 8 data bits, odd parity and one stop bit at the speed of 1200 bits/sec. Data is sent to RxD in 3-byte packets. I<dx> and I<dy> are sent as single signed values, the sign bit indicating a negative value. I<lb> (I<mb>, I<rb>) are set when the left (middle, right) button is pressed:
ru: В протоколе B<MM> используется один начальный бит, 8 битов данных, контроль по нечётности и один стоп-бит при скорости 1200 бит/с. Данные посылаются по RxD трёх-байтовыми пакетами. I<dx> и I<dy> отсылаются как единичные значения со знаком, бит знака указывает на отрицательное значение. I<lb> (I<mb>, I<rb>) устанавливаются при нажатии левой (средней, правой) кнопки:

source: A commonly used symbolic link pointing to a mouse device.
ru: Обычно используется символьная ссылка на устройство мыши.

source: Linux user manual
ru: Руководство пользователя Linux

source: memusage - profile memory usage of a program
ru: memusage - исследует использование памяти программы

source: SYNOPSIS
ru: ОБЗОР

source: B<memusage> [I<option>]... I<program> [I<programoption>]...
ru: B<memusage> [I<параметры>]… I<программа> [I<параметры_программы>]…

source: B<memusage> is a bash script which profiles memory usage of the program, I<program>. It preloads the B<libmemusage.so> library into the caller's environment (via the B<LD_PRELOAD> environment variable; see B<ld.so>(8)). The B<libmemusage.so> library traces memory allocation by intercepting calls to B<malloc>(3), B<calloc>(3), B<free>(3), and B<realloc>(3); optionally, calls to B<mmap>(2), B<mremap>(2), and B<munmap>(2) can also be intercepted.
ru: Программа B<memusage> представляет собой сценарий bash, который описывает использование памяти I<программой>. Сценарий загружает библиотеку B<libmemusage.so> в окружение вызывающего (через переменную окружения B<LD_PRELOAD>, смотрите B<ld.so>(8)). Библиотека B<libmemusage.so> отслеживает распределение памяти путём перехвата вызовов B<malloc>(3), B<calloc>(3), B<free>(3) и B<realloc>(3); при необходимости, также могут быть перехвачены вызовы B<mmap>(2), B<mremap>(2) и B<munmap>(2).

source: B<memusage> can output the collected data in textual form, or it can use B<memusagestat>(1) (see the B<-p> option, below) to create a PNG file containing graphical representation of the collected data.
ru: B<memusage> может выводить собранные данные в текстовом виде, также может использовать B<memusagestat>(1) (смотрите вариант B<-р> далее) для того, чтобы создать файл PNG, содержащий графическое представление собранных данных.

source: Memory usage summary
ru: Сводка использование памяти

source: The "Memory usage summary" line output by B<memusage> contains three fields:
ru: Выводимая B<memusage> строка "сводка использование памяти" содержит три поля:

source: Sum of I<size> arguments of all B<malloc>(3) calls, products of arguments (I<nmemb>*I<size>) of all B<calloc>(3) calls, and sum of I<length> arguments of all B<mmap>(2) calls. In the case of B<realloc>(3) and B<mremap>(2), if the new size of an allocation is larger than the previous size, the sum of all such differences (new size minus old size) is added.
ru: Сумма аргументов I<size> всех вызовов B<malloc> (3), результат аргументов (I<nmemb>*I<size>) всех вызовов B<calloc>(3) и сумма аргументов I<length> всех вызовов B<mmap> (2) . В случае B<realloc> (3) и B<mremap> (2), если новый размер блока адресов больше, чем в предыдущий размер, добавляется сумма всех таких различий (новый размер минус старый размер).

source: Maximum of all I<size> arguments of B<malloc>(3), all products of I<nmemb>*I<size> of B<calloc>(3), all I<size> arguments of B<realloc>(3), I<length> arguments of B<mmap>(2), and I<new_size> arguments of B<mremap>(2).
ru: Максимальное значение всех аргументов I<size> у B<malloc>(3), все произведения I<nmemb>*I<size> у B<calloc>(3), все аргументы I<size> у B<realloc>(3), аргументы I<length> у B<mmap>(2) и аргументы I<new_size> у B<mremap>(2).

source: Before the first call to any monitored function, the stack pointer address (base stack pointer) is saved. After each function call, the actual stack pointer address is read and the difference from the base stack pointer computed. The maximum of these differences is then the stack peak.
ru: Перед первым вызовом любой отслеживаемой функции сохраняется адрес указателя стека (базовый указатель стека). После каждого вызова функции читается текущий адрес указателя стека и вычисляет разница с базовым указателем стека. Максимальное значение среди вычитаний является пиком стека.

source: Immediately following this summary line, a table shows the number calls, total memory allocated or deallocated, and number of failed calls for each intercepted function. For B<realloc>(3) and B<mremap>(2), the additional field "nomove" shows reallocations that changed the address of a block, and the additional "dec" field shows reallocations that decreased the size of the block. For B<realloc>(3), the additional field "free" shows reallocations that caused a block to be freed (i.e., the reallocated size was 0).
ru: Сразу за строкой итога в таблице для каждой перехваченной функции показывается количество вызовов, общее количество выделенной и освобождённой памяти и количество вызовов с ошибками. Для B<realloc>(3) и B<mremap>(2) также есть поле «nomove», показывающее переразмещения, у которых изменился адрес блока, и поле «dec», показывающее переразмещения, у которых уменьшился размер блока. Для B<realloc>(3) в дополнительном поле «free» показываются переразмещения, которые были вызваны освобождением блока (т. е., размер переразмещения был равен 0).

source: The "realloc/total memory" of the table output by B<memusage> does not reflect cases where B<realloc>(3) is used to reallocate a block of memory to have a smaller size than previously. This can cause sum of all "total memory" cells (excluding "free") to be larger than the "free/total memory" cell.
ru: Таблица «realloc/total memory», выводимая B<memusage>, не отражает случаи, где B<realloc>(3) используется для переразмещения блока памяти меньшего размера, чем предыдущий. Это может привести к тому, что сумма всех ячеек «total memory» (кроме «free») будет больше, чем ячейка «free/total memory».

source: Histogram for block sizes
ru: Гистограмма размеров блоков

source: The "Histogram for block sizes" provides a breakdown of memory allocations into various bucket sizes.
ru: «Гистограмма размеров блоков» выдает разбивку адресованных блоков по размерам.

source: OPTIONS
ru: ПАРАМЕТРЫ

source: B<-n\ >I<name>,\ B<--progname=>I<name>
ru: B<-n\ >I<имя>,\ B<--progname=>I<имя>

source: Name of the program file to profile.
ru: Имя файла профилируемой программы.

source: Generate PNG graphic and store it in I<file>.
ru: Создать изображение в формате PNG и сохранить его в

source: B<-d\ >I<file>,\ B<--data=>I<file>
ru: B<-d\ >I<файл>,\ B<--data=>I<файл>

source: Generate binary data file and store it in I<file>.
ru: Создать двоичный файл данных и сохранить его в I<файл>.

source: Do not buffer output.
ru: Не буферизуйте вывод.

source: Collect I<size> entries before writing them out.
ru: Собрать I<size> записей перед тем, как записать их.

source: Disable timer-based (B<SIGPROF>) sampling of stack pointer value.
ru: Отключить измерение значения указателя стека на основе таймера (B<SIGPROF>).

source: Also trace B<mmap>(2), B<mremap>(2), and B<munmap>(2).
ru: Также трассировать B<mmap>(2), B<mremap>(2) и B<munmap>(2).

source: Print help and exit.
ru: Показать справку по использованию и завершить работу.

source: Print a short usage message and exit.
ru: Показать короткое сообщение об использовании и завершить работу.

source: Print version information and exit.
ru: Показать информацию о версии и завершить работу.

source: The following options apply only when generating graphical output:
ru: Следующие параметры применяются только когда используется графический вывод:

source: Use time (rather than number of function calls) as the scale for the X axis.
ru: По оси X — время (а не количество вызовов функций).

source: Also draw a graph of total memory use.
ru: Построить также график общего использования памяти.

source: B<--title=>I<name>
ru: B<--title=>I<название>

source: Use I<name> as the title of the graph.
ru: Использовать I<название> в качестве заголовка графика.

source: Make the graph I<size> pixels wide.
ru: Рисовать график шириной в I<size> пикселов.

source: Make the graph I<size> pixels high.
ru: Рисовать график высотой в I<size> пикселов.

source: EXIT STATUS
ru: КОД РЕЗУЛЬТАТА

source: Exit status is equal to the exit status of profiled program.
ru: Код завершения работы равен коду выхода профилируемой программы.

source: BUGS
ru: ДЕФЕКТЫ

source: To report bugs, see E<.UR http://www.gnu.org/software/libc/bugs.html> E<.UE>
ru: Сообщения об ошибках доступны по адресу E<.UR http://www.gnu.org/software/libc/bugs.html> E<.UE>

source: EXAMPLE
ru: ПРИМЕР

source: Below is a simple program that reallocates a block of memory in cycles that rise to a peak before then cyclically reallocating the memory in smaller blocks that return to zero. After compiling the program and running the following commands, a graph of the memory usage of the program can be found in the file I<memusage.png>:
ru: Ниже показана простая программа, которая переразмещает блок памяти в цикле, который достигает пика до того как размер циклически переразмещаемой памяти достигнет нуля. После компиляции программы и запуска следующих команд график использования памяти программой можно найти в файле I<memusage.png>:

source: Program source
ru: Исходный код программы

source: Linux programmer's manual
ru: Руководство программиста Linux

source: memusagestat - generate graphic from memory profiling data
ru: memusagestat - генерирует график по данным профилирования памяти

source: B<memusagestat> [I<option>]... I<datafile> [I<outfile>]
ru: B<memusagestat> [I<параметр>]... I<файл_с_данными> [I<файл_результата>]

source: B<memusagestat> creates a PNG file containing a graphical representation of the memory profiling data in the file I<datafile>; that file is generated via the I<-d> (or I<--data>) option of B<memusage>(1).
ru: Программа B<memusagestat> создаёт файл в формате PNG с графическим представлением данных профилирования памяти из файла I<datafile>; этот файл генерируется с программой B<memusage>(1), запущенной с параметром I<-d> (или I<--data>).

source: The red line in the graph shows the heap usage (allocated memory) and the green line shows the stack usage. The x-scale is either the number of memory-handling function calls or (if the I<-t> option is specified) time.
ru: Красной линией на графике показывается использование кучи (выделяемой памяти), а зелёной — использование стека. По оси Х отражается количество вызовов функций работы с памятью (если указан параметр I<-t>) или время.

source: B<-o\ >I<file>,\ B<--output=>I<file>
ru: B<-o\ >I<файл>,\ B<--output=>I<файл>

source: Name of the output file.
ru: Имя выходного файла.

source: B<-s\ >I<string>,\ B<--string=>I<string>
ru: B<-s\ >I<строка>,\ B<--string=>I<строка>

source: Use I<string> as the title inside the output graph.
ru: Использовать I<строку> в качестве заголовка графика.

source: Also draw a graph of total memory consumption.
ru: Также строить график общего потребления памяти.

source: Make the output graph I<size> pixels wide.
ru: Рисовать график шириной в I<size> пикселов.

source: Make the output graph I<size> pixels high.
ru: Рисовать график высотой в I<size> пикселов.

source: Print a help message and exit.
ru: Показать сообщение об использовании и завершить работу.

source: See B<memusage>(1).
ru: Смотрите B<memusage>(1).

source: mtrace - interpret the malloc trace log
ru: mtrace - трактует журнал трассировки malloc

source: B<mtrace> [I<option>]... [I<binary>] I<mtracedata>
ru: B<mtrace> [I<параметр>]… [I<binary>] I<mtracedata>

source: B<mtrace> is a Perl script used to interpret and provide human readable output of the trace log contained in the file I<mtracedata>, whose contents were produced by B<mtrace>(3). If I<binary> is provided, the output of B<mtrace> also contains the source file name with line number information for problem locations (assuming that I<binary> was compiled with debugging information).
ru: Программа B<mtrace> представляет собой сценарий Perl и используется для трактовки и вывода в понятном человеку виде журнала трассировки из файла I<mtracedata>, который создаётся B<mtrace>(3). Если указан файл I<binary>, то вывод B<mtrace> также содержит имя файла исходного кода и номера строк соответствующих мест (предполагается, что I<binary> скомпилирован с отладочной информацией).

source: For more information about the B<mtrace>(3) function and B<mtrace> script usage, see B<mtrace>(3).
ru: Подробней о функции B<mtrace>(3) и использовании сценария B<mtrace> смотрите в B<mtrace>(3).

source: For bug reporting instructions, please see: E<.UR http://www.gnu.org/software/libc/bugs.html> E<.UE .>
ru: Инструкции по созданию отчетов об ошибках можно найти по адресу E<.UR http://www.gnu.org/software/libc/bugs.html> E<.UE .>

source: mq_overview - overview of POSIX message queues
ru: mq_overview - обзор очередей сообщений POSIX
