Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: The B<mpool_filter>() function is intended to make transparent input and output processing of the pages possible. If the I<pgin> function is specified, it is called each time a buffer is read into the memory pool from the backing file. If the I<pgout> function is specified, it is called each time a buffer is written into the backing file. Both functions are called with the I<pgcookie> pointer, the page number and a pointer to the page to being read or written.
ru: Функция B<mpool_filter>() предназначена для создания прозрачной обработки операций ввода и вывода доступных страниц. Если задана функция I<pgin>, то она вызывается каждый раз, когда данные буфера считываются в память массива из внешнего файла. Если задана функция I<pgout>, то она вызывается каждый раз, когда данные буфера записываются во внешний файл. Обе функции вызываются с указателем I<pgcookie>, номером страницы и указателем на страницу, используемую для чтения или записи.

source: The function B<mpool_new>() takes an I<MPOOL> pointer and an address as arguments. If a new page can be allocated, a pointer to the page is returned and the page number is stored into the I<pgnoaddr> address. Otherwise, NULL is returned and I<errno> is set.
ru: Параметрами функции B<mpool_new>() являются указатель I<MPOOL> и адрес. Если может быть выделена новая страница, то возвращается указатель на страницу и номер страницы сохраняется по адресу I<pgnoaddr>. В противном случае возвращается NULL и изменяется I<errno>.

source: The function B<mpool_get>() takes an I<MPOOL> pointer and a page number as arguments. If the page exists, a pointer to the page is returned. Otherwise, NULL is returned and I<errno> is set. The I<flags> argument is not currently used.
ru: Параметрами функции B<mpool_get>() являются указатель и номер страницы. Если страница существует, то возвращается указатель на страницу. Иначе возвращается NULL и меняется значение переменной I<errno>. Параметр I<flags> пока не используется.

source: The function B<mpool_put>() unpins the page referenced by I<pgaddr>. I<pgaddr> must be an address previously returned by B<mpool_get>() or B<mpool_new>(). The flag value is specified by ORing any of the following values:
ru: Функция B<mpool_put>() открепляет страницу, на которую указывает I<pgaddr>. В I<pgaddr> должен быть указан адрес, который был возвращён B<mpool_get>() или B<mpool_new>() ранее. Значением флага являются любые объединённые следующие значения:

source: The page has been modified and needs to be written to the backing file.
ru: Страница была изменена и должна быть записана обратно в файл.

source: B<mpool_put>() returns 0 on success and -1 if an error occurs.
ru: При успешном выполнении функция B<mpool_put>() возвращает 0, а при ошибках возвращает -1.

source: The function B<mpool_sync>() writes all modified pages associated with the I<MPOOL> pointer to the backing file. B<mpool_sync>() returns 0 on success and -1 if an error occurs.
ru: Функция B<mpool_sync>() записывает все изменённые страницы, связанные с указателем I<MPOOL>, обратно в файл. При успешном выполнении B<mpool_sync>() возвращает 0 и -1 при ошибке.

source: The B<mpool_close>() function free's up any allocated memory associated with the memory pool cookie. Modified pages are B<not> written to the backing file. B<mpool_close>() returns 0 on success and -1 if an error occurs.
ru: Функция B<mpool_close>() освобождает любую выделенную память, связанную с идентификатором массива памяти. Изменённые страницы B<не> записываются обратно в файл. При успешном выполнении B<mpool_close>() возвращает 0 и -1 при ошибке.

source: The B<mpool_open>() function may fail and set I<errno> for any of the errors specified for the library routine B<malloc>(3).
ru: При ошибках функция B<mpool_open>() устанавливает значение I<errno> равным какому-либо значению из определённых в B<malloc>(3).

source: The B<mpool_get>() function may fail and set I<errno> for the following:
ru: При ошибках функция B<mpool_get>() устанавливает значение I<errno> по следующим причинам:

source: The requested record doesn't exist.
ru: Запрошенная запись не существует.

source: The B<mpool_new>() and B<mpool_get>() functions may fail and set I<errno> for any of the errors specified for the library routines B<read>(2), B<write>(2), and B<malloc>(3).
ru: При ошибках функции I<mpool_new>() и I<mpool_get> присваивают переменной I<errno> любое значение из определённых в библиотечных функциях B<read>(2), B<write>(2) и B<malloc>(3).

source: The B<mpool_sync>() function may fail and set I<errno> for any of the errors specified for the library routine B<write>(2).
ru: При ошибках функция B<mpool_sync>() устанавливает значение I<errno> равным значению ошибки из определённых в библиотеке для B<write>(2).

source: The B<mpool_close>() function may fail and set I<errno> for any of the errors specified for the library routine B<free>(3).
ru: При ошибках функция B<mpool_close>() устанавливает значение I<errno> равным значению ошибки из определённых в библиотеке для B<free>(3).

source: Not in POSIX.1. Present on the BSDs.
ru: Не является частью POSIX.1. Присутствует в BSD.

source: memset - fill memory with a constant byte
ru: memset - заполнение памяти значением определённого байта

source: The B<memset>() function fills the first I<n> bytes of the memory area pointed to by I<s> with the constant byte I<c>.
ru: Функция B<memset>() заполняет I<n> байт участка памяти, адрес начала которого находится в указателе I<s>, значением байта I<c>.

source: The B<memset>() function returns a pointer to the memory area I<s>.
ru: Функция B<memset>() возвращает указатель на участок памяти I<s>.

source: makedev, major, minor - manage a device number
ru: makedev, major, minor - управление номером устройства

source: A device ID consists of two parts: a major ID, identifying the class of the device, and a minor ID, identifying a specific instance of a device in that class. A device ID is represented using the type I<dev_t>.
ru: Идентификатор (ID) устройства состоит из двух частей: старшего номера, определяющего класс устройства, и младшего номера, указывающего на определённый экземпляр устройства в этом классе. Для представления ID устройства используется тип I<dev_t>.

source: Given major and minor device IDs, B<makedev>() combines these to produce a device ID, returned as the function result. This device ID can be given to B<mknod>(2), for example.
ru: Функция B<makedev>() объединяет указанные старший и младший ID устройства, возвращая ID устройства. Этот ID может быть передан B<mknod>(2).

source: The B<major>() and B<minor>() functions perform the converse task: given a device ID, they return, respectively, the major and minor components. These macros can be useful to, for example, decompose the device IDs in the structure returned by B<stat>(2).
ru: Функции B<major>() и B<minor>() выполняют обратную задачу: по указанному ID устройства они возвращают, соответственно, старший и младший номера. Данные макросы могут пригодиться, например, для разложения ID устройства из структуры, возвращенной B<stat>(2).

source: The B<makedev>(), B<major>(), and B<minor>() functions are not specified in POSIX.1, but are present on many other systems.
ru: Функции B<makedev>(), B<major>() и B<minor>() не описаны в POSIX.1, однако присутствуют во многих системах.

source: These interfaces are defined as macros. Since glibc 2.3.3, they have been aliases for three GNU-specific functions: B<gnu_dev_makedev>(), B<gnu_dev_major>(), and B<gnu_dev_minor>(). The latter names are exported, but the traditional names are more portable.
ru: Данные интерфейсы определены как макросы. Начиная с glibc 2.3.3, они являются псевдонимами для трёх GNU-функций: B<gnu_dev_makedev>(), B<gnu_dev_major>() и B<gnu_dev_minor>(). Эти имена экспортированы, однако использование традиционных имён более переносимо.

source: The BSDs expose the definitions for these macros via I<E<lt>sys/types.hE<gt>>. Depending on the version, glibc also exposes definitions for these macros from that header file if suitable feature test macros are defined. However, this behavior was deprecated in glibc 2.25, and since glibc 2.28, I<E<lt>sys/types.hE<gt>> no longer provides these definitions.
ru: В BSD определения этих макросов доступны в I<E<lt>sys/types.hE<gt>>. В зависимости от версии, в glibc они также доступны из этого заголовочного файла, если определён подходящий макрос тестирования свойств. Однако такое применение устарело в glibc 2.25, и начиная с glibc 2.28, эти определения были удалены из I<E<lt>sys/types.hE<gt>>.

source: mq_getattr, mq_setattr - get/set message queue attributes
ru: mq_getattr, mq_setattr - возвращает/изменяет атрибуты очереди сообщений

source: B<mq_getattr>() and B<mq_setattr>() respectively retrieve and modify attributes of the message queue referred to by the message queue descriptor I<mqdes>.
ru: Функция B<mq_getattr>() и B<mq_setattr>(), соответственно, возвращает и изменяет атрибуты очереди сообщений, на которую ссылается дескриптор очереди сообщений I<mqdes>.

source: B<mq_getattr>() returns an I<mq_attr> structure in the buffer pointed by I<attr>. This structure is defined as:
ru: Функция B<mq_getattr>() возвращает структуру I<mq_attr> в буфер, указанный в I<attr>. Эта структура определена следующим образом:

source: struct mq_attr { long mq_flags; /* Flags: 0 or O_NONBLOCK */ long mq_maxmsg; /* Max. # of messages on queue */ long mq_msgsize; /* Max. message size (bytes) */ long mq_curmsgs; /* # of messages currently in queue */ };
ru: struct mq_attr { long mq_flags; /* флаги: 0 или O_NONBLOCK */ long mq_maxmsg; /* макс. кол-во сообщений в очереди */ long mq_msgsize; /* макс. размер сообщения (в байтах) */ long mq_curmsgs; /* кол-во сообщений в очереди в данный момент */ };

source: The I<mq_flags> field contains flags associated with the open message queue description. This field is initialized when the queue is created by B<mq_open>(3). The only flag that can appear in this field is B<O_NONBLOCK>.
ru: В поле I<mq_flags> содержатся флаги, связанные с открытым описанием очереди сообщений. Это поле инициализируется при создании очереди с помощью B<mq_open>(3). В этом поле может содержаться только флаг B<O_NONBLOCK>.

source: The I<mq_maxmsg> and I<mq_msgsize> fields are set when the message queue is created by B<mq_open>(3). The I<mq_maxmsg> field is an upper limit on the number of messages that may be placed on the queue using B<mq_send>(3). The I<mq_msgsize> field is an upper limit on the size of messages that may be placed on the queue. Both of these fields must have a value greater than zero. Two I</proc> files that place ceilings on the values for these fields are described in B<mq_overview>(7).
ru: Поля I<mq_maxmsg> и I<mq_msgsize> заполняются при создании очереди сообщений с помощью B<mq_open>(3). В поле I<mq_maxmsg> содержится верхний предел на количество сообщений, которое может поместиться в очереди с помощью B<mq_send>(3). В поле I<mq_msgsize> содержится верхний предел на размер сообщений, которые могут помещаться в очередь. Значение обоих полей должно быть больше нуля. Два файла в I</proc>, в которых размещаются значения этих полей, описаны в B<mq_overview>(7).

source: The I<mq_curmsgs> field returns the number of messages currently held in the queue.
ru: В поле I<mq_curmsgs> возвращается количество сообщений в очереди в текущей момент времени.

source: B<mq_setattr>() sets message queue attributes using information supplied in the I<mq_attr> structure pointed to by I<newattr>. The only attribute that can be modified is the setting of the B<O_NONBLOCK> flag in I<mq_flags>. The other fields in I<newattr> are ignored. If the I<oldattr> field is not NULL, then the buffer that it points to is used to return an I<mq_attr> structure that contains the same information that is returned by B<mq_getattr>().
ru: Функция B<mq_setattr>() изменяет атрибуты очереди согласно информации из передаваемой структуры I<mq_attr>, на которую указывает I<newattr>. Единственным атрибутом, который можно изменить, является флаг B<O_NONBLOCK> в I<mq_flags>. Остальные поля в I<newattr> игнорируются. Если поле I<oldattr> не равно NULL, то буфер, на который оно указывает, используется для возврата структуры I<mq_attr>, с той же информацией как после вызова B<mq_getattr>().

source: On success B<mq_getattr>() and B<mq_setattr>() return 0; on error, -1 is returned, with I<errno> set to indicate the error.
ru: При успешном выполнении B<mq_getattr>() и B<mq_setattr>() возвращается 0; при ошибке возвращается -1, а в I<errno> помещается код ошибки.

source: The message queue descriptor specified in I<mqdes> is invalid.
ru: В I<mqdes> размещён некорректный дескриптор очереди сообщений.

source: I<newattr-E<gt>mq_flags> contained set bits other than B<O_NONBLOCK>.
ru: В I<newattr-E<gt>mq_flags> содержится набор битов, отличный от B<O_NONBLOCK>.

source: On Linux, B<mq_getattr>() and B<mq_setattr>() are library functions layered on top of the B<mq_getsetattr>(2) system call.
ru: В Linux, B<mq_getattr>() и B<mq_setattr>() является библиотечными функциями, реализованными на основе системного вызова B<mq_getsetattr>(2).

source: The program below can be used to show the default I<mq_maxmsg> and I<mq_msgsize> values that are assigned to a message queue that is created with a call to B<mq_open>(3) in which the I<attr> argument is NULL. Here is an example run of the program:
ru: Программу, представленную ниже, можно использовать для просмотра значений по умолчанию I<mq_maxmsg> и I<mq_msgsize>, которые назначаются очереди сообщений, создаваемой вызовом B<mq_open>(3) с аргументом I<attr>, равным NULL. Пример работы программы:

source: $ B<./a.out /testq> Maximum # of messages on queue: 10 Maximum message size: 8192
ru: $ B<./a.out /testq> Максимальное количество сообщений в очереди: 10 Максимальный размер сообщения: 8192

source: Since Linux 3.5, the following I</proc> files (described in B<mq_overview>(7)) can be used to control the defaults:
ru: Начиная с Linux 3.5 для управления значениями по умолчанию можно использовать следующие файлы в I</proc> (описаны в B<mq_overview>(7)):

source: if (argc != 2) { fprintf(stderr, "Usage: %s mq-name\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s mq-name\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("Maximum # of messages on queue: %ld\en", attr.mq_maxmsg); printf("Maximum message size: %ld\en", attr.mq_msgsize);
ru: printf("Максимальное количество сообщений в очереди: %ld\en", attr.mq_maxmsg); printf("Максимальный размер сообщения: %ld\en", attr.mq_msgsize);

source: mq_notify - register for notification when a message is available
ru: mq_notify - включает уведомление при поступлении сообщения

source: B<mq_notify>() allows the calling process to register or unregister for delivery of an asynchronous notification when a new message arrives on the empty message queue referred to by the message queue descriptor I<mqdes>.
ru: Функция B<mq_notify>() позволяет вызывающему процессу регистрироваться или отменять регистрацию доставки анонимных уведомлений при появлении нового сообщения в пустой очереди сообщений, на которую ссылается дескриптор очереди сообщений I<mqdes>.

source: The I<sevp> argument is a pointer to a I<sigevent> structure. For the definition and general details of this structure, see B<sigevent>(7).
ru: Аргумент I<sevp> является указателем на структуру I<sigevent>. Определение и описание структуры смотрите в B<sigevent>(7).

source: If I<sevp> is a non-null pointer, then B<mq_notify>() registers the calling process to receive message notification. The I<sigev_notify> field of the I<sigevent> structure to which I<sevp> points specifies how notification is to be performed. This field has one of the following values:
ru: Если I<sevp> не равен null, то B<mq_notify>() регистрирует вызывающий процесс для получения уведомлений о сообщениях. В поле I<sigev_notify> структуры I<sigevent>, на которую указывает I<sevp>, задаётся способ выполнения уведомления. Это поле может содержать одно из следующих значений:

source: A "null" notification: the calling process is registered as the target for notification, but when a message arrives, no notification is sent.
ru: «Нулевое» уведомление: хотя вызывающий процесс и регистрируется как уведомляемый, при появлении сообщения уведомление не будет отправлено.

source: Notify the process by sending the signal specified in I<sigev_signo>. See B<sigevent>(7) for general details. The I<si_code> field of the I<siginfo_t> structure will be set to B<SI_MESGQ>. In addition, I<si_pid> will be set to the PID of the process that sent the message, and I<si_uid> will be set to the real user ID of the sending process.
ru: Уведомлять процесс посредством отправки сигнала, указанного в I<sigev_signo>. Подробности смотрите в B<sigevent>(7). Поле I<si_code> структуры I<siginfo_t> будет изменено на B<SI_MESGQ>. Также, значение I<si_pid> будет изменено на PID процесса, который посылается сообщение, а значение I<si_uid> будет изменено на реальный пользовательский ID посылающего процесса.

source: Upon message delivery, invoke I<sigev_notify_function> as if it were the start function of a new thread. See B<sigevent>(7) for details.
ru: При доставке сообщения вызвать I<sigev_notify_function>, как если бы это была начальная функция новой нити. Подробности смотрите в B<sigevent>(7).

source: Only one process can be registered to receive notification from a message queue.
ru: Только один процесс может быть зарегистрирован, чтобы получить уведомление из очереди сообщений.

source: If I<sevp> is NULL, and the calling process is currently registered to receive notifications for this message queue, then the registration is removed; another process can then register to receive a message notification for this queue.
ru: Если I<sevp> равно NULL и вызывающий процесс уже зарегистрирован принимать сообщения для этой очереди сообщений, то регистрация удаляется; после этого другой процесс может зарегистрироваться для получения уведомлений о сообщениях в этой очереди.

source: Message notification occurs only when a new message arrives and the queue was previously empty. If the queue was not empty at the time B<mq_notify>() was called, then a notification will occur only after the queue is emptied and a new message arrives.
ru: Уведомление о сообщение возникает только при поступлении нового сообщения и если очередь до этого была пуста. Если очередь не пуста на момент вызова B<mq_notify>(), то уведомление будет происходить только после опустошения очереди и поступлении нового сообщения.

source: If another process or thread is waiting to read a message from an empty queue using B<mq_receive>(3), then any message notification registration is ignored: the message is delivered to the process or thread calling B<mq_receive>(3), and the message notification registration remains in effect.
ru: Если другой процесс или нить ожидают чтения сообщения из пустой очереди с помощью B<mq_receive>(3), то все регистрации по уведомлению игнорируются; сообщение доставляется процесс или нити вызвавшей B<mq_receive>(3), и регистрация уведомления о сообщении остаётся как была.

source: Notification occurs once: after a notification is delivered, the notification registration is removed, and another process can register for message notification. If the notified process wishes to receive the next notification, it can use B<mq_notify>() to request a further notification. This should be done before emptying all unread messages from the queue. (Placing the queue in nonblocking mode is useful for emptying the queue of messages without blocking once it is empty.)
ru: Уведомление выполняется один раз: после доставки уведомления регистрация удаляется и другой процесс может зарегистрироваться для уведомления. Если уведомлённый процесс хочет получить следующее уведомление, то он может использовать B<mq_notify>() для запроса уведомления в дальнейшем. Это должно быть сделано до исчезновения всех непрочитанных сообщений из очереди (переключение очереди в неблокирующий режим полезно для опустошения очереди сообщений без блокировки, если очередь пуста).

source: On success B<mq_notify>() returns 0; on error, -1 is returned, with I<errno> set to indicate the error.
ru: При успешном выполнении B<mq_notify>() возвращает 0; при ошибке возвращает -1, а в I<errno> помещается код ошибки.

source: Another process has already registered to receive notification for this message queue.
ru: Другой процесс уже зарегистрировался, чтобы получать уведомление из этой очереди сообщений.

source: I<sevp-E<gt>sigev_notify> is not one of the permitted values; or I<sevp-E<gt>sigev_notify> is B<SIGEV_SIGNAL> and I<sevp-E<gt>sigev_signo> is not a valid signal number.
ru: Значение I<sevp-E<gt>sigev_notify> содержит недопустимое значение; или I<sevp-E<gt>sigev_notify> равно B<SIGEV_SIGNAL> и I<sevp-E<gt>sigev_signo> не содержит корректного номера сигнала.

source: Insufficient memory.
ru: Недостаточно памяти.

source: POSIX.1-2008 says that an implementation I<may> generate an B<EINVAL> error if I<sevp> is NULL, and the caller is not currently registered to receive notifications for the queue I<mqdes>.
ru: В POSIX.1-2008 сказано, что реализация I<может> генерировать ошибку B<EINVAL>, если I<sevp> равно NULL, и вызывающий ещё не зарегистрирован для получения уведомлений из очереди I<mqdes>.

source: In the glibc implementation, the B<mq_notify>() library function is implemented on top of the system call of the same name. When I<sevp> is NULL, or specifies a notification mechanism other than B<SIGEV_THREAD>, the library function directly invokes the system call. For B<SIGEV_THREAD>, much of the implementation resides within the library, rather than the kernel. (This is necessarily so, since the thread involved in handling the notification is one that must be managed by the C library POSIX threads implementation.) The implementation involves the use of a raw B<netlink>(7) socket and creates a new thread for each notification that is delivered to the process.
ru: В glibc библиотечная функция B<mq_notify>() реализована на основе системного вызова с тем же именем. Если I<sevp> равно NULL или задаёт механизм уведомления не B<SIGEV_THREAD>, то библиотечная функция напрямую вызывает системный вызов. Большая часть реализации B<SIGEV_THREAD> располагается внутри библиотеки, а не в ядре (эта необходимость возникает из-за того, что нить, вовлечённая в обработку уведомления, должна управляться в библиотечной реализации C нитей POSIX). В реализации задействуется неструктурированный сокет B<netlink>(7) и создаётся новая нить для каждого уведомления, доставляемого процессу.

source: The following program registers a notification request for the message queue named in its command-line argument. Notification is performed by creating a thread. The thread executes a function which reads one message from the queue and then terminates the process.
ru: В следующей программе показана регистрация запроса уведомления для очереди сообщений с именем, указанном в аргументе командной строки. Уведомление выполняется создаваемой нитью. Нить выполняет функцию, которая читает одно сообщение из очереди и завершает процесс.

source: static void /* Thread start function */ tfunc(union sigval sv) { struct mq_attr attr; ssize_t nr; void *buf; mqd_t mqdes = *((mqd_t *) sv.sival_ptr);
ru: static void /* начальная функция нити */ tfunc(union sigval sv) { struct mq_attr attr; ssize_t nr; void *buf; mqd_t mqdes = *((mqd_t *) sv.sival_ptr);

source: /* Determine max. msg size; allocate buffer to receive msg */
ru: /* Определяем максимальный размер сообщения; выделяем буфер для принимаемого сообщения */
