Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: motd - message of the day
ru: motd - сообщение дня

source: The contents of I</etc/motd> are displayed by B<login>(1) after a successful login but just before it executes the login shell.
ru: Содержимое файла I</etc/motd> отображается программой B<login>(1) после осуществления успешного входа в систему, перед запуском командного интерпретатора.

source: The abbreviation "motd" stands for "message of the day", and this file has been traditionally used for exactly that (it requires much less disk space than mail to all users).
ru: Сокращение "motd" расшифровывается как "message of the day" (сообщение дня), и данный файл традиционно используется именно для этой цели (он требует гораздо меньше дискового пространства, чем почтовое сообщение каждому пользователю).

source: mbtowc - convert a multibyte sequence to a wide character
ru: mbtowc - преобразовывает мультибайтовую последовательность в широкий символ

source: The main case for this function is when I<s> is not NULL and I<pwc> is not NULL. In this case, the B<mbtowc>() function inspects at most I<n> bytes of the multibyte string starting at I<s>, extracts the next complete multibyte character, converts it to a wide character and stores it at I<*pwc>. It updates an internal shift state known only to the B<mbtowc>() function. If I<s> does not point to a null byte (\(aq\e0\(aq), it returns the number of bytes that were consumed from I<s>, otherwise it returns 0.
ru: Обычно в эту функцию передают I<s> и I<pwc> не равные NULL. В этом случае функция B<mbtowc>() просматривает не более I<n> байт многобайтовой строки, начиная с I<s>, извлекает следующий полный многобайтовый символ, преобразует его в широкий символ и сохраняет его в I<*pwc>. Она обновляет внутренне состояние сдвига, доступное только функции B<mbtowc>(). Если I<s> не указывает на байт null (\(aq\e0\(aq), то она возвращает количество байт, которые были потрачены из I<s>, в противном случае возвращается 0.

source: If the I<n> bytes starting at I<s> do not contain a complete multibyte character, or if they contain an invalid multibyte sequence, B<mbtowc>() returns -1. This can happen even if I<n> E<gt>= I<MB_CUR_MAX>, if the multibyte string contains redundant shift sequences.
ru: Если в I<n> байтах, начиная с I<s>, не содержится полного многобайтового символа или если в них содержится некорректный многобайтовый символ, то B<mbtowc>() возвращает -1. Это может произойти даже если I<n> E<gt>= I<MB_CUR_MAX>, если в многобайтовой строке содержится лишние сдвиговые последовательности.

source: A different case is when I<s> is not NULL but I<pwc> is NULL. In this case, the B<mbtowc>() function behaves as above, except that it does not store the converted wide character in memory.
ru: Ещё случай, когда I<s> не равно NULL, а I<pwc> равно NULL. В этом случае функция B<mbtowc>() действует как описано выше, но не сохраняет преобразованный широкий символ в памяти.

source: A third case is when I<s> is NULL. In this case, I<pwc> and I<n> are ignored. The B<mbtowc>() function resets the shift state, only known to this function, to the initial state, and returns nonzero if the encoding has nontrivial shift state, or zero if the encoding is stateless.
ru: И третий вариант, когда I<s> равно NULL. В этом случае I<pwc> и I<n> игнорируются. Функция B<mbtowc>() сбрасывает состояние сдвига, известное только ей, в начальное состояние и возвращает не ноль, если кодировка имеет непростое состояние сдвига, или ноль, если кодировка не имеет состояний.

source: If I<s> is not NULL, the B<mbtowc>() function returns the number of consumed bytes starting at I<s>, or 0 if I<s> points to a null byte, or -1 upon failure.
ru: Если I<s> не равно NULL, то функция B<mbtowc>() возвращает количество потраченных байт, начиная с I<s>, или 0, если I<s> указывает на байт null, или -1 — при ошибке.

source: If I<s> is NULL, the B<mbtowc>() function returns nonzero if the encoding has nontrivial shift state, or zero if the encoding is stateless.
ru: Если значение I<s> равно NULL, то функция B<mbtowc>() возвращает не ноль, если кодировка имеет необычное смещение, или ноль, если кодировка не имеет смещения.

source: The behavior of B<mbtowc>() depends on the B<LC_CTYPE> category of the current locale.
ru: Поведение B<mbtowc>() зависит от категории B<LC_CTYPE> текущей локали.

source: This function is not multithread safe. The function B<mbrtowc>(3) provides a better interface to the same functionality.
ru: Данную функцию небезопасно использовать в нитях. Для этого лучше подходит функция B<mbrtowc>(3) с тем же интерфейсом.

source: mq_receive, mq_timedreceive - receive a message from a message queue
ru: mq_receive, mq_timedreceive - выбирают сообщения из очереди сообщений

source: Link with I<-lrt>.
ru: Компонуется при указании параметра I<-lrt>.

source: B<mq_receive>() removes the oldest message with the highest priority from the message queue referred to by the message queue descriptor I<mqdes>, and places it in the buffer pointed to by I<msg_ptr>. The I<msg_len> argument specifies the size of the buffer pointed to by I<msg_ptr>; this must be greater than or equal to the I<mq_msgsize> attribute of the queue (see B<mq_getattr>(3)). If I<msg_prio> is not NULL, then the buffer to which it points is used to return the priority associated with the received message.
ru: Функция B<mq_receive>() удаляет самое старое сообщение с наивысшим приоритетом из очереди сообщений, на которою указывает дескриптор очереди сообщений I<mqdes>, и помещает сообщение в буфер, на который указывает I<msg_ptr>. В аргументе I<msg_len> задаётся размер буфера, на который указывает I<msg_ptr>; он должен быть больше или равен атрибуту очереди I<mq_msgsize> (смотрите B<mq_getattr>(3)). Если I<msg_prio> не равно NULL, то указанный в нём буфер используется для возврата приоритета, связанного с полученным сообщением.

source: If the queue is empty, then, by default, B<mq_receive>() blocks until a message becomes available, or the call is interrupted by a signal handler. If the B<O_NONBLOCK> flag is enabled for the message queue description, then the call instead fails immediately with the error B<EAGAIN>.
ru: Если очередь пуста, то по умолчанию функция B<mq_receive>() блокирует выполнение до тех пор, показ не поступит сообщение или вызов не будет прерван обработчиком сигнала. Если в описании очереди сообщений включён флаг B<O_NONBLOCK>, то вызов завершается сразу же с ошибкой B<EAGAIN>.

source: B<mq_timedreceive>() behaves just like B<mq_receive>(), except that if the queue is empty and the B<O_NONBLOCK> flag is not enabled for the message queue description, then I<abs_timeout> points to a structure which specifies how long the call will block. This value is an absolute timeout in seconds and nanoseconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC), specified in the following structure:
ru: Функция B<mq_timedreceive>() действует подобно B<mq_receive>(), за исключением того, что если очередь пуста и в описании очереди сообщений не установлен флаг B<O_NONBLOCK>, то I<abs_timeout> указывает на структуру, которой задаётся длительность блокировки вызова. Это абсолютное значение задаётся в секундах и наносекундах начиная с Эпохи, 1970-01-01 00:00:00 +0000 (UTC) в структуре вида:

source: struct timespec { time_t tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
ru: struct timespec { time_t tv_sec; /* секунды */ long tv_nsec; /* наносекунды */ };

source: If no message is available, and the timeout has already expired by the time of the call, B<mq_timedreceive>() returns immediately.
ru: Если сообщения нет и вышло время ожидания на момент вызова, то B<mq_timedreceive>() сразу же завершается.

source: On success, B<mq_receive>() and B<mq_timedreceive>() return the number of bytes in the received message; on error, -1 is returned, with I<errno> set to indicate the error.
ru: При успешном выполнении B<mq_receive>() и B<mq_timedreceive>() возвращается количество байт в полученном сообщении; при ошибке возвращается -1 и в I<errno> записывается значение ошибки.

source: The queue was empty, and the B<O_NONBLOCK> flag was set for the message queue description referred to by I<mqdes>.
ru: Очередь была пуста и в описании очереди сообщений, на которое ссылается I<mqdes>, указан флаг B<O_NONBLOCK>.

source: The descriptor specified in I<mqdes> was invalid or not opened for reading.
ru: В I<mqdes> указан некорректный или не открытый на чтение дескриптор.

source: The call was interrupted by a signal handler; see B<signal>(7).
ru: Вызов был прерван обработчиком сигнала; смотрите B<signal>(7).

source: The call would have blocked, and I<abs_timeout> was invalid, either because I<tv_sec> was less than zero, or because I<tv_nsec> was less than zero or greater than 1000 million.
ru: Вызов бы заблокировался и в I<abs_timeout> указано некорректное значение, так как I<tv_sec> меньше нуля или I<tv_nsec> меньше нуля или более 1000 миллионов.

source: I<msg_len> was less than the I<mq_msgsize> attribute of the message queue.
ru: I<msg_len> меньше чем свойство очереди сообщений, I<mq_msgsize>.

source: The call timed out before a message could be transferred.
ru: Истёк период ожидания в вызове, раньше появления возможности передачи сообщения.

source: On Linux, B<mq_timedreceive>() is a system call, and B<mq_receive>() is a library function layered on top of that system call.
ru: В Linux, B<mq_receive>() является системным вызовом, а B<mq_timedreceive>() — библиотечной функцией, реализованной на основе этого системного вызова:

source: memcmp - compare memory areas
ru: memcmp — сравнить области памяти

source: The B<memcmp>() function compares the first I<n> bytes (each interpreted as I<unsigned char>) of the memory areas I<s1> and I<s2>.
ru: Функция B<memcmp>() сравнивает первые I<n> байт (каждый как I<unsigned char>) из областей памяти I<s1> и I<s2>.

source: The B<memcmp>() function returns an integer less than, equal to, or greater than zero if the first I<n> bytes of I<s1> is found, respectively, to be less than, to match, or be greater than the first I<n> bytes of I<s2>.
ru: Функция B<memcmp>() возвращает целое число меньше, равное, или выше нуля если первые I<n> байт из I<s1> соответственно меньше, равны, или больше чем первые I<n> байт из I<s2>.

source: For a nonzero return value, the sign is determined by the sign of the difference between the first pair of bytes (interpreted as I<unsigned char>) that differ in I<s1> and I<s2>.
ru: Для возвращаемого значения, отличного от нуля, его знак определяется знаком разности первой пары байтов (которые I<unsigned char>) в I<s1> и I<s2>.

source: If I<n> is zero, the return value is zero.
ru: Если I<n> равно нулю, возвращаемое значение тоже ноль.

source: Do not use B<memcmp>() to compare security critical data, such as cryptographic secrets, because the required CPU time depends on the number of equal bytes. Instead, a function that performs comparisons in constant time is required. Some operating systems provide such a function (e.g., NetBSD's B<consttime_memequal>()), but no such function is specified in POSIX. On Linux, it may be necessary to implement such a function oneself.
ru: Не используйте B<memcmp>() для сравнения важных с точки зрения безопасности данных, как например криптографические секреты, потому что для этой функции требуемое время CPU зависит от числа одинаковых байтов. Используйте функции, производящие сравнение за constant time. (Например в NetBSD функция B<consttime_memequal>()). В POSIX подобная функция не предусмотрена.

source: matherr - SVID math library exception handling
ru: matherr - библиотека SVID для обработки математических исключений

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: I<Note>: the mechanism described in this page is no longer supported by glibc. Before glibc 2.27, it had been marked as obsolete. Since glibc 2.27, the mechanism has been removed altogether. New applications should use the techniques described in B<math_error>(7) and B<fenv>(3). This page documents the B<matherr>() mechanism as an aid for maintaining and porting older applications.
ru: I<Замечание>: механизм, описанный на этой странице, больше не поддерживается glibc. До glibc 2.27 он был помечен как устаревший. Начиная с glibc 2.27, механизм был полностью удалён. В новых приложениях нужно использовать методы, описанные в B<math_error>(7) и B<fenv>(3). На этой странице описан механизм B<matherr>() с целью сопровождения и переноса старых приложений.

source: The System V Interface Definition (SVID) specifies that various math functions should invoke a function called B<matherr>() if a math exception is detected. This function is called before the math function returns; after B<matherr>() returns, the system then returns to the math function, which in turn returns to the caller.
ru: В System V Interface Definition (SVID) определено какие математические функции должны вызывать функцию B<matherr>(), если обнаруживается математическое исключение. Эта функция вызывает до возврата из самой математической функции; после возврата из B<matherr>() система возвращается в математическую функцию, которая, в свою очередь, возвращает управление вызывающему.

source: To employ B<matherr>(), the programmer must define the B<_SVID_SOURCE> feature test macro (before including I<any> header files), and assign the value B<_SVID_> to the external variable B<_LIB_VERSION>.
ru: Чтобы задействовать B<matherr>(), программист должен определить макрос тестирования свойств B<_SVID_SOURCE> (до включения I<каких-либо> заголовочных файлов) и присвоить значение B<_SVID_> внешней переменной B<_LIB_VERSION>.

source: The system provides a default version of B<matherr>(). This version does nothing, and returns zero (see below for the significance of this). The default B<matherr>() can be overridden by a programmer-defined version, which will be invoked when an exception occurs. The function is invoked with one argument, a pointer to an I<exception> structure, defined as follows:
ru: Система предоставляет B<matherr>() как версию по умолчанию. Эта версия ничего не делает возвращает ноль (назначение этого смотрите далее). Версия по умолчанию B<matherr>() может быть перезаписана версией программиста, которая будет вызываться при возникновении исключений. Функция вызывается с одним аргументом, указателем на структуру I<exception>, определённую следующим образом:

source: struct exception { int type; /* Exception type */ char *name; /* Name of function causing exception */ double arg1; /* 1st argument to function */ double arg2; /* 2nd argument to function */ double retval; /* Function return value */ }
ru: struct exception { int type; /* тип исключения */ char *name; /* имя функции, вызвавшей исключение */ double arg1; /* 1-й аргумент функции */ double arg2; /* 2-й аргумент функции */ double retval; /* значение, возвращаемое функцией */ }

source: The I<type> field has one of the following values:
ru: В поле I<type> может быть одно из следующих значений:

source: A domain error occurred (the function argument was outside the range for which the function is defined). The return value depends on the function; I<errno> is set to B<EDOM>.
ru: Произошла ошибка области (аргумент функции вне диапазона, для которого определена функция). Возвращаемое значение зависит от функции; I<errno> присваивается B<EDOM>.

source: A pole error occurred (the function result is an infinity). The return value in most cases is B<HUGE> (the largest single precision floating-point number), appropriately signed. In most cases, I<errno> is set to B<EDOM>.
ru: Произошла ошибка особой точки (результат функции равен бесконечности). Возвращаемое значение, в большинстве случаев, равно B<HUGE> (самое большое число с плавающей запятой одинарной точности) с соответствующим знаком. В большинстве случаев, I<errno> присваивается B<EDOM>.

source: An overflow occurred. In most cases, the value B<HUGE> is returned, and I<errno> is set to B<ERANGE>.
ru: Возникло переполнение. В большинстве случаев, возвращается значение B<HUGE> и I<errno> присваивается B<ERANGE>.

source: An underflow occurred. 0.0 is returned, and I<errno> is set to B<ERANGE>.
ru: Произошла потеря значимости. Возвращается 0.0 и I<errno> присваивается B<ERANGE>.

source: Total loss of significance. 0.0 is returned, and I<errno> is set to B<ERANGE>.
ru: Полная потеря значимости. Возвращается 0.0 и I<errno> присваивается B<ERANGE>.

source: Partial loss of significance. This value is unused on glibc (and many other systems).
ru: Частичная потеря значимости. Это значение не используется в glibc (и многих других системах).

source: The I<arg1> and I<arg2> fields are the arguments supplied to the function (I<arg2> is undefined for functions that take only one argument).
ru: Поля I<arg1> и I<arg2> это значения аргументов, переданных функции (I<arg2> не определено для функций, у которых только один аргумент).

source: The I<retval> field specifies the return value that the math function will return to its caller. The programmer-defined B<matherr>() can modify this field to change the return value of the math function.
ru: В поле I<retval> указывается возвращаемое значение, которое математическая функция вернёт вызывающему. Написанная программистом B<matherr>() может изменить этого поле, чтобы вернуть другое значение из математической функции.

source: If the B<matherr>() function returns zero, then the system sets I<errno> as described above, and may print an error message on standard error (see below).
ru: Если функция B<matherr>() возвращает ноль, то система изменяет I<errno> как описано выше и может вывести сообщение об ошибке в стандартный поток ошибок (смотрите далее).

source: If the B<matherr>() function returns a nonzero value, then the system does not set I<errno>, and doesn't print an error message.
ru: Если функция B<matherr>() возвращает ненулевое значение, то система не изменяет I<errno> и не печатает сообщение об ошибке.

source: Math functions that employ matherr()
ru: Математические функции, которые используют matherr()

source: The table below lists the functions and circumstances in which B<matherr>() is called. The "Type" column indicates the value assigned to I<exc-E<gt>type> when calling B<matherr>(). The "Result" column is the default return value assigned to I<exc-E<gt>retval>.
ru: В таблице далее перечислены функции и обстоятельства вызова B<matherr>(). В столбце «тип» показано значение, назначаемое I<exc-E<gt>type>, когда вызывается B<matherr>(). В столбце «результат» содержится возвращаемое значение по умолчанию. назначаемое I<exc-E<gt>retval>.

source: The "Msg?" and "errno" columns describe the default behavior if B<matherr>() returns zero. If the "Msg?" columns contains "y", then the system prints an error message on standard error.
ru: В столбцах «сообщение?» и «errno» описано поведение по умолчанию, если B<matherr>() возвращает ноль. Если в «сообщение?» указано «y», то система выводит сообщение об ошибке в стандартный поток ошибок.

source: The table uses the following notations and abbreviations:
ru: В таблице используются следующие обозначения и сокращения:

source: x first argument to function y second argument to function fin finite value for argument neg negative value for argument int integral value for argument o/f result overflowed u/f result underflowed |x| absolute value of x X_TLOSS is a constant defined in I<E<lt>math.hE<gt>>
ru: x первый аргумент функции y второй аргумент функции fin конечное значение аргумента neg отрицательное значение аргумента int целочисленное значение аргумента o/f переполнение результата u/f потеря значимости результата |x| абсолютное значение x X_TLOSS константа, определённая в I<E<lt>math.hE<gt>>

source: Function
ru: функция

source: Type
ru: тип

source: Result
ru: результат

source: Msg?
ru: Сообщение?

source: lgamma(-int) or
ru: lgamma(-int) или

source: The example program demonstrates the use of B<matherr>() when calling B<log>(3). The program takes up to three command-line arguments. The first argument is the floating-point number to be given to B<log>(3). If the optional second argument is provided, then B<_LIB_VERSION> is set to B<_SVID_> so that B<matherr>() is called, and the integer supplied in the command-line argument is used as the return value from B<matherr>(). If the optional third command-line argument is supplied, then it specifies an alternative return value that B<matherr>() should assign as the return value of the math function.
ru: В примере программы показано использование B<matherr>() при вызове B<log>(3). Программа имеет три аргумента командной строки. Первый аргумент — число с плавающей запятой, передаваемое в B<log>(3). Если указан необязательный второй аргумент, то B<_LIB_VERSION> присваивается значение B<_SVID_> для того, чтобы вызывалась B<matherr>(), и указанное в командной строке целое число используется как возвращаемое значение B<matherr>(). Если указан необязательный третий аргумент, то им определяется альтернативное возвращаемое значение, которое B<matherr>() должна вернуть как результат математической функции.

source: The following example run, where B<log>(3) is given an argument of 0.0, does not use B<matherr>():
ru: Пример запуска, где в B<log>(3) передаётся аргумент 0.0 и не используется B<matherr>():

source: $B< ./a.out 0.0> errno: Numerical result out of range x=-inf
ru: $B< ./a.out 0.0> errno: Числовой результат вне представимого диапазона x=-inf

source: In the following run, B<matherr>() is called, and returns 0:
ru: В следующем примере вызывается функция B<matherr>() и возвращает 0:

source: $B< ./a.out 0.0 0> matherr SING exception in log() function args: 0.000000, 0.000000 retval: -340282346638528859811704183484516925440.000000 log: SING error errno: Numerical argument out of domain x=-340282346638528859811704183484516925440.000000
ru: $B< ./a.out 0.0 0> исключение matherr SING в функции log() арг: 0.000000, 0.000000 возвр.знач.: -340282346638528859811704183484516925440.000000 log: SING error errno: Числовой аргумент вне области функции x=-340282346638528859811704183484516925440.000000

source: The message "log: SING error" was printed by the C library.
ru: Сообщение «log: SING error» выдаётся библиотекой Си.

source: In the following run, B<matherr>() is called, and returns a nonzero value:
ru: В следующем примере вызывается функция B<matherr>() и возвращается не нулевое значение:

source: $B< ./a.out 0.0 1> matherr SING exception in log() function args: 0.000000, 0.000000 retval: -340282346638528859811704183484516925440.000000 x=-340282346638528859811704183484516925440.000000
ru: $B< ./a.out 0.0 1> исключение matherr SING в функции log() арг: 0.000000, 0.000000 возвр.знач.: -340282346638528859811704183484516925440.000000 x=-340282346638528859811704183484516925440.000000

source: In this case, the C library did not print a message, and I<errno> was not set.
ru: В этом случае библиотека Си не печатает сообщение, и значение I<errno> не изменяется.

source: In the following run, B<matherr>() is called, changes the return value of the math function, and returns a nonzero value:
ru: В следующем примере вызывается функция B<matherr>(), изменяется возвращаемое значение математической функции и возвращается ненулевое значение:

source: $B< ./a.out 0.0 1 12345.0> matherr SING exception in log() function args: 0.000000, 0.000000 retval: -340282346638528859811704183484516925440.000000 x=12345.000000
ru: $B< ./a.out 0.0 1 12345.0> исключение matherr SING в функции log() арг: 0.000000, 0.000000 возвр.знач.: -340282346638528859811704183484516925440.000000 x=12345.000000
