Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Use of a mapped region can result in these signals:
ru: При использовании отображаемой области памяти могут возникать следующие сигналы:

source: Attempted write into a region mapped as read-only.
ru: Попытка записи в область, отображённую только для чтения.

source: Attempted access to a portion of the buffer that does not correspond to the file (for example, beyond the end of the file, including the case where another process has truncated the file).
ru: Попытка доступа к части буфера, которая не совпадает файлом (например, она может находиться за пределами файла. Подобной является ситуация, когда другой процесс уменьшил длину файла).

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: AVAILABILITY
ru: ДОСТУПНОСТЬ

source: On POSIX systems on which B<mmap>(), B<msync>(2), and B<munmap>() are available, B<_POSIX_MAPPED_FILES> is defined in I<E<lt>unistd.hE<gt>> to a value greater than 0. (See also B<sysconf>(3).)
ru: В системах POSIX, в которых есть вызовы B<mmap>(), B<msync>(2) и B<munmap>(), значение B<_POSIX_MAPPED_FILES>, определённое в I<E<lt>unistd.hE<gt>>, больше 0 (смотрите также B<sysconf>(3)).

source: On some hardware architectures (e.g., i386), B<PROT_WRITE> implies B<PROT_READ>. It is architecture dependent whether B<PROT_READ> implies B<PROT_EXEC> or not. Portable programs should always set B<PROT_EXEC> if they intend to execute code in the new mapping.
ru: На некоторых архитектурах (например, i386), флаг B<PROT_WRITE> подразумевает флаг B<PROT_READ>. Также от архитектуры зависит подразумевает ли B<PROT_READ> флаг B<PROT_EXEC> или нет. Переносимые программы должны всегда устанавливать B<PROT_EXEC>, если они собираются выполнять код, находящийся в отображении.

source: The portable way to create a mapping is to specify I<addr> as 0 (NULL), and omit B<MAP_FIXED> from I<flags>. In this case, the system chooses the address for the mapping; the address is chosen so as not to conflict with any existing mapping, and will not be 0. If the B<MAP_FIXED> flag is specified, and I<addr> is 0 (NULL), then the mapped address will be 0 (NULL).
ru: Переносимый способ создания отображения: указать в I<addr> значение 0 (NULL) и убрать B<MAP_FIXED> из I<flags>. В этом случае, система сама выберет адрес для отображения; адрес, выбранный таким образом, не будет будет конфликтовать с существующими отображениями и не будет равен 0. Если указан флаг B<MAP_FIXED> и значение I<addr> равно 0 (NULL), то адрес отображения будет равен 0 (NULL).

source: Certain I<flags> constants are defined only if suitable feature test macros are defined (possibly by default): B<_DEFAULT_SOURCE> with glibc 2.19 or later; or B<_BSD_SOURCE> or B<_SVID_SOURCE> in glibc 2.19 and earlier. (Employing B<_GNU_SOURCE> also suffices, and requiring that macro specifically would have been more logical, since these flags are all Linux-specific.) The relevant flags are: B<MAP_32BIT>, B<MAP_ANONYMOUS> (and the synonym B<MAP_ANON>), B<MAP_DENYWRITE>, B<MAP_EXECUTABLE>, B<MAP_FILE>, B<MAP_GROWSDOWN>, B<MAP_HUGETLB>, B<MAP_LOCKED>, B<MAP_NONBLOCK>, B<MAP_NORESERVE>, B<MAP_POPULATE>, and B<MAP_STACK>.
ru: Некоторые константы I<flags> определены только, если определён подходящий макрос тестирования свойств (возможно, по умолчанию): B<_DEFAULT_SOURCE> в glibc 2.19 и новее; B<_BSD_SOURCE> или B<_SVID_SOURCE> в glibc 2.19 и старее (также достаточно использовать B<_GNU_SOURCE> и требовать, этот макрос логично, так как данные флаги есть только в Linux). Соответственно, флаги: B<MAP_32BIT>, B<MAP_ANONYMOUS> (и синоним B<MAP_ANON>), B<MAP_DENYWRITE>, B<MAP_EXECUTABLE>, B<MAP_FILE>, B<MAP_GROWSDOWN>, B<MAP_HUGETLB>, B<MAP_LOCKED>, B<MAP_NONBLOCK>, B<MAP_NORESERVE>, B<MAP_POPULATE> и B<MAP_STACK>.

source: An application can determine which pages of a mapping are currently resident in the buffer/page cache using B<mincore>(2).
ru: Приложение может определить какие страницы отображены в данный момент в буфере/страничном кэше с помощью B<mincore>(2).

source: Using MAP_FIXED safely
ru: Безопасное использование MAP_FIXED

source: The only safe use for B<MAP_FIXED> is where the address range specified by I<addr> and I<length> was previously reserved using another mapping; otherwise, the use of B<MAP_FIXED> is hazardous because it forcibly removes preexisting mappings, making it easy for a multithreaded process to corrupt its own address space.
ru: Единственным вариантом безопасного использования B<MAP_FIXED> является предварительное резервирование адресного пространства, указываемого в I<addr> и I<length>, другим отображением; в остальных случаях использование B<MAP_FIXED> опасно, так как оно выполняет принудительное удаление существующих отображений, что позволяет легко повредить собственное адресное пространство многонитевого процесса.

source: For example, suppose that thread A looks through I</proc/E<lt>pidE<gt>/maps> and in order to locate an unused address range that it can map using B<MAP_FIXED>, while thread B simultaneously acquires part or all of that same address range. When thread A subsequently employs B<mmap(MAP_FIXED)>, it will effectively clobber the mapping that thread B created. In this scenario, thread B need not create a mapping directly; simply making a library call that, internally, uses B<dlopen>(3) to load some other shared library, will suffice. The B<dlopen>(3) call will map the library into the process's address space. Furthermore, almost any library call may be implemented in a way that adds memory mappings to the address space, either with this technique, or by simply allocating memory. Examples include B<brk>(2), B<malloc>(3), B<pthread_create>(3), and the PAM libraries E<.UR http://www.linux-pam.org> E<.UE .>
ru: Предположим, например, что нить A просматривает I</proc/E<lt>pidE<gt>/maps>в поиске неиспользуемого адресного диапазона, который она сможет отобразить используя B<MAP_FIXED>, но одновременно с этим нить B захватывает часть или весь этот же адресный диапазон. Когда после этого нить A запустит B<mmap(MAP_FIXED)>, это, фактически, разобьёт отображение, созданное нитью B. В этом сценарии нити B не нужно создавать отображение явным образом; будет достаточно просто сделать библиотечный вызов, например, B<dlopen>(3) для загрузки какой-то другой общей библиотеки. Вызов B<dlopen>(3) отобразит библиотеку в адресное пространство процесса. Более того, почти каждый библиотечный вызов можно реализовать так, чтобы он добавлял отображения памяти в адресное пространство с помощью этого метода или просто выделяя память. Например, такими вызовами являются B<brk>(2), B<malloc>(3), B<pthread_create>(3) и библиотеки PAM E<.UR http://www.linux-pam.org> E<.UE .>

source: Since Linux 4.17, a multithreaded program can use the B<MAP_FIXED_NOREPLACE> flag to avoid the hazard described above when attempting to create a mapping at a fixed address that has not been reserved by a preexisting mapping.
ru: Начиная с Linux 4.17, в многонитевых программах можно использовать флаг B<MAP_FIXED_NOREPLACE> и, тем самым, избежать опасности, описанной выше, когда выполняется попытка создать отображение по фиксированному адресу, который не был зарезервирован существующим отображением.

source: Timestamps changes for file-backed mappings
ru: Изменение временных отметок для отображённых файлов

source: For file-backed mappings, the I<st_atime> field for the mapped file may be updated at any time between the B<mmap>() and the corresponding unmapping; the first reference to a mapped page will update the field if it has not been already.
ru: У отображённых файлов поле I<st_atime> может измениться в любой момент между вызовом B<mmap>() и соответствующим удалением отображения; первое обращение к отображённой странице приведёт к обновлению поля, если это ещё не было сделано.

source: The I<st_ctime> and I<st_mtime> field for a file mapped with B<PROT_WRITE> and B<MAP_SHARED> will be updated after a write to the mapped region, and before a subsequent B<msync>(2) with the B<MS_SYNC> or B<MS_ASYNC> flag, if one occurs.
ru: Поля I<st_ctime> и I<st_mtime> у отображённого с помощью флагов B<PROT_WRITE> и B<MAP_SHARED> файла будут обновлены после записи отображённой области и перед последующим вызовом B<msync>(2) с флагом B<MS_SYNC> или B<MS_ASYNC>, если он будет вызван.

source: Huge page (Huge TLB) mappings
ru: Отображения огромных страниц (Huge TLB)

source: For mappings that employ huge pages, the requirements for the arguments of B<mmap>() and B<munmap>() differ somewhat from the requirements for mappings that use the native system page size.
ru: Для отображений, работающих с огромными страницами, требования к аргументам B<mmap>() и B<munmap>() несколько отличаются от требований к отображениям, в которых используются страницы с системным размером.

source: For B<mmap>(), I<offset> must be a multiple of the underlying huge page size. The system automatically aligns I<length> to be a multiple of the underlying huge page size.
ru: Для B<mmap>(), I<offset> должно быть кратно размеру нижележащей огромной страницы. Система автоматически выравнивает I<length> до кратного значения размера нижележащей огромной страницы.

source: For B<munmap>(), I<addr> and I<length> must both be a multiple of the underlying huge page size.
ru: Для B<munmap>(), I<addr> и I<length> должны быть кратны размеру нижележащей огромной страницы.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: This page describes the interface provided by the glibc B<mmap>() wrapper function. Originally, this function invoked a system call of the same name. Since kernel 2.4, that system call has been superseded by B<mmap2>(2), and nowadays the glibc B<mmap>() wrapper function invokes B<mmap2>(2) with a suitably adjusted value for I<offset>.
ru: В данной странице описывается интерфейс, предоставляемый обёрточной функцией glibc B<mmap>(). Раньше, эта функция обращалась к системному вызову с тем же именем. Начиная с ядра 2.4, данный системный вызов был заменён на B<mmap2>(2). В настоящее время обёрточная функция glibc, B<mmap>(), вызывает B<mmap2>(2) с подходящим подкорректированным значением I<offset>.

source: On Linux, there are no guarantees like those suggested above under B<MAP_NORESERVE>. By default, any process can be killed at any moment when the system runs out of memory.
ru: В Linux не гарантируется результат флага B<MAP_NORESERVE>, описанный выше. По умолчанию, любой процесс может быть принудительно завершён в любой момент, если в системе закончилась память.

source: In kernels before 2.6.7, the B<MAP_POPULATE> flag has effect only if I<prot> is specified as B<PROT_NONE>.
ru: В ядрах до версии 2.6.7 флаг B<MAP_POPULATE> учитывается только, если значение I<prot> равно B<PROT_NONE>.

source: SUSv3 specifies that B<mmap>() should fail if I<length> is 0. However, in kernels before 2.6.12, B<mmap>() succeeded in this case: no mapping was created and the call returned I<addr>. Since kernel 2.6.12, B<mmap>() fails with the error B<EINVAL> for this case.
ru: В SUSv3 указано, что B<mmap>() должен завершаться с ошибкой, если I<length> равно 0. Однако в ядрах до версии 2.6.12 вызов B<mmap>() в этом случае выполняется успешно: отображение не создаётся и вызов возвращает I<addr>. Начиная с ядра версии 2.6.12, в этом случае вызов B<mmap>() завершается с ошибкой B<EINVAL>.

source: POSIX specifies that the system shall always zero fill any partial page at the end of the object and that system will never write any modification of the object beyond its end. On Linux, when you write data to such partial page after the end of the object, the data stays in the page cache even after the file is closed and unmapped and even though the data is never written to the file itself, subsequent mappings may see the modified content. In some cases, this could be fixed by calling B<msync>(2) before the unmap takes place; however, this doesn't work on B<tmpfs>(5) (for example, when using the POSIX shared memory interface documented in B<shm_overview>(7)).
ru: В POSIX сказано, что система всегда должна заполнять нулями любую частичную страницу у конца объекта и что система никогда не должна вносить любые изменения вне пределов объекта. В Linux, если вы пишите данные в такую частичную страницу за концом объекта, то данные остаются в страничном кэше даже после закрытия и выключения отображения файла и хотя данные никогда не пишутся в сам файл, последующие отображения могут увидеть изменённое содержимое. В некоторых случаях это можно исправить вызвав B<msync>(2) перед выключением отображения; однако это не работает на B<tmpfs>(5) (например, когда используется интерфейс общей памяти POSIX, описанный в B<shm_overview>(7)).

source: The following program prints part of the file specified in its first command-line argument to standard output. The range of bytes to be printed is specified via offset and length values in the second and third command-line arguments. The program creates a memory mapping of the required pages of the file and then uses B<write>(2) to output the desired bytes.
ru: Следующая программа выводит часть файла, указанного в первом аргументе командной строки, в стандартный вывод. Диапазон выдаваемых байт задаётся смещением и длиной во втором и третьем аргументах командной строки. Программа создаёт отображение требуемых страниц файла и затем использует B<write>(2) для вывода запрошенных байт.

source: if (argc E<lt> 3 || argc E<gt> 4) { fprintf(stderr, "%s file offset [length]\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 3 || argc E<gt> 4) { fprintf(stderr, "%s файл смещение [длина]\en", argv[0]); exit(EXIT_FAILURE); }

source: if (fstat(fd, &sb) == -1) /* To obtain file size */ handle_error("fstat");
ru: if (fstat(fd, &sb) == -1) /* получение размера файла */ handle_error("fstat");

source: offset = atoi(argv[2]); pa_offset = offset & ~(sysconf(_SC_PAGE_SIZE) - 1); /* offset for mmap() must be page aligned */
ru: offset = atoi(argv[2]); pa_offset = offset & ~(sysconf(_SC_PAGE_SIZE) - 1); /* для mmap() нужно выронить смещение */

source: if (offset E<gt>= sb.st_size) { fprintf(stderr, "offset is past end of file\en"); exit(EXIT_FAILURE); }
ru: if (offset E<gt>= sb.st_size) { fprintf(stderr, "указанное смещение находится за концом файла\en"); exit(EXIT_FAILURE); }

source: if (argc == 4) { length = atoi(argv[3]); if (offset + length E<gt> sb.st_size) length = sb.st_size - offset; /* Can\(aqt display bytes past end of file */
ru: if (argc == 4) { length = atoi(argv[3]); if (offset + length E<gt> sb.st_size) length = sb.st_size - offset; /* Нельзя показать байты за концом файла */

source: } else { /* No length arg ==E<gt> display to end of file */ length = sb.st_size - offset; }
ru: } else { /* Не указана длина ==E<gt> показать всё до конца файла */ length = sb.st_size - offset; }

source: fprintf(stderr, "partial write"); exit(EXIT_FAILURE); }
ru: fprintf(stderr, "частичная запись"); exit(EXIT_FAILURE); }

source: The descriptions of the following files in B<proc>(5): I</proc/[pid]/maps>, I</proc/[pid]/map_files>, and I</proc/[pid]/smaps>.
ru: Описание в B<proc>(5) следующих файлов: I</proc/[pid]/maps>, I</proc/[pid]/map_files> и I</proc/[pid]/smaps>.

source: B.O. Gallmeister, POSIX.4, O'Reilly, pp. 128\(en129 and 389\(en391.
ru: B.O. Gallmeister, POSIX.4, O'Reilly, страницы 128\(en129 и 389\(en391.

source: msgctl - System V message control operations
ru: msgctl - операции для работы с сообщениями System V

source: B<msgctl>() performs the control operation specified by I<cmd> on the System\ V message queue with identifier I<msqid>.
ru: Вызов B<msgctl>() выполняет операцию, заданную в I<cmd>, над очередью сообщений System\ V с идентификатором I<msqid>.

source: The I<msqid_ds> data structure is defined in I<E<lt>sys/msg.hE<gt>> as follows:
ru: Структура данных I<msqid_ds> определена в I<E<lt>sys/msg.hE<gt>> следующим образом:

source: struct msqid_ds { struct ipc_perm msg_perm; /* Ownership and permissions */ time_t msg_stime; /* Time of last msgsnd(2) */ time_t msg_rtime; /* Time of last msgrcv(2) */ time_t msg_ctime; /* Time of last change */ unsigned long __msg_cbytes; /* Current number of bytes in queue (nonstandard) */ msgqnum_t msg_qnum; /* Current number of messages in queue */ msglen_t msg_qbytes; /* Maximum number of bytes allowed in queue */ pid_t msg_lspid; /* PID of last msgsnd(2) */ pid_t msg_lrpid; /* PID of last msgrcv(2) */ };
ru: struct msqid_ds { struct ipc_perm msg_perm; /* владелец и права */ time_t msg_stime; /* время последнего msgsnd(2) */ time_t msg_rtime; /* время последнего msgrcv(2) */ time_t msg_ctime; /* время последнего изменения */ unsigned long __msg_cbytes; /* текущее количество байт в очереди (нет в стандарте) */ msgqnum_t msg_qnum; /* текущее количество сообщений в очереди */ msglen_t msg_qbytes; /* максимальное количество байт для очереди */ pid_t msg_lspid; /* PID последнего msgsnd(2) */ pid_t msg_lrpid; /* PID последнего msgrcv(2) */ };

source: The I<ipc_perm> structure is defined as follows (the highlighted fields are settable using B<IPC_SET>):
ru: Структура I<ipc_perm> определена следующим образом (значения полей устанавливаются с помощью B<IPC_SET>):

source: struct ipc_perm { key_t __key; /* Key supplied to msgget(2) */ uid_t B<uid>; /* Effective UID of owner */ gid_t B<gid>; /* Effective GID of owner */ uid_t cuid; /* Effective UID of creator */ gid_t cgid; /* Effective GID of creator */ unsigned short B<mode>; /* Permissions */ unsigned short __seq; /* Sequence number */ };
ru: struct ipc_perm { key_t __key; /* ключ, передаваемый в msgget(2) */ uid_t B<uid>; /* эффективный UID владельца */ gid_t B<gid>; /* эффективный GID владельца */ uid_t cuid; /* эффективный UID создателя */ gid_t cgid; /* эффективный GID создателя */ unsigned short B<mode>; /* права */ unsigned short __seq; /* порядковый номер */ };

source: Valid values for I<cmd> are:
ru: Возможные значения I<cmd>:

source: Copy information from the kernel data structure associated with I<msqid> into the I<msqid_ds> structure pointed to by I<buf>. The caller must have read permission on the message queue.
ru: Копирует информацию из структуры данных ядра, связанной с I<msqid>, в структуру I<msqid_ds>, расположенную по адресу I<buf>. Вызывающий должен иметь права на чтение очереди сообщений.

source: Write the values of some members of the I<msqid_ds> structure pointed to by I<buf> to the kernel data structure associated with this message queue, updating also its I<msg_ctime> member. The following members of the structure are updated: I<msg_qbytes>, I<msg_perm.uid>, I<msg_perm.gid>, and (the least significant 9 bits of) I<msg_perm.mode>. The effective UID of the calling process must match the owner (I<msg_perm.uid>) or creator (I<msg_perm.cuid>) of the message queue, or the caller must be privileged. Appropriate privilege (Linux: the B<CAP_SYS_RESOURCE> capability) is required to raise the I<msg_qbytes> value beyond the system parameter B<MSGMNB>.
ru: Записывает значения некоторых полей структуры I<msqid_ds>, адрес которой указан в I<buf>, в структуру данных ядра, связанную с этой очередью сообщений, обновляя при этом её поле I<msg_ctime>. Обновляются следующие поля структуры: I<msg_qbytes>, I<msg_perm.uid>, I<msg_perm.gid> и I<msg_perm.mode> (младшие 9 бит). Эффективный UID вызывающего процесса должен совпадать с идентификатором владельца (I<msg_perm.uid>) или создателя (I<msg_perm.cuid>) очереди сообщений, или вызывающий должен иметь привилегии. Для указания значения I<msg_qbytes> большего чем значение системного параметра B<MSGMNB> также требуются соответствующие привилегии (Linux: мандат B<CAP_SYS_RESOURCE>).

source: Immediately remove the message queue, awakening all waiting reader and writer processes (with an error return and I<errno> set to B<EIDRM>). The calling process must have appropriate privileges or its effective user ID must be either that of the creator or owner of the message queue. The third argument to B<msgctl>() is ignored in this case.
ru: Немедленно удаляет очередь сообщений, «будя» все процессы, ожидающие записи или чтения этой очереди (при этом возвращается ошибка, а переменная I<errno> приобретает значение B<EIDRM>). Вызывающий процесс должен иметь соответствующие привилегии или его эффективный идентификатор пользователя должен совпадать с идентификатором создателя или владельца очереди сообщений. Третий аргумент B<msgctl>() в этом случае игнорируется.

source: B<IPC_INFO> (Linux-specific)
ru: B<IPC_INFO> (есть только в Linux)

source: Return information about system-wide message queue limits and parameters in the structure pointed to by I<buf>. This structure is of type I<msginfo> (thus, a cast is required), defined in I<E<lt>sys/msg.hE<gt>> if the B<_GNU_SOURCE> feature test macro is defined:
ru: Возвращает параметры и информацию о системных максимальных значениях очереди сообщений в структуре, указанной в I<buf>. Данная структура имеет тип I<msginfo> (то есть, требуется приведение типов) и определена в I<E<lt>sys/msg.hE<gt>>, если определён макрос тестирования свойств B<_GNU_SOURCE>:

source: struct msginfo { int msgpool; /* Size in kibibytes of buffer pool used to hold message data; unused within kernel */ int msgmap; /* Maximum number of entries in message map; unused within kernel */ int msgmax; /* Maximum number of bytes that can be written in a single message */ int msgmnb; /* Maximum number of bytes that can be written to queue; used to initialize msg_qbytes during queue creation (msgget(2)) */ int msgmni; /* Maximum number of message queues */ int msgssz; /* Message segment size; unused within kernel */ int msgtql; /* Maximum number of messages on all queues in system; unused within kernel */ unsigned short int msgseg; /* Maximum number of segments; unused within kernel */ };
ru: struct msginfo { int msgpool; /* размер в килобайтах буферного пула, используемого для хранения данных сообщения; ядром не используется */ int msgmap; /* максимальное количество элементов в карте сообщений; ядром не используется */ int msgmax; /* максимальное количество байт, которые могут быть записаны в одно сообщение */ int msgmnb; /* максимальное количество байт, которое можно записать в очередь; используется для инициализации msg_qbytes во время создания очереди (msgget(2)) */ int msgmni; /* максимальное количество очередей сообщений */ int msgssz; /* размер сегмента сообщения; ядром не используется */ int msgtql; /* максимальное количество сообщений во всех очередях в системе; ядром не используется */ unsigned short int msgseg; /* максимальное количество сегментов; ядром не используется */ };

source: The I<msgmni>, I<msgmax>, and I<msgmnb> settings can be changed via I</proc> files of the same name; see B<proc>(5) for details.
ru: Значения I<msgmni>, I<msgmax> и I<msgmnb> можно изменить с помощью файлов в I</proc> с теми же именами; подробней смотрите B<proc>(5).

source: B<MSG_INFO> (Linux-specific)
ru: B<MSG_INFO> (есть только в Linux)
