Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: The default value is 65,536, a value which has no special significance and which serves only as a safeguard. Setting this parameter to 0 disables the use of B<mmap>(2) for servicing large allocation requests.
ru: По умолчанию значение равно 65536; оно не имеет какого-то специального обоснования и служит только как предохранитель. Присвоение этому параметру 0 отключает использование B<mmap>(2) для обслуживания запросов больших выделений.

source: For allocations greater than or equal to the limit specified (in bytes) by B<M_MMAP_THRESHOLD> that can't be satisfied from the free list, the memory-allocation functions employ B<mmap>(2) instead of increasing the program break using B<sbrk>(2).
ru: Для выделений, которые больше или равны B<M_MMAP_THRESHOLD> (в байтах) и не могут быть получены из списка свободных, то функции выделения памяти вместо B<mmap>(2) используют B<sbrk>(2) для увеличения пространства данных программы.

source: Allocating memory using B<mmap>(2) has the significant advantage that the allocated memory blocks can always be independently released back to the system. (By contrast, the heap can be trimmed only if memory is freed at the top end.) On the other hand, there are some disadvantages to the use of B<mmap>(2): deallocated space is not placed on the free list for reuse by later allocations; memory may be wasted because B<mmap>(2) allocations must be page-aligned; and the kernel must perform the expensive task of zeroing out memory allocated via B<mmap>(2). Balancing these factors leads to a default setting of 128*1024 for the B<M_MMAP_THRESHOLD> parameter.
ru: Выделяемая с помощью B<mmap>(2) память имеет значительное преимущество в том, что выделенные блоки памяти можно всегда независимо освободить и вернуть системе (по сравнению с кучей, которую можно обрезать только, если память свободна в конце). С другой стороны, есть несколько отрицательных моментов при использовании B<mmap>(2): освобождённое пространство не возвращается в список свободного для повторного выделения позже; память может траться впустую, так как выделения B<mmap>(2) должны быть кратны размеру страницы; ядро должно выполнять ресурсоёмкую задачу по обнулению памяти, выделяемой через B<mmap>(2). Баланс этих факторов учтён в значении по умолчанию для параметра B<M_MMAP_THRESHOLD> — 128*1024.

source: The lower limit for this parameter is 0. The upper limit is B<DEFAULT_MMAP_THRESHOLD_MAX>: 512*1024 on 32-bit systems or I<4*1024*1024*sizeof(long)> on 64-bit systems.
ru: Нижний предел данного параметра равен 0. Верхний предел B<DEFAULT_MMAP_THRESHOLD_MAX>: 512*1024 в 32-битных системах и I<4*1024*1024*sizeof(long)> в 64-битных системах.

source: I<Note:> Nowadays, glibc uses a dynamic mmap threshold by default. The initial value of the threshold is 128*1024, but when blocks larger than the current threshold and less than or equal to B<DEFAULT_MMAP_THRESHOLD_MAX> are freed, the threshold is adjusted upward to the size of the freed block. When dynamic mmap thresholding is in effect, the threshold for trimming the heap is also dynamically adjusted to be twice the dynamic mmap threshold. Dynamic adjustment of the mmap threshold is disabled if any of the B<M_TRIM_THRESHOLD>, B<M_TOP_PAD>, B<M_MMAP_THRESHOLD>, or B<M_MMAP_MAX> parameters is set.
ru: I<Замечание:> В настоящее время по умолчанию в glibc используется динамический порог mmap. Начальное значение порога — 128*1024, но когда освобождаются блоки больше текущего порога и меньше или равны B<DEFAULT_MMAP_THRESHOLD_MAX>, то порог увеличивается до размера свободного блока. Когда срабатывает динамический порог mmap, порог обрезки кучи также динамически корректируется на двукратное значение динамического порога mmap.Динамическая корректировка порога mmap отключается, если задан параметр B<M_TRIM_THRESHOLD>, B<M_TOP_PAD>, B<M_MMAP_THRESHOLD> или B<M_MMAP_MAX>.

source: B<M_MXFAST> (since glibc 2.3)
ru: B<M_MXFAST> (начиная с glibc 2.3)

source: Set the upper limit for memory allocation requests that are satisfied using "fastbins". (The measurement unit for this parameter is bytes.) Fastbins are storage areas that hold deallocated blocks of memory of the same size without merging adjacent free blocks. Subsequent reallocation of blocks of the same size can be handled very quickly by allocating from the fastbin, although memory fragmentation and the overall memory footprint of the program can increase.
ru: Задаёт верхний порог запросов выделения памяти, которые обрабатываются с помощью «fastbins» (значение параметра измеряется в байтах). Fastbins — это области хранилища, которые содержат освобождённые блоки памяти одного размера и не объединяют смежные свободные блоки. Последующее перераспределение блоков одного размера при выделении из fastbin может обрабатываться очень быстро, хотя из-за этого может увеличиться фрагментация памяти и общее количество памяти программы.

source: The default value for this parameter is I<64*sizeof(size_t)/4> (i.e., 64 on 32-bit architectures). The range for this parameter is 0 to I<80*sizeof(size_t)/4>. Setting B<M_MXFAST> to 0 disables the use of fastbins.
ru: По умолчанию значение параметра равно I<64*sizeof(size_t)/4> (т. е., 64 на 32-битных архитектурах). Диапазон значений параметра: 0 - I<80*sizeof(size_t)/4>. Присваивание B<M_MXFAST> значения 0 отключает использование fastbins.

source: B<M_PERTURB> (since glibc 2.4)
ru: B<M_PERTURB> (начиная с glibc 2.4)

source: If this parameter is set to a nonzero value, then bytes of allocated memory (other than allocations via B<calloc>(3)) are initialized to the complement of the value in the least significant byte of I<value>, and when allocated memory is released using B<free>(3), the freed bytes are set to the least significant byte of I<value>. This can be useful for detecting errors where programs incorrectly rely on allocated memory being initialized to zero, or reuse values in memory that has already been freed.
ru: Если этому параметру присвоено ненулевое значение, то байты выделенной памяти (кроме выделенных через B<calloc>(3)) инициализируются дополнением значения в наименее значимом байте I<value>, и при освобождении памяти с помощью B<free>(3) освобождённым байтам присваивается значение наименее значимого байта I<value>. Это может быть полезно для обнаружения ошибок, когда программа некорректно полагается на то, что выделенная памяти инициализируется нулями или повторно использует значения уже освобождённой памяти.

source: The default value for this parameter is 0.
ru: Значение по умолчанию для этого параметра равно 0.

source: This parameter defines the amount of padding to employ when calling B<sbrk>(2) to modify the program break. (The measurement unit for this parameter is bytes.) This parameter has an effect in the following circumstances:
ru: Данным параметром определяется количество заполнения при вызове B<sbrk>(2) для изменения пространства данных программы (измеряется в байтах). Данный параметр полезен в следующих случаях:

source: When the program break is increased, then B<M_TOP_PAD> bytes are added to the B<sbrk>(2) request.
ru: Когда пространство данных программы увеличивается, то B<M_TOP_PAD> байт добавляется к запросу B<sbrk>(2).

source: When the heap is trimmed as a consequence of calling B<free>(3) (see the discussion of B<M_TRIM_THRESHOLD>) this much free space is preserved at the top of the heap.
ru: Когда обрезается куча в следствии вызова B<free>(3) (смотрите описание B<M_TRIM_THRESHOLD>), то это количество пространства предохраняется вверху кучи.

source: In either case, the amount of padding is always rounded to a system page boundary.
ru: В обоих случаях, количество заполнения всегда округляется до границы системной страницы.

source: Modifying B<M_TOP_PAD> is a trade-off between increasing the number of system calls (when the parameter is set low) and wasting unused memory at the top of the heap (when the parameter is set high).
ru: Изменение B<M_TOP_PAD> — компромисс между увеличением количества системных вызовов (если значение параметра занижено) и тратой неиспользуемой памяти сверху кучи (если значение параметра завышено).

source: The default value for this parameter is 128*1024.
ru: Значение по умолчанию этого параметра равно 128*1024.

source: When the amount of contiguous free memory at the top of the heap grows sufficiently large, B<free>(3) employs B<sbrk>(2) to release this memory back to the system. (This can be useful in programs that continue to execute for a long period after freeing a significant amount of memory.) The B<M_TRIM_THRESHOLD> parameter specifies the minimum size (in bytes) that this block of memory must reach before B<sbrk>(2) is used to trim the heap.
ru: Когда количество непрерывной свободной памяти сверху кучи вырастает до значительных размеров функция B<free>(3) вызывает B<sbrk>(2) для освобождения этой памяти обратно в систему (это может быть полезно в программах, которые работают длительное время после освобождения значительного количества памяти). Параметром B<M_TRIM_THRESHOLD> задаётся минимальный размер (в байтах), которого должен достигнуть блок памяти, чтобы вызвался B<sbrk>(2) для обрезания кучи.

source: The default value for this parameter is 128*1024. Setting B<M_TRIM_THRESHOLD> to -1 disables trimming completely.
ru: Значение по умолчанию этого параметра равно 128*1024. Установка B<M_TRIM_THRESHOLD> равным -1 отключает обрезку.

source: Modifying B<M_TRIM_THRESHOLD> is a trade-off between increasing the number of system calls (when the parameter is set low) and wasting unused memory at the top of the heap (when the parameter is set high).
ru: Изменение B<M_TRIM_THRESHOLD> — компромисс между увеличением количества системных вызовов (если значение параметра занижено) и тратой неиспользуемой памяти сверху кучи (если значение параметра завышено).

source: Environment variables
ru: Переменные окружения

source: A number of environment variables can be defined to modify some of the same parameters as are controlled by B<mallopt>(). Using these variables has the advantage that the source code of the program need not be changed. To be effective, these variables must be defined before the first call to a memory-allocation function. (If the same parameters are adjusted via B<mallopt>(), then the B<mallopt>() settings take precedence.) For security reasons, these variables are ignored in set-user-ID and set-group-ID programs.
ru: Параметры, управляющие B<mallopt>(), можно изменить и через переменные окружения. Использование этих переменных позволяет изменять работу программы без пересборки из исходного кода. В целях эффективной работы эти переменные должны быть определены до первого вызова функции выделения памяти (если этот же параметр изменяется через B<mallopt>(), то вызов B<mallopt>() имеет приоритет). В целях безопасности, эти переменные игнорируются для программ с установленными битами set-user-ID и set-group-ID.

source: The environment variables are as follows (note the trailing underscore at the end of the name of some variables):
ru: Используются следующие переменные окружения (обратите внимание на подчёркивание в конце некоторых переменных):

source: Controls the same parameter as B<mallopt>() B<M_ARENA_MAX>.
ru: Управляет параметром B<M_ARENA_MAX>, аналогично вызову B<mallopt>().

source: Controls the same parameter as B<mallopt>() B<M_ARENA_TEST>.
ru: Управляет параметром B<M_ARENA_TEST>, аналогично вызову B<mallopt>().

source: This environment variable controls the same parameter as B<mallopt>() B<M_CHECK_ACTION>. If this variable is set to a nonzero value, then a special implementation of the memory-allocation functions is used. (This is accomplished using the B<malloc_hook>(3) feature.) This implementation performs additional error checking, but is slower than the standard set of memory-allocation functions. (This implementation does not detect all possible errors; memory leaks can still occur.)
ru: Эта переменная окружения управляет тем же параметром что и B<mallopt>() B<M_CHECK_ACTION>. Если эта переменная установлена в ненулевое значение, то будет использоваться особенная реализация функций выделения памяти (это достигается использованием функции B<malloc_hook>(3)). Эта реализация выполняет дополнительные проверки ошибок, но она медленнее чем стандартный набор функций выделения памяти (эта реализация не способна обнаружить все возможные ошибки; утечки памяти всё ещё возможны).

source: The value assigned to this environment variable should be a single digit, whose meaning is as described for B<M_CHECK_ACTION>. Any characters beyond the initial digit are ignored.
ru: Значение, назначенное этой переменной окружения должно быть одиночной цифрой; их значения описаны в B<M_CHECK_ACTION>. Все символы кроме первой цифры игнорируются.

source: For security reasons, the effect of B<MALLOC_CHECK_> is disabled by default for set-user-ID and set-group-ID programs. However, if the file I</etc/suid-debug> exists (the content of the file is irrelevant), then B<MALLOC_CHECK_> also has an effect for set-user-ID and set-group-ID programs.
ru: В целях безопасности по умолчанию переменная B<MALLOC_CHECK_> игнорируется для программ с установленными битами set-user-ID и set-group-ID. Однако, если существует файл I</etc/suid-debug> (содержимое файла не важно), то B<MALLOC_CHECK_> учитывается и для программ с установленными битами set-user-ID и set-group-ID.

source: Controls the same parameter as B<mallopt>() B<M_MMAP_MAX>.
ru: Управляет параметром B<M_MMAP_MAX>, аналогично вызову B<mallopt>().

source: Controls the same parameter as B<mallopt>() B<M_MMAP_THRESHOLD>.
ru: Управляет параметром B<M_MMAP_THRESHOLD>, аналогично вызову B<mallopt>().

source: Controls the same parameter as B<mallopt>() B<M_PERTURB>.
ru: Управляет параметром B<M_PERTURB>, аналогично вызову B<mallopt>().

source: Controls the same parameter as B<mallopt>() B<M_TRIM_THRESHOLD>.
ru: Управляет параметром B<M_TRIM_THRESHOLD>, аналогично вызову B<mallopt>().

source: Controls the same parameter as B<mallopt>() B<M_TOP_PAD>.
ru: Управляет параметром B<M_TOP_PAD>, аналогично вызову B<mallopt>().

source: On success, B<mallopt>() returns 1. On error, it returns 0.
ru: При успешном выполнении B<mallopt>() возвращается 1. При ошибке возвращается 0.

source: On error, I<errno> is I<not> set.
ru: При ошибке значение I<errno> I<не> изменяется.

source: This function is not specified by POSIX or the C standards. A similar function exists on many System V derivatives, but the range of values for I<param> varies across systems. The SVID defined options B<M_MXFAST>, B<M_NLBLKS>, B<M_GRAIN>, and B<M_KEEP>, but only the first of these is implemented in glibc.
ru: Данная функция не описана в POSIX или C. Подобная функция существует во многих ответвлениях System V, но значения I<param> не совпадают. В SVID определены параметры B<M_MXFAST>, B<M_NLBLKS>, B<M_GRAIN> и B<M_KEEP>, но только первый из них реализован в glibc.

source: Specifying an invalid value for I<param> does not generate an error.
ru: Неправильное значение I<param> не вызывает ошибки.

source: A calculation error within the glibc implementation means that a call of the form:
ru: Ошибка вычисления внутри реализации glibc означает, что вызов:

source: does not result in fastbins being employed for all allocations of size up to I<n>. To ensure desired results, I<n> should be rounded up to the next multiple greater than or equal to I<(2k+1)*sizeof(size_t)>, where I<k> is an integer.
ru: не приведёт к тому, что из fastbins будет выделяться память до размера I<n>. Чтобы это сработало, I<n> должно быть округлено до следующего множителя большего или равного I<(2k+1)*sizeof(size_t)>, где I<k> — целое число.

source: If B<mallopt>() is used to set B<M_PERTURB>, then, as expected, the bytes of allocated memory are initialized to the complement of the byte in I<value>, and when that memory is freed, the bytes of the region are initialized to the byte specified in I<value>. However, there is an off-by-I<sizeof(size_t)> error in the implementation: instead of initializing precisely the block of memory being freed by the call I<free(p)>, the block starting at I<p+sizeof(size_t)> is initialized.
ru: Если B<mallopt>() используется для установки B<M_PERTURB>, то, как и ожидалось, байты свободной памяти инициализируются дополнением байта из I<value>, и когда эта память освобождается, байты области инициализируются байтом, указанным в I<value>. Однако, в реализации есть ошибка выхода за I<sizeof(size_t)>: вместо инициализации точного блока памяти освобождаемом вызовом I<free(p)>, блок начинает инициализироваться с I<p+sizeof(size_t)>.

source: The program below demonstrates the use of B<M_CHECK_ACTION>. If the program is supplied with an (integer) command-line argument, then that argument is used to set the B<M_CHECK_ACTION> parameter. The program then allocates a block of memory, and frees it twice (an error).
ru: Представленная далее программа показывает использование B<M_CHECK_ACTION>. Если программе передаётся аргумент командной строки (целое число), то этот аргумент используется для установки значения параметра B<M_CHECK_ACTION>. При этом программа выделяет блок памяти и освобождает его дважды (ошибка).

source: The following shell session shows what happens when we run this program under glibc, with the default value for B<M_CHECK_ACTION>:
ru: Следующий сеанс в оболочке показывает работу программы с glibc и значением по умолчанию для B<M_CHECK_ACTION>:

source: $ B<./a.out> main(): returned from first free() call *** glibc detected *** ./a.out: double free or corruption (top): 0x09d30008 *** ======= Backtrace: ========= /lib/libc.so.6(+0x6c501)[0x523501] /lib/libc.so.6(+0x6dd70)[0x524d70] /lib/libc.so.6(cfree+0x6d)[0x527e5d] \&./a.out[0x80485db] /lib/libc.so.6(__libc_start_main+0xe7)[0x4cdce7] \&./a.out[0x8048471] ======= Memory map: ======== 001e4000-001fe000 r-xp 00000000 08:06 1083555 /lib/libgcc_s.so.1 001fe000-001ff000 r--p 00019000 08:06 1083555 /lib/libgcc_s.so.1 [some lines omitted] b7814000-b7817000 rw-p 00000000 00:00 0 bff53000-bff74000 rw-p 00000000 00:00 0 [stack] Aborted (core dumped)
ru: $ B<./a.out> main(): возвращение из первого вызова free() *** glibc detected *** ./a.out: double free or corruption (top): 0x09d30008 *** ======= Backtrace: ========= /lib/libc.so.6(+0x6c501)[0x523501] /lib/libc.so.6(+0x6dd70)[0x524d70] /lib/libc.so.6(cfree+0x6d)[0x527e5d] \&./a.out[0x80485db] /lib/libc.so.6(__libc_start_main+0xe7)[0x4cdce7] \&./a.out[0x8048471] ======= Memory map: ======== 001e4000-001fe000 r-xp 00000000 08:06 1083555 /lib/libgcc_s.so.1 001fe000-001ff000 r--p 00019000 08:06 1083555 /lib/libgcc_s.so.1 [some lines omitted] b7814000-b7817000 rw-p 00000000 00:00 0 bff53000-bff74000 rw-p 00000000 00:00 0 [stack] Aborted (core dumped)

source: The following runs show the results when employing other values for B<M_CHECK_ACTION>:
ru: В этом запуске показаны результаты при других значениях B<M_CHECK_ACTION>:

source: $ B<./a.out 1> # Diagnose error and continue main(): returned from first free() call *** glibc detected *** ./a.out: double free or corruption (top): 0x09cbe008 *** main(): returned from second free() call $ B<./a.out 2> # Abort without error message main(): returned from first free() call Aborted (core dumped) $ B<./a.out 0> # Ignore error and continue main(): returned from first free() call main(): returned from second free() call
ru: $ B<./a.out 1> # показ ошибки и продолжение main(): возвращение из первого вызова free() *** glibc detected *** ./a.out: double free or corruption (top): 0x09cbe008 *** main(): возвращение из второго вызова free() $ B<./a.out 2> # прерывание без показа ошибки main(): возвращение из первого вызова free() Aborted (core dumped) $ B<./a.out 0> # игнорирование ошибки и продолжение main(): возвращение из первого вызова free() main(): возвращение из второго вызова free()

source: The next run shows how to set the same parameter using the B<MALLOC_CHECK_> environment variable:
ru: При этом запуске показано как изменить тот же параметр с помощью переменной окружения B<MALLOC_CHECK_>:

source: $ B<MALLOC_CHECK_=1 ./a.out> main(): returned from first free() call *** glibc detected *** ./a.out: free(): invalid pointer: 0x092c2008 *** main(): returned from second free() call
ru: $ B<MALLOC_CHECK_=1 ./a.out> main(): возвращение из первого вызова free() *** glibc detected *** ./a.out: free(): invalid pointer: 0x092c2008 *** main(): возвращение из второго вызова free()

source: if (argc E<gt> 1) { if (mallopt(M_CHECK_ACTION, atoi(argv[1])) != 1) { fprintf(stderr, "mallopt() failed"); exit(EXIT_FAILURE); } }
ru: if (argc E<gt> 1) { if (mallopt(M_CHECK_ACTION, atoi(argv[1])) != 1) { fprintf(stderr, "mallopt() завершилась с ошибкой"); exit(EXIT_FAILURE); } }

source: p = malloc(1000); if (p == NULL) { fprintf(stderr, "malloc() failed"); exit(EXIT_FAILURE); }
ru: p = malloc(1000); if (p == NULL) { fprintf(stderr, "malloc() завершилась с ошибкой"); exit(EXIT_FAILURE); }

source: free(p); printf("main(): returned from first free() call\en");
ru: free(p); printf("main(): возвращение из первого вызова free()\en");

source: free(p); printf("main(): returned from second free() call\en");
ru: free(p); printf("main(): возвращение из второго вызова free()\en");

source: memfrob - frobnicate (encrypt) a memory area
ru: memfrob - изменяет (зашифровывает) участок памяти

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>string.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>string.hE<gt>>

source: The B<memfrob>() function encrypts the first I<n> bytes of the memory area I<s> by exclusive-ORing each character with the number 42. The effect can be reversed by using B<memfrob>() on the encrypted memory area.
ru: Функция B<memfrob>() шифрует первые I<n> байт участка памяти I<s> используя исключающее ИЛИ и число 42 для каждого символа. Этот же участок памяти можно привести в изначальное состояние повторно использовав B<memfrob>().

source: Note that this function is not a proper encryption routine as the XOR constant is fixed, and is suitable only for hiding strings.
ru: Заметьте, что эта функция не является надежной, т. к. всегда сравнение идет с обозначенной выше константой. Она пригодна только для скрытия строк.

source: The B<memfrob>() function returns a pointer to the encrypted memory area.
ru: Функция B<memfrob>() возвращает указатель на зашифрованный участок памяти.

source: The B<memfrob>() function is unique to the GNU C Library.
ru: B<memfrob>() есть только в библиотеке GNU C.

source: mq_send, mq_timedsend - send a message to a message queue
ru: mq_send, mq_timedsend - отправляет сообщение в очередь сообщений

source: B<mq_send>() adds the message pointed to by I<msg_ptr> to the message queue referred to by the message queue descriptor I<mqdes>. The I<msg_len> argument specifies the length of the message pointed to by I<msg_ptr>; this length must be less than or equal to the queue's I<mq_msgsize> attribute. Zero-length messages are allowed.
ru: Функция B<mq_send>() добавляет сообщение, на которое указывает I<msg_ptr>, в очередь сообщений, на которую ссылается дескриптор очереди сообщений I<mqdes>. В аргументе I<msg_len> задаётся длина сообщения, на которое указывает I<msg_ptr>; эта длина должна быть меньше или равно атрибуту очереди I<mq_msgsize>. Допускаются сообщения нулевой длины.
