Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: A process can obtain a private mount namespace if: it was created using the B<clone>(2) B<CLONE_NEWNS> flag, in which case its new namespace is initialized to be a I<copy> of the namespace of the process that called B<clone>(2); or it calls B<unshare>(2) with the B<CLONE_NEWNS> flag, which causes the caller's mount namespace to obtain a private copy of the namespace that it was previously sharing with other processes, so that future mounts and unmounts by the caller are invisible to other processes (except child processes that the caller subsequently creates) and vice versa.
ru: Процесс может получить собственное пространство имён монтирования если: он был создан с помощью B<clone>(2) с флагом B<CLONE_NEWNS>; в этом случае его новое пространство имён инициализируется I<копией> пространства имён процесса, который вызвал B<clone>(2); или он вызовет B<unshare>(2) с флагом B<CLONE_NEWNS>; в этом случае пространство имён вызвавшего получит свою копию пространства имён, которое он раньше совместно использовал с другими процессами, и дальнейшие монтирования и размонтирования вызвавшим будут невидимы другим процессам (за исключением потомков, которые вызывающий создаст позже) и наоборот.

source: The Linux-specific I</proc/[pid]/mounts> file exposes the list of mount points in the mount namespace of the process with the specified ID. The I</proc/[pid]/mountinfo> file exposes even more information about mount points, including the propagation type and mount ID information that makes it possible to discover the parental relationship between mount points. See B<proc>(5) and B<mount_namespaces>(7) for details of these files.
ru: В файле I</proc/[pid]/mounts> (имеется только в Linux) отображается список точек монтирования в пространстве имён монтирования процесса с соответствующем ID. В файле I</proc/[pid]/mountinfo> отображается дополнительная информация о точках монтирования, включая тип распространения и информационный идентификатор монтирования, который позволяет обнаруживать связи между точками монтирования. Описание этих файлов смотрите в B<proc>(5) и B<mount_namespaces>(7).

source: msgrcv, msgsnd - System V message queue operations
ru: msgrcv, msgsnd - операции с очередью сообщений System V

source: The B<msgsnd>() and B<msgrcv>() system calls are used to send messages to, and receive messages from, a System\ V message queue. The calling process must have write permission on the message queue in order to send a message, and read permission to receive a message.
ru: Системные вызовы B<msgsnd>() и B<msgrcv>() используются для отправки и получения сообщений из очереди сообщений System\ V. Вызывающий процесс должен иметь права на запись в очередь сообщений, чтобы отправлять сообщения и права на чтение для получения сообщений.

source: The I<msgp> argument is a pointer to a caller-defined structure of the following general form:
ru: Аргумент I<msgp> представляет собой указатель на структуру, определяемую вызывающим как:

source: struct msgbuf { long mtype; /* message type, must be E<gt> 0 */ char mtext[1]; /* message data */ };
ru: struct msgbuf { long mtype; /* тип сообщения, значение должно быть E<gt> 0 */ char mtext[1]; /* данные сообщения */ };

source: The I<mtext> field is an array (or other structure) whose size is specified by I<msgsz>, a nonnegative integer value. Messages of zero length (i.e., no I<mtext> field) are permitted. The I<mtype> field must have a strictly positive integer value. This value can be used by the receiving process for message selection (see the description of B<msgrcv>() below).
ru: Поле I<mtext> является массивом (или другой структурой), размер которого определяется I<msgsz> — неотрицательным целым значением. Разрешены сообщения нулевой длины (т.е. без поля I<mtext>). Поле I<mtype> должно быть только положительным целым значением. Это значение используется процессом-получателем для выбора сообщения (см. описание B<msgrcv>() далее).

source: The B<msgsnd>() system call appends a copy of the message pointed to by I<msgp> to the message queue whose identifier is specified by I<msqid>.
ru: Системный вызов B<msgsnd>() добавляет копию сообщения, указанного I<msgp>, в очередь сообщений, идентификатор которой задаётся в I<msqid>.

source: If sufficient space is available in the queue, B<msgsnd>() succeeds immediately. The queue capacity is governed by the I<msg_qbytes> field in the associated data structure for the message queue. During queue creation this field is initialized to B<MSGMNB> bytes, but this limit can be modified using B<msgctl>(2). A message queue is considered to be full if either of the following conditions is true:
ru: Если в очереди достаточно места, то B<msgsnd>() сразу успешно завершается. Размер очереди управляется полем I<msg_qbytes> в связанной структуре данных очереди сообщений. При создании очереди это поле инициализируется значением B<MSGMNB> байт, но данное ограничение можно изменить с помощью B<msgctl>(2). Очередь сообщений считается заполненной при одном из следующих условий:

source: Adding a new message to the queue would cause the total number of bytes in the queue to exceed the queue's maximum size (the I<msg_qbytes> field).
ru: Добавление нового сообщения привело бы к превышению общего количества байт очереди над максимальным количеством размером очереди (поле I<msg_qbytes>).

source: Adding another message to the queue would cause the total number of messages in the queue to exceed the queue's maximum size (the I<msg_qbytes> field). This check is necessary to prevent an unlimited number of zero-length messages being placed on the queue. Although such messages contain no data, they nevertheless consume (locked) kernel memory.
ru: Добавление другого сообщения привело бы к превышению общего количества сообщений очереди над максимальным количеством размером очереди (поле I<msg_qbytes>). Эта проверка необходима для предотвращения помещения в очередь бесконечного количества сообщений нулевой длины. Хотя такие сообщения не содержат данных, тем не менее, они потребляют (блокируют) память ядра.

source: If insufficient space is available in the queue, then the default behavior of B<msgsnd>() is to block until space becomes available. If B<IPC_NOWAIT> is specified in I<msgflg>, then the call instead fails with the error B<EAGAIN>.
ru: Если в очереди недостаточно места, то по умолчанию B<msgsnd>() блокирует выполнение до появления свободного места. Если в I<msgflg> указан B<IPC_NOWAIT>, то вызов вместо этого завершается с ошибкой B<EAGAIN>.

source: A blocked B<msgsnd>() call may also fail if:
ru: Заблокированный вызов B<msgsnd>() может завершиться ошибкой если:

source: the queue is removed, in which case the system call fails with I<errno> set to B<EIDRM>; or
ru: очередь удалена (в этом случае системный вызов выдаст ошибку, определив I<errno> в значение B<EIDRM>;

source: a signal is caught, in which case the system call fails with I<errno> set to B<EINTR>;B<see> B<signal>(7). (B<msgsnd>() is never automatically restarted after being interrupted by a signal handler, regardless of the setting of the B<SA_RESTART> flag when establishing a signal handler.)
ru: пойман сигнал; в этом случае системный вызов завершается с ошибкой и присваивает I<errno> значение B<EINTR>; B<см.> B<signal>(7). Вызов B<msgsnd>() никогда не перезапускается автоматически после прерывания обработчиком сигнала, независимо от установки флага B<SA_RESTART> при настройке обработчика сигнала.

source: Upon successful completion the message queue data structure is updated as follows:
ru: Перед успешным завершением структура данных очереди сообщений будет обновлена следующим образом:

source: I<msg_lspid> is set to the process ID of the calling process.
ru: Значение I<msg_lspid> устанавливается равным идентификатору вызывающего процесса.

source: I<msg_qnum> is incremented by 1.
ru: Значение I<msg_qnum> увеличивается на 1.

source: I<msg_stime> is set to the current time.
ru: Значение I<msg_stime> присваивается значение текущего времени.

source: The B<msgrcv>() system call removes a message from the queue specified by I<msqid> and places it in the buffer pointed to by I<msgp>.
ru: Системный вызов B<msgrcv>() удаляет сообщение из очереди, указанной в I<msqid> и помещает его в буфер, указанный в I<msgp>.

source: The argument I<msgsz> specifies the maximum size in bytes for the member I<mtext> of the structure pointed to by the I<msgp> argument. If the message text has length greater than I<msgsz>, then the behavior depends on whether B<MSG_NOERROR> is specified in I<msgflg>. If B<MSG_NOERROR> is specified, then the message text will be truncated (and the truncated part will be lost); if B<MSG_NOERROR> is not specified, then the message isn't removed from the queue and the system call fails returning -1 with I<errno> set to B<E2BIG>.
ru: Параметр I<msgsz> задаёт максимальный размер (в байтах) элемента I<mtext> структуры, находящейся по адресу, указанному в аргументе I<msgp>. Если длина текста сообщения больше чем I<msgsz>, то поведение зависит от наличия флага B<MSG_NOERROR> в I<msgflg>. Если B<MSG_NOERROR> указан, то текст сообщения будет урезан (а урезанная часть потеряна); иначе сообщение не удаляется из очереди, а системный вызов возвращает -1 и присваивает I<errno> значение B<E2BIG>.

source: Unless B<MSG_COPY> is specified in I<msgflg> (see below), the I<msgtyp> argument specifies the type of message requested, as follows:
ru: Если в I<msgflg> (смотрите ниже ) не указан B<MSG_COPY>, то в аргументе I<msgtyp> указывается тип запрашиваемого сообщения:

source: If I<msgtyp> is 0, then the first message in the queue is read.
ru: Если I<msgtyp> равно нулю, то читается первое сообщение в очереди.

source: If I<msgtyp> is greater than 0, then the first message in the queue of type I<msgtyp> is read, unless B<MSG_EXCEPT> was specified in I<msgflg>, in which case the first message in the queue of type not equal to I<msgtyp> will be read.
ru: Если I<msgtyp> больше нуля, то из очереди читается первое сообщение с типом I<msgtyp> (если только в I<msgflg> не указан B<MSG_EXCEPT>. В этом случае из очереди читается первое сообщение, тип которого не равен I<msgtyp>).

source: If I<msgtyp> is less than 0, then the first message in the queue with the lowest type less than or equal to the absolute value of I<msgtyp> will be read.
ru: Если I<msgtyp> меньше нуля, то из очереди читается первое сообщение со значением, меньшим или равным абсолютному значению I<msgtyp>.

source: The I<msgflg> argument is a bit mask constructed by ORing together zero or more of the following flags:
ru: Аргумент I<msgflg> представляет собой битовую маску из комбинации нуля или более следующих флагов:

source: Return immediately if no message of the requested type is in the queue. The system call fails with I<errno> set to B<ENOMSG>.
ru: Немедленный возврат, если в очереди нет сообщений необходимого типа. При этом системный вызов возвращает ошибку, присваивая I<errno> значение B<ENOMSG>.

source: B<MSG_COPY> (since Linux 3.8)
ru: B<MSG_COPY> (начиная с Linux 3.8)

source: Nondestructively fetch a copy of the message at the ordinal position in the queue specified by I<msgtyp> (messages are considered to be numbered starting at 0).
ru: Забирает копию сообщения без удаления из начальной позиции в очереди, заданной в I<msgtyp> (сообщения нумеруются начиная с 0).

source: This flag must be specified in conjunction with B<IPC_NOWAIT>, with the result that, if there is no message available at the given position, the call fails immediately with the error B<ENOMSG>. Because they alter the meaning of I<msgtyp> in orthogonal ways, B<MSG_COPY> and B<MSG_EXCEPT> may not both be specified in I<msgflg>.
ru: Этот флаг должен указываться вместе с B<IPC_NOWAIT>; в этом случае, если в заданной позиции сообщение отсутствует, то вызов завершается с ошибкой B<ENOMSG> немедленно. Флаги B<MSG_COPY> и B<MSG_EXCEPT> не могут указываться вместе в I<msgflg>, так как кардинально изменяют смысл I<msgtyp>.

source: The B<MSG_COPY> flag was added for the implementation of the kernel checkpoint-restore facility and is available only if the kernel was built with the B<CONFIG_CHECKPOINT_RESTORE> option.
ru: Флаг B<MSG_COPY> был добавлен для реализации способности ядра для контрольных точек/восстановления и доступен только, если ядро собрано с параметром B<CONFIG_CHECKPOINT_RESTORE>.

source: Used with I<msgtyp> greater than 0 to read the first message in the queue with message type that differs from I<msgtyp>.
ru: Используется, если I<msgtyp> больше 0, для чтения первого сообщения в очереди с типом, отличным от I<msgtyp>.

source: To truncate the message text if longer than I<msgsz> bytes.
ru: Используется для урезания текста сообщения, если его размер больше I<msgsz> байт.

source: If no message of the requested type is available and B<IPC_NOWAIT> isn't specified in I<msgflg>, the calling process is blocked until one of the following conditions occurs:
ru: Если в очереди нет сообщения необходимого типа и в I<msgflg> не указан B<IPC_NOWAIT>, то вызывающий процесс будет заблокирован до тех пор, пока не произойдет одно из следующих событий:

source: A message of the desired type is placed in the queue.
ru: В очередь не будет помещено сообщение необходимого типа.

source: The message queue is removed from the system. In this case, the system call fails with I<errno> set to B<EIDRM>.
ru: Очередь сообщений удалена из системы. В этом случае системный вызов возвращает ошибку и присваивает I<errno> значение B<EIDRM>.

source: The calling process catches a signal. In this case, the system call fails with I<errno> set to B<EINTR>. (B<msgrcv>() is never automatically restarted after being interrupted by a signal handler, regardless of the setting of the B<SA_RESTART> flag when establishing a signal handler.)
ru: Вызывающий процесс не получит сигнал, который должен обработать. В этом случае системный вызов возвращает ошибку и присваивает переменной I<errno> значение B<EINTR>. Вызов B<msgrcv>() никогда не перезапускается автоматически после прерывания обработчиком сигнала, независимо от установки флага B<SA_RESTART> при настройке обработчика сигнала.

source: I<msg_lrpid> is set to the process ID of the calling process.
ru: Значение I<msg_lrpid> устанавливается равным идентификатору вызывающего процесса.

source: I<msg_qnum> is decremented by 1.
ru: Значение I<msg_qnum> уменьшается на 1.

source: I<msg_rtime> is set to the current time.
ru: Значение I<msg_rtime> становится равным текущему времени.

source: On failure both functions return -1 with I<errno> indicating the error, otherwise B<msgsnd>() returns 0 and B<msgrcv>() returns the number of bytes actually copied into the I<mtext> array.
ru: При ошибке оба вызова возвращают -1, а переменная I<errno> приобретает соответствующее значение. В противном случае B<msgsnd>() возвращает 0, а B<msgrcv>() возвращает количество байтов, скопированных в массив I<mtext>.

source: When B<msgsnd>() fails, I<errno> will be set to one among the following values:
ru: Значения I<errno>, устанавливаемые при возникновении ошибок в B<msgsnd>():

source: The calling process does not have write permission on the message queue, and does not have the B<CAP_IPC_OWNER> capability in the user namespace that governs its IPC namespace.
ru: Вызывающий процесс не имеет прав записи в очередь сообщений и не имеет мандата B<CAP_IPC_OWNER> в пользовательском пространстве имён, которое управляет его пространством имён IPC.

source: The message can't be sent due to the I<msg_qbytes> limit for the queue and B<IPC_NOWAIT> was specified in I<msgflg>.
ru: Сообщение не может быть отправлено, так как размер очереди превысит лимит, равный I<msg_qbytes>, а в параметре I<msgflg> установлен флаг B<IPC_NOWAIT>.

source: The address pointed to by I<msgp> isn't accessible.
ru: Память с адресом, указанным I<msgp>, недоступна.

source: Sleeping on a full message queue condition, the process caught a signal.
ru: Процесс ждал свободного места в очереди и получил сигнал, который должен обработать.

source: Invalid I<msqid> value, or nonpositive I<mtype> value, or invalid I<msgsz> value (less than 0 or greater than the system value B<MSGMAX>).
ru: Задано неправильное значение I<msqid>, не положительное значение I<mtype> или неправильное значение I<msgsz> (меньше 0, или больше системного лимита, заданного B<MSGMAX>).

source: The system does not have enough memory to make a copy of the message pointed to by I<msgp>.
ru: Недостаточно памяти в системе для копирования сообщения, указанного I<msgp>.

source: When B<msgrcv>() fails, I<errno> will be set to one among the following values:
ru: Значения I<errno>, устанавливаемые при возникновении ошибок в B<msgrcv>():

source: The message text length is greater than I<msgsz> and B<MSG_NOERROR> isn't specified in I<msgflg>.
ru: Длина текста получаемого сообщения больше, чем I<msgsz>, а в поле I<msgflg> не установлен флаг B<MSG_NOERROR>.

source: The calling process does not have read permission on the message queue, and does not have the B<CAP_IPC_OWNER> capability in the user namespace that governs its IPC namespace.
ru: Вызывающий процесс не имеет прав чтобы прочитать очереди сообщений и не имеет мандата B<CAP_IPC_OWNER> в пространстве имён пользователя, который управляет его пространством имён IPC.

source: While the process was sleeping to receive a message, the message queue was removed.
ru: Процесс ждал приёма сообщения, и в это время очередь сообщений была удалена.

source: While the process was sleeping to receive a message, the process caught a signal; see B<signal>(7).
ru: Во время ожидания приёма сообщения процесс получил сигнал; см. B<signal>(7).

source: I<msqid> was invalid, or I<msgsz> was less than 0.
ru: Неверное значение I<msqid> или I<msgsz> меньше 0.

source: B<EINVAL> (since Linux 3.14)
ru: B<EINVAL> (начиная с Linux 3.14)

source: I<msgflg> specified B<MSG_COPY>, but not B<IPC_NOWAIT>.
ru: В I<msgflg> указан флаг B<MSG_COPY>, но нет B<IPC_NOWAIT>.

source: I<msgflg> specified both B<MSG_COPY> and B<MSG_EXCEPT>.
ru: В I<msgflg> указаны B<MSG_COPY> и B<MSG_EXCEPT>.

source: B<IPC_NOWAIT> was specified in I<msgflg> and no message of the requested type existed on the message queue.
ru: В очереди нет сообщения необходимого типа, а в параметре I<msgflg> установлен флаг B<IPC_NOWAIT>.

source: B<IPC_NOWAIT> and B<MSG_COPY> were specified in I<msgflg> and the queue contains less than I<msgtyp> messages.
ru: Флаги B<IPC_NOWAIT> и B<MSG_COPY> указаны в I<msgflg>, но в очереди содержится меньше I<msgtyp> сообщений.

source: B<ENOSYS> (since Linux 3.8)
ru: B<ENOSYS> (начиная с Linux 3.8)

source: I<MSG_COPY> was specified in I<msgflg>, and this kernel was configured without B<CONFIG_CHECKPOINT_RESTORE>.
ru: Флаг I<MSG_COPY> указан в I<msgflg>, но ядро собрано без параметра B<CONFIG_CHECKPOINT_RESTORE>.

source: The B<MSG_EXCEPT> and B<MSG_COPY> flags are Linux-specific; their definitions can be obtained by defining the B<_GNU_SOURCE> feature test macro.
ru: Флаги B<MSG_EXCEPT> и B<MSG_COPY> есть только в Linux; их определения можно получить указав макрос тестирования свойств B<_GNU_SOURCE>.

source: The I<msgp> argument is declared as I<struct msgbuf\ *> in glibc 2.0 and 2.1. It is declared as I<void\ *> in glibc 2.2 and later, as required by SUSv2 and SUSv3.
ru: Аргумент I<msgp> в glibc 2.0 и 2.1 объявлен как I<struct msgbuf *>. В glibc 2.2 и новее, в соответствии с SUSv2 и SUSv3, он объявлен как I<void\ *>.

source: The following limits on message queue resources affect the B<msgsnd>() call:
ru: На работу системного вызова B<msgsnd>() влияют следующие системные ограничения на ресурсы очереди сообщений:

source: Maximum size of a message text, in bytes (default value: 8192 bytes). On Linux, this limit can be read and modified via I</proc/sys/kernel/msgmax>.
ru: Максимальный размер текста сообщения: по умолчанию он равен 8192 байтам (в Linux это ограничение можно прочитать и изменить через I</proc/sys/kernel/msgmax>).

source: Maximum number of bytes that can be held in a message queue (default value: 16384 bytes). On Linux, this limit can be read and modified via I</proc/sys/kernel/msgmnb>. A privileged process (Linux: a process with the B<CAP_SYS_RESOURCE> capability) can increase the size of a message queue beyond B<MSGMNB> using the B<msgctl>(2) B<IPC_SET> operation.
ru: Максимальное количество байт, которое может храниться в очереди сообщений (по умолчанию 16384 байт). В Linux это ограничение можно прочитать и изменить через I</proc/sys/kernel/msgmnb>. Привилегированный процесс (Linux: процесс с мандатом B<CAP_SYS_RESOURCE>) может устанавливать размер очереди сообщений больше чем B<MSGMNB> при помощи вызова B<msgctl>() с операцией B<IPC_SET>.

source: The implementation has no intrinsic system-wide limits on the number of message headers (B<MSGTQL>) and the number of bytes in the message pool (B<MSGPOOL>).
ru: Реализация не накладывает существенных системных ограничений на максимальное количество заголовков сообщений (B<MSGTQL>) и на количество байт в пуле сообщений (B<MSGPOOL>).

source: In Linux 3.13 and earlier, if B<msgrcv>() was called with the B<MSG_COPY> flag, but without B<IPC_NOWAIT>, and the message queue contained less than I<msgtyp> messages, then the call would block until the next message is written to the queue. At that point, the call would return a copy of the message, I<regardless> of whether that message was at the ordinal position I<msgtyp>. This bug is fixed in Linux 3.14.
ru: В Linux 3.13 и старее, если B<msgrcv>() был вызван с флагом B<MSG_COPY> flag, но без B<IPC_NOWAIT>, и очередь сообщений содержала менее I<msgtyp> сообщений, то вызов блокировал выполнения до тех пор, пока следующее сообщение не записывалось в очередь. written to the queue. В этот момент вызов возвращал копию сообщения, I<независимо> от того, что сообщение было в начальной позиции I<msgtyp>. Этот дефект был исправлен в Linux 3.14.

source: Specifying both B<MSG_COPY> and B<MSC_EXCEPT> in I<msgflg> is a logical error (since these flags impose different interpretations on I<msgtyp>). In Linux 3.13 and earlier, this error was not diagnosed by B<msgrcv>(). This bug is fixed in Linux 3.14.
ru: Указание обоих флагов B<MSG_COPY> и B<MSC_EXCEPT> в I<msgflg> является логической ошибкой (так как для флагов по-разному интерпретируется I<msgtyp>). В Linux 3.13 и старее эта ошибка не определялась B<msgrcv>(). Этот дефект был исправлен в Linux 3.14.

source: The program below demonstrates the use of B<msgsnd>() and B<msgrcv>().
ru: Представленная ниже программа показывает использование B<msgsnd>() и B<msgrcv>().

source: The example program is first run with the B<-s> option to send a message and then run again with the B<-r> option to receive a message.
ru: В первый раз программа запускается с параметром B<-s> для отправки сообщения, а в второй — с параметром B<-r> для получения сообщения.

source: The following shell session shows a sample run of the program:
ru: Пример сеанса работы с программой:

source: $B< ./a.out -s> sent: a message at Wed Mar 4 16:25:45 2015
ru: $B< ./a.out -s> отправка: дата сообщения Wed Mar 4 16:25:45 2015

source: $B< ./a.out -r> message received: a message at Wed Mar 4 16:25:45 2015
ru: $B< ./a.out -r> приём: дата сообщения Wed Mar 4 16:25:45 2015
