Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: The name choice B<IPC_PRIVATE> was perhaps unfortunate, B<IPC_NEW> would more clearly show its function.
ru: Имя B<IPC_PRIVATE>, возможно, было выбрано неудачно, B<IPC_NEW> отражает смысл действия более ясно.

source: modify_ldt - get or set a per-process LDT entry
ru: modify_ldt - возвращает или изменяет запись LDT у процесса

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
ru: I<Замечание>: В glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: B<modify_ldt>() reads or writes the local descriptor table (LDT) for a process. The LDT is an array of segment descriptors that can be referenced by user code. Linux allows processes to configure a per-process (actually per-mm) LDT. For more information about the LDT, see the Intel Software Developer's Manual or the AMD Architecture Programming Manual.
ru: Вызов B<modify_ldt>() считывает или записывает таблицу локальных дескрипторов (LDT) процесса. LDT представляет собой массив дескрипторов сегментов, которые могут использоваться в пользовательском коде. В Linux процессам разрешено настраивать попроцессные (в действительности, пространство памяти) LDT. Дополнительную информацию о LDT, смотрите в Intel Software Developer's Manual или AMD Architecture Programming Manual.

source: When I<func> is 0, B<modify_ldt>() reads the LDT into the memory pointed to by I<ptr>. The number of bytes read is the smaller of I<bytecount> and the actual size of the LDT, although the kernel may act as though the LDT is padded with additional trailing zero bytes. On success, B<modify_ldt>() will return the number of bytes read.
ru: Если I<func> равно 0, то B<modify_ldt>() читает LDT в память, на которую указывает I<ptr>. Количество читаемых байт — меньшее из I<bytecount> и реального размера LDT несмотря на то, что ядро может действовать как будто LDT заполняется дополнительными нулевыми байтами в конце. При успешном выполнении B<modify_ldt>() возвращает количество прочитанных байт.

source: When I<func> is 1 or 0x11, B<modify_ldt>() modifies the LDT entry indicated by I<ptr-E<gt>entry_number>. I<ptr> points to a I<user_desc> structure and I<bytecount> must equal the size of this structure.
ru: Если значение I<func> равно 1 или 0x11, то B<modify_ldt>() изменяет запись LDT, на которую указывает I<ptr-E<gt>entry_number>. Значение I<ptr> указывает на структуру I<user_desc>, а I<bytecount> должно быть равно размеру этой структуры.

source: The I<user_desc> structure is defined in I<E<lt>asm/ldt.hE<gt>> as:
ru: Структура I<user_desc> определена в I<E<lt>asm/ldt.hE<gt>> следующим образом:

source: In Linux 2.4 and earlier, this structure was named I<modify_ldt_ldt_s>.
ru: В Linux версии 2.4 и более ранних эта структура называлась I<modify_ldt_ldt_s>.

source: The I<contents> field is the segment type (data, expand-down data, non-conforming code, or conforming code). The other fields match their descriptions in the CPU manual, although B<modify_ldt>() cannot set the hardware-defined "accessed" bit described in the CPU manual.
ru: В поле I<contents> определяется тип сегмента (данные, данные, расширяемые вниз (expand-down data), не соответствующий код (non-conforming code) или соответствующий код). Назначение других полей совпадает с их описанием в руководстве к процессору, несмотря на то, что B<modify_ldt>() не может изменить аппаратно-определяемый бит «доступа», описанный в руководстве к ЦП.

source: A I<user_desc> is considered "empty" if I<read_exec_only> and I<seg_not_present> are set to 1 and all of the other fields are 0. An LDT entry can be cleared by setting it to an "empty" I<user_desc> or, if I<func> is 1, by setting both I<base> and I<limit> to 0.
ru: A I<user_desc> считается «пустым», если I<read_exec_only> и I<seg_not_present> равны 1, а все остальные поля равны 0. Элемент LDT можно очистить, назначив ему «пустой» I<user_desc> или, если I<func> равно 1, установив I<base> и I<limit> в 0.

source: A conforming code segment (i.e., one with I<contents==3>) will be rejected if I<func> is 1 or if I<seg_not_present> is 0.
ru: Сегмент соответствующего кода (conforming code segment, т. е., с I<contents==3>) будет отклонён, если I<func> равно 1 или если I<seg_not_present> равно 0.

source: When I<func> is 2, B<modify_ldt>() will read zeros. This appears to be a leftover from Linux 2.4.
ru: Если I<func> равно 2, то B<modify_ldt>() прочитает нули. Это, кажется, пережиток из Linux 2.4.

source: On success, B<modify_ldt>() returns either the actual number of bytes read (for reading) or 0 (for writing). On failure, B<modify_ldt>() returns -1 and sets I<errno> to indicate the error.
ru: При успешном выполнении B<modify_ldt>() возвращается реальное количество прочитанных байт (при чтении) или 0 (при записи). При ошибке B<modify_ldt>() возвращает -1, а I<errno> устанавливается в соответствующее значение.

source: I<ptr> points outside the address space.
ru: Значение I<ptr> указывает за пределы адресного пространства.

source: I<ptr> is 0, or I<func> is 1 and I<bytecount> is not equal to the size of the structure I<user_desc>, or I<func> is 1 or 0x11 and the new LDT entry has invalid values.
ru: Значение I<ptr> равно 0, или I<func> равно 1, а I<bytecount> не равно размеру структуры I<user_desc>, или I<func> равно 1 или 0x11, а новый элемент LDT содержит неправильные значения.

source: I<func> is neither 0, 1, 2, nor 0x11.
ru: Значение I<func> не равно 0, 1, 2 или 0x11.

source: This call is Linux-specific and should not be used in programs intended to be portable.
ru: Данный вызов есть только в Linux и не должен использоваться в программах, которые должны быть переносимыми.

source: Glibc does not provide a wrapper for this system call; call it using B<syscall>(2).
ru: В glibc нет обёртки для данного системного вызова; запускайте его с помощью B<syscall>(2).

source: B<modify_ldt>() should not be used for thread-local storage, as it slows down context switches and only supports a limited number of threads. Threading libraries should use B<set_thread_area>(2) or B<arch_prctl>(2) instead, except on extremely old kernels that do not support those system calls.
ru: Вызов B<modify_ldt>() не должен использоваться для локального хранилища нити, так как это замедляет переключение контекста и поддерживается только для ограниченного количества нитей. Вместо этого в библиотеках нитей должны использоваться B<set_thread_area>(2) или B<arch_prctl>(2), только если не нужна поддержка старых ядер, где нет этих вызовов.

source: The normal use for B<modify_ldt>() is to run legacy 16-bit or segmented 32-bit code. Not all kernels allow 16-bit segments to be installed, however.
ru: Обычно, B<modify_ldt>() используют для запуска старого 16-битного или сегментированного 32-битного кода. Однако, не все ядра допускают установку 16-битных сегментов.

source: Even on 64-bit kernels, B<modify_ldt>() cannot be used to create a long mode (i.e., 64-bit) code segment. The undocumented field "lm" in I<user_desc> is not useful, and, despite its name, does not result in a long mode segment.
ru: Даже в 64-битных ядрах вызов B<modify_ldt>() нельзя использовать для создания сегмента кода в длинном режиме (т. е., 64-битного). Недокументированное поле «lm» в I<user_desc> не помогает и, несмотря на имя, не образует сегмент в длинном режиме.

source: On 64-bit kernels before Linux 3.19, setting the "lm" bit in I<user_desc> prevents the descriptor from being considered empty. Keep in mind that the "lm" bit does not exist in the 32-bit headers, but these buggy kernels will still notice the bit even when set in a 32-bit process.
ru: В 64-битных ядрах до Linux 3.19, установка бита «lm» в I<user_desc> приводила к тому, что дескриптор переставал считаться пустым. Учтите, что бит «lm» не существует в 32-битных заголовках, но есть дефектные ядра, которые по-прежнему сообщают о бите даже в 32-битном процессе.

source: mount - mount filesystem
ru: mount - применяется для монтирования файловых систем.

source: B<mount>() attaches the filesystem specified by I<source> (which is often a pathname referring to a device, but can also be the pathname of a directory or file, or a dummy string) to the location (a directory or file) specified by the pathname in I<target>.
ru: Вызов B<mount>() подключает файловую систему, указанную в I<source> (обычно здесь задаётся название устройства, но также может быть указано имя каталога, или файла, или фиктивное устройство), к пути заданному в I<target>(каталогу или файлу).

source: Appropriate privilege (Linux: the B<CAP_SYS_ADMIN> capability) is required to mount filesystems.
ru: Для монтирования файловых систем требуются специальные права (Linux: мандат B<CAP_SYS_ADMIN>).

source: Values for the I<filesystemtype> argument supported by the kernel are listed in I</proc/filesystems> (e.g., "btrfs", "ext4", "jfs", "xfs", "vfat", "fuse", "tmpfs", "cgroup", "proc", "mqueue", "nfs", "cifs", "iso9660"). Further types may become available when the appropriate modules are loaded.
ru: Вариант I<filesystemtype> доступные ядру перечислены в I</proc/filesystems> (например: "btrfs", "ext4", "jfs", "xfs", "vfat", "fuse", "tmpfs", "cgroup", "proc", "mqueue", "nfs", "cifs", "iso9660"). Дополнительные типы становятся доступными после загрузки соответствующих модулей.

source: The I<data> argument is interpreted by the different filesystems. Typically it is a string of comma-separated options understood by this filesystem. See B<mount>(8) for details of the options available for each filesystem type.
ru: Аргумент I<data> рассматривается каждой файловой системой по-своему. Обычно, это строка параметров, перечисленных через запятую, которые понимает файловая система. О том, какие параметры доступны для каждого типа файловой системы смотрите B<mount>(8).

source: A call to B<mount>() performs one of a number of general types of operation, depending on the bits specified in I<mountflags>. The choice of which operation to perform is determined by testing the bits set in I<mountflags>, with the tests being conducted in the order listed here:
ru: Вызов B<mount>() выполняет один из нескольких типов операций, в зависимости от значений, указанных в I<mountflags>. Выбор выполняемой операции определяется путем тестирования значений, установленных в I<mountflags>, с проведением тестов в следующем порядке:

source: Remount an existing mount: I<mountflags> includes B<MS_REMOUNT>.
ru: Перемонтировать существующие точки монтирования: I<mountflags> включает B<MS_REMOUNT>.

source: Create a bind mount: I<mountflags> includes B<MS_BIND>.
ru: Создать привязку (bind mount): I<mountflags> включает B<MS_BIND>.

source: Change the propagation type of an existing mount: I<mountflags> includes one of B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE>, or B<MS_UNBINDABLE>.
ru: Изменить тип существующего монтирования: I<mountflags> включает одно из B<MS_SHARED>, B<MS_PRIVATE>, B<MS_SLAVE> или B<MS_UNBINDABLE>.

source: Move an existing mount to a new location: I<mountflags> includes B<MS_MOVE>.
ru: Переместить существующее монтирование в новое место: I<mountflags> включает B<MS_MOVE>.

source: Create a new mount: I<mountflags> includes none of the above flags.
ru: Создать новое монтирование: I<mountflags> не содержит ни один из указанных выше флагов.

source: Each of these operations is detailed later in this page. Further flags may be specified in I<mountflags> to modify the behavior of B<mount>(), as described below.
ru: Каждая из этих операций подробно описана далее на этой странице. Для изменения поведения B<mount>() могут быть указаны дополнительные флаги в I<mountflags>, как описано ниже.

source: Additional mount flags
ru: Дополнительные флаги для монтирования

source: The list below describes the additional flags that can be specified in I<mountflags>. Note that some operation types ignore some or all of these flags, as described later in this page.
ru: Ниже расположенный список дополнительных флагов, которые можно использовать в I<mountflags>. Обратите внимание на то, что некоторые из них или даже все игнорируются операциями. Такие случае будут описаны далее по тексту.

source: B<MS_DIRSYNC> (since Linux 2.5.19)
ru: B<MS_DIRSYNC> (начиная с Linux 2.5.19)

source: Make directory changes on this filesystem synchronous. (This property can be obtained for individual directories or subtrees using B<chattr>(1).)
ru: Осуществлять изменения каталогов на этой файловой системе синхронно. Это свойство может быть получено для отдельных каталогов или дерева подкаталогов с помощью B<chattr>(1).

source: B<MS_LAZYTIME> (since Linux 4.0)
ru: B<MS_LAZYTIME> (начиная с Linux 4.0)

source: Reduce on-disk updates of inode timestamps (atime, mtime, ctime) by maintaining these changes only in memory. The on-disk timestamps are updated only when:
ru: Можно уменьшить количество обращений к диску, если сохранять дескрипторы меток времени (atime, mtime, ctime) только в памяти. Временные метки на диске обновляются только в следующих случаях:

source: the inode needs to be updated for some change unrelated to file timestamps;
ru: дескрипторы необходимо обновить для некоторого изменения, не связанного с временными метками файлов;

source: the application employs B<fsync>(2), B<syncfs>(2), or B<sync>(2);
ru: приложение использует B<fsync>(2), B<syncfs>(2), or B<sync>(2);

source: an undeleted inode is evicted from memory; or
ru: неиспользуемый дескриптор вытесняется из памяти; или

source: more than 24 hours have passed since the inode was written to disk.
ru: прошло более 24 часов с момента записи дескриптора на диск.

source: This mount option significantly reduces writes needed to update the inode's timestamps, especially mtime and atime. However, in the event of a system crash, the atime and mtime fields on disk might be out of date by up to 24 hours.
ru: Данный параметр монтирования существенно сокращает количество операций записи, необходимых для обновления меток времени inode, особенно mtime и atime. Однако, если произойдёт падение системы, то поля atime и mtime на диске могут оказаться устаревшими на 24 часа.

source: Examples of workloads where this option could be of significant benefit include frequent random writes to preallocated files, as well as cases where the B<MS_STRICTATIME> mount option is also enabled. (The advantage of combining B<MS_STRICTATIME> and B<MS_LAZYTIME> is that B<stat>(2) will return the correctly updated atime, but the atime updates will be flushed to disk only in the cases listed above.)
ru: В качестве примеров, где данный параметр может принести значительную выгоду это частые произвольные операции записи в уже выделенные файлы, а также случаи, когда также включён параметр монтирования B<MS_STRICTATIME> (преимущество объединения B<MS_STRICTATIME> и B<MS_LAZYTIME> в том, что B<stat>(2) будет возвращать правильное обновлённое время, но обновления atime будет производиться на диск только в случаях перечисленных выше).

source: Permit mandatory locking on files in this filesystem. (Mandatory locking must still be enabled on a per-file basis, as described in B<fcntl>(2).) Since Linux 4.5, this mount option requires the B<CAP_SYS_ADMIN> capability and a kernel configured with the B<CONFIG_MANDATORY_FILE_LOCKING> option.
ru: Разрешить обязательную блокировку файлов в этой файловой системе (обязательная блокировка всё равно сначала должна быть включена для определённого файла как описано в B<fcntl>(2)). Начиная с Linux 4.5 этот параметр монтирования требует мандата B<CAP_SYS_ADMIN> и ядро должно быть настроено с параметром B<CONFIG_MANDATORY_FILE_LOCKING>.

source: Do not update access times for (all types of) files on this filesystem.
ru: Не обновлять время доступа для (всех типов) файлов в этой файловой системе.

source: Do not allow access to devices (special files) on this filesystem.
ru: Запретить доступ к устройствам (специальным файлам) в этой файловой системе.

source: Do not update access times for directories on this filesystem. This flag provides a subset of the functionality provided by B<MS_NOATIME>; that is, B<MS_NOATIME> implies B<MS_NODIRATIME>.
ru: Не обновлять время доступа для каталогов в этой файловой системе. Данный флаг частично предоставляет свойство B<MS_NOATIME>; то есть при B<MS_NOATIME> подразумевается B<MS_NODIRATIME>.

source: Do not allow programs to be executed from this filesystem.
ru: Запретить исполнение программ в этой файловой системе.

source: Do not honor set-user-ID and set-group-ID bits or file capabilities when executing programs from this filesystem.
ru: Не учитывать биты set-UID и set-GID или файловые мандаты при исполнении программ в этой файловой системе.

source: Mount filesystem read-only.
ru: Подключить файловую систему в режиме только для чтения.

source: B<MS_REC> (since Linux 2.4.11)
ru: B<MS_REC> (начиная с Linux 2.4.11)

source: Used in conjunction with B<MS_BIND> to create a recursive bind mount, and in conjunction with the propagation type flags to recursively change the propagation type of all of the mounts in a subtree. See below for further details.
ru: Используется вместе с B<MS_BIND> для создания рекурсивной точки монтирования и вместе с флагами типа распространения для рекурсивного изменения типа распространения всех точек монтирования в поддереве. Подробности смотрите далее.

source: B<MS_RELATIME> (since Linux 2.6.20)
ru: B<MS_RELATIME> (начиная с Linux 2.6.20)

source: When a file on this filesystem is accessed, update the file's last access time (atime) only if the current value of atime is less than or equal to the file's last modification time (mtime) or last status change time (ctime). This option is useful for programs, such as B<mutt>(1), that need to know when a file has been read since it was last modified. Since Linux 2.6.30, the kernel defaults to the behavior provided by this flag (unless B<MS_NOATIME> was specified), and the B<MS_STRICTATIME> flag is required to obtain traditional semantics. In addition, since Linux 2.6.30, the file's last access time is always updated if it is more than 1 day old.
ru: При доступе к файлу на этой файловой системе значение времени последнего доступа к файлу (atime) обновляется, только если текущее значение atime меньше или равно времени последнего изменения файла (mtime) или времени последнего изменения состояния файла (ctime). Этот флаг полезен для программ (например, B<mutt>(1)), которым нужно знать, что файл был прочитан с момента его последнего изменения. Начиная с Linux 2.6.30 в ядро это поведение включено по умолчанию (если не указан B<MS_NOATIME>), а чтобы получить обычное поведение нужно указать флаг B<MS_STRICTATIME>. Также, начиная с Linux 2.6.30 время последнего доступа к файлу всегда обновляется, если оно устаревает на один день.

source: B<MS_SILENT> (since Linux 2.6.17)
ru: B<MS_SILENT> (начиная с Linux 2.6.17)

source: Suppress the display of certain (I<printk>()) warning messages in the kernel log. This flag supersedes the misnamed and obsolete B<MS_VERBOSE> flag (available since Linux 2.4.12), which has the same meaning.
ru: Не выводить определённые (I<printk>()) предупреждающие сообщения в журнал ядра. Этот флаг заменяет неправильно названный и устаревший флаг B<MS_VERBOSE> (доступный начиная с Linux 2.4.12), который выполняет такую же функцию.

source: B<MS_STRICTATIME> (since Linux 2.6.30)
ru: B<MS_STRICTATIME> (начиная с Linux 2.6.30)

source: Always update the last access time (atime) when files on this filesystem are accessed. (This was the default behavior before Linux 2.6.30.) Specifying this flag overrides the effect of setting the B<MS_NOATIME> and B<MS_RELATIME> flags.
ru: Всегда обновлять время последнего доступа (atime) при доступе к файлам на этой файловой системе (это выполнялось по умолчанию до Linux 2.6.30). Задание этого флага отменяет поведение флагов B<MS_NOATIME> и B<MS_RELATIME>.

source: Make writes on this filesystem synchronous (as though the B<O_SYNC> flag to B<open>(2) was specified for all file opens to this filesystem).
ru: Осуществлять запись на эту файловую систему синхронно (как если бы флаг B<O_SYNC> для B<open>(2) был указан для всех файлов, открытых на этой файловой системе).

source: From Linux 2.4 onward, some of the above flags are settable on a per-mount basis, while others apply to the superblock of the mounted filesystem, meaning that all mounts of the same filesystem share those flags. (Previously, all of the flags were per-superblock.)
ru: Начиная с Linux 2.4 одни из показанных выше флагов можно устанавливать на точки монтирования (свой набор на каждой), а другие — на суперблок смонтированной файловой системы, то есть все монтирования одной файловой системы имеют одинаковый набор этих флагов (ранее все флаги применялись к суперблоку).

source: The per-mount-point flags are as follows:
ru: Флаги набора для точки монтирования:

source: Since Linux 2.4: B<MS_NODEV>, B<MS_NOEXEC>, and B<MS_NOSUID> flags are settable on a per-mount-point basis.
ru: Начиная с Linux 2.4: флаги B<MS_NODEV>, B<MS_NOEXEC> и B<MS_NOSUID> задаются для каждой точки монтирования отдельно.

source: Since Linux 2.6.16: B<MS_NOATIME> and B<MS_NODIRATIME>.
ru: Начиная с Linux 2.6.16: B<MS_NOATIME> и B<MS_NODIRATIME>.

source: Since Linux 2.6.20: B<MS_RELATIME>.
ru: Начиная с Linux 2.6.20: B<MS_RELATIME>.

source: The following flags are per-superblock: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_MS_SILENT>, and B<MS_SYNCHRONOUS>. The initial settings of these flags are determined on the first mount of the filesystem, and will be shared by all subsequent mounts of the same filesystem. Subsequently, the settings of the flags can be changed via a remount operation (see below). Such changes will be visible via all mount points associated with the filesystem.
ru: Следующие флаги указываются для суперблока: B<MS_DIRSYNC>, B<MS_LAZYTIME>, B<MS_MANDLOCK>, B<MS_MS_SILENT> и B<MS_SYNCHRONOUS>. Начальный настройки этих флагов определяются по первому монтированию файловой системы и будут общими для всех последующих монтирований этой файловой системы. Следовательно, набор флагом можно изменить через операцию перемонтирования (смотрите далее). Эти изменения отразятся на всех точках монтирования, связанных с этой файловой системой.

source: Since Linux 2.6.16, B<MS_RDONLY> can be set or cleared on a per-mount-point basis as well as on the underlying filesystem superblock. The mounted filesystem will be writable only if neither the filesystem nor the mountpoint are flagged as read-only.
ru: Начиная с Linux 2.6.16 флаг B<MS_RDONLY> может устанавливаться и сбрасываться на точках монтирования по отдельности, а также на нижележащем суперблоке файловой системы. Смонтированная файловая система будет доступна на запись только, если она сама и её точка монтирования не помечены только для чтения.

source: Remounting an existing mount
ru: Перемонтированние существующих точек монтирования.

source: An existing mount may be remounted by specifying B<MS_REMOUNT> in I<mountflags>. This allows you to change the I<mountflags> and I<data> of an existing mount without having to unmount and remount the filesystem. I<target> should be the same value specified in the initial B<mount>() call.
ru: Существующие монтирования можно перемонтировать, указав B<MS_REMOUNT> в I<mountflags>. Это позволяет изменить I<mountflags> и I<data> существующих монтирований без необходимости размонтировать и заново монтировать файловую систему. I<target> должен соответствовать указанному при начальном вызове B<mount>().

source: The I<source> and I<filesystemtype> arguments are ignored.
ru: Аргументы I<source> и I<filesystemtype> игнорируются.
