Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_m/*.po
Languages: ru

source: Both B<MAP_SHARED> and B<MAP_PRIVATE> are described in POSIX.1-2001 and POSIX.1-2008. B<MAP_SHARED_VALIDATE> is a Linux extension.
ru: Флаги B<MAP_SHARED> и B<MAP_PRIVATE> описаны в POSIX.1-2001 и POSIX.1-2008. Флаг B<MAP_SHARED_VALIDATE> является расширением Linux.

source: In addition, zero or more of the following values can be ORed in I<flags>:
ru: Кроме этого в I<flags> могут быть указаны (побитовым сложением):

source: B<MAP_32BIT> (since Linux 2.4.20, 2.6)
ru: B<MAP_32BIT> (начиная с Linux 2.4.20, 2.6)

source: Put the mapping into the first 2 Gigabytes of the process address space. This flag is supported only on x86-64, for 64-bit programs. It was added to allow thread stacks to be allocated somewhere in the first 2\ GB of memory, so as to improve context-switch performance on some early 64-bit processors. Modern x86-64 processors no longer have this performance problem, so use of this flag is not required on those systems. The B<MAP_32BIT> flag is ignored when B<MAP_FIXED> is set.
ru: Поместить отображение в первые 2 гигабайта адресного пространства процесса. Этот флаг поддерживается только на архитектуре x86-64 для 64-битных программ. Он был добавлен для размещения стеков нитей в первых 2\ ГБ памяти, что даёт увеличение производительности при переключения контекста на некоторых первых 64-битных процессорах. В современных процессорах x86-64 такой проблемы с производительностью больше нет, поэтому на таких системах данный флаг больше не требуется. Он игнорируется, если указан флаг B<MAP_FIXED>.

source: Synonym for B<MAP_ANONYMOUS>. Deprecated.
ru: Синоним B<MAP_ANONYMOUS>. Устарел.

source: The mapping is not backed by any file; its contents are initialized to zero. The I<fd> argument is ignored; however, some implementations require I<fd> to be -1 if B<MAP_ANONYMOUS> (or B<MAP_ANON>) is specified, and portable applications should ensure this. The I<offset> argument should be zero. The use of B<MAP_ANONYMOUS> in conjunction with B<MAP_SHARED> is supported on Linux only since kernel 2.4.
ru: Отображение не привязанное к файлу; его содержимое инициализируется нулями. Аргумент I<fd> игнорируется ; однако в некоторых реализациях при указании B<MAP_ANONYMOUS> (или B<MAP_ANON>) требуется указывать I<fd> равное -1, и так нужно поступать для переносимости приложений. Аргумент I<offset> должен быть ноль. Использование B<MAP_ANONYMOUS> вместе с B<MAP_SHARED> поддерживается в Linux только начиная с ядра версии 2.4.

source: This flag is ignored. (Long ago\(emLinux 2.0 and earlier\(emit signaled that attempts to write to the underlying file should fail with B<ETXTBUSY>. But this was a source of denial-of-service attacks.)
ru: Этот флаг игнорируется (раньше — Linux 2.0 и старее — он обозначал, что попытки записи в подчинённые файлы должны завершаться с кодом ошибки B<ETXTBUSY>. Но это стало основой для атак типа отказа в обслуживании).

source: This flag is ignored.
ru: Этот флаг игнорируется.

source: Compatibility flag. Ignored.
ru: Флаг для совместимости, игнорируется.

source: Don't interpret I<addr> as a hint: place the mapping at exactly that address. I<addr> must be suitably aligned: for most architectures a multiple of the page size is sufficient; however, some architectures may impose additional restrictions. If the memory region specified by I<addr> and I<len> overlaps pages of any existing mapping(s), then the overlapped part of the existing mapping(s) will be discarded. If the specified address cannot be used, B<mmap>() will fail.
ru: Не учитывать I<addr> как подсказку: помещать отображение точно по этому адресу. Значение I<addr> должно быть выровнено соответствующим образом: на большинстве архитектур оно должно быть кратно размеру страницы; однако некоторые архитектуры могут накладывать дополнительные ограничения. Если область памяти, задаваемая I<addr> и I<len>, перекрывается со страницами существующих отображений, то перекрывающаяся часть существующих отображений будет отброшена. Если заданный адрес не может быть использован, то вызов B<mmap>() завершается ошибкой.

source: Software that aspires to be portable should use the B<MAP_FIXED> flag with care, keeping in mind that the exact layout of a process's memory mappings is allowed to change significantly between kernel versions, C library versions, and operating system releases. I<Carefully read the discussion of this flag in NOTES!>
ru: В переносимом ПО флаг B<MAP_FIXED> нужно использовать осторожно, так как точная раскладка процесса в памяти, доступная для изменения, может значительно отличаться в разных версиях ядер, библиотеки С и выпусках операционной системы. I<Внимательно прочитайте описание этого флага в ЗАМЕЧАНИЯХ!>

source: B<MAP_FIXED_NOREPLACE> (since Linux 4.17)
ru: B<MAP_FIXED_NOREPLACE> (начиная с Linux 4.17)

source: This flag provides behavior that is similar to B<MAP_FIXED> with respect to the I<addr> enforcement, but differs in that B<MAP_FIXED_NOREPLACE> never clobbers a preexisting mapped range. If the requested range would collide with an existing mapping, then this call fails with the error B<EEXIST.> This flag can therefore be used as a way to atomically (with respect to other threads) attempt to map an address range: one thread will succeed; all others will report failure.
ru: Данный флаг действует схожим с B<MAP_FIXED> образом при контроле I<addr>, но в отличие от него, флаг B<MAP_FIXED_NOREPLACE> никогда не разделяет уже существующий отображённый диапазон. Если запрошенный диапазон пересекается с существующим отображением, то такой вызов завершается ошибкой B<EEXIST>. Поэтому данный флаг можно использовать как атомарную (если есть другие нити) попытку отображения адресного диапазона: для одной нити она закончится успешно; все остальные получат ошибку.

source: Note that older kernels which do not recognize the B<MAP_FIXED_NOREPLACE> flag will typically (upon detecting a collision with a preexisting mapping) fall back to a "non-B<MAP_FIXED>" type of behavior: they will return an address that is different from the requested address. Therefore, backward-compatible software should check the returned address against the requested address.
ru: Заметим, что старые ядра, не понимающие флаг B<MAP_FIXED_NOREPLACE>, обычно (при обнаружении пересечения с существующим отображением) переходят к запасному варианту поведения, «не B<MAP_FIXED>»: они возвращают адрес, отличающийся от запрашиваемого адреса. Поэтому, ПО с обратной совместимостью должно сравнивать возращённый адрес с запрашиваемым.

source: This flag is used for stacks. It indicates to the kernel virtual memory system that the mapping should extend downward in memory. The return address is one page lower than the memory area that is actually created in the process's virtual address space. Touching an address in the "guard" page below the mapping will cause the mapping to grow by a page. This growth can be repeated until the mapping grows to within a page of the high end of the next lower mapping, at which point touching the "guard" page will result in a B<SIGSEGV> signal.
ru: Этот флаг используется для стеков. Для виртуальной системы памяти ядра он обозначает, что отображение должно расширяться вниз по памяти. Возвращаемый адрес указывает на одну страницу ниже области памяти, которая в действительности создаётся в виртуальном адресном пространстве процесса. Обращение к адресу ниже «защитной» страницы отображения приведёт к расширению отображения на страницу. Увеличение таким способом можно повторять до тех пор, пока рост отображения страницы верхним концом не достигнет следующего нижнего отображения, при таком обращении к «защитной» страницы возникнет сигнал B<SIGSEGV>.

source: B<MAP_HUGETLB> (since Linux 2.6.32)
ru: B<MAP_HUGETLB> (начиная с Linux 2.6.32)

source: Allocate the mapping using "huge pages." See the Linux kernel source file I<Documentation/admin-guide/mm/hugetlbpage.rst> for further information, as well as NOTES, below.
ru: Выделять отображение используя «огромные страницы». Дополнительную информацию смотрите в файле исходного кода ядра Linux I<Documentation/admin-guide/mm/hugetlbpage.rst>, а также следующее дополнение.

source: B<MAP_HUGE_2MB>, B<MAP_HUGE_1GB> (since Linux 3.8)
ru: B<MAP_HUGE_2MB>, B<MAP_HUGE_1GB> (начиная с Linux 3.8)

source: Used in conjunction with B<MAP_HUGETLB> to select alternative hugetlb page sizes (respectively, 2\ MB and 1\ GB) on systems that support multiple hugetlb page sizes.
ru: Используется как дополнение к B<MAP_HUGETLB> для выбора размера страницы hugetlb (2\ МБ и 1\ ГБ, соответственно), сработает только в системе которая поддерживает различные размеры больших страниц.

source: More generally, the desired huge page size can be configured by encoding the base-2 logarithm of the desired page size in the six bits at the offset B<MAP_HUGE_SHIFT>. (A value of zero in this bit field provides the default huge page size; the default huge page size can be discovered via the I<Hugepagesize> field exposed by I</proc/meminfo>.) Thus, the above two constants are defined as:
ru: Вообще, желаемый размер огромной страницы можно настроить закодировав логарифм 2 от желаемого размера страницы в шести битах со смещением B<MAP_HUGE_SHIFT> (значение нуля в этом битовом поле означает выбор значения огромной страницы по умолчанию; это значение можно найти в поле I<Hugepagesize> просмотрев файл I</proc/meminfo>). Таким образом две показанные выше константы определены как:

source: The range of huge page sizes that are supported by the system can be discovered by listing the subdirectories in I</sys/kernel/mm/hugepages>.
ru: Рабочий диапазон страниц огромного размера может быть обнаружен, перечислив подкаталоги в I</sys/kernel/mm/hugepages>.

source: B<MAP_LOCKED> (since Linux 2.5.37)
ru: B<MAP_LOCKED> (начиная с Linux 2.5.37)

source: Mark the mapped region to be locked in the same way as B<mlock>(2). This implementation will try to populate (prefault) the whole range but the B<mmap>() call doesn't fail with B<ENOMEM> if this fails. Therefore major faults might happen later on. So the semantic is not as strong as B<mlock>(2). One should use B<mmap>() plus B<mlock>(2) when major faults are not acceptable after the initialization of the mapping. The B<MAP_LOCKED> flag is ignored in older kernels.
ru: Пометить отображаемую область как заблокированную таким же образом как с помощью B<mlock>(2). Данная реализация будет пытаться заполнить (предотказ) область полностью, но вызов B<mmap>() не завершится ошибкой B<ENOMEM>, если это не удастся сделать. Поэтому действительные отказы могут произойти позднее. Такой алгоритм не совпадает с B<mlock>(2). Нужно использовать B<mmap>() плюс B<mlock>(2), если действительные отказы недопустимы после инициализации отображения. В старых ядрах флаг B<MAP_LOCKED> игнорируется.

source: B<MAP_NONBLOCK> (since Linux 2.5.46)
ru: B<MAP_NONBLOCK> (начиная с Linux 2.5.46)

source: This flag is meaningful only in conjunction with B<MAP_POPULATE>. Don't perform read-ahead: create page tables entries only for pages that are already present in RAM. Since Linux 2.6.23, this flag causes B<MAP_POPULATE> to do nothing. One day, the combination of B<MAP_POPULATE> and B<MAP_NONBLOCK> may be reimplemented.
ru: Данный флаг имеет смысл только вместе с B<MAP_POPULATE>. Не выполнять упреждающее чтение: только создать записи в таблице страниц для страниц, которые уже есть ОЗУ. Начиная с Linux 2.6.23 этот флаг приводит к тому, что выполнение работы B<MAP_POPULATE> отменяется. Когда-нибудь комбинация B<MAP_POPULATE> и B<MAP_NONBLOCK> может быть реализована заново.

source: Do not reserve swap space for this mapping. When swap space is reserved, one has the guarantee that it is possible to modify the mapping. When swap space is not reserved one might get B<SIGSEGV> upon a write if no physical memory is available. See also the discussion of the file I</proc/sys/vm/overcommit_memory> in B<proc>(5). In kernels before 2.6, this flag had effect only for private writable mappings.
ru: Не резервировать страницы пространства подкачки для этого отображения. Если пространство подкачки резервируется, то для отображения гарантируется возможность изменения. Если оно не резервируется, то можно получить сигнал B<SIGSEGV> при записи, если физическая память будет недоступна. Смотрите также описание файла I</proc/sys/vm/overcommit_memory> в B<proc>(5). В ядрах до 2.6 этот флаг действовал только для частных доступных на запись отображений.

source: B<MAP_POPULATE> (since Linux 2.5.46)
ru: B<MAP_POPULATE> (начиная с Linux 2.5.46)

source: Populate (prefault) page tables for a mapping. For a file mapping, this causes read-ahead on the file. This will help to reduce blocking on page faults later. B<MAP_POPULATE> is supported for private mappings only since Linux 2.6.23.
ru: Наполнить (до возникновения страничного прерывания, prefault) страничные таблицы отображения. Для файлового отображения это приводит к опережающему чтению из файла. В дальнейшем это помогает сократить блокировку по отказу страниц. Флаг B<MAP_POPULATE> поддерживается для закрытых отображений только начиная с Linux 2.6.23.

source: B<MAP_STACK> (since Linux 2.6.27)
ru: B<MAP_STACK> (начиная с Linux 2.6.27)

source: Allocate the mapping at an address suitable for a process or thread stack. This flag is currently a no-op, but is used in the glibc threading implementation so that if some architectures require special treatment for stack allocations, support can later be transparently implemented for glibc.
ru: Разместить отображение по адресу, пригодному для процесса или для стека нити. В настоящее время для этого флага не выполняются какие-либо действия, но он используется для реализации нитей в glibc; если на какой-то архитектуре потребуются специальные действия по выделению стека, то позже их поддержка может быть прозрачно добавлена в glibc.

source: B<MAP_SYNC> (since Linux 4.15)
ru: B<MAP_SYNC> (начиная с Linux 4.15)

source: This flag is available only with the B<MAP_SHARED_VALIDATE> mapping type; mappings of type B<MAP_SHARED> will silently ignore this flag. This flag is supported only for files supporting DAX (direct mapping of persistent memory). For other files, creating a mapping with this flag results in an B<EOPNOTSUPP> error.
ru: Данный флаг доступен только с типом отображения B<MAP_SHARED_VALIDATE>; отображения с типом B<MAP_SHARED> будут просто игнорировать этот флаг. Этот флаг поддерживается только для файлов поддерживаемых DAX (прямое отображение в постоянную память). Для остальных файлов, создание отображения с этим флагом приводит к возврату ошибки B<EOPNOTSUPP>.

source: Shared file mappings with this flag provide the guarantee that while some memory is writably mapped in the address space of the process, it will be visible in the same file at the same offset even after the system crashes or is rebooted. In conjunction with the use of appropriate CPU instructions, this provides users of such mappings with a more efficient way of making data modifications persistent.
ru: Общие файловые отображения с этим флагом представляют гарантию того, что пока есть часть памяти отображённая для записи в адресном пространстве процесса, она будет видима в том же файле по тому же смещению даже после падения или перезагрузки системы. Вместе с использованием соответствующих инструкций ЦП это позволяет пользователям таких отображений эффективней выполнять устойчивые изменения данных.

source: B<MAP_UNINITIALIZED> (since Linux 2.6.33)
ru: B<MAP_UNINITIALIZED> (начиная с Linux 2.6.33)

source: Don't clear anonymous pages. This flag is intended to improve performance on embedded devices. This flag is honored only if the kernel was configured with the B<CONFIG_MMAP_ALLOW_UNINITIALIZED> option. Because of the security implications, that option is normally enabled only on embedded devices (i.e., devices where one has complete control of the contents of user memory).
ru: Не очищать анонимные страницы. Этот флаг предназначен для повышения производительности на встраиваемых устройствах. Он учитывается, только если ядро было собрано с поддержкой параметра B<CONFIG_MMAP_ALLOW_UNINITIALIZED>. Так как этот параметр может привести к нарушению безопасности, обычно он устанавливается только на встраиваемых устройствах (то есть, устройствах, где только один человек имеет полный контроль над содержимым пользовательской памяти).

source: Of the above flags, only B<MAP_FIXED> is specified in POSIX.1-2001 and POSIX.1-2008. However, most systems also support B<MAP_ANONYMOUS> (or its synonym B<MAP_ANON>).
ru: Из флагов, перечисленных выше, в POSIX.1-2001 и POSIX.1-2008 определён только B<MAP_FIXED>. Однако, большинство систем также поддерживают B<MAP_ANONYMOUS> (или его синоним B<MAP_ANON>).

source: Memory mapped by B<mmap>() is preserved across B<fork>(2), with the same attributes.
ru: Память, отображённая с помощью B<mmap>(), сохраняется при B<fork>(2) с теми же атрибутами.

source: A file is mapped in multiples of the page size. For a file that is not a multiple of the page size, the remaining memory is zeroed when mapped, and writes to that region are not written out to the file. The effect of changing the size of the underlying file of a mapping on the pages that correspond to added or removed regions of the file is unspecified.
ru: Файл отображается по кратному размеру страницы. Для файла, который не кратен размеру страницы, оставшаяся память при отображении заполняется нулями, и запись в эту область не приводит к изменению файла. Действия при изменении размера отображаемого файла на страницы, которые соответствуют добавленным или удалённым областям файла, не определены.

source: The B<munmap>() system call deletes the mappings for the specified address range, and causes further references to addresses within the range to generate invalid memory references. The region is also automatically unmapped when the process is terminated. On the other hand, closing the file descriptor does not unmap the region.
ru: Системный вызов B<munmap>() удаляет отображение для указанного адресного диапазона и это приводит к тому, что дальнейшее обращение по адресам внутри диапазона приводит к генерации неправильных ссылок на память. Также для диапазона отображение автоматически удаляется при завершении работы процесса. С другой стороны, закрытие файлового дескриптора не приводит к удалению отображения диапазона.

source: The address I<addr> must be a multiple of the page size (but I<length> need not be). All pages containing a part of the indicated range are unmapped, and subsequent references to these pages will generate B<SIGSEGV>. It is not an error if the indicated range does not contain any mapped pages.
ru: Адрес I<addr> должен быть кратен размеру страницы (но значения I<length> это не касается). Все страницы, содержащие часть указанного диапазона, удаляются из отображения и последующие ссылки на эти страницы приводят к генерации сигнала B<SIGSEGV>. Это не ошибка, если указанный диапазон не содержит каких-либо отображённых страниц.

source: On success, B<mmap>() returns a pointer to the mapped area. On error, the value B<MAP_FAILED> (that is, I<(void\ *)\ -1>) is returned, and I<errno> is set to indicate the cause of the error.
ru: При успешном выполнении B<mmap>() возвращается указатель на отображённую область. При ошибке возвращается значение B<MAP_FAILED> (а именно, I<(void\ *)\ -1>) и I<errno> устанавливается в соответствующее значение.

source: On success, B<munmap>() returns 0. On failure, it returns -1, and I<errno> is set to indicate the cause of the error (probably to B<EINVAL>).
ru: При успешном выполнении B<munmap>() возвращает 0. При сбои возвращается -1, и код ошибки кладётся в I<errno> (скорее всего B<EINVAL>).

source: A file descriptor refers to a non-regular file. Or a file mapping was requested, but I<fd> is not open for reading. Or B<MAP_SHARED> was requested and B<PROT_WRITE> is set, but I<fd> is not open in read/write (B<O_RDWR>) mode. Or B<PROT_WRITE> is set, but the file is append-only.
ru: Файловый дескриптор указывает на не обычный файл. Или было запрошено отображение файла (mapping), но I<fd> не открыт на чтение. Или был указан флаг B<MAP_SHARED> и установлен бит B<PROT_WRITE>, но I<fd> не открыт в режиме чтения/записи (B<O_RDWR>). Или был указан флаг B<PROT_WRITE>, но файл доступен только для дополнения.

source: The file has been locked, or too much memory has been locked (see B<setrlimit>(2)).
ru: Файл заблокирован, или блокируется слишком много памяти (смотрите B<setrlimit>(2)).

source: I<fd> is not a valid file descriptor (and B<MAP_ANONYMOUS> was not set).
ru: Значение I<fd> не является правильным файловым дескриптором (и B<MAP_ANONYMOUS> не установлен).

source: B<MAP_FIXED_NOREPLACE> was specified in I<flags>, and the range covered by I<addr> and I<length> clashes with an existing mapping.
ru: В I<flags> указан B<MAP_FIXED_NOREPLACE> и диапазон, покрываемый I<addr> и I<length>, пересекается с существующим отображением.

source: We don't like I<addr>, I<length>, or I<offset> (e.g., they are too large, or not aligned on a page boundary).
ru: Неправильное значение I<addr>, I<length> или I<offset> (например, оно либо слишком велико, либо не выровнено по границе страницы).

source: (since Linux 2.6.12) I<length> was 0.
ru: (начиная с Linux 2.6.12) Значение I<length> равно 0.

source: I<flags> contained neither B<MAP_PRIVATE> or B<MAP_SHARED>, or contained both of these values.
ru: Значение I<flags> не содержит B<MAP_PRIVATE> или B<MAP_SHARED>, или содержит сразу эта эти флага.

source: The system-wide limit on the total number of open files has been reached.
ru: Достигнуто максимальное количество открытых файлов в системе.

source: The underlying filesystem of the specified file does not support memory mapping.
ru: Используемая файловая система для указанного файла не поддерживает отображение памяти.

source: No memory is available.
ru: Больше нет доступной памяти.

source: The process's maximum number of mappings would have been exceeded. This error can also occur for B<munmap>(), when unmapping a region in the middle of an existing mapping, since this results in two smaller mappings on either side of the region being unmapped.
ru: Процесс превысил бы ограничение на максимальное количество отображений. Эта ошибка также может возникнуть в B<munmap>() при удалении отображения области в середине существующего отображения, так как при этом выполняется удаление отображения двух отображений меньшего размера на любом конце области.

source: (since Linux 4.7) The process's B<RLIMIT_DATA> limit, described in B<getrlimit>(2), would have been exceeded.
ru: (начиная с Linux 4.7) Было бы превышено ограничение процесса B<RLIMIT_DATA>, описанное в B<getrlimit>(2).

source: On 32-bit architecture together with the large file extension (i.e., using 64-bit I<off_t>): the number of pages used for I<length> plus number of pages used for I<offset> would overflow I<unsigned long> (32 bits).
ru: На 32-битной архитектуре вместе с расширением для больших файлов (т.е., используется 64-битный I<off_t>): количество страниц, используемых для I<length> плюс количество страниц, используемых для I<offset> приводит к переполнению I<unsigned long> (32 бита).

source: The I<prot> argument asks for B<PROT_EXEC> but the mapped area belongs to a file on a filesystem that was mounted no-exec.
ru: Аргументом I<prot> запрашивается B<PROT_EXEC>, но отображённая область принадлежит файлу на файловой системе, которая смонтирована с флагом no-exec.

source: The operation was prevented by a file seal; see B<fcntl>(2).
ru: Выполнение операции предотвращено опечатыванием (file seal); смотрите B<fcntl>(2).

source: B<MAP_DENYWRITE> was set but the object specified by I<fd> is open for writing.
ru: Был задан флаг B<MAP_DENYWRITE>, но объект, указываемый I<fd>, открыт на запись.
