Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: The buffer was not large enough to hold the path of the directory entry.
ru: Буфер не был достаточно велик для хранения пути элемента каталога.

source: Available since Linux 2.5.43. The B<ENAMETOOLONG> error return was added in 2.5.70.
ru: Доступен, начиная с Linux 2.5.43. В версии 2.5.70 добавлено возвращение ошибки B<ENAMETOOLONG>.

source: B<lookup_dcookie>() is Linux-specific.
ru: Вызов B<lookup_dcookie>() есть только в Linux.

source: B<lookup_dcookie>() is a special-purpose system call, currently used only by the B<oprofile>(1) profiler. It relies on a kernel driver to register cookies for directory entries.
ru: Вызов B<lookup_dcookie>() является специальным системным вызовом, в данный момент используется только программой профилирования B<oprofile>(1). Она полагается на регистрацию драйвером ядра маркёра для элементов каталога.

source: The path returned may be suffixed by the string " (deleted)" if the directory entry has been removed.
ru: Возвращаемый путь может заканчиваться строкой « (deleted)», если элемент каталога был удалён.

source: locale - describes a locale definition file
ru: locale - описание файла определения локали

source: The B<locale> definition file contains all the information that the B<localedef>(1) command needs to convert it into the binary locale database.
ru: Файл определения B<локали> содержит в себе всю информацию, которая нужна команде B<localedef>(1) для преобразования её в двоичную базу данных локалей.

source: The definition files consist of sections which each describe a locale category in detail. See B<locale>(7) for additional details for these categories.
ru: Файлы определения состоят из разделов, каждый из которых подробно описывает некоторую категорию локали. Дополнительную информацию об этих категориях смотрите в B<locale>(7).

source: Syntax
ru: Синтаксис

source: The locale definition file starts with a header that may consist of the following keywords:
ru: Файл определения локали начинается с заголовка, который может состоять из следующих ключевых слов:

source: is followed by a character that should be used as the escape-character for the rest of the file to mark characters that should be interpreted in a special way. It defaults to the backslash (\e).
ru: за которым указывается символ, использующийся в оставшихся строках файла как символ экранирования для пометки символов, которые должны обрабатываться особым образом. По умолчанию это символ обратной косой черты (\e).

source: is followed by a character that will be used as the comment-character for the rest of the file. It defaults to the number sign (#).
ru: за которым указывается символ, использующийся в оставшихся строках файла как символ комментария. По умолчанию это символ решётки (#).

source: The locale definition has one part for each locale category. Each part can be copied from another existing locale or can be defined from scratch. If the category should be copied, the only valid keyword in the definition is I<copy> followed by the name of the locale in double quotes which should be copied. The exceptions for this rule are B<LC_COLLATE> and B<LC_CTYPE> where a I<copy> statement can be followed by locale-specific rules and selected overrides.
ru: Определение локали поделено на отдельные части — для каждой категории своя. Каждую часть можно скопировать из другой существующей локали или создать с нуля. Если категорию нужно скопировать, то в определении должно находиться единственное ключевое слово I<copy> и имя локали в двойных кавычках, из которого копируется категория. Исключением из этого правила являются B<LC_COLLATE> и B<LC_CTYPE>, когда в описании I<copy> могут перечисляться правила для локали и выбранные замены.

source: When defining a locale or a category from scratch, an existing system- provided locale definition file should be used as a reference to follow common glibc conventions.
ru: При создании локали или категории с нуля за основу нужно взять из системы существующее определение локали, так как оно следует общим соглашениям glibc.

source: Locale category sections
ru: Разделы категорий локали

source: The following category sections are defined by POSIX:
ru: Следующие разделы категорий определены в POSIX:

source: In addition, since version 2.2, the GNU C library supports the following nonstandard categories:
ru: Также, начиная с версии 2.2, библиотека GNU C поддерживает следующие нестандартные категории:

source: See B<locale>(7) for a more detailed description of each category.
ru: Более подробное описание каждой категории смотрите в B<locale>(7).

source: The definition starts with the string I<LC_ADDRESS> in the first column.
ru: Определение начинается со строки B<LC_ADDRESS> в первой колонке.

source: The following keywords are allowed:
ru: Допустимы следующие ключевые слова:

source: followed by a string containing field descriptors that define the format used for postal addresses in the locale. The following field descriptors are recognized:
ru: за которым указывается строка описателей поля, задающая формат почтовых адресов, используемый в локали. Доступны следующие описатели поля:

source: Person's name, possibly constructed with the B<LC_NAME> I<name_fmt> keyword (since glibc 2.24).
ru: Имя человека, возможно собранное с использованием ключевого слова B<LC_NAME> I<name_fmt> (начиная с glibc 2.24).

source: Care of person, or organization.
ru: Относится к человеку или организации.

source: Firm name.
ru: Фирменное название.

source: Department name.
ru: Название отдела.

source: Building name.
ru: Обозначение здания.

source: Street or block (e.g., Japanese) name.
ru: Название улицы или блока (в Японии).

source: House number or designation.
ru: Номер дома или назначения.

source: Insert an end-of-line if the previous descriptor's value was not an empty string; otherwise ignore.
ru: Вставить конец строки, если предыдущее значение описателя было не пустой строкой; в противном случае игнорируется.

source: Insert a space if the previous descriptor's value was not an empty string; otherwise ignore.
ru: Вставить пробел, если предыдущее значение описателя было не пустой строкой; в противном случае игнорируется.

source: Room number, door designation.
ru: Номер квартиры, комнаты.

source: Floor number.
ru: Номер этажа.

source: Country designation, from the I<country_post> keyword.
ru: Страна назначения, берётся из ключевого слова I<country_post>.

source: Local township within town or city (since glibc 2.24).
ru: Часть территории внутри посёлка или города (начиная с glibc 2.24).

source: Zip number, postal code.
ru: Индекс, почтовый код.

source: Town, city.
ru: Город, посёлок.

source: State, province, or prefecture.
ru: Область, штат или префектура.

source: Country, as taken from data record.
ru: Страна, как указана в данных записи.

source: Each field descriptor may have an \(aqR\(aq after the \(aq%\(aq to specify that the information is taken from a Romanized version string of the entity.
ru: Каждый описатель поля может содержать «R» после «%» для указания того, что информация берётся из версии строки на латинице.

source: followed by the country name in the language of the current document (e.g., "Deutschland" for the B<de_DE> locale).
ru: за которым указывается название страны на языке текущего документа (например, «Deutschland» для локали B<de_DE>).

source: followed by the abbreviation of the country (see CERT_MAILCODES).
ru: за которым указывается аббревиатура страны (смотрите CERT_MAILCODES).

source: followed by the two-letter abbreviation of the country (ISO 3166).
ru: за которым указывается двухсимвольная аббревиатура страны (ISO 3166).

source: followed by the three-letter abbreviation of the country (ISO 3166).
ru: за которым указывается трёхсимвольная аббревиатура страны (ISO 3166).

source: followed by the numeric country code (ISO 3166).
ru: за которым указывается числовой код страны (ISO 3166).

source: followed by the international licence plate country code.
ru: за которым указывается код страны в международном номерном знаке.

source: followed by the ISBN code (for books).
ru: за которым указывается код ISBN (для книг).

source: followed by the language name in the language of the current document.
ru: за которым указывается название языка на языке текущего документа.

source: followed by the two-letter abbreviation of the language (ISO 639).
ru: за которым указывается двухсимвольная аббревиатура языка (ISO 639).

source: followed by the three-letter abbreviation of the language (ISO 639-2/T).
ru: за которым указывается трёхсимвольная аббревиатура языка (ISO 639-2/T).

source: followed by the three-letter abbreviation of the language for library use (ISO 639-2/B). Applications should in general prefer I<lang_term> over I<lang_lib>.
ru: за которым указывается трёхсимвольная аббревиатура языка, используемая в библиотеках (ISO 639-2/B). Обычно, приложениям нужно использовать I<lang_term> вместо I<lang_lib>.

source: The B<LC_ADDRESS> definition ends with the string I<END LC_ADDRESS>.
ru: Определение категории B<LC_ADDRESS> заканчивается строкой I<END LC_ADDRESS>.

source: The definition starts with the string I<LC_CTYPE> in the first column.
ru: Определение начинается со строки B<LC_CTYPE> в первой колонке.

source: followed by a list of uppercase letters. The letters B<A> through B<Z> are included automatically. Characters also specified as B<cntrl>, B<digit>, B<punct>, or B<space> are not allowed.
ru: за которым указывается список символов в верхнем регистре. Символы от B<A> до B<Z> добавляются автоматически. Символы, указанные для B<cntrl>, B<digit>, B<punct> или B<space>, не допускаются.

source: followed by a list of lowercase letters. The letters B<a> through B<z> are included automatically. Characters also specified as B<cntrl>, B<digit>, B<punct>, or B<space> are not allowed.
ru: за которым указывается список символов в нижнем регистре. Символы от B<a> до B<z> добавляются автоматически. Символы, указанные для B<cntrl>, B<digit>, B<punct> или B<space>, не допускаются.

source: followed by a list of letters. All character specified as either B<upper> or B<lower> are automatically included. Characters also specified as B<cntrl>, B<digit>, B<punct>, or B<space> are not allowed.
ru: за которым указывается список букв. Символы, указанные для B<upper> или B<lower>, добавляются автоматически. Символы, указанные для B<cntrl>, B<digit>, B<punct> или B<space>, не допускаются.

source: followed by the characters classified as numeric digits. Only the digits B<0> through B<9> are allowed. They are included by default in this class.
ru: за которым указывается список символов, которые считаются цифрами. Разрешается использовать в списке только цифры от B<0> до B<9>. По умолчанию они добавляются автоматически.

source: followed by a list of characters defined as white-space characters. Characters also specified as B<upper>, B<lower>, B<alpha>, B<digit>, B<graph>, or B<xdigit> are not allowed. The characters B<E<lt>spaceE<gt>>, B<E<lt>form-feedE<gt>>, B<E<lt>newlineE<gt>>, B<E<lt>carriage-returnE<gt>>, B<E<lt>tabE<gt>>, and B<E<lt>vertical-tabE<gt>> are automatically included.
ru: за которым указывается список символов, которые считаются пробельными символами. Символы, указанные для B<upper>, B<lower>, B<alpha>, B<digit>, B<graph> или B<xdigit>, не допускаются. Символы B<E<lt>spaceE<gt>>, B<E<lt>form-feedE<gt>>, B<E<lt>newlineE<gt>>, B<E<lt>carriage-returnE<gt>>, B<E<lt>tabE<gt>> и B<E<lt>vertical-tabE<gt>> добавляются автоматически.

source: followed by a list of control characters. Characters also specified as B<upper>, B<lower>, B<alpha>, B<digit>, B<punct>, B<graph>, B<print>, or B<xdigit> are not allowed.
ru: за которым указывается список управляющих символов. Символы, указанные для B<upper>, B<lower>, B<alpha>, B<digit>, B<punct>, B<graph>, B<print> или B<xdigit>, не допускаются.

source: followed by a list of punctuation characters. Characters also specified as B<upper>, B<lower>, B<alpha>, B<digit>, B<cntrl>, B<xdigit>, or the B<E<lt>spaceE<gt>> character are not allowed.
ru: за которым указывается список символов пунктуации. Символы, указанные для B<upper>, B<lower>, B<alpha>, B<digit>, B<cntrl>, B<xdigit> или B<E<lt>spaceE<gt>>, не допускаются.

source: followed by a list of printable characters, not including the B<E<lt>spaceE<gt>> character. The characters defined as B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit>, and B<punct> are automatically included. Characters also specified as B<cntrl> are not allowed.
ru: за которым указывается список печатных (видимых) символов, не считая символа B<E<lt>spaceE<gt>>. Автоматически включаются символы из B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit> и B<punct>. Символы, указанные в B<cntrl>, не допускаются.

source: followed by a list of printable characters, including the B<E<lt>spaceE<gt>> character. The characters defined as B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit>, B<punct>, and the B<E<lt>spaceE<gt>> character are automatically included. Characters also specified as B<cntrl> are not allowed.
ru: за которым указывается список печатных (видимых) символов, включая символ B<E<lt>spaceE<gt>>. Автоматически включаются символы из B<upper>, B<lower>, B<alpha>, B<digit>, B<xdigit>, B<punct> и B<E<lt>spaceE<gt>>. Символы, указанные в B<cntrl>, не допускаются.

source: followed by a list of characters classified as hexadecimal digits. The decimal digits must be included followed by one or more set of six characters in ascending order. The following characters are included by default: B<0> through B<9>, B<a> through B<f>, B<A> through B<F>.
ru: за которым указывается список символов, относящихся к шестнадцатеричным цифрам. Должны быть указаны десятичные цифры, а также один или несколько наборов из шести символов в возрастающем порядке. По умолчанию включены: от B<0> до B<9>, от B<a> до B<f>, от B<A> до B<F>.

source: followed by a list of characters classified as B<blank>. The characters B<E<lt>spaceE<gt>> and B<E<lt>tabE<gt>> are automatically included.
ru: за которым указывается список символов, классифицированных как B<blank>. Автоматически включены символы B<E<lt>spaceE<gt>> и B<E<lt>tabE<gt>>.

source: followed by a list of locale-specific character class names which are then to be defined in the locale.
ru: за которым указывается список определённых в локали имён классов символов, которые будут определены в локали позднее.

source: followed by a list of mappings from lowercase to uppercase letters. Each mapping is a pair of a lowercase and an uppercase letter separated with a B<,> and enclosed in parentheses.
ru: за которым указывается список преобразований символов нижнего регистра в символы верхнего. Каждое преобразование — это пара символов в нижнем и верхнем регистре, разделённых знаком B<,> и заключённых в круглые скобки.

source: followed by a list of mappings from uppercase to lowercase letters. If the keyword tolower is not present, the reverse of the toupper list is used.
ru: за которым указывается список преобразований символов верхнего регистра в символы нижнего. Если ключевое слово tolower не задано, то по умолчанию используется список, противоположный списку toupper.

source: followed by a list of mapping pairs of characters and letters to be used in titles (headings).
ru: за которым указывается список преобразований пар символов и букв, используемых в заголовках.

source: followed by a locale-specific character class definition, starting with the class name followed by the characters belonging to the class.
ru: за которым указывается определение класса символов определённой локали, сначала имя класса, затем идут символы, принадлежащие классу.

source: followed by a list of locale-specific character mapping names which are then to be defined in the locale.
ru: за которым указывается список определённых в локали имён преобразований символов, которые будут определены в локали позднее.

source: followed by a list of alternate output digits for the locale.
ru: за которым указывается список альтернативных выводимых цифр для локали.

source: followed by a list of mapping pairs of alternate digits and separators for input digits for the locale.
ru: за которым указывается список преобразований пар альтернативных цифр и разделителей вводимых цифр для локали.

source: followed by a list of mapping pairs of alternate separators for output for the locale.
ru: за которым указывается список преобразований пар альтернативных разделителей вывода для локали.

source: marks the start of the transliteration rules section. The section can contain the I<include> keyword in the beginning followed by locale-specific rules and overrides. Any rule specified in the locale file will override any rule copied or included from other files. In case of duplicate rule definitions in the locale file, only the first rule is used.
ru: отмечает начало раздела правил транслитерации. В начале раздела может содержаться ключевое слово I<include>, за которым указываются правила и замены для определённой локали. Любое правило, указанное в локали, заменит любое правило, скопированное или включённое из других файлов. В случае повтора определения правила в файле локали, используется только первое правило.

source: A transliteration rule consist of a character to be transliterated followed by a list of transliteration targets separated by semicolons. The first target which can be presented in the target character set is used, if none of them can be used the I<default_missing> character will be used instead.
ru: Правило транслитерации состоит из символа, который будет транслитерироваться, и списка целей транслитерации через точку с запятой. Используется первая цель, из набора символов которой может быть представлен указанный символ. Если представить нечем, то будет использоваться символ I<default_missing>.

source: in the transliteration rules section includes a transliteration rule file (and optionally a repertoire map file).
ru: в разделе правил транслитерации включает файл правил транслитерации (и необязательный файл_набора отображения).

source: in the transliteration rules section defines the default character to be used for transliteration where none of the targets cannot be presented in the target character set.
ru: в разделе правил транслитерации определяет символ по умолчанию, который будет использован для транслитерации, если ни одна из целей не может быть представлена набором символов цели.

source: marks the end of the transliteration rules.
ru: помечает конец правил транслитерации.

source: The B<LC_CTYPE> definition ends with the string I<END LC_CTYPE>.
ru: Определение категории B<LC_CTYPE> заканчивается строкой I<END LC_CTYPE>.

source: Note that glibc does not support all POSIX-defined options, only the options described below are supported (as of glibc 2.23).
ru: Заметим, что в glibc не поддерживаются все параметры, определённые в POSIX; список поддерживаемых параметров приведён ниже (для glibc 2.23).

source: The definition starts with the string I<LC_COLLATE> in the first column.
ru: Определение начинается со строки B<LC_COLLATE> в первой колонке.

source: followed by the number representing used collation levels. This keyword is recognized but ignored by glibc.
ru: за которым указывается число, представляющее уровни сортировки. Это ключевое слово воспринимается glibc, но игнорируется.

source: followed by the definition of a collating-element symbol representing a multicharacter collating element.
ru: за которым указывается определение символа элемента-сортировки, представляющего многосимвольный элемент сортировки.

source: followed by the definition of a collating symbol that can be used in collation order statements.
ru: за которым указывается определение символа сортировки, который можно использовать в определениях порядка сортировки.

source: followed by B<string> to be evaluated in an I<ifdef> B<string> / I<else> / I<endif> construct.
ru: за которым указывается B<строка>, которая будет вычислена в конструкции I<ifdef> B<строка> / I<else> / I<endif>.

source: followed by a redefinition of a collation rule.
ru: за которым следует повторное определение правила сортировки.

source: marks the end of the redefinition of a collation rule.
ru: помечает конец повторного определения правила сортировки.

source: followed by a script name to reorder listed scripts after.
ru: за которым следует имя сценария для переупорядочивания сценариев, перечисляемых после.

source: marks the end of the reordering of sections.
ru: помечает конец разделов переупорядочивания.

source: followed by a declaration of a script.
ru: за которым следует объявление сценария.

source: followed by a collating-symbol to be equivalent to another defined collating-symbol.
ru: за которым следует символ-сортировки, который будет эквивалентен другому определённому символу-сортировки.

source: The collation rule definition starts with a line:
ru: Определение правила сортировки начинается со строки:

source: followed by a list of keywords chosen from B<forward>, B<backward>, or B<position>. The order definition consists of lines that describe the collation order and is terminated with the keyword I<order_end>.
ru: за которой указывается список ключевых слов из B<forward>, B<backward> или B<position>. Определение сортировки состоит из строк, описывающих порядок сортировки, и заканчивается ключевым словом I<order_end>.

source: The B<LC_COLLATE> definition ends with the string I<END LC_COLLATE>.
ru: Определение категории B<LC_COLLATE> заканчивается строкой I<END LC_COLLATE>.

source: The definition starts with the string I<LC_IDENTIFICATION> in the first column.
ru: Определение начинается со строки B<LC_IDENTIFICATION> в первой колонке.

source: followed by the title of the locale document (e.g., "Maori language locale for New Zealand").
ru: за которым указывается название документа локали (например, «Maori language locale for New Zealand»).

source: followed by the name of the organization that maintains this document.
ru: за которым указывается название организации, которая сопровождает этот документ.

source: followed by the address of the organization that maintains this document.
ru: за которым указывается адрес организации, которая сопровождает этот документ.

source: followed by the name of the contact person at the organization that maintains this document.
ru: за которым указывается контактное лицо от организации, которое сопровождает этот документ.

source: followed by the email address of the person or organization that maintains this document.
ru: за которым указывается адрес электронной почты лица или организации, которое сопровождает этот документ.

source: followed by the telephone number (in international format) of the organization that maintains this document. As of glibc 2.24, this keyword is deprecated in favor of other contact methods.
ru: за которым указывается номер телефона (в международном формате) организации, которая сопровождает этот документ. В glibc 2.24 это ключевое слово устарело и заменено другими методами описания контактов.

source: followed by the fax number (in international format) of the organization that maintains this document. As of glibc 2.24, this keyword is deprecated in favor of other contact methods.
ru: за которым указывается номер факса (в международном формате) организации, которая сопровождает этот документ. В glibc 2.24 это ключевое слово устарело и заменено другими методами описания контактов.

source: followed by the name of the language to which this document applies.
ru: за которым указывается название языка, к которому применим этот документ.

source: followed by the name of the country/geographic extent to which this document applies.
ru: за которым указывается название страны/географической области, к которой применим этот документ.
