Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: followed by the format of the time in alternative era notation, corresponding to the I<%EX> descriptor (see B<strptime>(3)).
ru: за которым указывается формат времени в альтернативном формате эпохи, соответствует описателю I<%EX> (смотрите B<strptime>(3)).

source: followed by the format of the date and time in alternative era notation, corresponding to the I<%Ec> descriptor (see B<strptime>(3)).
ru: за которым указывается формат даты и времени в альтернативном формате эпохи, соответствует описателю I<%Ec> (смотрите B<strptime>(3)).

source: followed by the alternative digits used for date and time in the locale.
ru: за которым указываются альтернативные цифры, используемые для даты и времени в локали.

source: followed by a list of three values separated by semicolons: The number of days in a week (by default 7), a date of beginning of the week (by default corresponds to Sunday), and the minimal length of the first week in year (by default 4). Regarding the start of the week, B<19971130> shall be used for Sunday and B<19971201> shall be used for Monday. See NOTES.
ru: за которым указывается список из трёх значений, разделённых точкой с запятой: количество дней в неделе (по умолчанию 7), день начала недели (по умолчанию воскресенье) и минимальная длина первой недели в году (по умолчанию 4). Независимо от начала недели, B<19971130> считается воскресеньем и B<19971201> считается понедельником. Смотрите ЗАМЕЧАНИЯ.

source: I<first_weekday> (since glibc 2.2)
ru: I<first_weekday> (начиная с glibc 2.2)

source: followed by the number of the first day from the I<day> list to be shown in calendar applications. The default value of B<1> corresponds to either Sunday or Monday depending on the value of the second I<week> list item. See NOTES.
ru: за которым указывается номер первого дня из списка I<day>, который будет показан в приложениях-календарях. Значение по умолчанию B<1> соответствует или воскресенью или понедельнику, в зависимости от значения второго элемента в списке I<week>. Смотрите ЗАМЕЧАНИЯ.

source: I<first_workday> (since glibc 2.2)
ru: I<first_workday> (начиная с glibc 2.2)

source: followed by the number of the first working day from the I<day> list. The default value is B<2>. See NOTES.
ru: за которым указывается номер первого рабочего дня из списка I<day> Значение по умолчанию равно B<2>.Смотрите ЗАМЕЧАНИЯ.

source: followed by a number value that indicates the direction for the display of calendar dates, as follows:
ru: за которым указывается числовое значение, задающее направление показа календарных дат:

source: Left-right from top.
ru: Слева направо, сверху.

source: Top-down from left.
ru: Сверху вниз, слева.

source: Right-left from top.
ru: Справа налево, сверху.

source: followed by the appropriate date representation for B<date>(1) (for syntax, see B<strftime>(3)).
ru: за которым указывается представление соответствующей даты для B<date>(1) (синтаксис описан в B<strftime>(3)).

source: The B<LC_TIME> definition ends with the string I<END LC_TIME>.
ru: Определение категории B<LC_TIME> заканчивается строкой I<END LC_TIME>.

source: The collective GNU C library community wisdom regarding I<abday>, I<day>, I<week>, I<first_weekday>, and I<first_workday> states at https://sourceware.org/glibc/wiki/Locales the following:
ru: Коллективная мудрость сообщества библиотеки GNU C про I<abday>, I<day>, I<week>, I<first_weekday> и I<first_workday> пишет в https://sourceware.org/glibc/wiki/Locales следующее:

source: The value of the second I<week> list item specifies the base of the I<abday> and I<day> lists.
ru: Значение второго элемента в списке I<week> задаёт начало списков I<abday> и I<day>.

source: I<first_weekday> specifies the offset of the first day-of-week in the I<abday> and I<day> lists.
ru: В I<first_weekday> задаётся смещение первого дня недели в списках I<abday> и I<day>.

source: For compatibility reasons, all glibc locales should set the value of the second I<week> list item to B<19971130> (Sunday) and base the I<abday> and I<day> lists appropriately, and set I<first_weekday> and I<first_workday> to B<1> or B<2>, depending on whether the week and work week actually starts on Sunday or Monday for the locale.
ru: Для совместимости, все локали glibc должны содержать значение второго элемента в списке I<week> равное B<19971130> (воскресенье), а также в базовых списках I<abday> и I<day>, соответственно, и установить значение I<first_weekday> и I<first_workday> равное B<1> или B<2>, в зависимости от реального начала и рабочего дня недели в локали — воскресенья или понедельника.

source: lrint, lrintf, lrintl, llrint, llrintf, llrintl - round to nearest integer
ru: lrint, lrintf, lrintl, llrint, llrintf, llrintl - округление до ближайшего целого

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: All functions shown above:
ru: Все функции, показанные выше:

source: These functions round their argument to the nearest integer value, using the current rounding direction (see B<fesetround>(3)).
ru: Данные функции округляют переданный аргумент до ближайшего целого значения в соответствии с текущим направлением округления (см. B<fesetround>(3)).

source: Note that unlike the B<rint>(3) family of functions, the return type of these functions differs from that of their arguments.
ru: Заметим, что в отличии от семейства функций B<rint>(3), тип возвращаемого значения этих функций отличается от типа их аргументов.

source: These functions return the rounded integer value.
ru: Данные функции возвращают округлённое целое число.

source: If I<x> is a NaN or an infinity, or the rounded value is too large to be stored in a I<long> (I<long long> in the case of the B<ll*> functions), then a domain error occurs, and the return value is unspecified.
ru: Если I<x> является NaN или равно бесконечности, либо округленное значение слишком велико для типа I<long> (I<long long> в случае функций B<ll*>), возникает ошибка области, а возвращаемое значение останется неуказанным.

source: See B<math_error>(7) for information on how to determine whether an error has occurred when calling these functions.
ru: Смотрите B<math_error>(7), чтобы определить, какие ошибки могут возникать при вызове этих функций.

source: The following errors can occur:
ru: Могут возникать следующие ошибки:

source: Domain error: I<x> is a NaN or infinite, or the rounded value is too large
ru: Ошибка области: I<x> является NaN или равно бесконечности, либо округленное значение слишком велико

source: An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: Возникает исключение неправильной плавающей запятой (B<FE_INVALID>).

source: These functions do not set I<errno>.
ru: Эти функции не изменяют I<errno>.

source: These functions first appeared in glibc in version 2.1.
ru: Эти функции впервые появились в glibc 2.1.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: log10, log10f, log10l - base-10 logarithmic function
ru: log10, log10f, log10l - функция вычисления десятичного логарифма

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions return the base 10 logarithm of I<x>.
ru: Данные функции возвращают значение десятичного логарифма от I<x>.

source: On success, these functions return the base 10 logarithm of I<x>.
ru: При успешном выполнении данные функции возвращают значение десятичного логарифма от I<x>.

source: For special cases, including where I<x> is 0, 1, negative, infinity, or NaN, see B<log>(3).
ru: Для особых случаев, когда I<x> равно 0, 1, отрицательно, стремится к бесконечности или NaN, смотрите B<log>(3).

source: For a discussion of the errors that can occur for these functions, see B<log>(3).
ru: Обсуждение ошибок, которые могут возникнуть при вызове данных функций, смотрите B<log>(3).

source: The variant returning I<double> also conforms to SVr4, 4.3BSD, C89.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD, C89.

source: ldexp, ldexpf, ldexpl - multiply floating-point number by integral power of 2
ru: ldexp, ldexpf, ldexpl - умножает число с плавающей запятой на 2 в степени целого числа

source: These functions return the result of multiplying the floating-point number I<x> by 2 raised to the power I<exp>.
ru: Эти функции возвращают результат умножения числа с плавающей запятой I<x> на 2 в степени I<exp>.

source: On success, these functions return I<x * (2^exp)>.
ru: При успешном выполнении данные функции возвращают I<x * (2^exp)>.

source: If I<exp> is zero, then I<x> is returned.
ru: Если I<exp> равно 0, то будет возвращено I<x>.

source: If I<x> is a NaN, a NaN is returned.
ru: Если I<x> равно NaN, будет возвращено NaN.

source: If I<x> is positive infinity (negative infinity), positive infinity (negative infinity) is returned.
ru: Если I<x> стремится к плюс или минус бесконечности, будет возвращена плюс или минус бесконечность.

source: If the result underflows, a range error occurs, and zero is returned.
ru: Если в результате исчерпана степень числа, возникает ошибка диапазона и возвращается ноль.

source: If the result overflows, a range error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively, with a sign the same as I<x>.
ru: Если в результате превышена разрядность, то возникает ошибка диапазона и функции возвращают B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, соответственно, с тем же знаком что и I<x>.

source: Range error, overflow
ru: Ошибка диапазона, переполнение

source: I<errno> is set to B<ERANGE>. An overflow floating-point exception (B<FE_OVERFLOW>) is raised.
ru: Значение I<errno> устанавливается в B<ERANGE>. Возникает исключение переполнения плавающей запятой (B<FE_OVERFLOW>).

source: Range error, underflow
ru: Ошибка диапазона, исчерпана степень

source: I<errno> is set to B<ERANGE>. An underflow floating-point exception (B<FE_UNDERFLOW>) is raised.
ru: Значение I<errno> устанавливается в B<ERANGE>. Возникает исключение исчерпания степени числа с плавающей запятой (B<FE_UNDERFLOW>).

source: log2, log2f, log2l - base-2 logarithmic function
ru: log2, log2f, log2l - функция вычисления логарифма по основанию 2

source: These functions return the base 2 logarithm of I<x>.
ru: Данные функции возвращают значение логарифма по основанию 2 от числа I<x>.

source: On success, these functions return the base 2 logarithm of I<x>.
ru: При успешном выполнении данные функции возвращают значение логарифма по основанию 2 от числа I<x>.

source: The variant returning I<double> also conforms to SVr4, 4.3BSD.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD.

source: lgamma, lgammaf, lgammal, lgamma_r, lgammaf_r, lgammal_r, signgam - log gamma function
ru: lgamma, lgammaf, lgammal, lgamma_r, lgammaf_r, lgammal_r, signgam - логарифм гамма-функции

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* в версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: _XOPEN_SOURCE || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: For the definition of the Gamma function, see B<tgamma>(3).
ru: Определение гамма-функции смотрите в B<tgamma>(3).

source: The B<lgamma>(), B<lgammaf>(), and B<lgammal>() functions return the natural logarithm of the absolute value of the Gamma function. The sign of the Gamma function is returned in the external integer I<signgam> declared in I<E<lt>math.hE<gt>>. It is 1 when the Gamma function is positive or zero, -1 when it is negative.
ru: Функции B<lgamma>(), B<lgammaf>() и B<lgammal>() возвращают натуральный логарифм абсолютного значения гамма-функции. Знак гамма-функции возвращается во внешнем целом I<signgam>, объявленном в I<E<lt>math.hE<gt>>. Оно равно 1, если гамма-функция положительна или равна нулю, и -1, если она отрицательна.

source: Since using a constant location I<signgam> is not thread-safe, the functions B<lgamma_r>(), B<lgammaf_r>(), and B<lgammal_r>() have been introduced; they return the sign via the argument I<signp>.
ru: Так как использование постоянного расположения I<signgam> не является безопасным при работе с нитями, то была созданы функции B<lgamma_r>(), B<lgammaf_r>() и B<lgammal_r>(); они возвращают знак через аргумент I<signp>.

source: On success, these functions return the natural logarithm of Gamma(x).
ru: При успешном выполнении данные функции возвращают натуральный логарифм Gamma(x).

source: If I<x> is 1 or 2, +0 is returned.
ru: Если I<x> равен 1 или 2, то возвращается +0.

source: If I<x> is positive infinity or negative infinity, positive infinity is returned.
ru: Если I<x> равен плюс бесконечности или минус бесконечности, возвращается плюс бесконечность.

source: If I<x> is a nonpositive integer, a pole error occurs, and the functions return +B<HUGE_VAL>, +B<HUGE_VALF>, or +B<HUGE_VALL>, respectively.
ru: Если I<x> равно не положительному целому, генерируется ошибка особой точки, а функции возвращают +B<HUGE_VAL>, +B<HUGE_VALF> или +B<HUGE_VALL>, соответственно.

source: If the result overflows, a range error occurs, and the functions return B<HUGE_VAL>, B<HUGE_VALF>, or B<HUGE_VALL>, respectively, with the correct mathematical sign.
ru: Если происходит переполнение результата, возникает ошибка диапазона, а функция возвращает B<HUGE_VAL>, B<HUGE_VALF> или B<HUGE_VALL>, соответственно, с математически правильным знаком.

source: Pole error: I<x> is a nonpositive integer
ru: Ошибка особой точки: I<x> равно не положительному целому

source: I<errno> is set to B<ERANGE> (but see BUGS). A divide-by-zero floating-point exception (B<FE_DIVBYZERO>) is raised.
ru: Значение I<errno> устанавливается в B<ERANGE> (но смотрите ДЕФЕКТЫ). Возникает исключение деления плавающей запятой на ноль (B<FE_DIVBYZERO>).

source: Range error: result overflow
ru: Ошибка диапазона: результат превысил разрядность

source: The B<lgamma>() functions are specified in C99, POSIX.1-2001, and POSIX.1-2008. I<signgam> is specified in POSIX.1-2001 and POSIX.1-2008, but not in C99. The B<lgamma_r>() functions are nonstandard, but present on several other systems.
ru: Функции B<lgamma>() определены в C99, POSIX.1-2001 и POSIX.1-2008. Переменная I<signgam> определена в POSIX.1-2001 и POSIX.1-2008, но отсутствует в C99. Функции B<lgamma_r>() являются нестандартными, но существуют в нескольких других системах.

source: In glibc 2.9 and earlier, when a pole error occurs, I<errno> is set to B<EDOM>; instead of the POSIX-mandated B<ERANGE>. Since version 2.10, glibc does the right thing.
ru: В glibc 2.9 и ранее при возникновении ошибки особой точки, значению I<errno> присваивается B<EDOM> вместо B<ERANGE> согласно POSIX. Начиная с версии 2.10, в glibc это исправлено.

source: login, logout - write utmp and wtmp entries
ru: login, logout - добавление записей utmp и wtmp

source: Link with I<-lutil>.
ru: Компонуется при указании параметра I<-lutil>.

source: The utmp file records who is currently using the system. The wtmp file records all logins and logouts. See B<utmp>(5).
ru: В файл utmp записываются все, кто в данный момент пользуется системой. В файле wtmp записываются все входы и выходы пользователей. См B<utmp>(5).

source: The function B<login>() takes the supplied I<struct utmp>, I<ut>, and writes it to both the utmp and the wtmp file.
ru: Функция B<login>() принимает указанные I<struct utmp>, I<ut> и записывает их в файлы utmp и wtmp.

source: The function B<logout>() clears the entry in the utmp file again.
ru: Функция B<logout>() очищает запись в файле utmp.

source: GNU details
ru: Особенности GNU

source: More precisely, B<login>() takes the argument I<ut> struct, fills the field I<ut-E<gt>ut_type> (if there is such a field) with the value B<USER_PROCESS>, and fills the field I<ut-E<gt>ut_pid> (if there is such a field) with the process ID of the calling process. Then it tries to fill the field I<ut-E<gt>ut_line>. It takes the first of I<stdin>, I<stdout>, I<stderr> that is a terminal, and stores the corresponding pathname minus a possible leading I</dev/> into this field, and then writes the struct to the utmp file. On the other hand, if no terminal name was found, this field is filled with "???" and the struct is not written to the utmp file. After this, the struct is written to the wtmp file.
ru: Если быть точнее, функция B<login>() получает структуру I<ut> в качестве аргумента, заполняет поле I<ut-E<gt>ut_type> (если такое поле есть) значением B<USER_PROCESS> и поле I<ut-E<gt>ut_pid> (если такое поле есть) идентификатором вызывающего процесса (PID). После этого она пытается заполнить поле I<ut-E<gt>ut_line>. Функция берёт первый I<stdin>, I<stdout>, I<stderr>, являющийся терминалом, и сохраняет соответствующий путь (за исключением I</dev/> спереди) в это поле, после чего записывает структуру в файл utmp. В случае, если имя терминала не будет обнаружено, данное поле будет заполнено «???», а структура не будет записана в файл utmp. После этого структура будет записана в файл wtmp.

source: The B<logout>() function searches the utmp file for an entry matching the I<ut_line> argument. If a record is found, it is updated by zeroing out the I<ut_name> and I<ut_host> fields, updating the I<ut_tv> timestamp field and setting I<ut_type> (if there is such a field) to B<DEAD_PROCESS>.
ru: Функция B<logout>() ищет в файле utmp запись, соответствующую аргументу I<ut_line>. Если запись находится, она обновляется заполнением нулям полей I<ut_name> и I<ut_host>, обновляется временная отметка в поле I<ut_tv>, а поле I<ut_type> (если такое поле есть) устанавливается в B<DEAD_PROCESS>.

source: The B<logout>() function returns 1 if the entry was successfully written to the database, or 0 if an error occurred.
ru: Функция B<logout>() возвращает 1, если запись была успешно записана в базу данных, и 0, если возникла ошибка.

source: user accounting database, configured through B<_PATH_UTMP> in I<E<lt>paths.hE<gt>>
ru: база учётных записей пользователей, настраивается через B<_PATH_UTMP> в I<E<lt>paths.hE<gt>>

source: user accounting log file, configured through B<_PATH_WTMP> in I<E<lt>paths.hE<gt>>
ru: файл журнала учёта пользователей, настраивается через B<_PATH_WTMP> в I<E<lt>paths.hE<gt>>

source: In the above table, I<utent> in I<race:utent> signifies that if any of the functions B<setutent>(3), B<getutent>(3), or B<endutent>(3) are used in parallel in different threads of a program, then data races could occur. B<login>() and B<logout>() calls those functions, so we use race:utent to remind users.
ru: В приведённой выше таблице I<utent> в I<race:utent> означает, что если любая из функций B<setutent>(3), B<getutent>(3) или B<endutent>(3) используется одновременно в нескольких нитях программы, то может возникнуть состязательность по данным. Эти функции вызываются из B<login>() и B<logout>(), поэтому мы используем race:utent для напоминания.

source: Not in POSIX.1. Present on the BSDs.
ru: Не является частью POSIX.1. Присутствует в BSD.

source: Note that the member I<ut_user> of I<struct utmp> is called I<ut_name> in BSD. Therefore, I<ut_name> is defined as an alias for I<ut_user> in I<E<lt>utmp.hE<gt>>.
ru: Заметим, что поле I<ut_user> структуры I<struct utmp> в BSD называется I<ut_name>. Поэтому поле I<ut_name> определено как псевдоним I<ut_user> в I<E<lt>utmp.hE<gt>>.

source: lio_listio - initiate a list of I/O requests
ru: lio_listio - запускает список запросов ввода-вывода на выполнение

source: Link with I<-lrt>.
ru: Компонуется при указании параметра I<-lrt>.

source: The B<lio_listio>() function initiates the list of I/O operations described by the array I<aiocb_list>.
ru: Функция B<lio_listio>() запускает на выполнение список операций ввода-вывода, описанных в массиве I<aiocb_list>.

source: The I<mode> operation has one of the following values:
ru: Значение операции I<mode> может быть одним из следующих:

source: The call blocks until all operations are complete. The I<sevp> argument is ignored.
ru: Вызов не завершается до тех пор, пока не будут выполнены все операции. Аргумент I<sevp> игнорируется.

source: The I/O operations are queued for processing and the call returns immediately. When all of the I/O operations complete, asynchronous notification occurs, as specified by the I<sevp> argument; see B<sigevent>(7) for details. If I<sevp> is NULL, no asynchronous notification occurs.
ru: Операции ввода-вывода ставятся в очередь на обработку и вызов завершается. После выполнения всех операций ввода-вывода посылается асинхронное уведомление, задаваемое в аргументе I<sevp>; подробности смотрите в B<sigevent>(7). Если значение I<sevp> равно NULL, то асинхронные уведомления не посылается.

source: The I<aiocb_list> argument is an array of pointers to I<aiocb> structures that describe I/O operations. These operations are executed in an unspecified order. The I<nitems> argument specifies the size of the array I<aiocb_list>. null pointers in I<aiocb_list> are ignored.
ru: Аргумент I<aiocb_list> представляет собой массив указателей на структуры I<aiocb>, в которых описаны операции ввода-вывода. Эти операции выполняются в произвольном порядке. В аргументе I<nitems> указывается размер массива I<aiocb_list>. Указатели null в I<aiocb_list> игнорируются.

source: In each control block in I<aiocb_list>, the I<aio_lio_opcode> field specifies the I/O operation to be initiated, as follows:
ru: В каждом управляющем блоке в I<aiocb_list> в поле I<aio_lio_opcode> задаётся выполняемая операция ввода вывода; значения:

source: Initiate a read operation. The operation is queued as for a call to B<aio_read>(3) specifying this control block.
ru: Выполнить операцию чтения. Операция ставится в очередь как вызов B<aio_read>(3) с указанным управляющим блоком.

source: Initiate a write operation. The operation is queued as for a call to B<aio_write>(3) specifying this control block.
ru: Выполнить операцию записи. Операция ставится в очередь как вызов B<aio_write>(3) с указанным управляющим блоком.

source: Ignore this control block.
ru: Игнорировать управляющий блок.

source: The remaining fields in each control block have the same meanings as for B<aio_read>(3) and B<aio_write>(3). The I<aio_sigevent> fields of each control block can be used to specify notifications for the individual I/O operations (see B<sigevent>(7)).
ru: Остальные поля в каждом управляющем блоке имеют то же назначение, что и для B<aio_read>(3) и B<aio_write>(3). Поля I<aio_sigevent> в каждом управляющем блоке могут использоваться для указания уведомлений по отдельным операциям ввода-вывода (смотрите B<sigevent>(7)).
