Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: lirc - lirc devices
ru: lirc - устройства lirc

source: DESCRIPTION
ru: ОПИСАНИЕ

source: The I</dev/lirc*> character devices provide a low-level bidirectional interface to infra-red (IR) remotes. Most of these devices can receive, and some can send. When receiving or sending data, the driver works in two different modes depending on the underlying hardware.
ru: Символьные устройства I</dev/lirc*> предоставляют низкоуровневый двунаправленный интерфейс к аппаратуре с инфракрасным (IR) управлением. Большинство этих устройств может принимать данные, а не которые и отправлять. При приёме или отправке данных драйвер работает в двух различных режимах, в зависимости от имеющейся аппаратуры.

source: Some hardware (typically TV-cards) decodes the IR signal internally and provides decoded button presses as scancode values. Drivers for this kind of hardware work in B<LIRC_MODE_SCANCODE> mode. Such hardware usually does not support sending IR signals. Furthermore, such hardware can only decode a limited set of IR protocols, usually only the protocol of the specific remote which is bundled with, for example, a TV-card.
ru: Некоторая аппаратура (обычно, ТВ-карты) декодирует IR-сигнал самостоятельно и выдаёт обработанные события о нажатых кнопках в виде значений сканкодов. Драйверы такой аппаратуры работают в режиме B<LIRC_MODE_SCANCODE>. Обычно, такая аппаратура не поддерживает отправку IR-сигналов. Кроме того, она может декодировать ограниченный набор IR-протоколов, обычно, только определённых пультов, поставляющихся с ней в комплекте.

source: Other hardware provides a stream of pulse/space durations. Such drivers work in B<LIRC_MODE_MODE2> mode. Sometimes, this kind of hardware also supports sending IR data. Such hardware can be used with (almost) any kind of remote. This type of hardware can also be used in B<LIRC_MODE_SCANCODE> mode, in which case the kernel IR decoders will decode the IR. These decoders can be written in extended BPF (see B<bpf>(2)) and attached to the B<lirc> device.
ru: Другой вид аппаратуры выдаёт потоки длительностей наличия/отсутствия импульсов. Такие драйверы работают в режиме B<LIRC_MODE_MODE2>. Иногда такая аппаратура также поддерживает отправку данных через IR. Она может использоваться с любым (почти) видом аппаратуры. Этот тип аппаратуры также можно использовать в режиме B<LIRC_MODE_SCANCODE>, в этом случае сигнал декодируют декодеры ядра. Эти декодеры можно писать в расширенных BPF (смотрите B<bpf>(2)) и присоединять к устройству B<lirc>.

source: The B<LIRC_GET_FEATURES> ioctl (see below) allows probing for whether receiving and sending is supported, and in which modes, amongst other features.
ru: Команда ioctl B<LIRC_GET_FEATURES> (смотрите далее) позволяет определить доступность приёма и отправки, режимы, а также другие возможности.

source: Reading input with the LIRC_MODE_MODE2 mode
ru: Чтение входящих данных в режиме LIRC_MODE_MODE2

source: In the B<LIRC_MODE_MODE2 mode>, the data returned by B<read>(2) provides 32-bit values representing a space or a pulse duration. The time of the duration (microseconds) is encoded in the lower 24 bits. The upper 8 bits indicate the type of package:
ru: В режиме B<LIRC_MODE_MODE2> данные, возвращаемые B<read>(2), представляют собой 32-битные значения длительностей наличия/отсутствуя импульсов. Время длительностей (микросекунды) кодируется в младших 24 битах. Старшими 8 битам определяется тип пакета:

source: Value reflects a space duration (microseconds).
ru: Значение представляет длительность отсутствия импульса (микросекунды).

source: Value reflects a pulse duration (microseconds).
ru: Значение представляет длительность импульса (микросекунды).

source: Value reflects a frequency (Hz); see the B<LIRC_SET_MEASURE_CARRIER_MODE> ioctl.
ru: Значение представляет частоту (Гц); смотрите команду ioctl B<LIRC_SET_MEASURE_CARRIER_MODE>.

source: Value reflects a space duration (microseconds). The package reflects a timeout; see the B<LIRC_SET_REC_TIMEOUT_REPORTS> ioctl.
ru: Значение представляет длительность отсутствия импульса (микросекунды). Пакет описывает паузу; смотрите ioctl B<LIRC_SET_REC_TIMEOUT_REPORTS>.

source: Reading input with the LIRC_MODE_SCANCODE mode
ru: Чтение входящих данных в режиме LIRC_MODE_SCANCODE

source: In the B<LIRC_MODE_SCANCODE> mode, the data returned by B<read>(2) reflects decoded button presses, in the struct I<lirc_scancode>. The scancode is stored in the I<scancode> field, and the IR protocol is stored in I<rc_proto>. This field has one the values of the I<enum rc_proto>.
ru: В режиме B<LIRC_MODE_SCANCODE> данные, возвращаемые B<read>(2) в структуре I<lirc_scancode>, содержат декодированные нажатия кнопок. Сканкод сохраняется в поле I<scancode>, а протокол IR — в I<rc_proto>. В этом поле хранится одно из значений I<enum rc_proto>.

source: Writing output with the LIRC_MODE_PULSE mode
ru: Запись выходных данных в режиме LIRC_MODE_PULSE

source: The data written to the character device using B<write>(2) is a pulse/space sequence of integer values. Pulses and spaces are only marked implicitly by their position. The data must start and end with a pulse, thus it must always include an odd number of samples. The B<write>(2) function blocks until the data has been transmitted by the hardware. If more data is provided than the hardware can send, the B<write>(2) call fails with the error B<EINVAL>.
ru: Данные, записываемые в символьное устройство с помощью B<write>(2), представляют собой последовательность наличия/отсутствия импульсов в виде целых чисел. Импульсы и их отсутствие неявно разделяются только по их положению. Данные должны начинаться и заканчиваться импульсом, то есть всегда должно быть нечётное количество выборок. Функция B<write>(2) блокирует выполнение до тех пор, пока данные не будут переданы аппаратурой. Если данных больше, чем аппаратура может послать, то B<write>(2) завершается с ошибкой B<EINVAL>.

source: Writing output with the LIRC_MODE_SCANCODE mode
ru: Запись выходных данных в режиме LIRC_MODE_SCANCODE

source: The data written to the character devices must be a single struct I<lirc_scancode>. The I<scancode> and I<rc_proto> fields must filled in, all other fields must be 0. The kernel IR encoders will convert the scancode to pulses and spaces. The protocol or scancode is invalid, or the B<lirc> device cannot transmit.
ru: Данные, записываемые в символьные устройства, должны храниться в структуре I<lirc_scancode>. Должны быть заполнены поля I<scancode> и I<rc_proto>, остальные должны быть равны 0. IR-кодировщики ядра преобразуют сканкод в импульсы и паузы. При некорректном протоколе, сканкоде или устройстве B<lirc> передача невозможна.

source: IOCTL COMMANDS
ru: КОМАНДЫ IOCTL

source: The LIRC device's ioctl definition is bound by the ioctl function definition of I<struct file_operations>, leaving us with an I<unsigned int> for the ioctl command and an I<unsigned long> for the argument. For the purposes of ioctl portability across 32-bit and 64-bit architectures, these values are capped to their 32-bit sizes.
ru: Работа ioctl с устройствами LIRC ограничена определением I<struct file_operations> функции ioctl, что даёт I<unsigned int> для команды ioctl и I<unsigned long> для аргумента. С целью переносимости ioctl между 32-битными и 64-битными архитектурами эти значения ограничены 32-битными значениями.

source: #include E<lt>linux/lirc.hE<gt> /* But see BUGS */ int ioctl(int fd, int cmd, ...);
ru: #include E<lt>linux/lirc.hE<gt> /* но смотрите ДЕФЕКТЫ */ int ioctl(int fd, int cmd, ...);

source: The following ioctls can be used to probe or change specific B<lirc> hardware settings. Many require a third argument, usually an I<int>. referred to below as I<val>.
ru: Следующие команды ioctl можно использовать для тестирования или изменения определённых аппаратных настроек через B<lirc>. Для многих команд требуется третий аргумент, обычно с типом I<int>, который обозначается далее как I<val>.

source: Always Supported Commands
ru: Всегда поддерживаемые команды

source: I</dev/lirc*> devices always support the following commands:
ru: Устройства I</dev/lirc*> всегда поддерживают следующие команды:

source: Returns a bit mask of combined features bits; see FEATURES.
ru: Возвращает битовую маску возможностей; смотрите ВОЗМОЖНОСТИ.

source: If a device returns an error code for B<LIRC_GET_FEATURES>, it is safe to assume it is not a B<lirc> device.
ru: Если устройство возвращает код ошибки после B<LIRC_GET_FEATURES>, то можно считать, что это устройство не является B<lirc>.

source: Optional Commands
ru: Необязательные команды

source: Some B<lirc> devices support the commands listed below. Unless otherwise stated, these fail with the error B<ENOTTY> if the operation isn't supported, or with the error B<EINVAL> if the operation failed, or invalid arguments were provided. If a driver does not announce support of certain features, invoking the corresponding ioctls will fail with the error B<ENOTTY>.
ru: Некоторые устройства B<lirc> поддерживают команды, перечисленные ниже. Если не утверждается обратное, они завершаются с ошибкой B<ENOTTY>, если операция не поддерживается, или с ошибкой B<EINVAL>, если операция завершилась с ошибкой или указаны некорректные параметры. Если драйвер не анонсирует поддержку определённых возможностей, то вызов соответствующих ioctl завершается с ошибкой B<ENOTTY>.

source: If the B<lirc> device has no receiver, this operation fails with the error B<ENOTTY>. Otherwise, it returns the receive mode, which will be one of:
ru: Если в устройстве B<lirc> нет приёмника, то эта операция завершается ошибкой B<ENOTTY>. В противном случае возвращается режим приёма, который может быть одним из:

source: The driver returns a sequence of pulse/space durations.
ru: Драйвер возвращает последовательность длительностей наличия/ отсутствуя импульсов.

source: The driver returns struct I<lirc_scancode> values, each of which represents a decoded button press.
ru: Драйвер возвращает значения struct I<lirc_scancode>, каждое из которых представляет декодированное нажатие кнопки.

source: Set the receive mode. I<val> is either B<LIRC_MODE_SCANCODE> or B<LIRC_MODE_MODE2>. If the B<lirc> device has no receiver, this operation fails with the error B<ENOTTY.>
ru: Задаёт режим приёма. Значением I<val> может быть B<LIRC_MODE_SCANCODE> или B<LIRC_MODE_MODE2>.Если в устройстве B<lirc> нет приёмника, то эта операция завершается ошибкой B<ENOTTY>.

source: Return the send mode. B<LIRC_MODE_PULSE> or B<LIRC_MODE_SCANCODE> is supported. If the B<lirc> device cannot send, this operation fails with the error B<ENOTTY.>
ru: Возвращает режим передачи. Поддерживаются B<LIRC_MODE_PULSE> и B<LIRC_MODE_SCANCODE>. Если в устройстве B<lirc> нет передатчика, то эта операция завершается ошибкой B<ENOTTY>.

source: Set the send mode. I<val> is either B<LIRC_MODE_SCANCODE> or B<LIRC_MODE_PULSE>. If the B<lirc> device cannot send, this operation fails with the error B<ENOTTY>.
ru: Задаёт режим передачи. Значением I<val> может быть B<LIRC_MODE_SCANCODE> или B<LIRC_MODE_PULSE>. Если в устройстве B<lirc> нет передатчика, то эта операция завершается ошибкой B<ENOTTY>.

source: Set the modulation frequency. The argument is the frequency (Hz).
ru: Задаёт частоту модуляции. Значением аргумента является частота (в Гц).

source: Set the carrier duty cycle. I<val> is a number in the range [0,100] which describes the pulse width as a percentage of the total cycle. Currently, no special meaning is defined for 0 or 100, but the values are reserved for future use.
ru: Задаёт скважность несущей частоты (carrier duty cycle). Значение I<val> — число в диапазоне [0,100], описывающей ширину импульса в виде процента от всего сигнала. Значения 0 и 100 не несут какого-то особенного смысла, но зарезервированы для использования в будущем.

source: Some devices have internal timers that can be used to detect when there has been no IR activity for a long time. This can help B<lircd>(8) in detecting that an IR signal is finished and can speed up the decoding process. These operations return integer values with the minimum/maximum timeout that can be set (microseconds). Some devices have a fixed timeout. For such drivers, B<LIRC_GET_MIN_TIMEOUT> and B<LIRC_GET_MAX_TIMEOUT> will fail with the error B<ENOTTY>.
ru: В некоторых устройствах есть встроенные таймеры, которые можно использовать для обнаружения длительного отсутствия активности IR. Это может помочь B<lircd>(8) обнаружить окончание сигнала IR и что можно запускать процесс декодирования. Такие операции возвращают целочисленные значения минимального/максимального периода ожидания, которое можно задать (в микросекундах). У некоторых устройств период ожидания нельзя изменить. В таких драйверах B<LIRC_GET_MIN_TIMEOUT> и B<LIRC_GET_MAX_TIMEOUT> возвращают ошибку B<ENOTTY>.

source: Set the integer value for IR inactivity timeout (microseconds). To be accepted, the value must be within the limits defined by B<LIRC_GET_MIN_TIMEOUT> and B<LIRC_GET_MAX_TIMEOUT>. A value of 0 (if supported by the hardware) disables all hardware timeouts and data should be reported as soon as possible. If the exact value cannot be set, then the next possible value I<greater> than the given value should be set.
ru: Задаёт период неактивности IR в виде целого значения (микросекунды). Корректные значения должны находиться в пределах, полученных от B<LIRC_GET_MIN_TIMEOUT> и B<LIRC_GET_MAX_TIMEOUT>. Значение 0 (если поддерживается оборудованием) отключает все аппаратные ожидания и о данных сообщается сразу после появления. Если точное значение установить невозможно, то нужно указать следующее I<большее> возможное значение.

source: Return the current inactivity timeout (microseconds). Available since Linux 4.18.
ru: Возвращает текущий период неактивности (в микросекундах). Доступен в Linux с версии 4.18.

source: Enable (I<val> is 1) or disable (I<val> is 0) timeout packages in B<LIRC_MODE_MODE2>. The behavior of this operation has varied across kernel versions:
ru: Включает (I<val> равно 1) или выключает пакеты об (I<val> равно 0) ожидании в B<LIRC_MODE_MODE2>. Работа этой операции в разных версиях ядра отличается:

source: Since Linux 4.16: each time the B<lirc device is opened,> timeout reports are by default enabled for the resulting file descriptor. The B<LIRC_SET_REC_TIMEOUT> operation can be used to disable (and, if desired, to later re-enable) the timeout on the file descriptor.
ru: Начиная с Linux 4.16: каждый раз B<при открытии устройства lirc> сообщения о неактивности по умолчанию включается для файлового дескриптора результата. Операцию B<LIRC_SET_REC_TIMEOUT> можно использовать для выключения (и, если нужно, потом включить заново) ожидания на файловом дескрипторе.

source: In Linux 4.15 and earlier: timeout reports are disabled by default, and enabling them (via B<LIRC_SET_REC_TIMEOUT>) on any file descriptor associated with the B<lirc> device has the effect of enabling timeouts for all file descriptors referring to that device (until timeouts are disabled again).
ru: В Linux 4.15 и старее: сообщения о неактивности по умолчанию выключено и его включение (B<LIRC_SET_REC_TIMEOUT>) на любом файловом дескрипторе, связанном с устройством B<lirc>, привод к включению ожидания неактивности для всех файловых дескрипторов, которые ссылаются на устройство (пока неактивность не будет снова выключена).

source: Set the upper bound of the receive carrier frequency (Hz). See B<LIRC_SET_REC_CARRIER_RANGE>.
ru: Задаёт верхнюю границу несущей частоты приёмника (Гц). Смотрите <LIRC_SET_REC_CARRIER_RANGE>.

source: Sets the lower bound of the receive carrier frequency (Hz). For this to take affect, first set the lower bound using the B<LIRC_SET_REC_CARRIER_RANGE> ioctl, and then the upper bound using the B<LIRC_SET_REC_CARRIER> ioctl.
ru: Задаёт нижнюю границу несущей частоты приёмника (Гц). Для выполнения этой операции сначала нужно задать нижнюю границу с помощью ioctl B<LIRC_SET_REC_CARRIER_RANGE>, а затем верхнюю границу с помощью ioctl B<LIRC_SET_REC_CARRIER>.

source: Enable (I<val> is 1) or disable (I<val> is 0) the measure mode. If enabled, from the next key press on, the driver will send B<LIRC_MODE2_FREQUENCY> packets. By default, this should be turned off.
ru: Включает (I<val> равно 1) или выключает (I<val> равно 0) режим измерения. Если режим включён, то после следующего нажатия клавиши драйвер пошлёт пакеты B<LIRC_MODE2_FREQUENCY>. По умолчанию должен быть выключен.

source: Return the driver resolution (microseconds).
ru: Возвращает точность разрешения драйвера (в микросекундах).

source: Enable the set of transmitters specified in I<val>, which contains a bit mask where each enabled transmitter is a 1. The first transmitter is encoded by the least significant bit, and so on. When an invalid bit mask is given, for example a bit is set even though the device does not have so many transmitters, this operation returns the number of available transmitters and does nothing otherwise.
ru: Включает набор передатчиков, указанных в I<val> в виде битовой маски, где каждый включаемый передатчик обозначен 1. Первый передатчик кодируется в самом младшем бите и т. д. Если указана некорректная битовая маска, например, указан бит, но в устройстве нет столько передатчиков, то данная операция возвращает количество доступных передатчиков и ничего не делает.

source: Some devices are equipped with a special wide band receiver which is intended to be used to learn the output of an existing remote. This ioctl can be used to enable (I<val> equals 1) or disable (I<val> equals 0) this functionality. This might be useful for devices that otherwise have narrow band receivers that prevent them to be used with certain remotes. Wide band receivers may also be more precise. On the other hand, their disadvantage usually is reduced range of reception.
ru: У некоторых устройств есть специальный широкополосный приёмник, который предназначен для обучения выводу существующего пульта. Данную ioctl можно использовать для включения (I<val> равно 1) или отключения (I<val> равно 0) этого свойства. Это может быть полезно для устройств с узкополосными приёмниками, которые не могут работать с некоторыми пультами. Широкополосные приёмники могут иметь большую точность. С другой стороны, их недостаток в меньшей дальности приёма.

source: Note: wide band receiver may be implicitly enabled if you enable carrier reports. In that case, it will be disabled as soon as you disable carrier reports. Trying to disable a wide band receiver while carrier reports are active will do nothing.
ru: Замечание: широкополосные приёмники могут неявно включаться, если вы включаете сообщения о несущей. В этом случае, он отключится сразу после отключения сообщений о несущей. Попытка отключить широкополосный приёмник при включённых сообщениях о несущей ни к чему не приводит.

source: FEATURES
ru: ВОЗМОЖНОСТИ

source: the B<LIRC_GET_FEATURES> ioctl returns a bit mask describing features of the driver. The following bits may be returned in the mask:
ru: ioctl B<LIRC_GET_FEATURES> возвращает битовую маску, описывающую свойства драйвера. В маске могут быть установлены следующие биты:

source: The driver is capable of receiving using B<LIRC_MODE_MODE2>.
ru: Драйвер способен вести приём в режиме B<LIRC_MODE_MODE2>.

source: The driver is capable of receiving using B<LIRC_MODE_SCANCODE>.
ru: Драйвер способен вести приём в режиме B<LIRC_MODE_SCANCODE>.

source: The driver supports changing the modulation frequency using B<LIRC_SET_SEND_CARRIER>.
ru: Драйвер поддерживает изменение частоты модуляции с помощью B<LIRC_SET_SEND_CARRIER>.

source: The driver supports changing the duty cycle using B<LIRC_SET_SEND_DUTY_CYCLE>.
ru: Драйвер поддерживает изменение опорного сигнала с помощью B<LIRC_SET_SEND_DUTY_CYCLE>.

source: The driver supports changing the active transmitter(s) using B<LIRC_SET_TRANSMITTER_MASK>.
ru: Драйвер поддерживает изменение передатчика(ов) с помощью B<LIRC_SET_TRANSMITTER_MASK>.

source: The driver supports setting the receive carrier frequency using B<LIRC_SET_REC_CARRIER>. Any B<lirc> device since the drivers were merged in kernel release 2.6.36 must have B<LIRC_CAN_SET_REC_CARRIER_RANGE> set if B<LIRC_CAN_SET_REC_CARRIER> feature is set.
ru: Драйвер поддерживает установку частоты приёмной несущей с помощью B<LIRC_SET_REC_CARRIER>. Из-за объединения драйверов в ядре версии 2.6.36 любое устройство B<lirc> должно устанавливать B<LIRC_CAN_SET_REC_CARRIER_RANGE>, если указано свойство B<LIRC_CAN_SET_REC_CARRIER>.

source: The driver supports B<LIRC_SET_REC_CARRIER_RANGE>. The lower bound of the carrier must first be set using the B<LIRC_SET_REC_CARRIER_RANGE> ioctl, before using the B<LIRC_SET_REC_CARRIER> ioctl to set the upper bound.
ru: Драйвер поддерживает B<LIRC_SET_REC_CARRIER_RANGE>. Перед использованием ioctl B<LIRC_SET_REC_CARRIER> для указания верхней границы,нужно вызвать ioctl B<LIRC_SET_REC_CARRIER_RANGE> для указания нижней границы несущей.

source: The driver supports B<LIRC_GET_REC_RESOLUTION>.
ru: Драйвер поддерживает B<LIRC_GET_REC_RESOLUTION>.

source: The driver supports B<LIRC_SET_REC_TIMEOUT>.
ru: Драйвер поддерживает B<LIRC_SET_REC_TIMEOUT>.

source: The driver supports measuring of the modulation frequency using B<LIRC_SET_MEASURE_CARRIER_MODE>.
ru: Драйвер поддерживает измерение частоты модуляции с помощью B<LIRC_SET_MEASURE_CARRIER_MODE>.

source: The driver supports learning mode using B<LIRC_SET_WIDEBAND_RECEIVER>.
ru: Драйвер поддерживает режим обучения с помощью B<LIRC_SET_WIDEBAND_RECEIVER>.

source: The driver supports sending using B<LIRC_MODE_PULSE> or B<LIRC_MODE_SCANCODE>
ru: Драйвер поддерживает отправку в режиме B<LIRC_MODE_SCANCODE> или B<LIRC_MODE_SCANCODE>.

source: BUGS
ru: ДЕФЕКТЫ

source: Using these devices requires the kernel source header file I<lirc.h>. This file is not available before kernel release 4.6. Users of older kernels could use the file bundled in E<.UR http://www.lirc.org> E<.UE .>
ru: Для использования этих устройств требуется заголовочный файл ядра I<lirc.h>. Этот файл был недоступен до ядра версии 4.6. Пользователи старых ядер могут использовать файл с сайта E<.UR http://www.lirc.org> E<.UE .>

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: loop, loop-control - loop devices
ru: loop, loop-control - закольцованные устройства

source: SYNOPSIS
ru: ОБЗОР

source: The loop device is a block device that maps its data blocks not to a physical device such as a hard disk or optical disk drive, but to the blocks of a regular file in a filesystem or to another block device. This can be useful for example to provide a block device for a filesystem image stored in a file, so that it can be mounted with the B<mount>(8) command. You could do
ru: Закольцованное устройство — это блочное устройство, которое отображает блоки данных обычного файла в файловой системе или другое блочное устройство. Это может быть полезно, например, для получения образа файловой системы, хранящегося в файле, в виде блочного устройства, которое может быть смонтировано с помощью команды B<mount>(8). Это можно сделать так:

source: See B<losetup>(8) for another example.
ru: Другой пример смотрите в B<losetup>(8).

source: A transfer function can be specified for each loop device for encryption and decryption purposes.
ru: Для шифрования и расшифровки каждому закольцованному устройству может быть назначена функция обмена.

source: The following B<ioctl>(2) operations are provided by the loop block device:
ru: Для закольцованного блочного устройства доступны следующие операции B<ioctl>(2):
