Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: The program B<ld.so> handles a.out binaries, a binary format used long ago. The program B<ld-linux.so*> (I</lib/ld-linux.so.1> for libc5, I</lib/ld-linux.so.2> for glibc2) handles binaries that are in the more modern ELF format. Both programs have the same behavior, and use the same support files and programs (B<ldd>(1), B<ldconfig>(8), and I</etc/ld.so.conf>).
ru: Программа B<ld.so> предназначена для обработки двоичных файлов в формате a.out, который используется с давних пор. Программа B<ld-linux.so*> (I</lib/ld-linux.so.1>, если используется libc5 и I</lib/ld-linux.so.2>, если glibc2) предназначена для обработки файлов в более современном формате ELF. Обе программы ведут себя одинаково и используют одни и те же файлы поддержки и программы (B<ldd>(1), B<ldconfig>(8) и I</etc/ld.so.conf>).

source: When resolving shared object dependencies, the dynamic linker first inspects each dependency string to see if it contains a slash (this can occur if a shared object pathname containing slashes was specified at link time). If a slash is found, then the dependency string is interpreted as a (relative or absolute) pathname, and the shared object is loaded using that pathname.
ru: При определении зависимостей общего объекта, динамический компоновщик сначала просматривает каждую строку зависимости в поисках символа косой черты (такое случается, если путь общего объекта с косой чертой был задан во время компоновки). Если косая черта найдена, то строка зависимости воспринимается как путь (относительный или абсолютный), и общий объект загружается исходя из этого пути.

source: If a shared object dependency does not contain a slash, then it is searched for in the following order:
ru: Если в зависимости общего объекта отсутствует косая черта, то поиск выполняется в следующем порядке:

source: Using the directories specified in the DT_RPATH dynamic section attribute of the binary if present and DT_RUNPATH attribute does not exist. Use of DT_RPATH is deprecated.
ru: В каталогах, указанных в атрибуте DT_RPATH динамического раздела двоичного файла, если он есть и если атрибут DT_RUNPATH не существует. Использование DT_RPATH не рекомендуется.

source: Using the environment variable B<LD_LIBRARY_PATH>, unless the executable is being run in secure-execution mode (see below), in which case this variable is ignored.
ru: В переменной окружения B<LD_LIBRARY_PATH>, если исполняемый файл не выполняется в режиме безопасного выполнения (смотрите далее), в котором данная переменная игнорируется.

source: Using the directories specified in the DT_RUNPATH dynamic section attribute of the binary if present. Such directories are searched only to find those objects required by DT_NEEDED (direct dependencies) entries and do not apply to those objects' children, which must themselves have their own DT_RUNPATH entries. This is unlike DT_RPATH, which is applied to searches for all children in the dependency tree.
ru: В каталогах, указанных в атрибуте DT_RUNPATH динамического раздела двоичного файла, если он есть. Эти каталоги просматриваются только при поиске объектов, требуемых элементами DT_NEEDED (прямые зависимости) и не применяются к дочерним объектам, которые сами должны иметь свои собственные элементы DT_RUNPATH. В этом отличие от DT_RPATH, которые применяются при поиске для всех потомков в дереве зависимостей.

source: From the cache file I</etc/ld.so.cache>, which contains a compiled list of candidate shared objects previously found in the augmented library path. If, however, the binary was linked with the B<-z nodeflib> linker option, shared objects in the default paths are skipped. Shared objects installed in hardware capability directories (see below) are preferred to other shared objects.
ru: В кэш-файле I</etc/ld.so.cache>, содержащем скомпилированный список кандидатов общих объектов, которые ранее были найдены по указанным путям расположения библиотек. Однако, если при сборке двоичного файла компоновщику был указан параметр B<-z nodeflib>, то общие объекты в путях по умолчанию будут пропущены. Общие объекты, установленные в каталоги для аппаратных возможностей (см. далее) имеют больший приоритет, чем остальные общие объекты.

source: In the default path I</lib>, and then I</usr/lib>. (On some 64-bit architectures, the default paths for 64-bit shared objects are I</lib64>, and then I</usr/lib64>.) If the binary was linked with the B<-z nodeflib> linker option, this step is skipped.
ru: В каталоге по умолчанию I</lib> и затем в I</usr/lib> (на некоторых 64-битных архитектурах путь по умолчанию для 64-битных объектов — I</lib64> и затем I</usr/lib64>). Если при сборке двоичного файла компоновщику был указан параметр B<-z nodeflib>, то этот шаг пропускается.

source: Rpath token expansion
ru: Раскрытие токена rpath

source: The dynamic linker understands certain token strings in an rpath specification (DT_RPATH or DT_RUNPATH). Those strings are substituted as follows:
ru: Динамический компоновщик распознаёт определённые строковые токены в значении rpath (DT_RPATH или DT_RUNPATH). Эти строки заменяются на:

source: I<$ORIGIN> (or equivalently I<${ORIGIN}>)
ru: I<$ORIGIN> (или I<${ORIGIN}>)

source: This expands to the directory containing the program or shared object. Thus, an application located in I<somedir/app> could be compiled with
ru: Она раскрывается в каталог, содержащий программу или общий объект. Таким образом, приложение, расположенное в I<somedir/app> может компилироваться с

source: so that it finds an associated shared object in I<somedir/lib> no matter where I<somedir> is located in the directory hierarchy. This facilitates the creation of "turn-key" applications that do not need to be installed into special directories, but can instead be unpacked into any directory and still find their own shared objects.
ru: для того, чтобы оно могло найти связанный общий объект в I<somedir/lib> и не важно где в иерархии каталогов будет находиться I<somedir>. Это облегчает создание приложений «под ключ», которые вместо установки в специальные каталоги, можно просто распаковать в любой каталог, и они всё равно найдут свои общие объекты.

source: I<$LIB> (or equivalently I<${LIB}>)
ru: I<$LIB> (или I<${LIB}>)

source: This expands to I<lib> or I<lib64> depending on the architecture (e.g., on x86-64, it expands to I<lib64> and on x86-32, it expands to I<lib>).
ru: Она раскрывается в I<lib> или I<lib64>, в зависимости от архитектуры (например, на x86-64 она заменяется на I<lib64>, а на x86-32 она заменяется на I<lib>).

source: I<$PLATFORM> (or equivalently I<${PLATFORM}>)
ru: I<$PLATFORM> (или I<${PLATFORM}>)

source: This expands to a string corresponding to the processor type of the host system (e.g., "x86_64"). On some architectures, the Linux kernel doesn't provide a platform string to the dynamic linker. The value of this string is taken from the B<AT_PLATFORM> value in the auxiliary vector (see B<getauxval>(3)).
ru: Преобразуется в строку, соответствующую типу процессора узла (например, «x86_64»). На некоторых архитектурах ядро Linux не предоставляет строку платформы динамическому компоновщику. Значение этой строки берётся из значения B<AT_PLATFORM> вспомогательного вектора (смотрите B<getauxval>(3)).

source: B<--audit>I< list>
ru: B<--audit>I< список>

source: Use objects named in I<list> as auditors. The objects in I<list> are delimited by colons.
ru: Использовать объекты из I<списка> в качестве аудиторов. Объекты в I<list> разделяются двоеточиями.

source: Do not use I</etc/ld.so.cache>.
ru: Не использовать I</etc/ld.so.cache>.

source: B<--library-path>I< path>
ru: B<--library-path>I< путь>

source: Use I<path> instead of B<LD_LIBRARY_PATH> environment variable setting (see below). The names I<ORIGIN>, I<LIB>, and I<PLATFORM> are interpreted as for the B<LD_LIBRARY_PATH> environment variable.
ru: Использовать I<путь> вместо значения переменной окружения B<LD_LIBRARY_PATH> (смотрите далее). Имена I<ORIGIN>, I<LIB> и I<PLATFORM> рассматриваются также как переменная окружения B<LD_LIBRARY_PATH>.

source: B<--inhibit-rpath>I< list>
ru: B<--inhibit-rpath>I< список>

source: Ignore RPATH and RUNPATH information in object names in I<list>. This option is ignored when running in secure-execution mode (see below). The objects in I<list> are delimited by colons or spaces.
ru: Игнорировать информацию в RPATH и RUNPATH об именах объектов из I<списка>. Этот параметр игнорируется в режиме безопасного выполнения (смотрите далее). Объекты в I<list> разделяются двоеточиями или пробелами.

source: List all dependencies and how they are resolved.
ru: Выдать список всех зависимостей и как они удовлетворяются.

source: B<--preload> I<list> (since glibc 2.30)
ru: B<--preload> I<list> (начиная с glibc 2.30)

source: Preload the objects specified in I<list>. The objects in I<list> are delimited by colons or spaces. The objects are preloaded as explained in the description of the B<LD_PRELOAD> environment variable below.
ru: Предварительно загружать объекты, указанные в I<list>. Объекты в I<list> разделяются двоеточиями или пробелами. Предварительная загрузка объектов описана далее, в разделе о переменной окружения B<LD_PRELOAD>.

source: By contrast with B<LD_PRELOAD>, the B<--preload> option provides a way to perform preloading for a single executable without affecting preloading performed in any child process that executes a new program.
ru: В отличии от B<LD_PRELOAD>, параметр B<--preload> предоставляет способ выполнить предварительную загрузку для одного исполняемого файла не влияя при этом на предварительную загрузку его дочерних процессов, которые запускает новая программа.

source: Verify that program is dynamically linked and this dynamic linker can handle it.
ru: Проверить, что программа является динамически скомпонованной и что компоновщик понимает её формат.

source: ENVIRONMENT
ru: ОКРУЖЕНИЕ

source: Various environment variables influence the operation of the dynamic linker.
ru: На поведение динамического компоновщика влияют различные переменные окружения.

source: Secure-execution mode
ru: Безопасный режим выполнения

source: For security reasons, if the dynamic linker determines that a binary should be run in secure-execution mode, the effects of some environment variables are voided or modified, and furthermore those environment variables are stripped from the environment, so that the program does not even see the definitions. Some of these environment variables affect the operation of the dynamic linker itself, and are described below. Other environment variables treated in this way include: B<GCONV_PATH>, B<GETCONF_DIR>, B<HOSTALIASES>, B<LOCALDOMAIN>, B<LOCPATH>, B<MALLOC_TRACE>, B<NIS_PATH>, B<NLSPATH>, B<RESOLV_HOST_CONF>, B<RES_OPTIONS>, B<TMPDIR>, and B<TZDIR>.
ru: В целях безопасности, если динамический компоновщик определяет, что двоичный файл должен быть запущен в безопасном режиме выполнения, действие некоторых переменных окружения отменяется или изменяется; кроме этого, эти переменные окружения удаляются из окружения, и программа даже не увидит, что они определены. Некоторые из этих переменных окружения влияют на работу самого динамического компоновщика, и они описаны ниже. Другие переменные окружения, учитываемые подобным образом: B<GCONV_PATH>, B<GETCONF_DIR>, B<HOSTALIASES>, B<LOCALDOMAIN>, B<LOCPATH>, B<MALLOC_TRACE>, B<NIS_PATH>, B<NLSPATH>, B<RESOLV_HOST_CONF>, B<RES_OPTIONS>, B<TMPDIR> и B<TZDIR>.

source: A binary is executed in secure-execution mode if the B<AT_SECURE> entry in the auxiliary vector (see B<getauxval>(3)) has a nonzero value. This entry may have a nonzero value for various reasons, including:
ru: Двоичный файл выполняется в безопасном режиме выполнения, если запись B<AT_SECURE> в вспомогательном векторе (смотрите B<getauxval>(3)) содержит ненулевое значение. Эта запись может иметь ненулевое значение по разным причинам:

source: The process's real and effective user IDs differ, or the real and effective group IDs differ. This typically occurs as a result of executing a set-user-ID or set-group-ID program.
ru: У процесса различаются реальный и эффективный идентификатор пользователя/группы. Обычно, это происходит в результате выполнения программ с установленным битом set-user-ID или set-group-ID.

source: A process with a non-root user ID executed a binary that conferred capabilities to the process.
ru: Процесс с пользовательским ID не равным root, выполняет файл, который присваивает мандаты процессу.

source: A nonzero value may have been set by a Linux Security Module.
ru: Ненулевое значение может установить Linux Security Module.

source: Environment variables
ru: Переменные окружения

source: Among the more important environment variables are the following:
ru: Среди наиболее важных переменных окружения следует выделить следующие:

source: B<LD_ASSUME_KERNEL> (since glibc 2.2.3)
ru: B<LD_ASSUME_KERNEL> (начиная с glibc 2.2.3)

source: Each shared object can inform the dynamic linker of the minimum kernel ABI version that it requires. (This requirement is encoded in an ELF note section that is viewable via I<readelf\ -n> as a section labeled B<NT_GNU_ABI_TAG>.) At run time, the dynamic linker determines the ABI version of the running kernel and will reject loading shared objects that specify minimum ABI versions that exceed that ABI version.
ru: Каждый общий объект может сообщать динамическому компоновщику о требуемой минимальной версии ядерного ABI (это требование кодируется в разделе ELF note, который можно просмотреть с помощью I<readelf\ -n>, под меткой B<NT_GNU_ABI_TAG>). Во время выполнения динамический компоновщик определяет версию ABI запущенного ядра и не будет загружать общие объекты, у которых минимальная версия ABI превышает версию ядра.

source: B<LD_ASSUME_KERNEL> can be used to cause the dynamic linker to assume that it is running on a system with a different kernel ABI version. For example, the following command line causes the dynamic linker to assume it is running on Linux 2.2.5 when loading the shared objects required by I<myprog>:
ru: B<LD_ASSUME_KERNEL> можно использовать, чтобы заставить динамический компоновщик предполагать, что он работает в системе с другой версией ядра ABI. Например, следующая команда заставляет динамический компоновщик при загрузке общих объектов, требуемых I<myprog>, предполагать, что он запущен на Linux с версией 2.2.5:

source: On systems that provide multiple versions of a shared object (in different directories in the search path) that have different minimum kernel ABI version requirements, B<LD_ASSUME_KERNEL> can be used to select the version of the object that is used (dependent on the directory search order).
ru: В системах, предоставляющих несколько версий общего объекта (в различных каталогах пути поиска) с разными требованиями к минимальной версии ядра ABI, B<LD_ASSUME_KERNEL> может использоваться для выбора версии объекта, которую нужно задействовать (в зависимости от порядка поиска в каталогах).

source: Historically, the most common use of the B<LD_ASSUME_KERNEL> feature was to manually select the older LinuxThreads POSIX threads implementation on systems that provided both LinuxThreads and NPTL (which latter was typically the default on such systems); see B<pthreads>(7).
ru: Исторически, свойство B<LD_ASSUME_KERNEL> наиболее часто использовалось при ручном выборе старых реализаций нитей POSIX LinuxThreads в системах, которые предоставляли и LinuxThreads, и NPTL (в последствии стала базовой в таких системах); смотрите B<pthreads>(7).

source: B<LD_BIND_NOW> (since glibc 2.1.1)
ru: B<LD_BIND_NOW> (начиная с glibc 2.1.1)

source: If set to a nonempty string, causes the dynamic linker to resolve all symbols at program startup instead of deferring function call resolution to the point when they are first referenced. This is useful when using a debugger.
ru: Если переменная содержит непустую строку, то динамический компоновщик будет искать все символы при запуске программы вместо того, чтобы отложить поиск вызовов функций до момента, когда они встретятся в первый раз. Это полезно при отладке.

source: A list of directories in which to search for ELF libraries at execution time. The items in the list are separated by either colons or semicolons, and there is no support for escaping either separator.
ru: Список каталогов, в которых будет производиться поиск библиотек ELF в момент выполнения. Элементы списка разделяются двоеточиями или точками с запятой (экранирование этих разделителей не поддерживается).

source: This variable is ignored in secure-execution mode.
ru: Данная переменная игнорируется в режиме безопасного выполнения.

source: Within the pathnames specified in B<LD_LIBRARY_PATH>, the dynamic linker expands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Rpath token expansion>. Thus, for example, the following would cause a library to be searched for in either the I<lib> or I<lib64> subdirectory below the directory containing the program to be executed:
ru: Внутри путей, указанных в B<LD_LIBRARY_PATH>, динамический компоновщик раскрывает токены I<$ORIGIN>, I<$LIB> и I<$PLATFORM> (или версии, использующие фигурные скобки вокруг имён) как описано выше в разделе I<Раскрытие токена rpath>. Таким образом, например, следующее значение заставит искать библиотеку в подкаталогах I<lib> или I<lib64>, находящихся ниже каталога, содержащего исполняемую программу:

source: (Note the use of single quotes, which prevent expansion of I<$ORIGIN> and I<$LIB> as shell variables!)
ru: (Обратите внимание на одиночные кавычки, которые не позволяют раскрывать I<$ORIGIN> и I<$LIB> как переменные оболочки!)

source: A list of additional, user-specified, ELF shared objects to be loaded before all others. This feature can be used to selectively override functions in other shared objects.
ru: Список дополнительных, указанных пользователем, общих объектов ELF, которые будут загружены раньше чем все остальные. Может использоваться для выборочной замены функций из других общих объектов.

source: The items of the list can be separated by spaces or colons, and there is no support for escaping either separator. The objects are searched for using the rules given under DESCRIPTION. Objects are searched for and added to the link map in the left-to-right order specified in the list.
ru: Элементы списка разделяются пробелами или двоеточиями, экранирование этих разделителей не поддерживается. Объекты ищутся согласно правилам из ОПИСАНИЯ. Найденные объекты добавляются в карту связей согласно списку, в порядке слева направо.

source: In secure-execution mode, preload pathnames containing slashes are ignored. Furthermore, shared objects are preloaded only from the standard search directories and only if they have set-user-ID mode bit enabled (which is not typical).
ru: В режиме безопасного выполнения предварительная загрузка файлов с символами косой черты не выполняется. Кроме того, загружаются общие объекты только из стандартных каталогов поиска и с включённым битом режима set-user-ID (что не типично).

source: Within the names specified in the B<LD_PRELOAD> list, the dynamic linker understands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Rpath token expansion>. (See also the discussion of quoting under the description of B<LD_LIBRARY_PATH>.)
ru: Внутри имён, указанных в списке B<LD_PRELOAD>, динамический компоновщик раскрывает токены I<$ORIGIN>, I<$LIB> и I<$PLATFORM> (или версии, использующие фигурные скобки вокруг имён) как описано выше в разделе I<Раскрытие токена rpath> (также смотрите описание цитирования в B<LD_LIBRARY_PATH>).

source: There are various methods of specifying libraries to be preloaded, and these are handled in the following order:
ru: Есть несколько методов указания библиотек для предварительной загрузки,они обрабатываются в следующем порядке:

source: The B<LD_PRELOAD> environment variable.
ru: Переменная окружения B<LD_PRELOAD>.

source: The B<--preload> command-line option when invoking the dynamic linker directly.
ru: Параметр командной строки B<--preload>, при непосредственном вызове динамического компоновщика.

source: The I</etc/ld.so.preload> file (described below).
ru: Файл I</etc/ld.so.preload> (смотрите ниже).

source: If set (to any value), causes the program to list its dynamic dependencies, as if run by B<ldd>(1), instead of running normally.
ru: Если установлена (любое значение), то вместо нормального запуска программы будут выданы её динамические зависимости, как если бы она была запущена B<ldd>(1).

source: Then there are lots of more or less obscure variables, many obsolete or only for internal use.
ru: Также существует большое количество более или менее полезных переменных, многие из которых устарели или предназначены только для внутреннего использования.

source: B<LD_AUDIT> (since glibc 2.4)
ru: B<LD_AUDIT> (начиная с glibc 2.4)

source: A list of user-specified, ELF shared objects to be loaded before all others in a separate linker namespace (i.e., one that does not intrude upon the normal symbol bindings that would occur in the process) These objects can be used to audit the operation of the dynamic linker. The items in the list are colon-separated, and there is no support for escaping the separator.
ru: Определяемый пользователем список общих объектов ELF, которые будут загружены раньше всех остальных в отдельное пространство имён компоновщика (т. е., они не внедряются вместо обычных привязываемых символов, которые могли бы быть в этом процессе). Эти объекты можно использовать для контрольной проверки операций динамического компоновщика. Элементы в списке разделяются двоеточиями и двоеточия нельзя экранировать.

source: B<LD_AUDIT> is ignored in secure-execution mode.
ru: Переменная B<LD_AUDIT> игнорируется в режиме безопасного выполнения.

source: The dynamic linker will notify the audit shared objects at so-called auditing checkpoints\(emfor example, loading a new shared object, resolving a symbol, or calling a symbol from another shared object\(emby calling an appropriate function within the audit shared object. For details, see B<rtld-audit>(7). The auditing interface is largely compatible with that provided on Solaris, as described in its I<Linker and Libraries Guide>, in the chapter I<Runtime Linker Auditing Interface>.
ru: Динамический компоновщик будет уведомлять общие объекты контроля в так называемых точках контроля — например, при загрузке нового общего объекта, поиске символа или при вызове символа из другого динамического объекта — вызывая соответствующую функцию из общего объекта контроля. Подробности смотрите в B<rtld-audit>(7). Интерфейс контроля в значительной степени совместим с представленным в Solaris, описан в его I<Руководстве по компоновщику и библиотекам> (I<Linker and Libraries Guide>) в главе I<Интерфейс контроля компоновщика во время выполнения> (I<Runtime Linker Auditing Interface>).

source: Within the names specified in the B<LD_AUDIT> list, the dynamic linker understands the tokens I<$ORIGIN>, I<$LIB>, and I<$PLATFORM> (or the versions using curly braces around the names) as described above in I<Rpath token expansion>. (See also the discussion of quoting under the description of B<LD_LIBRARY_PATH>.)
ru: Внутри имён, указанных в списке B<LD_AUDIT>, динамический компоновщик раскрывает токены I<$ORIGIN>, I<$LIB> и I<$PLATFORM> (или версии, использующие фигурные скобки вокруг имён) как описано выше в разделе I<Раскрытие токена rpath> (также смотрите описание цитирования в B<LD_LIBRARY_PATH>).
