Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: Extended attributes are not supported by the filesystem, or are disabled.
ru: Расширенные атрибуты не поддерживаются файловой системой или отключены.

source: The I<size> of the I<list> buffer is too small to hold the result.
ru: Размер I<size> буфера I<list> слишком мал для хранения результата.

source: In addition, the errors documented in B<stat>(2) can also occur.
ru: Также могут возникать ошибки, описанные в B<stat>(2).

source: These system calls have been available on Linux since kernel 2.4; glibc support is provided since version 2.3.
ru: Данные системные вызовы доступны в Linux начиная с ядра версии 2.4; поддержка в glibc появилась в версии 2.3.

source: These system calls are Linux-specific.
ru: Данные системные вызовы есть только в Linux.

source: As noted in B<xattr>(7), the VFS imposes a limit of 64\ kB on the size of the extended attribute name list returned by B<listxattr>(7). If the total size of attribute names attached to a file exceeds this limit, it is no longer possible to retrieve the list of attribute names.
ru: Как упоминалось в B<xattr>(7), в VFS есть ограничение в 64\ КБ на размер списка имён расширенных атрибутов, возвращаемый B<listxattr>(7). Если полный размер имён атрибутов, прикреплённых к файлу, превышает это ограничение, то становится невозможно получить список имён атрибутов.

source: The following program demonstrates the usage of B<listxattr>() and B<getxattr>(2). For the file whose pathname is provided as a command-line argument, it lists all extended file attributes and their values.
ru: В следующей программе показано использование B<listxattr>() и B<getxattr>(2). Для файла, чьё имя указывается параметром в командной строке, выводится список файловых атрибутов и их значения.

source: To keep the code simple, the program assumes that attribute keys and values are constant during the execution of the program. A production program should expect and handle changes during execution of the program. For example, the number of bytes required for attribute keys might increase between the two calls to B<listxattr>(). An application could handle this possibility using a loop that retries the call (perhaps up to a predetermined maximum number of attempts) with a larger buffer each time it fails with the error B<ERANGE>. Calls to B<getxattr>(2) could be handled similarly.
ru: Для упрощения кода при выполнении программы ключи атрибутов и значения считаются константами. В реальной программе нужно учитывать и обрабатывать изменения при выполнении программы. Например, количество байт, необходимое для ключей атрибутов, может увеличиваться между двумя вызовами B<listxattr>(). В приложении нужно предусмотреть эту возможность с помощью цикла, который повторяет вызов (возможно, ввести задаваемое максимальное количество попыток) с большим буфером каждый раз при ошибке B<ERANGE>. Вызовы B<getxattr>(2) могут обрабатываться схожим образом.

source: The following output was recorded by first creating a file, setting some extended file attributes, and then listing the attributes with the example program.
ru: В следующем выводе был создан файл, заданы некоторые расширенные файловые атрибуты и показан вывод атрибутов с помощью программы-примера.

source: Example output
ru: Пример вывода

source: $ B<touch /tmp/foo> $ B<setfattr -n user.fred -v chocolate /tmp/foo> $ B<setfattr -n user.frieda -v bar /tmp/foo> $ B<setfattr -n user.empty /tmp/foo> $ B<./listxattr /tmp/foo> user.fred: chocolate user.frieda: bar user.empty: E<lt>no valueE<gt>
ru: $ B<touch /tmp/foo> $ B<setfattr -n user.fred -v chocolate /tmp/foo> $ B<setfattr -n user.frieda -v bar /tmp/foo> $ B<setfattr -n user.empty /tmp/foo> $ B<./listxattr /tmp/foo> user.fred: chocolate user.frieda: bar user.empty: E<lt>нет значенияE<gt>

source: Program source (listxattr.c)
ru: Исходный код программы (listxattr.c)

source: if (argc != 2) { fprintf(stderr, "Usage: %s path\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s путь\en", argv[0]); exit(EXIT_FAILURE); }

source: /* * Determine the length of the buffer needed. */ buflen = listxattr(argv[1], NULL, 0); if (buflen == -1) { perror("listxattr"); exit(EXIT_FAILURE); } if (buflen == 0) { printf("%s has no attributes.\en", argv[1]); exit(EXIT_SUCCESS); }
ru: /* * Определение длины буфера. */ buflen = listxattr(argv[1], NULL, 0); if (buflen == -1) { perror("listxattr"); exit(EXIT_FAILURE); } if (buflen == 0) { printf("%s не имеет атрибутов.\en", argv[1]); exit(EXIT_SUCCESS); }

source: /* * Allocate the buffer. */ buf = malloc(buflen); if (buf == NULL) { perror("malloc"); exit(EXIT_FAILURE); }
ru: /* * Выделение буфера. */ buf = malloc(buflen); if (buf == NULL) { perror("malloc"); exit(EXIT_FAILURE); }

source: /* * Copy the list of attribute keys to the buffer. */ buflen = listxattr(argv[1], buf, buflen); if (buflen == -1) { perror("listxattr"); exit(EXIT_FAILURE); }
ru: /* * Копирование списка ключей атрибутов в буфер. */ buflen = listxattr(argv[1], buf, buflen); if (buflen == -1) { perror("listxattr"); exit(EXIT_FAILURE); }

source: /* * Loop over the list of zero terminated strings with the * attribute keys. Use the remaining buffer length to determine * the end of the list. */ key = buf; while (buflen E<gt> 0) {
ru: /* * Циклический проход по списку строк (завершающихся 0) с * ключей атрибутов. Используется оставшаяся длина буфера для * определения конца списка. */ key = buf; while (buflen E<gt> 0) {

source: /* * Output attribute key. */ printf("%s: ", key);
ru: /* * Вывод ключа атрибута. */ printf("%s: ", key);

source: /* * Determine length of the value. */ vallen = getxattr(argv[1], key, NULL, 0); if (vallen == -1) perror("getxattr");
ru: /* * Определение длины значения. */ vallen = getxattr(argv[1], key, NULL, 0); if (vallen == -1) perror("getxattr");

source: /* * Allocate value buffer. * One extra byte is needed to append 0x00. */ val = malloc(vallen + 1); if (val == NULL) { perror("malloc"); exit(EXIT_FAILURE); }
ru: /* * Выделение буфера под значения. * Один доп. байт нужен для добавляемого 0x00. */ val = malloc(vallen + 1); if (val == NULL) { perror("malloc"); exit(EXIT_FAILURE); }

source: /* * Copy value to buffer. */ vallen = getxattr(argv[1], key, val, vallen); if (vallen == -1) perror("getxattr"); else { /* * Output attribute value. */ val[vallen] = 0; printf("%s", val); }
ru: /* * Копирование значения в буфер. */ vallen = getxattr(argv[1], key, val, vallen); if (vallen == -1) perror("getxattr"); else { /* * Вывод значения атрибута. */ val[vallen] = 0; printf("%s", val); }

source: free(val); } else if (vallen == 0) printf("E<lt>no valueE<gt>");
ru: free(val); } else if (vallen == 0) printf("E<lt>нет значенияE<gt>");

source: /* * Forward to next attribute key. */ keylen = strlen(key) + 1; buflen -= keylen; key += keylen; }
ru: /* * Переход к следующему ключу атрибута. */ keylen = strlen(key) + 1; buflen -= keylen; key += keylen; }

source: listen - listen for connections on a socket
ru: listen - слушать соединения на сокете

source: B<#include E<lt>sys/types.hE<gt>> /* See NOTES */ B<#include E<lt>sys/socket.hE<gt>>
ru: B<#include E<lt>sys/types.hE<gt>> /* смотрите ЗАМЕЧАНИЯ */ B<#include E<lt>sys/socket.hE<gt>>

source: B<listen>() marks the socket referred to by I<sockfd> as a passive socket, that is, as a socket that will be used to accept incoming connection requests using B<accept>(2).
ru: Вызов B<listen>() помечает сокет, указанный в I<sockfd> как пассивный, то есть как сокет, который будет использоваться для приёма запросов входящих соединений с помощью B<accept>(2).

source: The I<sockfd> argument is a file descriptor that refers to a socket of type B<SOCK_STREAM> or B<SOCK_SEQPACKET>.
ru: Аргумент I<sockfd> является файловым дескриптором, который ссылается на сокет типа B<SOCK_STREAM> или B<SOCK_SEQPACKET>.

source: The I<backlog> argument defines the maximum length to which the queue of pending connections for I<sockfd> may grow. If a connection request arrives when the queue is full, the client may receive an error with an indication of B<ECONNREFUSED> or, if the underlying protocol supports retransmission, the request may be ignored so that a later reattempt at connection succeeds.
ru: Аргумент I<backlog> задает максимальный размер, до которого может расти очередь ожидающих соединений у I<sockfd>. Если приходит запрос на соединение, а очередь полна, то клиент может получить ошибку с указание B<ECONNREFUSED> или, если низлежащий протокол поддерживает повторную передачу, запрос может быть игнорирован, чтобы попытаться соединиться позднее.

source: Another socket is already listening on the same port.
ru: Другой сокет уже слушает на этом же порту.

source: (Internet domain sockets) The socket referred to by I<sockfd> had not previously been bound to an address and, upon attempting to bind it to an ephemeral port, it was determined that all port numbers in the ephemeral port range are currently in use. See the discussion of I</proc/sys/net/ipv4/ip_local_port_range> in B<ip>(7).
ru: (доменные сокеты Интернета) Сокет, указанный I<sockfd>, ранее не был привязан к адресу и при попытке привязать его к эфемеридному порту, было определено, что все номера в диапазоне эфемеридных портов уже используются. Смотрите обсуждение I</proc/sys/net/ipv4/ip_local_port_range> в B<ip>(7).

source: The argument I<sockfd> is not a valid file descriptor.
ru: Аргумент I<sockfd> не является допустимым файловым дескриптором.

source: The file descriptor I<sockfd> does not refer to a socket.
ru: Файловый дескриптор I<sockfd> указывает не на каталог.

source: The socket is not of a type that supports the B<listen>() operation.
ru: Тип сокета не поддерживает операцию B<listen>().

source: POSIX.1-2001, POSIX.1-2008, 4.4BSD (B<listen>() first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, 4.4BSD (вызов B<listen>() впервые появился в 4.2BSD).

source: To accept connections, the following steps are performed:
ru: Для принятия соединений должны быть выполнены следующие шаги:

source: A socket is created with B<socket>(2).
ru: Создать сокет с помощью B<socket>(2).

source: The socket is bound to a local address using B<bind>(2), so that other sockets may be B<connect>(2)ed to it.
ru: Привязать сокет к локальному адресу с помощью B<bind>(2) для того, чтобы к нему можно было подключать другие сокеты с помощью B<connect>(2).

source: A willingness to accept incoming connections and a queue limit for incoming connections are specified with B<listen>().
ru: Подготовиться к приёму входящий подключений и настроить размер очереди входящих подключений с помощью B<listen>().

source: Connections are accepted with B<accept>(2).
ru: Принять подключения с помощью B<accept>(2).

source: POSIX.1 does not require the inclusion of I<E<lt>sys/types.hE<gt>>, and this header file is not required on Linux. However, some historical (BSD) implementations required this header file, and portable applications are probably wise to include it.
ru: В POSIX.1 не требуется включение I<E<lt>sys/types.hE<gt>>, и этот заголовочный файл не требуется в Linux. Однако, для некоторых старых реализаций (BSD) требует данный файл, и в переносимых приложениях для предосторожности, вероятно, лучше его указать.

source: The behavior of the I<backlog> argument on TCP sockets changed with Linux 2.2. Now it specifies the queue length for I<completely> established sockets waiting to be accepted, instead of the number of incomplete connection requests. The maximum length of the queue for incomplete sockets can be set using I</proc/sys/net/ipv4/tcp_max_syn_backlog>. When syncookies are enabled there is no logical maximum length and this setting is ignored. See B<tcp>(7) for more information.
ru: Поведение аргумента I<backlog> на TCP-сокетах изменилось в Linux 2.2. Теперь вместо количества неоконченных запросов на соединение он задает размер очереди для полностью (I<completely>) установленных соединений, ожидающих, пока процесс примет их. Максимальный размер очереди для неполных сокетов может быть задан через I</proc/sys/net/ipv4/tcp_max_syn_backlog>. Когда разрешено использование syncookies, логический максимальный размер отсутствует и эта настройка игнорируется. Подробности см. в B<tcp>(7).

source: If the I<backlog> argument is greater than the value in I</proc/sys/net/core/somaxconn>, then it is silently truncated to that value; the default value in this file is 128. In kernels before 2.4.25, this limit was a hard coded value, B<SOMAXCONN>, with the value 128.
ru: Если значение аргумента I<backlog> больше, чем значение I</proc/sys/net/core/somaxconn>, то он без предупреждения обрезается до этой величины; значение по умолчанию в данном файле равно 128. В ядрах до версии 2.4.25, этот предел указывался в константе B<SOMAXCONN> и имел значение 128.

source: See B<bind>(2).
ru: См. B<bind>(2).

source: lseek - reposition read/write file offset
ru: lseek - изменяет файловое смещение, используемое при чтении/записи

source: B<lseek>() repositions the file offset of the open file description associated with the file descriptor I<fd> to the argument I<offset> according to the directive I<whence> as follows:
ru: Вызов B<lseek>() изменяет файловое смещение в описании открытого файла, связанного с файловым дескрипторов I<fd>, на значение аргумента I<offset> в соответствии с директивой I<whence>, которая может принимать одно из следующих значений:

source: The file offset is set to I<offset> bytes.
ru: Установить файловое смещение равным I<offset> (в байтах).

source: The file offset is set to its current location plus I<offset> bytes.
ru: Установить файловое смещение равным текущему положению плюс I<offset> (в байтах).

source: The file offset is set to the size of the file plus I<offset> bytes.
ru: Установить файловое смещение равным размеру файла плюс I<offset> (в байтах).

source: B<lseek>() allows the file offset to be set beyond the end of the file (but this does not change the size of the file). If data is later written at this point, subsequent reads of the data in the gap (a "hole") return null bytes (\(aq\e0\(aq) until data is actually written into the gap.
ru: Вызов B<lseek>() позволяет задавать смещение, которое будет находиться за существующим концом файла (но это не изменяет размер файла). Если позднее по этому смещению будут записаны данные, то последующее чтение в промежутке («дырке») от конца файла до этого смещения, будет возвращать нулевые байты (\(aq\e0\(aq), пока в этот промежуток действительно не будут записаны данные.

source: Seeking file data and holes
ru: Перемещения по данным файла и промежутки

source: Since version 3.1, Linux supports the following additional values for I<whence>:
ru: Начиная с версии 3.1, в Linux поддерживаются следующие дополнительные значения I<whence>:

source: Adjust the file offset to the next location in the file greater than or equal to I<offset> containing data. If I<offset> points to data, then the file offset is set to I<offset>.
ru: Подогнать файловое смещение к следующему расположению, большему или равному значению I<offset>, по которому в файле есть данные. Если значение I<offset> указывает на данные, то файловое смещение устанавливается в I<offset>.

source: Adjust the file offset to the next hole in the file greater than or equal to I<offset>. If I<offset> points into the middle of a hole, then the file offset is set to I<offset>. If there is no hole past I<offset>, then the file offset is adjusted to the end of the file (i.e., there is an implicit hole at the end of any file).
ru: Подогнать файловое смещение к следующему промежутку, большему или равному значению I<offset>. Если значение I<offset> указывает в середину промежутка, то файловое смещение устанавливается в I<offset>. Если перед I<offset> нет промежутка, то файловое смещение подгоняется к концу файла (т.е., это скрытый промежуток, который есть в конце любого файла).

source: In both of the above cases, B<lseek>() fails if I<offset> points past the end of the file.
ru: В обоих, показанных выше, случаях, B<lseek>() завершится с ошибкой, если I<offset> указывает за конец файла.

source: These operations allow applications to map holes in a sparsely allocated file. This can be useful for applications such as file backup tools, which can save space when creating backups and preserve holes, if they have a mechanism for discovering holes.
ru: Эти операции позволяют приложениям отображать промежутки в разреженно выделенном файле. Это может быть полезно для таких приложений, как инструменты резервного копирования файлов, которые могут выиграть в месте при создании резервных копий и сохранить промежутки, если у них есть механизм их обнаружения.

source: For the purposes of these operations, a hole is a sequence of zeros that (normally) has not been allocated in the underlying file storage. However, a filesystem is not obliged to report holes, so these operations are not a guaranteed mechanism for mapping the storage space actually allocated to a file. (Furthermore, a sequence of zeros that actually has been written to the underlying storage may not be reported as a hole.) In the simplest implementation, a filesystem can support the operations by making B<SEEK_HOLE> always return the offset of the end of the file, and making B<SEEK_DATA> always return I<offset> (i.e., even if the location referred to by I<offset> is a hole, it can be considered to consist of data that is a sequence of zeros).
ru: Для поддержки этих операций промежуток представляется последовательностью нулей, которые (обычно) физически не занимают места на носителе. Однако файловая система может не сообщать о промежутках, поэтому эти операции — не гарантируемый механизм отображения пространства носителя в файл (более того, последовательность нулей, которая на самом деле была записана на носитель, может не посчитаться промежутком). В простейшей реализации, файловая система может поддержать эти операции так: при B<SEEK_HOLE> всегда возвращать смещение конца файла, а при B<SEEK_DATA> всегда возвращать значение I<offset> (т.е., даже если расположение, указанное I<offset>, является промежутком, это можно считать данными, состоящими из последовательности нулей).

source: The B<_GNU_SOURCE> feature test macro must be defined in order to obtain the definitions of B<SEEK_DATA> and B<SEEK_HOLE> from I<E<lt>unistd.hE<gt>>.
ru: Чтобы получить определения B<SEEK_DATA> и B<SEEK_HOLE> из I<E<lt>unistd.hE<gt>>, нужно задать макрос тестирования свойств B<_GNU_SOURCE>.

source: The B<SEEK_HOLE> and B<SEEK_DATA> operations are supported for the following filesystems:
ru: Операции B<SEEK_HOLE> и B<SEEK_DATA> поддерживаются следующими файловыми системами:

source: Btrfs (since Linux 3.1)
ru: Btrfs (начиная с Linux 3.1)

source: OCFS (since Linux 3.2)
ru: OCFS (начиная с Linux 3.2)

source: XFS (since Linux 3.5)
ru: XFS (начиная с Linux 3.5)

source: ext4 (since Linux 3.8)
ru: ext4 (начиная с Linux 3.8)

source: B<tmpfs>(5) (since Linux 3.8)
ru: B<tmpfs>(5) (начиная с Linux 3.8)

source: NFS (since Linux 3.18)
ru: NFS (начиная с Linux 3.18)

source: FUSE (since Linux 4.5)
ru: FUSE (начиная с Linux 4.5)

source: Upon successful completion, B<lseek>() returns the resulting offset location as measured in bytes from the beginning of the file. On error, the value I<(off_t)\ -1> is returned and I<errno> is set to indicate the error.
ru: При успешном выполнении B<lseek>() возвращает получившееся в результате смещение в байтах от начала файла. При ошибке возвращается значение I<(off_t)\ -1> и в I<errno> записывается код ошибки.

source: I<whence> is not valid. Or: the resulting file offset would be negative, or beyond the end of a seekable device.
ru: Неправильное значение I<whence>. Получается, что возвращаемое файловое смещение стало бы отрицательным или указывало бы за конец поверхности носителя.

source: I<whence> is B<SEEK_DATA> or B<SEEK_HOLE>, and the file offset is beyond the end of the file.
ru: Значение I<whence> равно B<SEEK_DATA> или B<SEEK_HOLE>, а файловое смещение указывает за конец файла.

source: The resulting file offset cannot be represented in an I<off_t>.
ru: Результирующие файловое смещение не может быть представлено типом I<off_t>.

source: I<fd> is associated with a pipe, socket, or FIFO.
ru: Значение I<fd> связано с каналом, сокетом или FIFO.

source: B<SEEK_DATA> and B<SEEK_HOLE> are nonstandard extensions also present in Solaris, FreeBSD, and DragonFly BSD; they are proposed for inclusion in the next POSIX revision (Issue 8).
ru: Значения B<SEEK_DATA> и B<SEEK_HOLE> являются нестандартными расширениями, которые также есть в Solaris, FreeBSD и DragonFly BSD; их предложили включить в следующую редакцию POSIX (выпуск 8).

source: See B<open>(2) for a discussion of the relationship between file descriptors, open file descriptions, and files.
ru: Описание взаимосвязи между файловыми дескрипторами, открытыми файловыми описаниями и файлами смотрите в B<open>(2).

source: If the B<O_APPEND> file status flag is set on the open file description, then a B<write>(2) I<always> moves the file offset to the end of the file, regardless of the use of B<lseek>().
ru: Если установлен флаг состояние файла B<O_APPEND> в открытом файловом описании, то B<write>(2) I<всегда> перемещает файловое смещение в конец файла, независимо от использования B<lseek>().

source: The I<off_t> data type is a signed integer data type specified by POSIX.1.
ru: Тип данных I<off_t> представляет собой знаковый целочисленный тип, определён в POSIX.1.

source: Some devices are incapable of seeking and POSIX does not specify which devices must support B<lseek>().
ru: Некоторые устройства не могут выполнять смещения и в POSIX не указано какие устройства должны поддерживать B<lseek>().

source: On Linux, using B<lseek>() on a terminal device fails with the error B<ESPIPE>.
ru: В Linux при использовании B<lseek>() на устройствах терминалов возвращается ошибка B<ESPIPE>.

source: lookup_dcookie - return a directory entry's path
ru: lookup_dcookie - возвращает путь элемента каталога

source: Look up the full path of the directory entry specified by the value I<cookie>. The cookie is an opaque identifier uniquely identifying a particular directory entry. The buffer given is filled in with the full path of the directory entry.
ru: Ищет полный путь элемента каталога, указанного в параметре I<cookie>. Маркёр (cookie) представляет собой простейший идентификатор, уникально определяющий отдельный элемент каталога. Указанный буфер заполняется полным путём элемента каталога.

source: For B<lookup_dcookie>() to return successfully, the kernel must still hold a cookie reference to the directory entry.
ru: Для успешного выполнения B<lookup_dcookie>() ядро должно удерживать ссылку маркёра на элемент каталога.

source: On success, B<lookup_dcookie>() returns the length of the path string copied into the buffer. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении B<lookup_dcookie>() возвращается длина строки пути, скопированного в буфер. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: The buffer was not valid.
ru: Неверный буфер.

source: The kernel has no registered cookie/directory entry mappings at the time of lookup, or the cookie does not refer to a valid directory entry.
ru: При поиске в ядре не было зарегистрированных отображённых элементов маркёра/каталога или маркёр ссылается на некорректный элемент каталога.

source: The name could not fit in the buffer.
ru: Имя не помещается в буфере.

source: The kernel could not allocate memory for the temporary buffer holding the path.
ru: Ядро не может выделить память для временного буфера для пути.

source: The process does not have the capability B<CAP_SYS_ADMIN> required to look up cookie values.
ru: Процесс не имеет мандата B<CAP_SYS_ADMIN> для поиска значений маркёра.
