Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: Since glibc 2.13, in secure-execution mode, names in the audit list that contain slashes are ignored, and only shared objects in the standard search directories that have the set-user-ID mode bit enabled are loaded.
ru: Начиная с glibc 2.13 в режиме безопасного выполнения имена в списке контрольной проверки, содержащие символы косой черты, игнорируются, и загружаются только общие объекты с включённым битом режима set-user-ID из стандартных каталогов поиска.

source: B<LD_BIND_NOT> (since glibc 2.1.95)
ru: B<LD_BIND_NOT> (начиная с glibc 2.1.95)

source: If this environment variable is set to a nonempty string, do not update the GOT (global offset table) and PLT (procedure linkage table) after resolving a function symbol. By combining the use of this variable with B<LD_DEBUG> (with the categories I<bindings> and I<symbols>), one can observe all run-time function bindings.
ru: Если эта переменная окружения не равна пустой строке, то не обновлять GOT (global offset table — таблицу глобальных перемещений) и PLT (procedure linkage table — таблицу компоновки процедур) после определения символа функции. Совместное использовав эту переменную с B<LD_DEBUG> (с категориями I<bindings> и I<symbols>), можно увидеть все привязки функции во время выполнения.

source: B<LD_DEBUG> (since glibc 2.1)
ru: B<LD_DEBUG> (начиная с glibc 2.1)

source: Output verbose debugging information about operation of the dynamic linker. The content of this variable is one of more of the following categories, separated by colons, commas, or (if the value is quoted) spaces:
ru: Выводить подробную отладочную информацию об операции динамического компоновщика. Содержимое этой переменной равно одной или нескольким следующим категориям, разделённым двоеточием, запятой или (если значение в кавычках) пробелом:

source: Specifying I<help> in the value of this variable does not run the specified program, and displays a help message about which categories can be specified in this environment variable.
ru: Слово I<help> в значении этой переменной заставляет не выполнять указанную программу и выводит справочное сообщение со списком категорий, которые можно задать в этой переменной окружения.

source: Print all debugging information (except I<statistics> and I<unused>; see below).
ru: Показать всю отладочную информацию (за исключением I<statistics> и I<unused>; смотрите ниже).

source: Display information about which definition each symbol is bound to.
ru: Показать информацию о том, какое определение привязано к каждому символу.

source: Display progress for input file.
ru: Показать ход обработки входного файла.

source: Display library search paths.
ru: Показать пути поиска библиотек.

source: Display relocation processing.
ru: Показать обработку перемещений.

source: Display scope information.
ru: Показать информацию об областях.

source: Display relocation statistics.
ru: Показать статистику по перемещениям.

source: Display search paths for each symbol look-up.
ru: Показать пути поиска при нахождении каждого символа.

source: Determine unused DSOs.
ru: Определить неиспользуемые DSO.

source: Display version dependencies.
ru: Показать зависимости от версий.

source: Since glibc 2.3.4, B<LD_DEBUG> is ignored in secure-execution mode, unless the file I</etc/suid-debug> exists (the content of the file is irrelevant).
ru: Начиная с glibc 2.3.4, B<LD_DEBUG> игнорируется в режиме безопасного выполнения, если существует файл I</etc/suid-debug> (содержимое файла не важно).

source: B<LD_DEBUG_OUTPUT> (since glibc 2.1)
ru: B<LD_DEBUG_OUTPUT> (начиная с glibc 2.1)

source: By default, B<LD_DEBUG> output is written to standard error. If B<LD_DEBUG_OUTPUT> is defined, then output is written to the pathname specified by its value, with the suffix "." (dot) followed by the process ID appended to the pathname.
ru: По умолчанию вывод B<LD_DEBUG> записывается в стандартный поток ошибок. Если B<LD_DEBUG_OUTPUT> определена, то вывод записывается в указанной значением файл с добавлением суффикса «.» (точка) ID процесса.

source: B<LD_DEBUG_OUTPUT> is ignored in secure-execution mode.
ru: Переменная B<LD_DEBUG_OUTPUT> игнорируется в режиме безопасного выполнения.

source: B<LD_DYNAMIC_WEAK> (since glibc 2.1.91)
ru: B<LD_DYNAMIC_WEAK> (начиная с glibc 2.1.91)

source: By default, when searching shared libraries to resolve a symbol reference, the dynamic linker will resolve to the first definition it finds.
ru: По умолчанию при поиске общих библиотек для разрешения символьной ссылки динамический компоновщик будет использовать первое найденное.

source: Old glibc versions (before 2.2), provided a different behavior: if the linker found a symbol that was weak, it would remember that symbol and keep searching in the remaining shared libraries. If it subsequently found a strong definition of the same symbol, then it would instead use that definition. (If no further symbol was found, then the dynamic linker would use the weak symbol that it initially found.)
ru: В старых версией glibc (до 2.2) было другое поведение: если компоновщик определяет, что символ слабый, то он запоминает этот символ и продолжает поиск в оставшихся общих библиотеках. Если в последствии находится строгое определение того же символа, то он используется вместо запомненного (если больше символов не нашлось, то динамический компоновщик использует слабый символ, который был найден раньше).

source: The old glibc behavior was nonstandard. (Standard practice is that the distinction between weak and strong symbols should have effect only at static link time.) In glibc 2.2, the dynamic linker was modified to provide the current behavior (which was the behavior that was provided by most other implementations at that time).
ru: Поведение старой glibc является нестандартным (стандартной практикой является учёт различия слабых и строгих символов только в момент статической компоновки). Текущее поведение динамического компоновщика появилось в glibc 2.2 (такое поведение предоставлялось в то время большинством других реализаций).

source: Defining the B<LD_DYNAMIC_WEAK> environment variable (with any value) provides the old (nonstandard) glibc behavior, whereby a weak symbol in one shared library may be overridden by a strong symbol subsequently discovered in another shared library. (Note that even when this variable is set, a strong symbol in a shared library will not override a weak definition of the same symbol in the main program.)
ru: Создание переменной окружения B<LD_DYNAMIC_WEAK> (с любым значением) включает старое (нестандартное) поведение glibc, тем самым, слабые символы одной общей библиотеки могут заменяться строгими символами, обнаруженными в другой библиотеке (заметим, что даже когда эта переменная установлена, строгие символы общей библиотеки не заменят слабые определения того же символа в основной программе).

source: Since glibc 2.3.4, B<LD_DYNAMIC_WEAK> is ignored in secure-execution mode.
ru: Начиная с glibc 2.3.4, B<LD_DYNAMIC_WEAK> игнорируется в режиме безопасного выполнения.

source: B<LD_HWCAP_MASK> (since glibc 2.1)
ru: B<LD_HWCAP_MASK> (начиная с glibc 2.1)

source: Mask for hardware capabilities.
ru: Маска для совместимости с аппаратными возможностями.

source: B<LD_ORIGIN_PATH> (since glibc 2.1)
ru: B<LD_ORIGIN_PATH> (начиная с glibc 2.1)

source: Path where the binary is found.
ru: Путь, где находится двоичный файл.

source: Since glibc 2.4, B<LD_ORIGIN_PATH> is ignored in secure-execution mode.
ru: Начиная с glibc 2.4, B<LD_ORIGIN_PATH> игнорируется в режиме безопасного выполнения.

source: B<LD_POINTER_GUARD> (glibc from 2.4 to 2.22)
ru: B<LD_POINTER_GUARD> (в glibc с 2.4 по 2.22)

source: Set to 0 to disable pointer guarding. Any other value enables pointer guarding, which is also the default. Pointer guarding is a security mechanism whereby some pointers to code stored in writable program memory (return addresses saved by B<setjmp>(3) or function pointers used by various glibc internals) are mangled semi-randomly to make it more difficult for an attacker to hijack the pointers for use in the event of a buffer overrun or stack-smashing attack. Since glibc 2.23, B<LD_POINTER_GUARD> can no longer be used to disable pointer guarding, which is now always enabled.
ru: Значение 0 отключает защиту указателя. Любое другое значение включает защиту указателя, что является действием по умолчанию. Защита указателя — это механизм безопасности, в результате которого некоторые указатели на код, хранящийся в перезаписываемой памяти программы (адреса возврата, сохраняемые B<setjmp>(3) или указатели на функцию, используемые различными внутренними функциями glibc), искажаются полупроизвольным образом, что затрудняет атакующему подбор указателей для проведения атак переполнения буфера или срыва стека. Начиная с glibc 2.23, B<LD_POINTER_GUARD> можно больше не использовать для отключения защиты указателя, так как теперь она всегда включена.

source: B<LD_PROFILE> (since glibc 2.1)
ru: B<LD_PROFILE> (начиная с glibc 2.1)

source: The name of a (single) shared object to be profiled, specified either as a pathname or a soname. Profiling output is appended to the file whose name is: "I<$LD_PROFILE_OUTPUT>/I<$LD_PROFILE>.profile".
ru: В переменной задаётся имя динамического объекта (одного) для профилирования, в виде пути или имени so. Результат профилирования записывается в файл с именем: «I<$LD_PROFILE_OUTPUT>/I<$LD_PROFILE>».

source: Since glibc 2.2.5, B<LD_PROFILE> is ignored in secure-execution mode.
ru: Начиная с glibc 2.2.5, B<LD_PROFILE> игнорируется в режиме безопасного выполнения.

source: B<LD_PROFILE_OUTPUT> (since glibc 2.1)
ru: B<LD_PROFILE_OUTPUT> (начиная с glibc 2.1)

source: Directory where B<LD_PROFILE> output should be written. If this variable is not defined, or is defined as an empty string, then the default is I</var/tmp>.
ru: Каталог, куда будет сохраняться результат работы с B<LD_PROFILE>. Если эта переменная не определена или её значение равно пустой строке, то по умолчанию результат будет сохранён в каталог I</var/tmp>.

source: B<LD_PROFILE_OUTPUT> is ignored in secure-execution mode; instead I</var/profile> is always used. (This detail is relevant only before glibc 2.2.5, since in later glibc versions, B<LD_PROFILE> is also ignored in secure-execution mode.)
ru: Переменная B<LD_PROFILE_OUTPUT> игнорируется в режиме безопасного выполнения; вместо неё всегда используется I</var/profile> (это относится только к glibc до версии 2.2.5, так как в более новых версиях B<LD_PROFILE> также игнорируется в режиме безопасного выполнения).

source: B<LD_SHOW_AUXV> (since glibc 2.1)
ru: B<LD_SHOW_AUXV> (начиная с glibc 2.1)

source: If this environment variable is defined (with any value), show the auxiliary array passed up from the kernel (see also B<getauxval>(3)).
ru: Если эта переменная окружения определена (с любым значением), то показывается вспомогательный массив, переданный из ядра (смотрите также B<getauxval>(3)).

source: Since glibc 2.3.4, B<LD_SHOW_AUXV> is ignored in secure-execution mode.
ru: Начиная с glibc 2.3.4, B<LD_SHOW_AUXV> игнорируется в режиме безопасного выполнения.

source: B<LD_TRACE_PRELINKING> (since glibc 2.4)
ru: B<LD_TRACE_PRELINKING> (начиная с glibc 2.4)

source: If this environment variable is defined, trace prelinking of the object whose name is assigned to this environment variable. (Use B<ldd>(1) to get a list of the objects that might be traced.) If the object name is not recognized, then all prelinking activity is traced.
ru: Если эта переменная окружения определена, то выполнять трассировку объекта предварительной компоновки, чьё имя указано в этой переменной окружения (для получения списка трассируемых объектов используйте B<ldd>(1)). Если имя объекта не распознано, то трассируется все действия предварительной компоновки (prelinking activity).

source: B<LD_USE_LOAD_BIAS> (since glibc 2.3.3)
ru: B<LD_USE_LOAD_BIAS> (начиная с glibc 2.3.3)

source: By default (i.e., if this variable is not defined), executables and prelinked shared objects will honor base addresses of their dependent shared objects and (nonprelinked) position-independent executables (PIEs) and other shared objects will not honor them. If B<LD_USE_LOAD_BIAS> is defined with the value 1, both executables and PIEs will honor the base addresses. If B<LD_USE_LOAD_BIAS> is defined with the value 0, neither executables nor PIEs will honor the base addresses.
ru: По умолчанию (т. е., если переменная не определена) исполняемые и предварительно скомпонованные объекты учитывают базовые адреса общих объектов, от которых они зависят, а (предварительно не скомпонованные) перемещаемые исполняемые (PIE) и другие общие объекты не учитывают их. Если переменной B<LD_USE_LOAD_BIAS> присвоено значение 1, то и исполняемые файлы, и PIE учитывают базовые адреса. Если значение переменной B<LD_USE_LOAD_BIAS> равно 0, то ни исполняемые файлы ни PIE не учитывают базовые адреса.

source: Since glibc 2.3.3, this variable is ignored in secure-execution mode.
ru: Начиная с glibc 2.3.3, данная переменная игнорируется в режиме безопасного выполнения.

source: B<LD_VERBOSE> (since glibc 2.1)
ru: B<LD_VERBOSE> (начиная с glibc 2.1)

source: If set to a nonempty string, output symbol versioning information about the program if the B<LD_TRACE_LOADED_OBJECTS> environment variable has been set.
ru: Если значение равно непустой строке, то выводится информация о символах программы (если также установлена переменная окружения B<LD_TRACE_LOADED_OBJECTS>).

source: B<LD_WARN> (since glibc 2.1.3)
ru: B<LD_WARN> (начиная с glibc 2.1.3)

source: If set to a nonempty string, warn about unresolved symbols.
ru: Если значение равно непустой строке, то выдаются предупреждения о ненайденных символах.

source: B<LD_PREFER_MAP_32BIT_EXEC> (x86-64 only; since glibc 2.23)
ru: B<LD_PREFER_MAP_32BIT_EXEC> (только для x86-64; начиная с glibc 2.23)

source: According to the Intel Silvermont software optimization guide, for 64-bit applications, branch prediction performance can be negatively impacted when the target of a branch is more than 4\ GB away from the branch. If this environment variable is set (to any value), the dynamic linker will first try to map executable pages using the B<mmap>(2) B<MAP_32BIT> flag, and fall back to mapping without that flag if that attempt fails. NB: MAP_32BIT will map to the low 2\ GB (not 4\ GB) of the address space.
ru: Согласно руководству по оптимизации ПО Intel Silvermont для 64-битных приложений, выполнение предсказания ветвления может отразиться негативным образом, если цель ветви находится дальше чем 4\ ГБ от ветви. Если эта переменная окружения установлена (любое значение), то динамический компоновщик сначала попытается отобразить исполняемые страницы с помощью B<mmap>(2) с флагом B<MAP_32BIT> и, если это не удастся, то выполнит отображение без флага. Примечание: с флагом MAP_32BIT отображение выполняется в нижние 2\ ГБ (не 4\ ГБ) адресного пространства.

source: Because B<MAP_32BIT> reduces the address range available for address space layout randomization (ASLR), B<LD_PREFER_MAP_32BIT_EXEC> is always disabled in secure-execution mode.
ru: Так как при B<MAP_32BIT> сокращается адресный диапазон, доступный для случайного выравнивания адресного пространства (ASLR), то B<LD_PREFER_MAP_32BIT_EXEC> всегда отключается в режиме безопасного выполнения.

source: a.out dynamic linker/loader
ru: динамический компоновщик/загрузчик a.out

source: ELF dynamic linker/loader
ru: динамический компоновщик/загрузчик ELF

source: File containing a compiled list of directories in which to search for shared objects and an ordered list of candidate shared objects. See B<ldconfig>(8).
ru: Файл с скомпилированным списком каталогов, в которых производится поиск общих объектов и сортированный список общих объектов-кандидатов. Смотрите B<ldconfig>(8).

source: File containing a whitespace-separated list of ELF shared objects to be loaded before the program. See the discussion of B<LD_PRELOAD> above. If both B<LD_PRELOAD> and I</etc/ld.so.preload> are employed, the libraries specified by B<LD_PRELOAD> are preloaded first. I</etc/ld.so.preload> has a system-wide effect, causing the specified libraries to be preloaded for all programs that are executed on the system. (This is usually undesirable, and is typically employed only as an emergency remedy, for example, as a temporary workaround to a library misconfiguration issue.)
ru: Файл со списком общих объектов ELF (через пробел), которые будут загружены перед программой. Смотрите описание B<LD_PRELOAD> выше. Если одновременно существуют B<LD_PRELOAD> и I</etc/ld.so.preload>, то библиотеки, указанные в B<LD_PRELOAD>, загружаются первыми. Файл I</etc/ld.so.preload> влияет на всю систему, вызывая предварительную загрузку указанных библиотек для всех программ, выполняемых в системе (обычно, это нежелательно и используется как спасательное средство, например, для временного обхода проблемы неправильно настроенных библиотек).

source: shared objects
ru: общие объекты

source: NOTES
ru: ЗАМЕЧАНИЯ

source: Hardware capabilities
ru: Аппаратные возможности

source: Some shared objects are compiled using hardware-specific instructions which do not exist on every CPU. Such objects should be installed in directories whose names define the required hardware capabilities, such as I</usr/lib/sse2/>. The dynamic linker checks these directories against the hardware of the machine and selects the most suitable version of a given shared object. Hardware capability directories can be cascaded to combine CPU features. The list of supported hardware capability names depends on the CPU. The following names are currently recognized:
ru: Некоторые общие объекты скомпилированы с использованием специальных аппаратных инструкций, которые существуют не в каждом ЦП. Такие объекты должны быть установлены в каталоги, чью имена (например, I</usr/lib/sse2/>) определяют требования к аппаратным возможностям. Динамический компоновщик проверяет эти каталоги учитывая аппаратуру машины и выбирает наиболее подходящую версию требуемого общего объекта. Каталоги аппаратных возможностей могут каскадироваться для объединения свойств ЦП. Список имён поддерживаемых аппаратных возможностей зависит от ЦП. В настоящее время распознаются следующие имена:

source: B<x86 (32-bit only)>
ru: B<x86 (только 32-битные)>

source: Linux User Manual
ru: Руководство пользователя Linux

source: localedef - compile locale definition files
ru: localedef - компилирует файлы определения локали

source: B<localedef> [I<options>] I<outputpath>
ru: B<localedef> [I<параметры>] I<путь_результата>

source: B<localedef --list-archive> [I<options>]
ru: B<localedef --list-archive> [I<параметры>]

source: B<localedef --delete-from-archive> [I<options>] I<localename> ...
ru: B<localedef --delete-from-archive> [I<параметры>] I<имя_локали> …

source: B<localedef --add-to-archive> [I<options>] I<compiledpath>
ru: B<localedef --add-to-archive> [I<параметры>] I<путь_скомпилированного>

source: The B<localedef> program reads the indicated I<charmap> and I<input> files, compiles them to a binary form quickly usable by the locale functions in the C library (B<setlocale>(3), B<localeconv>(3), etc.), and places the output in I<outputpath>.
ru: Программа B<localedef> читает заданные файлы I<карты символов> (charmap) и I<входные> файлы, компилирует их в двоичную форму для быстрого доступа из функций локали библиотеки C (B<setlocale>(3), B<localeconv>(3) и т. д.) и помещает результат в I<путь_результата>.

source: The I<outputpath> argument is interpreted as follows:
ru: Аргумент I<путь_результата> рассматривается следующим образом:

source: If I<outputpath> contains a slash character ('/'), it is interpreted as the name of the directory where the output definitions are to be stored. In this case, there is a separate output file for each locale category (I<LC_TIME>, I<LC_NUMERIC>, and so on).
ru: Если I<путь_результата> содержит косую черту («/»), то он считается именем каталога для хранения создаваемых определений. В этом случае создаётся отдельный файл результата для каждой категории локали (I<LC_TIME>, I<LC_NUMERIC> и так далее).

source: If the B<--no-archive> option is used, I<outputpath> is the name of a subdirectory in I</usr/lib/locale> where per-category compiled files are placed.
ru: Если указан параметр B<--no-archive>, то I<путь_результата> считается именем подкаталога в I</usr/lib/locale>, где размещены скопированные файлы для каждой категории.

source: Otherwise, I<outputpath> is the name of a locale and the compiled locale data is added to the archive file I</usr/lib/locale/locale-archive>. A locale archive is a memory-mapped file which contains all the system-provided locales; it is used by all localized programs when the environment variable B<LOCPATH> is not set.
ru: В противном случае, I<путь_результата> считается именем локали и компилируемые данные локали добавляются в файл архива I</usr/lib/locale/locale-archive>. Файл архива — это файл отображаемый в память, который содержит все локали системы; он используется всеми локализованными программами, если не установлена переменная окружения B<LOCPATH>.

source: In any case, B<localedef> aborts if the directory in which it tries to write locale files has not already been created.
ru: В любом случае, B<localedef> прекращает работу, если каталог, в который она пытается записать файлы локали, ещё не был создан.

source: If no I<charmapfile> is given, the value I<ANSI_X3.4-1968> (for ASCII) is used by default. If no I<inputfile> is given, or if it is given as a dash (-), B<localedef> reads from standard input.
ru: Если файл I<карты символов> не указан, то по умолчанию используется значение I<ANSI_X3.4-1968> (для ASCII). Если не указан I<входной> файл, или если вместо него указан перенос (-), то B<localedef> читает данные из стандартного входного потока.

source: Operation-selection options
ru: Параметры действия-выбора

source: A few options direct B<localedef> to do something other than compile locale definitions. Only one of these options should be used at a time.
ru: Некоторые параметры указывают B<localedef> сделать что-то другое, а не компилировать определения локали. Одновременно может быть указан только один такой параметр.

source: Delete the named locales from the locale archive file.
ru: Удалить заданную локаль из файла архива локалей.

source: List the locales contained in the locale archive file.
ru: Показать список локалей, содержащихся в файле архива локалей.

source: Add the I<compiledpath> directories to the locale archive file. The directories should have been created by previous runs of B<localedef>, using B<--no-archive>.
ru: Добавить каталоги I<путь_скомпилированного> файл архива локалей. Каталоги должны быть созданы ранее запускавшимся B<localedef> с параметром B<--no-archive>.

source: Other options
ru: Другие параметры

source: Some of the following options are sensible only for certain operations; generally, it should be self-evident which ones. Notice that B<-f> and B<-c> are reversed from what you might expect; that is, B<-f> is not the same as B<--force>.
ru: Следующие параметры имеют значение только для определённых операций; обычно, по названию понятно для каких. Заметим, что параметры B<-f> и B<-c> работают не так как можно ожидать, то есть B<-f> это не тоже самое что B<--force>.
