Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: If I<mode> is B<LIO_NOWAIT>, B<lio_listio>() returns 0 if all I/O operations are successfully queued. Otherwise, -1 is returned, and I<errno> is set to indicate the error.
ru: При значении I<mode> равным B<LIO_NOWAIT> функция B<lio_listio>() возвращает 0, если все операции ввода-вывода были поставлены в очередь. В противном случае возвращается -1 и в I<errno> содержится код ошибки.

source: If I<mode> is B<LIO_WAIT>, B<lio_listio>() returns 0 when all of the I/O operations have completed successfully. Otherwise, -1 is returned, and I<errno> is set to indicate the error.
ru: При значении I<mode> равным B<LIO_WAIT> функция B<lio_listio>() возвращает 0, если все операции ввода-вывода были выполнены без ошибок. В противном случае возвращается -1 и в I<errno> содержится код ошибки.

source: The return status from B<lio_listio>() provides information only about the call itself, not about the individual I/O operations. One or more of the I/O operations may fail, but this does not prevent other operations completing. The status of individual I/O operations in I<aiocb_list> can be determined using B<aio_error>(3). When an operation has completed, its return status can be obtained using B<aio_return>(3). Individual I/O operations can fail for the reasons described in B<aio_read>(3) and B<aio_write>(3).
ru: В возвращаемом B<lio_listio>() состоянии предоставляется информация только о самом вызове, а не об отдельных операция ввода-вывода. Одна или несколько операций ввода-вывода могут завершиться с ошибкой, но это не повлияет на выполнение остальных операций. Состояние отдельный операций ввода-вывода в I<aiocb_list> можно определить с помощью B<aio_error>(3). После завершения операции её результат можно получить с помощью B<aio_return>(3). Отдельные операции ввода-вывода могут завершиться с ошибкой по причинам, описанным в B<aio_read>(3) и B<aio_write>(3).

source: The B<lio_listio>() function may fail for the following reasons:
ru: Функция B<lio_listio>() может завершиться с ошибкой по следующим причинам:

source: Out of resources.
ru: Не хватает ресурсов.

source: The number of I/O operations specified by I<nitems> would cause the limit B<AIO_MAX> to be exceeded.
ru: Количество операций ввода-вывода, указанное в I<nitems>, превысило ограничение B<AIO_MAX>.

source: I<mode> was B<LIO_WAIT> and a signal was caught before all I/O operations completed; see B<signal>(7). (This may even be one of the signals used for asynchronous I/O completion notification.)
ru: Значение I<mode> равно B<LIO_WAIT> и был получен сигнал до завершения всех операций ввода-вывода; смотрите B<signal>(7) (это может быть даже один из асинхронных сигналов о завершении ввода-вывода).

source: I<mode> is invalid, or I<nitems> exceeds the limit B<AIO_LISTIO_MAX>.
ru: Неправильное значение I<mode>, или значение I<nitems> превышает ограничение B<AIO_LISTIO_MAX>.

source: One of more of the operations specified by I<aiocb_list> failed. The application can check the status of each operation using B<aio_return>(3).
ru: Одна или более операций, указанных в I<aiocb_list>, завершились с ошибкой. Приложение может проверить состояние каждой операции с помощью B<aio_return>(3).

source: If B<lio_listio>() fails with the error B<EAGAIN>, B<EINTR>, or B<EIO>, then some of the operations in I<aiocb_list> may have been initiated. If B<lio_listio>() fails for any other reason, then none of the I/O operations has been initiated.
ru: Если вызов B<lio_listio>() завершился с ошибкой B<EAGAIN>, B<EINTR> или B<EIO>, то некоторые операции из I<aiocb_list> могли всё же начаться. Если вызов B<lio_listio>() завершился по другой причине, то ни одна из операций ввода-вывода не началась.

source: The B<lio_listio>() function is available since glibc 2.1.
ru: Функция B<lio_listio>() доступна в glibc начиная с версии 2.1.

source: It is a good idea to zero out the control blocks before use. The control blocks must not be changed while the I/O operations are in progress. The buffer areas being read into or written from must not be accessed during the operations or undefined results may occur. The memory areas involved must remain valid.
ru: Рекомендуется обнулять управляющие блоки перед использованием. Управляющие блоки не должны изменяться пока выполняются операции ввода-вывода. Нельзя читать или писать в буферные области во время выполнения операций, иначе результат непредсказуем. Используемые области памяти должны оставаться корректными (valid).

source: Simultaneous I/O operations specifying the same I<aiocb> structure produce undefined results.
ru: Одновременное выполнение операций ввода-вывода через совместно используемую структуру I<aiocb> приводит к непредсказуемым результатам.

source: localeconv - get numeric formatting information
ru: localeconv - получает информацию о форматировании числовых данных

source: The B<localeconv>() function returns a pointer to a I<struct lconv> for the current locale. This structure is shown in B<locale>(7), and contains all values associated with the locale categories B<LC_NUMERIC> and B<LC_MONETARY>. Programs may also use the functions B<printf>(3) and B<strfmon>(3), which behave according to the actual locale in use.
ru: Функция B<localeconv>() возвращает указатель на структуру I<struct lconv> для текущей локали. Эта структура определена в файле заголовков B<locale.h>(7) и содержит все значения, связанные с категориями локали B<LC_NUMERIC> и B<LC_MONETARY>. Программы также могут использовать функции B<printf>(3) и B<strfmon>(3), поведение которых зависит от того, какая локаль сейчас используется.

source: The B<localeconv>() function returns a pointer to a filled in I<struct lconv>. This structure may be (in glibc, I<is>) statically allocated, and may be overwritten by subsequent calls. According to POSIX, the caller should not modify the contents of this structure. The B<localeconv>() function always succeeds.
ru: Функция B<localeconv>() возвращает указатель на структуру I<struct lconv>. Под эту структуру может (в glibc I<так и есть>) быть статически выделена память, и она может быть перезаписана следующими вызовами. Согласно POSIX, вызывающий не должен изменять содержимое структуры. Функция B<localeconv>() всегда завершается без ошибок.

source: The B<printf>(3) family of functions may or may not honor the current locale.
ru: Семейство функций B<printf>(3) может и не учитывать настройки текущей локали.

source: logb, logbf, logbl - get exponent of a floating-point value
ru: logb, logbf, logbl - получение экспоненты значения числа с плавающей запятой

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions extract the exponent from the internal floating-point representation of I<x> and return it as a floating-point value. The integer constant B<FLT_RADIX>, defined in I<E<lt>float.hE<gt>>, indicates the radix used for the system's floating-point representation. If B<FLT_RADIX> is 2, B<logb(>I<x>B<)> is equal to B<floor(log2(>I<x>B<))>, except that it is probably faster.
ru: Эти функции извлекают экспоненту из внутреннего представления числа с плавающей запятой I<x> и возвращают его в виде значения с плавающей запятой. Целочисленная константа B<FLT_RADIX>, определённая в I<E<lt>float.hE<gt>>, задаёт основание системного представления плавающей запятой. Если B<FLT_RADIX> равно 2, то B<logb(>I<x>B<)> эквивалентен B<floor(log2(>I<x>B<))> (но, вероятно, быстрее).

source: If I<x> is subnormal, B<logb>() returns the exponent I<x> would have if it were normalized.
ru: Если I<x> субнормально, то B<logb>() возвращает экспоненту I<x> так, как если бы она была нормализована.

source: On success, these functions return the exponent of I<x>.
ru: В случае успеха эти функции возвращают экспоненту от I<x>.

source: If I<x> is zero, then a pole error occurs, and the functions return -B<HUGE_VAL>, -B<HUGE_VALF>, or -B<HUGE_VALL>, respectively.
ru: Если I<x> равно нулю, возникнет ошибка особой точки, и функция вернет -B<HUGE_VAL>, -B<HUGE_VALF> или -B<HUGE_VALL>, соответственно.

source: If I<x> is negative infinity or positive infinity, then positive infinity is returned.
ru: Если I<x> стремится к минус или плюс бесконечности, то будет возвращена плюс бесконечность.

source: Pole error: I<x> is 0
ru: Ошибка особой точки: I<x> равно 0

source: A divide-by-zero floating-point exception (B<FE_DIVBYZERO>) is raised.
ru: Возникает исключение деления плавающей запятой на ноль (B<FE_DIVBYZERO>).

source: log1p, log1pf, log1pl - logarithm of 1 plus argument
ru: log1p, log1pf, log1pl - логарифм от 1 плюс аргумент

source: These functions return a value equivalent to
ru: Данные функции возвращают значение эквивалентное

source: The result is computed in a way that is accurate even if the value of I<x> is near zero.
ru: Результат вычисляется методом, выдающим точные значения, даже если значение I<x> близко к нулю.

source: On success, these functions return the natural logarithm of I<(1\ +\ x)>.
ru: При успешном выполнении данные функции возвращают натуральный логарифм от I<(1\ +\ x)>.

source: If I<x> is positive infinity, positive infinity is returned.
ru: Если I<x> стремится к плюс бесконечности, то будет возвращена плюс бесконечность.

source: If I<x> is -1, a pole error occurs, and the functions return -B<HUGE_VAL>, -B<HUGE_VALF>, or -B<HUGE_VALL>, respectively.
ru: Если I<x> равно -1, возникнет ошибка особой точки, и функции вернут -B<HUGE_VAL>, -B<HUGE_VALF> или -B<HUGE_VALL>, соответственно.

source: If I<x> is less than -1 (including negative infinity), a domain error occurs, and a NaN (not a number) is returned.
ru: Если I<x> меньше -1 (включая минус бесконечность), то будет сгенерирована ошибка области, и будет возвращено NaN (Not a Number, не число).

source: Domain error: I<x> is less than -1
ru: Ошибка области: I<x> меньше -1

source: I<errno> is set to B<EDOM> (but see BUGS). An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: Значение I<errno> устанавливается в B<EDOM> (но смотрите ДЕФЕКТЫ). Возникает исключение неправильной плавающей точки (B<FE_INVALID>).

source: Pole error: I<x> is -1
ru: Ошибка особой точки: I<x> равно -1

source: Before version 2.22, the glibc implementation did not set I<errno> to B<EDOM> when a domain error occurred.
ru: До версии 2.22 в реализации glibc при возникновении ошибки области I<errno> не присваивалось значение B<EDOM>.

source: Before version 2.22, the glibc implementation did not set I<errno> to B<ERANGE> when a range error occurred.
ru: До версии 2.22 в реализации glibc при возникновении ошибки диапазона I<errno> не присваивалось значение B<ERANGE>.

source: lround, lroundf, lroundl, llround, llroundf, llroundl - round to nearest integer
ru: lround, lroundf, lroundl, llround, llroundf, llroundl - округление до ближайшего целого

source: These functions round their argument to the nearest integer value, rounding halfway cases away from zero, regardless of the current rounding direction (see B<fenv>(3)).
ru: Эти функции округляют аргумент до ближайшего целого значения, используя направление округления от нуля, независимо от текущего направления округления (смотрите B<fenv>(3)).u

source: Note that unlike the B<round>(3) and B<ceil>(3), functions, the return type of these functions differs from that of their arguments.
ru: Заметим, что в отличии от функций B<round>(3) и B<ceil>(3), тип возвращаемого значения этих функций отличается от типа их аргументов.

source: lockf - apply, test or remove a POSIX lock on an open file
ru: lockf - устанавливает, проверяет или удаляет блокировку POSIX на открытом файле

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии gibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: Apply, test or remove a POSIX lock on a section of an open file. The file is specified by I<fd>, a file descriptor open for writing, the action by I<cmd>, and the section consists of byte positions I<pos>..I<pos>+I<len>-1 if I<len> is positive, and I<pos>-I<len>..I<pos>-1 if I<len> is negative, where I<pos> is the current file position, and if I<len> is zero, the section extends from the current file position to infinity, encompassing the present and future end-of-file positions. In all cases, the section may extend past current end-of-file.
ru: Устанавливает, проверяет наличие или удаляет блокировку POSIX с области открытого файла. Файл задаётся в параметре I<fd> — файловым дескриптором, открытым на запись — действие — в I<cmd>, а область указывается как позиции байт I<pos>..I<pos>+I<len>-1, если I<len> положительно, и I<pos>-I<len>..I<pos>-1, если I<len> отрицательно, где I<pos> — текущая позиция в файле и, если I<len> равно нулю, то область расширяется от текущей позиции файла до бесконечности, охватывая текущую и будущие позиции конца файла. Во всех случаях область может расширяться за текущий конец файла.

source: On Linux, B<lockf>() is just an interface on top of B<fcntl>(2) locking. Many other systems implement B<lockf>() in this way, but note that POSIX.1 leaves the relationship between B<lockf>() and B<fcntl>(2) locks unspecified. A portable application should probably avoid mixing calls to these interfaces.
ru: В Linux B<lockf>() — всего лишь более удобный способ вызова B<fcntl>(2) для блокировки. Во многих других системах реализация B<lockf>() сделана подобным образом, но заметим, что в POSIX.1 нет явной связи между блокировками B<lockf>() и B<fcntl>(2). Переносимое приложение, вероятно, должно избегать использования этих двух вызовов одновременно.

source: Valid operations are given below:
ru: Список существующих операций приведён ниже:

source: Set an exclusive lock on the specified section of the file. If (part of) this section is already locked, the call blocks until the previous lock is released. If this section overlaps an earlier locked section, both are merged. File locks are released as soon as the process holding the locks closes some file descriptor for the file. A child process does not inherit these locks.
ru: Устанавливает исключительную блокировку указанной области файла. Если эта область (или её часть) уже блокирована, то вызов заблокирует выполнение до тех пор, пока не будет снята предыдущая блокировка. Если эта область перекрывается с ранее заблокированной областью, то они объединяются. Файловые блокировки снимаются сразу после того, как установивший их процесс закрывает файловый дескриптор. Дочерние процессы не наследуют подобные блокировки.

source: Same as B<F_LOCK> but the call never blocks and returns an error instead if the file is already locked.
ru: То же самое, что и B<F_LOCK>, но вызов никогда не блокирует выполнение и возвращает ошибку, если файл уже заблокирован.

source: Unlock the indicated section of the file. This may cause a locked section to be split into two locked sections.
ru: Снимает блокировку с заданной области файла. Может привести к тому, что блокируемая область будет поделена на две заблокированные области.

source: Test the lock: return 0 if the specified section is unlocked or locked by this process; return -1, set I<errno> to B<EAGAIN> (B<EACCES> on some other systems), if another process holds a lock.
ru: Проверяет наличие блокировки: возвращает 0, если указанная область не заблокирована или заблокирована вызвавшим процессом; возвращает -1, меняет значение I<errno> на B<EAGAIN> (в некоторых системах на B<EACCES>), если блокировка установлена другим процессом.

source: B<EACCES> or B<EAGAIN>
ru: B<EACCES> или B<EAGAIN>

source: The file is locked and B<F_TLOCK> or B<F_TEST> was specified, or the operation is prohibited because the file has been memory-mapped by another process.
ru: Файл блокирован и указана операция B<F_TLOCK> или B<F_TEST>, или операция запрещена, так как файл отображён в память другим процессом.

source: I<fd> is not an open file descriptor; or I<cmd> is B<F_LOCK> or B<F_TLOCK> and I<fd> is not a writable file descriptor.
ru: Значение I<fd> не является открытым файловым дескриптором, или значение I<cmd> равно B<F_LOCK> или B<F_TLOCK> и файловый дескриптор I<fd> не открыт на запись.

source: The command was B<F_LOCK> and this lock operation would cause a deadlock.
ru: Вызвана операция B<F_LOCK>, которая приводит к вечной блокировке (deadlock).

source: While waiting to acquire a lock, the call was interrupted by delivery of a signal caught by a handler; see B<signal>(7).
ru: При ожидании получения блокировки вызов был прерван сигналом, пришедшим в обработчик; смотрите B<signal>(7).

source: An invalid operation was specified in I<cmd>.
ru: В I<cmd> указана неправильная операция.

source: Too many segment locks open, lock table is full.
ru: Открыто слишком много областей для блокировки, таблица блокировок переполнена.

source: I<locks.txt> and I<mandatory-locking.txt> in the Linux kernel source directory I<Documentation/filesystems> (on older kernels, these files are directly under the I<Documentation> directory, and I<mandatory-locking.txt> is called I<mandatory.txt>)
ru: Смотрите также файлы I<locks.txt> и I<mandatory-locking.txt> из каталога I<Documentation/filesystems> с исходным кодом ядра Linux (в старых ядрах эти файлы были в каталоге I<Documentation>, а I<mandatory-locking.txt> назывался I<mandatory.txt>).

source: lfind, lsearch - linear search of an array
ru: lfind, lsearch - линейный поиск в массиве

source: B<lfind>() and B<lsearch>() perform a linear search for I<key> in the array I<base> which has I<*nmemb> elements of I<size> bytes each. The comparison function referenced by I<compar> is expected to have two arguments which point to the I<key> object and to an array member, in that order, and which returns zero if the I<key> object matches the array member, and nonzero otherwise.
ru: Функции B<lfind>() и B<lsearch>() выполняют линейный поиск I<key> в массиве I<base>, который имеет I<*nmemb> элементов, каждый по I<size> байт. Функция сравнения, определяемая I<compar>, должна иметь два параметра, которые указывают на объект I<key> и на член массива, в указанном порядке, и возвращать ноль, если объект I<key> совпадает с членом массива, и ненулевое значение в противном случае.

source: If B<lsearch>() does not find a matching element, then the I<key> object is inserted at the end of the table, and I<*nmemb> is incremented. In particular, one should know that a matching element exists, or that more room is available.
ru: Если B<lsearch>() не находит совпадающих элементов, то объект I<key> вставляется в конец таблицы, а значение I<*nmemb> увеличивается. Отметим, что теперь совпадающий элемент существует, и что есть ещё место.

source: B<lfind>() returns a pointer to a matching member of the array, or NULL if no match is found. B<lsearch>() returns a pointer to a matching member of the array, or to the newly added member if no match is found.
ru: Функция B<lfind>() возвращает указатель на совпадающий член массива, или NULL, если не было совпадений. Функция B<lsearch>() возвращает указатель на совпадающий член массива, или на добавленный новый член, если не было найдено совпадений.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. Present in libc since libc-4.6.27.
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. Присутствует в libc начиная с libc-4.6.27.

source: The naming is unfortunate.
ru: Неудачно выбрано имя.

source: log, logf, logl - natural logarithmic function
ru: log, logf, logl - функция вычисления натурального логарифма

source: These functions return the natural logarithm of I<x>.
ru: Данные функции возвращают натуральный логарифм от I<x>.

source: On success, these functions return the natural logarithm of I<x>.
ru: При успешном выполнении данные функции возвращают натуральный логарифм от I<x>.

source: If I<x> is 1, the result is +0.
ru: Если I<x> равно 1, результат будет +0.

source: If I<x> is negative (including negative infinity), then a domain error occurs, and a NaN (not a number) is returned.
ru: Если I<x> отрицательно (включая минус бесконечность), то будет сгенерирована ошибка области, и будет возвращено NaN (Not a Number, не число).

source: Domain error: I<x> is negative
ru: Ошибка области: I<x> является отрицательным

source: I<errno> is set to B<EDOM>. An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: I<errno> устанавливается в B<EDOM>. Вызывается исключение неправильной плавающей точки (B<FE_INVALID>).

source: Pole error: I<x> is zero
ru: Ошибка особой точки: I<x> равен нулю

source: I<errno> is set to B<ERANGE>. A divide-by-zero floating-point exception (B<FE_DIVBYZERO>) is raised.
ru: I<errno> устанавливается в B<ERANGE>. Возникает исключение деления плавающей точки на ноль (B<FE_DIVBYZERO>).

source: In glibc 2.5 and earlier, taking the B<log>() of a NaN produces a bogus invalid floating-point (B<FE_INVALID>) exception.
ru: В версии glibc 2.5 и ниже значение B<log>() от NaN ошибочно производила исключение неправильной плавающей запятой (B<FE_INVALID>).

source: lseek64 - reposition 64-bit read/write file offset
ru: lseek64 - изменяет смещение в файле, используемое при чтении/записи, в соответствии с 64-битным значением

source: B<#define _LARGEFILE64_SOURCE> /* See feature_test_macros(7) */
ru: B<#define _LARGEFILE64_SOURCE> /* См. feature_test_macros(7) */

source: The B<lseek>(2) family of functions reposition the offset of the open file associated with the file descriptor I<fd> to I<offset> bytes relative to the start, current position, or end of the file, when I<whence> has the value B<SEEK_SET>, B<SEEK_CUR>, or B<SEEK_END>, respectively.
ru: Семейство вызовов B<lseek>(2) изменяет смещение в открытом файле, с которым связан файловый дескриптор I<fd>, на I<offset> байт относительно начала, текущего положения или конца файла, в зависимости от значений I<whence> — B<SEEK_SET>, B<SEEK_CUR>, или B<SEEK_END>, соответственно.

source: For more details, return value, and errors, see B<lseek>(2).
ru: Подробности, возвращаемое значение и ошибки смотрите в B<lseek>(2).

source: Four interfaces are available: B<lseek>(2), B<lseek64>(), B<llseek>(2), and B<_llseek>(2).
ru: Доступно четыре интерфейса: B<lseek>(2), B<lseek64>(), B<llseek>(2) и B<_llseek>(2).

source: Prototype:
ru: Прототип:

source: B<lseek>(2) uses the type I<off_t>. This is a 32-bit signed type on 32-bit architectures, unless one compiles with
ru: В B<lseek>(2) используется тип I<off_t>, который в 32-битной системе является 32-битным знаковым типом, если только при компиляция не определён макрос

source: in which case it is a 64-bit signed type.
ru: в этом случае он будет 64-битным знаковым типом.

source: The library routine B<lseek64>() uses a 64-bit type even when I<off_t> is a 32-bit type. Its prototype (and the type I<off64_t>) is available only when one compiles with
ru: В библиотечной функции B<lseek64>() используется 64-битный тип, даже если I<off_t> является 32-битным типом. Её прототип (и тип I<off64_t>) доступен только когда при компиляции определён макрос

source: The function B<lseek64>() is available since glibc 2.1, and is defined to be an alias for B<llseek>().
ru: Функция B<lseek64>() доступна начиная с glibc 2.1 и определена как псевдоним B<llseek>().
