Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: A list of pathnames, separated by colons (\(aq:\(aq), that should be used to find locale data. If this variable is set, only the individual compiled locale data files from I<LOCPATH> and the system default locale data path are used; any available locale archives are not used (see B<localedef>(1)). The individual compiled locale data files are searched for under subdirectories which depend on the currently used locale. For example, when I<en_GB.UTF-8> is used for a category, the following subdirectories are searched for, in this order: I<en_GB.UTF-8>, I<en_GB.utf8>, I<en_GB>, I<en.UTF-8>, I<en.utf8>, and I<en>.
ru: Список путей, разделённых двоеточием («:»), который должен использоваться при поиске данных локали. Если переменная установлена, то используются только скомпилированные файлы данных одной локали из I<LOCPATH> и путь к данным системной локали по умолчанию; все другие доступные архивы локалей не используются (смотрите B<localedef>(1)). Скопированные файлы данных одной локали ищутся в подкаталогах, которые зависят от используемой локали в данный момент. Например, если для категории используется I<en_GB.UTF-8>, то будут просмотрены следующие подкаталоги в таком порядке: I<en_GB.UTF-8>, I<en_GB.utf8>, I<en_GB>, I<en.UTF-8>, I<en.utf8> и I<en>.

source: Usual default path for compiled individual locale files.
ru: Обычный путь по умолчанию для скомпонованных файлов отдельных локалей.

source: link, linkat - make a new name for a file
ru: link, linkat - создаёт новое имя файла

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>unistd.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> >/* определения констант of AT_* */ B<#include E<lt>unistd.hE<gt>>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: B<link>() creates a new link (also known as a hard link) to an existing file.
ru: B<link>() создаёт новую ссылку (также называемую жёсткую ссылку) на существующий файл.

source: If I<newpath> exists, it will I<not> be overwritten.
ru: Если I<newpath> существует, то он I<не> будет перезаписан.

source: This new name may be used exactly as the old one for any operation; both names refer to the same file (and so have the same permissions and ownership) and it is impossible to tell which name was the "original".
ru: Это новое имя может использоваться как и старое для любых операций; оба имени ссылаются на один файл (и имеют одинаковые права и владельцев) и невозможно сказать какое имя считать "изначальным".

source: The B<linkat>() system call operates in exactly the same way as B<link>(), except for the differences described here.
ru: Системный вызов B<linkat>() работает также как системный вызов B<link>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<oldpath> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<olddirfd> (rather than relative to the current working directory of the calling process, as is done by B<link>() for a relative pathname).
ru: Если в I<oldpath> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<olddirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<link>()).

source: If I<oldpath> is relative and I<olddirfd> is the special value B<AT_FDCWD>, then I<oldpath> is interpreted relative to the current working directory of the calling process (like B<link>()).
ru: Если в I<oldpath> задан относительный путь и I<olddirfd> равно специальному значению B<AT_FDCWD>, то I<oldpath> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<link>()).

source: If I<oldpath> is absolute, then I<olddirfd> is ignored.
ru: Если в I<oldpath> задан абсолютный путь, то I<olddirfd> игнорируется.

source: The interpretation of I<newpath> is as for I<oldpath>, except that a relative pathname is interpreted relative to the directory referred to by the file descriptor I<newdirfd>.
ru: Значение I<newpath> интерпретируется как I<oldpath>, за исключением того, что относительный путь интерпретируется относительно каталога, на который ссылается файловый дескриптор I<newdirfd>.

source: The following values can be bitwise ORed in I<flags>:
ru: Следующие значения можно побитово (OR) объединять в I<flags>:

source: B<AT_EMPTY_PATH> (since Linux 2.6.39)
ru: B<AT_EMPTY_PATH> (начиная с Linux 2.6.39)

source: If I<oldpath> is an empty string, create a link to the file referenced by I<olddirfd> (which may have been obtained using the B<open>(2) B<O_PATH> flag). In this case, I<olddirfd> can refer to any type of file except a directory. This will generally not work if the file has a link count of zero (files created with B<O_TMPFILE> and without B<O_EXCL> are an exception). The caller must have the B<CAP_DAC_READ_SEARCH> capability in order to use this flag. This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition.
ru: Если значение I<oldpath> равно пустой строке, то создаётся ссылка на файл, на который указывает I<olddirfd> (который может быть получен с помощью B<open>(2) с флагом B<O_PATH>). В этом случае I<olddirfd> может указывать на файл любого типа кроме каталога. Это, обычно, не работает, если файл имеет счётчик ссылок равный нулю (исключение — файлы, созданные с флагом B<O_TMPFILE> и без B<O_EXCL>). Вызывающий должен иметь мандат B<CAP_DAC_READ_SEARCH>, чтобы использовать этот флаг. Данный флаг есть только в Linux; для получения его определения определите B<_GNU_SOURCE>.

source: B<AT_SYMLINK_FOLLOW> (since Linux 2.6.18)
ru: B<AT_SYMLINK_FOLLOW> (начиная с Linux 2.6.18)

source: By default, B<linkat>(), does not dereference I<oldpath> if it is a symbolic link (like B<link>()). The flag B<AT_SYMLINK_FOLLOW> can be specified in I<flags> to cause I<oldpath> to be dereferenced if it is a symbolic link. If procfs is mounted, this can be used as an alternative to B<AT_EMPTY_PATH>, like this:
ru: По умолчанию, B<linkat>() не разыменовывает I<oldpath>, если это символьная ссылка (подобно B<link>()). В I<flags> можно указать флаг B<AT_SYMLINK_FOLLOW>, и тогда значение I<oldpath> будет разыменовано, если это символьная ссылка. Если смонтирована procfs, то это может быть использовано как альтернатива B<AT_EMPTY_PATH>, например:

source: Before kernel 2.6.18, the I<flags> argument was unused, and had to be specified as 0.
ru: До версии ядра 2.6.18 аргумент I<flags> не использовался и должен был быть равен 0.

source: See B<openat>(2) for an explanation of the need for B<linkat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<linkat>().

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: ERRORS
ru: ОШИБКИ

source: Write access to the directory containing I<newpath> is denied, or search permission is denied for one of the directories in the path prefix of I<oldpath> or I<newpath>. (See also B<path_resolution>(7).)
ru: Нет прав на запись в каталог, содержащий I<newpath>, или в одном из каталогов пути до I<oldpath> или I<newpath> не разрешён поиск (см. также B<path_resolution>(7)).

source: The user's quota of disk blocks on the filesystem has been exhausted.
ru: Исчерпана пользовательская квота на дисковые блоки файловой системы.

source: I<newpath> already exists.
ru: I<newpath> уже существует.

source: I<oldpath> or I<newpath> points outside your accessible address space.
ru: Значения I<oldpath> и I<newpath> указывают за пределы доступного адресного пространства.

source: An I/O error occurred.
ru: Произошла ошибка ввода-вывода.

source: Too many symbolic links were encountered in resolving I<oldpath> or I<newpath>.
ru: Во время определения I<oldpath> или I<newpath> встретилось слишком много символьных ссылок.

source: The file referred to by I<oldpath> already has the maximum number of links to it. For example, on an B<ext4>(5) filesystem that does not employ the I<dir_index> feature, the limit on the number of hard links to a file is 65,000; on B<btrfs>(5), the limit is 65,535 links.
ru: На файл, на который указывает I<oldpath>, уже создано максимальное количество ссылок. Например, для файловой системы B<ext4>(5), в которой не используется свойство I<dir_index>, ограничение по количеству жёстких ссылок на файл равно 65000; в B<btrfs>(5) — 65535 ссылок.

source: I<oldpath> or I<newpath> was too long.
ru: Слишком длинное значение аргумента I<oldpath> или I<newpath>.

source: A directory component in I<oldpath> or I<newpath> does not exist or is a dangling symbolic link.
ru: Компонент каталога в I<oldpath> или I<newpath> не существует или является повисшей ссылкой.

source: Insufficient kernel memory was available.
ru: Недостаточное количество памяти ядра.

source: The device containing the file has no room for the new directory entry.
ru: На устройстве, содержащем файл, нет места для создания нового элемента каталога.

source: A component used as a directory in I<oldpath> or I<newpath> is not, in fact, a directory.
ru: Компонент, используемый как каталог в I<oldpath> или I<newpath>, на самом деле не является каталогом.

source: I<oldpath> is a directory.
ru: I<oldpath> является каталогом.

source: The filesystem containing I<oldpath> and I<newpath> does not support the creation of hard links.
ru: Файловая система, содержащая I<oldpath> и I<newpath>, не поддерживает создание жёстких ссылок.

source: B<EPERM> (since Linux 3.6)
ru: B<EPERM> (начиная с Linux 3.6)

source: The caller does not have permission to create a hard link to this file (see the description of I</proc/sys/fs/protected_hardlinks> in B<proc>(5)).
ru: Вызывающий не имеет прав для создания жёстких ссылок на этот файл (смотрите описание I</proc/sys/fs/protected_hardlinks> в B<proc>(5)).

source: I<oldpath> is marked immutable or append-only. (See B<ioctl_iflags>(2).)
ru: Файл I<oldpath> помечен как неизменяемый (immutable) или только для добавления (смотрите B<ioctl_iflags>(2)).

source: The file is on a read-only filesystem.
ru: Файл расположен в файловой системе, доступной только для чтения.

source: I<oldpath> and I<newpath> are not on the same mounted filesystem. (Linux permits a filesystem to be mounted at multiple points, but B<link>() does not work across different mount points, even if the same filesystem is mounted on both.)
ru: I<oldpath> и I<newpath> находятся не в одной смонтированной файловой системе (Linux позволяет монтировать файловую систему в несколько точек, но B<link>() не работает с отличающими точками монтирования, даже если в них смонтирована идентичная файловая система).

source: The following additional errors can occur for B<linkat>():
ru: В B<linkat>() дополнительно могут возникнуть следующие ошибки:

source: I<olddirfd> or I<newdirfd> is not a valid file descriptor.
ru: В I<olddirfd> или I<newdirfd> указаны неправильные файловые дескрипторы.

source: An invalid flag value was specified in I<flags>.
ru: В I<flags> указано неверное значение флага.

source: B<AT_EMPTY_PATH> was specified in I<flags>, but the caller did not have the B<CAP_DAC_READ_SEARCH> capability.
ru: Флаг B<AT_EMPTY_PATH> указан в I<flags>, но вызывающий не имеет мандата B<CAP_DAC_READ_SEARCH>.

source: An attempt was made to link to the I</proc/self/fd/NN> file corresponding to a file descriptor created with
ru: Предпринята попытка сделать ссылку на файл I</proc/self/fd/NN>, который соответствует файловому дескриптору, созданному с помощью

source: See B<open>(2).
ru: Смотрите B<open>(2).

source: I<oldpath> is a relative pathname and I<olddirfd> refers to a directory that has been deleted, or I<newpath> is a relative pathname and I<newdirfd> refers to a directory that has been deleted.
ru: Значение I<oldpath> является относительным путём и I<olddirfd> ссылается на каталог, который был удалён, или I<newpath> является относительным путём и I<newdirfd> ссылается на каталог, который был удалён.

source: I<oldpath> is relative and I<olddirfd> is a file descriptor referring to a file other than a directory; or similar for I<newpath> and I<newdirfd>
ru: Значение I<oldpath> содержит относительный путь и I<olddirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог; или произошло тоже самое с I<newpath> и I<newdirfd>.

source: B<AT_EMPTY_PATH> was specified in I<flags>, I<oldpath> is an empty string, and I<olddirfd> refers to a directory.
ru: Значение B<AT_EMPTY_PATH> было указано в I<flags>, значение I<oldpath> равно пустой строке и I<olddirfd> указывает на каталог.

source: VERSIONS
ru: ВЕРСИИ

source: B<linkat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Вызов B<linkat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: B<link>(): SVr4, 4.3BSD, POSIX.1-2001 (but see NOTES), POSIX.1-2008.
ru: B<link>(): SVr4, 4.3BSD, POSIX.1-2001 (но смотрите ЗАМЕЧАНИЯ), POSIX.1-2008.

source: Hard links, as created by B<link>(), cannot span filesystems. Use B<symlink>(2) if this is required.
ru: Жёсткие ссылки, создаваемые B<link>(), не могут располагаться в разных файловых системах. Если это необходимо, используйте B<symlink>(2).

source: POSIX.1-2001 says that B<link>() should dereference I<oldpath> if it is a symbolic link. However, since kernel 2.0, Linux does not do so: if I<oldpath> is a symbolic link, then I<newpath> is created as a (hard) link to the same symbolic link file (i.e., I<newpath> becomes a symbolic link to the same file that I<oldpath> refers to). Some other implementations behave in the same manner as Linux. POSIX.1-2008 changes the specification of B<link>(), making it implementation-dependent whether or not I<oldpath> is dereferenced if it is a symbolic link. For precise control over the treatment of symbolic links when creating a link, use B<linkat>().
ru: В POSIX.1-001 сказано, что B<link>() должен разыменовывать I<oldpath>, если он является символьной ссылкой. Однако, начиная с ядра версии 2.0, Linux также не поступает: если I<oldpath> является символьной ссылкой, то I<newpath> создаётся как (жёсткая) ссылка на файл этой символьной ссылки (т.е., I<newpath> становится символьной ссылкой на файл, содержащий ссылку на I<oldpath>). Некоторые другие реализации поступают также как Linux. В POSIX.1-2008 изменено описание B<link>(), теперь разыменование символьной ссылки I<oldpath> зависит от реализации. Для точного управления по обработке символьных ссылок при создании используйте B<linkat>().

source: Glibc notes
ru: Замечания по glibc

source: On older kernels where B<linkat>() is unavailable, the glibc wrapper function falls back to the use of B<link>(), unless the B<AT_SYMLINK_FOLLOW> is specified. When I<oldpath> and I<newpath> are relative pathnames, glibc constructs pathnames based on the symbolic links in I</proc/self/fd> that correspond to the I<olddirfd> and I<newdirfd> arguments.
ru: В старых ядрах, где B<linkat>() отсутствует (и если не указан флаг B<AT_SYMLINK_NOFOLLOW>), обёрточная функция glibc использует B<link>(). Если I<oldpath> и I<newpath> являются относительными путями, то glibc собирает пути относительно символической ссылки в I</proc/self/fd>, которая соответствует аргументам I<olddirfd> и I<newdirfd>.

source: On NFS filesystems, the return code may be wrong in case the NFS server performs the link creation and dies before it can say so. Use B<stat>(2) to find out if the link got created.
ru: В файловых системах NFS возвращаемый код может быть неправильным, если сервер NFS выполнит создание ссылки и завершит работу до возврата результата операции. Используйте B<stat>(2), чтобы выяснить была ли создана ссылка.

source: _llseek - reposition read/write file offset
ru: _llseek - установить позицию чтения/записи в файле

source: I<Note>: There is no glibc wrapper for this system call; see NOTES.
ru: I<Замечание>: В glibc нет обёрточной функции для данного системного вызова; смотрите ЗАМЕЧАНИЯ.

source: The B<_llseek>() system call repositions the offset of the open file description associated with the file descriptor I<fd> to I<(offset_highE<lt>E<lt>32) | offset_low> bytes relative to the beginning of the file, the current file offset, or the end of the file, depending on whether I<whence> is B<SEEK_SET>, B<SEEK_CUR>, or B<SEEK_END>, respectively. It returns the resulting file position in the argument I<result>.
ru: Системный вызов B<_llseek>() изменяет смещение в описании открытого файла, связанного с файловым дескриптором I<fd>, на значение I<(offset_highE<lt>E<lt>32) | offset_low> байт относительно начала файла, текущего смещения файла или конца файла, в зависимости от того, равен ли параметр I<whence> одному из значений B<SEEK_SET>, B<SEEK_CUR> или B<SEEK_END>, соответственно. Функция возвращает получившеюся позицию в файле в аргументе I<result>.

source: This system call exists on various 32-bit platforms to support seeking to large file offsets.
ru: Данный системный вызов существует на различных 32-битных платформах для поддержки перемещения по большим файловым смещениям.

source: Upon successful completion, B<_llseek>() returns 0. Otherwise, a value of -1 is returned and I<errno> is set to indicate the error.
ru: В случае успеха B<_llseek>() возвращает ноль. При ошибке возвращается -1, а I<errno> устанавливается таким образом, чтобы указывать на ошибку.

source: I<fd> is not an open file descriptor.
ru: I<fd> не является открытым файловым дескриптором.

source: Problem with copying results to user space.
ru: Проблема с копированием результатов в пространство пользователя.

source: I<whence> is invalid.
ru: Значение I<whence> неверно.

source: This function is Linux-specific, and should not be used in programs intended to be portable.
ru: Данная функция есть только в Linux и не должна использоваться в программах, которые задуманы как переносимые.

source: Glibc does not provide a wrapper for this system call. To invoke it directly, use B<syscall>(2). However, you probably want to use the B<lseek>(2) wrapper function instead.
ru: В glibc нет обёрточной функции для данного системного вызова. Вы можете вызвать его с помощью B<syscall>(2). Но лучше воспользоваться обёрточной функцией B<lseek>(2).

source: listxattr, llistxattr, flistxattr - list extended attribute names
ru: listxattr, llistxattr, flistxattr - выводит список названий расширенных атрибутов

source: Extended attributes are I<name>:I<value> pairs associated with inodes (files, directories, symbolic links, etc.). They are extensions to the normal attributes which are associated with all inodes in the system (i.e., the B<stat>(2) data). A complete overview of extended attributes concepts can be found in B<xattr>(7).
ru: Расширенные атрибуты представляют собой пару I<имя>:I<значение> и связываются с записями inode (файлы, каталоги, символьные ссылки и т.п.). Они являются расширениями к обычным атрибутам, связанным со всеми записями inode в системе (например, данные B<stat>(2)). Полное описание модели расширенных атрибутов можно найти в B<xattr>(7).

source: B<listxattr>() retrieves the list of extended attribute names associated with the given I<path> in the filesystem. The retrieved list is placed in I<list>, a caller-allocated buffer whose size (in bytes) is specified in the argument I<size>. The list is the set of (null-terminated) names, one after the other. Names of extended attributes to which the calling process does not have access may be omitted from the list. The length of the attribute name I<list> is returned.
ru: B<listxattr>() получает список названий расширенных атрибутов, связанных с заданным путем I<path> в файловой системе. Список помещается в I<list> вызывающего, который выделил для этого буфер размером I<size> (задаётся в байтах). Список представляет собой набор названий (заканчивающихся null) один за одним. Названия расширенных атрибутов, к которым вызывающий процесс не может иметь доступ, могут отсутствовать в списке. Возвращается длина списка I<list>.

source: B<llistxattr>() is identical to B<listxattr>(), except in the case of a symbolic link, where the list of names of extended attributes associated with the link itself is retrieved, not the file that it refers to.
ru: B<llistxattr>() идентичен B<listxattr>(), за исключением случая с символьной ссылкой, где возвращается список названий расширенных атрибутов, связанных с самой ссылкой, а не с файлом, на который она ссылается.

source: B<flistxattr>() is identical to B<listxattr>(), only the open file referred to by I<fd> (as returned by B<open>(2)) is interrogated in place of I<path>.
ru: B<flistxattr>() идентичен B<listxattr>(), отличием является то, что используется открытый файл, на который указывает I<fd> (возвращаемом B<open>(2)), а не указанный в I<path>.

source: A single extended attribute I<name> is a null-terminated string. The name includes a namespace prefix; there may be several, disjoint namespaces associated with an individual inode.
ru: Одиночный расширенный атрибут I<name> является строкой, заканчивающейся null. Имя включает префикс пространства имен; их может быть несколько, разрозненные пространства связаны с отдельной записью inode.

source: If I<size> is specified as zero, these calls return the current size of the list of extended attribute names (and leave I<list> unchanged). This can be used to determine the size of the buffer that should be supplied in a subsequent call. (But, bear in mind that there is a possibility that the set of extended attributes may change between the two calls, so that it is still necessary to check the return status from the second call.)
ru: Если I<size> равно нулю, то эти вызовы возвращают текущий размер списка имён расширенных атрибутов (и не изменяют I<list>). Это можно использовать для определения размера буфера, который будет указан в последующем вызове (но учтите, есть вероятность, что набор расширенных атрибутов может измениться между двумя вызовами, поэтому всё равно нужно проверять возвращаемое состояние после второго вызова).

source: Example
ru: Пример

source: The I<list> of names is returned as an unordered array of null-terminated character strings (attribute names are separated by null bytes (\(aq\e0\(aq)), like this:
ru: I<Список> названий возвращается в виде неупорядоченного массива символьных строк, заканчивающихся null (названия атрибутов разделяются байтами null (\(aq\e0\(aq)), например:

source: Filesystems that implement POSIX ACLs using extended attributes might return a I<list> like this:
ru: Файловые системы, реализующие ACL стандарта POSIX с помощью расширенных атрибутов, могут возвращать такой I<список>:

source: On success, a nonnegative number is returned indicating the size of the extended attribute name list. On failure, -1 is returned and I<errno> is set appropriately.
ru: При успешном завершении работы возвращается неотрицательное число, обозначающее размер списка названий расширенных атрибутов. При ошибках возвращается -1 и I<errno> устанавливается в соответствующее значение.

source: The size of the list of extended attribute names is larger than the maximum size allowed; the list cannot be retrieved. This can happen on filesystems that support an unlimited number of extended attributes per file such as XFS, for example. See BUGS.
ru: Размер списка имён расширенных атрибутов превышает максимально допустимый; список невозможно получить. Это может случиться в файловых системах, которые поддерживают бесконечное количество расширенных атрибутов на файл, например XFS. Смотрите ДЕФЕКТЫ.
