Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: followed by a description of the audience for which this document is intended.
ru: за которым указывается аудитория, которой адресован этот документ.

source: followed by a description of any special application for which this document is intended.
ru: за которым указывается описание любого специального применения, для которого предназначен этот документ.

source: followed by the short name for provider of the source of this document.
ru: за которым указывается короткое имя источника, предоставившего этот документ.

source: followed by the revision number of this document.
ru: за которым указывается номер выпуска этого документа.

source: followed by the revision date of this document.
ru: за которым указывается дата выпуска этого документа.

source: In addition, for each of the categories defined by the document, there should be a line starting with the keyword I<category>, followed by:
ru: Также, для каждой категории, определяемой документом, должна быть строка, начинающаяся с ключевого слова I<category>, после которого указывается:

source: a string that identifies this locale category definition,
ru: строка, обозначающая определение этой категории локали,

source: a semicolon, and
ru: точка с запятой и

source: one of the B<LC_>I<*> identifiers.
ru: один из идентификаторов B<LC_>I<*>.

source: The B<LC_IDENTIFICATION> definition ends with the string I<END LC_IDENTIFICATION>.
ru: Определение категории B<LC_IDENTIFICATION> заканчивается строкой I<END LC_IDENTIFICATION>.

source: The definition starts with the string I<LC_MESSAGES> in the first column.
ru: Определение начинается со строки B<LC_MESSAGES> в первой колонке.

source: followed by a regular expression that describes possible yes-responses.
ru: за которым указывается регулярное выражение, которое описывает возможные ответы «да».

source: followed by a regular expression that describes possible no-responses.
ru: за которым указывается регулярное выражение, которое описывает возможные ответы «нет».

source: followed by the output string corresponding to "yes".
ru: за которым указывается выходная строка, соответствующая «да».

source: followed by the output string corresponding to "no".
ru: за которым указывается выходная строка, соответствующая «нет».

source: The B<LC_MESSAGES> definition ends with the string I<END LC_MESSAGES>.
ru: Определение категории B<LC_MESSAGES> заканчивается строкой I<END LC_MESSAGES>.

source: The definition starts with the string I<LC_MEASUREMENT> in the first column.
ru: Определение начинается со строки B<LC_MEASUREMENT> в первой колонке.

source: followed by number identifying the standard used for measurement. The following values are recognized:
ru: за которым указывается число, определяющее систему мер, используемую при измерениях. Возможны следующие значения:

source: Metric.
ru: Метрическая

source: US customary measurements.
ru: Система мер США

source: The B<LC_MEASUREMENT> definition ends with the string I<END LC_MEASUREMENT>.
ru: Определение категории B<LC_MEASUREMENT> заканчивается строкой I<END LC_MEASUREMENT>.

source: The definition starts with the string I<LC_MONETARY> in the first column.
ru: Определение начинается со строки B<LC_MONETARY> в первой колонке.

source: followed by the international currency symbol. This must be a 4-character string containing the international currency symbol as defined by the ISO 4217 standard (three characters) followed by a separator.
ru: за которым указывается международной символ валюты. Это должна быть строка из четырёх символов, в которой указан код международного символа валюты согласно стандарту ISO 4217 (три символа) с последующим разделителем.

source: followed by the local currency symbol.
ru: за которым указывается локальный символ валюты.

source: followed by the string that will be used as the decimal delimiter when formatting monetary quantities.
ru: за которым указывается строка, используемая как десятичный разделитель в денежных величинах.

source: followed by the string that will be used as a group separator when formatting monetary quantities.
ru: за которым указывается строка, используемая как разделитель групп тысяч в денежных величинах.

source: followed by a sequence of integers separated by semicolons that describe the formatting of monetary quantities. See I<grouping> below for details.
ru: за которым указывается последовательность целых, разделяемых точкой с запятой, которые описывают формат денежных величин. Смотрите подробности в I<grouping> далее.

source: followed by a string that is used to indicate a positive sign for monetary quantities.
ru: за которым указывается строка, используемая для указания положительного знака денежных величин.

source: followed by a string that is used to indicate a negative sign for monetary quantities.
ru: за которым указывается строка, используемая для указания отрицательного знака денежных величин.

source: followed by the number of fractional digits that should be used when formatting with the I<int_curr_symbol>.
ru: за которым указывается количество цифр в дробной части, которое нужно использовать при форматировании с I<int_curr_symbol>.

source: followed by the number of fractional digits that should be used when formatting with the I<currency_symbol>.
ru: за которым указывается количество цифр в дробной части, которое нужно использовать при форматировании с I<currency_symbol>.

source: followed by an integer that indicates the placement of I<currency_symbol> for a nonnegative formatted monetary quantity:
ru: за которым указывается целое, обозначающее положение I<currency_symbol> при форматировании неотрицательной денежной величины:

source: the symbol succeeds the value.
ru: сначала величина, затем символ

source: the symbol precedes the value.
ru: сначала символ, затем величина

source: followed by an integer that indicates the separation of I<currency_symbol>, the sign string, and the value for a nonnegative formatted monetary quantity. The following values are recognized:
ru: за которым указывается целое, обозначающее разделитель I<currency_symbol>, строки знака и значения при форматировании неотрицательной денежной величины. Допустимы следующие значения:

source: No space separates the currency symbol and the value.
ru: Отсутствует пробел между денежным символом и величиной.

source: If the currency symbol and the sign string are adjacent, a space separates them from the value; otherwise a space separates the currency symbol and the value.
ru: Если денежный символ и строка знака находятся рядом, то они отделяются от значения пробелом; в противном случае пробелом разделяются денежный символ и значение.

source: If the currency symbol and the sign string are adjacent, a space separates them from the value; otherwise a space separates the sign string and the value.
ru: Если денежный символ и строка знака находятся рядом, то они отделяются от значения пробелом; в противном случае пробелом разделяются строка знака и значение.

source: followed by an integer that indicates the placement of I<currency_symbol> for a negative formatted monetary quantity. The same values are recognized as for I<p_cs_precedes>.
ru: за которым указывается целое, обозначающее положение I<currency_symbol> при форматировании отрицательной денежной величины. Используются те же значения что и для I<p_cs_precedes>.

source: followed by an integer that indicates the separation of I<currency_symbol>, the sign string, and the value for a negative formatted monetary quantity. The same values are recognized as for I<p_sep_by_space>.
ru: за которым указывается целое, обозначающее разделитель I<currency_symbol>, строку знака и значение при генерации отрицательной денежной величины. Используются те же значения что и для I<p_sep_by_space>.

source: followed by an integer that indicates where the I<positive_sign> should be placed for a nonnegative monetary quantity:
ru: за которым указывается целое, обозначающее положение I<positive_sign> при форматировании неотрицательной денежной величины:

source: Parentheses enclose the quantity and the I<currency_symbol> or I<int_curr_symbol>.
ru: Величина и I<currency_symbol> или I<int_curr_symbol> заключается в круглые скобки.

source: The sign string precedes the quantity and the I<currency_symbol> or the I<int_curr_symbol>.
ru: Строка знака указывается перед величиной и I<currency_symbol> или I<int_curr_symbol>.

source: The sign string succeeds the quantity and the I<currency_symbol> or the I<int_curr_symbol>.
ru: Строка знака указывается после величины и I<currency_symbol> или I<int_curr_symbol>.

source: The sign string precedes the I<currency_symbol> or the I<int_curr_symbol>.
ru: Строка знака указывается перед величиной и I<currency_symbol> или I<int_curr_symbol>.

source: The sign string succeeds the I<currency_symbol> or the I<int_curr_symbol>.
ru: Строка знака указывается после I<currency_symbol> или I<int_curr_symbol>.

source: followed by an integer that indicates where the I<negative_sign> should be placed for a negative monetary quantity. The same values are recognized as for I<p_sign_posn>.
ru: за которым указывается целое, обозначающее положение I<negative_sign> при форматировании отрицательной денежной величины. Используются те же значения что и для I<p_sign_posn>.

source: followed by an integer that indicates the placement of I<int_curr_symbol> for a nonnegative internationally formatted monetary quantity. The same values are recognized as for I<p_cs_precedes>.
ru: за которым указывается целое, обозначающее положение I<int_curr_symbol> при генерации неотрицательной денежной величины в международном формате. Используются те же значения что и для I<p_cs_precedes>.

source: followed by an integer that indicates the placement of I<int_curr_symbol> for a negative internationally formatted monetary quantity. The same values are recognized as for I<p_cs_precedes>.
ru: за которым указывается целое, обозначающее положение I<int_curr_symbol> при генерации отрицательной денежной величины в международном формате. Используются те же значения что и для I<p_cs_precedes>.

source: followed by an integer that indicates the separation of I<int_curr_symbol>, the sign string, and the value for a nonnegative internationally formatted monetary quantity. The same values are recognized as for I<p_sep_by_space>.
ru: за которым указывается целое, обозначающее разделитель I<int_curr_symbol>, строку знака и значение при генерации неотрицательной денежной величины в международном формате. Используются те же значения что и для I<p_sep_by_space>.

source: followed by an integer that indicates the separation of I<int_curr_symbol>, the sign string, and the value for a negative internationally formatted monetary quantity. The same values are recognized as for I<p_sep_by_space>.
ru: за которым указывается целое, обозначающее разделитель I<int_curr_symbol>, строку знака и значение при генерации отрицательной денежной величины в международном формате. Используются те же значения что и для I<p_sep_by_space>.

source: followed by an integer that indicates where the I<positive_sign> should be placed for a nonnegative internationally formatted monetary quantity. The same values are recognized as for I<p_sign_posn>.
ru: за которым указывается целое, обозначающее положение I<positive_sign> при генерации неотрицательной денежной величины в международном формате. Используются те же значения что и для I<p_sign_posn>.

source: followed by an integer that indicates where the I<negative_sign> should be placed for a negative internationally formatted monetary quantity. The same values are recognized as for I<p_sign_posn>.
ru: за которым указывается целое, обозначающее положение I<negative_sign> при генерации отрицательной денежной величины в международном формате. Используются те же значения что и для I<p_sign_posn>.

source: The B<LC_MONETARY> definition ends with the string I<END LC_MONETARY>.
ru: Определение категории B<LC_MONETARY> заканчивается строкой I<END LC_MONETARY>.

source: The definition starts with the string I<LC_NAME> in the first column.
ru: Определение начинается со строки B<LC_NAME> в первой колонке.

source: Various keywords are allowed, but only I<name_fmt> is mandatory. Other keywords are needed only if there is common convention to use the corresponding salutation in this locale. The allowed keywords are as follows:
ru: Допускаются различные ключевые слова, но обязательно только I<name_fmt>. Другие ключевые слова нужны только, если есть общее соглашение использовать соответствующее приветствие в этой локали.Допустимые ключевые слова:

source: followed by a string containing field descriptors that define the format used for names in the locale. The following field descriptors are recognized:
ru: за которым указывается строка описателей поля, которые задают формат, используемый для имён в локали. Доступны следующие описатели поля:

source: Family name(s).
ru: Фамилия.

source: Family names in uppercase.
ru: Фамилия в верхнем регистре.

source: First given name.
ru: Имя.

source: First given initial.
ru: Инициал имени.

source: First given name with Latin letters.
ru: Имя латиницей.

source: Other shorter name.
ru: Другое сокращённое имя.

source: Additional given name(s).
ru: Дополнительные имена.

source: Initials for additional given name(s).
ru: Инициалы дополнительных имён.

source: Profession.
ru: Профессия.

source: Salutation, such as "Doctor".
ru: Приветствие, например «доктор».

source: Abbreviated salutation, such as "Mr." or "Dr.".
ru: Сокращение приветствия, например «Mr.» или «Dr.».

source: Salutation, using the FDCC-sets conventions.
ru: Приветствие в соответствии с соглашениями FDCC.

source: If the preceding field descriptor resulted in an empty string, then the empty string, otherwise a space character.
ru: Если предыдущий описатель поля равен пустой строке, то выдаётся пустая строка, в противном случае символ пробела.

source: followed by the general salutation for any gender.
ru: за которым указывается приветствие для любого пола.

source: followed by the salutation for men.
ru: за которым указывается приветствие для мужчин.

source: followed by the salutation for married women.
ru: за которым указывается приветствие для замужних женщин.

source: followed by the salutation for unmarried women.
ru: за которым указывается приветствие для не замужних женщин.

source: followed by the salutation valid for all women.
ru: за которым указывается приветствие, подходящее для всех женщин.

source: The B<LC_NAME> definition ends with the string I<END LC_NAME>.
ru: Определение категории B<LC_NAME> заканчивается строкой I<END LC_NAME>.

source: The definition starts with the string I<LC_NUMERIC> in the first column.
ru: Определение начинается со строки B<LC_NUMERIC> в первой колонке.

source: followed by the string that will be used as the decimal delimiter when formatting numeric quantities.
ru: за которым указывается строка, используемая в качестве десятичного разделителя при форматировании числовых величин.

source: followed by the string that will be used as a group separator when formatting numeric quantities.
ru: за которым указывается строка, используемая в качестве разделителя тысяч при форматировании числовых величин.

source: followed by a sequence of integers separated by semicolons that describe the formatting of numeric quantities.
ru: за которым указывается последовательность целых чисел, разделяемых точкой с запятой, которые описывают формат числовых величин.

source: Each integer specifies the number of digits in a group. The first integer defines the size of the group immediately to the left of the decimal delimiter. Subsequent integers define succeeding groups to the left of the previous group. If the last integer is not -1, then the size of the previous group (if any) is repeatedly used for the remainder of the digits. If the last integer is -1, then no further grouping is performed.
ru: Каждое целое указывает количество цифр в группе. Первое целое определяет размер группы, расположенной первой слева от десятичного разделителя. Последующие целые определяют последующие группы левее предыдущей группы. Если последнее целое не равно -1, то размер предыдущей группы (если есть) постоянно используется для оставшихся цифр. Если последнее целое равно -1, то дальнейшая группировка не производится.

source: The B<LC_NUMERIC> definition ends with the string I<END LC_NUMERIC>.
ru: Определение категории B<LC_NUMERIC> заканчивается строкой I<END LC_NUMERIC>.

source: The definition starts with the string I<LC_PAPER> in the first column.
ru: Определение начинается со строки B<LC_PAPER> в первой колонке.

source: followed by the height, in millimeters, of the standard paper format.
ru: за которым указывается высота бумаги стандартного формата в миллиметрах.

source: followed by the width, in millimeters, of the standard paper format.
ru: за которым указывается ширина бумаги стандартного формата в миллиметрах.

source: The B<LC_PAPER> definition ends with the string I<END LC_PAPER>.
ru: Определение категории B<LC_PAPER> заканчивается строкой I<END LC_PAPER>.

source: The definition starts with the string I<LC_TELEPHONE> in the first column.
ru: Определение начинается со строки B<LC_TELEPHONE> в первой колонке.

source: followed by a string that contains field descriptors that identify the format used to dial international numbers. The following field descriptors are recognized:
ru: за которым указывается строка описателей поля, которыми задаётся формат, используемый для набора международных номеров. Доступны следующие описатели поля:

source: Area code without nationwide prefix (the prefix is often "00").
ru: Код региона без национального префикса (используемый чаще всего префикс «00»).

source: Area code including nationwide prefix.
ru: Код региона включая национальный префикс.

source: Local number (within area code).
ru: Локальный номер (внутри кода региона).

source: Extension (to local number).
ru: Расширение (локального номера).

source: Country code.
ru: Код страны.

source: Alternate carrier service code used for dialing abroad.
ru: Альтернативный сервисный код поставщика услуг связи (carrier), используемый при наборе заграничного номера.

source: followed by a string that contains field descriptors that identify the format used to dial domestic numbers. The recognized field descriptors are the same as for I<tel_int_fmt>.
ru: за которым указывается строка описателей поля, которыми задаётся формат, используемый для набора местных номеров. Используются те же описатели поля, что и в I<tel_int_fmt>.

source: followed by the prefix used to call international phone numbers.
ru: за которым указывается префикс для набора международных телефонных номеров.

source: followed by the prefix used from other countries to dial this country.
ru: за которым указывается префикс, используемый в других странах для звонков в эту страну.

source: The B<LC_TELEPHONE> definition ends with the string I<END LC_TELEPHONE>.
ru: Определение категории B<LC_TELEPHONE> заканчивается строкой I<END LC_TELEPHONE>.

source: The definition starts with the string I<LC_TIME> in the first column.
ru: Определение начинается со строки B<LC_TIME> в первой колонке.

source: followed by a list of abbreviated names of the days of the week. The list starts with the first day of the week as specified by I<week> (Sunday by default). See NOTES.
ru: за которым указывается список сокращённых названий дней недели. Список начинается с первого дня недели, указанного в I<week> (по умолчанию Sunday, воскресенье). Смотрите ЗАМЕЧАНИЯ.

source: followed by a list of names of the days of the week. The list starts with the first day of the week as specified by I<week> (Sunday by default). See NOTES.
ru: за которым указывается список названий дней недели. Список начинается с первого дня недели, указанного в I<week> (по умолчанию Sunday, воскресенье). Смотрите ЗАМЕЧАНИЯ.

source: followed by a list of abbreviated month names.
ru: за которым указывается список кратких названий месяцев.

source: followed by a list of month names.
ru: за которым указывается список названий месяцев.

source: followed by the appropriate date and time format (for syntax, see B<strftime>(3)).
ru: за которым указывается соответствующий формат даты и времени (синтаксис описан в B<strftime>(3)).

source: followed by the appropriate date format (for syntax, see B<strftime>(3)).
ru: за которым указывается соответствующий формат даты (синтаксис описан в B<strftime>(3)).

source: followed by the appropriate time format (for syntax, see B<strftime>(3)).
ru: за которым указывается соответствующий формат времени (синтаксис описан в B<strftime>(3)).

source: followed by the appropriate representation of the B<am> and B<pm> strings. This should be left empty for locales not using AM/PM convention.
ru: за которым указывается соответствующее представление строк B<am> и B<pm>. Должно быть пустым для локалей, в которых не используется соглашение для AM/PM.

source: followed by the appropriate time format (for syntax, see B<strftime>(3)) when using 12h clock format. This should be left empty for locales not using AM/PM convention.
ru: за которым указывается соответствующий формат времени для представления 12 часового формата (синтаксис описан в B<strftime>(3)). Должно быть пустым для локалей, в которых не используется соглашение для AM/PM.

source: followed by semicolon-separated strings that define how years are counted and displayed for each era in the locale. Each string has the following format:
ru: за которым указывается список строк через точку с запятой, задающих как в локали считать и отображать года каждой эпохи. Каждая строка имеет следующий формат:

source: The fields are to be defined as follows:
ru: Поля определены следующим образом:

source: Either B<+> or B<->. B<+> means the years closer to I<start_date> have lower numbers than years closer to I<end_date>. B<-> means the opposite.
ru: Может быть B<+> или B<->. Символ B<+> означает, что у годов, находящихся ближе к I<start_date>, числовое значение меньше, чем у годов, находящихся ближе к I<end_date>. Символ B<-> имеет обратный смысл.

source: The number of the year closest to I<start_date> in the era, corresponding to the I<%Ey> descriptor (see B<strptime>(3)).
ru: Ближайший к I<start_date> номер года в эре, соответствует описателю I<%Ey> (смотрите B<strptime>(3)).

source: The start of the era in the form of I<yyyy/mm/dd>. Years prior AD 1 are represented as negative numbers.
ru: Начало эры в виде I<гггг/мм/дд>. Года до 1-го нашей эры представляются отрицательными числами.

source: The end of the era in the form of I<yyyy/mm/dd>, or one of the two special values of B<-*> or B<+*>. B<-*> means the ending date is the beginning of time. B<+*> means the ending date is the end of time.
ru: Конец эры в виде I<гггг/мм/вв> или одно из двух специальных значений: B<-*> или B<+*>. Комбинация B<-*> означает, что конечная дата — это начало времён. Комбинация B<+*> означает, что конечная дата — это конец времён.

source: The name of the era corresponding to the I<%EC> descriptor (see B<strptime>(3)).
ru: Название эпохи, соответствует описателю I<%EC> (смотрите B<strptime>(3)).

source: The format of the year in the era corresponding to the I<%EY> descriptor (see B<strptime>(3)).
ru: Формат года в эпохе, соответствует описателю I<%EY> (смотрите B<strptime>(3)).

source: followed by the format of the date in alternative era notation, corresponding to the I<%Ex> descriptor (see B<strptime>(3)).
ru: за которым указывается формат даты в альтернативном формате эпохи, соответствует описателю I<%Ex> (смотрите B<strptime>(3)).
