Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: The type I<loff_t> is a 64-bit signed type. The library routine B<llseek>() is available in glibc and works without special defines. However, the glibc headers do not provide a prototype. Users should add the above prototype, or something equivalent, to their own source. When users complained about data loss caused by a miscompilation of B<e2fsck>(8), glibc 2.1.3 added the link-time warning
ru: Тип I<loff_t> является 64-битным знаковым типом. Библиотечная функция B<llseek>() доступна в glibc и работает без каких-либо дополнительных определений. Однако в glibc для неё нет прототипа. Пользователи должны добавить указанный выше прототип или его эквивалент в свой исходный код. Когда пользователи стали жаловаться на потерю данных, вызванную неправильной компиляцией B<e2fsck>(8), в glibc 2.1.3 добавили предупреждение времени компоновки.

source: This makes this function unusable if one desires a warning-free compilation.
ru: Это делает данную бесполезной в случае, если кто-то захочет избавиться от предупреждения.

source: On 32-bit architectures, this is the system call that is used to implement all of the above functions. The prototype is:
ru: На 32-битных архитектурах данный системный вызов используется для реализации перечисленных выше функций. Прототип:

source: For more details, see B<llseek>(2).
ru: Подробную информацию смотрите в B<llseek>(2).

source: 64-bit systems don't need an B<_llseek>() system call. Instead, they have an B<lseek>(2) system call that supports 64-bit file offsets.
ru: На 64-битных архитектурах системный вызов B<_llseek>() не требуется. Вместо него в них используется системный вызов B<lseek>(2), поддерживающий 64-битные файловые смещения.
