Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: Associate the loop device with the open file whose file descriptor is passed as the (third) B<ioctl>(2) argument.
ru: Связывает закольцованное устройство с открытым файлом, чей файловый дескриптор передаётся в третьем аргументе B<ioctl>(2).

source: Disassociate the loop device from any file descriptor.
ru: Отвязывает закольцованное устройство от файлового дескриптора.

source: Set the status of the loop device using the (third) B<ioctl>(2) argument. This argument is a pointer to I<loop_info> structure, defined in I<E<lt>linux/loop.hE<gt>> as:
ru: Назначает состояние (передаваемое в третьем аргументе B<ioctl>(2)) закольцованному устройству. Данный аргумент представляет собой указатель на структуру I<loop_info>, определённую в I<E<lt>linux/loop.hE<gt>> следующим образом:

source: struct loop_info { int lo_number; /* ioctl r/o */ dev_t lo_device; /* ioctl r/o */ unsigned long lo_inode; /* ioctl r/o */ dev_t lo_rdevice; /* ioctl r/o */ int lo_offset; int lo_encrypt_type; int lo_encrypt_key_size; /* ioctl w/o */ int lo_flags; /* ioctl r/o */ char lo_name[LO_NAME_SIZE]; unsigned char lo_encrypt_key[LO_KEY_SIZE]; /* ioctl w/o */ unsigned long lo_init[2]; char reserved[4]; };
ru: struct loop_info { int lo_number; /* только чтение из ioctl */ dev_t lo_device; /* только чтение из ioctl */ unsigned long lo_inode; /* только чтение из ioctl */ dev_t lo_rdevice; /* только чтение из ioctl */ int lo_offset; int lo_encrypt_type; int lo_encrypt_key_size; /* только запись ioctl */ int lo_flags; /* только чтение из ioctl */ char lo_name[LO_NAME_SIZE]; unsigned char lo_encrypt_key[LO_KEY_SIZE]; /* только запись ioctl */ unsigned long lo_init[2]; char reserved[4]; };

source: The encryption type (I<lo_encrypt_type>) should be one of B<LO_CRYPT_NONE>, B<LO_CRYPT_XOR>, B<LO_CRYPT_DES>, B<LO_CRYPT_FISH2>, B<LO_CRYPT_BLOW>, B<LO_CRYPT_CAST128>, B<LO_CRYPT_IDEA>, B<LO_CRYPT_DUMMY>, B<LO_CRYPT_SKIPJACK>, or (since Linux 2.6.0) B<LO_CRYPT_CRYPTOAPI>.
ru: Типом шифрования (I<lo_encrypt_type>) должно быть одно из значений: B<LO_CRYPT_NONE>, B<LO_CRYPT_XOR>, B<LO_CRYPT_DES>, B<LO_CRYPT_FISH2>, B<LO_CRYPT_BLOW>, B<LO_CRYPT_CAST128>, B<LO_CRYPT_IDEA>, B<LO_CRYPT_DUMMY>, B<LO_CRYPT_SKIPJACK> или B<LO_CRYPT_CRYPTOAPI> (начиная с Linux 2.6.0).

source: The I<lo_flags> field is a bit mask that can include zero or more of the following:
ru: Поле I<lo_flags> представляет собой битовую маску, в которой может быть ноль или несколько следующих значений:

source: The loopback device is read-only.
ru: Закольцованное устройство доступно только для чтения.

source: B<LO_FLAGS_AUTOCLEAR> (since Linux 2.6.25)
ru: B<LO_FLAGS_AUTOCLEAR> (начиная с Linux 2.6.25)

source: The loopback device will autodestruct on last close.
ru: Закольцованное устройство автоматически уничтожится после закрытия.

source: B<LO_FLAGS_PARTSCAN> (since Linux 3.2)
ru: B<LO_FLAGS_PARTSCAN> (начиная с Linux 3.2)

source: Allow automatic partition scanning.
ru: Разрешено автоматическое сканирования разделов.

source: Get the status of the loop device. The (third) B<ioctl>(2) argument must be a pointer to a I<struct loop_info>.
ru: Получить состояние закольцованного устройства. В третьем аргументе B<ioctl>(2) должен быть задан указатель на структуру I<struct loop_info>.

source: B<LOOP_CHANGE_FD> (since Linux 2.6.5)
ru: B<LOOP_CHANGE_FD> (начиная с Linux 2.6.5)

source: Switch the backing store of the loop device to the new file identified file descriptor specified in the (third) B<ioctl>(2) argument, which is an integer. This operation is possible only if the loop device is read-only and the new backing store is the same size and type as the old backing store.
ru: Поменять источник данных (backing store) закольцованного устройства на новый файл, определяемый файловым дескриптором, указанным в третьем аргументе B<ioctl>(2), представленный целым числом. Данная операция допустима только, если закольцованное устройство доступно только на чтение и новый источник данных имеет тот же размер и тип, использованный ранее.

source: B<LOOP_SET_CAPACITY> (since Linux 2.6.30)
ru: B<LOOP_SET_CAPACITY> (начиная с Linux 2.6.30)

source: Resize a live loop device. One can change the size of the underlying backing store and then use this operation so that the loop driver learns about the new size. This operation takes no argument.
ru: Изменить размер используемого (live) закольцованного устройства. Можно изменить размер используемого источника данных, а затем применить эту операцию для того, чтобы драйвер закольцованных устройств учёл новый размер. У этой операции нет аргументов.

source: Since Linux 2.6, there are two new B<ioctl>(2) operations:
ru: Начиная с Linux 2.6, появилось две новые операции B<ioctl>(2):

source: These are similar to B<LOOP_SET_STATUS> and B<LOOP_GET_STATUS> described above but use the I<loop_info64> structure, which has some additional fields and a larger range for some other fields:
ru: Они подобны описанным выше B<LOOP_SET_STATUS> и B<LOOP_GET_STATUS>, но используют структуру I<loop_info64>, в которой есть несколько дополнительных полей, а некоторым другим полям назначены типы с большим диапазоном значений:

source: struct loop_info64 { uint64_t lo_device; /* ioctl r/o */ uint64_t lo_inode; /* ioctl r/o */ uint64_t lo_rdevice; /* ioctl r/o */ uint64_t lo_offset; uint64_t lo_sizelimit;/* bytes, 0 == max available */ uint32_t lo_number; /* ioctl r/o */ uint32_t lo_encrypt_type; uint32_t lo_encrypt_key_size; /* ioctl w/o */ uint32_t lo_flags; /* ioctl r/o */ uint8_t lo_file_name[LO_NAME_SIZE]; uint8_t lo_crypt_name[LO_NAME_SIZE]; uint8_t lo_encrypt_key[LO_KEY_SIZE]; /* ioctl w/o */ uint64_t lo_init[2]; };
ru: struct loop_info64 { uint64_t lo_device; /* только чтение из ioctl */ uint64_t lo_inode; /* только чтение из ioctl */ uint64_t lo_rdevice; /* только чтение из ioctl */ uint64_t lo_offset; uint64_t lo_sizelimit;/* в байтах, 0 == макс. доступный */ uint32_t lo_number; /* только чтение из ioctl */ uint32_t lo_encrypt_type; uint32_t lo_encrypt_key_size; /* только запись из ioctl */ uint32_t lo_flags; /* только чтение из ioctl */ uint8_t lo_file_name[LO_NAME_SIZE]; uint8_t lo_crypt_name[LO_NAME_SIZE]; uint8_t lo_encrypt_key[LO_KEY_SIZE]; /* только запись из ioctl */ uint64_t lo_init[2]; };

source: Since Linux 3.1, the kernel provides the I</dev/loop-control> device, which permits an application to dynamically find a free device, and to add and remove loop devices from the system. To perform these operations, one first opens I</dev/loop-control> and then employs one of the following B<ioctl>(2) operations:
ru: Начиная с Linux 3.1, ядро предоставляет устройство I</dev/loop-control>, которое позволяет приложению динамически находить свободное устройство, добавлять и удалять закольцованные устройства из системы. Для выполнения этих операций сначала открывается I</dev/loop-control>, а затем выполняется одна из следующих операций B<ioctl>(2):

source: Allocate or find a free loop device for use. On success, the device number is returned as the result of the call. This operation takes no argument.
ru: Выделяет или ищет свободное закольцованное устройства для работы. При успешном выполнении возвращается номер устройства. У операции нет аргументов.

source: Add the new loop device whose device number is specified as a long integer in the third B<ioctl>(2) argument. On success, the device index is returned as the result of the call. If the device is already allocated, the call fails with the error B<EEXIST>.
ru: Добавляет новое закольцованное устройство; номер устройства передаётся в виде длинного целого в третьем аргументе B<ioctl>(2). При успешном выполнении возвращается индекс устройства. Если устройство уже выделено, то вызов завершается с ошибкой B<EEXIST>.

source: Remove the loop device whose device number is specified as a long integer in the third B<ioctl>(2) argument. On success, the device number is returned as the result of the call. If the device is in use, the call fails with the error B<EBUSY>.
ru: Удаляет закольцованное устройство; номер устройства передаётся в виде длинного целого в третьем аргументе B<ioctl>(2). При успешном выполнении возвращается номер устройства. Если устройство используется, то вызов завершается с ошибкой B<EBUSY>.

source: FILES
ru: ФАЙЛЫ

source: The loop block special device files.
ru: Специальные закольцованные файлы устройств.

source: EXAMPLE
ru: ПРИМЕР

source: The program below uses the I</dev/loop-control> device to find a free loop device, opens the loop device, opens a file to be used as the underlying storage for the device, and then associates the loop device with the backing store. The following shell session demonstrates the use of the program:
ru: Программа, представленная ниже, используется устройство I</dev/loop-control> для поиска свободного закольцованного устройства, открывает закольцованное устройство, открывает файл, который нужно использовать в качестве источника данных, и связывает закольцованное устройство с источником. Демонстрация работы программы:

source: Program source
ru: Исходный код программы

source: if (argc != 2) { fprintf(stderr, "Usage: %s backing-file\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "Использование: %s файл-источник\en", argv[0]); exit(EXIT_FAILURE); }

source: lp - line printer devices
ru: lp - устройства для работы с принтерами

source: CONFIGURATION
ru: НАСТРОЙКА

source: B<lp>[0\(en2] are character devices for the parallel line printers; they have major number 6 and minor number 0\(en2. The minor numbers correspond to the printer port base addresses 0x03bc, 0x0378 and 0x0278. Usually they have mode 220 and are owned by root and group lp. You can use printer ports either with polling or with interrupts. Interrupts are recommended when high traffic is expected, for example, for laser printers. For typical dot matrix printers, polling will usually be enough. The default is polling.
ru: B<lp>[0\(en2] \(em это символьные устройства для работы с принтерами, подключёнными к параллельному порту; они имеют старший номер 6 и младшие номера 0\(en2. Младший номер соответствует базовому адресу порта принтера 0x03bc, 0x0378 и 0x0278, соответственно. Обычно режим доступа к ним устанавливается 220, и они принадлежат root и группе lp. Управлять принтерами можно при помощи опроса или при помощи прерываний. Прерывания рекомендуются при высоких скоростях печати, например, для лазерных принтеров. Для обычных матричных принтеров будет достаточно опроса. По умолчанию устанавливается режим опроса.

source: The following B<ioctl>(2) calls are supported:
ru: Поддерживаются следующие вызовы B<ioctl>(2):

source: Sets the amount of time that the driver sleeps before rechecking the printer when the printer's buffer appears to be filled to I<arg>. If you have a fast printer, decrease this number; if you have a slow printer, then increase it. This is in hundredths of a second, the default 2 being 0.02 seconds. It influences only the polling driver.
ru: Устанавливает время между опросами принтера драйвером равным I<arg>, если заполнен буфер принтера. Если принтер быстрый, то лучше уменьшить это число, а если медленный, то лучше увеличить. Значение выражается в сотых долях секунды; по умолчанию равно 2, что означает 0,02 секунды. Влияет только на драйвер опроса.

source: Sets the maximum number of busy-wait iterations which the polling driver does while waiting for the printer to get ready for receiving a character to I<arg>. If printing is too slow, increase this number; if the system gets too slow, decrease this number. The default is 1000. It influences only the polling driver.
ru: Устанавливает максимальное количество циклов равным I<arg>, в течение которых драйвер опроса ожидает готовность принтера к приёму символа. Если печать медленная, то рекомендуется увеличить это число, а если система начинает медленно работать, то уменьшить. По умолчанию равно 1000. Влияет только на драйвер опроса.

source: If I<arg> is 0, the printer driver will retry on errors, otherwise it will abort. The default is 0.
ru: Если I<arg> равно 0, то драйвер принтера будет повторять попытки при ошибках, в противном случае он прекратит работу. По умолчанию равно 0.

source: If I<arg> is 0, B<open>(2) will be aborted on error, otherwise error will be ignored. The default is to ignore it.
ru: Если I<arg> равно 0, то B<open>(2) будет прерван при ошибке, иначе ошибка будет проигнорирована. По умолчанию равно 0.

source: If I<arg> is 0, then the out-of-paper, offline, and error signals are required to be false on all writes, otherwise they are ignored. The default is to ignore them.
ru: Если I<arg> равно 0, то для записи необходимо, чтобы сигналы нехватки бумаги, принтер выключен или ошибка, были не установлены. По умолчанию они игнорируются.

source: Sets the number of busy waiting iterations to wait before strobing the printer to accept a just-written character, and the number of iterations to wait before turning the strobe off again, to I<arg>. The specification says this time should be 0.5 microseconds, but experience has shown the delay caused by the code is already enough. For that reason, the default value is 0. This is used for both the polling and the interrupt driver.
ru: Устанавливает число циклов ожидания в значение I<arg>, которые выполняются перед стробированием принтера для получения только что записанного символа, а также устанавливает число циклов ожидания до остановки стробирования. В спецификации сказано, что это время должно равняться 0,5 микросекунды, но опыт показал, что хватает и времени задержки при выполнении программы. Поэтому устанавливаемое значение по умолчанию равно 0. Используется как в драйвере опроса, так и драйвере прерывания.

source: This B<ioctl>(2) requires superuser privileges. It takes an I<int> containing the new IRQ as argument. As a side effect, the printer will be reset. When I<arg> is 0, the polling driver will be used, which is also default.
ru: Этот B<ioctl>(2) требует прав суперпользователя. Он принимает I<int>, содержащий новый номер IRQ. Побочный эффект \(em повторный запуск принтера. Если I<arg> равно 0, то будет использован драйвер опроса (по умолчанию).

source: Stores the currently used IRQ in I<arg>.
ru: Сохраняет используемый в данный момент номер IRQ в I<arg>.

source: Stores the value of the status port in I<arg>. The bits have the following meaning:
ru: Сохраняет значение состояния порта в I<arg>. Биты имеют следующее значение:

source: inverted busy input, active high
ru: инвертированный входной сигнал занятости, активен по высокому уровню

source: unchanged acknowledge input, active low
ru: неизменённый входной сигнал подтверждения, активен по низкому уровню

source: unchanged out-of-paper input, active high
ru: неизменённый входной сигнал отсутствия бумаги, активен по высокому уровню

source: unchanged selected input, active high
ru: неизменённый входной сигнал выбора, активен по высокому уровню

source: unchanged error input, active low
ru: неизменённый входной сигнал ошибки, активен по низкому уровню

source: Refer to your printer manual for the meaning of the signals. Note that undocumented bits may also be set, depending on your printer.
ru: Обратитесь к руководству принтера для выяснения значения сигналов. Заметим, что в зависимости от принтера неописанные биты тоже могут иметь значение.

source: Resets the printer. No argument is used.
ru: Перезапускает принтер. Аргументы не используются.

source: ldconfig - configure dynamic linker run-time bindings
ru: ldconfig - настройка связывания времени выполнения в динамическом компоновщике

source: B</sbin/ldconfig> [B<-nNvXV>] [B<-f> I<conf>] [B<-C> I<cache>] [B<-r> I<root>] I<directory>...
ru: B</sbin/ldconfig> [B<-nNvXV>] [B<-f> I<conf>] [B<-C> I<кэш>] [B<-r> I<корень>] I<каталог>…

source: B</sbin/ldconfig> B<-l> [B<-v>] I<library>...
ru: B</sbin/ldconfig> B<-l> [B<-v>] I<библиотека>…

source: B<ldconfig> creates the necessary links and cache to the most recent shared libraries found in the directories specified on the command line, in the file I</etc/ld.so.conf>, and in the trusted directories, I</lib> and I</usr/lib> (on some 64-bit architectures such as x86-64, I</lib> and I</usr/lib> are the trusted directories for 32-bit libraries, while I</lib64> and I</usr/lib64> are used for 64-bit libraries).
ru: Программа B<ldconfig> создаёт необходимые ссылки и кэш для самых новых общих библиотек, найденных в каталогах, которые указаны в командной строке, в файле I</etc/ld.so.conf> и в доверенные каталогах I</lib> и I</usr/lib> (на некоторых 64-битных архитектурах, таких как x86-64, I</lib> и I</usr/lib> являются доверительными каталогами для 32-битных библиотек, а каталоги I</lib64> и I</usr/lib64> используются для 64-битных библиотек).

source: The cache is used by the run-time linker, I<ld.so> or I<ld-linux.so>. B<ldconfig> checks the header and filenames of the libraries it encounters when determining which versions should have their links updated.
ru: Кэш используется компоновщиком времени выполнения, I<ld.so> или I<ld-linux.so>. B<ldconfig> проверяет заголовок и имена файлов встречающихся библиотек, при определении для каких версий нужно обновить ссылки.

source: B<ldconfig> will attempt to deduce the type of ELF libraries (i.e., libc5 or libc6/glibc) based on what C libraries, if any, the library was linked against.
ru: B<ldconfig> будет пытаться вывести заключение о типе библиотек ELF (т.е. libc5 или libc6/glibc), основанных на библиотеках языка C и о том какая библиотека должна быть связана.

source: Some existing libraries do not contain enough information to allow the deduction of their type. Therefore, the I</etc/ld.so.conf> file format allows the specification of an expected type. This is used I<only> for those ELF libraries which we can not work out. The format is "dirname=TYPE", where TYPE can be libc4, libc5, or libc6. (This syntax also works on the command line.) Spaces are I<not> allowed. Also see the B<-p> option. B<ldconfig> should normally be run by the superuser as it may require write permission on some root owned directories and files.
ru: Некоторые существующие библиотеки не содержат необходимую информацию для определения их типа. В виду этого, задать ожидаемый тип можно через файл I</etc/ld.so.conf>. Эта возможность используется I<только> для тех библиотек ELF, с которыми иначе невозможно работать. Формат выглядит как «каталог=ТИП», где ТИП может принимать значение libc4, libc5 или libc6 (данный синтаксис работает также и в командной строке). Пробелы I<не> разрешаются. Также смотрите параметр B<-p>. Программа B<ldconfig> обычно должна запускаться суперпользователем, так как выполнение может требовать прав на запись в некоторые каталоги и файлы, владельцем которых является root.

source: OPTIONS
ru: ПАРАМЕТРЫ

source: (Since glibc 2.2) Cache format to use: I<old>, I<new>, or I<compat> (default).
ru: (начиная с glibc 2.2) Используемые форматы кэша: I<old>, I<new> или I<compat> (по умолчанию).

source: B<-C >I<cache>
ru: B<-C >I<кэш>

source: Use I<cache> instead of I</etc/ld.so.cache>.
ru: Использовать I<кэш> вместо I</etc/ld.so.cache>.

source: Use I<conf> instead of I</etc/ld.so.conf>.
ru: Использовать I<conf> вместо I</etc/ld.so.conf>.

source: (Since glibc 2.7) Ignore auxiliary cache file.
ru: (начиная с glibc 2.7) Игнорировать вспомогательный файл кэша.

source: (Since glibc 2.2) Library mode. Manually link individual libraries. Intended for use by experts only.
ru: (начиная с glibc 2.2) Библиотечный режим. Компоновать отдельные библиотеки вручную. Предназначен только для экспертов.

source: Process only the directories specified on the command line. Don't process the trusted directories, nor those specified in I</etc/ld.so.conf>. Implies B<-N>.
ru: Обрабатывать только каталоги, заданные в командной строке. Не обрабатывать доверенные каталоги и заданные в I</etc/ld.so.conf>. Неявно включает B<-N>.

source: Don't rebuild the cache. Unless B<-X> is also specified, links are still updated.
ru: Не перестраивать кэш. Если также не указан B<-X>, то ссылки по-прежнему обновляются.

source: Print the lists of directories and candidate libraries stored in the current cache.
ru: Выдать список каталогов и библиотек-кандидатов, хранящихся в текущем кэше.

source: B<-r >I<root>
ru: B<-r >I<корень>

source: Change to and use I<root> as the root directory.
ru: Сменить каталог и использовать I<корень> в качестве корневого каталога.

source: Verbose mode. Print current version number, the name of each directory as it is scanned, and any links that are created. Overrides quiet mode.
ru: Режим детализации. Выдаётся номер текущей версии, имя каждого каталога, который сканируется, и все создаваемые символьные ссылки. Выключает режим молчания.

source: Print program version.
ru: Показать версию программы.

source: Don't update links. Unless B<-N> is also specified, the cache is still rebuilt.
ru: Не обновлять ссылки. Если также не указан B<-N>, кэш по-прежнему перестраивается.

source: Run-time linker/loader.
ru: Компоновщик/загрузчик времени выполнения.

source: File containing a list of directories, one per line, in which to search for libraries.
ru: Файл, содержащий список каталогов (по одному на строку), в которых производится поиск библиотек.

source: File containing an ordered list of libraries found in the directories specified in I</etc/ld.so.conf>, as well as those found in the trusted directories.
ru: Файл, содержащий сортированный список библиотек, найденных в каталогах, заданных в I</etc/ld.so.conf>, а также в доверительных каталогах.

source: ld.so, ld-linux.so - dynamic linker/loader
ru: ld.so, ld-linux.so - динамический компоновщик/загрузчик

source: The dynamic linker can be run either indirectly by running some dynamically linked program or shared object (in which case no command-line options to the dynamic linker can be passed and, in the ELF case, the dynamic linker which is stored in the B<.interp> section of the program is executed) or directly by running:
ru: Динамический компоновщик может запускаться неявно из динамически скомпонованной программы или общего объекта (в этом случае динамическому компоновщику невозможно передать параметры командной строки, как и в случае с ELF, когда динамический компоновщик хранится в разделе B<.interp> исполняемой программы) или явно с помощью вызова:

source: I</lib/ld-linux.so.*> [OPTIONS] [PROGRAM [ARGUMENTS]]
ru: I</lib/ld-linux.so.*> [ПАРАМЕТРЫ] [ПРОГРАММА [АРГУМЕНТЫ]]

source: The programs B<ld.so> and B<ld-linux.so*> find and load the shared objects (shared libraries) needed by a program, prepare the program to run, and then run it.
ru: Программы B<ld.so> и B<ld-linux.so*> ищут и загружают общие объекты (общие библиотеки), необходимые программе, а также подготавливают программу к запуску и запускают её.

source: Linux binaries require dynamic linking (linking at run time) unless the B<-static> option was given to B<ld>(1) during compilation.
ru: Для двоичных файлов Linux требуется динамическая компоновка (компоновка во время выполнения), если при сборке программе B<ld>(1) не был передан параметр B<-static>.
