Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: In the early to mid 1990s, there was for a while I<Linux libc>, a fork of glibc 1.x created by Linux developers who felt that glibc development at the time was not sufficing for the needs of Linux. Often, this library was referred to (ambiguously) as just "libc". Linux libc released major versions 2, 3, 4, and 5, as well as many minor versions of those releases. Linux libc4 was the last version to use the a.out binary format, and the first version to provide (primitive) shared library support. Linux libc 5 was the first version to support the ELF binary format; this version used the shared library soname I<libc.so.5>. For a while, Linux libc was the standard C library in many Linux distributions.
ru: В первой половине 1990х годов какое-то время существовала I<Linux libc>, ответвление glibc 1.x, созданное разработчиками Linux, которые были не удовлетворены ходом разработки glibc для Linux. Часто, эту библиотеку называли (необоснованно) просто «libc». Было несколько основных версий Linux libc — 2, 3, 4 и 5, а также много промежуточных. Linux libc4 была последней версией, которая использовала формат двоичных файлов a.out и первой версий предоставившей (простейшую) поддержку общих библиотек. Linux libc 5 была первой версией с поддержкой формата двоичных файлов ELF; в этой версии использовалась общая библиотека с soname I<libc.so.5>. Некоторое время Linux libc была стандартной библиотекой Си во многих дистрибутивах Linux.

source: However, notwithstanding the original motivations of the Linux libc effort, by the time glibc 2.0 was released (in 1997), it was clearly superior to Linux libc, and all major Linux distributions that had been using Linux libc soon switched back to glibc. To avoid any confusion with Linux libc versions, glibc 2.0 and later used the shared library soname I<libc.so.6>.
ru: Однако, несмотря на всю первоначальную заинтересованность в разработке Linux libc, к этому времени была выпущена glibc 2.0 (в 1997 году), которая была однозначно лучше Linux libc, и все основные дистрибутивы Linux, которые использовали Linux libc, скоро переключились обратно на glibc. Чтобы избежать двусмысленности в версиях Linux libc, в glibc 2.0 и последующих версиях в качестве имени общей библиотеки используется soname I<libc.so.6>.

source: Since the switch from Linux libc to glibc 2.0 occurred long ago, I<man-pages> no longer takes care to document Linux libc details. Nevertheless, the history is visible in vestiges of information about Linux libc that remain in a few manual pages, in particular, references to I<libc4> and I<libc5>.
ru: Так как переход с Linux libc на glibc 2.0 произошёл давно, в I<man-pages> Linux libc больше не описывается. Тем не менее частичные упоминания о Linux libc ещё встречаются в некоторых справочных страницах под именами I<libc4> и I<libc5>.

source: Other C libraries
ru: Другие библиотеки C

source: There are various other less widely used C libraries for Linux. These libraries are generally smaller than glibc, both in terms of features and memory footprint, and often intended for building small binaries, perhaps targeted at development for embedded Linux systems. Among such libraries are E<.UR http://www.uclibc.org/> I<uClibc> E<.UE ,> E<.UR http://www.fefe.de/dietlibc/> I<dietlibc> E<.UE ,> and E<.UR http://www.musl-libc.org/> I<musl libc> E<.UE .> Details of these libraries are covered by the I<man-pages> project, where they are known.
ru: Существует несколько других менее распространённых библиотек C для Linux Эти библиотеки, обычно, меньше glibc, как по возможностям так и по потреблению памяти, и часто предназначены для сборки исполняемых файлов малого размера, используемых, в основном, для разработки встраиваемых систем Linux. Такими библиотеками являются E<.UR http://www.uclibc.org/> I<uClibc> E<.UE ,> E<.UR http://www.fefe.de/dietlibc/> I<dietlibc> E<.UE ,> и E<.UR http://www.musl-libc.org/> I<musl libc> E<.UE .> Описание этих библиотек охватывается проектом I<man-pages>, если что-то известно.

source: locale - description of multilanguage support
ru: locale - описание поддержки нескольких языков

source: A locale is a set of language and cultural rules. These cover aspects such as language for messages, different character sets, lexicographic conventions, and so on. A program needs to be able to determine its locale and act accordingly to be portable to different cultures.
ru: Локаль — это сочетание языковых и культурных аспектов. Они включают в себя: язык сообщений, различные наборы символов, лексикографические соглашения и т.п. Программа должна определять локализацию и действовать согласно её установкам в целях достижения взаимосвязи различных культур.

source: The header I<E<lt>locale.hE<gt>> declares data types, functions and macros which are useful in this task.
ru: Файл I<E<lt>locale.hE<gt>> описывает типы данных, функции и макросы, необходимые для выполнения этой задачи.

source: The functions it declares are B<setlocale>(3) to set the current locale, and B<localeconv>(3) to get information about number formatting.
ru: В нём описаны функции: B<setlocale>(3), устанавливающая текущую локаль и B<localeconv>(3), которая возвращает информацию о форматировании чисел.

source: There are different categories for locale information a program might need; they are declared as macros. Using them as the first argument to the B<setlocale>(3) function, it is possible to set one of these to the desired locale:
ru: Существуют различные категории информации в локали, которые программа может использовать; они описаны как макросы. Используя их в качестве первого аргумента функции B<setlocale>(3), можно установить значение значение категории в желаемой локали:

source: B<LC_ADDRESS> (GNU extension, since glibc 2.2)
ru: B<LC_ADDRESS> (расширение GNU, начиная с glibc 2.2)

source: Change settings that describe the formats (e.g., postal addresses) used to describe locations and geography-related items. Applications that need this information can use B<nl_langinfo>(3) to retrieve nonstandard elements, such as B<_NL_ADDRESS_COUNTRY_NAME> (country name, in the language of the locale) and B<_NL_ADDRESS_LANG_NAME> (language name, in the language of the locale), which return strings such as "Deutschland" and "Deutsch" (for German-language locales). (Other element names are listed in I<E<lt>langinfo.hE<gt>>.)
ru: Изменяет настройки, которые описывают форматы (например, почтовый адрес), используемые для описания местонахождения и географических объектов. Приложения, в которых требуется эта информация, могут использовать функцию B<nl_langinfo>(3) для получения нестандартных элементов, таких как B<_NL_ADDRESS_COUNTRY_NAME> (название страны на языке локали) и B<_NL_ADDRESS_LANG_NAME> (название языка на языке локали), которая возвращает строку, например «Deutschland» и «Deutsch» (для локалей с немецким языком) (остальные названия элементов перечислены в I<E<lt>langinfo.hE<gt>>).

source: This category governs the collation rules used for sorting and regular expressions, including character equivalence classes and multicharacter collating elements. This locale category changes the behavior of the functions B<strcoll>(3) and B<strxfrm>(3), which are used to compare strings in the local alphabet. For example, the German sharp s is sorted as "ss".
ru: Эта категория определяет правила сравнения, используемые при сортировке и регулярных выражениях, включая равенство классов символов и сравнение многосимвольных элементов. Эта категория локали изменяет поведение функций B<strcoll>(3) и B<strxfrm>(3), которые используются для сравнения строк с учётом местного алфавита. Например, немецкая эсцет (sharp s) рассматривается как «ss».

source: This category determines the interpretation of byte sequences as characters (e.g., single versus multibyte characters), character classifications (e.g., alphabetic or digit), and the behavior of character classes. On glibc systems, this category also determines the character transliteration rules for B<iconv>(1) and B<iconv>(3). It changes the behavior of the character handling and classification functions, such as B<isupper>(3) and B<toupper>(3), and the multibyte character functions such as B<mblen>(3) or B<wctomb>(3).
ru: Эта категория определяет интерпретацию последовательности байт в символы (например, одиночный или многобайтовый символ), классификацию символов (например, буквенный или цифровой) и поведение классов символов. В системах с glibc эта категория также определяет правила транслитерации символов для B<iconv>(1) и B<iconv>(3). Она изменяет поведение функций обработки и классификации символов, таких как B<isupper>(3) и B<toupper>(3), а также многобайтных символьных функций, таких как B<mblen>(3) или B<wctomb>(3).

source: B<LC_IDENTIFICATION> (GNU extension, since glibc 2.2)
ru: B<LC_IDENTIFICATION> (расширение GNU, начиная с glibc 2.2)

source: Change settings that relate to the metadata for the locale. Applications that need this information can use B<nl_langinfo>(3) to retrieve nonstandard elements, such as B<_NL_IDENTIFICATION_TITLE> (title of this locale document) and B<_NL_IDENTIFICATION_TERRITORY> (geographical territory to which this locale document applies), which might return strings such as "English locale for the USA" and "USA". (Other element names are listed in I<E<lt>langinfo.hE<gt>>.)
ru: Изменяет настройки, которые относятся к метаданным локали. Приложения, в которых требуется эта информация, могут использовать функцию B<nl_langinfo>(3) для получения нестандартных элементов, таких как B<_NL_IDENTIFICATION_TITLE> (заголовок данной локали) и B<_NL_IDENTIFICATION_TERRITORY> (географическое расположение, для которой создавалась локаль), которая возвращает строку, например «English locale for the USA» и «USA» (остальные названия элементов перечислены в I<E<lt>langinfo.hE<gt>>).

source: This category determines the formatting used for monetary-related numeric values. This changes the information returned by B<localeconv>(3), which describes the way numbers are usually printed, with details such as decimal point versus decimal comma. This information is internally used by the function B<strfmon>(3).
ru: Эта категория определяет форматирования, используемое для денежных значений. Она изменяет информацию, возвращаемую функцией B<localeconv>(3) , которая описывает способ отображения числа, например, необходимо ли использовать в качестве десятичного разделителя точку или запятую. Эта информация используется в функции B<strfmon>(3).

source: This category affects the language in which messages are displayed and what an affirmative or negative answer looks like. The GNU C library contains the B<gettext>(3), B<ngettext>(3), and B<rpmatch>(3) functions to ease the use of this information. The GNU gettext family of functions also obey the environment variable B<LANGUAGE> (containing a colon-separated list of locales) if the category is set to a valid locale other than B<"C">. This category also affects the behavior of B<catopen>(3).
ru: Эта категория изменяет язык отображаемых сообщений и указывает, как должны выглядеть положительный и отрицательный ответы. Библиотека GNU C содержит функции B<gettext>(3), B<ngettext>(3) и B<rpmatch>(3) для более удобного использования этой информации. Семейство функций GNU gettext так же учитывает переменную окружения B<LANGUAGE> (содержащую через двоеточие список локалей), если указана допустимая локаль, отличная от B<"C">. Данная категория также влияет на поведение B<catopen>(3).

source: B<LC_MEASUREMENT> (GNU extension, since glibc 2.2)
ru: B<LC_MEASUREMENT> (расширение GNU, начиная с glibc 2.2)

source: Change the settings relating to the measurement system in the locale (i.e., metric versus US customary units). Applications can use B<nl_langinfo>(3) to retrieve the nonstandard B<_NL_MEASUREMENT_MEASUREMENT> element, which returns a pointer to a character that has the value 1 (metric) or 2 (US customary units).
ru: Изменяет настройки, которые в локали описывают систему мер (то есть, метрическую систему мер и систему мер США (US customary unit)). Приложения, в которых требуется эта информация, могут использовать функцию B<nl_langinfo>(3) для получения нестандартного элемента B<_NL_MEASUREMENT_MEASUREMENT>, которая возвращает 1 (метрическая) или 2 (система мер США).

source: B<LC_NAME> (GNU extension, since glibc 2.2)
ru: B<LC_NAME> (расширение GNU, начиная с glibc 2.2)

source: Change settings that describe the formats used to address persons. Applications that need this information can use B<nl_langinfo>(3) to retrieve nonstandard elements, such as B<_NL_NAME_NAME_MR> (general salutation for men) and B<_NL_NAME_NAME_MS> (general salutation for women) elements, which return strings such as "Herr" and "Frau" (for German-language locales). (Other element names are listed in I<E<lt>langinfo.hE<gt>>.)
ru: Изменяет настройки, которые описывают форматы, используемые для описания персон. Приложения, в которых требуется эта информация, могут использовать функцию B<nl_langinfo>(3) для получения нестандартных элементов, таких как B<_NL_NAME_NAME_MR> (приветствие мужчин) и B<_NL_NAME_NAME_MS> (приветствие женщин), которая возвращает строку, например «Herr» и «Frau» (для локалей с немецким языком) (остальные названия элементов перечислены в I<E<lt>langinfo.hE<gt>>).

source: This category determines the formatting rules used for nonmonetary numeric values\(emfor example, the thousands separator and the radix character (a period in most English-speaking countries, but a comma in many other regions). It affects functions such as B<printf>(3), B<scanf>(3), and B<strtod>(3). This information can also be read with the B<localeconv>(3) function.
ru: Эта категория определяет правила форматирования, используемые для не денежных значений; например, разделительный символ тысяч и дробной части (точка в англоязычных странах, и запятая во многих других). Она влияет на поведение функций B<printf>(3), B<scanf>(3) и B<strtod>(3). Эта информация может быть также прочитана при помощи функции B<localeconv>(3).

source: B<LC_PAPER> (GNU extension, since glibc 2.2)
ru: B<LC_PAPER> (расширение GNU, начиная с glibc 2.2)

source: Change the settings relating to the dimensions of the standard paper size (e.g., US letter versus A4). Applications that need the dimensions can obtain them by using B<nl_langinfo>(3) to retrieve the nonstandard B<_NL_PAPER_WIDTH> and B<_NL_PAPER_HEIGHT> elements, which return I<int> values specifying the dimensions in millimeters.
ru: Изменяет настройки, которые относятся к размерам стандартных листов бумаги (например, письмо США и A4). Приложения, в которых требуется эта информация, могут использовать функцию B<nl_langinfo>(3) для получения нестандартных элементов, таких как B<_NL_PAPER_WIDTH> и B<_NL_PAPER_HEIGHT> которая возвращает значение I<int>, определяющее размер в миллиметрах.

source: B<LC_TELEPHONE> (GNU extension, since glibc 2.2)
ru: B<LC_TELEPHONE> (расширение GNU, начиная с glibc 2.2)

source: Change settings that describe the formats to be used with telephone services. Applications that need this information can use B<nl_langinfo>(3) to retrieve nonstandard elements, such as B<_NL_TELEPHONE_INT_PREFIX> (international prefix used to call numbers in this locale), which returns a string such as "49" (for Germany). (Other element names are listed in I<E<lt>langinfo.hE<gt>>.)
ru: Изменяет настройки, которые описывают форматы, используемые службах телефонии. Приложения, в которых требуется эта информация, могут использовать функцию B<nl_langinfo>(3) для получения нестандартных элементов, таких как B<_NL_TELEPHONE_INT_PREFIX> (международный префикс, используемые для номеров звонков в этой локали), которая возвращает строку, например «49» (для Германии) (остальные названия элементов перечислены в I<E<lt>langinfo.hE<gt>>).

source: This category governs the formatting used for date and time values. For example, most of Europe uses a 24-hour clock versus the 12-hour clock used in the United States. The setting of this category affects the behavior of functions such as B<strftime>(3) and B<strptime>(3).
ru: Эта категория управляет форматированием значений даты и времени. Например, большая часть Европы использует 24-часовой формат, тогда как в США используют 12-часовой.Значение этой категории влияет на поведение функции B<strftime>(3) и B<strptime>(3).

source: All of the above.
ru: Всё вышеперечисленное.

source: If the second argument to B<setlocale>(3) is an empty string, I<"">, for the default locale, it is determined using the following steps:
ru: Если второй аргумент функции B<setlocale>(3) равен пустой строке, I<"">, то локаль по умолчанию будет определяться следующим образом:

source: If there is a non-null environment variable B<LC_ALL>, the value of B<LC_ALL> is used.
ru: Если существует непустая переменная окружения B<LC_ALL>, то используется её значение.

source: If an environment variable with the same name as one of the categories above exists and is non-null, its value is used for that category.
ru: Если существует переменная окружения с именем одной из вышеописанных категорий и она непустая, то её значение присваивается этой категории.

source: If there is a non-null environment variable B<LANG>, the value of B<LANG> is used.
ru: Если существует непустая переменная окружения B<LANG>, то используется её значение.

source: Values about local numeric formatting is made available in a I<struct lconv> returned by the B<localeconv>(3) function, which has the following declaration:
ru: Информация о локальном форматировании чисел доступна в структуре I<struct lconv>, возвращаемой функцией B<localeconv>(3) , которая описана следующим образом:

source: /* Numeric (nonmonetary) information */
ru: /* Информация о числах (не связанная с деньгами) */

source: char *decimal_point; /* Radix character */ char *thousands_sep; /* Separator for digit groups to left of radix character */ char *grouping; /* Each element is the number of digits in a group; elements with higher indices are further left. An element with value CHAR_MAX means that no further grouping is done. An element with value 0 means that the previous element is used for all groups further left. */
ru: char *decimal_point; /* Символ разделителя дробной части */ char *thousands_sep; /* Разделитель групп цифр слева от символа разделителя дробной части */ char *grouping; /* Каждый элемент является номером цифры в группе; элементы c большими номерами находятся левее. Элемент с значением CHAR_MAX означает, что группировка завершена. Элемент со значением 0 указывает, что предыдущий элемент используется для всех групп, находящихся левее. */

source: /* Remaining fields are for monetary information */
ru: /* В оставшихся полях указывается информация о денежных величинах */

source: char *int_curr_symbol; /* First three chars are a currency symbol from ISO 4217. Fourth char is the separator. Fifth char is \(aq\e0\(aq. */ char *currency_symbol; /* Local currency symbol */ char *mon_decimal_point; /* Radix character */ char *mon_thousands_sep; /* Like I<thousands_sep> above */ char *mon_grouping; /* Like I<grouping> above */ char *positive_sign; /* Sign for positive values */ char *negative_sign; /* Sign for negative values */ char int_frac_digits; /* International fractional digits */ char frac_digits; /* Local fractional digits */ char p_cs_precedes; /* 1 if currency_symbol precedes a positive value, 0 if succeeds */ char p_sep_by_space; /* 1 if a space separates currency_symbol from a positive value */ char n_cs_precedes; /* 1 if currency_symbol precedes a negative value, 0 if succeeds */ char n_sep_by_space; /* 1 if a space separates currency_symbol from a negative value */ /* Positive and negative sign positions: 0 Parentheses surround the quantity and currency_symbol. 1 The sign string precedes the quantity and currency_symbol. 2 The sign string succeeds the quantity and currency_symbol. 3 The sign string immediately precedes the currency_symbol. 4 The sign string immediately succeeds the currency_symbol. */ char p_sign_posn; char n_sign_posn; };
ru: char *int_curr_symbol; /* Первые три символа являются символом валюты, согласно ISO 4217. Четвёртый символ является разделителем. Пятый символ равен \(aq\e0\(aq. */ char *currency_symbol; /* Местный символ валюты */ char *mon_decimal_point; /* Символ разделителя дробной части */ char *mon_thousands_sep; /* Как I<thousands_sep> */ char *mon_grouping; /* Как I<grouping> */ char *positive_sign; /* Знак положительных значений */ char *negative_sign; /* Знак отрицательных значений */ char int_frac_digits; /* Представление дробных чисел в международном формате */ char frac_digits; /* Представление дробных чисел в локальном формате */ char p_cs_precedes; /* 1, если символ валюты указывается перед положительным значение, 0 — если следует за ним. */ char p_sep_by_space; /* 1, если пробел отделяет символ валюты от положительного значения */ char n_cs_precedes; /* 1, если символ валюты предшествует отрицательному значению, 0, если следует за ним */ char n_sep_by_space; /* 1, если пробел отделяет символ валюты от отрицательного значения */ /* Позиция положительного или отрицательного знака: 0 Скобки окружают количество и символ валюты. 1 Знак предшествует количеству и символу валюты. 2 Знак следует за количеством и символом валюты. 3 Знак непосредственно предшествует символу валюты. 4 Знак непосредственно следует за символом валюты. */ char p_sign_posn; char n_sign_posn; };

source: POSIX.1-2008 extensions to the locale API
ru: Расширения POSIX.1-2008 программного интерфейса локали

source: POSIX.1-2008 standardized a number of extensions to the locale API, based on implementations that first appeared in version 2.3 of the GNU C library. These extensions are designed to address the problem that the traditional locale APIs do not mix well with multithreaded applications and with applications that must deal with multiple locales.
ru: В POSIX.1-2008 стандартизовано несколько расширений программного интерфейса локали на основе реализаций, которые впервые появились в версии 2.3 библиотеки GNU C. Эти расширения разработаны для решения проблем, возникающих у обычного программного интерфейса локали в многонитевых приложениях и приложениях, которые должны работать с несколькими локалями.

source: The extensions take the form of new functions for creating and manipulating locale objects (B<newlocale>(3), B<freelocale>(3), B<duplocale>(3), and B<uselocale>(3)) and various new library functions with the suffix "_l" (e.g., B<toupper_l>(3)) that extend the traditional locale-dependent APIs (e.g., B<toupper>(3)) to allow the specification of a locale object that should apply when executing the function.
ru: Расширения представляют новые функции для создания и управления объектами локали (B<newlocale>(3), B<freelocale>(3), B<duplocale>(3) и B<uselocale>(3)) и различные новые библиотечные функции с суффиксом«_l» (например, B<toupper_l>(3)), которые расширяют обычный зависящий от локали программный интерфейс (например, B<toupper>(3)) так, что позволяют указать объект локали, который будет использован при работе функции.

source: The following environment variable is used by B<newlocale>(3) and B<setlocale>(3), and thus affects all unprivileged localized programs:
ru: Следующая переменная окружения используется в B<newlocale>(3) и B<setlocale>(3), и поэтому влияет на все не привилегированные локализованные программы:
