Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_l/*.po
Languages: ru

source: Specify the file that defines the character set that is used by the input file. If I<charmapfile> contains a slash character ('/'), it is interpreted as the name of the character map. Otherwise, the file is sought in the current directory and the default directory for character maps. If the environment variable B<I18NPATH> is set, I<$I18NPATH/charmaps/> and I<$I18NPATH/> are also searched after the current directory. The default directory for character maps is printed by B<localedef --help>.
ru: Задаёт файл, которым определяется набор символов, используемый в файле входных данных. Если значение I<файл_карты_символов> содержит косую черту («/»), то оно рассматривается как название карты символов. В противном случае, файл ищется в текущем каталоге и каталоге по умолчанию для карт символов. Если установлена переменная окружения B<I18NPATH>, то после текущего каталога также просматриваются I<$I18NPATH/charmaps/> и I<$I18NPATH/>. Каталог по умолчанию для карт символов можно увидеть в выводе B<localedef --help>.

source: Specify the locale definition file to compile. The file is sought in the current directory and the default directory for locale definition files. If the environment variable B<I18NPATH> is set, I<$I18NPATH/locales/> and I<$I18NPATH> are also searched after the current directory. The default directory for locale definition files is printed by B<localedef --help>.
ru: Задаёт файл определения локали для компиляции. Файл ищется в текущем каталоге и каталоге по умолчанию для файлов определения локалей. Если установлена переменная окружения B<I18NPATH>, то после текущего каталога также просматриваются I<$I18NPATH/locales/> и I<$I18NPATH>. Каталог по умолчанию для файлов определения локалей можно увидеть в выводе B<localedef --help>.

source: Read mappings from symbolic names to Unicode code points from I<repertoirefile>. If I<repertoirefile> contains a slash character ('/'), it is interpreted as the pathname of the repertoire map. Otherwise, the file is sought in the current directory and the default directory for repertoire maps. If the environment variable B<I18NPATH> is set, I<$I18NPATH/repertoiremaps/> and I<$I18NPATH> are also searched after the current directory. The default directory for repertoire maps is printed by B<localedef --help>.
ru: Из I<файла_набора> читаются отображения символических имён в кодовые точки Юникода. Если значение I<файла_набора> содержит косую черту («/»), то оно рассматривается имя пути карты набора (repertoire map). В противном случае, файл ищется в текущем каталоге и каталоге по умолчанию для карт наборов. Если установлена переменная окружения B<I18NPATH>, то после текущего каталога также просматриваются I<$I18NPATH/repertoiremaps/> и I<$I18NPATH>. Каталог по умолчанию для карт наборов можно увидеть в выводе B<localedef --help>.

source: Use I<aliasfile> to look up aliases for locale names. There is no default aliases file.
ru: Использовать I<файл_псевдонимов> для поиска псевдонимов имён локалей. Для файла псевдонимом нет файла по умолчанию.

source: B<--prefix=>I<pathname>
ru: B<--prefix=>I<путь>

source: Set the prefix to be prepended to the full archive pathname. By default, the prefix is empty. Setting the prefix to I<foo>, the archive would be placed in I<foo/usr/lib/locale/locale-archive>.
ru: Указывает префикс полного пути к архиву. По умолчанию префикс пуст. Если указать в качестве префикса I<foo>, то архив будет помещён в I<foo/usr/lib/locale/locale-archive>.

source: Write the output files even if warnings were generated about the input file.
ru: Записывать файлы результата даже, если есть предупреждения при генерации входных данных.

source: Generate extra warnings about errors that are normally ignored.
ru: Генерировать дополнительные предупреждения об ошибках, которые обычно игнорируются.

source: Suppress all notifications and warnings, and report only fatal errors.
ru: Не показывать все уведомления и предупреждения; сообщать только о фатальных ошибках.

source: Conform strictly to POSIX. Implies B<--verbose>. This option currently has no other effect. POSIX conformance is assumed if the environment variable B<POSIXLY_CORRECT> is set.
ru: Жёстко следовать POSIX. Подразумевает B<--verbose>. Этот параметр, в настоящее время, больше ничего не делает. Соответствие POSIX предполагается, если установлена переменная окружения B<POSIXLY_CORRECT>.

source: Replace a locale in the locale archive file. Without this option, if the locale is in the archive file already, an error occurs.
ru: Заменить локаль в файле архива локалей. Без этого параметра, если локаль в архиве уже есть, то выдаётся ошибка.

source: Do not use the locale archive file, instead create I<outputpath> as a subdirectory in the same directory as the locale archive file, and create separate output files for locale categories in it. This is helpful to prevent system locale archive updates from overwriting custom locales created with B<localedef>.
ru: Не использовать файл архива локалей, вместо этого создать I<путь_результата> в качестве подкаталога в текущем каталоге для файла архива локалей, и создать в нём отдельные файлы результата для категорий локали. Это позволяет не перезаписывать системный архив локалей пользовательскими локалями, созданными с помощью B<localedef>.

source: Print a usage summary and exit. Also prints the default paths used by B<localedef>.
ru: Показать справку по использованию и завершить работу. Также выводятся пути по умолчанию, используемые в B<localedef>.

source: Print a short usage summary and exit.
ru: Показать краткую справку по использованию и завершить работу.

source: Print the version number, license, and disclaimer of warranty for B<localedef>.
ru: Показать номер версии, лицензию и уведомление о гарантиях для B<localedef>.

source: EXIT STATUS
ru: КОД РЕЗУЛЬТАТА

source: One of the following exit values can be returned by B<localedef>:
ru: Программа B<localedef> может возвращать один из следующих кодов завершения:

source: Command completed successfully.
ru: Команда успешно выполнена.

source: Warnings or errors occurred, output files were written.
ru: Произошла ошибка или предупреждение, файлы результата записаны.

source: Errors encountered, no output created.
ru: Произошла ошибка, результат не записан.

source: The B<--posix> flag is assumed if this environment variable is set.
ru: Если эта переменная окружения установлена, то предполагается флаг B<--posix>.

source: A colon-separated list of search directories for files.
ru: Список каталогов через двоеточие для поиска файлов.

source: Usual default character map path.
ru: Обычный путь по умолчанию для файлов карт символов.

source: Usual default path for locale definition files.
ru: Обычный путь по умолчанию для файлов определений локалей.

source: Usual default repertoire map path.
ru: Обычный путь по умолчанию для файлов карт набора.

source: Usual default locale archive location.
ru: Обычный путь по умолчанию для расположения архива локалей.

source: Usual default path for compiled individual locale data files.
ru: Обычный путь по умолчанию для скомпонованных файлов данных отдельных локалей.

source: An output file that contains information about formatting of addresses and geography-related items.
ru: Файл результата содержит информацию о формате адресов и географических элементах.

source: An output file that contains information about the rules for comparing strings.
ru: Файл результата содержит информацию о правилах сравнения строк.

source: An output file that contains information about character classes.
ru: Файл результата содержит информацию о классах символов.

source: An output file that contains metadata about the locale.
ru: Файл результата содержит метаданные о локали.

source: An output file that contains information about locale measurements (metric versus US customary).
ru: Файл результата содержит информацию о единицах измерения (метрическая или система мер США).

source: An output file that contains information about the language messages should be printed in, and what an affirmative or negative answer looks like.
ru: Файл результата содержит информацию о языке, на котором должны выводиться сообщения и как выглядят ответы «да» и «нет».

source: An output file that contains information about formatting of monetary values.
ru: Файл результата содержит информацию о правилах написания денежных единиц.

source: An output file that contains information about salutations for persons.
ru: Файл результата содержит информацию об описании персон.

source: An output file that contains information about formatting of nonmonetary numeric values.
ru: Файл результата содержит информацию о правилах написания не денежных числовых единиц.

source: An output file that contains information about settings related to standard paper size.
ru: Файл результата содержит информацию о параметрах, относящихся к размерам бумаги.

source: An output file that contains information about formats to be used with telephone services.
ru: Файл результата содержит информацию о форматах, используемых в телефонных службах.

source: An output file that contains information about formatting of data and time values.
ru: Файл результата содержит информацию о форматах значений даты и времени.

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: Compile the locale files for Finnish in the UTF-8 character set and add it to the default locale archive with the name B<fi_FI.UTF-8>:
ru: Компилирование файлов локали для финских пользователей с набором символов UTF-8 и добавление к архиву локалей по умолчанию с именем B<fi_FI.UTF-8>:

source: The next example does the same thing, but generates files into the I<fi_FI.UTF-8> directory which can then be used by programs when the environment variable B<LOCPATH> is set to the current directory (note that the last argument must contain a slash):
ru: В следующем примере делается тоже самое, но файлы генерируются в каталоге I<fi_FI.UTF-8>, который затем можно использовать в программах, установив переменную окружения B<LOCPATH> равной текущему каталогу (заметим, что последний аргумент должен содержать косую черту):

source: locale - get locale-specific information
ru: locale - выдаёт информацию о локали

source: B<locale> [I<option>] B<locale> [I<option>] B<-a> B<locale> [I<option>] B<-m> B<locale> [I<option>] I<name>...
ru: B<locale> [I<параметр>] B<locale> [I<параметр>] B<-a> B<locale> [I<параметр>] B<-m> B<locale> [I<параметр>] I<имя>…

source: The B<locale> command displays information about the current locale, or all locales, on standard output.
ru: Команда B<locale> выдаёт в стандартный вывод информацию о текущей или всех локалях.

source: When invoked without arguments, B<locale> displays the current locale settings for each locale category (see B<locale>(5)), based on the settings of the environment variables that control the locale (see B<locale>(7)). Values for variables set in the environment are printed without double quotes, implied values are printed with double quotes.
ru: При запуске без аргументов B<locale> выводит настройки текущей локали по каждой категории локали (смотрите B<locale>(5)) в зависимости от настроек переменных окружения, которые управляют локалью (смотрите B<locale>(7)). Значения для переменных, установленных из окружения, печатаются без двойных кавычек; предполагается, что кавычки содержатся в самих значениях.

source: If either the B<-a> or the B<-m> option (or one of their long-format equivalents) is specified, the behavior is as follows:
ru: Если указан параметр B<-a> или B<-m> (или их длинные эквиваленты), то выполняется следующее:

source: Display a list of all available locales. The B<-v> option causes the B<LC_IDENTIFICATION> metadata about each locale to be included in the output.
ru: Выдаётся список всех доступных локалей. С параметром B<-v> в вывод добавляются метаданные B<LC_IDENTIFICATION> по каждой выводимой локали.

source: Display the available charmaps (character set description files). To display the current character set for the locale, use B<locale -c charmap>.
ru: Выдаются доступные кодировки (charmaps, файлы описаний наборов символов). Чтобы посмотреть текущую кодировку локали, используйте B<locale -c charmap>.

source: The B<locale> command can also be provided with one or more arguments, which are the names of locale keywords (for example, I<date_fmt>, I<ctype-class-names>, I<yesexpr>, or I<decimal_point>) or locale categories (for example, B<LC_CTYPE> or B<LC_TIME>). For each argument, the following is displayed:
ru: Команде B<locale> также можно передать один или более аргументов: имена ключевых слов локали (например, I<date_fmt>, I<ctype-class-names>, I<yesexpr> или I<decimal_point>) или категории локали (например, B<LC_CTYPE> или B<LC_TIME>). Для каждого аргумента отображается следующее:

source: For a locale keyword, the value of that keyword to be displayed.
ru: Для ключевого слова локали — значение этого ключевого слова.

source: For a locale category, the values of all keywords in that category are displayed.
ru: Для категории локали — значения всех ключевых слов в этой категории.

source: When arguments are supplied, the following options are meaningful:
ru: При указании аргументов доступны следующие параметры:

source: For a category name argument, write the name of the locale category on a separate line preceding the list of keyword values for that category.
ru: Для аргумента имени категории, выводится имя категории локали в отдельной строке перед списком значений ключевых слов этой категории.

source: For a keyword name argument, write the name of the locale category for this keyword on a separate line preceding the keyword value.
ru: Для аргумента имени ключевого слова, выводится имя категории локали для этого ключевого слова в отдельной строке перед значением ключевого слова.

source: This option improves readability when multiple name arguments are specified. It can be combined with the B<-k> option.
ru: Этот параметр повышает читаемость при указании нескольких аргументов. Его можно указывать совместно с параметром B<-k>.

source: For each keyword whose value is being displayed, include also the name of that keyword, so that the output has the format:
ru: Для каждого ключевого слова при отображении значений также выводится имя этого ключевого слова; формат вывода:

source: I<keyword>="I<value>"
ru: I<ключевое слово>="I<значение>"

source: The B<locale> command also knows about the following options:
ru: Команда B<locale> также имеет следующие параметры:

source: Display additional information for some command-line option and argument combinations.
ru: Отобразить дополнительную информацию при некоторых комбинациях параметров командной строки и аргументов.

source: Display a summary of command-line options and arguments and exit.
ru: Показать справку по параметрам командной строки и аргументам и завершить работу.

source: Display a short usage message and exit.
ru: Показать короткое сообщение об использовании и завершить работу.

source: Display the program version and exit.
ru: Показать версию программы и выйти.

source: The following example compiles a custom locale from the I<./wrk> directory with the B<localedef>(1) utility under the I<$HOME/.locale> directory, then tests the result with the B<date>(1) command, and then sets the environment variables B<LOCPATH> and B<LANG> in the shell profile file so that the custom locale will be used in the subsequent user sessions:
ru: В следующем примере компилируется специализированная локаль из каталога I<./wrk> с помощью утилиты B<localedef>(1) в каталоге I<$HOME/.locale>, затем тестируется результат командой B<date>(1), а потом устанавливается переменные окружения B<LOCPATH> и B<LANG> в файле оболочки профиля для того, чтобы специализированная локаль была задействована в последующих сеансах пользователя:

source: ldd - print shared object dependencies
ru: ldd - выдаёт список зависимостей от общих объектов

source: B<ldd> [I<option>]... I<file>...
ru: B<ldd> [I<параметр>]… I<файл>…

source: B<ldd> prints the shared objects (shared libraries) required by each program or shared object specified on the command line. An example of its use and output is the following:
ru: Программа B<ldd> выдаёт список общих объектов (общих библиотек), которые требуются для каждой из заданных в командной строке программы или общего объекта. Пример использования и результат работы:

source: In the usual case, B<ldd> invokes the standard dynamic linker (see B<ld.so>(8)) with the B<LD_TRACE_LOADED_OBJECTS> environment variable set to 1. This causes the dynamic linker to inspect the program's dynamic dependencies, and find (according to the rules described in B<ld.so>(8)) and load the objects that satisfy those dependencies. For each dependency, B<ldd> displays the location of the matching object and the (hexadecimal) address at which it is loaded. (The I<linux-vdso> and I<ld-linux> shared dependencies are special; see B<vdso>(7) and B<ld.so>(8).)
ru: Обычно, B<ldd> вызывает стандартный динамический компоновщик (смотрите B<ld.so>(8)), установив значение переменной окружения B<LD_TRACE_LOADED_OBJECTS> в 1. Это заставляет компоновщик просмотреть динамические зависимости программы и найти (согласно правилам, описанным в B<ld.so>(8)) и загрузить объекты, удовлетворяющие этим зависимостям. Для каждой зависимости B<ldd> показывает расположение подошедшего объекта и адрес (шестнадцатеричный) загрузки (общие зависимости I<linux-vdso> и I<ld-linux> являются специальными; смотрите B<vdso>(7) и B<ld.so>(8)).

source: Security
ru: Безопасность

source: Be aware that in some circumstances (e.g., where the program specifies an ELF interpreter other than I<ld-linux.so>), some versions of B<ldd> may attempt to obtain the dependency information by attempting to directly execute the program, which may lead to the execution of whatever code is defined in the program's ELF interpreter, and perhaps to execution of the program itself. (In glibc versions before 2.27, the upstream B<ldd> implementation did this for example, although most distributions provided a modified version that did not.)
ru: Однако заметим, что при определённых условиях (например, в программе указан интерпретатор ELF не I<ld-linux.so>) некоторые версии B<ldd> могут попытаться получить информацию о зависимостях посредством прямого запуска программы,что может привести к выполнению какого угодно кода, указанного в интерпретаторе ELF программы и, возможно, выполнению самой программы (до glibc версии 2.27 так, например, поступала авторская реализация B<ldd>, хотя в большинстве дистрибутивов содержалась изменённая версия, которая так не делала).

source: Thus, you should I<never> employ B<ldd> on an untrusted executable, since this may result in the execution of arbitrary code. A safer alternative when dealing with untrusted executables is:
ru: Поэтому I<никогда> не запускайте B<ldd> для недоверенных исполняемых файлов, так как это может привести к выполнению произвольного кода. Безопасной альтернативой при работе с недоверенными исполняемыми файлами является команда:

source: $ B<objdump -p /path/to/program | grep NEEDED>
ru: $ B<objdump -p /путь/к/программе | grep NEEDED>

source: Note, however, that this alternative shows only the direct dependencies of the executable, while B<ldd> shows the entire dependency tree of the executable.
ru: Однако заметим, что эта альтернатива показывает только непосредственные зависимости исполняемого файла, а B<ldd> показывает всё его дерево зависимостей.

source: Print the version number of B<ldd>.
ru: Выдать номер версии B<ldd>.

source: Print all information, including, for example, symbol versioning information.
ru: Выдать всю информацию, включая, например, информацию о версии символов.

source: Print unused direct dependencies. (Since glibc 2.3.4.)
ru: Выдать неиспользуемые явные зависимости. (Начиная с glibc 2.3.4.)

source: Perform relocations and report any missing objects (ELF only).
ru: Выполнить перемещения и показать все отсутствующие объекты (только для ELF).

source: Perform relocations for both data objects and functions, and report any missing objects or functions (ELF only).
ru: Выполнить перемещения и для объектов данных и для функций, и показать все отсутствующие объекты или функции (только для ELF).

source: Usage information.
ru: Выдать справку по использованию.

source: B<ldd> does not work on a.out shared libraries.
ru: B<ldd> не работает с динамическими библиотеками в формате a.out.

source: B<ldd> does not work with some extremely old a.out programs which were built before B<ldd> support was added to the compiler releases. If you use B<ldd> on one of these programs, the program will attempt to run with I<argc> = 0 and the results will be unpredictable.
ru: B<ldd> не работает с некоторыми очень старыми a.out программами, которые были скомпилированы до добавления поддержки B<ldd> в компиляторы. Если вы используете B<ldd> для одной из таких программ, то будет предпринята попытка выполнить программу с I<argc> = 0, и результаты будут непредсказуемы.

source: libc - overview of standard C libraries on Linux
ru: libc - обзор стандартных библиотек C в Linux

source: The term "libc" is commonly used as a shorthand for the "standard C library", a library of standard functions that can be used by all C programs (and sometimes by programs in other languages). Because of some history (see below), use of the term "libc" to refer to the standard C library is somewhat ambiguous on Linux.
ru: Термин «libc» обычно используется как сокращение обозначения «стандартной библиотеки C» — библиотеки стандартных функций, которые могут использоваться всеми программами, написанными на C (и, иногда, программами, написанными на других языках). Из-за некоторых исторических событий (см. ниже), использование термина «libc» как обозначение стандартной библиотеки С в Linux, несколько некорректно.

source: By far the most widely used C library on Linux is the GNU C Library E<.UR http://www.gnu.org\:/software\:/libc/> E<.UE ,> often referred to as I<glibc>. This is the C library that is nowadays used in all major Linux distributions. It is also the C library whose details are documented in the relevant pages of the I<man-pages> project (primarily in Section 3 of the manual). Documentation of glibc is also available in the glibc manual, available via the command I<info libc>. Release 1.0 of glibc was made in September 1992. (There were earlier 0.x releases.) The next major release of glibc was 2.0, at the beginning of 1997.
ru: Вне всяких сомнений, наиболее широко используемой в Linux библиотекой C является библиотека GNU C E<.UR http://www.gnu.org\:/software\:/libc/> E<.UE ,>(I<http://wwwgnuorg/software/libc/>) часто упоминаемая как I<glibc>. В настоящее время данная библиотека используется во всех основных дистрибутивах Linux. Также эта библиотека описана в соответствующих справочных страницах проекта I<man-pages> (в основном, в разделе 3). Документация к glibc также доступна в руководстве glibc, доступном по команде I<info libc>. Выпуск 1.0 glibc состоялся в сентябре 1992 года (до этого было несколько выпусков 0.x). Следующий большой выпуск glibc версии 2.0 состоялся в начале 1997 года.

source: The pathname I</lib/libc.so.6> (or something similar) is normally a symbolic link that points to the location of the glibc library, and executing this pathname will cause glibc to display various information about the version installed on your system.
ru: Путь I</lib/libc.so.6> (или подобный), обычно является символической ссылкой на расположение библиотеки glibc, а выполнение этого пути приводит к отображению различной информации о glibc, установленной в системе.
