Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: where I<r\ =\ cabs(z)> is the "radius", the "modulus", the absolute value of I<z>, and I<a\ =\ carg(z)> is the "phase angle", the argument of I<z>.
ru: где I<r\ =\ cabs(z)> — «радиус», «модуль» или абсолютное значение I<z>, и I<a\ =\ carg(z)> — «фазовый угол», или аргумент I<z>.

source: The return value is the range of [-pi,pi].
ru: Возвращаемое значение лежит в диапазоне [-pi,pi].

source: cabs, cabsf, cabsl - absolute value of a complex number
ru: cabs, cabsf, cabsl - вычисление абсолютного значения комплексного числа

source: These functions return the absolute value of the complex number I<z>. The result is a real number.
ru: Эти функции возвращают абсолютное значение комплексного числа I<z>. Результатом является вещественное число.

source: The function is actually an alias for I<hypot(a,\ b)> (or, equivalently, I<sqrt(a*a\ +\ b*b)>).
ru: Фактически функция является псевдонимом для I<hypot(a,\ b)> (или эквивалентному I<sqrt(a*a\ +\ b*b)>).

source: clearenv - clear the environment
ru: clearenv - очищает окружение

source: B<clearenv>(): /* Glibc since 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE
ru: B<clearenv>(): /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _SVID_SOURCE || _BSD_SOURCE

source: The B<clearenv>() function clears the environment of all name-value pairs and sets the value of the external variable I<environ> to NULL. After this call, new variables can be added to the environment using B<putenv>(3) and B<setenv>(3).
ru: Функция B<clearenv>() очищает окружение от всех пар имя-значение и устанавливает значение внешней переменной I<environ> равным NULL. После этого вызова новые переменные можно добавлять в окружение с помощью B<putenv>(3) и B<setenv>(3).

source: The B<clearenv>() function returns zero on success, and a nonzero value on failure.
ru: Функция B<clearenv>() возвращает ноль при успешном выполнении и ненулевое значение при ошибках.

source: Available since glibc 2.0.
ru: Доступна в glibc с версии 2.0.

source: Various UNIX variants (DG/UX, HP-UX, QNX, ...). POSIX.9 (bindings for FORTRAN77). POSIX.1-1996 did not accept B<clearenv>() and B<putenv>(3), but changed its mind and scheduled these functions for some later issue of this standard (see \[sc]B.4.6.1). However, POSIX.1-2001 adds only B<putenv>(3), and rejected B<clearenv>().
ru: Есть в различных версиях UNIX (DG/UX, HP-UX, QNX, …) В POSIX.9 (привязки для FORTRAN77). В POSIX.1-1996 функции B<clearenv>() и B<putenv>() не приняты, но указано, что они войдут в следующие версии стандарта (смотрите \[sc]B.4.6.1). Однако, в POSIX.1-2001 добавлена только B<putenv>(), а B<clearenv>() — отклонена.

source: On systems where B<clearenv>() is unavailable, the assignment
ru: В системах, где B<clearenv>() отсутствует, присваивайте

source: will probably do.
ru: самостоятельно.

source: The B<clearenv>() function may be useful in security-conscious applications that want to precisely control the environment that is passed to programs executed using B<exec>(3). The application would do this by first clearing the environment and then adding select environment variables.
ru: Функция B<clearenv>() может пригодиться в приложениях, которые для безопасности полностью контролирую окружение, передаваемое программам, запускающимся посредством B<exec>(3). Для этого приложение сначала очищает окружение, а затем добавляет выборочные переменные окружения.

source: Note that the main effect of B<clearenv>() is to adjust the value of the pointer B<environ>(7); this function does not erase the contents of the buffers containing the environment definitions.
ru: Заметим, что главным свойством B<clearenv>() является присвоение значения указателю B<environ>(7); эта функция не стирает содержимое буферов, содержащих само окружение.

source: The DG/UX and Tru64 man pages write: If I<environ> has been modified by anything other than the B<putenv>(3), B<getenv>(3), or B<clearenv>() functions, then B<clearenv>() will return an error and the process environment will remain unchanged.
ru: В справочных страницах DG/UX и Tru64 написано: если I<environ> изменялась не с помощью функций B<putenv>(3), B<getenv>(3) или B<clearenv>(), то B<clearenv>() возвратит ошибку и окружение процесса не будет изменено.

source: ctan, ctanf, ctanl - complex tangent function
ru: ctan, ctanf, ctanl - функция вычисления тангенса комплексного числа

source: These functions calculate the complex tangent of I<z>.
ru: Эти функции вычисляют комплексный тангенс I<z>.

source: The complex tangent function is defined as:
ru: Функция тангенса комплексного числа определяется следующей формулой:

source: conj, conjf, conjl - calculate the complex conjugate
ru: conj, conjf, conjl - вычисление комплексно сопряженного числа

source: These functions return the complex conjugate value of I<z>. That is the value obtained by changing the sign of the imaginary part.
ru: Эти функции возвращают значение комплексно сопряженного числа I<z>. Оно получается путем смены знака мнимой части.

source: catan, catanf, catanl - complex arc tangents
ru: catan, catanf, catanl - вычисление арктангенса комплексного числа

source: These functions calculate the complex arc tangent of I<z>. If I<y\ =\ catan(z)>, then I<z\ =\ ctan(y)>. The real part of y is chosen in the interval [-pi/2,pi/2].
ru: Эти функции вычисляют арктангенс комплексного числа I<z>. Если I<y\ =\ catan(z)>, то I<z\ =\ ctan(y)>. Реальная часть I<y> лежит в интервале [-pi/2,pi/2].

source: cacosh, cacoshf, cacoshl - complex arc hyperbolic cosine
ru: cacosh, cacoshf, cacoshl - вычисление гиперболического арккосинуса комплексного числа

source: These functions calculate the complex arc hyperbolic cosine of I<z>. If I<y\ =\ cacosh(z)>, then I<z\ =\ ccosh(y)>. The imaginary part of I<y> is chosen in the interval [-pi,pi]. The real part of I<y> is chosen nonnegative.
ru: Эти функции вычисляют гиперболический арккосинус от комплексного числа I<z>. Если I<y\ =\ cacosh(z)>, то I<z\ =\ ccosh(y)>. Мнимая часть I<y> лежит в интервале [-pi,pi]. Реальная часть I<y> неотрицательна.

source: closedir - close a directory
ru: closedir - закрыть каталог

source: The B<closedir>() function closes the directory stream associated with I<dirp>. A successful call to B<closedir>() also closes the underlying file descriptor associated with I<dirp>. The directory stream descriptor I<dirp> is not available after this call.
ru: Функция B<closedir>() закрывает поток каталога, связанный с I<dirp>. При успешном вызове B<closedir>() также закрывается файловый дескриптор, связанный с I<dirp>. Дескриптор потока каталога I<dirp> будет недоступен после данного вызова.

source: The B<closedir>() function returns 0 on success. On error, -1 is returned, and I<errno> is set appropriately.
ru: Функция B<closedir>() возвращает 0 при успешном выполнении. В случае ошибки возвращается -1, и устанавливается соответствующее значение I<errno>.

source: Invalid directory stream descriptor I<dirp>.
ru: Неверный дескриптор потока каталога I<dirp>.

source: cproj, cprojf, cprojl - project into Riemann Sphere
ru: cproj, cprojf, cprojl - проекция на римановскую сферу

source: These functions project a point in the plane onto the surface of a Riemann Sphere, the one-point compactification of the complex plane. Each finite point I<z> projects to I<z> itself. Every complex infinite value is projected to a single infinite value, namely to positive infinity on the real axis.
ru: Эти функции проецируют точку плоскости на поверхность римановской сферы, одноточечную компактификацию комплексной плоскости. Каждая конечная точка I<z> проецируется в саму I<z>. Все комплексные бесконечные значения проецируются в одно бесконечное значение, а именно в положительную бесконечность действительной оси.

source: In glibc 2.11 and earlier, the implementation does something different (a I<stereographic> projection onto a Riemann Sphere).
ru: Реализацией в glibc 2.11 и старее выполнялось что-то другое (I<стереографическая> проекция на римановскую сферу).

source: canonicalize_file_name - return the canonicalized absolute pathname
ru: canonicalize_file_name - возвращает канонизированный абсолютный путь

source: The B<canonicalize_file_name>() function returns a null-terminated string containing the canonicalized absolute pathname corresponding to I<path>. In the returned string, symbolic links are resolved, as are I<.> and I<..> pathname components. Consecutive slash (I</>) characters are replaced by a single slash.
ru: Функция B<canonicalize_file_name>() возвращает строку, завершающуюся null, содержащую канонизированный абсолютный путь соответствующего I<path>. В возвращаемой строке раскрываются символьные ссылки, а также компоненты пути I<.> и I<..>. Стоящие подряд символы косой черты (I</>) заменяются одной чертой.

source: The returned string is dynamically allocated by B<canonicalize_file_name>() and the caller should deallocate it with B<free>(3) when it is no longer required.
ru: Место под возвращаемую строку выделяется B<canonicalize_file_name>() динамически и вызывающий должен освободить его с помощью B<free>(3), когда оно станет ненужным.

source: The call I<canonicalize_file_name(path)> is equivalent to the call:
ru: Вызов I<canonicalize_file_name(path)> эквивалентен вызову:

source: On success, B<canonicalize_file_name>() returns a null-terminated string. On error (e.g., a pathname component is unreadable or does not exist), B<canonicalize_file_name>() returns NULL and sets I<errno> to indicate the error.
ru: При нормальном завершении работы B<canonicalize_file_name>() возвращает строку с null в конце. При ошибке (например, компонент пути невозможно прочитать или он не существует), B<canonicalize_file_name>() возвращает NULL и устанавливает в I<errno> соответствующее значение ошибки.

source: See B<realpath>(3).
ru: Смотрите B<realpath>(3).

source: This function is a GNU extension.
ru: Эта функция является расширением GNU.

source: cfree - free allocated memory
ru: cfree - освобождает выделенную память

source: /* In SunOS 4 */ B<int cfree(void *>I<ptr>B<);>
ru: /* в SunOS 4 */ B<int cfree(void *>I<ptr>B<);>

source: /* In glibc or FreeBSD libcompat */ B<void cfree(void *>I<ptr>B<);>
ru: /* в glibc или FreeBSD libcompat */ B<void cfree(void *>I<ptr>B<);>

source: /* In SCO OpenServer */ B<void cfree(char *>I<ptr>B<, unsigned >I<num>B<, unsigned >I<size>B<);>
ru: /* в SCO OpenServer */ B<void cfree(char *>I<ptr>B<, unsigned >I<num>B<, unsigned >I<size>B<);>

source: /* In Solaris watchmalloc.so.1 */ B<void cfree(void *>I<ptr>B<, size_t >I<nelem>B<, size_t >I<elsize>B<);>
ru: /* в Solaris watchmalloc.so.1 */ B<void cfree(void *>I<ptr>B<, size_t >I<nelem>B<, size_t >I<elsize>B<);>

source: B<cfree>(): Since glibc 2.19: _DEFAULT_SOURCE Glibc 2.19 and earlier: _BSD_SOURCE || _SVID_SOURCE
ru: B<cfree>(): начиная с glibc 2.19: _DEFAULT_SOURCE в glibc 2.19 и старее: _BSD_SOURCE || _SVID_SOURCE

source: This function should never be used. Use B<free>(3) instead. Starting with version 2.26, it has been removed from glibc.
ru: Эту функцию использовать нельзя. Используйте вместо неё B<free>(3). Начиная с версии 2.26, она удалена из glibc.

source: 1-arg cfree
ru: cfree с 1 аргументом

source: In glibc, the function B<cfree>() is a synonym for B<free>(3), "added for compatibility with SunOS".
ru: В glibc функция B<cfree>() является синонимом B<free>(3), которая "добавлена для совместимости с SunOS".

source: Other systems have other functions with this name. The declaration is sometimes in I<E<lt>stdlib.hE<gt>> and sometimes in I<E<lt>malloc.hE<gt>>.
ru: В других системах есть другие функции с таким же именем. Объявление функции приводится иногда в I<E<lt>stdlib.hE<gt>>, а иногда I<E<lt>malloc.hE<gt>>.

source: 3-arg cfree
ru: cfree с 3 аргументами

source: Some SCO and Solaris versions have malloc libraries with a 3-argument B<cfree>(), apparently as an analog to B<calloc>(3).
ru: В некоторых версиях SCO и Solaris есть версии malloc с B<cfree>() с тремя аргументами, по аналогии с B<calloc>(3).

source: If you need it while porting something, add
ru: Если она нужна вам при переносе чего-либо, добавьте

source: to your file.
ru: в свой файл.

source: A frequently asked question is "Can I use B<free>(3) to free memory allocated with B<calloc>(3), or do I need B<cfree>()?" Answer: use B<free>(3).
ru: Часто задается вопрос: "Могу ли я использовать B<free>(3) для освобождения памяти, выделенной с помощью B<calloc>(3), или нужно использовать B<cfree>()?" Ответ: используйте B<free>(3).

source: An SCO manual writes: "The cfree routine is provided for compliance to the iBCSe2 standard and simply calls free. The num and size arguments to cfree are not used."
ru: В руководстве SCO написано: "Функция cfree доступна для соответствия стандарту iBCSe2, она просто вызывает free. Аргументы num и size функцией cfree не используются".

source: The SunOS version of B<cfree>() (which is a synonym for B<free>(3)) returns 1 on success and 0 on failure. In case of error, I<errno> is set to B<EINVAL>: the value of I<ptr> was not a pointer to a block previously allocated by one of the routines in the B<malloc>(3) family.
ru: Версия B<cfree>() из SunOS (которая является синонимом B<free>(3)) возвращает 1 в случае успеха и 0 - в случае ошибки. В случае ошибки I<errno> устанавливается в значение B<EINVAL>: значение I<ptr> не является указателем на блок, ранее выделенным с помощью одной из функций из семейства B<malloc>(3).

source: The B<cfree>() function was removed from glibc in version 2.26.
ru: Функция B<cfree>() была удалена из glibc версии 2.26.

source: MT-Safe /* In glibc */
ru: MT-Safe /* в glibc */

source: The 3-argument version of B<cfree>() as used by SCO conforms to the iBCSe2 standard: Intel386 Binary Compatibility Specification, Edition 2.
ru: Версия B<cfree>() с тремя аргументами, используемая в SCO, соответствует стандарту iBCSe2, Intel386 Binary Compatibility Specification, Edition 2.

source: csinh, csinhf, csinhl - complex hyperbolic sine
ru: csinh, csinhf, csinhl - вычисление гиперболического синуса комплексного числа

source: These functions calculate the complex hyperbolic sine of I<z>.
ru: Эти функции вычисляют комплексный гиперболический синус I<z>.

source: The complex hyperbolic sine function is defined as:
ru: Функция вычисления гиперболического синуса комплексного числа определена формулой:

source: catopen, catclose - open/close a message catalog
ru: catopen, catclose - открывает/закрывает каталог сообщений

source: The function B<catopen>() opens a message catalog and returns a catalog descriptor. The descriptor remains valid until B<catclose>() or B<execve>(2). If a file descriptor is used to implement catalog descriptors, then the B<FD_CLOEXEC> flag will be set.
ru: Функция B<catopen>() открывает каталог сообщений и возвращает дескриптор каталога. Дескриптор остаётся действительным до вызова B<catclose>() или B<execve>(2). Если для реализации дескрипторов каталогов используется файловый дескриптор, то для него будет установлен флаг B<FD_CLOEXEC>.

source: The argument I<name> specifies the name of the message catalog to be opened. If I<name> specifies an absolute path (i.e., contains a \(aq/\(aq), then I<name> specifies a pathname for the message catalog. Otherwise, the environment variable B<NLSPATH> is used with I<name> substituted for B<%N> (see B<locale>(7)). It is unspecified whether B<NLSPATH> will be used when the process has root privileges. If B<NLSPATH> does not exist in the environment, or if a message catalog cannot be opened in any of the paths specified by it, then an implementation defined path is used. This latter default path may depend on the B<LC_MESSAGES> locale setting when the I<flag> argument is B<NL_CAT_LOCALE> and on the B<LANG> environment variable when the I<flag> argument is 0. Changing the B<LC_MESSAGES> part of the locale may invalidate open catalog descriptors.
ru: В аргументе I<name> указывается имя каталога сообщений, который необходимо открыть. Если в I<name> задаётся абсолютный путь (т.е., содержащий символ \(aq/\(aq), то I<name> определяет путь к каталогу сообщений. Иначе используется переменная окружения B<NLSPATH>, в которой символ B<%N> заменяется значением I<name> (смотрите B<locale>(7)). Не определено, будет ли использоваться B<NLSPATH>, если процесс имеет права root. Если B<NLSPATH> отсутствует в окружении или если каталог сообщений не может быть открыт ни по одному из путей, указанных в этой переменной, то используется путь, зависящий от реализации. Он может зависеть от настройки локали B<LC_MESSAGES> в случае, когда аргумент I<flag> имеет значение B<NL_CAT_LOCALE> или от переменной окружения B<LANG> в случае, когда аргумент I<flag> равен 0. Изменение части локали в B<LC_MESSAGES> может привести к признанию дескрипторов открытых каталогов недействительными.

source: The I<flag> argument to B<catopen>() is used to indicate the source for the language to use. If it is set to B<NL_CAT_LOCALE>, then it will use the current locale setting for B<LC_MESSAGES>. Otherwise, it will use the B<LANG> environment variable.
ru: В аргументе I< flag> функции B<catopen>() задаётся источник используемого языка. Если его значение равно B<NL_CAT_LOCALE>, то для B<LC_MESSAGES> будет использована текущая локаль. В противном случае будет использована переменная окружения B<LANG>.

source: The function B<catclose>() closes the message catalog identified by I<catalog>. It invalidates any subsequent references to the message catalog defined by I<catalog>.
ru: Функция B<catclose>() закрывает каталог сообщений, указанный в I<catalog>. Все последующие обращения к каталогу сообщений, определяемому I<catalog>, считаются ошибкой.

source: The function B<catopen>() returns a message catalog descriptor of type I<nl_catd> on success. On failure, it returns I<(nl_catd)\ -1> and sets I<errno> to indicate the error. The possible error values include all possible values for the B<open>(2) call.
ru: При успешном выполнении функция B<catopen>() возвращает дескриптор каталога сообщений типа I<nl_catd>. В случае ошибки она возвращает I<(nl_catd)\ -1> и устанавливает в I<errno> значение ошибки. Возможными кодами ошибок могут быть все, что и у вызова B<open>(2).

source: The function B<catclose>() returns 0 on success, or -1 on failure.
ru: При успешном выполнении функция B<catclose>() возвращает 0, а в случае ошибки значение -1.

source: ENVIRONMENT
ru: ОКРУЖЕНИЕ

source: May be the source of the B<LC_MESSAGES> locale setting, and thus determine the language to use if I<flag> is set to B<NL_CAT_LOCALE>.
ru: Может быть источником B<LC_MESSAGES> для локали и, таким образом, определять используемый язык в случае, когда I<flag> установлен в B<NL_CAT_LOCALE>.

source: The language to use if I<flag> is 0.
ru: Язык, используемый в случае, когда I<flag> равен 0.

source: The above is the POSIX.1 description. The glibc value for B<NL_CAT_LOCALE> is 1. The default path varies, but usually looks at a number of places below I</usr/share/locale>.
ru: Описание выше соответствует POSIX.1. В glibc значение B<NL_CAT_LOCALE> равно. Путь, используемый по умолчанию, варьируется, но, обычно, представляет собой различные подкаталоги I</usr/share/locale>.

source: CMSG_ALIGN, CMSG_SPACE, CMSG_NXTHDR, CMSG_FIRSTHDR - access ancillary data
ru: CMSG_ALIGN, CMSG_SPACE, CMSG_NXTHDR, CMSG_FIRSTHDR - доступ к вспомогательным данным

source: These macros are used to create and access control messages (also called ancillary data) that are not a part of the socket payload. This control information may include the interface the packet was received on, various rarely used header fields, an extended error description, a set of file descriptors, or UNIX credentials. For instance, control messages can be used to send additional header fields such as IP options. Ancillary data is sent by calling B<sendmsg>(2) and received by calling B<recvmsg>(2). See their manual pages for more information.
ru: Эти макросы используются для создания сообщений контроля доступа (также называемых вспомогательными данными), которые не являются частью полезной нагрузки сокета. Эта управляющая информация может содержать интерфейс, с которого получен пакет, различные редко используемые поля заголовков и расширенное описание ошибок, наборы файловых дескрипторов или параметров доступа (credentials) UNIX. Например, управляющие сообщения могут быть использованы для отправки дополнительных полей заголовков, таких, как параметры IP. Вспомогательные данные посылаются с помощью вызова B<sendmsg>(2) и принимаются посредством вызова B<recvmsg>(2). Более полная информация приведена в их справочных страницах.

source: Ancillary data is a sequence of I<cmsghdr> structures with appended data. See the specific protocol man pages for the available control message types. The maximum ancillary buffer size allowed per socket can be set using I</proc/sys/net/core/optmem_max>; see B<socket>(7).
ru: Вспомогательные данные представляют собой последовательность структур I<cmsghdr> с присоединёнными к ней данными. Возможные типы управляющих сообщений смотрите в соответствующих страницах протоколов. Максимально возможный размер буфера вспомогательных данных одного сокета можно установить через I</proc/sys/net/core/optmem_max>; смотрите B<socket>(7).

source: The I<cmsghdr> structure is defined as follows:
ru: Структура I<cmsghdr> определена следующим образом:

source: struct cmsghdr { size_t cmsg_len; /* Data byte count, including header (type is socklen_t in POSIX) */ int cmsg_level; /* Originating protocol */ int cmsg_type; /* Protocol-specific type */ /* followed by unsigned char cmsg_data[]; */ };
ru: struct cmsghdr { size_t cmsg_len; /* счетчик байтов данных с заголовком (тип — socklen_t в POSIX) */ int cmsg_level; /* начальный протокол */ int cmsg_type; /* тип, зависящий от протокола */ /* после unsigned char cmsg_data[]; */ };

source: The sequence of I<cmsghdr> structures should never be accessed directly. Instead, use only the following macros:
ru: К последовательности структур I<cmsghdr> нельзя обращаться напрямую. Для этого используйте следующие макросы:

source: B<CMSG_FIRSTHDR>() returns a pointer to the first I<cmsghdr> in the ancillary data buffer associated with the passed I<msghdr>. It returns NULL if there isn't enough space for a I<cmsghdr> in the buffer.
ru: Макрос B<CMSG_FIRSTHDR>() возвращает указатель на первый I<cmsghdr> в буфере вспомогательных данных, связанных с переданным I<cmsghdr>. Он возвращает NULL, если в буфере недостаточно места для I<cmsghdr>.

source: B<CMSG_NXTHDR>() returns the next valid I<cmsghdr> after the passed I<cmsghdr>. It returns NULL when there isn't enough space left in the buffer.
ru: Макрос B<CMSG_NXTHDR>() возвращает следующее значение I<cmsghdr> после переданного I<cmsghdr>. Он возвращает NULL, если в буфере недостаточно места.

source: When initializing a buffer that will contain a series of I<cmsghdr> structures (e.g., to be sent with B<sendmsg>(2)), that buffer should first be zero-initialized to ensure the correct operation of B<CMSG_NXTHDR>().
ru: Для правильной работы B<CMSG_NXTHDR>() при инициализации буфера, который будет содержать набор структур I<cmsghdr> (например, для отправки с помощью B<sendmsg>(2)), его необходимо заполнять нулями.

source: B<CMSG_ALIGN>(), given a length, returns it including the required alignment. This is a constant expression.
ru: Макрос B<CMSG_ALIGN>() возвращает длину, учитывая необходимое выравнивание. Это постоянное выражение.

source: B<CMSG_SPACE>() returns the number of bytes an ancillary element with payload of the passed data length occupies. This is a constant expression.
ru: Макрос B<CMSG_SPACE>() возвращает количество байт, которое занимает вспомогательный элемент с полезной нагрузкой переданных данных. Это постоянное выражение.
