Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: A character is a control character if (before transformation according to the mapping table) it has one of the 14 codes 00 (NUL), 07 (BEL), 08 (BS), 09 (HT), 0a (LF), 0b (VT), 0c (FF), 0d (CR), 0e (SO), 0f (SI), 18 (CAN), 1a (SUB), 1b (ESC), 7f (DEL). One can set a "display control characters" mode (see below), and allow 07, 09, 0b, 18, 1a, 7f to be displayed as glyphs. On the other hand, in UTF-8 mode all codes 00\(en1f are regarded as control characters, regardless of any "display control characters" mode.
ru: Символ считается управляющим, если (до преобразования согласно таблице перекодировки) он содержит один из 4 кодов: 00 (NUL), 07 (BEL), 08 (BS), 09 (HT), 0a (LF), 0b (VT), 0c (FF), 0d (CR), 0e (SO), 0f (SI), 18 (CAN), 1a (SUB), 1b (ESC), 7f (DEL). Можно установить режим "показывать управляющие символы" (см. ниже), при этом символы 07, 09, 0b, 18, 1a, 7f будут выводиться на экран в виде образов. С другой стороны, в режиме UTF-8 все коды с 00 по 1f воспринимаются как управляющие символы, независимо от режима «показа управляющих символов».

source: If we have a control character, it is acted upon immediately and then discarded (even in the middle of an escape sequence) and the escape sequence continues with the next character. (However, ESC starts a new escape sequence, possibly aborting a previous unfinished one, and CAN and SUB abort any escape sequence.) The recognized control characters are BEL, BS, HT, LF, VT, FF, CR, SO, SI, CAN, SUB, ESC, DEL, CSI. They do what one would expect:
ru: Если встречается управляющий символ, то он учитывается немедленно, и никак не влияет в дальнейшем (даже если он стоял в середине экранирующей последовательности), и управляющая последовательность продолжается со следующего символа. Однако, символ ESC, начинающий новую экранирующую последовательность, возможно, отменит незаконченную предыдущую последовательность, а символы CAN и SUB точно закончат любую экранирующую последовательность. Распознаваемыми управляющими символами являются: BEL, BS, HT, LF, VT, FF, CR, SO, SI, CAN, SUB, ESC, DEL, CSI. Они выполняют стандартные для них действия:

source: BEL (0x07, B<^G>) beeps;
ru: BEL (0x07, B<^G>) издает звуковой сигнал;

source: BS (0x08, B<^H>) backspaces one column (but not past the beginning of the line);
ru: BS (0x08, B<^H>) удаляет предыдущий символ (смещается влево на один столбец, но не далее, чем за начало строки);

source: HT (0x09, B<^I>) goes to the next tab stop or to the end of the line if there is no earlier tab stop;
ru: HT (0x09, B<^I>) перемещается на следующую позицию табуляции или в конец строки, если до этого не было установлено позиций табуляции;

source: LF (0x0A, B<^J>), VT (0x0B, B<^K>) and FF (0x0C, B<^L>) all give a linefeed, and if LF/NL (new-line mode) is set also a carriage return;
ru: LF (0x0A, B<^J>), VT (0x0B, B<^K>) и FF (0x0C, B<^L>) задают перевод строки, а LF/NL (в режиме новой строки) выполняет перевод каретки;

source: CR (0x0D, B<^M>) gives a carriage return;
ru: CR (0x0D, B<^M>) задает перевод каретки;

source: SO (0x0E, B<^N>) activates the G1 character set;
ru: SO (0x0E, B<^N>) приводит в действие набор символов G1;

source: SI (0x0F, B<^O>) activates the G0 character set;
ru: SI (0x0F, B<^O>) приводит в действие набор символов G0;

source: CAN (0x18, B<^X>) and SUB (0x1A, B<^Z>) interrupt escape sequences;
ru: CAN (0x18, B<^X>) и SUB (0x1A, B<^Z>) прерывают экранирующую последовательность;

source: ESC (0x1B, B<^[>) starts an escape sequence;
ru: ESC (0x1B, B<^[>) начинают экранирующую последовательность;

source: DEL (0x7F) is ignored;
ru: DEL (0x7F) игнорируется;

source: CSI (0x9B) is equivalent to ESC [.
ru: CSI (0x9B) эквивалентно ESC [.

source: B<ESC- but not CSI-sequences>
ru: B<ESC- но не CSI-последовательности>

source: Reset.
ru: Сброс

source: Linefeed.
ru: Перевод строки

source: Newline.
ru: Новая строка

source: Set tab stop at current column.
ru: Установить позицию табуляции в текущем столбце

source: Reverse linefeed.
ru: Обратный перевод строки

source: DEC private identification. The kernel returns the string ESC [ ? 6 c, claiming that it is a VT102.
ru: Есть только у DEC. Ядро возвращает строку ESC [ ? 6 c, утверждая что это VT102.

source: Save current state (cursor coordinates, attributes, character sets pointed at by G0, G1).
ru: Сохранить текущее состояние (координаты курсора, атрибуты, наборы символов, указанные G0, G1).

source: Restore state most recently saved by ESC 7.
ru: Восстановить последнее сохранённое ESC 7 состояние

source: Control sequence introducer
ru: Начало управляющей последовательности

source: Start sequence selecting character set
ru: Начать последовательность с выбором набора символов

source: \0\0\0Select default (ISO 646 / ISO 8859-1)
ru: \0\0\0выбор по умолчанию (ISO 646/ISO 8859-1)

source: \0\0\0Select UTF-8
ru: \0\0\0выбор UTF-8

source: \0\0\0Select UTF-8 (obsolete)
ru: \0\0\0выбор UTF-8 (устарело)

source: DEC screen alignment test - fill screen with E's.
ru: Экранный тест на выравнивание DEC: заполняет экран символами E

source: Start sequence defining G0 character set
ru: Начать последовательность с выбором набора символов G0

source: \0\0\0Select default (ISO 8859-1 mapping)
ru: \0\0\0выбор по умолчанию (таблица перекодировки ISO 8859-1)

source: \0\0\0Select VT100 graphics mapping
ru: \0\0\0выбор графической перекодировки VT100

source: \0\0\0Select null mapping - straight to character ROM
ru: \0\0\0выбрать null-перекодировку — сразу в символьную ROM

source: \0\0\0Select user mapping - the map that is loaded by
ru: \0\0\0пользовательская перекодировка — карта

source: \0\0\0the utility B<mapscrn>(8).
ru: \0\0\0загружается утилитой B<mapscrn>(8)

source: Start sequence defining G1
ru: Начать последовательность с выбором набора символов G1

source: (followed by one of B, 0, U, K, as above).
ru: (следом идёт один из символов B, 0, U, K, как с G0)

source: Set numeric keypad mode
ru: Установить режим ввода цифр для дополнительной клавиатуры

source: Set application keypad mode
ru: Установить режим управления для дополнительной клавиатуры

source: (Should be: Operating system command) ESC ] P I<nrrggbb>: set palette, with parameter given in 7 hexadecimal digits after the final P :-(. Here I<n> is the color (0\(en15), and I<rrggbb> indicates the red/green/blue values (0\(en255). ESC ] R: reset palette
ru: (Должно быть: команда операционной системы) ESC ] P I<nrrggbb>: задать палитру, в параметре указывается 7 шестнадцатеричных цифр после последнего P :-(. Здесь I<n> определяет цвет (0\(en15), а в I<rrggbb> указываются значения красного/зелёного/синего (0\(en255) ESC ] R: сбросить палитру

source: B<ECMA-48 CSI sequences>
ru: B<CSI-последовательности ECMA-48>

source: CSI (or ESC [) is followed by a sequence of parameters, at most NPAR (16), that are decimal numbers separated by semicolons. An empty or absent parameter is taken to be 0. The sequence of parameters may be preceded by a single question mark.
ru: CSI (или ESC [) сопровождаются последовательностью параметров, являющихся десятичными номерами, разделёнными точкой с запятой (самый больший из них \(em NPAR (16)). Пустой или отсутствующий параметр приравнивается нулю. Последовательность параметров может начинаться одним знаком вопроса.

source: However, after CSI [ (or ESC [ [) a single character is read and this entire sequence is ignored. (The idea is to ignore an echoed function key.)
ru: Тем не менее, после CSI [ (или ESC [ [) считывается единственный символ и оставшаяся часть последовательности игнорируется. (Смысл этого в том, чтобы не отображать функциональную клавишу).

source: The action of a CSI sequence is determined by its final character.
ru: Результат работы CSI-последовательности определяется её конечным символом.

source: Insert the indicated # of blank characters.
ru: Вставить N пустых символов

source: Move cursor up the indicated # of rows.
ru: Переместить курсор вверх на N строк

source: Move cursor down the indicated # of rows.
ru: Переместить курсор вниз на N строк

source: Move cursor right the indicated # of columns.
ru: Переместить курсор вправо на N столбцов

source: Move cursor left the indicated # of columns.
ru: Переместить курсор влево на N столбцов

source: Move cursor down the indicated # of rows, to column 1.
ru: Переместить курсор вниз на N строк в столбец 1

source: Move cursor up the indicated # of rows, to column 1.
ru: Переместить курсор вверх на N строк в столбец 1

source: Move cursor to indicated column in current row.
ru: Переместить курсор в указанный столбец текущей строки

source: Move cursor to the indicated row, column (origin at 1,1).
ru: Переместить курсор в указанную строку и столбец (начало в 1,1)

source: Erase display (default: from cursor to end of display).
ru: Очистить экран (по умолчанию от курсора до конца экрана)

source: ESC [ 1 J: erase from start to cursor.
ru: ESC [ 1 J: очистить от начала до курсора

source: ESC [ 2 J: erase whole display.
ru: ESC [ 2 J: очистить весь экран

source: ESC [ 3 J: erase whole display including scroll-back
ru: ESC [ 3 J: очистить весь экран, включая буфер

source: buffer (since Linux 3.0).
ru: обратной прокрутки (начиная с Linux 3.0)

source: Erase line (default: from cursor to end of line).
ru: Очистить строку (по умолчанию от курсора до конца строки)

source: ESC [ 1 K: erase from start of line to cursor.
ru: ESC [ 1 K: очистить от начала строки до курсора

source: ESC [ 2 K: erase whole line.
ru: ESC [ 2 K: очистить всю строку

source: Insert the indicated # of blank lines.
ru: Вставить N пустых строк

source: Delete the indicated # of lines.
ru: Удалить N строк

source: Delete the indicated # of characters on current line.
ru: Удалить N символов в текущей строке

source: Erase the indicated # of characters on current line.
ru: Очистить N символов в текущей строке

source: Answer ESC [ ? 6 c: "I am a VT102".
ru: Ответ по ESC [ ? 6 c: «Я терминал VT102»

source: Move cursor to the indicated row, current column.
ru: Переместить курсор в указанную строку текущего столбца

source: Move cursor to the indicated row, column.
ru: Переместить курсор в указанную строку и столбец

source: Without parameter: clear tab stop at current position.
ru: Без параметра: очистить текущую позицию табуляции

source: ESC [ 3 g: delete all tab stops.
ru: ESC [ 3 g: удалить все позиции табуляции

source: Set Mode (see below).
ru: Режим установки (смотрите ниже)

source: Reset Mode (see below).
ru: Режим сброса (смотрите ниже)

source: Set attributes (see below).
ru: Установка атрибутов (смотрите ниже)

source: Status report (see below).
ru: Отчёт о состоянии (смотрите ниже)

source: Set keyboard LEDs.
ru: Управление индикаторами на клавиатуре

source: ESC [ 0 q: clear all LEDs
ru: ESC [ 0 q: выключить все индикаторы

source: ESC [ 1 q: set Scroll Lock LED
ru: ESC [ 1 q: включить Scroll Lock

source: ESC [ 2 q: set Num Lock LED
ru: ESC [ 2 q: включить Num Lock

source: ESC [ 3 q: set Caps Lock LED
ru: ESC [ 3 q: включить Caps Lock

source: Set scrolling region; parameters are top and bottom row.
ru: Установить область прокрутки; параметрами будут верхняя и нижняя строки

source: Save cursor location.
ru: Сохранить местоположение курсора

source: Restore cursor location.
ru: Восстановить местоположение курсора

source: B<ECMA-48 Set Graphics Rendition>
ru: B<Установка параметров графики ECMA-48>

source: The ECMA-48 SGR sequence ESC [ I<parameters> m sets display attributes. Several attributes can be set in the same sequence, separated by semicolons. An empty parameter (between semicolons or string initiator or terminator) is interpreted as a zero.
ru: Последовательность ECMA-48 SGR управляющих символов ESC [ I<parameters> m устанавливает атрибуты экрана. В одной последовательности может быть задано несколько атрибутов. Пустой параметр (между точкой с запятой или начальной строкой или символом завершения) считается нулём.

source: param
ru: параметр

source: result
ru: результат

source: reset all attributes to their defaults
ru: сбросить все атрибуты в их значения по умолчанию

source: set bold
ru: установить жирный

source: set half-bright (simulated with color on a color display)
ru: установить более яркий (имитируется цветом на цветном дисплее)

source: set underscore (simulated with color on a color display) (the colors used to simulate dim or underline are set using ESC ] ...)
ru: установить подчеркивание (имитируется цветом на цветном дисплее) (цвета, используемые для имитации затемнения или подчеркивания, устанавливаются при помощи ESC ] …)

source: set blink
ru: включить мерцание

source: set reverse video
ru: включить инвертирование видео

source: reset selected mapping, display control flag, and toggle meta flag (ECMA-48 says "primary font").
ru: сбросить выбранную перекодировку, флаг управления экраном и переключить метафлаг (в ECMA-48 указан как «первичный шрифт»).

source: select null mapping, set display control flag, reset toggle meta flag (ECMA-48 says "first alternate font").
ru: выбрать null-перекодировку, установить флаг управления экраном, сбросить переключатель метафлага (в ECMA-48 указан как «первый альтернативный шрифт»).

source: select null mapping, set display control flag, set toggle meta flag (ECMA-48 says "second alternate font"). The toggle meta flag causes the high bit of a byte to be toggled before the mapping table translation is done.
ru: выбрать null-перекодировку, установить флаг управления экраном, установить переключатель метафлага (в ECMA-48 указан как «второй альтернативный шрифт»). Переключение метафлага вызывает переключение старшего бита в байте до его перекодировки согласно таблице трансляции.

source: set normal intensity (ECMA-48 says "doubly underlined")
ru: включить нормальную интенсивность (в ECMA-48 указан как «двойное подчёркивание»)

source: set normal intensity
ru: включить нормальную интенсивность

source: underline off
ru: выключить подчеркивание

source: blink off
ru: выключить мерцание

source: reverse video off
ru: выключить инвертированное видео

source: set black foreground
ru: установить чёрный цвет символов

source: set red foreground
ru: установить красный цвет символов

source: set green foreground
ru: установить зелёный цвет символов

source: set brown foreground
ru: установить коричневый цвет символов

source: set blue foreground
ru: установить синий цвет символов

source: set magenta foreground
ru: установить сиреневый цвет символов

source: set cyan foreground
ru: установить голубой цвет символов

source: set white foreground
ru: установить белый цвет символов

source: set underscore on, set default foreground color
ru: включить подчеркивание, установить цвет символов по умолчанию

source: set underscore off, set default foreground color
ru: выключить подчеркивание, установить цвет символов по умолчанию

source: set black background
ru: установить чёрный цвет фона

source: set red background
ru: установить красный цвет фона

source: set green background
ru: установить зелёный цвет фона

source: set brown background
ru: установить коричневый цвет фона

source: set blue background
ru: установить синий цвет фона

source: set magenta background
ru: установить сиреневый цвет фона

source: set cyan background
ru: установить голубой цвет фона

source: set white background
ru: установить белый цвет фона

source: set default background color
ru: установить цвет фона по умолчанию

source: B<ECMA-48 Mode Switches>
ru: B<Переключатели режимов ECMA-48>

source: DECCRM (default off): Display control chars.
ru: DECCRM (по умолчанию выключен): Показывать управляющие символы.

source: DECIM (default off): Set insert mode.
ru: DECIM (по умолчанию выключен): Включить режим вставки.

source: LF/NL (default off): Automatically follow echo of LF, VT or FF with CR.
ru: LF/NL (по умолчанию выключен): Автоматически выводить код CR после LF, VT или FF.

source: B<ECMA-48 Status Report Commands>
ru: B<Команды вывода состояния ECMA-48>

source: Device status report (DSR): Answer is ESC [ 0 n (Terminal OK).
ru: Сообщение о состоянии устройства (DSR): Ответом является ESC [ 0 n (терминал в порядке).

source: Cursor position report (CPR): Answer is ESC [ I<y> ; I<x> R, where I<x,y> is the cursor location.
ru: Сообщение о позиции курсора (CPR): Ответом является ESC [ I<y> ; I<x> R, где I<x,y> являются координатами курсора.

source: B<DEC Private Mode (DECSET/DECRST) sequences>
ru: B<Последовательности спец-режима DEC (DECSET/DECRST)>

source: These are not described in ECMA-48. We list the Set Mode sequences; the Reset Mode sequences are obtained by replacing the final \(aqh\(aq by \(aql\(aq.
ru: Не описаны в ECMA-48. Далее будут перечислены последовательности установки режима; в последовательности для сброса режима последний знак \(aqh\(aq заменяется на \(aql\(aq.

source: DECCKM (default off): When set, the cursor keys send an ESC O prefix, rather than ESC [.
ru: DECCKM (по умолчанию выключено): Если включено, то клавиши курсора посылают префикс ESC O, а не с ESC [.

source: DECCOLM (default off = 80 columns): 80/132 col mode switch. The driver sources note that this alone does not suffice; some user-mode utility such as B<resizecons>(8) has to change the hardware registers on the console video card.
ru: DECCOLM (по умолчанию = 80 столбцов): режим переключения количества столбцов 80/132. В исходном коде драйвера указано, что одной этой команды недостаточно; некоторые пользовательские утилиты, использующие нестандартные режимы, такие как B<resizecons>(8), должны менять регистры настройки видеокарты консоли.

source: DECSCNM (default off): Set reverse-video mode.
ru: DECSCNM (по умолчанию выключено): Включить инвертированный видеорежим.

source: DECOM (default off): When set, cursor addressing is relative to the upper left corner of the scrolling region.
ru: DECOM (по умолчанию выключено): Если включено, то координаты курсора рассматриваются относительно верхнего левого угла области прокрутки.

source: DECAWM (default on): Set autowrap on. In this mode, a graphic character emitted after column 80 (or column 132 of DECCOLM is on) forces a wrap to the beginning of the following line first.
ru: DECAWM (по умолчанию включено): Включить режим автопереноса. В этом режиме графический символ, вводящийся после 80-го столбца (или 132-го, если DECCOLM включён), переносится в начало следующей строки.

source: DECARM (default on): Set keyboard autorepeat on.
ru: DECARM (по умолчанию включено): Включить режим автоповтора символов при вводе с клавиатуры.

source: X10 Mouse Reporting (default off): Set reporting mode to 1 (or reset to 0)\(emsee below.
ru: Отчёт X10 о состоянии мыши (по умолчанию выключено): Установить режим отчёта о состоянии мыши, равным 1 (или сбросить в 0), см. ниже.

source: DECTECM (default on): Make cursor visible.
ru: DECTECM (по умолчанию включено): Сделать курсор видимым.

source: X11 Mouse Reporting (default off): Set reporting mode to 2 (or reset to 0)\(emsee below.
ru: Отчёт X11 о состоянии мыши (по умолчанию выключено): Установить режим отчёта о состоянии мыши, равным 2 (или сбросить в 0), см. ниже.

source: B<Linux Console Private CSI Sequences>
ru: B<Специфические CSI-последовательности консоли Linux>

source: The following sequences are neither ECMA-48 nor native VT102. They are native to the Linux console driver. Colors are in SGR parameters: 0 = black, 1 = red, 2 = green, 3 = brown, 4 = blue, 5 = magenta, 6 = cyan, 7 = white; 8\(en15 = bright versions of 0\(en7.
ru: Следующие последовательности не являются ни ECMA-48, ни VT102. Они есть только в драйвере консоли Linux. Цвета в параметрах SGR: 0 = чёрный, 1 = красный, 2 = зелёный, 3 = коричневый, 4 = синий, 5 = сиреневый, 6 = голубой, 7 = белый, 8\(en15 = яркие версии 0\(en7.

source: Set color I<n> as the underline color.
ru: Назначить цвет I<n> цветом подчеркивания.

source: Set color I<n> as the dim color.
ru: Назначить цвет I<n> цветом затемнения.

source: Make the current color pair the default attributes.
ru: Сделать текущую пару цветов атрибутами по умолчанию

source: Set screen blank timeout to I<n> minutes.
ru: Показывать заставку через I<n> минут

source: Set bell frequency in Hz.
ru: Задать частоту звукового сигнала (в герцах)

source: Set bell duration in msec.
ru: Задать длительность звукового сигнала (в миллисекундах)

source: Bring specified console to the front.
ru: Переместить указанную консоль перед остальными

source: Unblank the screen.
ru: Убрать заставку (blank screen)

source: Set the VESA powerdown interval in minutes.
ru: Задать интервал отключения питания VESA (в минутах)

source: Bring the previous console to the front (since Linux 2.6.0).
ru: Переместить предыдущую консоль перед остальными (начиная с Linux 2.6.0)

source: Set the cursor blink interval in milliseconds (since Linux 4.2).
ru: Задать интервал мигания курсора (в миллисекундах) (начиная с Linux 4.2).

source: Character sets
ru: Наборы символов

source: The kernel knows about 4 translations of bytes into console-screen symbols. The four tables are: a) Latin1 -E<gt> PC, b) VT100 graphics -E<gt> PC, c) PC -E<gt> PC, d) user-defined.
ru: Ядро располагает информацией о 4-х типах трансляции байтов в символы консоли экрана. Эти четыре таблицы: a) Latin1 -E<gt> PC, b) графика VT100 -E<gt> PC, c) PC -E<gt> PC, d) определяется пользователем.

source: There are two character sets, called G0 and G1, and one of them is the current character set. (Initially G0.) Typing B<^N> causes G1 to become current, B<^O> causes G0 to become current.
ru: В системе существует два набора символов, называемых G0 и G1, и один из них является текущим набором символов системы (изначально это G0). Ввод B<^N> заставляет набор G1 стать текущим, B<^O> делает текущим набор G0.

source: These variables G0 and G1 point at a translation table, and can be changed by the user. Initially they point at tables a) and b), respectively. The sequences ESC ( B and ESC ( 0 and ESC ( U and ESC ( K cause G0 to point at translation table a), b), c) and d), respectively. The sequences ESC ) B and ESC ) 0 and ESC ) U and ESC ) K cause G1 to point at translation table a), b), c) and d), respectively.
ru: Данные переменные G0 и G1 указывают на таблицу трансляции и могут меняться пользователем. Изначально они указывают на таблицы a) и b) соответственно. Последовательности ESC ( B, ESC ( 0, ESC ( U и ESC ( K заставляют G0 ссылаться на таблиц трансляции a), b), c) и d), соответственно. Последовательности ESC ) B, ESC ) 0, ESC ) U, и ESC ) K заставляют G1 ссылаться на таблицу трансляции a), b), c) и d), соответственно.

source: The sequence ESC c causes a terminal reset, which is what you want if the screen is all garbled. The oft-advised "echo ^V^O" will make only G0 current, but there is no guarantee that G0 points at table a). In some distributions there is a program B<reset>(1) that just does "echo ^[c". If your terminfo entry for the console is correct (and has an entry rs1=\eEc), then "tput reset" will also work.
ru: Последовательность ESC c приводит к сбросу терминала, то есть то, что вы хотели бы сделать при наличии «мусора» на экране. Рекомендация, указанная после «echo ^V^O», только сделает G0 текущим набором, но нет никакой гарантии, что G0 указывает на таблицу a). В некоторых дистрибутивах есть программа B<reset>(1), которая всего лишь выполняет команду «echo ^[c». Если элемент terminfo является правильным для консоли (и содержит элемент rs1=\eEc), то «tput reset» также сработает.
