Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: On POSIX systems on which these functions are available, the symbol B<_POSIX_TIMERS> is defined in I<E<lt>unistd.hE<gt>> to a value greater than 0. The symbols B<_POSIX_MONOTONIC_CLOCK>, B<_POSIX_CPUTIME>, B<_POSIX_THREAD_CPUTIME> indicate that B<CLOCK_MONOTONIC>, B<CLOCK_PROCESS_CPUTIME_ID>, B<CLOCK_THREAD_CPUTIME_ID> are available. (See also B<sysconf>(3).)
ru: На POSIX-системах, в которых доступны эти функции, символ B<_POSIX_TIMERS>, определённый в I<E<lt>unistd.hE<gt>>, имеет значение больше 0. Символами B<_POSIX_MONOTONIC_CLOCK>, B<_POSIX_CPUTIME>, B<_POSIX_THREAD_CPUTIME> показывается, что доступны B<CLOCK_MONOTONIC>, B<CLOCK_PROCESS_CPUTIME_ID>, B<CLOCK_THREAD_CPUTIME_ID>. (см. также B<sysconf>(3).)

source: POSIX.1 specifies the following:
ru: В POSIX.1 определено следующее:

source: Setting the value of the B<CLOCK_REALTIME> clock via B<clock_settime>() shall have no effect on threads that are blocked waiting for a relative time service based upon this clock, including the B<nanosleep>() function; nor on the expiration of relative timers based upon this clock. Consequently, these time services shall expire when the requested relative interval elapses, independently of the new or old value of the clock.
ru: Установка значения часов B<CLOCK_REALTIME> с помощью B<clock_settime>() не оказывает влияния на нити, которые находятся в состоянии простоя из-за служб, работа которых основана на этих часах, включая функцию B<nanosleep>(); также, это не оказывает влияние на относительные таймеры, основывающиеся на этих часах. В результате, интервал данных служб истечёт, когда истечёт запрошенный относительный интервал, независимо от нового или старого значения часов.

source: On some architectures, an implementation of B<clock_gettime>() is provided in the B<vdso>(7).
ru: На некоторых архитектурах реализация B<clock_gettime>() находится в B<vdso>(7).

source: Historical note for SMP systems
ru: Историческая справка по системам SMP

source: Before Linux added kernel support for B<CLOCK_PROCESS_CPUTIME_ID> and B<CLOCK_THREAD_CPUTIME_ID>, glibc implemented these clocks on many platforms using timer registers from the CPUs (TSC on i386, AR.ITC on Itanium). These registers may differ between CPUs and as a consequence these clocks may return B<bogus results> if a process is migrated to another CPU.
ru: До того, как в Linux была добавлена поддержка B<CLOCK_PROCESS_CPUTIME_ID> и B<CLOCK_THREAD_CPUTIME_ID>, реализация этих часов в glibc на многих платформах использовала регистры таймеры ЦП (TSC на i386, AR.ITC на Itanium). Эти регистры могут отличаться у разных ЦП и, как следствие, эти часы могут возвращать B<поддельные результаты>, если выполнение процесса переходит на другой ЦП.

source: If the CPUs in an SMP system have different clock sources, then there is no way to maintain a correlation between the timer registers since each CPU will run at a slightly different frequency. If that is the case, then I<clock_getcpuclockid(0)> will return B<ENOENT> to signify this condition. The two clocks will then be useful only if it can be ensured that a process stays on a certain CPU.
ru: Если процессоры в многопроцессорных системах используют разные источники времени, то нет способа поддерживать сверку между регистрами таймера, так как каждый ЦП будет работать со слегка отличающейся частотой. В этом случае I<clock_getcpuclockid(0)> вернёт B<ENOENT>, чтобы указать на это состояние. Двое часов в этом случае будут полезны, только если можно убедиться, что процесс остался на определённом ЦП.

source: The processors in an SMP system do not start all at exactly the same time and therefore the timer registers are typically running at an offset. Some architectures include code that attempts to limit these offsets on bootup. However, the code cannot guarantee to accurately tune the offsets. Glibc contains no provisions to deal with these offsets (unlike the Linux Kernel). Typically these offsets are small and therefore the effects may be negligible in most cases.
ru: Процессоры в многопроцессорных системах не приступают к работе одновременно и поэтому регистры таймера обычно работают со смещением. Некоторые архитектуры содержат код, который пытается сократить это смещение при загрузке системы. Однако код не может гарантировать точную подстройку смещений. В glibc нет средств для работы с этими смещениями (в отличие от ядра Linux). Обычно, эти смещения малы и поэтому, в большинстве случаев, их влияние незначительно.

source: Since glibc 2.4, the wrapper functions for the system calls described in this page avoid the abovementioned problems by employing the kernel implementation of B<CLOCK_PROCESS_CPUTIME_ID> and B<CLOCK_THREAD_CPUTIME_ID>, on systems that provide such an implementation (i.e., Linux 2.6.12 and later).
ru: Начиная с glibc 2.4, обёрточные функции системных вызовов, описанных на этой странице, не имеют таких проблем, так как используют ядерную реализацию B<CLOCK_PROCESS_CPUTIME_ID> и B<CLOCK_THREAD_CPUTIME_ID> (в системах, которые её предоставляют, то есть Linux 2.6.12 и новее).

source: According to POSIX.1-2001, a process with "appropriate privileges" may set the B<CLOCK_PROCESS_CPUTIME_ID> and B<CLOCK_THREAD_CPUTIME_ID> clocks using B<clock_settime>(). On Linux, these clocks are not settable (i.e., no process has "appropriate privileges").
ru: Согласно POSIX.1-2001, процесс с «соответствующими правами» может настроить часы B<CLOCK_PROCESS_CPUTIME_ID> и B<CLOCK_THREAD_CPUTIME_ID> с помощью B<clock_settime>(). В Linux эти часы не допускают настройку (т. е., процесс не может иметь «соответствующие права»).

source: core - core dump file
ru: core - файла дампа памяти процесса

source: The default action of certain signals is to cause a process to terminate and produce a I<core dump file>, a disk file containing an image of the process's memory at the time of termination. This image can be used in a debugger (e.g., B<gdb>(1)) to inspect the state of the program at the time that it terminated. A list of the signals which cause a process to dump core can be found in B<signal>(7).
ru: Для определённых сигналов действием по умолчанию является завершение процесса и создание I<дампа памяти процесса> \(em дискового файла, содержащего образ памяти процесса на момент завершения. Этот образ может быть использован в отладчике (например, B<gdb>(1)) для исследования состояния программы на момент её завершения. Список сигналов, которые приводят к созданию дампа памяти процесса, можно найти в B<signal>(7).

source: A process can set its soft B<RLIMIT_CORE> resource limit to place an upper limit on the size of the core dump file that will be produced if it receives a "core dump" signal; see B<getrlimit>(2) for details.
ru: Процесс может установить свой программный предел ресурса B<RLIMIT_CORE> в максимальное значение по размеру файла дампа, который будет создан, если процесс получит сигнал "дампа памяти"; подробней смотрите в B<getrlimit>(2).

source: There are various circumstances in which a core dump file is not produced:
ru: Есть несколько обстоятельств, при которых файл дампа памяти не создаётся:

source: The process does not have permission to write the core file. (By default, the core file is called I<core> or I<core.pid>, where I<pid> is the ID of the process that dumped core, and is created in the current working directory. See below for details on naming.) Writing the core file fails if the directory in which it is to be created is nonwritable, or if a file with the same name exists and is not writable or is not a regular file (e.g., it is a directory or a symbolic link).
ru: У процесса нет прав на запись файла дампа (по умолчанию файл дампа называется I<core> или I<core.pid>, где I<pid> — ID процесса из которого делается дамп, и создаётся в текущем рабочем каталоге. Подробней об именовании смотрите далее). Запись файла дампа завершается ошибкой, если каталог, в котором он создаётся, недоступен для записи, или если файл с таким же именем уже существует и недоступен для записи или это необычный файл (например, это каталог или символьная ссылка).

source: A (writable, regular) file with the same name as would be used for the core dump already exists, but there is more than one hard link to that file.
ru: Существует файл (обычный, доступный на запись) с именем, которое будет использовано для дампа памяти, но есть более одной жёсткой ссылки на этот файл.

source: The filesystem where the core dump file would be created is full; or has run out of inodes; or is mounted read-only; or the user has reached their quota for the filesystem.
ru: Файловая система, где должен быть создан файл дампа, переполнена, закончились иноды, она смонтирована только для чтения, достигнут предел пользовательской квоты.

source: The directory in which the core dump file is to be created does not exist.
ru: Каталог, в котором должен быть создан файл дампа, не существует.

source: The B<RLIMIT_CORE> (core file size) or B<RLIMIT_FSIZE> (file size) resource limits for the process are set to zero; see B<getrlimit>(2) and the documentation of the shell's I<ulimit> command (I<limit> in B<csh>(1)).
ru: Пределы ресурсов B<RLIMIT_CORE> (размер файла дампа) или B<RLIMIT_FSIZE> (размер файла) для процесса установлены в ноль; смотрите B<getrlimit>(2) и документацию на команду оболочки I<ulimit> (I<limit> в B<csh>(1)).

source: The binary being executed by the process does not have read permission enabled.
ru: Исполняемый процессом файл недоступен на чтение.

source: The process is executing a set-user-ID (set-group-ID) program that is owned by a user (group) other than the real user (group) ID of the process, or the process is executing a program that has file capabilities (see B<capabilities>(7)). (However, see the description of the B<prctl>(2) B<PR_SET_DUMPABLE> operation, and the description of the I</proc/sys/fs/suid_dumpable> file in B<proc>(5).)
ru: Процесс выполняет программу с установленными битом set-user-ID (set-group-ID), который принадлежит пользователю (группе) не совпадающей с ID реального пользователя (группы) процесса или процесс выполняется программу, имеющую файловые мандаты (смотрите B<capabilities>(7)). Однако посмотрите описание операции B<prctl>(2) B<PR_SET_DUMPABLE>, и описание файла I</proc/sys/fs/suid_dumpable> в B<proc>(5).

source: I</proc/sys/kernel/core_pattern> is empty and I</proc/sys/kernel/core_uses_pid> contains the value 0. (These files are described below.) Note that if I</proc/sys/kernel/core_pattern> is empty and I</proc/sys/kernel/core_uses_pid> contains the value 1, core dump files will have names of the form I<.pid>, and such files are hidden unless one uses the B<ls>(1) I<-a> option.
ru: Файл I</proc/sys/kernel/core_pattern> пуст и I</proc/sys/kernel/core_uses_pid> содержит 0 (эти файлы описаны ниже). Заметим, что если I</proc/sys/kernel/core_pattern> пуст и I</proc/sys/kernel/core_uses_pid> содержит 1, то файлы дампа будет иметь имена в виде I<.pid>, а такие файлы не показываются при использовании B<ls>(1) с параметром I<-a>.

source: (Since Linux 3.7) The kernel was configured without the B<CONFIG_COREDUMP> option.
ru: (начиная с Linux 3.7) Ядро настроено без параметра B<CONFIG_COREDUMP>.

source: In addition, a core dump may exclude part of the address space of the process if the B<madvise>(2) B<MADV_DONTDUMP> flag was employed.
ru: Также, дамп память может не содержать часть адресного пространства процесса, если в B<madvise>(2) указан флаг B<MADV_DONTDUMP>.

source: On systems that employ B<systemd>(1) as the I<init> framework, core dumps may instead be placed in a location determined by B<systemd>(1). See below for further details.
ru: В системах, использующих B<systemd>(1) в качестве I<init>, файлы дампа могут помещаться в каталог, задаваемый B<systemd>(1). Подробности смотрите далее.

source: Naming of core dump files
ru: Именование файлов дампов памяти

source: By default, a core dump file is named I<core>, but the I</proc/sys/kernel/core_pattern> file (since Linux 2.6 and 2.4.21) can be set to define a template that is used to name core dump files. The template can contain % specifiers which are substituted by the following values when a core file is created:
ru: По умолчанию, файлу с дампом памяти присваивается имя I<core>, но с помощью файла I</proc/sys/kernel/core_pattern> (начиная с Linux 2.6 и 2.4.21) можно задать шаблон, который будет использован для именования файлов дампов памяти. Шаблон может содержать описатели %, которые заменяются на следующие значения при создании файла дампа:

source: a single % character
ru: одиночный символ %

source: core file size soft resource limit of crashing process (since Linux 2.6.24)
ru: программный предел размера файла дампа рухнувшего процесса (начиная с Linux 2.6.24)

source: dump mode\(emsame as value returned by B<prctl>(2) B<PR_GET_DUMPABLE> (since Linux 3.7)
ru: режим дампа — тоже, как значение возвращаемое B<prctl>(2) с B<PR_GET_DUMPABLE> (начиная с Linux 3.7)

source: executable filename (without path prefix)
ru: имя исполняемого файла (без пути)

source: pathname of executable, with slashes (\(aq/\(aq) replaced by exclamation marks (\(aq!\(aq) (since Linux 3.0).
ru: путь к исполняемому файлу, в котором символы косой черты (\(aq/\(aq) заменена на восклицательные знаки (\(aq!\(aq) (начиная с Linux 3.0).

source: (numeric) real GID of dumped process
ru: (число) реальный GID процесса, с которого делается дамп

source: hostname (same as I<nodename> returned by B<uname>(2))
ru: имя узла (как I<nodename>, возвращаемое B<uname>(2))

source: TID of thread that triggered core dump, as seen in the PID namespace in which the thread resides (since Linux 3.18)
ru: TID нити, из-за которой возник дамп, по отношению к пространству имён PID, в котором располагается нить (начиная с Linux 3.18)

source: TID of thread that triggered core dump, as seen in the initial PID namespace (since Linux 3.18)
ru: TID нити, из-за которой возник дамп, по отношению к начальному пространству имён PID (начиная с Linux 3.18)

source: PID of dumped process, as seen in the PID namespace in which the process resides
ru: PID процесса, с которого делается дамп, так как он видится в пространстве имён PID, котором расположен процесс

source: PID of dumped process, as seen in the initial PID namespace (since Linux 3.12)
ru: initial PID процесса, с которого делается дамп, так как он видится в первоначальном пространстве имён PID, котором расположен процесс (начиная с Linux 3.12)

source: number of signal causing dump
ru: номер сигнала, вызвавшего создание дампа

source: time of dump, expressed as seconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC)
ru: время дампа, выражается в секундах с начала эпохи, 1970-01-01 00:00:00 +0000 (UTC)

source: (numeric) real UID of dumped process
ru: (число) реальный UID процесса, с которого делается дамп

source: A single % at the end of the template is dropped from the core filename, as is the combination of a % followed by any character other than those listed above. All other characters in the template become a literal part of the core filename. The template may include \(aq/\(aq characters, which are interpreted as delimiters for directory names. The maximum size of the resulting core filename is 128 bytes (64 bytes in kernels before 2.6.19). The default value in this file is "core". For backward compatibility, if I</proc/sys/kernel/core_pattern> does not include I<%p> and I</proc/sys/kernel/core_uses_pid> (see below) is nonzero, then .PID will be appended to the core filename.
ru: Одиночный в конце шаблона отбрасывается от имени файла дампа вместе с символом после %, отличным от перечисленных ранее. Все остальные символы в шаблоне вставляются в имя файла дампа как есть. Шаблон может содержать символы \(aq/\(aq, которые интерпретируются как разделители для имён каталогов. Максимальный размер получаемого имени файла дампа равен 128 байтам (64 байта для ядер до версии 2.6.19). Значение по умолчанию в этом файле равно "core". Для обратной совместимости, если I</proc/sys/kernel/core_pattern> не содержит I<%p> и значение в I</proc/sys/kernel/core_uses_pid> (смотрите далее) не равно нулю, то к имени файла дампа будет добавлен .PID.

source: Paths are interpreted according to the settings that are active for the crashing process. That means the crashing process's mount namespace (see B<mount_namespaces>(7)), its current working directory (found via B<getcwd>(2)), and its root directory (see B<chroot>(2)).
ru: Пути рассматриваются согласно активным настройкам для падающего процесса. Имеется в виду пространство имён монтирования падающего процесса (смотрите B<mount_namespaces>(7)), его текущий рабочий каталог (находимый с помощью B<getcwd>(2)) и его корневой каталог (смотрите B<chroot>(2)).

source: Since version 2.4, Linux has also provided a more primitive method of controlling the name of the core dump file. If the I</proc/sys/kernel/core_uses_pid> file contains the value 0, then a core dump file is simply named I<core>. If this file contains a nonzero value, then the core dump file includes the process ID in a name of the form I<core.PID>.
ru: Начиная с версии 2.4, Linux также предоставляет более примитивный метод управления именем файла дампа памяти. Если файл I</proc/sys/kernel/core_uses_pid> содержит значение 0, то файл дампа памяти просто называется I<core>. Если в этом файле содержится ненулевое значение, то к имени файла дампа добавится ID процесса (в виде I<core.PID>).

source: Since Linux 3.6, if I</proc/sys/fs/suid_dumpable> is set to 2 ("suidsafe"), the pattern must be either an absolute pathname (starting with a leading \(aq/\(aq character) or a pipe, as defined below.
ru: Начиная с Linux 3.6, если значение в I</proc/sys/fs/suid_dumpable> равно 2 («suidsafe»), то шаблон должен быть или абсолютным путём (начинаться с символа \(aq/\(aq), или каналом, как описано далее.

source: Piping core dumps to a program
ru: Передача дампов памяти в программу через канал

source: Since kernel 2.6.19, Linux supports an alternate syntax for the I</proc/sys/kernel/core_pattern> file. If the first character of this file is a pipe symbol (B<|>), then the remainder of the line is interpreted as the command-line for a user-space program (or script) that is to be executed.
ru: Начиная с версии 2.6.19, Linux поддерживает альтернативный синтаксис файла I</proc/sys/kernel/core_pattern>. Если первым символом в этом файле будет символ канала (B<|>), то оставшаяся строка воспринимается как командная строка пользовательской программы (или сценария), которую нужно запустить.

source: Since kernel 5.3.0, the pipe template is split on spaces into an argument list I<before> the template parameters are expanded. In earlier kernels, the template parameters are expanded first and the resulting string is split on spaces into an argument list. This means that in earlier kernels executable names added by the I<%e> and I<%E> template parameters could get split into multiple arguments. So the core dump handler needs to put the executable names as the last argument and ensure it joins all parts of the executable name using spaces. Executable names with multiple spaces in them are not correctly represented in earlier kernels, meaning that the core dump handler needs to use mechanisms to find the executable name.
ru: Начиная с ядра 5.3.0 шаблон канала разделяется пробелами на аргументы I<до> до раскрытия параметров шаблона. В старых ядрах параметры шаблона расширялись перед разделением пробелами списка аргументов. Это означает, что в старых ядрах имена исполняемых файлов добавляемые параметрами шаблона I<%e> и I<%E>, могли разделиться на несколько аргументов. Из-за этого обработчику дампа ядра (core dump handler) требовалось помещать имена исполняемых файлов в последний аргумент и проверять, что склеены все части имён исполняемых файлов, в которых есть пробелы. Имена исполняемых файлов с несколькими пробелами неправильно отображаются в старых ядрах, из-за чего обработчику дампа памяти требуется использовать механизмы поиска имени исполняемого файла.

source: Instead of being written to a disk file, the core dump is given as standard input to the program. Note the following points:
ru: Вместо записи файла на диск дамп памяти передаётся в стандартный ввод программы. Отметим следующие моменты:

source: The program must be specified using an absolute pathname (or a pathname relative to the root directory, I</>), and must immediately follow the '|' character.
ru: Программа должна быть задана абсолютным именем файла (или путём относительно корневого каталога, I</>), и имя должна сразу следовать за символом «|».

source: The command-line arguments can include any of the % specifiers listed above. For example, to pass the PID of the process that is being dumped, specify I<%p> in an argument.
ru: В аргументах командной строки могут быть описатели %, перечисленные ранее. Например, чтобы передать PID процесса, для которого делается дамп, укажите в аргументе I<%p>.

source: The process created to run the program runs as user and group I<root>.
ru: Создаваемый процесс для запуска программы будет выполняться с правами группы и пользователя I<root>.

source: Running as I<root> does not confer any exceptional security bypasses. Namely, LSMs (e.g., SELinux) are still active and may prevent the handler from accessing details about the crashed process via I</proc/[pid]>.
ru: При выполнении с правами I<root> не делается никаких исключений по обходу безопасности. А именно, LSM (например, SELinux) работает как обычно и может не дать обработчику доступ к информации упавшего процесса через I</proc/[pid]>.

source: The program pathname is interpreted with respect to the initial mount namespace as it is always executed there. It is not affected by the settings (e.g., root directory, mount namespace, current working directory) of the crashing process.
ru: Путь к программе рассматривается с учётом начального пространства имён монтирования, так как она всегда выполняется в нём. На это не влияют настройки (например, корневой каталог, пространство имён монтирования, текущий рабочий каталог) падающего процесса.

source: The process runs in the initial namespaces (PID, mount, user, and so on) and not in the namespaces of the crashing process. One can utilize specifiers such as I<%P> to find the right I</proc/[pid]> directory and probe/enter the crashing process's namespaces if needed.
ru: Процесс выполняется в начальных пространствах имён (PID, монтирования, пользовательском и т. д.), а не в пространствах имён падающего процесса. Он может использовать описатели, например I<%P>, для нахождения правильного каталога I</proc/[pid]> и, если нужно, протестировать/войти в пространства имён падающего процесса.

source: The process starts with its current working directory as the root directory. If desired, it is possible change to the working directory of the dumping process by employing the value provided by the I<%P> specifier to change to the location of the dumping process via I</proc/[pid]/cwd>.
ru: Процесс запускается с корневым каталогом, равным своему текущему рабочему каталогу. Если нужно, то возможно изменить его на рабочий каталог выполняющего дамп процесса воспользовавшись значением описателя I<%P> для изменения расположения выполняющего дамп процесса через I</proc/[pid]/cwd>.

source: Command-line arguments can be supplied to the program (since Linux 2.6.24), delimited by white space (up to a total line length of 128 bytes).
ru: Программе можно передать аргументы командной строки (начиная с Linux 2.6.24), отделяя их пробелами (максимальный размер строки 128 байт).

source: The B<RLIMIT_CORE> limit is not enforced for core dumps that are piped to a program via this mechanism.
ru: Ограничение B<RLIMIT_CORE> не применяется к файлам дампа, которые передаются по каналу в программу через этот механизм.
