Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: A signal may be process-directed or thread-directed. A process-directed signal is targeted at a thread group (i.e., a TGID), and is delivered to an arbitrarily selected thread from among those that are not blocking the signal. A signal may be process-directed because it was generated by the kernel for reasons other than a hardware exception, or because it was sent using B<kill>(2) or B<sigqueue>(3). A thread-directed signal is targeted at (i.e., delivered to) a specific thread. A signal may be thread directed because it was sent using B<tgkill>(2) or B<pthread_sigqueue>(3), or because the thread executed a machine language instruction that triggered a hardware exception (e.g., invalid memory access triggering B<SIGSEGV> or a floating-point exception triggering B<SIGFPE>).
ru: Сигнал может быть направлен процессу и направлен нити. Целью сигнала, направленного процессу, является группа нитей (т. е., TGID), и он доставляется произвольно выбранной нити среди неблокирующих сигнал. Сигнал может быть направлен процессу из ядра по причинам, не относящимся к аппаратному исключению, или быть послан с помощью B<kill>(2) или B<sigqueue>(3). Целью сигнала, направленного нити, является определённая (т. е., указанная в адресе назначения) нить. Сигнал может быть направлен нити вызовом B<tgkill>(2) или B<pthread_sigqueue>(3), или если в работе нити возникло аппаратное исключение при выполнении ей языковой инструкции (например, при доступе к памяти по неправильному адресу возникает B<SIGSEGV>, а исключение в блоке выполнения инструкций с плавающей запятой приводит к B<SIGFPE>).

source: A call to B<sigpending>(2) returns a signal set that is the union of the pending process-directed signals and the signals that are pending for the calling thread.
ru: Вызов B<sigpending>(2) возвращает набор сигналов, который представляет собой объединение ожидающих сигналов, направленных процессу, и сигналов, которые ожидает вызывающая нить.

source: If a process-directed signal is delivered to a thread group, and the thread group has installed a handler for the signal, then the handler will be invoked in exactly one, arbitrarily selected member of the thread group that has not blocked the signal. If multiple threads in a group are waiting to accept the same signal using B<sigwaitinfo>(2), the kernel will arbitrarily select one of these threads to receive the signal.
ru: Если сигнал, оправленный процессу, доставляется группе нитей и у группы нитей установлен обработчик сигнала, то обработчик будет вызван только один раз в произвольно выбранном члене группы нитей, который не блокирует сигнал. Если несколько нитей в группе ждут приёма того же сигнала с помощью B<sigwaitinfo>(2), то ядро произвольно выберет одну из этих нитей для приёма сигнала.

source: B<CLONE_UNTRACED> (since Linux 2.5.46)
ru: B<CLONE_UNTRACED> (начиная с Linux 2.5.46)

source: If B<CLONE_UNTRACED> is specified, then a tracing process cannot force B<CLONE_PTRACE> on this child process.
ru: Если указан флаг B<CLONE_UNTRACED>, то выполняющий трассировку процесс не сможет указать B<CLONE_PTRACE> на этом процессе-потомке.

source: B<CLONE_VFORK> (since Linux 2.2)
ru: B<CLONE_VFORK> (начиная с Linux 2.2)

source: If B<CLONE_VFORK> is set, the execution of the calling process is suspended until the child releases its virtual memory resources via a call to B<execve>(2) or B<_exit>(2) (as with B<vfork>(2)).
ru: Если указан флаг B<CLONE_VFORK>, то выполнение вызывающего процесса приостанавливается до тех пор, пока потомок не освободит ресурсы виртуальной памяти с помощь вызова B<execve>(2) или B<_exit>(2) (как с B<vfork>(2)).

source: If B<CLONE_VFORK> is not set, then both the calling process and the child are schedulable after the call, and an application should not rely on execution occurring in any particular order.
ru: Если флаг B<CLONE_VFORK> не указан, то вызывающий процесс и потомок доступны для планирования после вызова, и приложение не должно полагаться на то, что выполнение производится в каком-то определённом порядке.

source: B<CLONE_VM> (since Linux 2.0)
ru: B<CLONE_VM> (начиная с Linux 2.0)

source: If B<CLONE_VM> is set, the calling process and the child process run in the same memory space. In particular, memory writes performed by the calling process or by the child process are also visible in the other process. Moreover, any memory mapping or unmapping performed with B<mmap>(2) or B<munmap>(2) by the child or calling process also affects the other process.
ru: Если задан флаг B<CLONE_VM>, то вызывающий и дочерний процесс работают в одном пространстве памяти. В частности, запись в память одним процессом видна другому. Кроме того, выполнение отображения или снятия отображения в память, выполняемая с помощью B<mmap>(2) или B<munmap>(2), одним процессом, влияет на другой.

source: If B<CLONE_VM> is not set, the child process runs in a separate copy of the memory space of the calling process at the time of B<clone>(). Memory writes or file mappings/unmappings performed by one of the processes do not affect the other, as with B<fork>(2).
ru: Если флаг B<CLONE_VM> не установлен, то дочерний процесс выполняется в отдельной копии пространства памяти вызывающего процесс с момента B<clone>(). Запись в память или отображение/снятие отображения файла, выполняемое одним процессом, не влияет на другой (как с B<fork>(2)).

source: Note that the glibc B<clone>() wrapper function makes some changes in the memory pointed to by I<child_stack> (changes required to set the stack up correctly for the child) I<before> invoking the B<clone>() system call. So, in cases where B<clone>() is used to recursively create children, do not use the buffer employed for the parent's stack as the stack of the child.
ru: Заметим, что обёрточная функция glibc B<clone>() делает некоторые изменения в памяти, на которую указывает I<child_stack> (изменения требуются для правильной настройки стека в потомке) I<перед> запуском системного вызова B<clone>(). Поэтому в случаях, когда B<clone>() используется для рекурсивного создания потомков, не используйте буфер стека родителя в качестве стека потомка.

source: C library/kernel differences
ru: Отличия между библиотекой C и ядром

source: The raw B<clone>() system call corresponds more closely to B<fork>(2) in that execution in the child continues from the point of the call. As such, the I<fn> and I<arg> arguments of the B<clone>() wrapper function are omitted.
ru: Системный вызов B<clone>() больше похож на B<fork>(2) в том плане, что выполнение в потомке продолжается от места вызова. Таким образом, аргументы I<fn> и I<arg> обёрточной функции B<clone>() отсутствуют.

source: Another difference for the raw B<clone>() system call is that the I<child_stack> argument may be NULL, in which case the child uses a duplicate of the parent's stack. (Copy-on-write semantics ensure that the child gets separate copies of stack pages when either process modifies the stack.) In this case, for correct operation, the B<CLONE_VM> option should not be specified. (If the child I<shares> the parent's memory because of the use of the B<CLONE_VM> flag, then no copy-on-write duplication occurs and chaos is likely to result.)
ru: Другим отличием системного вызова B<clone>() является то, что аргумент I<child_stack> может быть равен NULL, если потомок использует копию родительского стека (копирование-при-записи гарантирует, что потомок получит отдельные копии страниц стека, если один из процессов изменит стек). В этом случае для правильной работы не должен использоваться флаг B<CLONE_VM> (если потомок I<использует> родительскую память из-за указания B<CLONE_VM>, то создания копии при копировании-при-записи не происходит и, вероятно, это вызове хаос).

source: The order of the arguments also differs in the raw system call, and there are variations in the arguments across architectures, as detailed in the following paragraphs.
ru: В системном вызове также другой порядок аргументов, он различен у разных архитектур (описан далее).

source: The raw system call interface on x86-64 and some other architectures (including sh, tile, ia-64, and alpha) is:
ru: Интерфейс внутреннего системного вызова на x86-64 и некоторых других архитектурах (включая sh, tile, ia-64 и alpha):

source: On x86-32, and several other common architectures (including score, ARM, ARM 64, PA-RISC, arc, Power PC, xtensa, and MIPS), the order of the last two arguments is reversed:
ru: На x86-32 и некоторых других распространённых архитектурах (включая score, ARM, ARM 64, PA-RISC, arc, Power PC, xtensa и MIPS) порядок последних двух аргументов обратный:

source: On the cris and s390 architectures, the order of the first two arguments is reversed:
ru: На архитектурах cris и s390 порядок первых двух аргументов обратный:

source: On the microblaze architecture, an additional argument is supplied:
ru: На архитектуре microblaze есть дополнительный аргумент:

source: blackfin, m68k, and sparc
ru: blackfin, m68k и sparc

source: The argument-passing conventions on blackfin, m68k, and sparc are different from the descriptions above. For details, see the kernel (and glibc) source.
ru: Соглашение по передаче аргументов на blackfin, m68k и sparc отличается от описанного выше. Подробности смотрите в исходном коде ядра (и glibc).

source: On ia64, a different interface is used:
ru: На ia64 используется другой интерфейс:

source: The prototype shown above is for the glibc wrapper function; for the system call itself, the prototype can be described as follows (it is identical to the B<clone>() prototype on microblaze):
ru: Прототип, показанный выше, относится к обёрточной функции glibc; прототип системного вызова можно описать следующим образом (одинаков с прототипом B<clone>() на microblaze):

source: B<__clone2>() operates in the same way as B<clone>(), except that I<child_stack_base> points to the lowest address of the child's stack area, and I<stack_size> specifies the size of the stack pointed to by I<child_stack_base>.
ru: Системный вызов B<__clone2>() работает также как и B<clone>() за исключением того, что I<child_stack_base> указывает на самый нижний адрес области стека потомка, и в I<stack_size> задаётся размер стека, указываемого в I<child_stack_base>.

source: Linux 2.4 and earlier
ru: Linux версии 2.4 и более ранние

source: In Linux 2.4 and earlier, B<clone>() does not take arguments I<ptid>, I<tls>, and I<ctid>.
ru: В Linux 2.4 и более ранних B<clone>() не принимал аргументов I<ptid>, I<tls> и I<ctid>.

source: On success, the thread ID of the child process is returned in the caller's thread of execution. On failure, -1 is returned in the caller's context, no child process will be created, and I<errno> will be set appropriately.
ru: При успешном выполнении в вызывающую исполняемую нить возвращается ID нити дочернего процесса. Иначе в контекст вызывающего возвращается -1, дочерний процесс не создаётся и I<errno> устанавливается в соответствующее значение.

source: Too many processes are already running; see B<fork>(2).
ru: Уже выполняется максимальное количество процессов; смотрите B<fork>(2).

source: B<CLONE_SIGHAND> was specified, but B<CLONE_VM> was not. (Since Linux 2.6.0.)
ru: Указан флаг B<CLONE_SIGHAND>, но нет B<CLONE_VM> (начиная с Linux 2.6.0).

source: B<CLONE_THREAD> was specified, but B<CLONE_SIGHAND> was not. (Since Linux 2.5.35.)
ru: Указан флаг B<CLONE_THREAD>, но нет B<CLONE_SIGHAND> (начиная с Linux 2.5.35).

source: B<CLONE_THREAD> was specified, but the current process previously called B<unshare>(2) with the B<CLONE_NEWPID> flag or used B<setns>(2) to reassociate itself with a PID namespace.
ru: Указан флаг B<CLONE_THREAD>, но текущий процесс до этого вызвал B<unshare>(2) с флагом B<CLONE_NEWPID> или использовал B<setns>(2) для своего отсоединения от пространства имён PID.

source: Both B<CLONE_FS> and B<CLONE_NEWNS> were specified in I<flags>.
ru: Указаны оба флага, B<CLONE_FS> и B<CLONE_NEWNS>, в I<flags>.

source: B<EINVAL> (since Linux 3.9)
ru: B<EINVAL> (начиная с Linux 3.9)

source: Both B<CLONE_NEWUSER> and B<CLONE_FS> were specified in I<flags>.
ru: Указаны оба флага, B<CLONE_NEWUSER> и B<CLONE_FS>, в I<flags>.

source: Both B<CLONE_NEWIPC> and B<CLONE_SYSVSEM> were specified in I<flags>.
ru: Указаны оба флага, B<CLONE_NEWIPC> и B<CLONE_SYSVSEM>, в I<flags>.

source: One (or both) of B<CLONE_NEWPID> or B<CLONE_NEWUSER> and one (or both) of B<CLONE_THREAD> or B<CLONE_PARENT> were specified in I<flags>.
ru: Указан один или оба флага, B<CLONE_NEWPID> или B<CLONE_NEWUSER>, и один или оба флага, B<CLONE_THREAD> или B<CLONE_PARENT>, в I<flags>.

source: Returned by the glibc B<clone>() wrapper function when I<fn> or I<child_stack> is specified as NULL.
ru: Возвращается обёрточной функцией glibc B<clone>(), если I<fn> или I<child_stack> равны NULL.

source: B<CLONE_NEWIPC> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_SYSVIPC> and B<CONFIG_IPC_NS> options.
ru: Указан флаг B<CLONE_NEWIPC> в I<flags>, но ядро собрано без параметров B<CONFIG_SYSVIPC> и B<CONFIG_IPC_NS>.

source: B<CLONE_NEWNET> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_NET_NS> option.
ru: Указан флаг B<CLONE_NEWNET> в I<flags>, но ядро собрано без параметра B<CONFIG_NET_NS>.

source: B<CLONE_NEWPID> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_PID_NS> option.
ru: Указан флаг B<CLONE_NEWPID> в I<flags>, но ядро собрано без параметра B<CONFIG_PID_NS>.

source: B<CLONE_NEWUSER> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_USER_NS> option.
ru: Указан флаг B<CLONE_NEWUSER> в I<flags>, но ядро собрано без параметра B<CONFIG_USER_NS>.

source: B<CLONE_NEWUTS> was specified in I<flags>, but the kernel was not configured with the B<CONFIG_UTS_NS> option.
ru: Указан флаг B<CLONE_NEWUTS> в I<flags>, но ядро собрано без параметра B<CONFIG_UTS_NS>.

source: I<child_stack> is not aligned to a suitable boundary for this architecture. For example, on aarch64, I<child_stack> must be a multiple of 16.
ru: Значение I<child_stack> не выровнено по нужной границе для этой архитектуры. Например, на aarch64 I<child_stack> должно быть кратно 16.

source: Cannot allocate sufficient memory to allocate a task structure for the child, or to copy those parts of the caller's context that need to be copied.
ru: Не удалось выделить достаточно памяти для структуры задач потомка или скопировать необходимые части контекста вызывающего.

source: B<ENOSPC> (since Linux 3.7)
ru: B<ENOSPC> (начиная с Linux 3.7)

source: B<CLONE_NEWPID> was specified in flags, but the limit on the nesting depth of PID namespaces would have been exceeded; see B<pid_namespaces>(7).
ru: В флагах указан B<CLONE_NEWPID>, но вызов привёл бы к превышению ограничения на количество вложенных имён PID; смотрите B<pid_namespaces>(7).

source: B<ENOSPC> (since Linux 4.9; beforehand B<EUSERS>)
ru: B<ENOSPC> (начиная с Linux 4.9; до этого B<EUSERS>)

source: B<CLONE_NEWUSER> was specified in I<flags>, and the call would cause the limit on the number of nested user namespaces to be exceeded. See B<user_namespaces>(7).
ru: Флаг B<CLONE_NEWUSER> указан в I<flags>, и вызов привёл бы к превышению ограничения на количество вложенных пользовательских пространств имён. Смотрите B<user_namespaces>(7).

source: From Linux 3.11 to Linux 4.8, the error diagnosed in this case was B<EUSERS>.
ru: В этом случае в Linux 3.11 по Linux 4.8 возвращалась ошибка B<EUSERS>.

source: B<ENOSPC> (since Linux 4.9)
ru: B<ENOSPC> (начиная с Linux 4.9)

source: One of the values in I<flags> specified the creation of a new user namespace, but doing so would have caused the limit defined by the corresponding file in I</proc/sys/user> to be exceeded. For further details, see B<namespaces>(7).
ru: Одним из значений в I<flags> задаётся создание нового пространства пространства имён пользователя, но это превысило бы ограничение, определённое в соответствующем файле в каталоге I</proc/sys/user>. Дополнительную информацию смотрите в B<namespaces>(7).

source: B<CLONE_NEWCGROUP>, B<CLONE_NEWIPC>, B<CLONE_NEWNET>, B<CLONE_NEWNS>, B<CLONE_NEWPID>, or B<CLONE_NEWUTS> was specified by an unprivileged process (process without B<CAP_SYS_ADMIN>).
ru: Указан флаг B<CLONE_NEWCGROUP>, B<CLONE_NEWIPC>, B<CLONE_NEWNET>, B<CLONE_NEWNS>, B<CLONE_NEWPID> или B<CLONE_NEWUTS>, но процесс не имеет достаточно прав (нет мандата B<CAP_SYS_ADMIN>).

source: B<CLONE_PID> was specified by a process other than process 0. (This error occurs only on Linux 2.5.15 and earlier.)
ru: Указан флаг B<CLONE_PID>, но ID процесса не равен 0 (эта ошибка возникает только в Linux 2.5.15 и старее).

source: B<CLONE_NEWUSER> was specified in I<flags>, but either the effective user ID or the effective group ID of the caller does not have a mapping in the parent namespace (see B<user_namespaces>(7)).
ru: Флаг B<CLONE_NEWUSER> указан в I<flags>, но эффективный пользовательский ID или эффективный ID группы вызывающего не отображён в родительское пространство имён (смотрите B<user_namespaces>(7)).

source: B<EPERM> (since Linux 3.9)
ru: B<EPERM> (начиная с Linux 3.9)

source: B<CLONE_NEWUSER> was specified in I<flags> and the caller is in a chroot environment (i.e., the caller's root directory does not match the root directory of the mount namespace in which it resides).
ru: В I<flags> был указан флаг B<CLONE_NEWUSER> и вызывающий выполняется в окружении chroot (т. е. корневой каталог вызывающего не совпадает с корневым каталогом пространства имён монтирования, в котором он находится).

source: B<ERESTARTNOINTR> (since Linux 2.6.17)
ru: B<ERESTARTNOINTR> (начиная с Linux 2.6.17)

source: System call was interrupted by a signal and will be restarted. (This can be seen only during a trace.)
ru: Системный вызов был прерван сигналом и перезапущен (может быть замечено только при трассировке).

source: B<EUSERS> (Linux 3.11 to Linux 4.8)
ru: B<EUSERS> (с Linux 3.11 по Linux 4.8)

source: B<CLONE_NEWUSER> was specified in I<flags>, and the limit on the number of nested user namespaces would be exceeded. See the discussion of the B<ENOSPC> error above.
ru: Флаг B<CLONE_NEWUSER> указан в I<flags>, и вызов привёл бы к превышению ограничения на количество вложенных пользовательских пространств имён. Смотрите описание ошибки B<ENOSPC>, представленное выше.

source: B<clone>() is Linux-specific and should not be used in programs intended to be portable.
ru: Вызов B<clone>() есть только в Linux и не должен использоваться в переносимых программах.

source: The B<kcmp>(2) system call can be used to test whether two processes share various resources such as a file descriptor table, System V semaphore undo operations, or a virtual address space.
ru: Системный вызов B<kcmp>(2) можно использовать для проверки того, что два процесса совместно используют различные ресурсы, такие как таблицу файловых дескрипторов, семафор System V для отмены операций или виртуальное адресное пространство.

source: Handlers registered using B<pthread_atfork>(3) are not executed during a call to B<clone>().
ru: Обработчики, зарегистрированные с помощью B<pthread_atfork>(3), не выполняются во время вызова B<clone>().

source: In the Linux 2.4.x series, B<CLONE_THREAD> generally does not make the parent of the new thread the same as the parent of the calling process. However, for kernel versions 2.4.7 to 2.4.18 the B<CLONE_THREAD> flag implied the B<CLONE_PARENT> flag (as in Linux 2.6.0 and later).
ru: Для ядер версий Linux 2.4.x, флаг B<CLONE_THREAD> не делает родителем новой нити того же родителя что и у вызывающего процесса. Однако для ядер версий 2.4.7-2.4.18 флаг B<CLONE_THREAD> неявно подразумевает флаг B<CLONE_PARENT> (как в ядре Linux 2.6.0 и новее).

source: For a while there was B<CLONE_DETACHED> (introduced in 2.5.32): parent wants no child-exit signal. In Linux 2.6.2, the need to give this flag together with B<CLONE_THREAD> disappeared. This flag is still defined, but has no effect.
ru: Некоторое время существовал флаг B<CLONE_DETACHED> (начиная с 2.5.32): родитель не хочет получать сигнал завершения потомка. В Linux 2.6.2 необходимость указывать этот флаг вместе с B<CLONE_THREAD> отпала. Этот флаг ещё определён, но не оказывает никакого действия.

source: On i386, B<clone>() should not be called through vsyscall, but directly through I<int $0x80>.
ru: На архитектуре i386 B<clone>() не должен вызываться через vsyscall, а запускаться явно с помощью I<int $0x80>.

source: GNU C library versions 2.3.4 up to and including 2.24 contained a wrapper function for B<getpid>(2) that performed caching of PIDs. This caching relied on support in the glibc wrapper for B<clone>(), but limitations in the implementation meant that the cache was not up to date in some circumstances. In particular, if a signal was delivered to the child immediately after the B<clone>() call, then a call to B<getpid>(2) in a handler for the signal could return the PID of the calling process ("the parent"), if the clone wrapper had not yet had a chance to update the PID cache in the child. (This discussion ignores the case where the child was created using B<CLONE_THREAD>, when B<getpid>(2) I<should> return the same value in the child and in the process that called B<clone>(), since the caller and the child are in the same thread group. The stale-cache problem also does not occur if the I<flags> argument includes B<CLONE_VM>.) To get the truth, it was sometimes necessary to use code such as the following:
ru: Версии библиотеки GNU C с 2.3.4 и по 2.24 включительно содержат обёрточную функцию для B<getpid>(2), которая выполняет кэширование значений PID. Это кэширование основано на поддержке обёрточной функции glibc для B<clone>(), но ограничения в реализации полагаются, что кэш в некоторых случаях не устаревает до определённой даты. В частности, если сигнал был доставлен потомку сразу после вызова B<clone>(), то вызов B<getpid>(2) обработчике сигнала может вернуть PID вызывающего процесса («родителя»), если у обёртки clone пока не было шанса изменить кэш PID в потомке (в этом описании игнорируется случай, где потомок был создал с использованием B<CLONE_THREAD>, когда B<getpid>(2) I<должен> вернуть то же значение в потомок и в процесс, вызывавший B<clone>(), так как вызывающий и потомок находятся в одной группе нитей. Проблема просроченного кэша также не возникает, если в аргументе I<flags> содержится B<CLONE_VM>). Чтобы узнать правду, было иногда необходимо использовать такой код:

source: Because of the stale-cache problem, as well as other problems noted in B<getpid>(2), the PID caching feature was removed in glibc 2.25.
ru: Из-за проблем просроченного кэша (stale-cache), а также других, упомянутых в B<getpid>(2), свойство кэширования PID было удалено в glibc 2.25.

source: The following program demonstrates the use of B<clone>() to create a child process that executes in a separate UTS namespace. The child changes the hostname in its UTS namespace. Both parent and child then display the system hostname, making it possible to see that the hostname differs in the UTS namespaces of the parent and child. For an example of the use of this program, see B<setns>(2).
ru: Следующая программа демонстрирует использование B<clone>() для создания дочернего процесса, который выполняется в отдельном пространстве имён UTS. Потомок изменяет имя узла в своём пространстве имён UTS. И предок и потомок затем выводят системное имя узла, чтобы можно было убедиться в неодинаковости пространств имён. Пример использования этой программы смотрите в B<setns>(2).

source: Program source
ru: Исходный код программы

source: static int /* Start function for cloned child */ childFunc(void *arg) { struct utsname uts;
ru: static int /* Начало функции клонированного потомка */ childFunc(void *arg) { struct utsname uts;
