Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Note that UTF-8 is self-synchronizing: 10xxxxxx is a tail, any other byte is the head of a code. Note that the only way ASCII bytes occur in a UTF-8 stream, is as themselves. In particular, there are no embedded NULs (\(aq\e0\(aq) or \(aq/\(aqs that form part of some larger code.
ru: Заметим, что UTF-8 является самосинхронизирующимся: 10xxxxxx — это «хвост», а любой другой байт — «голова» кода. Только байты ASCII в потоке UTF-8 представлены без изменений. В частности, в поток не встраиваются NUL (\(aq\e0\(aq) или \(aq/\(aq для формирования части какого-то большего кода.

source: Since ASCII, and, in particular, NUL and \(aq/\(aq, are unchanged, the kernel does not notice that UTF-8 is being used. It does not care at all what the bytes it is handling stand for.
ru: Так как символы ASCII, в частности, NUL и \(aq/\(aq, не изменяются, то ядро не замечает, что используется UTF-8. В нём никак не учитывается для чего используются эти байты.

source: Rendering of Unicode data streams is typically handled through "subfont" tables which map a subset of Unicode to glyphs. Internally the kernel uses Unicode to describe the subfont loaded in video RAM. This means that in the Linux console in UTF-8 mode, one can use a character set with 512 different symbols. This is not enough for Japanese, Chinese, and Korean, but it is enough for most other purposes.
ru: Визуализация потоков данных Юникода обычно производится с помощью таблицы «подшрифтов», переводящей единицы набора Юникода в образы символов (глифы). Внутри ядра Юникод используется для описания подшрифта, загруженного в видеопамять. Это означает, что в консоли Linux в режиме UTF-8 можно использовать набор символов с 512-ю различными символами. Этого недостаточно для японского, китайского и корейского языков, но достаточно для большинства других.

source: copy_file_range - Copy a range of data from one file to another
ru: copy_file_range - копирует часть данных из одного файла в другой

source: The B<copy_file_range>() system call performs an in-kernel copy between two file descriptors without the additional cost of transferring data from the kernel to user space and then back into the kernel. It copies up to I<len> bytes of data from the source file descriptor I<fd_in> to the target file descriptor I<fd_out>, overwriting any data that exists within the requested range of the target file.
ru: Системный вызов B<copy_file_range>() выполняет внутриядерное копирование между двумя файловыми дескрипторами без дополнительных накладных расходов по передаче данных из ядра в пользовательское пространство и затем обратно в ядро. Он копирует до I<len> байт данных из файлового дескриптора I<fd_in> источника в файловый дескриптор I<fd_out> приёмника, перезаписывая существующие данные внутри запрашиваемой области файла назначения.

source: The following semantics apply for I<off_in>, and similar statements apply to I<off_out>:
ru: Следующая семантика применяется к I<off_in> и подобная ей к I<off_out>:

source: If I<off_in> is NULL, then bytes are read from I<fd_in> starting from the file offset, and the file offset is adjusted by the number of bytes copied.
ru: Если I<off_in> равно NULL, то байты читаются из I<fd_in> начиная с файлового смещения, а файловое смещение корректируется на количество скопированных байт.

source: If I<off_in> is not NULL, then I<off_in> must point to a buffer that specifies the starting offset where bytes from I<fd_in> will be read. The file offset of I<fd_in> is not changed, but I<off_in> is adjusted appropriately.
ru: Если I<off_in> не равно NULL, то I<off_in> должно указывать на буфер, задающий начальное смещение в I<fd_in>, из которого будут читаться байты. Файловое смещение I<fd_in> не изменяется, но I<off_in> изменяется соответствующим образом.

source: I<fd_in> and I<fd_out> can refer to the same file. If they refer to the same file, then the source and target ranges are not allowed to overlap.
ru: Значения I<fd_in> и I<fd_out> могут ссылаться на один и тот же файл. Если это так, то диапазонам источника и приёмника нельзя перекрываться.

source: The I<flags> argument is provided to allow for future extensions and currently must be to 0.
ru: Аргумент I<flags> предназначен для будущих расширений, а пока его значение должно быть равно 0.

source: RETURN VALUE
ru: ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ

source: Upon successful completion, B<copy_file_range>() will return the number of bytes copied between files. This could be less than the length originally requested. If the file offset of I<fd_in> is at or past the end of file, no bytes are copied, and B<copy_file_range>() returns zero.
ru: При успешном выполнении B<copy_file_range>() возвращает количество скопированных между файлами байт. Оно может быть меньше запрашиваемой длины. Если файловое смещение I<fd_in> в конце или за концом файла, то байты не копирются и B<copy_file_range>() возвращает ноль.

source: On error, B<copy_file_range>() returns -1 and I<errno> is set to indicate the error.
ru: В случае ошибки B<copy_file_range>() возвращает -1, а I<errno> устанавливается в соответствующее значение.

source: One or more file descriptors are not valid.
ru: Один или оба файловых дескриптора недействительны.

source: I<fd_in> is not open for reading; or I<fd_out> is not open for writing.
ru: Дескриптор I<fd_in> не открыт на чтение или дескриптор I<fd_out> не открыт на запись.

source: The B<O_APPEND> flag is set for the open file description (see B<open>(2)) referred to by the file descriptor I<fd_out>.
ru: В открытом файловом описании, на которое ссылается файловый дескриптор I<fd_out>, установлен флаг B<O_APPEND> (смотрите B<open>(2)).

source: An attempt was made to write at a position past the maximum file offset the kernel supports.
ru: Попытка записать в позицию вне максимально поддерживаемого ядром файлового смещения.

source: An attempt was made to write a range that exceeds the allowed maximum file size. The maximum file size differs between filesystem implementations and can be different from the maximum allowed file offset.
ru: Попытка записи диапазона, который превышает разрешённый максимальный размер файла. Максимальный размер файла различается в реализациях файловых систем и может отличаться от разрешённого максимального файлового смещения.

source: An attempt was made to write beyond the process's file size resource limit. This may also result in the process receiving a I<SIGXFSZ> signal.
ru: Попытка записи, выходящее за ограничение ресурса процесса на размер файла. Также это может вызвать получение процессом сигнала I<SIGXFSZ>.

source: The I<flags> argument is not 0.
ru: Аргумент I<flags> не равен 0.

source: I<fd_in> and I<fd_out> refer to the same file and the source and target ranges overlap.
ru: Значения I<fd_in> и I<fd_out> ссылаются на один и тот же файл и диапазоны источника и приёмника перекрываются.

source: Either I<fd_in> or I<fd_out> is not a regular file.
ru: Значение I<fd_in> или I<fd_out> указывает на необычный файл.

source: A low-level I/O error occurred while copying.
ru: Во время копирования возникла низкоуровневая ошибка ввода-вывода.

source: Either I<fd_in> or I<fd_out> refers to a directory.
ru: Значение I<fd_in> или I<fd_out> указывает на каталог.

source: Out of memory.
ru: Не хватает памяти.

source: There is not enough space on the target filesystem to complete the copy.
ru: Недостаточно места на файловой системе назначения для завершения копирования.

source: The requested source or destination range is too large to represent in the specified data types.
ru: Запрошенный диапазон источника и приёмника слишком большой для представления в указанном типе данных.

source: I<fd_out> refers to an immutable file.
ru: Значение I<fd_out> ссылается на файл с постоянными данными (immutable).

source: Either I<fd_in> or I<fd_out> refers to an active swap file.
ru: Значение I<fd_in> или I<fd_out> указывает на активный файл подкачки.

source: The files referred to by I<file_in> and I<file_out> are not on the same mounted filesystem (pre Linux 5.3).
ru: Файлы, на которые ссылаются I<file_in> и I<file_out>, находятся не в одной смонтированной файловой системе (до Linux 5.3).

source: The B<copy_file_range>() system call first appeared in Linux 4.5, but glibc 2.27 provides a user-space emulation when it is not available.
ru: Системный вызов B<copy_file_range>() впервые появился в Linux 4.5, но если он недоступен, в glibc 2.27 предоставляется эмуляция в пользовательском пространстве.

source: A major rework of the kernel implementation occurred in 5.3. Areas of the API that weren't clearly defined were clarified and the API bounds are much more strictly checked than on earlier kernels. Applications should target the behaviour and requirements of 5.3 kernels.
ru: В ядре версии 5.3 произошли значительные перемены. Уточнены области API, которые были нечётно определены, и границы API теперь строже проверяются, по сравнению с ранними ядрами. Приложения должны следовать поведению и требованиям ядер 5.3.

source: First support for cross-filesystem copies was introduced in Linux 5.3. Older kernels will return -EXDEV when cross-filesystem copies are attempted.
ru: В Linux 5.3 появилась поддержка копирования между файловыми системами. В старых ядрах при попытках копирования между файловыми системами возвращается ошибка -EXDEV.

source: The B<copy_file_range>() system call is a nonstandard Linux and GNU extension.
ru: Системный вызов B<copy_file_range>() является нестандартным расширением Linux и GNU.

source: If I<file_in> is a sparse file, then B<copy_file_range>() may expand any holes existing in the requested range. Users may benefit from calling B<copy_file_range>() in a loop, and using the B<lseek>(2) B<SEEK_DATA> and B<SEEK_HOLE> operations to find the locations of data segments.
ru: Если файл I<file_in> является разреженным (sparse), то B<copy_file_range>() может расширить дыры, существующие в запрашиваемой области. Пользователи могут получить преимущество от вызова B<copy_file_range>() в цикле, и используя операции B<lseek>(2) B<SEEK_DATA> и B<SEEK_HOLE> для поиска расположений сегментов данных.

source: B<copy_file_range>() gives filesystems an opportunity to implement "copy acceleration" techniques, such as the use of reflinks (i.e., two or more inodes that share pointers to the same copy-on-write disk blocks) or server-side-copy (in the case of NFS).
ru: Вызов B<copy_file_range>() даёт файловым системам возможность реализовать «ускорение копирования», например, использовать ссылочные связи (т. е., две или более инод, использующих общие указатели для одного копирования-при-записи дисковых блоков) или копирование-на-сервере (server-side-copy, в случае использования NFS).

source: /* On versions of glibc before 2.27, we must invoke copy_file_range() using syscall(2) */
ru: / * В версиях glibc до 2.27, мы должны ссылаться на copy_file_range () используя syscall(2) * /

source: if (argc != 3) { fprintf(stderr, "Usage: %s E<lt>sourceE<gt> E<lt>destinationE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 3) { fprintf(stderr, "Использование: %s E<lt>источникE<gt> E<lt>приёмникE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: fd_in = open(argv[1], O_RDONLY); if (fd_in == -1) { perror("open (argv[1])"); exit(EXIT_FAILURE); }
ru: fd_in = open(argv[1], O_RDONLY); if (fd_in == -1) { perror("открытие (argv[1])"); exit(EXIT_FAILURE); }

source: fd_out = open(argv[2], O_CREAT | O_WRONLY | O_TRUNC, 0644); if (fd_out == -1) { perror("open (argv[2])"); exit(EXIT_FAILURE); }
ru: fd_out = open(argv[2], O_CREAT | O_WRONLY | O_TRUNC, 0644); if (fd_out == -1) { perror("открытие (argv[2])"); exit(EXIT_FAILURE); }

source: chroot - change root directory
ru: chroot - изменить корневой каталог

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
ru: Требования макроса тестирования свойств для glibc (см. B<feature_test_macros>(7)):

source: Since glibc 2.2.2:
ru: Начиная с glibc 2.2.2:

source: _XOPEN_SOURCE && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* Since glibc 2.20: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: _XOPEN_SOURCE && ! (_POSIX_C_SOURCE\ E<gt>=\ 200112L) || /* начиная с glibc 2.20: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE

source: Before glibc 2.2.2: none
ru: До glibc 2.2.2: не было

source: B<chroot>() changes the root directory of the calling process to that specified in I<path>. This directory will be used for pathnames beginning with I</>. The root directory is inherited by all children of the calling process.
ru: B<chroot>() изменяет корневой каталог вызывающего процесса на тот, что задан аргументом I<path>. Этот каталог будет использоваться для имён файлов, начинающихся с I</>. Корневой каталог наследуется всеми потомками вызывающего процесса.

source: Only a privileged process (Linux: one with the B<CAP_SYS_CHROOT> capability in its user namespace) may call B<chroot>().
ru: Только привилегированный процесс (Linux: с мандатом B<CAP_SYS_CHROOT> в своём пользовательском пространстве имён) может вызвать B<chroot>().

source: This call changes an ingredient in the pathname resolution process and does nothing else. In particular, it is not intended to be used for any kind of security purpose, neither to fully sandbox a process nor to restrict filesystem system calls. In the past, B<chroot>() has been used by daemons to restrict themselves prior to passing paths supplied by untrusted users to system calls such as B<open>(2). However, if a folder is moved out of the chroot directory, an attacker can exploit that to get out of the chroot directory as well. The easiest way to do that is to B<chdir>(2) to the to-be-moved directory, wait for it to be moved out, then open a path like ../../../etc/passwd.
ru: Этот вызов изменяет только составляющую процесса разрешения имён и больше ничего. В частности, он не предназначен для действий повышения безопасности, создания полностью изолированной среды процесса (sandbox) или ограничения системных вызовов файловой системы. В прошлом, B<chroot>() использовался службами для ограничения их самих передачи полученных от недоверенных пользователей путей системным вызовам наподобие B<open>(2). Однако, если каталог перемещается за пределы каталога chroot, атакующий может использовать это в своих интересах и также выйти за пределы каталога chroot. Простейший способ сделать это — выполнить B<chdir>(2) в каталог, который будет перемещён, подождать, когда он переместится, а затем открыть путь, например ../../../etc/passwd.

source: A slightly trickier variation also works under some circumstances if B<chdir>(2) is not permitted. If a daemon allows a "chroot directory" to be specified, that usually means that if you want to prevent remote users from accessing files outside the chroot directory, you must ensure that folders are never moved out of it.
ru: Если B<chdir>(2) не разрешён, то есть немного более хитрый вариант, работающий при определённых условиях. Если служба позволяет задать «chroot в каталог», то обычно это означает, что если вы хотите предотвратить доступ к файлам удалённых пользователей вне каталога chroot, то вы должны гарантировать, что каталоги никогда не перемещаются за его пределы.

source: This call does not change the current working directory, so that after the call \(aqI<.>\(aq can be outside the tree rooted at \(aqI</>\(aq. In particular, the superuser can escape from a "chroot jail" by doing:
ru: Данный вызов не изменяет текущий рабочий каталог, поэтому после вызова \(aqI<.>\(aq может оказаться вне дерева, являющегося корнем \(aqI</>\(aq. В частности, суперпользователь может выйти за пределы "тюрьмы chroot" выполнив:

source: This call does not close open file descriptors, and such file descriptors may allow access to files outside the chroot tree.
ru: Данный вызов не закрывает открытые файловые дескрипторы и поэтому через такие дескрипторы можно получить доступ к файлам за пределами дерева chroot.

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: Depending on the filesystem, other errors can be returned. The more general errors are listed below:
ru: В зависимости от файловой системы могут также возвращаться другие ошибки. Общий набор ошибок перечислен ниже:

source: Search permission is denied on a component of the path prefix. (See also B<path_resolution>(7).)
ru: Поиск запрещён из-за одного из частей префикса пути (См. также B<path_resolution>(7).)

source: I<path> points outside your accessible address space.
ru: Аргумент I<path> указывает за пределы доступного адресного пространства.

source: An I/O error occurred.
ru: Произошла ошибка ввода-вывода.

source: Too many symbolic links were encountered in resolving I<path>.
ru: Во время определения I<path> встретилось слишком много символьных ссылок.

source: I<path> is too long.
ru: I<path> слишком длинен.

source: The file does not exist.
ru: Файл не существует.

source: Insufficient kernel memory was available.
ru: Недостаточное количество памяти ядра.

source: A component of I<path> is not a directory.
ru: Компонент I<path> не является каталогом.

source: The caller has insufficient privilege.
ru: У вызвавшего процесса недостаточно прав.

source: SVr4, 4.4BSD, SUSv2 (marked LEGACY). This function is not part of POSIX.1-2001.
ru: SVr4, 4.4BSD, SUSv2 (отмечена как УСТАРЕВШАЯ). Эта функция не входит в POSIX.1-2001.

source: A child process created via B<fork>(2) inherits its parent's root directory. The root directory is left unchanged by B<execve>(2).
ru: Дочерний процесс, созданный посредством B<fork>(2), наследует корневой каталог родительского процесса. При вызове B<execve>(2) корневой каталог остаётся неизменным.

source: The magic symbolic link, I</proc/[pid]/root>, can be used to discover a process's root directory; see B<proc>(5) for details.
ru: Для определения корневого каталога процесса можно использовать магическую символическую ссылку I</proc/[pid]/root>; подробности в B<proc>(5).

source: FreeBSD has a stronger B<jail>() system call.
ru: В FreeBSD есть более ограничивающий системный вызов B<jail>().

source: chdir, fchdir - change working directory
ru: chdir, fchdir - изменить рабочий каталог

source: _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* Glibc up to and including 2.19: */ _BSD_SOURCE
ru: _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || /* в glibc до версии 2.19 включительно: */ _BSD_SOURCE

source: B<chdir>() changes the current working directory of the calling process to the directory specified in I<path>.
ru: B<chdir>() изменяет текущий рабочий каталог вызвавшего процесса на каталог, указанный в I<path>.

source: B<fchdir>() is identical to B<chdir>(); the only difference is that the directory is given as an open file descriptor.
ru: B<fchdir>() идентичен B<chdir>(); разница в том, что каталог указывается в виде открытого файлового дескриптора.

source: Depending on the filesystem, other errors can be returned. The more general errors for B<chdir>() are listed below:
ru: В зависимости от файловой системы могут также возвращаться другие ошибки. Общий набор ошибок B<chdir>() перечислен ниже:

source: Search permission is denied for one of the components of I<path>. (See also B<path_resolution>(7).)
ru: В одном из каталогов префикса I<path> не разрешён поиск (cм. также B<path_resolution>(7)).

source: The directory specified in I<path> does not exist.
ru: Каталог, указанный в I<path>, не существует.

source: The general errors for B<fchdir>() are listed below:
ru: Наиболее распространённые ошибки B<fchdir>():

source: Search permission was denied on the directory open on I<fd>.
ru: Запрещён поиск в каталоге, на который указывает I<fd>.

source: I<fd> is not a valid file descriptor.
ru: Значение I<fd> не является правильным файловым дескриптором.

source: I<fd> does not refer to a directory.
ru: Значение I<fd> не указывает на каталог.

source: The current working directory is the starting point for interpreting relative pathnames (those not starting with \(aq/\(aq).
ru: При работе с относительными путями (те, которые не начинаются с \(aq/\(aq) за начало отсчёта принимается текущий рабочий каталог.

source: A child process created via B<fork>(2) inherits its parent's current working directory. The current working directory is left unchanged by B<execve>(2).
ru: Дочерний процесс, созданный посредством B<fork>(2), наследует текущий рабочий каталог родителя. Текущий рабочий каталог не меняется B<execve>(2).

source: create_module - create a loadable module entry
ru: create_module - создать элемент загружаемого модуля

source: I<Note>: No declaration of this system call is provided in glibc headers; see NOTES.
ru: I<Замечание>: В заголовочных файлах glibc этой системный вызов отсутствует; смотрите ЗАМЕЧАНИЯ.

source: I<Note>: This system call is present only in kernels before Linux 2.6.
ru: I<Замечание>: Данный системный вызов доступен только в ядрах до Linux 2.6.

source: B<create_module>() attempts to create a loadable module entry and reserve the kernel memory that will be needed to hold the module. This system call requires privilege.
ru: B<create_module>() пытается создать элемент загружаемого модуля и зарезервировать память ядра, которая необходима для хранения модуля. Данный системный вызов требует особых прав.

source: On success, returns the kernel address at which the module will reside. On error, -1 is returned and I<errno> is set appropriately.
ru: При успешном выполнении возвращается адрес в ядре, где будет располагаться модуль. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: A module by that name already exists.
ru: Модуль с таким именем уже существует.

source: I<name> is outside the program's accessible address space.
ru: I<name> вне доступного программного адресного пространства.

source: The requested size is too small even for the module header information.
ru: Запрашиваемый размер мал даже для информационного заголовка модуля.

source: The kernel could not allocate a contiguous block of memory large enough for the module.
ru: Ядро не может выделить непрерывный блок памяти, необходимый для модуля.

source: B<create_module>() is not supported in this version of the kernel (e.g., the kernel is version 2.6 or later).
ru: B<create_module>() не поддерживается в этой версии ядра (например, в 2.6 или более поздних).

source: The caller was not privileged (did not have the B<CAP_SYS_MODULE> capability).
ru: Вызывающий не имеет прав (не имеет мандата B<CAP_SYS_MODULE>).

source: This system call is present on Linux only up until kernel 2.4; it was removed in Linux 2.6.
ru: Данный системный вызов есть только в Linux до версии 2.4; он был удалён в Linux 2.6.

source: B<create_module>() is Linux-specific.
ru: B<create_module>() есть только в Linux.

source: This obsolete system call is not supported by glibc. No declaration is provided in glibc headers, but, through a quirk of history, glibc versions before 2.23 did export an ABI for this system call. Therefore, in order to employ this system call, it was sufficient to manually declare the interface in your code; alternatively, you could invoke the system call using B<syscall>(2).
ru: Устаревший системный вызов, не поддерживается glibc. В заголовочных файлах glibc он не объявлен, но в недавнем прошлом версии glibc до 2.23 экспортировали ABI для этого системного вызова. Поэтому, чтобы получить данный системный вызов достаточно вручную объявить интерфейс в своём коде; или же можно вызвать его через B<syscall>(2).

source: close - close a file descriptor
ru: close - закрывает файловый дескриптор
