Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: CYRILLIC SMALL LETTER TSE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ц»

source: CYRILLIC SMALL LETTER CHE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ч»

source: CYRILLIC SMALL LETTER SHA
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ш»

source: CYRILLIC SMALL LETTER SHCHA
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «щ»

source: CYRILLIC SMALL LETTER HARD SIGN
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА ТВЁРДЫЙ ЗНАК

source: CYRILLIC SMALL LETTER YERU
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ы»

source: CYRILLIC SMALL LETTER SOFT SIGN
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА МЯГКИЙ ЗНАК

source: CYRILLIC SMALL LETTER E
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «э»

source: CYRILLIC SMALL LETTER YU
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ю»

source: CYRILLIC SMALL LETTER YA
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «я»

source: CP\ 1251 is also known as Windows Cyrillic.
ru: CP\ 1251 также известна как Windows Cyrillic.

source: cgroup_namespaces - overview of Linux cgroup namespaces
ru: cgroup_namespaces - обзор пространств имён Linux cgroup

source: For an overview of namespaces, see B<namespaces>(7).
ru: Обзор пространств имён смотрите в B<namespaces>(7).

source: Cgroup namespaces virtualize the view of a process's cgroups (see B<cgroups>(7)) as seen via I</proc/[pid]/cgroup> and I</proc/[pid]/mountinfo>.
ru: Пространства имён cgroup_namespaces виртуализируют представление о cgroup процесса (смотрите B<cgroups>(7)) в виде I</proc/[pid]/cgroup> и I</proc/[pid]/mountinfo>.

source: Each cgroup namespace has its own set of cgroup root directories. These root directories are the base points for the relative locations displayed in the corresponding records in the I</proc/[pid]/cgroup> file. When a process creates a new cgroup namespace using B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWCGROUP> flag, its current cgroups directories become the cgroup root directories of the new namespace. (This applies both for the cgroups version 1 hierarchies and the cgroups version 2 unified hierarchy.)
ru: Каждое пространство имён cgroup имеет свой набор корневых каталогов cgroup. Данные корневые каталоги являются базовыми точками относительных расположений, показываемых в соответствующих записях файла I</proc/[pid]/cgroup>. Когда процесс создаёт новое пространство имён cgroup с помощью B<clone>(2) или B<unshare>(2) с флагом B<CLONE_NEWCGROUP>, то его текущие каталоги cgroups становятся корневыми каталогами cgroup нового пространства имён (это применимо как для иерархии cgroups версии 1, так и для унифицированной иерархии cgroups версии 2).

source: When reading the cgroup memberships of a "target" process from I</proc/[pid]/cgroup>, the pathname shown in the third field of each record will be relative to the reading process's root directory for the corresponding cgroup hierarchy. If the cgroup directory of the target process lies outside the root directory of the reading process's cgroup namespace, then the pathname will show I<../> entries for each ancestor level in the cgroup hierarchy.
ru: При чтении членов cgroup «целевого» процесса из I</proc/[pid]/cgroup> путь в третьем поле каждой записи будет относительным по отношению к корневому каталогу cgroup читающего процесса для соответствующей иерархии cgroup. Если каталог cgroup процесса назначения лежит вне корневого каталоге пространства имён cgroup читающего процесса, то путь будет показан как I<../> для каждого уровня предка в иерархии cgroup.

source: The following shell session demonstrates the effect of creating a new cgroup namespace.
ru: Следующий пример сеанса демонстрирует создание нового пространства имён cgroup.

source: First, (as superuser) in a shell in the initial cgroup namespace, we create a child cgroup in the I<freezer> hierarchy, and place a process in that cgroup that we will use as part of the demonstration below:
ru: Сначала (от суперпользователя) в оболочке начального пространства имён cgroup создадим дочернюю cgroup в иерархии I<freezer> и поместим в эту cgroup процесс, который будет использоваться как часть демонстрации далее:

source: # B<mkdir -p /sys/fs/cgroup/freezer/sub2> # B<sleep 10000 &> # Create a process that lives for a while [1] 20124 # B<echo 20124 E<gt> /sys/fs/cgroup/freezer/sub2/cgroup.procs>
ru: # B<mkdir -p /sys/fs/cgroup/freezer/sub2> # B<sleep 10000 &> # создать процесс, который живёт какое-то время [1] 20124 # B<echo 20124 E<gt> /sys/fs/cgroup/freezer/sub2/cgroup.procs>

source: We then create another child cgroup in the I<freezer> hierarchy and put the shell into that cgroup:
ru: Затем создадим другую дочернюю cgroup в иерархии I<freezer> и поместим оболочку в эту cgroup:

source: # B<mkdir -p /sys/fs/cgroup/freezer/sub> # B<echo $$> # Show PID of this shell 30655 # B<echo 30655 E<gt> /sys/fs/cgroup/freezer/sub/cgroup.procs> # B<cat /proc/self/cgroup | grep freezer> 7:freezer:/sub
ru: # B<mkdir -p /sys/fs/cgroup/freezer/sub> # B<echo $$> # выводим PID этой оболочки 30655 # B<echo 30655 E<gt> /sys/fs/cgroup/freezer/sub/cgroup.procs> # B<cat /proc/self/cgroup | grep freezer> 7:freezer:/sub

source: Next, we use B<unshare>(1) to create a process running a new shell in new cgroup and mount namespaces:
ru: Затем с помощью B<unshare>(1) создаётся процесс, выполняющий новую оболочку в новой cgroup и монтируется пространство имён:

source: From the new shell started by B<unshare>(1), we then inspect the I</proc/[pid]/cgroup> files of, respectively, the new shell, a process that is in the initial cgroup namespace (I<init>, with PID 1), and the process in the sibling cgroup (I<sub2>):
ru: Из новой оболочки, запущенной B<unshare>(1), теперь файлы I</proc/[pid]/cgroup> содержат, соответственно, новый процесс-оболочку, процесс, находящийся в первоначальном пространстве имён cgroup (I<init> с PID 1) и процесс в родственной cgroup (I<sub2>):

source: From the output of the first command, we see that the freezer cgroup membership of the new shell (which is in the same cgroup as the initial shell) is shown defined relative to the freezer cgroup root directory that was established when the new cgroup namespace was created. (In absolute terms, the new shell is in the I</sub> freezer cgroup, and the root directory of the freezer cgroup hierarchy in the new cgroup namespace is also I</sub>. Thus, the new shell's cgroup membership is displayed as \(aq/\(aq.)
ru: В выводе первой команды мы видим, что в cgroup freezer членство новой оболочки (находящейся в той же cgroup, что и начальная оболочка) определено относительно корневого каталога cgroup freezer, который был назначен при создании нового пространства имён cgroup (в абсолютном выражении, новая оболочка находится в I</sub> freezer cgroup и корневой каталог иерархии freezer cgroup в новом пространстве имён cgroup также находится в I</sub>. То есть, членство cgroup новой оболочки показывается как \(aq/\(aq).

source: However, when we look in I</proc/self/mountinfo> we see the following anomaly:
ru: Однако, если посмотреть I</proc/self/mountinfo>, то можно увидеть следующую аномалию:

source: The fourth field of this line (I</..>) should show the directory in the cgroup filesystem which forms the root of this mount. Since by the definition of cgroup namespaces, the process's current freezer cgroup directory became its root freezer cgroup directory, we should see \(aq/\(aq in this field. The problem here is that we are seeing a mount entry for the cgroup filesystem corresponding to the initial cgroup namespace (whose cgroup filesystem is indeed rooted at the parent directory of I<sub>). To fix this problem, we must remount the freezer cgroup filesystem from the new shell (i.e., perform the mount from a process that is in the new cgroup namespace), after which we see the expected results:
ru: Четвёртое поле в этой строке (I</..>) должен содержать каталог в файловой системе cgroup, который является корнем этого монтирования. Так как по определению пространств имён cgroup текущий каталог freezer cgroup процесса становится его корневым каталогом freezer cgroup, в этом поле мы должны увидеть \(aq/\(aq. Проблема здесь в том, что мы видим запись о монтировании для файловой системы cgroup, которая соответствует начальному пространству имён cgroup (чья файловая система cgroup действительно имеет корень в родительском каталоге I<sub>). Чтобы это исправить нам нужно перемонтировать файловую систему freezer cgroup из новой оболочки (т. е. выполнить монтирование из процесса, который находится в новом пространстве имён cgroup), после чего мы увидим ожидаемый результат:

source: sh2# B<mount --make-rslave /> # Don't propagate mount events # to other namespaces sh2# B<umount /sys/fs/cgroup/freezer> sh2# B<mount -t cgroup -o freezer freezer /sys/fs/cgroup/freezer> sh2# B<cat /proc/self/mountinfo | grep freezer> 155 145 0:32 / /sys/fs/cgroup/freezer rw,relatime ...
ru: sh2# B<mount --make-rslave /> # не распространять события монтирования # в другие пространства имён sh2# B<umount /sys/fs/cgroup/freezer> sh2# B<mount -t cgroup -o freezer freezer /sys/fs/cgroup/freezer> sh2# B<cat /proc/self/mountinfo | grep freezer> 155 145 0:32 / /sys/fs/cgroup/freezer rw,relatime ...

source: CONFORMING TO
ru: СООТВЕТСТВИЕ СТАНДАРТАМ

source: Namespaces are a Linux-specific feature.
ru: Пространства имён есть только в Linux.

source: Use of cgroup namespaces requires a kernel that is configured with the B<CONFIG_CGROUPS> option.
ru: Для использования пространств имён cgroup требуется, чтобы ядро было собрано с параметром B<CONFIG_CGROUPS>.

source: The virtualization provided by cgroup namespaces serves a number of purposes:
ru: Виртуализация, предоставляемая пространствами имён cgroup, подходит для решения нескольких задач:

source: It prevents information leaks whereby cgroup directory paths outside of a container would otherwise be visible to processes in the container. Such leakages could, for example, reveal information about the container framework to containerized applications.
ru: Предотвращение утечек информации о путях каталогов cgroup за пределами контейнера, иначе они были бы видимы процессам в контейнере. Такие утечки могли, например, выдать информацию о платформе контейнера приложениям в контейнере.

source: It eases tasks such as container migration. The virtualization provided by cgroup namespaces allows containers to be isolated from knowledge of the pathnames of ancestor cgroups. Without such isolation, the full cgroup pathnames (displayed in I</proc/self/cgroups>) would need to be replicated on the target system when migrating a container; those pathnames would also need to be unique, so that they don't conflict with other pathnames on the target system.
ru: Облегчение задач по переносу контейнера. Виртуализация, предоставляемая пространствами имён cgroup, позволяет контейнерам не знать информацию о путях родительских cgroup. Без такой изоляции потребовалось бы воссоздавать полные пути cgroup (показываемые в I</proc/self/cgroups>) в целевой системе при переносе контейнера; также эти пути должны были быть уникальными, чтобы они не пересекались с другими путями в целевой системе.

source: It allows better confinement of containerized processes, because it is possible to mount the container's cgroup filesystems such that the container processes can't gain access to ancestor cgroup directories. Consider, for example, the following scenario:
ru: Обеспечивает лучшее разграничение контейнеризированных процессов, так как возможно смонтировать файловые системы cgroup контейнера таким образом, что процессы контейнера не смогут получить доступ к каталогам предка cgroup. Рассмотрим, например, следующий сценарий:

source: We have a cgroup directory, I</cg/1>, that is owned by user ID 9000.
ru: Есть каталог cgroup I</cg/1>, который принадлежит пользователю с ID 9000.

source: We have a process, I<X>, also owned by user ID 9000, that is namespaced under the cgroup I</cg/1/2> (i.e., I<X> was placed in a new cgroup namespace via B<clone>(2) or B<unshare>(2) with the B<CLONE_NEWCGROUP> flag).
ru: Есть процесс I<X>, который также принадлежит пользователю с ID 9000, он находится в пространстве имён под I</cg/1/2> (т. е., I<X> помещён в новое пространство имён cgroup посредством B<clone>(2) или B<unshare>(2) с флагом B<CLONE_NEWCGROUP>).

source: In the absence of cgroup namespacing, because the cgroup directory I</cg/1> is owned (and writable) by UID 9000 and process I<X> is also owned by user ID 9000, then process I<X> would be able to modify the contents of cgroups files (i.e., change cgroup settings) not only in I</cg/1/2> but also in the ancestor cgroup directory I</cg/1>. Namespacing process I<X> under the cgroup directory I</cg/1/2>, in combination with suitable mount operations for the cgroup filesystem (as shown above), prevents it modifying files in I</cg/1>, since it cannot even see the contents of that directory (or of further removed cgroup ancestor directories). Combined with correct enforcement of hierarchical limits, this prevents process I<X> from escaping the limits imposed by ancestor cgroups.
ru: Если нет пространств имён cgroup, а каталог cgroup I</cg/1> принадлежит (и доступен на запись) UID 9000 и процесс I<X> также принадлежит пользователю с ID 9000, процесс I<X> может изменять содержимое файлов cgroups (т. е., изменять настройки cgroup) не только в I</cg/1/2>, но и в родительском каталоге cgroup I</cg/1>. Выделение для процесса I<X> пространства имён в каталоге cgroup I</cg/1/2>, в комбинации с нужными операциями монтирования файловой системы cgroup (как показано выше) не даёт изменять файлы в I</cg/1>, так как невозможно увидеть содержимое этого каталога (или, в дальнейшем, удалить каталоге родительского cgroup). В сочетании с правильным обеспечением иерархических ограничений это не позволяет процессу I<X> обойти ограничения, накладываемые родительскими cgroups.

source: credentials - process identifiers
ru: credentials - идентификаторы процесса

source: Process ID (PID)
ru: ID (PID) процесса

source: Each process has a unique nonnegative integer identifier that is assigned when the process is created using B<fork>(2). A process can obtain its PID using B<getpid>(2). A PID is represented using the type I<pid_t> (defined in I<E<lt>sys/types.hE<gt>>).
ru: Каждый процесс имеет уникальный неотрицательный целочисленный идентификатор (PID), который ему назначается при создании с помощью B<fork>(2). Процесс может узнать свой PID с помощью вызова B<getpid>(2). PID имеет тип I<pid_t> (определён в I<E<lt>sys/types.hE<gt>>).

source: PIDs are used in a range of system calls to identify the process affected by the call, for example: B<kill>(2), B<ptrace>(2), B<setpriority>(2) B<setpgid>(2), B<setsid>(2), B<sigqueue>(3), and B<waitpid>(2).
ru: PID используется в различных системных вызовах для указания процесса, с которым работает вызов, например: B<kill>(2), B<ptrace>(2), B<setpriority>(2) B<setpgid>(2), B<setsid>(2), B<sigqueue>(3) и B<waitpid>(2).

source: A process's PID is preserved across an B<execve>(2).
ru: PID процесса сохраняется после B<execve>(2).

source: Parent process ID (PPID)
ru: Родительский ID (PPID) процесса

source: A process's parent process ID identifies the process that created this process using B<fork>(2). A process can obtain its PPID using B<getppid>(2). A PPID is represented using the type I<pid_t>.
ru: ID родительского процесса — это ID процесса, который создал данный процесс с помощью B<fork>(2). Процесс может получить свой PPID с помощью B<getppid>(2). PPID имеет тип I<pid_t>.

source: A process's PPID is preserved across an B<execve>(2).
ru: PPID процесса сохраняется после B<execve>(2).

source: Process group ID and session ID
ru: ID группы процессов и сеанса

source: Each process has a session ID and a process group ID, both represented using the type I<pid_t>. A process can obtain its session ID using B<getsid>(2), and its process group ID using B<getpgrp>(2).
ru: У каждого процесса есть ID сеанса и ID группы процессов; они имеют тип I<pid_t>. Процесс может получить ID своего сеанса с помощью B<getsid>(2), а ID своей группы процессов с помощью B<getpgrp>(2).

source: A child created by B<fork>(2) inherits its parent's session ID and process group ID. A process's session ID and process group ID are preserved across an B<execve>(2).
ru: Потомок, создаваемый с помощью B<fork>(2), наследует ID сеанса и группы процессов своего родителя. Идентификатор сеанса и группы сохраняется после B<execve>(2).

source: Sessions and process groups are abstractions devised to support shell job control. A process group (sometimes called a "job") is a collection of processes that share the same process group ID; the shell creates a new process group for the process(es) used to execute single command or pipeline (e.g., the two processes created to execute the command "ls\ |\ wc" are placed in the same process group). A process's group membership can be set using B<setpgid>(2). The process whose process ID is the same as its process group ID is the I<process group leader> for that group.
ru: Сеансы и группы процессов — это абстракции, предназначенные для поддержки управления заданиями оболочки. Группа процессов (иногда называемая «заданием» (job)) — это набор процессов, у которых одинаковый ID группы процессов; оболочка создаёт новую группу процессов для процессов, используемых в одной команде или конвейере (например, два процесса, созданные командой «ls\ |\ wc», помещаются в одну группу процессов). Членство в группе процессов может быть определено с помощью B<setpgid>(2). Процесс, чей ID процесса совпадает с его ID группы процессов, называется I<лидером группы процессов> этой группы.

source: A session is a collection of processes that share the same session ID. All of the members of a process group also have the same session ID (i.e., all of the members of a process group always belong to the same session, so that sessions and process groups form a strict two-level hierarchy of processes.) A new session is created when a process calls B<setsid>(2), which creates a new session whose session ID is the same as the PID of the process that called B<setsid>(2). The creator of the session is called the I<session leader>.
ru: Сеанс — это набор процессов, у которых одинаковый ID сеанса. Все члены группы процессов также имеют одинаковый ID сеанса (т. е., все члены группы процессов всегда принадлежат одному сеансу; таким образом, сеансы и группы процессов формируют из процессов жёсткую двухуровневую иерархию). Новый сеанс создаётся при вызове процессом B<setsid>(2), который создаёт новый сеанс, чей ID сеанса совпадает с PID процесса, который вызвал B<setsid>(2). Создатель сеанса также называется I<лидером сеанса>.

source: All of the processes in a session share a I<controlling terminal>. The controlling terminal is established when the session leader first opens a terminal (unless the B<O_NOCTTY> flag is specified when calling B<open>(2)). A terminal may be the controlling terminal of at most one session.
ru: Все процессы в сеансе используют общий I<управляющий терминал>. Управляющий терминал назначается в момент, когда лидер сеанса впервые открывает терминал (если при вызове B<open>(2) не указан флаг B<O_NOCTTY>). Терминал может быть управляющим терминалом не более чем для одного сеанса.

source: At most one of the jobs in a session may be the I<foreground job>; other jobs in the session are I<background jobs>. Only the foreground job may read from the terminal; when a process in the background attempts to read from the terminal, its process group is sent a B<SIGTTIN> signal, which suspends the job. If the B<TOSTOP> flag has been set for the terminal (see B<termios>(3)), then only the foreground job may write to the terminal; writes from background job cause a B<SIGTTOU> signal to be generated, which suspends the job. When terminal keys that generate a signal (such as the I<interrupt> key, normally control-C) are pressed, the signal is sent to the processes in the foreground job.
ru: В сеансе может быть только одно I<активное задание> (foreground job); все остальные задания в сеансе считаются I<фоновыми заданиями> (background jobs). Только активное задание может читать данные из терминала; когда процесс в фоне пытается прочитать данные с терминала, его группе процессов посылается сигнал B<SIGTTIN>, который приостанавливает (suspends) задание. Если у терминала установлен флаг B<TOSTOP> (смотрите B<termios>(3)), то только активное задание может писать в терминал; попытка записи из фонового задания приводит к генерации сигнала B<SIGTTOU>, который приостанавливает задание. Если нажимаются клавиши терминала, которые генерируют сигнал (например клавиша I<interrupt>, обычно это комбинация control-C), то сигнал посылается процессам в активном задании.

source: Various system calls and library functions may operate on all members of a process group, including B<kill>(2), B<killpg>(3), B<getpriority>(2), B<setpriority>(2), B<ioprio_get>(2), B<ioprio_set>(2), B<waitid>(2), and B<waitpid>(2). See also the discussion of the B<F_GETOWN>, B<F_GETOWN_EX>, B<F_SETOWN>, and B<F_SETOWN_EX> operations in B<fcntl>(2).
ru: С членами группы процессов могут работать различные системные вызовы и библиотечные функции, такие как: B<kill>(2), B<killpg>(3), B<getpriority>(2), B<setpriority>(2), B<ioprio_get>(2), B<ioprio_set>(2), B<waitid>(2) и B<waitpid>(2). Также смотрите описание операций B<F_GETOWN>, B<F_GETOWN_EX>, B<F_SETOWN> и B<F_SETOWN_EX> в B<fcntl>(2).

source: User and group identifiers
ru: Идентификаторы пользователя и группы

source: Each process has various associated user and group IDs. These IDs are integers, respectively represented using the types I<uid_t> and I<gid_t> (defined in I<E<lt>sys/types.hE<gt>>).
ru: С каждым процессом связаны идентификатор пользователя и различных групп. Эти идентификаторы представляются в виде целых чисел с типами I<gid_t> и I<uid_t>, соответственно (определены в I<E<lt>sys/types.hE<gt>>).

source: On Linux, each process has the following user and group identifiers:
ru: В Linux каждый процесс имеет следующие идентификаторы пользователя и групп:

source: Real user ID and real group ID. These IDs determine who owns the process. A process can obtain its real user (group) ID using B<getuid>(2) (B<getgid>(2)).
ru: Реальный ID пользователя (real user) и реальный ID группы. Эти ID определяют кто владелец процесса. Реальный ID пользователя (группы) процесса можно получить с помощью B<getuid>(2) (B<getgid>(2)).

source: Effective user ID and effective group ID. These IDs are used by the kernel to determine the permissions that the process will have when accessing shared resources such as message queues, shared memory, and semaphores. On most UNIX systems, these IDs also determine the permissions when accessing files. However, Linux uses the filesystem IDs described below for this task. A process can obtain its effective user (group) ID using B<geteuid>(2) (B<getegid>(2)).
ru: Эффективный ID пользователя (effective user) и эффективный ID группы. Эти ID используются ядром для определения прав, которые будет иметь процесс при доступе к общим ресурсам, таким как очереди сообщений, общая память и семафоры. В большинстве систем UNIX эти ID также определяют права доступа к файлам. Однако в Linux для этой задачи используются ID файловой системы, описанные далее. Эффективный ID пользователя (группы) процесса можно получить с помощью B<geteuid>(2) (B<getegid>(2)).
