Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: The command I</sbin/cpuset_release_agent> is invoked, with the name (I</dev/cpuset> relative path) of the to-be-released cpuset in I<argv[1]>.
ru: Вызываемой команде I</sbin/cpuset_release_agent> в I<argv[1]> передаётся имя (относительно пути I</dev/cpuset>) освобождаемого процессорного набора.

source: The usual contents of the command I</sbin/cpuset_release_agent> is simply the shell script:
ru: Обычно, команда I</sbin/cpuset_release_agent> — простой сценарий оболочки:

source: As with other flag values below, this flag can be changed by writing an ASCII number 0 or 1 (with optional trailing newline) into the file, to clear or set the flag, respectively.
ru: Для сброса и установки, как и других флагов, этот флаг можно изменить, записав в файл ASCII-номер 0 или 1 (с необязательным символом новой строки в конце), соответственно.

source: Memory pressure
ru: Нагрузка памяти

source: The I<memory_pressure> of a cpuset provides a simple per-cpuset running average of the rate that the processes in a cpuset are attempting to free up in-use memory on the nodes of the cpuset to satisfy additional memory requests.
ru: Значение I<memory_pressure> в процессорном наборе предоставляет индивидуальный простой средний уровень, с которым процессы в процессорном наборе пытаются освободить используемую память на узлах процессорного набора, чтобы удовлетворить дополнительные запросы памяти.

source: This enables batch managers that are monitoring jobs running in dedicated cpusets to efficiently detect what level of memory pressure that job is causing.
ru: Это позволяет менеджерам заданий, отслеживающим задания, выполняемые на отдельных процессорных наборах, эффективно определять уровень нагрузки на память, которую вызывает задание.

source: This is useful both on tightly managed systems running a wide mix of submitted jobs, which may choose to terminate or reprioritize jobs that are trying to use more memory than allowed on the nodes assigned them, and with tightly coupled, long-running, massively parallel scientific computing jobs that will dramatically fail to meet required performance goals if they start to use more memory than allowed to them.
ru: Это полезно как в жёстко контролируемых системах, выполняющих совершенно разные поставленные задания, которые при попытке использовать больше памяти, чем разрешено на назначенных им узлам, могут выбирать — завершить задание или изменить его приоритет, так и для тесно связанных, непрерывных, распараллеленных научных вычислительных заданий, которые катастрофически теряют в производительности, если начинают использовать больше памяти, чем им позволено.

source: This mechanism provides a very economical way for the batch manager to monitor a cpuset for signs of memory pressure. It's up to the batch manager or other user code to decide what action to take if it detects signs of memory pressure.
ru: Данный механизм предоставляет менеджерам заданий очень экономичный способ для обнаружения признаков нагрузки на память. Задача менеджера заданий или другого пользовательского кода решить, какие меры принять в случае обнаружения нагрузки на память.

source: Unless memory pressure calculation is enabled by setting the pseudo-file I</dev/cpuset/cpuset.memory_pressure_enabled>, it is not computed for any cpuset, and reads from any I<memory_pressure> always return zero, as represented by the ASCII string "0\en". See the B<WARNINGS> section, below.
ru: Если вычисление нагрузки памяти не включено в псевдо-файле I</dev/cpuset/cpuset.memory_pressure_enabled>, то она не вычисляется для всех процессорных наборов, и чтение из любого файла I<memory_pressure> всегда возвращает ноль в виде строки ASCII «0\en». Смотрите раздел B<ПРЕДУПРЕЖДЕНИЯ> далее.

source: A per-cpuset, running average is employed for the following reasons:
ru: Для каждого процессорного набора скользящее среднее (running average) используется по следующим причинам:

source: Because this meter is per-cpuset rather than per-process or per virtual memory region, the system load imposed by a batch scheduler monitoring this metric is sharply reduced on large systems, because a scan of the tasklist can be avoided on each set of queries.
ru: Поскольку измерение проводится по каждому процессорному набору, а не по каждому процессу или виртуальной области памяти, системная нагрузка, вызванная проводящим замеры пакетным планировщиком, резко сокращается в больших системах, так как можно не выполнять сканирование списка задач на каждый набор запросов.

source: Because this meter is a running average rather than an accumulating counter, a batch scheduler can detect memory pressure with a single read, instead of having to read and accumulate results for a period of time.
ru: Поскольку измеряется скользящее среднее, а не накопительный счётчик, пакетный планировщик может обнаружить нагрузку памяти за одно чтение, а не читать и накапливать результаты за период времени.

source: Because this meter is per-cpuset rather than per-process, the batch scheduler can obtain the key information\(emmemory pressure in a cpuset\(emwith a single read, rather than having to query and accumulate results over all the (dynamically changing) set of processes in the cpuset.
ru: Поскольку измерение проводится по каждому процессорному набору, а не по каждому процессу, пакетный планировщик может получить ключевую информацию — нагрузку памяти в процессорном наборе — за одну операцию чтения, а не выполняя запрос и не накапливая результаты по всему (динамически изменяющемуся) набору процессов в процессорном наборе.

source: The I<memory_pressure> of a cpuset is calculated using a per-cpuset simple digital filter that is kept within the kernel. For each cpuset, this filter tracks the recent rate at which processes attached to that cpuset enter the kernel direct reclaim code.
ru: Значение I<memory_pressure> для процессорного набора вычисляется с помощью индивидуального простого цифрового фильтра, который хранится в ядре. Для каждого процессорного набора этот фильтр отслеживает недавний уровень, с которым процессы, прикреплённые к этому процессорному набору, использовали код непосредственного освобождения ядром (kernel direct reclaim code).

source: The kernel direct reclaim code is entered whenever a process has to satisfy a memory page request by first finding some other page to repurpose, due to lack of any readily available already free pages. Dirty filesystem pages are repurposed by first writing them to disk. Unmodified filesystem buffer pages are repurposed by simply dropping them, though if that page is needed again, it will have to be reread from disk.
ru: Код непосредственного освобождения ядром выполняется, когда процессы из-за нехватки готовых свободных страниц удовлетворяют запрос выделение страницы памяти приспособлением (repurpose) страницы, занятой под другие цели. Грязные страницы файловой системы приспосабливаются после первой записи обратно на диск. Неизменённые страницы буфера файловой системы приспосабливаются простым сбросом, и если такая страница потребуется снова, то она будет повторно прочитана с диска.

source: The I<cpuset.memory_pressure> file provides an integer number representing the recent (half-life of 10 seconds) rate of entries to the direct reclaim code caused by any process in the cpuset, in units of reclaims attempted per second, times 1000.
ru: Файл I<cpuset.memory_pressure> содержит целое число, представляющее недавний (период спада (half-life) за 10 секунд) уровень записей в код непосредственного освобождения, вызванный любым процессом в процессорном наборе, выражаемый в количестве освобождений в секунду, умноженном на 1000.

source: Memory spread
ru: Распространение в памяти

source: There are two Boolean flag files per cpuset that control where the kernel allocates pages for the filesystem buffers and related in-kernel data structures. They are called I<cpuset.memory_spread_page> and I<cpuset.memory_spread_slab>.
ru: Для каждого процессорного набора есть два файла — логических флага, которые управляют местом, где ядро выделяет страницы для буферов файловой системы и других структур данных ядра. Они называются I<cpuset.memory_spread_page> и I<cpuset.memory_spread_slab>.

source: If the per-cpuset Boolean flag file I<cpuset.memory_spread_page> is set, then the kernel will spread the filesystem buffers (page cache) evenly over all the nodes that the faulting process is allowed to use, instead of preferring to put those pages on the node where the process is running.
ru: Если установлен индивидуальный логический флаг-файл I<cpuset.memory_spread_page>, то ядро будет распространять буферы файловой системы (страничный кэш) последовательно по всем узлам, которые разрешено использовать процессу, а не располагать эти страницы на узле, на котором выполняется процесс.

source: If the per-cpuset Boolean flag file I<cpuset.memory_spread_slab> is set, then the kernel will spread some filesystem-related slab caches, such as those for inodes and directory entries, evenly over all the nodes that the faulting process is allowed to use, instead of preferring to put those pages on the node where the process is running.
ru: Если установлен индивидуальный логический флаг-файл I<cpuset.memory_spread_slab>, то ядро будет распространять slab-кэши файловой системы, например, для записей inode и каталогов, последовательно по всем узлам, которые разрешено использовать процессу, а не располагать эти страницы на узле, на котором выполняется процесс.

source: The setting of these flags does not affect the data segment (see B<brk>(2)) or stack segment pages of a process.
ru: Установка этих флагов не влияет на страницы сегмента данных (смотрите B<brk>(2)) или стека процесса.

source: By default, both kinds of memory spreading are off and the kernel prefers to allocate memory pages on the node local to where the requesting process is running. If that node is not allowed by the process's NUMA memory policy or cpuset configuration or if there are insufficient free memory pages on that node, then the kernel looks for the nearest node that is allowed and has sufficient free memory.
ru: По умолчанию, оба вида распространения в памяти выключены, и ядро предпочитает выделять страницы памяти на узле, на котором работает запросивший процесс. Если этот узел не разрешён политикой памяти NUMA процесса или настройкой процессорного набора или если на этом узле недостаточно свободных страниц памяти, то ядро ищет ближайший разрешённый узел с достаточным количеством свободной памяти.

source: When new cpusets are created, they inherit the memory spread settings of their parent.
ru: При создании нового процессорного набора он наследует параметры распространения в памяти своего родителя.

source: Setting memory spreading causes allocations for the affected page or slab caches to ignore the process's NUMA memory policy and be spread instead. However, the effect of these changes in memory placement caused by cpuset-specified memory spreading is hidden from the B<mbind>(2) or B<set_mempolicy>(2) calls. These two NUMA memory policy calls always appear to behave as if no cpuset-specified memory spreading is in effect, even if it is. If cpuset memory spreading is subsequently turned off, the NUMA memory policy most recently specified by these calls is automatically reapplied.
ru: Из-за настройки распространения в памяти при выделении страниц или кэшей slab происходит игнорирование политики памяти NUMA процесса и задействуется распространение. Однако, эффект этих изменений по расположению в памяти, вызванный указанным в процессорном наборе распространением в памяти скрыт, от вызовов B<mbind>(2) или B<set_mempolicy>(2). При работе с данными вызовами политики памяти NUMA кажется, что они всегда ведут себя как-будто распространение в памяти согласно процессорному набору не действует, даже если это не так. Если распространение в памяти согласно процессорному набору затем выключить, то автоматически повторно применится политика памяти NUMA, заданная этими вызовами последней.

source: Both I<cpuset.memory_spread_page> and I<cpuset.memory_spread_slab> are Boolean flag files. By default, they contain "0", meaning that the feature is off for that cpuset. If a "1" is written to that file, that turns the named feature on.
ru: Файлы I<cpuset.memory_spread_page> и I<cpuset.memory_spread_slab> хранят логический флаг. По умолчанию, они содержат «0»; это означает, что данное свойство в процессорном наборе выключено. Если в файл записать «1», то это включит данное свойство.

source: Cpuset-specified memory spreading behaves similarly to what is known (in other contexts) as round-robin or interleave memory placement.
ru: Распространение в памяти, указанное в процессорном наборе, похоже (в других контекстах) на циклический алгоритм или размещение памяти чередованием.

source: Cpuset-specified memory spreading can provide substantial performance improvements for jobs that:
ru: Распространение в памяти, указанное в процессорном наборе, может существенно повысить производительность заданий, которым:

source: need to place thread-local data on memory nodes close to the CPUs which are running the threads that most frequently access that data; but also
ru: Необходимо разместить локальные данные нити в узлах памяти близко к ЦП, на которых выполняются нити, то есть наиболее наиболее востребованные данные;

source: need to access large filesystem data sets that must to be spread across the several nodes in the job's cpuset in order to fit.
ru: Необходим доступ к наборам данных больших файловых систем, которые из-за размера нужно разместить на нескольких узлах процессорного набора задания.

source: Without this policy, the memory allocation across the nodes in the job's cpuset can become very uneven, especially for jobs that might have just a single thread initializing or reading in the data set.
ru: Без этой политики выделение памяти на узлах процессорного набора задания может быть очень неравномерным, особенно для заданий, которым нужно просто инициализировать единственную нить или прочитать набор данных.

source: Memory migration
ru: Перенос памяти

source: Normally, under the default setting (disabled) of I<cpuset.memory_migrate>, once a page is allocated (given a physical page of main memory), then that page stays on whatever node it was allocated, so long as it remains allocated, even if the cpuset's memory-placement policy I<mems> subsequently changes.
ru: Обычно, при настройке I<cpuset.memory_migrate> по умолчанию (выключена) как только страница выделена (получена физическая страница в основной памяти), она остаётся на узле, на котором выделена до тех пор, пока остаётся выделенной, даже если в дальнейшем изменяется политика процессорного набора I<mems> по размещению в памяти.

source: When memory migration is enabled in a cpuset, if the I<mems> setting of the cpuset is changed, then any memory page in use by any process in the cpuset that is on a memory node that is no longer allowed will be migrated to a memory node that is allowed.
ru: При включённом переносе памяти в процессорном наборе, если значение I<mems> в процессорном наборе изменяется, то если страница памяти, используемая любым процессом в процессорном наборе, становится расположенной в запрещённом узле, то эта страница перемещается в разрешённый узел памяти.

source: Furthermore, if a process is moved into a cpuset with I<memory_migrate> enabled, any memory pages it uses that were on memory nodes allowed in its previous cpuset, but which are not allowed in its new cpuset, will be migrated to a memory node allowed in the new cpuset.
ru: Также, если процесс перемещается в процессорный набор, у которого включен I<memory_migrate>, то все страницы памяти, которые он использует в узлах памяти предыдущего процессорного набора, но которые запрещены в новом процессорном наборе, будут перемещены на узел памяти, разрешённый в новом процессорном наборе.

source: The relative placement of a migrated page within the cpuset is preserved during these migration operations if possible. For example, if the page was on the second valid node of the prior cpuset, then the page will be placed on the second valid node of the new cpuset, if possible.
ru: Если возможно, при операции перемещения относительное размещение перемещаемых страниц в процессорном наборе сохраняется. Например, если страница была на втором разрешённом узле в предыдущем процессорном наборе, то страница будет помещена на второй допустимый узел нового процессорном наборе, если возможно.

source: Scheduler load balancing
ru: Балансировка нагрузки планировщиком

source: The kernel scheduler automatically load balances processes. If one CPU is underutilized, the kernel will look for processes on other more overloaded CPUs and move those processes to the underutilized CPU, within the constraints of such placement mechanisms as cpusets and B<sched_setaffinity>(2).
ru: Планировщик ядра автоматически балансирует нагрузку, вызываемую процессами. Если один ЦП недозагружен, то ядро будет искать процессы на других, более загруженных ЦП и переместит процессы на недозагруженный ЦП, с учётом ограничений механизмов размещения в процессорных наборах и B<sched_setaffinity>(2).

source: The algorithmic cost of load balancing and its impact on key shared kernel data structures such as the process list increases more than linearly with the number of CPUs being balanced. For example, it costs more to load balance across one large set of CPUs than it does to balance across two smaller sets of CPUs, each of half the size of the larger set. (The precise relationship between the number of CPUs being balanced and the cost of load balancing depends on implementation details of the kernel process scheduler, which is subject to change over time, as improved kernel scheduler algorithms are implemented.)
ru: Траты на алгоритм балансировки нагрузки и его влияние на основные совместно используемые структуры данных ядра, такие как список процессов, с ростом балансируемых ЦП увеличиваются больше, чем линейно. Например, затраты на него больше при балансировке нагрузке в одном большом наборе ЦП, чем между двумя маленькими наборами ЦП, каждый из которых равен половине размера большего набора (точное отношение между количеством балансируемых ЦП и затратами на балансировку зависит от деталей реализации процесса планировщика ядра, который изменяется со временем, улучшаясь по мере реализации в ядре эффективных алгоритмов планирования).

source: The per-cpuset flag I<sched_load_balance> provides a mechanism to suppress this automatic scheduler load balancing in cases where it is not needed and suppressing it would have worthwhile performance benefits.
ru: Индивидуальный флаг I<sched_load_balance> предоставляет механизм для подавления этого автоматического планировщика балансировки нагрузки в случае когда он не требуется и его выключение принесло бы больше выгоды для производительности.

source: By default, load balancing is done across all CPUs, except those marked isolated using the kernel boot time "isolcpus=" argument. (See B<Scheduler Relax Domain Level>, below, to change this default.)
ru: По умолчанию, балансировка нагрузки выполняется на всех ЦП, за исключением отмеченных как изолированные при запуске ядра с аргументом «isolcpus=» (смотрите B<Степень ослабления домена планировщиком> далее для изменения этого значения по умолчанию).

source: This default load balancing across all CPUs is not well suited to the following two situations:
ru: Данное поведение балансировка нагрузки по умолчанию, выполняемое на всех ЦП, не подходит в двух следующих случаях:

source: On large systems, load balancing across many CPUs is expensive. If the system is managed using cpusets to place independent jobs on separate sets of CPUs, full load balancing is unnecessary.
ru: На больших системах балансировка нагрузки на многих ЦП затратна. Если система управляется с помощью процессорных наборов для размещения независимых заданий на отдельных наборах ЦП, то полная балансировка нагрузки необязательна.

source: Systems supporting real-time on some CPUs need to minimize system overhead on those CPUs, including avoiding process load balancing if that is not needed.
ru: В системах, поддерживающих выполнение в реальном времени на некоторых ЦП, требуются минимальные издержки на системные операции на этих ЦП, включая запрещение процесса балансировки нагрузки, если он не нужен.

source: When the per-cpuset flag I<sched_load_balance> is enabled (the default setting), it requests load balancing across all the CPUs in that cpuset's allowed CPUs, ensuring that load balancing can move a process (not otherwise pinned, as by B<sched_setaffinity>(2)) from any CPU in that cpuset to any other.
ru: Когда индивидуальный флаг I<sched_load_balance> установлен (по умолчанию), запрашивается балансировка нагрузки на всех разрешённых ЦП в этом процессорном наборе, при балансировке нагрузки может выполняться перемещение процесса (если он не привязан с помощью B<sched_setaffinity>(2)) с любого ЦП в этом процессорном наборе на другой ЦП.

source: When the per-cpuset flag I<sched_load_balance> is disabled, then the scheduler will avoid load balancing across the CPUs in that cpuset, I<except> in so far as is necessary because some overlapping cpuset has I<sched_load_balance> enabled.
ru: Когда индивидуальный флаг I<sched_load_balance> сброшен, планировщик не будет балансировать нагрузку по ЦП в этом процессорном наборе, I<пока это не станет необходимым> из-за какого-то перекрывающегося процессорного набора с включённым I<sched_load_balance>.

source: So, for example, if the top cpuset has the flag I<sched_load_balance> enabled, then the scheduler will load balance across all CPUs, and the setting of the I<sched_load_balance> flag in other cpusets has no effect, as we're already fully load balancing.
ru: Так, например, если верхний процессорный набор имеет установленный флаг I<sched_load_balance>, то планировщик будет выполнять балансировку нагрузки на всех ЦП, и значение флага I<sched_load_balance> других процессорных наборов не учитывается, так как уже включена полная балансировка нагрузки.

source: Therefore in the above two situations, the flag I<sched_load_balance> should be disabled in the top cpuset, and only some of the smaller, child cpusets would have this flag enabled.
ru: Поэтому в двух приведённых выше ситуациях флаг I<sched_load_balance> должен быть сброшен у верхнего процессорного набора, и его нужно устанавливать только на отдельных дочерних процессорных наборах.

source: When doing this, you don't usually want to leave any unpinned processes in the top cpuset that might use nontrivial amounts of CPU, as such processes may be artificially constrained to some subset of CPUs, depending on the particulars of this flag setting in descendant cpusets. Even if such a process could use spare CPU cycles in some other CPUs, the kernel scheduler might not consider the possibility of load balancing that process to the underused CPU.
ru: При выполнении этого вы, обычно, не хотите оставлять любые неприкрепленные процессы в верхнем процессорном наборе, который может использовать неограниченное количество ЦП, так как процессы могут быть искусственно ограничены некоторым подмножеством ЦП, в зависимости от значения этого флага в дочерних процессорных наборах. Даже если такой процесс мог бы использовать запасные циклы ЦП в некоторых других ЦП, планировщик ядра не может рассчитывать на возможность балансировки нагрузки этого процесса на недогруженном ЦП.
