Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: A capability-dumb binary is an application that has been marked to have file capabilities, but has not been converted to use the B<libcap>(3) API to manipulate its capabilities. (In other words, this is a traditional set-user-ID-root program that has been switched to use file capabilities, but whose code has not been modified to understand capabilities.) For such applications, the effective capability bit is set on the file, so that the file permitted capabilities are automatically enabled in the process effective set when executing the file. The kernel recognizes a file which has the effective capability bit set as capability-dumb for the purpose of the check described here.
ru: Двоичный файл, не отзывчивый к мандатам (capability-dumb binary) — это приложение, которое помечено как имеющее файловые мандаты, но не преобразованное для работы с программным интерфейсом B<libcap>(3) для управления своими мандатами (иначе говоря, это обычная set-user-ID-root программа, у которой указали файловые мандаты, но код которой не был изменён для понимания мандатов). У таких приложений на файле установлен эффективный файловый мандатный бит, из-за чего при исполнении файла у его процесса в эффективном наборе автоматически включаются разрешительные мандаты. Если ядро считает файл с установленным эффективным файловым мандатным битом не отзывчивым к мандатам, то выполняются проверки, описанные далее.

source: When executing a capability-dumb binary, the kernel checks if the process obtained all permitted capabilities that were specified in the file permitted set, after the capability transformations described above have been performed. (The typical reason why this might I<not> occur is that the capability bounding set masked out some of the capabilities in the file permitted set.) If the process did not obtain the full set of file permitted capabilities, then B<execve>(2) fails with the error B<EPERM>. This prevents possible security risks that could arise when a capability-dumb application is executed with less privilege that it needs. Note that, by definition, the application could not itself recognize this problem, since it does not employ the B<libcap>(3) API.
ru: При запуске выполняемого файла, не отзывчивого к мандатам, ядро проверяет получил ли процесс все разрешительные мандаты, указанные в файловом разрешительном наборе, после преобразований мандатов, описанных выше (обычной причиной, почему это может I<не> произойти, является то, что ограничивающий набор мандатов перекрывает некоторые мандаты из файлового разрешительного набора). Если процесс не получил полный набор файловых разрешительных мандатов, то B<execve>(2) завершится с ошибкой B<EPERM>. Это предотвращает возникновение проблем с безопасностью, которые могли бы появиться, если приложение, не отзывчивое к мандатам, выполняется с меньшими правами чем требуется. Заметим, что по определению само приложение не может увидеть эту проблему, так как не используется программный интерфейс B<libcap>(3).

source: Capabilities and execution of programs by root
ru: Мандаты и выполнение программ с правами root

source: In order to mirror traditional UNIX semantics, the kernel performs special treatment of file capabilities when a process with UID 0 (root) executes a program and when a set-user-ID-root program is executed.
ru: Чтобы отразить обычную семантику UNIX, ядро выполняет специальные действия с файловыми мандатами, когда процесс с UID 0 (корневой) выполняет программу и когда выполняется программа с set-user-ID-root.

source: After having performed any changes to the process effective ID that were triggered by the set-user-ID mode bit of the binary\(eme.g., switching the effective user ID to 0 (root) because a set-user-ID-root program was executed\(emthe kernel calculates the file capability sets as follows:
ru: После применения изменений к эффективному ID процесса, которые возникли из-за режимного бита set-user-ID у исполняемого файла — например, переключение действующего ID пользователя на 0 (root) из-за запуска программы с set-user-ID-root — ядро вычисляет набор файловых мандатов следующим образом:

source: If the real or effective user ID of the process is 0 (root), then the file inheritable and permitted sets are ignored; instead they are notionally considered to be all ones (i.e., all capabilities enabled). (There is one exception to this behavior, described below in I<Set-user-ID-root programs that have file capabilities>.)
ru: Если реальный и эффективный ID пользователя процесса равен 0 (root), то файловый разрешительные или наследуемые наборы игнорируются; вместо этого условно считается, что все их биты установлены (т. е., разрешены все мандаты). (Существует одно исключение из этого правила, описано в I<Программы set-user-ID-root с файловыми мандатами>.)

source: If the effective user ID of the process is 0 (root) or the file effective bit is in fact enabled, then the file effective bit is notionally defined to be one (enabled).
ru: Если эффективный ID пользователя процесса равен 0 (root) или файловый эффективный бит фактически установлен, то файловый эффективный бит условно считается равным единице (включен).

source: These notional values for the file's capability sets are then used as described above to calculate the transformation of the process's capabilities during B<execve>(2).
ru: Затем эти условные значения файлового набора мандатов используются, как описано выше, для вычисления преобразования мандатов процесса при B<execve>(2).

source: Thus, when a process with nonzero UIDs B<execve>(2)s a set-user-ID-root program that does not have capabilities attached, or when a process whose real and effective UIDs are zero B<execve>(2)s a program, the calculation of the process's new permitted capabilities simplifies to:
ru: Таким образом, когда процесс с ненулевым UID запускает с помощью B<execve>(2) программу с set-user-ID-root, у которой нет присоединённых мандатов, или когда процесс, чей реальный и эффективный UID равны нулю, запускают программу через B<execve>(2), вычисление новых разрешённых мандатов упрощается до:

source: Consequently, the process gains all capabilities in its permitted and effective capability sets, except those masked out by the capability bounding set. (In the calculation of P'(permitted), the P'(ambient) term can be simplified away because it is by definition a proper subset of P(inheritable).)
ru: В связи с этим, процесс получает все мандаты в своих разрешительном и эффективном наборе мандатов , за исключением заглушаемых ограничивающим набором мандатов. (В вычислении P'(permitted), значение P'(ambient) можно сократить, так как оно определяется корректным поднабором P(inheritable).)

source: The special treatments of user ID 0 (root) described in this subsection can be disabled using the securebits mechanism described below.
ru: Специальное действие для ID пользователя 0 (root), описанное в этом абзаце, можно отключить с помощью механизма securebits, описанного далее.

source: Set-user-ID-root programs that have file capabilities
ru: Программы set-user-ID-root с файловыми мандатами

source: There is one exception to the behavior described under I<Capabilities and execution of programs by root>. If (a) the binary that is being executed has capabilities attached and (b) the real user ID of the process is I<not> 0 (root) and (c) the effective user ID of the process I<is> 0 (root), then the file capability bits are honored (i.e., they are not notionally considered to be all ones). The usual way in which this situation can arise is when executing a set-UID-root program that also has file capabilities. When such a program is executed, the process gains just the capabilities granted by the program (i.e., not all capabilities, as would occur when executing a set-user-ID-root program that does not have any associated file capabilities).
ru: Есть одно исключение в поведении, описанном в I<Мандаты и выполнение программ с правами root>. Если (a) к исполняемому двоичному файлу присоединены мандаты и (b) реальный пользовательский ID процесса I<не> равен 0 (root) и (c) эффективный пользовательский ID процесса I<равен> 0 (root), то биты файловых мандатов учитываются (т. е., они не условно считаются установленными в единицы). Обычно, эта ситуация может возникать при исполнении программы с set-UID-root, у которой также заданы файловые мандаты. При выполнении такой программы процесс получает только мандаты, данные программе (т. е., не все мандаты, как это происходит, когда выполняемая программа с set-user-ID-root не имеет связанных файловых мандатов).

source: Note that one can assign empty capability sets to a program file, and thus it is possible to create a set-user-ID-root program that changes the effective and saved set-user-ID of the process that executes the program to 0, but confers no capabilities to that process.
ru: Заметим, что файлу программы можно назначить пустой набор мандатов, и таким образом возможно создать программу с set-user-ID-root, которая изменяет эффективный и сохранённый set-user-ID процесса, исполняющего программу, на 0, но не даёт мандаты этому процессу.

source: Capability bounding set
ru: Ограничивающий набор мандатов

source: The capability bounding set is a security mechanism that can be used to limit the capabilities that can be gained during an B<execve>(2). The bounding set is used in the following ways:
ru: Ограничивающий набор мандатов — это механизм безопасности, который можно использовать для ограничения мандатов, которые могут быть получены при B<execve>(2). Ограничивающий набор используется так:

source: During an B<execve>(2), the capability bounding set is ANDed with the file permitted capability set, and the result of this operation is assigned to the thread's permitted capability set. The capability bounding set thus places a limit on the permitted capabilities that may be granted by an executable file.
ru: При B<execve>(2) ограничивающий набор мандатов складывается (AND) с файловым разрешительным набором мандатов, и результат этой операции назначается разрешительному набору мандатов нити. Таким образом, ограничивающий набор мандатов ограничивает разрешённые мандаты, которые может предоставить исполняемый файл.

source: (Since Linux 2.6.25) The capability bounding set acts as a limiting superset for the capabilities that a thread can add to its inheritable set using B<capset>(2). This means that if a capability is not in the bounding set, then a thread can't add this capability to its inheritable set, even if it was in its permitted capabilities, and thereby cannot have this capability preserved in its permitted set when it B<execve>(2)s a file that has the capability in its inheritable set.
ru: (начиная с Linux 2.6.25) Ограничивающий набор мандатов служит ограничивающим набором мандатов, которые нить может добавить в свой наследуемый набор с помощью B<capset>(2). Это означает, что если мандат отсутствует в ограничивающем наборе мандатов, то нить не может добавить этот мандат в свой наследуемый набор даже, если он есть в разрешительном наборе мандатов и поэтому не может сохранить данный мандат в разрешительный набор при вызове B<execve>(2) для файла, который имеет мандат в своём наследуемом наборе.

source: Note that the bounding set masks the file permitted capabilities, but not the inheritable capabilities. If a thread maintains a capability in its inheritable set that is not in its bounding set, then it can still gain that capability in its permitted set by executing a file that has the capability in its inheritable set.
ru: Заметим, что ограничивающий набор скрывает файловые разрешительные мандаты, но не наследуемые мандаты. Если нить имеет мандат в своём наследуемом наборе, который отсутствует в ограничивающем наборе, то она по-прежнему обладает этим мандатом в своём разрешительном наборе при выполнении файла, который имеет мандат в своём наследуемом наборе.

source: Depending on the kernel version, the capability bounding set is either a system-wide attribute, or a per-process attribute.
ru: В зависимости от версии ядра ограничивающий набор мандатов является либо системным свойством, либо атрибутом процесса.

source: B<Capability bounding set from Linux 2.6.25 onward>
ru: B<Ограничивающий набор мандатов начиная с Linux 2.6.25>

source: From Linux 2.6.25, the I<capability bounding set> is a per-thread attribute. (The system-wide capability bounding set described below no longer exists.)
ru: Начиная с Linux 26.25, I<ограничивающий набор мандатов> является атрибутом нити (системного ограничивающего набора мандатов, описываемого далее, больше нет).

source: The bounding set is inherited at B<fork>(2) from the thread's parent, and is preserved across an B<execve>(2).
ru: Ограничивающий набор наследуется при B<fork>(2) от нити родителя и сохраняется при B<execve>(2).

source: A thread may remove capabilities from its capability bounding set using the B<prctl>(2) B<PR_CAPBSET_DROP> operation, provided it has the B<CAP_SETPCAP> capability. Once a capability has been dropped from the bounding set, it cannot be restored to that set. A thread can determine if a capability is in its bounding set using the B<prctl>(2) B<PR_CAPBSET_READ> operation.
ru: Нить может удалять мандаты из своего ограничивающего набора мандатов с помощью вызова B<prctl>(2) с операцией B<PR_CAPBSET_DROP> при наличии мандата B<CAP_SETPCAP>. После удаления мандата из ограничивающего набора обратно его восстановить невозможно. Нить может определить наличие мандата в своём ограничивающем наборе с помощью вызова B<prctl>(2) с операцией B<PR_CAPBSET_READ>.

source: Removing capabilities from the bounding set is supported only if file capabilities are compiled into the kernel. In kernels before Linux 2.6.33, file capabilities were an optional feature configurable via the B<CONFIG_SECURITY_FILE_CAPABILITIES> option. Since Linux 2.6.33, the configuration option has been removed and file capabilities are always part of the kernel. When file capabilities are compiled into the kernel, the B<init> process (the ancestor of all processes) begins with a full bounding set. If file capabilities are not compiled into the kernel, then B<init> begins with a full bounding set minus B<CAP_SETPCAP>, because this capability has a different meaning when there are no file capabilities.
ru: Удаление мандатов из ограничивающего набора доступно только, если ядро собрано с поддержкой файловых мандатов. В ядре Linux до версии 2.6.33 файловые мандаты являлись необязательным свойством, настраиваемым параметром B<CONFIG_SECURITY_FILE_CAPABILITIES>. Начиная с Linux 2.6.33, параметр настройки был удалён и теперь файловые мандаты всегда являются частью ядра. Когда файловые мандаты в ядре, процесс B<init> (предок всех процессов) запускается с полным ограничивающим набором. Если файловые мандаты не добавлены в ядро, то B<init> запускается с полным ограничивающим набором минус B<CAP_SETPCAP>, так как этот мандат имеет другое значение, если файловые мандаты отсутствуют.

source: Removing a capability from the bounding set does not remove it from the thread's inheritable set. However it does prevent the capability from being added back into the thread's inheritable set in the future.
ru: Удаление мандата из ограничивающего набора не удаляет его из наследуемого набора нити. Однако это предотвращает от добавления мандата обратно в наследуемый набор нити в будущем.

source: B<Capability bounding set prior to Linux 2.6.25>
ru: B<Ограничивающий набор мандатов до Linux 2.6.25>

source: In kernels before 2.6.25, the capability bounding set is a system-wide attribute that affects all threads on the system. The bounding set is accessible via the file I</proc/sys/kernel/cap-bound>. (Confusingly, this bit mask parameter is expressed as a signed decimal number in I</proc/sys/kernel/cap-bound>.)
ru: В ядрах до версии 2.6.25 ограничивающий набор мандатов был системным атрибутом, который влиял на все нити системы. Ограничивающий набор доступен через файл I</proc/sys/kernel/cap-bound> (по непонятной причине, данный параметр, битовая маска, в I</proc/sys/kernel/cap-bound> записывался в виде знакового десятичного числа).

source: Only the B<init> process may set capabilities in the capability bounding set; other than that, the superuser (more precisely: a process with the B<CAP_SYS_MODULE> capability) may only clear capabilities from this set.
ru: Только процесс B<init> может задавать мандаты в ограничивающем наборе мандатов; помимо этого, суперпользователь (точнее, процесс с мандатом B<CAP_SYS_MODULE>) может только удалять мандаты из набора.

source: On a standard system the capability bounding set always masks out the B<CAP_SETPCAP> capability. To remove this restriction (dangerous!), modify the definition of B<CAP_INIT_EFF_SET> in I<include/linux/capability.h> and rebuild the kernel.
ru: В стандартной системе в ограничивающем наборе мандатов всегда удаляется мандат B<CAP_SETPCAP>. Чтобы убрать это ограничение (опасно!), нужно изменить определение B<CAP_INIT_EFF_SET> в I<include/linux/capability.h> и пересобрать ядро.

source: The system-wide capability bounding set feature was added to Linux starting with kernel version 2.2.11.
ru: Системное свойство, ограничивающий набор мандатов, было добавлено в ядро Linux версии 2.2.11.

source: Effect of user ID changes on capabilities
ru: Влияние изменения пользовательского ID на мандаты

source: To preserve the traditional semantics for transitions between 0 and nonzero user IDs, the kernel makes the following changes to a thread's capability sets on changes to the thread's real, effective, saved set, and filesystem user IDs (using B<setuid>(2), B<setresuid>(2), or similar):
ru: Для сохранения привычной семантики при переходе от 0 к ненулевым пользовательским ID, ядро делает следующие изменения наборов мандатов нити при изменении у нити реального, эффективного, сохранённого ID и пользовательского ID файловой системы (с помощью B<setuid>(2), B<setresuid>(2) или подобных):

source: If one or more of the real, effective or saved set user IDs was previously 0, and as a result of the UID changes all of these IDs have a nonzero value, then all capabilities are cleared from the permitted, effective, and ambient capability sets.
ru: Если ранее реальный, эффективный или сохранённый пользовательский ID не был равен 0, и в результате изменения UID все эти ID получили ненулевое значение, то все мандаты удаляются из разрешительного, эффективного, и наружного набора мандатов.

source: If the effective user ID is changed from 0 to nonzero, then all capabilities are cleared from the effective set.
ru: Если эффективный пользовательский ID изменяется с 0 на ненулевое значение, то все мандаты удаляются из эффективного набора мандатов.

source: If the effective user ID is changed from nonzero to 0, then the permitted set is copied to the effective set.
ru: Если эффективный пользовательский ID изменяется с ненулевого значения на 0, то разрешительный набор копируется в эффективный набор.

source: If the filesystem user ID is changed from 0 to nonzero (see B<setfsuid>(2)), then the following capabilities are cleared from the effective set: B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER>, B<CAP_FSETID>, B<CAP_LINUX_IMMUTABLE> (since Linux 2.6.30), B<CAP_MAC_OVERRIDE>, and B<CAP_MKNOD> (since Linux 2.6.30). If the filesystem UID is changed from nonzero to 0, then any of these capabilities that are enabled in the permitted set are enabled in the effective set.
ru: Если пользовательский ID файловой системы изменяется с 0 на ненулевое значение (смотрите B<setfsuid>(2)), то следующие мандаты удаляются из эффективного набора: B<CAP_CHOWN>, B<CAP_DAC_OVERRIDE>, B<CAP_DAC_READ_SEARCH>, B<CAP_FOWNER>, B<CAP_FSETID>, B<CAP_LINUX_IMMUTABLE> (начиная с Linux 2.6.30), B<CAP_MAC_OVERRIDE> и B<CAP_MKNOD> (начиная с Linux 2.6.30). Если пользовательский ID файловой системы изменяется с ненулевого значения на 0, то любой из мандатов, включённых в разрешительный набор, включается в эффективном наборе.

source: If a thread that has a 0 value for one or more of its user IDs wants to prevent its permitted capability set being cleared when it resets all of its user IDs to nonzero values, it can do so using the B<SECBIT_KEEP_CAPS> securebits flag described below.
ru: Если нить, у которой один или более пользовательских ID равно 0, хочет предотвратить удаление разрешительных мандатов при сбросе всех пользовательских ID в ненулевые значения, то она может использовать флаг B<SECBIT_KEEP_CAPS> в securebits, описанный далее.

source: Programmatically adjusting capability sets
ru: Программное изменение наборов мандатов

source: A thread can retrieve and change its permitted, effective, and inheritable capability sets using the B<capget>(2) and B<capset>(2) system calls. However, the use of B<cap_get_proc>(3) and B<cap_set_proc>(3), both provided in the I<libcap> package, is preferred for this purpose. The following rules govern changes to the thread capability sets:
ru: Нить может получать и изменять свои разрешительные, действующие и наследуемые наборы мандатов с помощью системных вызовов B<capget>(2) и B<capset>(2). Однако для этой цели лучше использовать B<cap_get_proc>(3) и B<cap_set_proc>(3) из пакета I<libcap>. Следующие правила применяются при изменении наборов нити:

source: If the caller does not have the B<CAP_SETPCAP> capability, the new inheritable set must be a subset of the combination of the existing inheritable and permitted sets.
ru: Если вызывающий не имеет мандата B<CAP_SETPCAP>, то новый наследуемый набор должен быть поднабором комбинации существующего наследуемого и разрешительного наборов.

source: (Since Linux 2.6.25) The new inheritable set must be a subset of the combination of the existing inheritable set and the capability bounding set.
ru: (начиная с Linux 2.6.25) Новый наследуемый набор должен быть поднабором комбинации существующего наследуемого и ограничивающего наборов.

source: The new permitted set must be a subset of the existing permitted set (i.e., it is not possible to acquire permitted capabilities that the thread does not currently have).
ru: Новый разрешительный набор должен быть поднабором существующего разрешительного набора (т. е., невозможно приобрести разрешительные мандаты, которых нить не имеет).

source: The new effective set must be a subset of the new permitted set.
ru: Новый эффективный набор должен быть поднабором нового разрешительного набора.

source: The securebits flags: establishing a capabilities-only environment
ru: Флаги securebits: организация исключительно мандатного окружения

source: Starting with kernel 2.6.26, and with a kernel in which file capabilities are enabled, Linux implements a set of per-thread I<securebits> flags that can be used to disable special handling of capabilities for UID 0 (I<root>). These flags are as follows:
ru: Начиная с ядра версии 2.6.26 с включённой поддержкой файловых мандатов, в Linux реализован набор флагов I<securebits> (для каждой нити), который можно использовать для отключения специальных действий мандатов для UID 0 (I<root>). К этим флагам относятся:

source: Setting this flag allows a thread that has one or more 0 UIDs to retain capabilities in its permitted set when it switches all of its UIDs to nonzero values. If this flag is not set, then such a UID switch causes the thread to lose all permitted capabilities. This flag is always cleared on an B<execve>(2).
ru: Установка этого флага позволяет нити иметь один или более 0 UIDов, чтобы оставить мандаты в разрешительном наборе, когда она переключается все свои UIDы в ненулевые значения. Если этот флаг не установлен, то переключение такого UID приводит к тому, что нить теряет все мандаты в этих наборах. Этот флаг всегда сбрасывается при B<execve>(2).
