Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: If the interval specified in I<request> is not an exact multiple of the granularity underlying clock (see B<time>(7)), then the interval will be rounded up to the next multiple. Furthermore, after the sleep completes, there may still be a delay before the CPU becomes free to once again execute the calling thread.
ru: Если интервал, указанный в I<request>, не кратен степени разрешения используемых часов (см. B<time>(7)), то интервал будет округлён до следующего кратного значения. Также, после окончания интервала приостановки может возникнуть задержка перед тем, как ЦП освободится снова для следующего выполнения вызывающей нити.

source: Using an absolute timer is useful for preventing timer drift problems of the type described in B<nanosleep>(2). (Such problems are exacerbated in programs that try to restart a relative sleep that is repeatedly interrupted by signals.) To perform a relative sleep that avoids these problems, call B<clock_gettime>(2) for the desired clock, add the desired interval to the returned time value, and then call B<clock_nanosleep>() with the B<TIMER_ABSTIME> flag.
ru: Использование абсолютного таймера позволяет избежать проблем с уходом часов, которые описаны в B<nanosleep>(2). (Такие проблемы ухудшаются, если программа пытается перезапустить приостановку на относительный интервал после постоянно прерывания сигналами.) Чтобы избежать этих проблем при использовании относительного интервала, вызовите B<clock_gettime>(2) с нужными часами, добавьте нужный интервал к возвращённому значению времени и вызовите B<clock_nanosleep>() с флагом B<TIMER_ABSTIME>.

source: B<clock_nanosleep>() is never restarted after being interrupted by a signal handler, regardless of the use of the B<sigaction>(2) B<SA_RESTART> flag.
ru: B<clock_nanosleep>() никогда не перезапускается после того, как прерван обработчиком сигнала, независимо от значения флага B<SA_RESTART> в B<sigaction>(2).

source: The I<remain> argument is unused, and unnecessary, when I<flags> is B<TIMER_ABSTIME>. (An absolute sleep can be restarted using the same I<request> argument.)
ru: Аргумент I<remain> не нужен и не используется, если I<flags> равно B<TIMER_ABSTIME>. (Приостановка с абсолютным значением может быть перезапущена с тем же значением аргумента I<request>.)

source: POSIX.1 specifies that B<clock_nanosleep>() has no effect on signals dispositions or the signal mask.
ru: В POSIX.1 указано, что B<clock_nanosleep>() не влияет на заданные обработчики сигналов или сигнальные маски.

source: POSIX.1 specifies that after changing the value of the B<CLOCK_REALTIME> clock via B<clock_settime>(2), the new clock value shall be used to determine the time at which a thread blocked on an absolute B<clock_nanosleep>() will wake up; if the new clock value falls past the end of the sleep interval, then the B<clock_nanosleep>() call will return immediately.
ru: В POSIX.1 указано, что после изменения значения часов B<CLOCK_REALTIME> с помощью B<clock_settime>(2), новое значение часов должно быть использовано для определения времени, на которое была блокирована нить с помощью B<clock_nanosleep>() с абсолютным значением; если по новому значению часов интервал приостановки истёк, то вызов B<clock_nanosleep>() немедленно завершается.

source: POSIX.1 specifies that changing the value of the B<CLOCK_REALTIME> clock via B<clock_settime>(2) shall have no effect on a thread that is blocked on a relative B<clock_nanosleep>().
ru: В POSIX.1 указано, что изменение значения часов B<CLOCK_REALTIME> с помощью B<clock_settime>(2) не оказывает влияние на нити, которые заблокированы с помощью B<clock_nanosleep>() с относительным значением интервала.

source: chown, fchown, lchown, fchownat - change ownership of a file
ru: chown, fchown, lchown, fchownat - изменяет владельца файла

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>unistd.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt> >/* определения констант of AT_* */ B<#include E<lt>unistd.hE<gt>>

source: /* Since glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE
ru: /* начиная с glibc 2.12: */ _POSIX_C_SOURCE\ E<gt>=\ 200809L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE

source: These system calls change the owner and group of a file. The B<chown>(), B<fchown>(), and B<lchown>() system calls differ only in how the file is specified:
ru: Данные системные вызовы изменяют владельца и группу для файла. Системные вызовы B<chown>(), B<fchown>() и B<lchown>() отличаются только в том, каким образом задается файл:

source: B<chown>() changes the ownership of the file specified by I<pathname>, which is dereferenced if it is a symbolic link.
ru: B<chown>() изменяет владельца для файла, задаваемого параметром I<pathname>, который разыменовывается, если является символьной ссылкой.

source: B<fchown>() changes the ownership of the file referred to by the open file descriptor I<fd>.
ru: B<fchown>() изменяет владельца для файла, задаваемого открытым файловым дескриптором I<fd>.

source: B<lchown>() is like B<chown>(), but does not dereference symbolic links.
ru: B<lchown>() похож на B<chown>() за исключением того, что он не разыменовывает символьные ссылки.

source: Only a privileged process (Linux: one with the B<CAP_CHOWN> capability) may change the owner of a file. The owner of a file may change the group of the file to any group of which that owner is a member. A privileged process (Linux: with B<CAP_CHOWN>) may change the group arbitrarily.
ru: Только привилегированный процесс (Linux: имеющий мандат B<CAP_CHOWN>) может сменить владельца файла. Владелец файла может сменить группу файла на любую группу, в которой он числится. Привилегированный процесс (Linux: с B<CAP_CHOWN>) может задавать произвольную группу.

source: If the I<owner> or I<group> is specified as -1, then that ID is not changed.
ru: Если параметр I<owner> или I<group> равен -1, то соответствующий идентификатор не изменяется.

source: When the owner or group of an executable file is changed by an unprivileged user, the B<S_ISUID> and B<S_ISGID> mode bits are cleared. POSIX does not specify whether this also should happen when root does the B<chown>(); the Linux behavior depends on the kernel version, and since Linux 2.2.13, root is treated like other users. In case of a non-group-executable file (i.e., one for which the B<S_IXGRP> bit is not set) the B<S_ISGID> bit indicates mandatory locking, and is not cleared by a B<chown>().
ru: Когда владелец или группа исполняемого файла изменяется непривилегированным пользователем, то биты режима B<S_ISUID> и B<S_ISGID> сбрасываются В POSIX не указано, должно ли это происходить если B<chown>() выполняется суперпользователем; поведение в Linux зависит от версии ядра и начиная с Linux 2.2.13, root рассматривается как обычный пользователь. В случае исполняемого файла вне группы (т. е., у которого не установлен бит B<S_IXGRP>) бит B<S_ISGID> указывает на обязательную блокировку, и не сбрасывается при выполнении B<chown>().

source: When the owner or group of an executable file is changed (by any user), all capability sets for the file are cleared.
ru: Когда владелец или группа исполняемого файла изменяется (любым пользователем), то все наборы мандатов файла очищаются.

source: The B<fchownat>() system call operates in exactly the same way as B<chown>(), except for the differences described here.
ru: Системный вызов B<fchownat>() работает также как системный вызов B<chown>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<chown>() for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<chown>()).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<chown>()).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<chown>()).

source: The I<flags> argument is a bit mask created by ORing together 0 or more of the following values;
ru: Аргумент I<flags> представляет собой битовую маску, создаваемую побитовым сложением (OR) следующих значений;

source: B<AT_EMPTY_PATH> (since Linux 2.6.39)
ru: B<AT_EMPTY_PATH> (начиная с Linux 2.6.39)

source: If I<pathname> is an empty string, operate on the file referred to by I<dirfd> (which may have been obtained using the B<open>(2) B<O_PATH> flag). In this case, I<dirfd> can refer to any type of file, not just a directory. If I<dirfd> is B<AT_FDCWD>, the call operates on the current working directory. This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition.
ru: Если значение I<pathname> равно пустой строке, то выполнять действие над файлом, на который указывает I<dirfd> (который может быть получен с помощью B<open>(2) с флагом B<O_PATH>). В этом случае, I<dirfd> может указывать на файл любого типа, а не только на каталог. Если I<dirfd> равно B<AT_FDCWD>, то вызов выполняет действие над текущим рабочим каталогом. Этот флаг есть только в Linux; для получения его определения определите B<_GNU_SOURCE>.

source: If I<pathname> is a symbolic link, do not dereference it: instead operate on the link itself, like B<lchown>(). (By default, B<fchownat>() dereferences symbolic links, like B<chown>().)
ru: Если значение I<pathname> является символьной ссылкой, не разыменовывать её, а изменить владельца самой ссылки, как это делается в B<lchown>() (по умолчанию, B<fchownat>() разыменовывает символьные ссылки как и B<chown>()).

source: See B<openat>(2) for an explanation of the need for B<fchownat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<fchownat>().

source: The more general errors for B<chown>() are listed below.
ru: Наиболее распространённые ошибки B<chown>() перечислены далее.

source: The calling process did not have the required permissions (see above) to change owner and/or group.
ru: Вызывающий процесс не имеет требуемых прав (см. выше), чтобы изменять владельца и/или группу.

source: The general errors for B<fchown>() are listed below:
ru: Общие ошибки B<fchown>() таковы:

source: I<fd> is not a valid open file descriptor.
ru: Значение I<fd> не является правильным открытым файловым дескриптором.

source: A low-level I/O error occurred while modifying the inode.
ru: Во время изменения индексного дескриптора (inode) возникла низкоуровневая ошибка ввода/вывода.

source: The same errors that occur for B<chown>() can also occur for B<fchownat>(). The following additional errors can occur for B<fchownat>():
ru: В B<fchownat>() могут возникнуть те же ошибки, что и в B<chown>(). Также, в B<fchownat>() могут возникнуть следующие ошибки:

source: B<fchownat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Вызов B<fchownat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: The 4.4BSD version can be used only by the superuser (that is, ordinary users cannot give away files).
ru: Версия из 4.4BSD может использоваться только суперпользователем (то есть, обычные пользователи не могут менять владельцев).

source: Ownership of new files
ru: Назначение владельца новых файлов

source: When a new file is created (by, for example, B<open>(2) or B<mkdir>(2)), its owner is made the same as the filesystem user ID of the creating process. The group of the file depends on a range of factors, including the type of filesystem, the options used to mount the filesystem, and whether or not the set-group-ID mode bit is enabled on the parent directory. If the filesystem supports the B<-o\ grpid> (or, synonymously B<-o\ bsdgroups>) and B<-o\ nogrpid> (or, synonymously B<-o\ sysvgroups>) B<mount>(8) options, then the rules are as follows:
ru: При создании нового файла (например, с помощью B<open>(2) или B<mkdir>(2)), его владельцем будет установлен ID пользователя из файловой системы создающего процесса. Группа файла зависит от нескольких факторов, включая тип файловой системы, параметры монтирования и установлен ли бит режима set-group-ID на родительском каталоге. Если файловая система поддерживает параметры B<mount>(8) B<-o\ grpid> (тоже что и B<-o\ bsdgroups>) и B<-o\ nogrpid> (тоже что и B<-o\ sysvgroups>), то правила следующие:

source: If the filesystem is mounted with B<-o\ grpid>, then the group of a new file is made the same as that of the parent directory.
ru: Если файловая система смонтирована с параметром B<-o\ grpid>, то группой нового файла будет группа родительского каталога.

source: If the filesystem is mounted with B<-o\ nogrpid> and the set-group-ID bit is disabled on the parent directory, then the group of a new file is made the same as the process's filesystem GID.
ru: Если файловая система смонтирована с параметром B<-o\ nogrpid> и у родительского каталога нет бита set-group-ID, то группой нового файла будет GID файловой системы того же процесса.

source: If the filesystem is mounted with B<-o\ nogrpid> and the set-group-ID bit is enabled on the parent directory, then the group of a new file is made the same as that of the parent directory.
ru: Если файловая система смонтирована с параметром B<-o\ nogrpid> и на родительском каталоге установлен бит set-group-ID, то группой нового файла будет группа родительского каталога.

source: As at Linux 4.12, the B<-o\ grpid> and B<-o\ nogrpid> mount options are supported by ext2, ext3, ext4, and XFS. Filesystems that don't support these mount options follow the B<-o\ nogrpid> rules.
ru: Начиная с Linux 4.12, параметры монтирования B<-o\ grpid> и B<-o\ nogrpid> поддерживаются для ext2, ext3, ext4 и XFS. Для файловых систем, не поддерживающих эти параметры монтирования, используются правила как для B<-o\ nogrpid>.

source: On older kernels where B<fchownat>() is unavailable, the glibc wrapper function falls back to the use of B<chown>() and B<lchown>(). When I<pathname> is a relative pathname, glibc constructs a pathname based on the symbolic link in I</proc/self/fd> that corresponds to the I<dirfd> argument.
ru: В старых ядрах, где B<fchownat>() отсутствует, обёрточная функция glibc использует B<chown>() или B<lchown>(). Если I<pathname> является относительным путём, то glibc собирает путь относительно символической ссылки в I</proc/self/fd>, которая соответствует аргументу I<dirfd>.

source: The B<chown>() semantics are deliberately violated on NFS filesystems which have UID mapping enabled. Additionally, the semantics of all system calls which access the file contents are violated, because B<chown>() may cause immediate access revocation on already open files. Client side caching may lead to a delay between the time where ownership have been changed to allow access for a user and the time where the file can actually be accessed by the user on other clients.
ru: Семантика B<chown>() сознательно нарушается в файловых системах NFS, в которых включено отображение UID. Также, нарушается семантика всех системных вызовов, которые обеспечивают доступ к содержимому файлов, так как B<chown>() может привести к немедленному отзыву доступа к уже открытым файлам. Кэширование на клиентской стороне может привести к задержке между сменой доступа пользователю и временем, когда файл действительно станет доступным.

source: Historical details
ru: Историческая справка

source: The original Linux B<chown>(), B<fchown>(), and B<lchown>() system calls supported only 16-bit user and group IDs. Subsequently, Linux 2.4 added B<chown32>(), B<fchown32>(), and B<lchown32>(), supporting 32-bit IDs. The glibc B<chown>(), B<fchown>(), and B<lchown>() wrapper functions transparently deal with the variations across kernel versions.
ru: Первоначальные версии системных вызовов B<chown>(), B<fchown>() и B<lchown>() в Linux поддерживали только 16-битные идентификаторы пользователей и групп. Позднее в Linux 2.4 были добавлены вызовы B<chown32>(), B<fchown32>() и B<lchown32>(), поддерживающие 32-битные идентификаторы. В glibc обёрточные функции B<chown>(), B<fchown>() и B<lchown>() работают одинаково вне зависимости от версий ядра.

source: In versions of Linux prior to 2.1.81 (and distinct from 2.1.46), B<chown>() did not follow symbolic links. Since Linux 2.1.81, B<chown>() does follow symbolic links, and there is a new system call B<lchown>() that does not follow symbolic links. Since Linux 2.1.86, this new call (that has the same semantics as the old B<chown>()) has got the same syscall number, and B<chown>() got the newly introduced number.
ru: В версиях Linux до 2.1.81 (кроме 2.1.46) B<chown>() не следовал по символьным ссылкам. Начиная с версии Linux 2.1.81 B<chown>() следует по символьным ссылкам, и существует новый системный вызов B<lchown>(), который не следует по символьным ссылкам. Начиная с Linux 2.1.86 этот новый вызов (имеющий тот же смысл, что и старый B<chown>()) имеет тот же самый номер системного вызова, а B<chown>() получил новый номер.

source: The following program changes the ownership of the file named in its second command-line argument to the value specified in its first command-line argument. The new owner can be specified either as a numeric user ID, or as a username (which is converted to a user ID by using B<getpwnam>(3) to perform a lookup in the system password file).
ru: Следующая программа изменять владельца файла, указанного вторым в командной строке, на значение, указанное в первом аргументе командной строки. Новый владелец может задаваться в виде числового пользовательского ID, или в виде имени пользователя (которое преобразуется в пользовательский ID с помощью B<getpwnam>(3), выполняющего поиск в системном файле паролей).

source: connect - initiate a connection on a socket
ru: connect - инициирует соединение на сокете

source: B<#include E<lt>sys/types.hE<gt>> /* See NOTES */
ru: B<#include E<lt>sys/types.hE<gt>> /* Смотрите ЗАМЕЧАНИЯ */

source: The B<connect>() system call connects the socket referred to by the file descriptor I<sockfd> to the address specified by I<addr>. The I<addrlen> argument specifies the size of I<addr>. The format of the address in I<addr> is determined by the address space of the socket I<sockfd>; see B<socket>(2) for further details.
ru: Системный вызов B<connect>() устанавливает соединение с сокетом, заданным файловый дескриптором I<sockfd>, ссылающимся на адрес I<addr>. Аргумент I<addrlen> определяет размер I<addr>. Формат адреса в I<addr> определяется адресным пространством сокета I<sockfd>; подробнее можно узнать в B<socket>(2).

source: If the socket I<sockfd> is of type B<SOCK_DGRAM>, then I<addr> is the address to which datagrams are sent by default, and the only address from which datagrams are received. If the socket is of type B<SOCK_STREAM> or B<SOCK_SEQPACKET>, this call attempts to make a connection to the socket that is bound to the address specified by I<addr>.
ru: Если сокет I<sockfd> имеет тип B<SOCK_DGRAM>, то адрес I<addr> является адресом по умолчанию, куда посылаются датаграммы, и единственным адресом, откуда они принимаются. Если сокет имеет тип B<SOCK_STREAM> или B<SOCK_SEQPACKET>, то данный системный вызов попытается установить соединение с другим сокетом, заданным параметром I<addr>.

source: Generally, connection-based protocol sockets may successfully B<connect>() only once; connectionless protocol sockets may use B<connect>() multiple times to change their association. Connectionless sockets may dissolve the association by connecting to an address with the I<sa_family> member of I<sockaddr> set to B<AF_UNSPEC> (supported on Linux since kernel 2.2).
ru: Обычно сокеты с протоколами, основанными на соединении, могут устанавливать соединение B<connect>() только один раз; сокеты с протоколами без установления соединения могут использовать B<connect>() многократно, чтобы изменить адрес назначения. Сокеты без установления соединения могут прекратить связь с другим сокетом, установив член I<sa_family> структуры I<sockaddr> в B<AF_UNSPEC> (в Linux поддерживается, начиная с ядра версии 2.2).

source: If the connection or binding succeeds, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
ru: Если соединение или привязка прошла успешно, возвращается ноль. При ошибке возвращается -1, а I<errno> устанавливается должным образом.

source: The following are general socket errors only. There may be other domain-specific error codes.
ru: Ниже приведены только общие ошибки сокетов. Могут также появляться коды ошибок, существующие в конкретном домене.

source: For UNIX domain sockets, which are identified by pathname: Write permission is denied on the socket file, or search permission is denied for one of the directories in the path prefix. (See also B<path_resolution>(7).)
ru: Для доменных сокетов UNIX, которые идентифицируются по имени пути: нет прав на запись в файл сокета, или в одном из каталогов пути запрещён поиск. (См. также B<path_resolution>(7).)

source: The user tried to connect to a broadcast address without having the socket broadcast flag enabled or the connection request failed because of a local firewall rule.
ru: Пользователь попытался соединиться с широковещательным адресом, не установив широковещательный флаг на сокете или же запрос на соединение завершился неудачно из-за правила локального межсетевого экрана.

source: Local address is already in use.
ru: Локальный адрес уже используется.

source: (Internet domain sockets) The socket referred to by I<sockfd> had not previously been bound to an address and, upon attempting to bind it to an ephemeral port, it was determined that all port numbers in the ephemeral port range are currently in use. See the discussion of I</proc/sys/net/ipv4/ip_local_port_range> in B<ip>(7).
ru: (доменные сокеты Интернета) Сокет, указанный I<sockfd>, ранее не был привязан к адресу и при попытке привязать его к эфемеридному порту, было определено, что все номера в диапазоне эфемеридных портов уже используются. Смотрите обсуждение I</proc/sys/net/ipv4/ip_local_port_range> в B<ip>(7).

source: The passed address didn't have the correct address family in its I<sa_family> field.
ru: Адрес имеет некорректное семейство адресов в поле I<sa_family>.

source: For nonblocking UNIX domain sockets, the socket is nonblocking, and the connection cannot be completed immediately. For other socket families, there are insufficient entries in the routing cache.
ru: Для неблокирующих доменных сокетов UNIX сокет не блокируется и соединение не может быть выполнено немедленно. Для других семейств сокетов в кэше маршрутизации недостаточно элементов.

source: The socket is nonblocking and a previous connection attempt has not yet been completed.
ru: Сокет является неблокирующим, а предыдущая попытка установить соединение ещё не завершилась.

source: I<sockfd> is not a valid open file descriptor.
ru: Значение I<sockfd> не является правильным открытым файловым дескриптором.

source: A B<connect>() on a stream socket found no one listening on the remote address.
ru: Вызов B<connect>() не нашёл слушающий удалённый адрес для потокового сокета.

source: The socket structure address is outside the user's address space.
ru: Адрес структуры сокета находится за пределами пользовательского адресного пространства.
