Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Linux Programmer's Manual
ru: Руководство программиста Linux

source: NAME
ru: ИМЯ

source: cciss - HP Smart Array block driver
ru: cciss - блочный драйвер устройства HP Smart Array

source: SYNOPSIS
ru: ОБЗОР

source: DESCRIPTION
ru: ОПИСАНИЕ

source: B<Note>: This obsolete driver was removed from the kernel in version 4.14, as it is superseded by the B<hpsa>(4) driver in newer kernels.
ru: B<Замечание>: Данный устаревший драйвер был удалён из ядра версии 4.14; в новых ядрах его заменяет B<hpsa>(4).

source: B<cciss> is a block driver for older HP Smart Array RAID controllers.
ru: B<cciss> — это блочный драйвер для старых контроллеров RAID HP Smart Array.

source: Options
ru: Параметры

source: I<cciss_allow_hpsa=1>: This option prevents the B<cciss> driver from attempting to drive any controllers that the B<hpsa>(4) driver is capable of controlling, which is to say, the B<cciss> driver is restricted by this option to the following controllers:
ru: I<cciss_allow_hpsa=1>: этот параметр запрещает драйверу B<cciss> пробовать управлять контроллерами, которыми может управлять драйвер B<hpsa>(4). Другими словами, этим параметром драйвер B<cciss> будет ограничен следующими контроллерами:

source: Supported hardware
ru: Поддерживаемое оборудование

source: The B<cciss> driver supports the following Smart Array boards:
ru: Драйвер B<cciss> поддерживает следующие платы Smart Array:

source: Configuration details
ru: Особенности настройки

source: To configure HP Smart Array controllers, use the HP Array Configuration Utility (either B<hpacuxe>(8) or B<hpacucli>(8)) or the Offline ROM-based Configuration Utility (ORCA) run from the Smart Array's option ROM at boot time.
ru: Для настройки контроллеров HP Smart Array используйте HP Array Configuration Utility (B<hpacuxe>(8) или B<hpacucli>(8)) или Offline ROM-based Configuration Utility (ORCA), которую можно запустить из ROM Smart Array при включении машины.

source: FILES
ru: ФАЙЛЫ

source: Device nodes
ru: Узлы устройства

source: The device naming scheme is as follows:
ru: Ниже приведена схема именования устройств:

source: Major numbers:
ru: Старшие номера:

source: Minor numbers:
ru: Младшие номера:

source: b7 b6 b5 b4 b3 b2 b1 b0 |----+----| |----+----| | | | +-------- Partition ID (0=wholedev, 1-15 partition) | +-------------------- Logical Volume number
ru: b7 b6 b5 b4 b3 b2 b1 b0 |----+----| |----+----| | | | +-------- Идентификатор раздела (0=всё устройство, 1-15 раздел) | +-------------------- Номер логического тома

source: The device naming scheme is:
ru: Порядок именования устройств:

source: /dev/cciss/c0d0 Controller 0, disk 0, whole device /dev/cciss/c0d0p1 Controller 0, disk 0, partition 1 /dev/cciss/c0d0p2 Controller 0, disk 0, partition 2 /dev/cciss/c0d0p3 Controller 0, disk 0, partition 3
ru: /dev/cciss/c0d0 Контроллер 0, диск 0, устройство целиком /dev/cciss/c0d0p1 Контроллер 0, диск 0, раздел 1 /dev/cciss/c0d0p2 Контроллер 0, диск 0, раздел 2 /dev/cciss/c0d0p3 Контроллер 0, диск 0, раздел 3

source: /dev/cciss/c1d1 Controller 1, disk 1, whole device /dev/cciss/c1d1p1 Controller 1, disk 1, partition 1 /dev/cciss/c1d1p2 Controller 1, disk 1, partition 2 /dev/cciss/c1d1p3 Controller 1, disk 1, partition 3
ru: /dev/cciss/c1d1 Контроллер 1, диск 1, устройство целиком /dev/cciss/c1d1p1 Контроллер 1, диск 1, раздел 1 /dev/cciss/c1d1p2 Контроллер 1, диск 1, раздел 2 /dev/cciss/c1d1p3 Контроллер 1, диск 1, раздел 3

source: Files in /proc
ru: Файлы в /proc

source: The files I</proc/driver/cciss/cciss[0-9]+> contain information about the configuration of each controller. For example:
ru: В файлах I</proc/driver/cciss/cciss[0-9]+> содержится информация о настройке каждого контроллера. Пример:

source: Files in /sys
ru: Файлы в /sys

source: Displays the SCSI INQUIRY page 0 model for logical drive I<Y> of controller I<X>.
ru: Модель логического устройства I<Y> контроллера I<X> со страницы 0 SCSI INQUIRY.

source: Displays the SCSI INQUIRY page 0 revision for logical drive I<Y> of controller I<X>.
ru: Версия логического устройства I<Y> контроллера I<X> со страницы 0 SCSI INQUIRY.

source: Displays the SCSI INQUIRY page 83 serial number for logical drive I<Y> of controller I<X>.
ru: Серийный номер логического устройства I<Y> контроллера I<X> со страницы 83 SCSI INQUIRY.

source: Displays the SCSI INQUIRY page 0 vendor for logical drive I<Y> of controller I<X>.
ru: Производитель логического устройства I<Y> контроллера I<X> со страницы 0 SCSI INQUIRY.

source: A symbolic link to I</sys/block/cciss!cXdY>.
ru: Символьная ссылка на I</sys/block/cciss!cXdY>.

source: When this file is written to, the driver rescans the controller to discover any new, removed, or modified logical drives.
ru: При записи в этот файл драйвер повторно сканирует контроллер для обнаружения новых, удалённых или изменённых логических дисков.

source: A value of 1 displayed in this file indicates that the "reset_devices=1" kernel parameter (used by B<kdump>) is honored by this controller. A value of 0 indicates that the "reset_devices=1" kernel parameter will not be honored. Some models of Smart Array are not able to honor this parameter.
ru: Значение 1 в файле показывает, что параметр ядра «reset_devices=1» (используемый B<kdump>) был принят данным контроллером. Значение 0 показывает, что параметр ядра «reset_devices=1» принят не был. Некоторые модели Smart Array не способны принять этот параметр.

source: Displays the 8-byte LUN ID used to address logical drive I<Y> of controller I<X>.
ru: 8-байтовый LUN ID, используемый для адресации логического устройства I<Y> контроллера I<X>.

source: Displays the RAID level of logical drive I<Y> of controller I<X>.
ru: Уровень RAID логического устройства I<Y> контроллера I<X>.

source: Displays the usage count (number of opens) of logical drive I<Y> of controller I<X>.
ru: Счётчик использования (число открытий) логического устройства I<Y> контроллера I<X>.

source: SCSI tape drive and medium changer support
ru: Поддержка ленточных устройств SCSI и устройств смены носителя

source: SCSI sequential access devices and medium changer devices are supported and appropriate device nodes are automatically created (e.g., I</dev/st0>, I</dev/st1>, etc.; see B<st>(4) for more details.) You must enable "SCSI tape drive support for Smart Array 5xxx" and "SCSI support" in your kernel configuration to be able to use SCSI tape drives with your Smart Array 5xxx controller.
ru: Драйвер поддерживает устройства SCSI с последовательным доступом и смены носителя, и автоматически создаёт соответствующие узлы устройств (например, I</dev/st0>, I</dev/st1> и т. д.; подробней смотрите в B<st>(4)). Чтобы использовать ленточные устройства SCSI с контроллером Smart Array 5xxx в настройках ядра нужно включить «SCSI tape drive support for Smart Array 5xxx» и «SCSI support».

source: Additionally, note that the driver will not engage the SCSI core at init time. The driver must be directed to dynamically engage the SCSI core via the I</proc> filesystem entry, which the "block" side of the driver creates as I</proc/driver/cciss/cciss*> at run time. This is because at driver init time, the SCSI core may not yet be initialized (because the driver is a block driver) and attempting to register it with the SCSI core in such a case would cause a hang. This is best done via an initialization script (typically in I</etc/init.d>, but could vary depending on distribution). For example:
ru: Также заметим, что драйвер не привлекает ядро SCSI во время инициализации. Драйвер должен динамически задействовать ядро SCSI через запись в файловой системе I</proc>, которую (I</proc/driver/cciss/cciss*>) «блочная» часть драйвера создаёт во время работы. Так сделано потому, что на момент инициализации драйвера ядро SCSI ещё может быть не инициализировано (так как драйвер — блочный) и попытка зарегистрировать его в ядре SCSI в этом случае вызывала бы зависание. Это лучше всего выполнять из сценария инициализации (обычно, в I</etc/init.d>, но в разных дистрибутивах по-разному). Пример:

source: Once the SCSI core is engaged by the driver, it cannot be disengaged (except by unloading the driver, if it happens to be linked as a module.)
ru: После того, как драйвер подключил ядро SCSI, он не может быть выключен (за исключением выгрузки драйвера, если он собран в виде модуля).

source: Note also that if no sequential access devices or medium changers are detected, the SCSI core will not be engaged by the action of the above script.
ru: Также заметим, что если устройства с последовательным доступом или смены носителя не обнаружены, то ядро SCSI не привлекается из показанного выше сценария.

source: Hot plug support for SCSI tape drives
ru: Ленточные устройства SCSI, подключаемые во время работы (hot plug)

source: Hot plugging of SCSI tape drives is supported, with some caveats. The B<cciss> driver must be informed that changes to the SCSI bus have been made. This may be done via the I</proc> filesystem. For example:
ru: Поддерживается подключение ленточных устройств SCSI без выключения машины. Драйвер B<cciss> должен быть уведомлён об изменениях на шине SCSI. Это можно сделать через файловую систему I</proc>. Пример:

source: This causes the driver to:
ru: Это заставляет драйвер:

source: query the adapter about changes to the physical SCSI buses and/or fibre channel arbitrated loop, and
ru: Опросить адаптер об изменениях на физических шинах SCSI и/или управляемой петли (arbitrated loop) fibre channel;

source: make note of any new or removed sequential access devices or medium changers.
ru: Определить все новые или удалённые устройства с последовательным доступом или смены носителя;

source: The driver will output messages indicating which devices have been added or removed and the controller, bus, target, and lun used to address each device. The driver then notifies the SCSI midlayer of these changes.
ru: Драйвер выводит сообщения о добавленных или удалённых устройствах, а также контроллер, шину, назначение и lun каждого используемого устройства. Также, драйвер уведомляет промежуточный слой SCSI об этих изменениях.

source: Note that the naming convention of the I</proc> filesystem entries contains a number in addition to the driver name (e.g., "cciss0" instead of just "cciss", which you might expect).
ru: Заметим, что по соглашению об именовании кроме имени драйвера, записи файловой системы I</proc> содержат номер (например, «cciss0» вместо «cciss», как вы могли бы ожидать).

source: Note: I<Only> sequential access devices and medium changers are presented as SCSI devices to the SCSI midlayer by the B<cciss> driver. Specifically, physical SCSI disk drives are I<not> presented to the SCSI midlayer. The only disk devices that are presented to the kernel are logical drives that the array controller constructs from regions on the physical drives. The logical drives are presented to the block layer (not to the SCSI midlayer). It is important for the driver to prevent the kernel from accessing the physical drives directly, since these drives are used by the array controller to construct the logical drives.
ru: Замечание: драйвер B<cciss> на промежуточном слое SCSI представляет в виде устройств SCSI I<только> устройства с последовательным доступом и смены носителя. Устройства для физических дисков SCSI I<не> представляются на промежуточном слое SCSI. Дисковые устройства представляются ядром как логические устройства, который контроллер массива собрал из частей физических дисков. Логические устройства представляются на блочном уровне (не на промежуточном слое SCSI). Это важно для драйвера — не дать прямой доступ ядру к физическим дискам, так как устройства используются контроллером массива для сборки логических устройств.

source: SCSI error handling for tape drives and medium changers
ru: Обработка ошибок SCSI для ленточных устройств и устройств смены носителя

source: The Linux SCSI midlayer provides an error-handling protocol that is initiated whenever a SCSI command fails to complete within a certain amount of time (which can vary depending on the command). The B<cciss> driver participates in this protocol to some extent. The normal protocol is a four-step process:
ru: Промежуточный слой Linux SCSI предоставляет порядок (protocol) обработки ошибок, который запускается, если команда SCSI выполнилась с ошибкой определённое количество раз (которое может зависеть от команды). Драйвер B<cciss> следует этому порядку с некоторыми изменениями. Обычный порядок состоит из четырёх шагов:

source: First, the device is told to abort the command.
ru: Устройству указывается прервать работу команды.

source: If that doesn't work, the device is reset.
ru: Если это не сработало, устройство сбрасывается (reset).

source: If that doesn't work, the SCSI bus is reset.
ru: Если это не сработало, сбрасывается шина SCSI.

source: If that doesn't work, the host bus adapter is reset.
ru: Если это не сработало, сбрасывается адаптер шины узла.

source: The B<cciss> driver is a block driver as well as a SCSI driver and only the tape drives and medium changers are presented to the SCSI midlayer. Furthermore, unlike more straightforward SCSI drivers, disk I/O continues through the block side during the SCSI error-recovery process. Therefore, the B<cciss> driver implements only the first two of these actions, aborting the command, and resetting the device. Note also that most tape drives will not oblige in aborting commands, and sometimes it appears they will not even obey a reset command, though in most circumstances they will. If the command cannot be aborted and the device cannot be reset, the device will be set offline.
ru: Как драйвер SCSI, B<cciss> является блочным и только ленточные устройства и устройства смены носителя представлены на промежуточном уровне SCSI. Кроме этого, в отличие от более простых драйверов SCSI, дисковый ввод-вывод продолжается через блочную часть во время процесса восстановления после ошибки SCSI. Поэтому драйвер B<cciss> выполняет только первые два шага: прерывание команды и сброс устройства. Также заметим, что большинству ленточных устройств не поможет прерывание команды и, иногда, они даже не подчиняются этой команде, хотя очень редко. Если команда не может быть прервана и устройство не может быть сброшено, то устройство переводится в неактивный режим (offline).

source: In the event that the error-handling code is triggered and a tape drive is successfully reset or the tardy command is successfully aborted, the tape drive may still not allow I/O to continue until some command is issued that positions the tape to a known position. Typically you must rewind the tape (by issuing I<mt -f /dev/st0 rewind> for example) before I/O can proceed again to a tape drive that was reset.
ru: Если событие обработки ошибок возникло и ленточное устройство успешно сброшено или последняя команда успешно прервана, то ленточное устройств может всё ещё продолжать не позволять выполнять ввод-вывод, пока какая-нибудь команда не поместит ленточное устройство в известное положение. Как правило, вы должны перемотать ленту (например, командной I<mt -f /dev/st0 rewind>) перед тем как продолжить ввод-вывод снова в ленточное устройство, которое было сброшено.

source: SEE ALSO
ru: СМОТРИТЕ ТАКЖЕ

source: E<.UR http://cciss.sf.net> E<.UE ,> and I<Documentation/blockdev/cciss.txt> and I<Documentation/ABI/testing/sysfs-bus-pci-devices-cciss> in the Linux kernel source tree
ru: E<.UR http://cciss.sf.net> E<.UE ,> I<Documentation/blockdev/cciss.txt> и файл I<Documentation/ABI/testing/sysfs-bus-pci-devices-cciss> в дереве исходного кода ядра Linux

source: cpuid - x86 CPUID access device
ru: cpuid - устройство доступа к CPUID в процессорах x86

source: CPUID provides an interface for querying information about the x86 CPU.
ru: CPUID предоставляет интерфейс для получения информации о процессоре x86.

source: This device is accessed by B<lseek>(2) or B<pread>(2) to the appropriate CPUID level and reading in chunks of 16 bytes. A larger read size means multiple reads of consecutive levels.
ru: Для перехода на нужный уровень CPUID достаточно выполнить на устройстве B<lseek>(2) или B<pread>(2); чтение происходит порциями по 16 байт. Для получения большего количества данных нужно повторить операцию чтения на последующих уровнях.

source: The lower 32 bits of the file position is used as the incoming I<%eax>, and the upper 32 bits of the file position as the incoming I<%ecx>, the latter intended for "counting" I<eax> levels like I<eax=4>.
ru: Младшие 32 бита позиции файла используются как входящее значение для регистра I<%eax>, а старшие 32 бита как входящее значение для I<%ecx>, последнее предназначено для "подсчёта" уровней I<eax>, например I<eax=4>.

source: This driver uses I</dev/cpu/CPUNUM/cpuid>, where I<CPUNUM> is the minor number, and on an SMP box will direct the access to CPU I<CPUNUM> as listed in I</proc/cpuinfo>.
ru: Этот драйвер использует устройства I</dev/cpu/CPUNUM/cpuid>, где I<CPUNUM> указывает на младший номер, а в многопроцессорных машинах I<CPUNUM> указывает на номер процессора, которые перечислены в I</proc/cpuinfo>.

source: This file is protected so that it can be read only by the user I<root>, or members of the group I<root>.
ru: Файл доступен на чтение только пользователю I<root> или членам группы I<root>.

source: NOTES
ru: ЗАМЕЧАНИЯ

source: The CPUID instruction can be directly executed by a program using inline assembler. However this device allows convenient access to all CPUs without changing process affinity.
ru: Инструкция CPUID может непосредственно выполняться программой с помощью встроенных в языки ассемблерных вставок. Однако это устройство предоставляет удобный доступ ко всем процессорам без изменения в программе.

source: Most of the information in I<cpuid> is reported by the kernel in cooked form either in I</proc/cpuinfo> or through subdirectories in I</sys/devices/system/cpu>. Direct CPUID access through this device should only be used in exceptional cases.
ru: Большинство информации I<cpuid> можно получить в готовом виде из файла I</proc/cpuinfo> или подкаталогов I</sys/devices/system/cpu>. Непосредственное использование CPUID через это устройство нужно использовать только в специальных случаях.

source: The I<cpuid> driver is not auto-loaded. On modular kernels you might need to use the following command to load it explicitly before use:
ru: Драйвер I<cpuid> автоматически не загружается. Если ядро модульное, то нужно выполнять загрузку явно:

source: There is no support for CPUID functions that require additional input registers.
ru: Функции CPUID с дополнительными входными регистра не поддерживаются.

source: Very old x86 CPUs don't support CPUID.
ru: Очень старые процессоры x86 не поддерживают CPUID.

source: console_codes - Linux console escape and control sequences
ru: console_codes - управляющие и экранирующие последовательности консоли Linux

source: The Linux console implements a large subset of the VT102 and ECMA-48/ISO 6429/ANSI X3.64 terminal controls, plus certain private-mode sequences for changing the color palette, character-set mapping, and so on. In the tabular descriptions below, the second column gives ECMA-48 or DEC mnemonics (the latter if prefixed with DEC) for the given function. Sequences without a mnemonic are neither ECMA-48 nor VT102.
ru: Консоль Linux имеет большой набор средств управления терминалами VT102 и ECMA-48/ISO 6429/ANSI X364, а также некоторым количеством индивидуальных последовательностей для изменения цветовой палитры, перекодировки символьного набора и т. д. В таблицах, приведенных ниже (во втором столбце), указывается мнемонический код ECMA-48 или DEC (если последнее приписано к DEC) данной функции. Последовательности без мнемонического кода не принадлежат ни к ECMA-48, ни к VT102.

source: After all the normal output processing has been done, and a stream of characters arrives at the console driver for actual printing, the first thing that happens is a translation from the code used for processing to the code used for printing.
ru: Первым процессом, который выполняется после работы обычного процесса по выводу информации и отправки к драйверу потока символов консоли (для их реального вывода), является перевод кодов, используемых при обычной работе, в коды, применяемые для печати.

source: If the console is in UTF-8 mode, then the incoming bytes are first assembled into 16-bit Unicode codes. Otherwise, each byte is transformed according to the current mapping table (which translates it to a Unicode value). See the B<Character Sets> section below for discussion.
ru: Если консоль работает в режиме UTF-8, то входящие байты сначала организуются в 16-битовый Юникод. В ином случае каждый байт преобразуется согласно текущей таблице перекодировки (которая переводит данные в Юникод). Смотри раздел B<Наборы символов> ниже).

source: In the normal case, the Unicode value is converted to a font index, and this is stored in video memory, so that the corresponding glyph (as found in video ROM) appears on the screen. Note that the use of Unicode (and the design of the PC hardware) allows us to use 512 different glyphs simultaneously.
ru: Обычно значения Юникода преобразуются в индекс шрифта, который хранится в видеопамяти таким образом, что соответствующий образ (обнаруженный в видео-ПЗУ) появляется на экране. Заметим, что работа с Юникодом (и текущими аппаратными средствами компьютеров) позволяет одновременно использовать только 512 различных образов.

source: If the current Unicode value is a control character, or we are currently processing an escape sequence, the value will treated specially. Instead of being turned into a font index and rendered as a glyph, it may trigger cursor movement or other control functions. See the B<Linux Console Controls> section below for discussion.
ru: Если текущим значением Юникода является управляющий символ или если в данный момент обрабатывается экранирующая последовательность, значение будет обрабатываться особым образом. Вместо того, чтобы значение было преобразовало в шрифт и отобразилось как образ, оно приведёт к выполнению определённого действия (например, перемещение курсора) или другой функции управления. Смотрите ниже раздел B<Управление консолью Linux>.

source: It is generally not good practice to hard-wire terminal controls into programs. Linux supports a B<terminfo>(5) database of terminal capabilities. Rather than emitting console escape sequences by hand, you will almost always want to use a terminfo-aware screen library or utility such as B<ncurses>(3), B<tput>(1), or B<reset>(1).
ru: Некорректно явно указывать в программах аппаратные последовательности управление терминалом. Linux поддерживает работу с базой возможностей терминала B<terminfo>(5). Вместо того, чтобы вводить управляющие последовательности вручную, вы, наверняка, захотите использовать для этой работы библиотеку, использующую terminfo, или другие утилиты, такие как B<ncurses>(3), B<tput>(1) или B<reset>(1).

source: Linux console controls
ru: Управление консолью Linux

source: This section describes all the control characters and escape sequences that invoke special functions (i.e., anything other than writing a glyph at the current cursor location) on the Linux console.
ru: Этот раздел описывает все управляющие символы и экранирущие последовательности, которые выполняют специальные команды (т.е., всё, что отличается от простого вывода символа в текущую позицию курсора) консоли Linux.

source: B<Control characters>
ru: B<Управляющие символы>
