Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: bind to any address for transparent proxying;
ru: привязываться к любому адресу для прозрачного проксирования;

source: set type-of-service (TOS)
ru: назначать тип сервиса (TOS)

source: clear driver statistics;
ru: очищать статистику драйвера;

source: set promiscuous mode;
ru: включать режим захвата (promiscuous);

source: enabling multicasting;
ru: включать многоадресные рассылки (multicasting);

source: use B<setsockopt>(2) to set the following socket options: B<SO_DEBUG>, B<SO_MARK>, B<SO_PRIORITY> (for a priority outside the range 0 to 6), B<SO_RCVBUFFORCE>, and B<SO_SNDBUFFORCE>.
ru: использовать B<setsockopt>(2) для включения следующих параметров сокета: B<SO_DEBUG>, B<SO_MARK>, B<SO_PRIORITY> (для приоритетов вне диапазона 0 - 6), B<SO_RCVBUFFORCE> и B<SO_SNDBUFFORCE>.

source: Bind a socket to Internet domain privileged ports (port numbers less than 1024).
ru: Позволяет привязывать сокет к привилегированным портам домена интернета (номера портов меньше 1024).

source: (Unused) Make socket broadcasts, and listen to multicasts.
ru: (не используется) Позволяет осуществлять широковещание с сокета и прослушивание многоадресных рассылок.

source: Use RAW and PACKET sockets;
ru: Позволяет использовать сокеты RAW и PACKET;

source: bind to any address for transparent proxying.
ru: позволяет привязываться к любому адресу для прозрачного проксирования.

source: Make arbitrary manipulations of process GIDs and supplementary GID list;
ru: Позволяет выполнять произвольные действия с GID процесса и списком дополнительных GID;

source: forge GID when passing socket credentials via UNIX domain sockets;
ru: Позволяет подделывать GID при передаче мандатов сокета через доменные сокеты UNIX;

source: write a group ID mapping in a user namespace (see B<user_namespaces>(7)).
ru: Позволяет записывать отображение идентификатора группы в пользовательское пространство (смотрите B<user_namespaces>(7)).

source: B<CAP_SETFCAP> (since Linux 2.6.24)
ru: B<CAP_SETFCAP> (начиная с Linux 2.6.24)

source: Set arbitrary capabilities on a file.
ru: Устанавливает произвольные мандаты на файл.

source: If file capabilities are supported (i.e., since Linux 2.6.24): add any capability from the calling thread's bounding set to its inheritable set; drop capabilities from the bounding set (via B<prctl>(2) B<PR_CAPBSET_DROP>); make changes to the I<securebits> flags.
ru: Если файловые мандаты поддерживаются (т. е., начиная с Linux 2.6.24): позволяет добавлять любой мандат из ограничивающего набора вызывающей нити в её наследуемый набор; отзывать мандаты из ограничивающего набора (с помощью B<prctl>(2) с операцией B<PR_CAPBSET_DROP>); изменять флаги I<securebits>.

source: If file capabilities are not supported (i.e., kernels before Linux 2.6.24): grant or remove any capability in the caller's permitted capability set to or from any other process. (This property of B<CAP_SETPCAP> is not available when the kernel is configured to support file capabilities, since B<CAP_SETPCAP> has entirely different semantics for such kernels.)
ru: Если файловые мандаты не поддерживаются (т. е., до Linux 2.6.24): позволяет предоставлять и отзывать любой мандат в списке разрешённых мандатов вызывающего или любого другого процесса (это свойство B<CAP_SETPCAP> недоступно, если ядро собрано с поддержкой файловых мандатов, так как B<CAP_SETPCAP> имеет полностью другую семантику у таких ядер).

source: Make arbitrary manipulations of process UIDs (B<setuid>(2), B<setreuid>(2), B<setresuid>(2), B<setfsuid>(2));
ru: Позволяет выполнять произвольные действия с UID процесса (B<setuid>(2), B<setreuid>(2), B<setresuid>(2), B<setfsuid>(2));

source: forge UID when passing socket credentials via UNIX domain sockets;
ru: Позволяет подделывать UID при передаче мандатов сокета через доменные сокеты UNIX;

source: write a user ID mapping in a user namespace (see B<user_namespaces>(7)).
ru: Позволяет записывать отображение идентификатора пользователя в пользовательское пространство (смотрите B<user_namespaces>(7)).

source: I<Note>: this capability is overloaded; see I<Notes to kernel developers>, below.
ru: I<Замечание>: данный мандат перегружен; смотрите I<Замечания разработчикам ядра> ниже.

source: Perform a range of system administration operations including: B<quotactl>(2), B<mount>(2), B<umount>(2), B<pivot_root>(2), B<swapon>(2), B<swapoff>(2), B<sethostname>(2), and B<setdomainname>(2);
ru: Позволяет выполнять следующие задачи управления системой: B<quotactl>(2), B<mount>(2), B<umount>(2), B<pivot_root>(2), B<swapon>(2), B<swapoff>(2), B<sethostname>(2), and B<setdomainname>(2);

source: perform privileged B<syslog>(2) operations (since Linux 2.6.37, B<CAP_SYSLOG> should be used to permit such operations);
ru: Позволяет выполнять привилегированные операции B<syslog>(2) (начиная с Linux 2.6.37, для этих операций нужно использовать B<CAP_SYSLOG>);

source: perform B<VM86_REQUEST_IRQ> B<vm86>(2) command;
ru: Позволяет выполнять команду B<VM86_REQUEST_IRQ> B<vm86>(2);

source: perform B<IPC_SET> and B<IPC_RMID> operations on arbitrary System V IPC objects;
ru: Позволяет выполнять операции B<IPC_SET> и B<IPC_RMID> над произвольными объектами System V IPC;

source: override B<RLIMIT_NPROC> resource limit;
ru: Позволяет перезаписывать ограничение ресурса B<RLIMIT_NPROC>;

source: perform operations on I<trusted> and I<security> Extended Attributes (see B<xattr>(7));
ru: Позволяет выполнять операции над расширенными атрибутами I<trusted> и I<security> (смотрите B<xattr>(7));

source: use B<lookup_dcookie>(2);
ru: Позволяет использовать B<lookup_dcookie>(2);

source: use B<ioprio_set>(2) to assign B<IOPRIO_CLASS_RT> and (before Linux 2.6.25) B<IOPRIO_CLASS_IDLE> I/O scheduling classes;
ru: Позволяет использовать B<ioprio_set>(2) для назначения классов планирования ввода-вывода B<IOPRIO_CLASS_RT> и (до Linux 2.6.25) B<IOPRIO_CLASS_IDLE>;

source: forge PID when passing socket credentials via UNIX domain sockets;
ru: Позволяет подделывать PID при передаче мандатов сокета через доменные сокеты UNIX;

source: exceed I</proc/sys/fs/file-max>, the system-wide limit on the number of open files, in system calls that open files (e.g., B<accept>(2), B<execve>(2), B<open>(2), B<pipe>(2));
ru: Позволяет превышать I</proc/sys/fs/file-max>, системное ограничение на количество открытых файлов, в системных вызовах, открывающих файлы (например, B<accept>(2), B<execve>(2), B<open>(2), B<pipe>(2));

source: employ B<CLONE_*> flags that create new namespaces with B<clone>(2) and B<unshare>(2) (but, since Linux 3.8, creating user namespaces does not require any capability);
ru: Позволяет задействовать флаги B<CLONE_*>, которые создают новые пространства имён с помощью B<clone>(2) и B<unshare>(2)) (начиная с Linux 3.8 для создания пользовательских пространств имён больше никаких мандатов не требуется);

source: call B<perf_event_open>(2);
ru: Позволяет вызывать B<perf_event_open>(2);

source: access privileged I<perf> event information;
ru: Позволяет получать доступ к информации о привилегированном событии I<perf>;

source: call B<setns>(2) (requires B<CAP_SYS_ADMIN> in the I<target> namespace);
ru: Позволяет вызывать B<setns>(2) (требуется B<CAP_SYS_ADMIN> в пространстве имён I<назначения>);

source: call B<fanotify_init>(2);
ru: Позволяет вызывать B<fanotify_init>(2);

source: call B<bpf>(2);
ru: Позволяет вызывать B<bpf>(2);

source: perform privileged B<KEYCTL_CHOWN> and B<KEYCTL_SETPERM> B<keyctl>(2) operations;
ru: Позволяет выполнять привилегированные операции B<KEYCTL_CHOWN> и B<KEYCTL_SETPERM> в B<keyctl>(2);

source: perform B<madvise>(2) B<MADV_HWPOISON> operation;
ru: Позволяет выполнять операцию B<MADV_HWPOISON> в B<madvise>(2);

source: employ the B<TIOCSTI> B<ioctl>(2) to insert characters into the input queue of a terminal other than the caller's controlling terminal;
ru: Позволяет задействовать B<TIOCSTI> в B<ioctl>(2) для вставки символов во входную очередь терминала, отличного от управляющего терминала вызывающего;

source: employ the obsolete B<nfsservctl>(2) system call;
ru: Позволяет задействовать устаревший системный вызов B<nfsservctl>(2);

source: employ the obsolete B<bdflush>(2) system call;
ru: Позволяет задействовать устаревший системный вызов B<bdflush>(2);

source: perform various privileged block-device B<ioctl>(2) operations;
ru: Позволяет выполнять различные привилегированные операции B<ioctl>(2) над блочными устройствами;

source: perform various privileged filesystem B<ioctl>(2) operations;
ru: Позволяет выполнять различные привилегированные операции B<ioctl>(2) над файловой системой;

source: perform privileged B<ioctl>(2) operations on the I</dev/random> device (see B<random>(4));
ru: Позволяет выполнять привилегированные операции B<ioctl>(2) над устройством I</dev/random> (смотрите B<random>(4));

source: install a B<seccomp>(2) filter without first having to set the I<no_new_privs> thread attribute;
ru: Позволяет устанавливать фильтры B<seccomp>(2) без начальной установки атрибута нити I<no_new_privs>;

source: modify allow/deny rules for device control groups;
ru: Позволяет изменять правила разрешения/запрета для групп управления устройствами;

source: employ the B<ptrace>(2) B<PTRACE_SECCOMP_GET_FILTER> operation to dump tracee's seccomp filters;
ru: Позволяет задействовать операцию B<ptrace>(2) B<PTRACE_SECCOMP_GET_FILTER> для получения дампа фильтров seccomp трассируемого;

source: employ the B<ptrace>(2) B<PTRACE_SETOPTIONS> operation to suspend the tracee's seccomp protections (i.e., the B<PTRACE_O_SUSPEND_SECCOMP> flag);
ru: Позволяет задействовать операцию B<ptrace>(2) B<PTRACE_SETOPTIONS> для приостановки защиты seccomp трассируемого (т. е., флаг B<PTRACE_O_SUSPEND_SECCOMP>);

source: perform administrative operations on many device drivers.
ru: Позволяет выполнять административные операции над многими драйверами устройств.

source: Modify autogroup nice values by writing to I</proc/[pid]/autogroup> (see B<sched>(7)).
ru: Позволяет изменять значения уступчивости автогруппы, посредством записи в I</proc/[pid]/autogroup> (смотрите B<sched>(7)).

source: Use B<reboot>(2) and B<kexec_load>(2).
ru: Позволяет использовать B<reboot>(2) и B<kexec_load>(2).

source: Use B<chroot>(2);
ru: Позволяет использовать B<chroot>(2);

source: change mount namespaces using B<setns>(2).
ru: Позволяет изменять пространство имён монтирования с помощью B<setns>(2).

source: Load and unload kernel modules (see B<init_module>(2) and B<delete_module>(2));
ru: Позволяет загружать и выгружать модули ядра (смотрите B<init_module>(2) и B<delete_module>(2));

source: in kernels before 2.6.25: drop capabilities from the system-wide capability bounding set.
ru: В ядрах до версии 2.6.25: позволяет отзывать мандаты из системного ограничивающего набора мандатов.

source: Raise process nice value (B<nice>(2), B<setpriority>(2)) and change the nice value for arbitrary processes;
ru: Позволяет повышать значение уступчивости процесса (B<nice>(2), B<setpriority>(2)) и изменять значение уступчивости у произвольных процессов;

source: set real-time scheduling policies for calling process, and set scheduling policies and priorities for arbitrary processes (B<sched_setscheduler>(2), B<sched_setparam>(2), B<sched_setattr>(2));
ru: Позволяет назначать политики планирования реального времени для вызывающего процесса и назначать политики планирования и приоритеты для произвольных процессов (B<sched_setscheduler>(2), B<sched_setparam>(2), B<sched_setattr>(2));

source: set CPU affinity for arbitrary processes (B<sched_setaffinity>(2));
ru: Позволяет выполнять привязку к ЦП для произвольных процессов (B<sched_setaffinity>(2));

source: set I/O scheduling class and priority for arbitrary processes (B<ioprio_set>(2));
ru: Позволяет назначать класс планирования ввода-вывода и приоритет для произвольных процессов (B<ioprio_set>(2));

source: apply B<migrate_pages>(2) to arbitrary processes and allow processes to be migrated to arbitrary nodes;
ru: Позволяет применять B<migrate_pages>(2) к произвольным процессам для их перемещения на произвольные узлы;

source: apply B<move_pages>(2) to arbitrary processes;
ru: Позволяет применять B<move_pages>(2) к произвольным процессам;

source: use the B<MPOL_MF_MOVE_ALL> flag with B<mbind>(2) and B<move_pages>(2).
ru: Позволяет использовать флаг B<MPOL_MF_MOVE_ALL> в B<mbind>(2) и B<move_pages>(2).

source: Use B<acct>(2).
ru: Позволяет использовать B<acct>(2).

source: Trace arbitrary processes using B<ptrace>(2);
ru: Позволяет трассировать любой процесс с помощью B<ptrace>(2);

source: apply B<get_robust_list>(2) to arbitrary processes;
ru: Позволяет применять B<get_robust_list>(2) к произвольным процессам;

source: transfer data to or from the memory of arbitrary processes using B<process_vm_readv>(2) and B<process_vm_writev>(2);
ru: Позволяет перемещать данные в/из памяти произвольного процесса с помощью B<process_vm_readv>(2) и B<process_vm_writev>(2);

source: inspect processes using B<kcmp>(2).
ru: Позволяет изучать процессы с помощью B<kcmp>(2).

source: Perform I/O port operations (B<iopl>(2) and B<ioperm>(2));
ru: Позволяет выполнять операции ввода-вывода из портов (B<iopl>(2) и B<ioperm>(2));

source: access I</proc/kcore>;
ru: Разрешает доступ к I</proc/kcore>;

source: employ the B<FIBMAP> B<ioctl>(2) operation;
ru: Позволяет задействовать операцию B<FIBMAP> в B<ioctl>(2);

source: open devices for accessing x86 model-specific registers (MSRs, see B<msr>(4));
ru: Позволяет открывать устройства для доступа к специальным регистрам x86 (MSR, смотрите B<msr>(4));

source: update I</proc/sys/vm/mmap_min_addr>;
ru: Позволяет обновлять I</proc/sys/vm/mmap_min_addr>;

source: create memory mappings at addresses below the value specified by I</proc/sys/vm/mmap_min_addr>;
ru: Позволяет создавать отображения памяти по адресам меньше значения, заданного в I</proc/sys/vm/mmap_min_addr>;

source: map files in I</proc/bus/pci>;
ru: Позволяет отображать файлы в I</proc/bus/pci>;

source: open I</dev/mem> and I</dev/kmem>;
ru: Позволяет открывать I</dev/mem> и I</dev/kmem>;

source: perform various SCSI device commands;
ru: Позволяет выполнять различные команды устройств SCSI;

source: perform certain operations on B<hpsa>(4) and B<cciss>(4) devices;
ru: Позволяет выполнять определённые операции с устройствами B<hpsa>(4) и B<cciss>(4);

source: perform a range of device-specific operations on other devices.
ru: Позволяет выполнять некоторые специальные операции с другими устройствами.

source: Use reserved space on ext2 filesystems;
ru: Позволяет использовать зарезервированное пространство файловых систем ext2;

source: make B<ioctl>(2) calls controlling ext3 journaling;
ru: Позволяет делать вызовы B<ioctl>(2), управляющие журналированием ext3;

source: override disk quota limits;
ru: Позволяет превышать ограничение дисковой квоты;

source: increase resource limits (see B<setrlimit>(2));
ru: Позволяет увеличивать ограничения по ресурсам (смотрите B<setrlimit>(2));

source: override maximum number of consoles on console allocation;
ru: Позволяет превышать максимальное количество консолей при выделении консоли;

source: override maximum number of keymaps;
ru: Позволяет превышать максимальное количество раскладок;

source: allow more than 64hz interrupts from the real-time clock;
ru: Позволяет использовать более чем 64hz прерывания из часов реального времени;

source: raise I<msg_qbytes> limit for a System V message queue above the limit in I</proc/sys/kernel/msgmnb> (see B<msgop>(2) and B<msgctl>(2));
ru: Позволяет назначать значение I<msg_qbytes> очереди сообщений System V больше ограничения I</proc/sys/kernel/msgmnb> (смотрите B<msgop>(2) и B<msgctl>(2));

source: allow the B<RLIMIT_NOFILE> resource limit on the number of "in-flight" file descriptors to be bypassed when passing file descriptors to another process via a UNIX domain socket (see B<unix>(7));
ru: Позволяет обходить ограничитель ресурса B<RLIMIT_NOFILE> для файловых дескрипторов, находящихся в процессе передачи («в полёте», in-flight), когда файловые дескрипторы передаются в другой процесс через доменный сокет UNIX (смотрите B<unix>(7));

source: override the I</proc/sys/fs/pipe-size-max> limit when setting the capacity of a pipe using the B<F_SETPIPE_SZ> B<fcntl>(2) command.
ru: Позволяет превышать ограничение I</proc/sys/fs/pipe-size-max> при назначении вместимости канала с помощью команды B<F_SETPIPE_SZ> у B<fcntl>(2).

source: use B<F_SETPIPE_SZ> to increase the capacity of a pipe above the limit specified by I</proc/sys/fs/pipe-max-size>;
ru: Позволяет использовать B<F_SETPIPE_SZ> для увеличения вместимости канала больше чем ограничение, задаваемое в I</proc/sys/fs/pipe-max-size>;

source: override I</proc/sys/fs/mqueue/queues_max> limit when creating POSIX message queues (see B<mq_overview>(7));
ru: Позволяет превышать ограничение I</proc/sys/fs/mqueue/queues_max> при создании очередей сообщений POSIX (смотрите B<mq_overview>(7));

source: employ the B<prctl>(2) B<PR_SET_MM> operation;
ru: Позволяет задействовать операцию B<prctl>(2) B<PR_SET_MM>();

source: set I</proc/[pid]/oom_score_adj> to a value lower than the value last set by a process with B<CAP_SYS_RESOURCE>.
ru: Позволяет устанавливать I</proc/[pid]/oom_score_adj> в значение меньшее, чем последнее установленное значение процессом с помощью B<CAP_SYS_RESOURCE>.

source: Set system clock (B<settimeofday>(2), B<stime>(2), B<adjtimex>(2)); set real-time (hardware) clock.
ru: Позволяет настраивать системные часы (B<settimeofday>(2), B<stime>(2), B<adjtimex>(2)) и часы реального времени (аппаратные).

source: Use B<vhangup>(2); employ various privileged B<ioctl>(2) operations on virtual terminals.
ru: Позволяет использовать B<vhangup>(2); задействовать различные привилегированные операции B<ioctl>(2) с виртуальными терминалами.

source: B<CAP_SYSLOG> (since Linux 2.6.37)
ru: B<CAP_SYSLOG> (начиная с Linux 2.6.37)

source: Perform privileged B<syslog>(2) operations. See B<syslog>(2) for information on which operations require privilege.
ru: Позволяет выполнять привилегированные операции B<syslog>(2). Смотрите в B<syslog>(2) какие операции требуют прав.

source: View kernel addresses exposed via I</proc> and other interfaces when I</proc/sys/kernel/kptr_restrict> has the value 1. (See the discussion of the I<kptr_restrict> in B<proc>(5).)
ru: Позволяет просматривать адреса ядра, показываемые в I</proc> и других интерфейсах, когда значение I</proc/sys/kernel/kptr_restrict> равно 1 (смотрите описание I<kptr_restrict> в B<proc>(5)).

source: B<CAP_WAKE_ALARM> (since Linux 3.0)
ru: B<CAP_WAKE_ALARM> (начиная с Linux 3.0)

source: Trigger something that will wake up the system (set B<CLOCK_REALTIME_ALARM> and B<CLOCK_BOOTTIME_ALARM> timers).
ru: Позволяет вызывать что-либо при пробуждении системы (устанавливать таймеры B<CLOCK_REALTIME_ALARM> и B<CLOCK_BOOTTIME_ALARM>).

source: Past and current implementation
ru: Старая и текущая реализации

source: A full implementation of capabilities requires that:
ru: Для полной реализации мандатов требуется:

source: For all privileged operations, the kernel must check whether the thread has the required capability in its effective set.
ru: Для всех привилегированных операций ядро должно проверять, имеет ли нить требуемый мандат в его эффективном наборе.

source: The kernel must provide system calls allowing a thread's capability sets to be changed and retrieved.
ru: Ядро должно предоставлять системные вызовы, позволяющие получать и изменять наборы мандатов нити.

source: The filesystem must support attaching capabilities to an executable file, so that a process gains those capabilities when the file is executed.
ru: Файловая система должна поддерживать присоединение мандатов к исполняемому файлу для того, чтобы при исполнении файла у процесса повышались права согласно этим мандатам.

source: Before kernel 2.6.24, only the first two of these requirements are met; since kernel 2.6.24, all three requirements are met.
ru: До ядра версии 2.6.24 были реализованы только первые два пункта; начиная с версии 2.6.24 реализованы все три пункта.

source: Notes to kernel developers
ru: Замечания разработчикам ядра

source: When adding a new kernel feature that should be governed by a capability, consider the following points.
ru: При добавлении новых возможностей ядра, которые должны регулироваться мандатом, нужно учитывать некоторые моменты.

source: The goal of capabilities is divide the power of superuser into pieces, such that if a program that has one or more capabilities is compromised, its power to do damage to the system would be less than the same program running with root privilege.
ru: Цель мандатов — разделить возможности суперпользователя на части, и если программа с одним или несколькими мандатами будет скомпрометирована, то её возможности нанести вред системе будут меньше, чем от такой же программы, выполняемой с правами суперпользователя.

source: You have the choice of either creating a new capability for your new feature, or associating the feature with one of the existing capabilities. In order to keep the set of capabilities to a manageable size, the latter option is preferable, unless there are compelling reasons to take the former option. (There is also a technical limit: the size of capability sets is currently limited to 64 bits.)
ru: Вы можете создать новый мандат для новой возможности или привязать возможность к одному из существующих мандатов. Чтобы сохранить набор мандатов приемлемого размера, последний вариант предпочтителен, если нет неопровержимых доводов за первый вариант (есть также техническое ограничение: размер набора мандатов в настоящее время ограничен 64 битами).

source: To determine which existing capability might best be associated with your new feature, review the list of capabilities above in order to find a "silo" into which your new feature best fits. One approach to take is to determine if there are other features requiring capabilities that will always be used along with the new feature. If the new feature is useless without these other features, you should use the same capability as the other features.
ru: Для определения какой существующий мандат мог бы лучше подойти новой возможности, просмотрите список мандатов, представленный выше. Выясните, есть ли другие возможности, требующие мандатов, которые всегда будут использоваться вместе с новой возможностью. Если новая возможность бесполезна без этих других возможностей, то нужно использовать тот же мандат как у других возможностей.

source: I<Don't> choose B<CAP_SYS_ADMIN> if you can possibly avoid it! A vast proportion of existing capability checks are associated with this capability (see the partial list above). It can plausibly be called "the new root", since on the one hand, it confers a wide range of powers, and on the other hand, its broad scope means that this is the capability that is required by many privileged programs. Don't make the problem worse. The only new features that should be associated with B<CAP_SYS_ADMIN> are ones that I<closely> match existing uses in that silo.
ru: I<Не> используйте B<CAP_SYS_ADMIN>, если этого можно избежать! С ним связана большая часть существующих проверок мандатов (смотрите часть списка выше). Его оправданно можно называть «новым суперпользователем», так как с одной стороны, он даёт широкий спектр полномочий, а с другой его широкий спектр действия означает, что данный мандат требуется многим привилегированным программам. Не делайте проблему хуже. Новые возможности, которые должны быть связаны с B<CAP_SYS_ADMIN> должны I<сильно> совпадать с существующими, использующими данное хранилище.
