Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: The B<crypt>(), B<encrypt>(3), and B<setkey>(3) functions are part of the POSIX.1-2008 XSI Options Group for Encryption and are optional. If the interfaces are not available, then the symbolic constant B<_XOPEN_CRYPT> is either not defined, or it is defined to -1 and availability can be checked at run time with B<sysconf>(3). This may be the case if the downstream distribution has switched from glibc crypt to I<libxcrypt>. When recompiling applications in such distributions, the programmer must detect if B<_XOPEN_CRYPT> is not available and include I<E<lt>crypt.hE<gt>> for the function prototypes; otherwise I<libxcrypt> is an ABI-compatible drop-in replacement.
ru: Функции B<crypt>(), B<encrypt>(3) и B<setkey>(3) являются частью POSIX.1-2008 XSI Options Group for Encryption и необязательны. Если интерфейсы недоступны, то символическая константа B<_XOPEN_CRYPT> или не определена, или имеет значение -1 и доступность можно проверить во время выполнения с помощью B<sysconf>(3). Такое может случиться, если дистрибутив переключился с glibc crypt на I<libxcrypt>. При перекомпиляции приложений в таких дистрибутивах программист должен проверять доступность B<_XOPEN_CRYPT> и включать I<E<lt>crypt.hE<gt>> с прототипами функций; в противном случае использовать I<libxcrypt> как ABI-совместимую замену.

source: Features in glibc
ru: Свойства в glibc

source: The glibc version of this function supports additional encryption algorithms.
ru: Версия этой функции, реализованная в glibc, содержит дополнительные алгоритмы шифрования.

source: If I<salt> is a character string starting with the characters "$I<id>$" followed by a string optionally terminated by "$", then the result has the form:
ru: Если I<salt> является строкой символов, начинающейся с «$I<id>$», за которой следует строка, оканчивающаяся «$», то результатом будет:

source: I<id> identifies the encryption method used instead of DES and this then determines how the rest of the password string is interpreted. The following values of I<id> are supported:
ru: В I<id> указывается метод шифрования, используемый вместо DES; он определяет как понимать оставшуюся часть строки пароля. Поддерживаются следующие значения I<id>:

source: ID | Method
ru: ID | Метод

source: 2a | Blowfish (not in mainline glibc; added in some
ru: 2a | Blowfish (нет в основной ветви glibc; добавлен в

source: | Linux distributions)
ru: | некоторых дистрибутивах Linux)

source: 5 | SHA-256 (since glibc 2.7)
ru: 5 | SHA-256 (начиная с glibc 2.7)

source: 6 | SHA-512 (since glibc 2.7)
ru: 6 | SHA-512 (начиная с glibc 2.7)

source: Thus, $5$I<salt>$I<encrypted> and $6$I<salt>$I<encrypted> contain the password encrypted with, respectively, functions based on SHA-256 and SHA-512.
ru: Таким образом, $5$I<salt>$I<encrypted> и $6$I<salt>$I<encrypted> содержат пароль, зашифрованный функциями на основе SHA-256 и SHA-512, соответственно.

source: "I<salt>" stands for the up to 16 characters following "$I<id>$" in the salt. The "I<encrypted>" part of the password string is the actual computed password. The size of this string is fixed:
ru: Значение «I<salt>» представляет собой строку длиной до 16 символов, следующую после «$I<id>$» в соли. Часть строки пароля «I<encrypted>» — действительно вычисленный пароль. Размер этой строки постоянен:

source: MD5 | 22 characters
ru: MD5 | 22 символа

source: SHA-256 | 43 characters
ru: SHA-256 | 43 символа

source: SHA-512 | 86 characters
ru: SHA-512 | 86 символов

source: The characters in "I<salt>" and "I<encrypted>" are drawn from the set [B<a-zA-Z0-9./>]. In the MD5 and SHA implementations the entire I<key> is significant (instead of only the first 8 bytes in DES).
ru: Символы в «I<salt>» и «I<encrypted>» входят в диапазон [B<a-zA-Z0-9./>]. В реализациях MD5 и SHA учитывается всё значение I<key> (а не только первые 8 байт как в DES).

source: Since glibc 2.7, the SHA-256 and SHA-512 implementations support a user-supplied number of hashing rounds, defaulting to 5000. If the "$I<id>$" characters in the salt are followed by "rounds=I<xxx>$", where I<xxx> is an integer, then the result has the form
ru: Начиная с glibc 2.7, реализации SHA-256 и SHA-512 поддерживают задаваемое пользователем количество циклов хеширования, по умолчанию 5000. Если символы "$I<id>$" в соли указываются после "rounds=I<xxx>$", где I<xxx> целое, то результат имеет вид

source: where I<yyy> is the number of hashing rounds actually used. The number of rounds actually used is 1000 if I<xxx> is less than 1000, 999999999 if I<xxx> is greater than 999999999, and is equal to I<xxx> otherwise.
ru: где I<yyy> — используемое количество циклов хеширования. Количество циклов равно 1000, если значение I<xxx> меньше 1000, 999999999, если I<xxx> больше 999999999, и равно I<xxx> в остальных случаях.

source: cexp2, cexp2f, cexp2l - base-2 exponent of a complex number
ru: cexp2, cexp2f, cexp2l - экспонента по основанию 2 для комплексного числа

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: The function returns 2 raised to the power of I<z>.
ru: Функция возвращает значение числа 2 в степени I<z>.

source: These function names are reserved for future use in C99.
ru: Имена функций зарезервированы для будущего использования в C99.

source: Not yet in glibc, as at version 2.19.
ru: Пока не в glibc (версия 2.19).

source: asctime, ctime, gmtime, localtime, mktime, asctime_r, ctime_r, gmtime_r, localtime_r - transform date and time to broken-down time or ASCII
ru: asctime, ctime, gmtime, localtime, mktime, asctime_r, ctime_r, gmtime_r, localtime_r - преобразует дату и время в раздельном представлении или ASCII

source: _POSIX_C_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _POSIX_C_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: The B<ctime>(), B<gmtime>() and B<localtime>() functions all take an argument of data type I<time_t>, which represents calendar time. When interpreted as an absolute time value, it represents the number of seconds elapsed since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
ru: Функции B<ctime>(), B<gmtime>() и B<localtime>() в качестве аргумента используют тип данных I<time_t>, представляющий собой календарное время. При его интерпретации как абсолютного времени, оно представляет количество секунд, прошедших с начала эпохи — 00:00:00 1 января 1970 +0000 (UTC).

source: The B<asctime>() and B<mktime>() functions both take an argument representing broken-down time, which is a representation separated into year, month, day, and so on.
ru: Функции B<asctime>() и B<mktime>() используют в качестве аргумента время, которое разделено на компоненты: год, месяц, день и т. п.

source: Broken-down time is stored in the structure I<tm>, which is defined in I<E<lt>time.hE<gt>> as follows:
ru: Время в виде компонент хранится в структуре I<tm>, которая определена в файле I<E<lt>time.hE<gt>> следующим образом:

source: struct tm { int tm_sec; /* Seconds (0-60) */ int tm_min; /* Minutes (0-59) */ int tm_hour; /* Hours (0-23) */ int tm_mday; /* Day of the month (1-31) */ int tm_mon; /* Month (0-11) */ int tm_year; /* Year - 1900 */ int tm_wday; /* Day of the week (0-6, Sunday = 0) */ int tm_yday; /* Day in the year (0-365, 1 Jan = 0) */ int tm_isdst; /* Daylight saving time */ };
ru: struct tm { int tm_sec; /* секунды (0-60) */ int tm_min; /* минуты (0-59) */ int tm_hour; /* часы (0-23) */ int tm_mday; /* день в месяце (1-31) */ int tm_mon; /* месяц (0-11) */ int tm_year; /* год - 1900 */ int tm_wday; /* день недели (0-6, воскресенье = 0) */ int tm_yday; /* день в году (0-365, 1 январь = 0) */ int tm_isdst; /* летнее время */ };

source: The members of the I<tm> structure are:
ru: Члены структуры I<tm>:

source: The number of seconds after the minute, normally in the range 0 to 59, but can be up to 60 to allow for leap seconds.
ru: Количество секунд до целой минуты, обычно в диапазоне от 0 до 59; но для того, чтобы установить високосную секунду, используются числа до 60.

source: The number of minutes after the hour, in the range 0 to 59.
ru: Количество минут до целого часа, от 0 до 59.

source: The number of hours past midnight, in the range 0 to 23.
ru: Количество часов прошедших после полуночи, от 0 до 23.

source: The day of the month, in the range 1 to 31.
ru: День месяца, от 1 до 31.

source: The number of months since January, in the range 0 to 11.
ru: Количество месяцев, прошедших с января, от 0 до 11.

source: The number of years since 1900.
ru: Количество лет, прошедших с 1900 года.

source: The number of days since Sunday, in the range 0 to 6.
ru: Количество дней, прошедших с воскресенья, от 0 до 6.

source: The number of days since January 1, in the range 0 to 365.
ru: Количество дней, прошедших с 1 января, от 0 до 365.

source: A flag that indicates whether daylight saving time is in effect at the time described. The value is positive if daylight saving time is in effect, zero if it is not, and negative if the information is not available.
ru: Этот флаг показывает, учтено ли летнее время в описываемой дате. Значение флага положительно, если летнее время учитывается, 0, если нет, и отрицательно, если информация недоступна.

source: The call B<ctime(>I<t>B<)> is equivalent to B<asctime(localtime(>I<t>B<))>. It converts the calendar time I<t> into a null-terminated string of the form
ru: Вызов B<ctime(>I<t>B<)> эквивалентен B<asctime(localtime(>I<t>B<))>. Он преобразует календарное время I<t> в строку (с null в конце) вида

source: The abbreviations for the days of the week are "Sun", "Mon", "Tue", "Wed", "Thu", "Fri", and "Sat". The abbreviations for the months are "Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", and "Dec". The return value points to a statically allocated string which might be overwritten by subsequent calls to any of the date and time functions. The function also sets the external variables I<tzname>, I<timezone>, and I<daylight> (see B<tzset>(3)) with information about the current timezone. The reentrant version B<ctime_r>() does the same, but stores the string in a user-supplied buffer which should have room for at least 26 bytes. It need not set I<tzname>, I<timezone>, and I<daylight>.
ru: Аббревиатуры дней недели: «Sun», «Mon», «Tue», «Wed», «Thu», «Fri» и «Sat». Аббревиатуры месяцев: «Jan», «Feb», «Mar», «Apr», «May», «Jun», «Jul», «Aug», «Sep», «Oct», «Nov» и «Dec». Возвращаемое значение указывает на статически размещённую строку, которая может быть перезаписана последующими вызовами любых функций даты и времени. Функция также устанавливает в внешних переменных I<tzname>, I<timezone> и I<daylight> (смотрите B<tzset>(3)) текущий часовой пояс. Реентерабельная версия B<ctime_r>() делает то же самое, но заносит строку в буфер, предоставляемый пользователем. Длина буфера должна быть не менее 26 байт. Ей не нужно устанавливать I<tzname>, I<timezone> и I<daylight>.

source: The B<gmtime>() function converts the calendar time I<timep> to broken-down time representation, expressed in Coordinated Universal Time (UTC). It may return NULL when the year does not fit into an integer. The return value points to a statically allocated struct which might be overwritten by subsequent calls to any of the date and time functions. The B<gmtime_r>() function does the same, but stores the data in a user-supplied struct.
ru: Функция B<gmtime>() преобразует календарное время I<timep> в компонентное представление, выраженное в виде всеобщего скоординированного времени (UTC). Она может вернуть значение NULL, если год не может быть описан типом integer. Возвращаемое значение указывает на статически выделенную структуру, содержимое которой может быть перезаписано последующими вызовами любых функций, работающих с датой и временем. Функция B<gmtime_r>() делает то же самое, но помещает данные в структуру, предоставленную пользователем.

source: The B<localtime>() function converts the calendar time I<timep> to broken-down time representation, expressed relative to the user's specified timezone. The function acts as if it called B<tzset>(3) and sets the external variables I<tzname> with information about the current timezone, I<timezone> with the difference between Coordinated Universal Time (UTC) and local standard time in seconds, and I<daylight> to a nonzero value if daylight savings time rules apply during some part of the year. The return value points to a statically allocated struct which might be overwritten by subsequent calls to any of the date and time functions. The B<localtime_r>() function does the same, but stores the data in a user-supplied struct. It need not set I<tzname>, I<timezone>, and I<daylight>.
ru: Функция B<localtime>() преобразует календарное время I<timep> в компонентное представление, выраженное относительно часового пояса, заданного пользователем. Функция работает так, как-будто она вызывает B<tzset>(3), и устанавливает внешние переменные: I<tzname> в значение текущего часового пояса, I<timezone> в значение разницы в секундах между всеобщим скоординированным временем (UTC) и локальным стандартом времени, и I<daylight> в ненулевое значение, если действуют стандартные правила летнего времени. Возвращаемое значение указывает на статически выделенную структуру, содержимое которой может быть перезаписано последующими вызовами любых функций, работающих с датой и временем. Функция B<localtime_r>() делает то же самое, но помещает данные в структуру, предоставленную пользователем. Она не нуждается в установке I<tzname>, I<timezone> и I<daylight>.

source: The B<asctime>() function converts the broken-down time value I<tm> into a null-terminated string with the same format as B<ctime>(). The return value points to a statically allocated string which might be overwritten by subsequent calls to any of the date and time functions. The B<asctime_r>() function does the same, but stores the string in a user-supplied buffer which should have room for at least 26 bytes.
ru: Функция B<asctime>() преобразует компонентное значение времени I<tm> в строку (с null в конце) того же формата, что и функция B<ctime>(). Возвращаемое значение указывает на статическую строку, которая может быть перезаписана последовательностью вызовов любых функций даты и времени. Функция B<asctime_r>() делает то же самое, но заносит строку в буфер, предоставленный пользователем. Длина буфера должна быть не менее 26 байт.

source: The B<mktime>() function converts a broken-down time structure, expressed as local time, to calendar time representation. The function ignores the values supplied by the caller in the I<tm_wday> and I<tm_yday> fields. The value specified in the I<tm_isdst> field informs B<mktime>() whether or not daylight saving time (DST) is in effect for the time supplied in the I<tm> structure: a positive value means DST is in effect; zero means that DST is not in effect; and a negative value means that B<mktime>() should (use timezone information and system databases to) attempt to determine whether DST is in effect at the specified time.
ru: Функция B<mktime>() преобразует компонентное структурированное значение локального времени в календарное представление. Функция игнорирует содержимое полей структуры I<tm_wday> и I<tm_yday>, заданные вызывающим. Значение, указанное в поле I<tm_isdst>, информирует B<mktime>() о действии летнего время (DST) в времени в структуре I<tm>: положительно значение показывает, что действует; 0 означает, что не действует и отрицательное значение означает, что B<mktime>() должна попытаться определить самостоятельно, действует ли летнее время (используя информацию о часовом поясе и базы данных системы).

source: The B<mktime>() function modifies the fields of the I<tm> structure as follows: I<tm_wday> and I<tm_yday> are set to values determined from the contents of the other fields; if structure members are outside their valid interval, they will be normalized (so that, for example, 40 October is changed into 9 November); I<tm_isdst> is set (regardless of its initial value) to a positive value or to 0, respectively, to indicate whether DST is or is not in effect at the specified time. Calling B<mktime>() also sets the external variable I<tzname> with information about the current timezone.
ru: Функция B<mktime>() изменяет поля структуры I<tm> следующим образом: в I<tm_wday> и I<tm_yday> записываются значения, определённые на основе содержимого других полей; если члены структуры вне своих допустимых интервалов, то они будут нормализованы (так, например, 40 октября превращается в 9 ноября); в I<tm_isdst> записывается положительное значение или 0, соответственно, для указания действия летнего времени (независимо от его начального значения). Вызов B<mktime>() также присваивает внешней переменной I<tzname> значение текущего часового пояса.

source: If the specified broken-down time cannot be represented as calendar time (seconds since the Epoch), B<mktime>() returns I<(time_t)\ -1> and does not alter the members of the broken-down time structure.
ru: Если компонентное значение времени не может быть представлено как календарное (число секунд с начала эпохи), то B<mktime>() возвращает значение I<(time_t)\ -1> и не изменяет значения полей структуры компонентного значения времени.

source: On success, B<gmtime>() and B<localtime>() return a pointer to a I<struct\ tm>.
ru: При успешном выполнении функции B<gmtime>() и B<localtime>() возвращают указатель на I<struct\ tm>.

source: On success, B<gmtime_r>() and B<localtime_r>() return the address of the structure pointed to by I<result>.
ru: При успешном выполнении функции B<gmtime_r>() и B<localtime_r>() возвращают адрес структуры, на которую указывает I<result>.

source: On success, B<asctime>() and B<ctime>() return a pointer to a string.
ru: При успешном выполнении функции B<asctime>() и B<ctime>() возвращают указатель на строку.

source: On success, B<asctime_r>() and B<ctime_r>() return a pointer to the string pointed to by I<buf>.
ru: При успешном выполнении функции B<asctime_r>() и B<ctime_r>() возвращают указатель на строку, на которую указывает I<buf>.

source: On success, B<mktime>() returns the calendar time (seconds since the Epoch), expressed as a value of type I<time_t>.
ru: При успешном выполнении функция B<mktime>() возвращает календарное время (секунды с начала эпохи), выраженное значением с типом I<time_t>.

source: On error, B<mktime>() returns the value I<(time_t)\ -1>. The remaining functions return NULL on error. On error, I<errno> is set to indicate the cause of the error.
ru: При ошибке функция B<mktime>() возвращает значение I<(time_t)\ -1>. Остальные функции при ошибке возвращают NULL. При ошибке в I<errno> записывается причина ошибки.

source: The result cannot be represented.
ru: Результат не может быть представлен.

source: POSIX.1-2001. C89 and C99 specify B<asctime>(), B<ctime>(), B<gmtime>(), B<localtime>(), and B<mktime>(). POSIX.1-2008 marks B<asctime>(), B<asctime_r>(), B<ctime>(), and B<ctime_r>() as obsolete, recommending the use of B<strftime>(3) instead.
ru: POSIX.1-2001. В C89 и C99 определены функции B<asctime>(), B<ctime>(), B<gmtime>(), B<localtime>() и B<mktime>(). В POSIX.1-2008 функции B<asctime>(), B<asctime_r>(), B<ctime>() и B<ctime_r>() помечены как устаревшие. Вместо них рекомендуется использовать B<strftime>(3).

source: The four functions B<asctime>(), B<ctime>(), B<gmtime>() and B<localtime>() return a pointer to static data and hence are not thread-safe. The thread-safe versions, B<asctime_r>(), B<ctime_r>(), B<gmtime_r>() and B<localtime_r>(), are specified by SUSv2.
ru: Функции B<asctime>(), B<ctime>(), B<gmtime>() и B<localtime>() возвращают указатель на статические данные и небезопасны при использовании в нитях. Безопасными являются их аналоги B<asctime_r>(), B<ctime_r>(), B<gmtime_r>() и B<localtime_r>(), введённые в SUSv2.

source: POSIX.1-2001 says: "The B<asctime>(), B<ctime>(), B<gmtime>(), and B<localtime>() functions shall return values in one of two static objects: a broken-down time structure and an array of type I<char>. Execution of any of the functions may overwrite the information returned in either of these objects by any of the other functions." This can occur in the glibc implementation.
ru: В POSIX.1-2001 сказано: «Функции B<asctime>(), B<ctime>(), B<gmtime>() и B<localtime>() должны возвращать значения в одном из двух статических объектов: структуре компонентного значения времени и массиве типа I<char>. Выполнение любой функции может перезаписать данные, возвращённые ранее любой другой функцией в любом из этих объектов.» Это может происходить в реализации glibc.

source: In many implementations, including glibc, a 0 in I<tm_mday> is interpreted as meaning the last day of the preceding month.
ru: Во многих реализациях, включая glibc, 0 в I<tm_mday> означает последний день предыдущего месяца.

source: The glibc version of I<struct tm> has additional fields
ru: Структура I<struct tm> версии glibc имеет дополнительные поля

source: const char *tm_zone; /* Timezone abbreviation */
ru: const char *tm_zone; /* аббревиатура часового пояса */

source: defined when B<_BSD_SOURCE> was set before including I<E<lt>time.hE<gt>>. This is a BSD extension, present in 4.3BSD-Reno.
ru: определяемые в случае, если макрос B<_BSD_SOURCE> был определён до включения I<E<lt>time.hE<gt>>. Это расширение BSD, существует в 4.3BSD-Reno.

source: According to POSIX.1-2004, B<localtime>() is required to behave as though B<tzset>(3) was called, while B<localtime_r>() does not have this requirement. For portable code, B<tzset>(3) should be called before B<localtime_r>().
ru: Согласно POSIX.1-2004, для B<localtime>() требуется повторить поведение как если бы была вызвана B<tzset>(3), хотя для B<localtime_r>() такого требования не выдвигается. В целях переносимости в коде нужно вызывать B<tzset>(3) перед B<localtime_r>().

source: cpow, cpowf, cpowl - complex power function
ru: cpow, cpowf, cpowl - функция возведения комплексного числа в степень

source: Link with I<-lm>.
ru: Компонуется при указании параметра I<-lm>.

source: These functions calculate I<x> raised to the power I<z> (with a branch cut for I<x> along the negative real axis.)
ru: Эти функции вычисляют I<x>, возведённое в степень I<z> (с обрезанием ветви для I<x> вдоль отрицательной действительной оси).

source: These functions first appeared in glibc in version 2.1.
ru: Эти функции впервые появились в glibc 2.1.

source: creal, crealf, creall - get real part of a complex number
ru: creal, crealf, creall - получение действительной части комплексного числа

source: These functions return the real part of the complex number I<z>.
ru: Эти функции возвращают действительную часть комплексного числа I<z>.

source: One has:
ru: Формула вычисления:

source: The gcc supports also __real__. That is a GNU extension.
ru: gcc также поддерживает __real__. Это расширение GNU.

source: clog2, clog2f, clog2l - base-2 logarithm of a complex number
ru: clog2, clog2f, clog2l - логарифм по основанию 2 комплексного числа

source: The call I<clog2(z)> is equivalent to I<clog(z)/log(2)>.
ru: Функция I<clog2(z)> эквивалентна I<clog(z)/log(2)>.

source: The other functions perform the same task for I<float> and I<long double>.
ru: Другие функции выполняют ту же задачу для типов I<float> и I<long double>.

source: Note that I<z> close to zero will cause an overflow.
ru: Заметим, что I<z>, близкое к нулю, вызовет переполнение.

source: catgets - get message from a message catalog
ru: catgets - получает сообщение из каталога сообщений
