Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Note that even with the B<SECBIT_KEEP_CAPS> flag set, the effective capabilities of a thread are cleared when it switches its effective UID to a nonzero value. However, if the thread has set this flag and its effective UID is already nonzero, and the thread subsequently switches all other UIDs to nonzero values, then the effective capabilities will not be cleared.
ru: Заметим, что даже с установленным флагом B<SECBIT_KEEP_CAPS> эффективные мандаты нити очищаются, когда она переключает свой эффективный UID на ненулевое значение. Однако, если нить устанавливает этот флаг и её эффективный UID уже не равен нулю и затем нить переключает все другие UID в ненулевые значения, то эффективные мандаты не будут очищены.

source: The setting of the B<SECBIT_KEEP_CAPS> flag is ignored if the B<SECBIT_NO_SETUID_FIXUP> flag is set. (The latter flag provides a superset of the effect of the former flag.)
ru: Установка флага B<SECBIT_KEEP_CAPS> игнорируется, если указан флаг B<SECBIT_NO_SETUID_FIXUP> (этот флаг предоставляет надмножество свойств первого флага).

source: This flag provides the same functionality as the older B<prctl>(2) B<PR_SET_KEEPCAPS> operation.
ru: Этот флаг предоставляет возможности старой операции B<PR_SET_KEEPCAPS> вызова B<prctl>(2).

source: Setting this flag stops the kernel from adjusting the process's permitted, effective, and ambient capability sets when the thread's effective and filesystem UIDs are switched between zero and nonzero values. (See the subsection I<Effect of user ID changes on capabilities>.)
ru: Установка этого флага не даёт ядру изменить разрешительный, эффективный и наружный набор мандатов при изменении эффективного UID и UID файловой системы нити с 0 на ненулевое значение (смотрите раздел I<Влияние изменения пользовательского ID на мандаты>).

source: If this bit is set, then the kernel does not grant capabilities when a set-user-ID-root program is executed, or when a process with an effective or real UID of 0 calls B<execve>(2). (See the subsection I<Capabilities and execution of programs by root>.)
ru: Если этот бит установлен, то ядро не предоставляет мандаты при исполнении программы, имеющей бит set-user-ID-root, или когда процесс с эффективным или реальным UID равным 0 вызывает B<execve>(2) (смотрите раздел I<Мандаты и выполнение программа от root>).

source: Setting this flag disallows raising ambient capabilities via the B<prctl>(2) B<PR_CAP_AMBIENT_RAISE> operation.
ru: Установка этого флага запрещает повышение наружных мандатов посредством B<prctl>(2)с операцией B<PR_CAP_AMBIENT_RAISE>.

source: Each of the above "base" flags has a companion "locked" flag. Setting any of the "locked" flags is irreversible, and has the effect of preventing further changes to the corresponding "base" flag. The locked flags are: B<SECBIT_KEEP_CAPS_LOCKED>, B<SECBIT_NO_SETUID_FIXUP_LOCKED>, B<SECBIT_NOROOT_LOCKED>, and B<SECBIT_NO_CAP_AMBIENT_RAISE_LOCKED>.
ru: Каждый из перечисленных выше «базовых» флагов имеет дополнительный флаг «блокировки». Установка любого из флагов «блокировки» необратима и запрещает дальнейшие изменения соответствующего «базового» флага. Флаги блокировки: B<SECBIT_KEEP_CAPS_LOCKED>, B<SECBIT_NO_SETUID_FIXUP_LOCKED>, B<SECBIT_NOROOT_LOCKED> и B<SECBIT_NO_CAP_AMBIENT_RAISE_LOCKED>.

source: The I<securebits> flags can be modified and retrieved using the B<prctl>(2) B<PR_SET_SECUREBITS> and B<PR_GET_SECUREBITS> operations. The B<CAP_SETPCAP> capability is required to modify the flags. Note that the B<SECBIT_*> constants are available only after including the I<E<lt>linux/securebits.hE<gt>> header file.
ru: Флаги I<securebits> можно изменять и получать с помощью вызова B<prctl>(2) с операциями B<PR_SET_SECUREBITS> и B<PR_GET_SECUREBITS>. Для изменения флагов требуется мандат B<CAP_SETPCAP>. Заметим, что константы B<SECBIT_*> доступны только после включения в код заголовочного файла I<E<lt>linux/securebits.hE<gt>>.

source: The I<securebits> flags are inherited by child processes. During an B<execve>(2), all of the flags are preserved, except B<SECBIT_KEEP_CAPS> which is always cleared.
ru: Флаги I<securebits> наследуются дочерними процессами. При B<execve>(2) все флаги сохраняются, за исключением B<SECBIT_KEEP_CAPS>, который всегда сбрасывается.

source: An application can use the following call to lock itself, and all of its descendants, into an environment where the only way of gaining capabilities is by executing a program with associated file capabilities:
ru: Приложение может использовать следующий вызов для собственной блокировки и помещение всех своих потомков в окружение, в котором есть только один способ добавить права — запустить программу со связанными с ней файловыми мандатами:

source: prctl(PR_SET_SECUREBITS, /* SECBIT_KEEP_CAPS off */ SECBIT_KEEP_CAPS_LOCKED | SECBIT_NO_SETUID_FIXUP | SECBIT_NO_SETUID_FIXUP_LOCKED | SECBIT_NOROOT | SECBIT_NOROOT_LOCKED); /* Setting/locking SECBIT_NO_CAP_AMBIENT_RAISE is not required */
ru: prctl(PR_SET_SECUREBITS, /* SECBIT_KEEP_CAPS off */ SECBIT_KEEP_CAPS_LOCKED | SECBIT_NO_SETUID_FIXUP | SECBIT_NO_SETUID_FIXUP_LOCKED | SECBIT_NOROOT | SECBIT_NOROOT_LOCKED); /* установка/блокировка SECBIT_NO_CAP_AMBIENT_RAISE не требуется */

source: Per-user-namespace "set-user-ID-root" programs
ru: Программы set-user-ID-root с отдельными пространствами имён пользователя

source: A set-user-ID program whose UID matches the UID that created a user namespace will confer capabilities in the process's permitted and effective sets when executed by any process inside that namespace or any descendant user namespace.
ru: Программе set-user-ID, чей UID совпадает с UID создателя пространства имён пользователя, будут предоставлены мандаты в разрешительном и эффективном наборах, при выполнении любого процесса внутри этого пространства имён или в любом дочернем пространстве имён пользователя.

source: The rules about the transformation of the process's capabilities during the B<execve>(2) are exactly as described in the subsections I<Transformation of capabilities during execve()> and I<Capabilities and execution of programs by root>, with the difference that, in the latter subsection, "root" is the UID of the creator of the user namespace.
ru: Правила преобразования мандатов процесса при B<execve>(2) точно такие же как описаны в подразделах I<Преобразование мандатов при execve()> и I<Мандаты и выполнение программы с правами root>, но с отличием: в последнем подразделе «root» это UID создателя пространства имён пользователя.

source: Namespaced file capabilities
ru: Файловые мандаты пространства имён

source: Traditional (i.e., version 2) file capabilities associate only a set of capability masks with a binary executable file. When a process executes a binary with such capabilities, it gains the associated capabilities (within its user namespace) as per the rules described above in "Transformation of capabilities during execve()".
ru: Обычные (т. е., с версией 2) файловые мандаты представляют собой только связь набора мандатных масок и двоичного исполняемого файла. Когда процесс выполняет двоичный файл с такими мандатами он получает присоединённые мандаты (внутри своего пользовательского пространства имён) согласно правилам, описанным выше в «Преобразование мандатов при execve()».

source: Because version 2 file capabilities confer capabilities to the executing process regardless of which user namespace it resides in, only privileged processes are permitted to associate capabilities with a file. Here, "privileged" means a process that has the B<CAP_SETFCAP> capability in the user namespace where the filesystem was mounted (normally the initial user namespace). This limitation renders file capabilities useless for certain use cases. For example, in user-namespaced containers, it can be desirable to be able to create a binary that confers capabilities only to processes executed inside that container, but not to processes that are executed outside the container.
ru: Так как файловые мандаты версии 2 предоставляются выполняющемуся процессу независимо от того, в каком пользовательском пространстве имён он располагается, то только привилегированным процессам разрешено связывать мандаты с файлом. Здесь «привилегированным» считается процесс, имеющий мандат B<CAP_SETFCAP> в пользовательском пространстве имён, в котором была смонтирована файловая система (обычно, изначальное пользовательское пространство имён). Это ограничение в определённых случаях делает файловые мандаты бесполезными. Например, в контейнерах пользовательских пространств имён может требоваться возможность создания двоичных файлов, которые предоставляют мандаты только процессам, выполняемым внутри контейнера, но не процессам, выполняемым вне контейнера.

source: Linux 4.14 added so-called namespaced file capabilities to support such use cases. Namespaced file capabilities are recorded as version 3 (i.e., B<VFS_CAP_REVISION_3>) I<security.capability> extended attributes. Such an attribute is automatically created in the circumstances described above under "File capability extended attribute versioning". When a version 3 I<security.capability> extended attribute is created, the kernel records not just the capability masks in the extended attribute, but also the namespace root user ID.
ru: В Linux 4.14 добавлены так называемые файловые мандаты пространства имён; это введено специально для таких случаев. Файловые мандаты пространства имён записываются в версию 3 (т. е., B<VFS_CAP_REVISION_3>) расширенных атрибутов I<security.capability>. Данный атрибут автоматически создаётся при условиях, описанных выше в «Версии расширенного атрибута файловых мандатов». Когда создаётся расширенный атрибутI<security.capability> версии 3 ядро записывает в расширенный атрибут не только маску мандатов, но и ID суперпользователя пространства имён.

source: As with a binary that has B<VFS_CAP_REVISION_2> file capabilities, a binary with B<VFS_CAP_REVISION_3> file capabilities confers capabilities to a process during B<execve>(). However, capabilities are conferred only if the binary is executed by a process that resides in a user namespace whose UID 0 maps to the root user ID that is saved in the extended attribute, or when executed by a process that resides in a descendant of such a namespace.
ru: Подобно двоичному файлу с файловыми мандатами B<VFS_CAP_REVISION_2> файл с файловыми мандатами B<VFS_CAP_REVISION_3> предоставляет мандаты процессу при B<execve>(). Однако мандаты предоставляются только, если двоичный файл, выполняемый процессом, располагается в пользовательском пространстве имён, в котором UID 0 отображается в ID суперпользователя, сохранённого в расширенном атрибуте, или когда выполняется процессом, располагаемом в потомке такого пространства имён.

source: Interaction with user namespaces
ru: Взаимодействие с пользовательскими пространствами имён

source: For further information on the interaction of capabilities and user namespaces, see B<user_namespaces>(7).
ru: Дополнительную информацию о связи мандатов с пространствами пользователя смотрите в B<user_namespaces>(7).

source: No standards govern capabilities, but the Linux capability implementation is based on the withdrawn POSIX.1e draft standard; see E<.UR https://archive.org\:/details\:/posix_1003.1e-990310> E<.UE .>
ru: Стандарты, описывающие мандаты, отсутствуют, но реализация мандатов в Linux основывается на изъятом черновике стандарта POSIX.1e; смотрите E<.UR https://archive.org\:/details\:/posix_1003.1e-990310> E<.UE .>

source: When attempting to B<strace>(1) binaries that have capabilities (or set-user-ID-root binaries), you may find the I<-u E<lt>usernameE<gt>> option useful. Something like:
ru: При попытке запуска B<strace>(1) над исполняемыми файлами с мандатами (или с установленным битом set-user-ID-root), вам может понадобиться параметр I<-u E<lt>имя_пользователяE<gt>>. Например так:

source: From kernel 2.5.27 to kernel 2.6.26, capabilities were an optional kernel component, and could be enabled/disabled via the B<CONFIG_SECURITY_CAPABILITIES> kernel configuration option.
ru: Начиная с ядра версии 2.5.27 по 2.6.26, мандаты являются необязательным компонентом ядра, и могут быть включены/выключены с помощью параметра настройки ядра B<CONFIG_SECURITY_CAPABILITIES>.

source: The I</proc/[pid]/task/TID/status> file can be used to view the capability sets of a thread. The I</proc/[pid]/status> file shows the capability sets of a process's main thread. Before Linux 3.8, nonexistent capabilities were shown as being enabled (1) in these sets. Since Linux 3.8, all nonexistent capabilities (above B<CAP_LAST_CAP>) are shown as disabled (0).
ru: Файл I</proc/[pid]/task/TID/status> можно использовать для просмотра набора мандатов нити. В файле I</proc/[pid]/status> отражён набор мандатов главной нити процесса. До Linux 3.8, несуществующие мандаты в этих наборах показывались как включённые (1). Начиная с Linux 3.8, все несуществующие мандаты (после B<CAP_LAST_CAP>) показываются выключенными (0).

source: The I<libcap> package provides a suite of routines for setting and getting capabilities that is more comfortable and less likely to change than the interface provided by B<capset>(2) and B<capget>(2). This package also provides the B<setcap>(8) and B<getcap>(8) programs. It can be found at
ru: В пакете I<libcap> содержится набор процедур для установки и получения мандатов; он удобнее и менее подвержен изменениям, чем интерфейс предоставляемый B<capset>(2) и B<capget>(2). Также данный пакет предоставляет программы B<setcap>(8) и B<getcap>(8) . Его можно найти здесь:

source: Before kernel 2.6.24, and from kernel 2.6.24 to kernel 2.6.32 if file capabilities are not enabled, a thread with the B<CAP_SETPCAP> capability can manipulate the capabilities of threads other than itself. However, this is only theoretically possible, since no thread ever has B<CAP_SETPCAP> in either of these cases:
ru: До ядра версии 2.6.24, и начиная с версии 2.6.24 по 2.6.32, если файловые мандаты не включены, то нить с мандатом B<CAP_SETPCAP> может управлять мандатами других нитей. Однако, это возможно только теоретически, так как ни одна из нитей не имеет B<CAP_SETPCAP> в любом из двух случаев:

source: In the pre-2.6.25 implementation the system-wide capability bounding set, I</proc/sys/kernel/cap-bound>, always masks out this capability, and this can not be changed without modifying the kernel source and rebuilding.
ru: Реализация в версии pre-2.6.25 системного ограничивающего набора мандатов, I</proc/sys/kernel/cap-bound>, всегда запрещала этот мандат, и это нельзя было изменить без изменения исходного кода ядра и пересборки.

source: If file capabilities are disabled in the current implementation, then B<init> starts out with this capability removed from its per-process bounding set, and that bounding set is inherited by all other processes created on the system.
ru: Если файловые мандаты выключены в текущей реализации, то у запускаемого B<init> данный мандат отозван из ограничивающего набора мандатов нити, и этот ограничивающий набор наследуется всеми остальными процессами, создаваемыми в системе.

source: I<include/linux/capability.h> in the Linux kernel source tree
ru: Файл I<include/linux/capability.h> в дереве исходного кода ядра Linux.

source: cgroups - Linux control groups
ru: cgroups - управляемые группы в Linux

source: Control groups, usually referred to as cgroups, are a Linux kernel feature which allow processes to be organized into hierarchical groups whose usage of various types of resources can then be limited and monitored. The kernel's cgroup interface is provided through a pseudo-filesystem called cgroupfs. Grouping is implemented in the core cgroup kernel code, while resource tracking and limits are implemented in a set of per-resource-type subsystems (memory, CPU, and so on).
ru: Управляемые cgroup-ы, обычно называемые cgroups, это свойство ядра Linux, которое позволяет объединять процессы в иерархические группы, и в этих группах отслеживать и ограничивать разные типы ресурсов. Ядро предоставляет интерфейс работы с cgroup-ами через псевдо-файловую систему, называемую cgroupfs. Группировка реализована в базовой части ядра cgroup, а слежение за ресурсами и ограничениями — в подсистемах самих ресурсов (память, ЦП и т. п.).

source: Terminology
ru: Терминология

source: A I<cgroup> is a collection of processes that are bound to a set of limits or parameters defined via the cgroup filesystem.
ru: I<cgroup> — это набор процессов, которые связаны с набором ограничений или параметров, определяемых через файловую систему cgroup.

source: A I<subsystem> is a kernel component that modifies the behavior of the processes in a cgroup. Various subsystems have been implemented, making it possible to do things such as limiting the amount of CPU time and memory available to a cgroup, accounting for the CPU time used by a cgroup, and freezing and resuming execution of the processes in a cgroup. Subsystems are sometimes also known as I<resource controllers> (or simply, controllers).
ru: I<subsystem> — компонент ядра, который изменяет поведение процессов в cgroup-у. Реализованы различные подсистемы, они позволяют делать разные вещи, например ограничивать количество времени ЦП и память доступную для cgroup-ы, подсчитывать время ЦП, используемое группой и останавливать и возобновлять выполнение процессов в cgroup-е. Подсистемы иногда также называют I<контроллерами ресурсов> (или просто, контроллерами).

source: The cgroups for a controller are arranged in a I<hierarchy>. This hierarchy is defined by creating, removing, and renaming subdirectories within the cgroup filesystem. At each level of the hierarchy, attributes (e.g., limits) can be defined. The limits, control, and accounting provided by cgroups generally have effect throughout the subhierarchy underneath the cgroup where the attributes are defined. Thus, for example, the limits placed on a cgroup at a higher level in the hierarchy cannot be exceeded by descendant cgroups.
ru: Для контроллера cgroup-ы упорядочены в I<иерархию>. Иерархия определяется посредством создания, удаления и переименования подкаталогов в файловой системе cgroup. На каждом уровне иерархии можно задать атрибуты (например, ограничения). Если атрибуты назначены, то ограничение, контроль и учёт, предоставляемый cgroup-ами, обычно, распространяется в иерархии по всем нижестоящим элементам. То есть, например, ограничение, заданное на cgroup на высшем уровне иерархии не может быть превышено в дочерних cgroup-ах.

source: Cgroups version 1 and version 2
ru: Cgroups версии 1 и 2

source: The initial release of the cgroups implementation was in Linux 2.6.24. Over time, various cgroup controllers have been added to allow the management of various types of resources. However, the development of these controllers was largely uncoordinated, with the result that many inconsistencies arose between controllers and management of the cgroup hierarchies became rather complex. (A longer description of these problems can be found in the kernel source file I<Documentation/cgroup-v2.txt>.)
ru: Впервые реализация cgroup появилась в Linux 2.6.24. Постепенно добавлялись различные контроллеры cgroup, позволяющие управлять различными типами ресурсов. Однако, разработка этих контроллеров была, по большей части, не скоординированной, что привело к несогласованности между контроллерами, и управление иерархиями cgroup стало очень сложным (расширенное описание проблем можно найти в файле исходного кода ядра I<Documentation/cgroup-v2.txt>).

source: Because of the problems with the initial cgroups implementation (cgroups version 1), starting in Linux 3.10, work began on a new, orthogonal implementation to remedy these problems. Initially marked experimental, and hidden behind the I<-o\ __DEVEL__sane_behavior> mount option, the new version (cgroups version 2) was eventually made official with the release of Linux 4.5. Differences between the two versions are described in the text below.
ru: Вследствие проблем в первой реализации cgroup (cgroups версии 1), начиная с Linux 3.10 началась работа на новой независимой реализацией, учитывающей возникшие ошибки. Сначала помеченная как экспериментальная и скрытая параметром монтирования I<-o\ __DEVEL__sane_behavior> новая версия (cgroups версии 2) в конце концов была добавлена в Linux 4.5. Различия между версиями описаны далее.

source: Although cgroups v2 is intended as a replacement for cgroups v1, the older system continues to exist (and for compatibility reasons is unlikely to be removed). Currently, cgroups v2 implements only a subset of the controllers available in cgroups v1. The two systems are implemented so that both v1 controllers and v2 controllers can be mounted on the same system. Thus, for example, it is possible to use those controllers that are supported under version 2, while also using version 1 controllers where version 2 does not yet support those controllers. The only restriction here is that a controller can't be simultaneously employed in both a cgroups v1 hierarchy and in the cgroups v2 hierarchy.
ru: Хотя cgroups v2 создавалась как замена cgroups v1, старая система всё ещё существует (и для обеспечения совместимости её не хотелось бы удалять). В настоящее время, в cgroups v2 реализованы не все контроллеры, доступные в cgroups v1. Эти две системы реализованы таким образом, что контроллеры v1 и v2 можно монтировать одновременно. То есть, например, можно не только использовать контроллеры, поддерживаемые версией 2, но и использовать контроллеры версии 1, которые пока не поддерживаются версией 2. Единственным ограничением является то, что один и тот же контроллер не может быть запущен одновременно в иерархии cgroups v1 и cgroups v2.

source: CGROUPS VERSION 1
ru: CGROUPS ВЕРСИИ 1

source: Under cgroups v1, each controller may be mounted against a separate cgroup filesystem that provides its own hierarchical organization of the processes on the system. It is also possible to comount multiple (or even all) cgroups v1 controllers against the same cgroup filesystem, meaning that the comounted controllers manage the same hierarchical organization of processes.
ru: В cgroups v1 каждый контроллер можно смонтировать в отдельную файловую систему cgroup, которая представляет собой собственную иерархию процессов в системе. Также возможно совместное монтирование нескольких (или даже всех) контроллеров cgroups v1 в единую файловую систему cgroup, при этом совместно смонтированные контроллеры управляют одной иерархией процессов.

source: For each mounted hierarchy, the directory tree mirrors the control group hierarchy. Each control group is represented by a directory, with each of its child control cgroups represented as a child directory. For instance, I</user/joe/1.session> represents control group I<1.session>, which is a child of cgroup I<joe>, which is a child of I</user>. Under each cgroup directory is a set of files which can be read or written to, reflecting resource limits and a few general cgroup properties.
ru: Для каждой смонтированной иерархии дерево каталогов отражает иерархию управляемой группы. Каждая управляемая группа представляется каталогом, каждый её потомок управляемой cgroups представляется дочерним каталогом. Например, I</user/joe/1.session> представляет управляемую группу I<1.session>, которая является потомком cgroup I<joe>, которая является потомком I</user>. В каждом каталоге cgroup есть набор файлов, доступных на чтение и запись, через которые доступны ограничения ресурсов и другие общие свойства cgroup.

source: Tasks (threads) versus processes
ru: Задачи (нити) и процессы
