Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Of course, processes pinned to a particular CPU can be left in a cpuset that disables I<sched_load_balance> as those processes aren't going anywhere else anyway.
ru: Конечно, процессы, прикреплённые к определённому ЦП, могут оставаться в процессорном наборе с выключенным I<sched_load_balance>, поскольку такие процессы никуда не переместятся в любом случае.

source: Scheduler relax domain level
ru: Степень ослабления домена планировщиком

source: The kernel scheduler performs immediate load balancing whenever a CPU becomes free or another task becomes runnable. This load balancing works to ensure that as many CPUs as possible are usefully employed running tasks. The kernel also performs periodic load balancing off the software clock described in B<time>(7). The setting of I<sched_relax_domain_level> applies only to immediate load balancing. Regardless of the I<sched_relax_domain_level> setting, periodic load balancing is attempted over all CPUs (unless disabled by turning off I<sched_load_balance>.) In any case, of course, tasks will be scheduled to run only on CPUs allowed by their cpuset, as modified by B<sched_setaffinity>(2) system calls.
ru: Планировщик ядра безотлагательно (immediate) выполняет балансировку нагрузки как только ЦП становится свободным или ещё одна задача становится выполняемой. Такая балансировка нагрузки работает чтобы гарантировать, что все возможные ЦП заняты полезной работой по выполнению задач. Также ядро выполняет периодическую балансировку нагрузки по программным часам, описанным в B<time>(7). Значение I<sched_relax_domain_level> применяется только к безотлагательной балансировке нагрузки. Независимо от значения I<sched_relax_domain_level> периодическая балансировка нагрузки пытается работать на всех ЦП (если она не выключена в I<sched_load_balance>). В любом случае, задачи будут запланированы к выполнению только на разрешённых ЦП в их процессорных наборах, которые настраиваются с помощью системных вызовов B<sched_setaffinity>(2).

source: On small systems, such as those with just a few CPUs, immediate load balancing is useful to improve system interactivity and to minimize wasteful idle CPU cycles. But on large systems, attempting immediate load balancing across a large number of CPUs can be more costly than it is worth, depending on the particular performance characteristics of the job mix and the hardware.
ru: В маленьких системах всего с несколькими ЦП безотлагательная балансировка нагрузки полезна для улучшения отзывчивости системы и минимизации циклов простоя ЦП. Но в больших системах, попытка безотлагательной балансировки нагрузки на большом количестве ЦП может оказаться более затратной чем нужно, в зависимости от определённых показателей производительности смеси заданий и аппаратных средств.

source: The exact meaning of the small integer values of I<sched_relax_domain_level> will depend on internal implementation details of the kernel scheduler code and on the non-uniform architecture of the hardware. Both of these will evolve over time and vary by system architecture and kernel version.
ru: Точные значения маленьких целых значений I<sched_relax_domain_level> будет зависеть от внутренней реализации кода планировщика ядра и неоднородности архитектуры аппаратных средств. Оба из них постоянно развиваются и различаются в разных версиях ядра и архитектурах системы.

source: As of this writing, when this capability was introduced in Linux 2.6.26, on certain popular architectures, the positive values of I<sched_relax_domain_level> have the following meanings.
ru: На момент написания когда это свойство появилось в Linux 2.6.26, на определённых популярных архитектурах положительные значения I<sched_relax_domain_level> были такими:

source: Perform immediate load balancing across Hyper-Thread siblings on the same core.
ru: Выполнять безотлагательную балансировку нагрузки на одноуровневых потоках Hyper-Thread одного ядра.

source: Perform immediate load balancing across other cores in the same package.
ru: Выполнять безотлагательную балансировку нагрузки на других ядрах того же пакета.

source: Perform immediate load balancing across other CPUs on the same node or blade.
ru: Выполнять безотлагательную балансировку нагрузки на других ЦП в том же узле или лезвии.

source: Perform immediate load balancing across over several (implementation detail) nodes [On NUMA systems].
ru: Выполнять безотлагательную балансировку нагрузки на нескольких (зависит от реализации) узлах (в системах с NUMA).

source: Perform immediate load balancing across over all CPUs in system [On NUMA systems].
ru: Выполнять безотлагательную балансировку нагрузки на всех ЦП системы (в системах с NUMA).

source: The I<sched_relax_domain_level> value of zero (0) always means don't perform immediate load balancing, hence that load balancing is done only periodically, not immediately when a CPU becomes available or another task becomes runnable.
ru: Значение I<sched_relax_domain_level> равное нулю (0) всегда означает отключение безотлагательной балансировки нагрузки, то есть балансировка нагрузки выполняется только периодически, а не сразу после того, как ЦП становится доступным или другая задача становится выполняемой.

source: The I<sched_relax_domain_level> value of minus one (-1) always means use the system default value. The system default value can vary by architecture and kernel version. This system default value can be changed by kernel boot-time "relax_domain_level=" argument.
ru: Значение I<sched_relax_domain_level> равное минус одному (-1) всегда означает использование системного значения по умолчанию. Системное значение по умолчанию может различаться на разных архитектурах и версиях ядра. Его можно изменить через аргумент команды загрузки ядра «relax_domain_level=».

source: In the case of multiple overlapping cpusets which have conflicting I<sched_relax_domain_level> values, then the highest such value applies to all CPUs in any of the overlapping cpusets. In such cases, the value B<minus one (-1)> is the lowest value, overridden by any other value, and the value B<zero (0)> is the next lowest value.
ru: При наличии нескольких перекрывающихся процессорных наборов, которые имеют конфликтующие значения I<sched_relax_domain_level>, во всех перекрывающихся процессорных наборах на всех ЦП применяется самое большое значение. В таких случаях значение B<минус один (-1)> считается самым маленьким, заменяется любым значением, а значение B<ноль (0)> является следующим самым маленьким значением.

source: FORMATS
ru: ФОРМАТЫ

source: The following formats are used to represent sets of CPUs and memory nodes.
ru: Для представления наборов ЦП и узлов памяти используются следующие форматы:

source: Mask format
ru: В виде маски

source: The B<Mask Format> is used to represent CPU and memory-node bit masks in the I</proc/E<lt>pidE<gt>/status> file.
ru: Формат B<в виде маски> используется для представления ЦП и узлов памяти в виде маски битов в файле I</proc/E<lt>pidE<gt>/status>.

source: This format displays each 32-bit word in hexadecimal (using ASCII characters "0" - "9" and "a" - "f"); words are filled with leading zeros, if required. For masks longer than one word, a comma separator is used between words. Words are displayed in big-endian order, which has the most significant bit first. The hex digits within a word are also in big-endian order.
ru: Данный формат отображает каждое 32-битное слово в шестнадцатеричной форме (используя символы ASCII «0»-«9» и «a»-«f»); если нужно, слова дополняются ведущими нулями. Для масок длиннее слова между словами используется разделитель запятая. Слова отображаются в порядке от старшего к младшему, то есть первым стоит самый значимый бит. Шестнадцатеричные цифры в слове также расположены в порядке от старшего к младшему.

source: The number of 32-bit words displayed is the minimum number needed to display all bits of the bit mask, based on the size of the bit mask.
ru: Минимальное количество отображаемых 32-битных слов подбирается таким образом, чтобы вместить все биты маски, то есть зависит от размера битовой маски.

source: Examples of the B<Mask Format>:
ru: Примеры формата в B<виде маски>:

source: 00000001 # just bit 0 set 40000000,00000000,00000000 # just bit 94 set 00000001,00000000,00000000 # just bit 64 set 000000ff,00000000 # bits 32-39 set 00000000,000e3862 # 1,5,6,11-13,17-19 set
ru: 00000001 # установлен только бит 0 40000000,00000000,00000000 # установлен только бит 94 00000001,00000000,00000000 # установлен только бит 64 000000ff,00000000 # установлены биты 32-39 00000000,000e3862 # установлены 1,5,6,11-13,17-19

source: A mask with bits 0, 1, 2, 4, 8, 16, 32, and 64 set displays as:
ru: Маска с установленными битами 0, 1, 2, 4, 8, 16, 32 и 64 выглядит так:

source: The first "1" is for bit 64, the second for bit 32, the third for bit 16, the fourth for bit 8, the fifth for bit 4, and the "7" is for bits 2, 1, and 0.
ru: Первая «1» для бита 64, вторая — для бита 32, третья — для 16, четвёртая — для 8, пятая — для 4 и «7» — для битов 2, 1 и 0.

source: List format
ru: В виде списка

source: The B<List Format> for I<cpus> and I<mems> is a comma-separated list of CPU or memory-node numbers and ranges of numbers, in ASCII decimal.
ru: Формат в B<виде списка> — это список десятичных ASCII значений I<cpus> и I<mems> через запятую для перечисления номеров (и диапазонов) всех ЦП или узлов памяти.

source: Examples of the B<List Format>:
ru: Примеры формата в B<виде списка>:

source: 0-4,9 # bits 0, 1, 2, 3, 4, and 9 set 0-2,7,12-14 # bits 0, 1, 2, 7, 12, 13, and 14 set
ru: 0-4,9 # установлены биты 0, 1, 2, 3, 4 и 9 0-2,7,12-14 # установлены биты 0, 1, 2, 7, 12, 13 и 14

source: RULES
ru: ПРАВИЛА

source: The following rules apply to each cpuset:
ru: К каждому процессорному набору применяются следующие правила:

source: Its CPUs and memory nodes must be a (possibly equal) subset of its parent's.
ru: ЦП и узлы памяти должны быть поднабором (возможно, одинаковым) своего предка.

source: It can be marked I<cpu_exclusive> only if its parent is.
ru: Набор может быть помечен как I<cpu_exclusive> только, если и его предок тоже помечен.

source: It can be marked I<mem_exclusive> only if its parent is.
ru: Набор может быть помечен как I<mem_exclusive> только, если и его предок тоже помечен.

source: If it is I<cpu_exclusive>, its CPUs may not overlap any sibling.
ru: Если установлен I<cpu_exclusive>, то ЦП набора не могут перекрываться с любым одноранговым процессорным набором.

source: If it is I<memory_exclusive>, its memory nodes may not overlap any sibling.
ru: Если установлен I<mem_exclusive>, то узлы памяти набора не могут перекрываться с любым одноранговым процессорным набором.

source: PERMISSIONS
ru: ПРАВА ДОСТУПА

source: The permissions of a cpuset are determined by the permissions of the directories and pseudo-files in the cpuset filesystem, normally mounted at I</dev/cpuset>.
ru: Права на процессорный набор определяются правами доступа к каталогам и псевдо-файлам в файловой системе процессорного набора, обычно смонтированной в I</dev/cpuset>.

source: For instance, a process can put itself in some other cpuset (than its current one) if it can write the I<tasks> file for that cpuset. This requires execute permission on the encompassing directories and write permission on the I<tasks> file.
ru: Например, процесс может поместить себя в другой процессорный набор (отличный от текущего), если сможет выполнить запись в файл I<tasks> другого процессорного набора. Для этого требуется право на выполнение для окружающих каталогов и право на запись в файл I<tasks>.

source: An additional constraint is applied to requests to place some other process in a cpuset. One process may not attach another to a cpuset unless it would have permission to send that process a signal (see B<kill>(2)).
ru: Дополнительное ограничение устанавливается на запросы размещения другого процесса в процессорный набор. Один процесс не может прикрепить другой к процессорному набору, если не имеет право отправки этому процессу сигнала (смотрите B<kill>(2)).

source: A process may create a child cpuset if it can access and write the parent cpuset directory. It can modify the CPUs or memory nodes in a cpuset if it can access that cpuset's directory (execute permissions on the each of the parent directories) and write the corresponding I<cpus> or I<mems> file.
ru: Процесс может создать потомка процессорного набора, если у него есть доступ и право на запись в родительский каталог процессорного набора. Он может изменить ЦП или узлы памяти в процессорном наборе, если у него есть доступ к каталогу этого процессорного набора (право на выполнение на каждый родительский каталог) и право на запись в соответствующий файл I<cpus> или I<mems>.

source: There is one minor difference between the manner in which these permissions are evaluated and the manner in which normal filesystem operation permissions are evaluated. The kernel interprets relative pathnames starting at a process's current working directory. Even if one is operating on a cpuset file, relative pathnames are interpreted relative to the process's current working directory, not relative to the process's current cpuset. The only ways that cpuset paths relative to a process's current cpuset can be used are if either the process's current working directory is its cpuset (it first did a B<cd> or B<chdir>(2) to its cpuset directory beneath I</dev/cpuset>, which is a bit unusual) or if some user code converts the relative cpuset path to a full filesystem path.
ru: Есть незначительное отличие между тем, как эти права вычисляются здесь и при обычных операциях в файловой системе. Ядро интерпретирует относительные пути, начиная с текущего рабочего каталога процесса. Даже если он работает с файлом процессорного набора, относительные пути интерпретируются относительно текущего рабочего каталога процесса, а не относительно текущего процессорного набора процесса. Единственные способы, в которых могут использоваться пути процессорного набора относительно текущего процессорного набора процесса это когда текущий рабочий каталог процесса совпадает с его каталогом процессорного набора (сначала выполняется B<cd> или B<chdir>(2) в каталог его процессорного набора в I</dev/cpuset>, что немного необычно) или если некий код пользователя преобразует относительный путь процессорного набора в полный путь в файловой системе.

source: In theory, this means that user code should specify cpusets using absolute pathnames, which requires knowing the mount point of the cpuset filesystem (usually, but not necessarily, I</dev/cpuset>). In practice, all user level code that this author is aware of simply assumes that if the cpuset filesystem is mounted, then it is mounted at I</dev/cpuset>. Furthermore, it is common practice for carefully written user code to verify the presence of the pseudo-file I</dev/cpuset/tasks> in order to verify that the cpuset pseudo-filesystem is currently mounted.
ru: В теории это означает, то код пользователя должен задавать процессорные наборы с помощью абсолютных путей, для чего требуется знать точку монтирования файловой системы процессорного набора (обычно, но необязательно, I</dev/cpuset>). На практике, автор кода уровня пользователя делает простое предположение, что если файловая система процессорного набора монтируется, то в I</dev/cpuset>. Кроме этого в порядке вещей при написании корректного пользовательского кода выполняется проверка наличия псевдо-файла I</dev/cpuset/tasks>, чтобы убедиться, что файловая система процессорного набора смонтирована.

source: WARNINGS
ru: ПРЕДУПРЕЖДЕНИЯ

source: Enabling memory_pressure
ru: Включение memory_pressure

source: By default, the per-cpuset file I<cpuset.memory_pressure> always contains zero (0). Unless this feature is enabled by writing "1" to the pseudo-file I</dev/cpuset/cpuset.memory_pressure_enabled>, the kernel does not compute per-cpuset I<memory_pressure>.
ru: По умолчанию, индивидуальный файл I<cpuset.memory_pressure> всегда содержит ноль (0). Если это свойство не включить записью «1» в псевдо-файл I</dev/cpuset/cpuset.memory_pressure_enabled>, то ядро не вычисляет индивидуальное значение I<memory_pressure>.

source: Using the echo command
ru: Использование команды echo

source: When using the B<echo> command at the shell prompt to change the values of cpuset files, beware that the built-in B<echo> command in some shells does not display an error message if the B<write>(2) system call fails. For example, if the command:
ru: При использовании команды B<echo> в оболочке командной строки для изменения значений файлов процессорного набора остерегайтесь встроенной в некоторые оболочки команды B<echo>; она не отображает сообщение об ошибке системного вызова B<write>(2). Например, если команда:

source: failed because memory node 19 was not allowed (perhaps the current system does not have a memory node 19), then the B<echo> command might not display any error. It is better to use the B</bin/echo> external command to change cpuset file settings, as this command will display B<write>(2) errors, as in the example:
ru: завершится с ошибкой из-за того, что узел памяти 19 не разрешён (возможно, текущая система не имеет узла памяти 19), то команда B<echo> может не выдать ошибки. Для изменения настроек файла процессорного набора лучше использовать внешнюю команду B</bin/echo> , так как она выводит ошибки B<write>(2), например:

source: EXCEPTIONS
ru: ИСКЛЮЧЕНИЯ

source: Memory placement
ru: Размещение в памяти

source: Not all allocations of system memory are constrained by cpusets, for the following reasons.
ru: Не каждое выделение системной памяти ограничивается процессорным набором по следующим причинам:

source: If hot-plug functionality is used to remove all the CPUs that are currently assigned to a cpuset, then the kernel will automatically update the I<cpus_allowed> of all processes attached to CPUs in that cpuset to allow all CPUs. When memory hot-plug functionality for removing memory nodes is available, a similar exception is expected to apply there as well. In general, the kernel prefers to violate cpuset placement, rather than starving a process that has had all its allowed CPUs or memory nodes taken offline. User code should reconfigure cpusets to refer only to online CPUs and memory nodes when using hot-plug to add or remove such resources.
ru: Если используется возможность горячего удаления всех ЦП, которые в настоящее время назначены в процессорный набор, то ядро автоматически обновит I<cpus_allowed> у всех процессов, подключённых к ЦП в этом процессорном наборе, позволяя все ЦП. Когда доступна возможность горячего удаления узлов памяти, то подобное исключение применяется и для них. В общем, ядро предпочитает нарушить размещения процессорного набора, а не дать голодать процессу, у которого все доступные ЦП или узлы памяти выключились. Пользовательский код должен перенастроить процессорные наборы, чтобы ссылаться только на включённые ЦП и узлы памяти, когда используется горячее подключение или удаление этих ресурсов.

source: A few kernel-critical, internal memory-allocation requests, marked GFP_ATOMIC, must be satisfied immediately. The kernel may drop some request or malfunction if one of these allocations fail. If such a request cannot be satisfied within the current process's cpuset, then we relax the cpuset, and look for memory anywhere we can find it. It's better to violate the cpuset than stress the kernel.
ru: Некоторые критичные для ядра запросы на выделение внутренней памяти, помеченные GFP_ATOMIC, должны быть выполнены немедленно. Ядро может отбросить какой-нибудь запрос или сломается, если одно из таких выделений завершится с ошибкой. Если такой запрос не может быть выполнен в текущем процессорном наборе процесса, то мы ослабляем требования процессорного набора, и ищем память где сможем найти. Лучше нарушить указания процессорного набора, чем испортить ядро.

source: Allocations of memory requested by kernel drivers while processing an interrupt lack any relevant process context, and are not confined by cpusets.
ru: Выделения памяти, запрашиваемые драйверами ядра при обработке прерывания, не относятся к контексту процесса и не ограничиваются процессорными наборами.

source: Renaming cpusets
ru: Переименование процессорных наборов

source: You can use the B<rename>(2) system call to rename cpusets. Only simple renaming is supported; that is, changing the name of a cpuset directory is permitted, but moving a directory into a different directory is not permitted.
ru: Для переименования процессорных наборов можно использовать системный вызов B<rename>(2). Поддерживается только простое переименование; то есть разрешено изменение имени каталога процессорного набора — переместить каталог в другой каталог нельзя.

source: ERRORS
ru: ОШИБКИ

source: The Linux kernel implementation of cpusets sets I<errno> to specify the reason for a failed system call affecting cpusets.
ru: Реализация процессорных наборов в ядре Linux изменяет I<errno> для указания причины ошибки системного вызова при работе с процессорными наборами.

source: The possible I<errno> settings and their meaning when set on a failed cpuset call are as listed below.
ru: Возможные значения I<errno> и их смысл при ошибках, возникающих при работе с процессорным набором:

source: Attempted a B<write>(2) on a special cpuset file with a length larger than some kernel-determined upper limit on the length of such writes.
ru: Попытка B<write>(2) записать в специальный файл процессорного набора с длиной, превышающей установленное ядром ограничение на длину таких записей.

source: Attempted to B<write>(2) the process ID (PID) of a process to a cpuset I<tasks> file when one lacks permission to move that process.
ru: Попытка B<write>(2) записать ID (PID) процесса в файл процессорного набора I<tasks> при нехватке прав для перемещения этого процесса.

source: Attempted to add, using B<write>(2), a CPU or memory node to a cpuset, when that CPU or memory node was not already in its parent.
ru: Попытка добавить, с помощью B<write>(2), ЦП или узел памяти в процессорный набор, когда этот ЦП или узел памяти отсутствует в его родителе.

source: Attempted to set, using B<write>(2), I<cpuset.cpu_exclusive> or I<cpuset.mem_exclusive> on a cpuset whose parent lacks the same setting.
ru: Попытка назначить, с помощью B<write>(2), задать I<cpuset.cpu_exclusive> или I<cpuset.mem_exclusive> для процессорного набора, чей родитель не имеет таких флагов.

source: Attempted to B<write>(2) a I<cpuset.memory_pressure> file.
ru: Попытка B<write>(2) записать в файл I<cpuset.memory_pressure>.

source: Attempted to create a file in a cpuset directory.
ru: Попытка создать файл в каталоге процессорного набора.

source: Attempted to remove, using B<rmdir>(2), a cpuset with attached processes.
ru: Попытка удалить, с помощь B<rmdir>(2), процессорный набор с прикреплёнными процессами.

source: Attempted to remove, using B<rmdir>(2), a cpuset with child cpusets.
ru: Попытка удалить, с помощь B<rmdir>(2), процессорный набор с дочерними процессорными наборами.

source: Attempted to remove a CPU or memory node from a cpuset that is also in a child of that cpuset.
ru: Попытка удалить ЦП или узел памяти из процессорного набора, который также есть в потомке этого процессорного набора.

source: Attempted to create, using B<mkdir>(2), a cpuset that already exists.
ru: Попытка создать, с помощью B<mkdir>(2), процессорный набор, который уже существует.

source: Attempted to B<rename>(2) a cpuset to a name that already exists.
ru: Попытка B<rename>(2) задать процессорному набору имя, которое уже существует.
