Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Attempted to B<read>(2) or B<write>(2) a cpuset file using a buffer that is outside the writing processes accessible address space.
ru: Попытка B<read>(2) прочитать или B<write>(2) записать в файл процессорного набора используя буфер, который расположен вне доступного адресного пространства записи процесса.

source: Attempted to change a cpuset, using B<write>(2), in a way that would violate a I<cpu_exclusive> or I<mem_exclusive> attribute of that cpuset or any of its siblings.
ru: Попытка изменить процессорный набор с помощью B<write>(2) способом, который нарушает флаг I<cpu_exclusive> или I<mem_exclusive> этого процессорного набора или его одноуровневого собрата.

source: Attempted to B<write>(2) an empty I<cpuset.cpus> or I<cpuset.mems> list to a cpuset which has attached processes or child cpusets.
ru: Попытка B<write>(2) записать пустой список I<cpuset.cpus> или I<cpuset.mems> в процессорный набор, к которому прикреплёны процессы или дочерние процессорные наборы.

source: Attempted to B<write>(2) a I<cpuset.cpus> or I<cpuset.mems> list which included a range with the second number smaller than the first number.
ru: Попытка B<write>(2) записать список I<cpuset.cpus> или I<cpuset.mems>, который включает диапазон со вторым числом, меньшим первого числа.

source: Attempted to B<write>(2) a I<cpuset.cpus> or I<cpuset.mems> list which included an invalid character in the string.
ru: Попытка B<write>(2) записать список I<cpuset.cpus> или I<cpuset.mems>, который содержит некорректный символ в строке.

source: Attempted to B<write>(2) a list to a I<cpuset.cpus> file that did not include any online CPUs.
ru: Попытка B<write>(2) записать список в файл I<cpuset.cpus>, в котором нет ни одного работающего ЦП.

source: Attempted to B<write>(2) a list to a I<cpuset.mems> file that did not include any online memory nodes.
ru: Попытка B<write>(2) записать список в файл I<cpuset.mems>, в котором нет ни одного работающего узла памяти.

source: Attempted to B<write>(2) a list to a I<cpuset.mems> file that included a node that held no memory.
ru: Попытка B<write>(2) записать список в файл I<cpuset.mems>, в котором есть узел без памяти.

source: Attempted to B<write>(2) a string to a cpuset I<tasks> file that does not begin with an ASCII decimal integer.
ru: Попытка B<write>(2) записать строку в файл I<tasks> процессорного набора, которая не начинается с десятичного числа ASCII.

source: Attempted to B<rename>(2) a cpuset into a different directory.
ru: Попытка B<rename>(2) переименовать процессорный набор в другой каталог.

source: Attempted to B<read>(2) a I</proc/E<lt>pidE<gt>/cpuset> file for a cpuset path that is longer than the kernel page size.
ru: Попытка B<read>(2) прочитать из файла I</proc/E<lt>pidE<gt>/cpuset> путь процессорного набора, который больше размера страницы ядра.

source: Attempted to create, using B<mkdir>(2), a cpuset whose base directory name is longer than 255 characters.
ru: Попытка создать с помощью B<mkdir>(2) процессорный набор, имя базового каталога которого длиннее 255 символов.

source: Attempted to create, using B<mkdir>(2), a cpuset whose full pathname, including the mount point (typically "/dev/cpuset/") prefix, is longer than 4095 characters.
ru: Попытка создать с помощью B<mkdir>(2) процессорный набор, полное имя которого, включая префикс точки монтирования (обычно «/dev/cpuset/»), длиннее 4095 символов.

source: The cpuset was removed by another process at the same time as a B<write>(2) was attempted on one of the pseudo-files in the cpuset directory.
ru: Процессорный набор был удалён другим процессом одновременно с тем, когда была попытка B<write>(2) записать в один из псевдо-файлов в каталоге процессорного набора.

source: Attempted to create, using B<mkdir>(2), a cpuset in a parent cpuset that doesn't exist.
ru: Попытка создать с помощью B<mkdir>(2) процессорный набор, родителя которого не существует.

source: Attempted to B<access>(2) or B<open>(2) a nonexistent file in a cpuset directory.
ru: Попытка выполнить B<access>(2) или B<open>(2) для несуществующего файла в каталоге процессорного набора.

source: Insufficient memory is available within the kernel; can occur on a variety of system calls affecting cpusets, but only if the system is extremely short of memory.
ru: В ядре недостаточно памяти; может возникать при различных системных вызовах для работы с процессорным набором, но только если в системе очень мало памяти.

source: Attempted to B<write>(2) the process ID (PID) of a process to a cpuset I<tasks> file when the cpuset had an empty I<cpuset.cpus> or empty I<cpuset.mems> setting.
ru: Попытка B<write>(2) записать ID (PID) процесса в файл процессорного набора I<tasks>, когда у процессорного набора пустое значение в I<cpuset.cpus> или I<cpuset.mems>.

source: Attempted to B<write>(2) an empty I<cpuset.cpus> or I<cpuset.mems> setting to a cpuset that has tasks attached.
ru: Попытка B<write>(2) записать пустое значение в I<cpuset.cpus> или I<cpuset.mems>процессорного набора, у которого есть прикреплённые задачи.

source: Attempted to B<rename>(2) a nonexistent cpuset.
ru: Попытка B<rename>(2) переименовать несуществующий процессорный набор.

source: Attempted to remove a file from a cpuset directory.
ru: Попытка удалить файл из каталога процессорного набора.

source: Specified a I<cpuset.cpus> or I<cpuset.mems> list to the kernel which included a number too large for the kernel to set in its bit masks.
ru: Указанный список I<cpuset.cpus> или I<cpuset.mems> в ядре, который содержит слишком большое число для ядра, чтобы задать его битовой маской.

source: Attempted to B<write>(2) the process ID (PID) of a nonexistent process to a cpuset I<tasks> file.
ru: Попытка B<write>(2) записать ID (PID) процесса несуществующего процесса в файл процессорного набора I<tasks>.

source: VERSIONS
ru: ВЕРСИИ

source: Cpusets appeared in version 2.6.12 of the Linux kernel.
ru: Свойство процессорного набора появилось в ядре Linux версии 2.6.12.

source: Despite its name, the I<pid> parameter is actually a thread ID, and each thread in a threaded group can be attached to a different cpuset. The value returned from a call to B<gettid>(2) can be passed in the argument I<pid>.
ru: Несмотря на имя, параметр I<pid> в действительности является ID нити, и каждая нить группы нитей может быть прикреплена к различным процессорным наборам. В аргументе I<pid> может передаваться значение, возвращаемое вызовом B<gettid>(2).

source: I<cpuset.memory_pressure> cpuset files can be opened for writing, creation, or truncation, but then the B<write>(2) fails with I<errno> set to B<EACCES>, and the creation and truncation options on B<open>(2) have no effect.
ru: Файлы I<cpuset.memory_pressure> процессорного набора можно открывать для записи, создания и обрезания, но после этого B<write>(2) завершается с ошибкой I<errno>, равной B<EACCES>, и параметры создания и обрезания в B<open>(2) не учитываются.

source: EXAMPLE
ru: ПРИМЕР

source: The following examples demonstrate querying and setting cpuset options using shell commands.
ru: В следующих примерах показано получения и установка параметров процессорного набора с помощью команд оболочки.

source: Creating and attaching to a cpuset.
ru: Создание и прикрепление к процессорному набору.

source: To create a new cpuset and attach the current command shell to it, the steps are:
ru: Для создания нового процессорного набора и прикрепления текущей оболочки команд к нему выполняются следующие шаги:

source: mkdir /dev/cpuset (if not already done)
ru: mkdir /dev/cpuset (если уже не сделано)

source: mount -t cpuset none /dev/cpuset (if not already done)
ru: mount -t cpuset none /dev/cpuset (если уже не сделано)

source: Create the new cpuset using B<mkdir>(1).
ru: Создание нового процессорного набора с помощью B<mkdir>(1).

source: Assign CPUs and memory nodes to the new cpuset.
ru: Назначение ЦП и узлов памяти новому процессорному набору.

source: Attach the shell to the new cpuset.
ru: Прикрепление оболочки к новому процессорному набору.

source: For example, the following sequence of commands will set up a cpuset named "Charlie", containing just CPUs 2 and 3, and memory node 1, and then attach the current shell to that cpuset.
ru: Например, следующая последовательность команд создаёт новый процессорный набор с именем «Charlie», содержащий только ЦП 2 и 3, и узел памяти 1, а затем прикрепляет к этому процессорному набору текущую оболочку.

source: $B< mkdir /dev/cpuset> $B< mount -t cpuset cpuset /dev/cpuset> $B< cd /dev/cpuset> $B< mkdir Charlie> $B< cd Charlie> $B< /bin/echo 2-3 E<gt> cpuset.cpus> $B< /bin/echo 1 E<gt> cpuset.mems> $B< /bin/echo $$ E<gt> tasks> # The current shell is now running in cpuset Charlie # The next line should display '/Charlie' $B< cat /proc/self/cpuset>
ru: $B< mkdir /dev/cpuset> $B< mount -t cpuset cpuset /dev/cpuset> $B< cd /dev/cpuset> $B< mkdir Charlie> $B< cd Charlie> $B< /bin/echo 2-3 E<gt> cpuset.cpus> $B< /bin/echo 1 E<gt> cpuset.mems> $B< /bin/echo $$ E<gt> tasks> # Текущая оболочка теперь работает в процессорном наборе Charlie # Следующая строка должна вывести /Charlie $B< cat /proc/self/cpuset>

source: Migrating a job to different memory nodes.
ru: Перенос задания в другие узлы памяти.

source: To migrate a job (the set of processes attached to a cpuset) to different CPUs and memory nodes in the system, including moving the memory pages currently allocated to that job, perform the following steps.
ru: Чтобы перенести задание (набор процессов, присоединённых к процессорному набору) на другие ЦП и узлы памяти в системе, включая перемещение страниц памяти, выделенных под это задание, выполните следующие шаги:

source: Let's say we want to move the job in cpuset I<alpha> (CPUs 4\(en7 and memory nodes 2\(en3) to a new cpuset I<beta> (CPUs 16\(en19 and memory nodes 8\(en9).
ru: Предположим, мы хотим перенести задание из процессорного набора I<alpha> (ЦП 4-\(en7 узлы памяти 2\(en3) в новый процессорный набор I<beta> (ЦП 16-\(en19 и узлы памяти 8\(en9).

source: First create the new cpuset I<beta>.
ru: Сначала создадим новый процессорный набор I<beta>.

source: Then allow CPUs 16\(en19 and memory nodes 8\(en9 in I<beta>.
ru: Затем включим ЦП 16\(en19 и узлы памяти 8\(en9 в I<beta>.

source: Then enable I<memory_migration> in I<beta>.
ru: Затем включим флаг I<memory_migration> в I<beta>.

source: Then move each process from I<alpha> to I<beta>.
ru: Затем переместим каждый процесс из I<alpha> в I<beta>.

source: The following sequence of commands accomplishes this.
ru: Всё это выполняет следующая последовательность команд:

source: The above should move any processes in I<alpha> to I<beta>, and any memory held by these processes on memory nodes 2\(en3 to memory nodes 8\(en9, respectively.
ru: Команды выше должны переместить все процессы из I<alpha> в I<beta>, и всю память этих процессов с узлов памяти 2\(en3 на узлы памяти 8\(en9, соответственно.

source: Notice that the last step of the above sequence did not do:
ru: Заметим, что последний шаг не сделан как:

source: The I<while> loop, rather than the seemingly easier use of the B<cp>(1) command, was necessary because only one process PID at a time may be written to the I<tasks> file.
ru: Цикл I<while>, а не гораздо более простая команда B<cp>(1), необходим, так как только один PID процесса за раз записывается в файл I<tasks>.

source: The same effect (writing one PID at a time) as the I<while> loop can be accomplished more efficiently, in fewer keystrokes and in syntax that works on any shell, but alas more obscurely, by using the B<-u> (unbuffered) option of B<sed>(1):
ru: Того же (запись одного PID за раз) как в цикле I<while> можно достичь более эффективно несколькими командами и с синтаксисом, который доступен в любой оболочке, но выглядит непонятно: используя параметр B<-u> (не буферизировать) в B<sed>(1):

source: I<Documentation/cgroup-v1/cpusets.txt> in the Linux kernel source tree (or I<Documentation/cpusets.txt> before Linux 2.6.29)
ru: Файл I<Documentation/cgroup-v1/cpusets.txt> из дерева исходного кода ядра Linux (или I<Documentation/cpusets.txt> до Linux 2.6.29)

source: complex - basics of complex mathematics
ru: complex - основы комплексной математики

source: Complex numbers are numbers of the form z = a+b*i, where a and b are real numbers and i = sqrt(-1), so that i*i = -1.
ru: Комплексные числа — это числа вида z = a+b*i, где a и b являются вещественными числами, и i = sqrt(-1), где i*i = -1.

source: There are other ways to represent that number. The pair (a,b) of real numbers may be viewed as a point in the plane, given by X- and Y-coordinates. This same point may also be described by giving the pair of real numbers (r,phi), where r is the distance to the origin O, and phi the angle between the X-axis and the line Oz. Now z = r*exp(i*phi) = r*(cos(phi)+i*sin(phi)).
ru: Существуют и другие способы представления комплексных чисел. Пара вещественных чисел (a,b) может быть представлена как точка на плоскости, которая задаётся координатными осями X и Y. Эта же самая точка может быть также описана парой вещественных чисел (r,phi), где r — это расстояние от нулевой точки отсчёта 0, а phi — угол между осью X и прямой 0z. Итак, z = r*exp(i*phi) = r*(cos(phi)+i*sin(phi)).

source: The basic operations are defined on z = a+b*i and w = c+d*i as:
ru: Основные операции с комплексными числами, заданными в виде z = a+b*i и w = c+d*i, следующие:

source: B<addition: z+w = (a+c) + (b+d)*i>
ru: B<сложение: z+w = (a+c) + (b+d)*i>

source: B<multiplication: z*w = (a*c - b*d) + (a*d + b*c)*i>
ru: B<умножение: z*w = (a*c - b*d) + (a*d + b*c)*i>

source: B<division: z/w = ((a*c + b*d)/(c*c + d*d)) + ((b*c - a*d)/(c*c + d*d))*i>
ru: B<деление: z/w = ((a*c + b*d)/(c*c + d*d)) + ((b*c - a*d)/(c*c + d*d))*i>

source: Nearly all math function have a complex counterpart but there are some complex-only functions.
ru: Почти все математические функции имеют своих комплексных собратьев, но есть и только комплексные функции.

source: Your C-compiler can work with complex numbers if it supports the C99 standard. Link with I<-lm>. The imaginary unit is represented by I.
ru: Ваш C-компилятор может работать с комплексными числами, если он поддерживает стандарт C99. Компоновку программы нужно производить с параметром -lm. Здесь мнимая единица представлена как I.

source: /* check that exp(i * pi) == -1 */ #include E<lt>math.hE<gt> /* for atan */ #include E<lt>stdio.hE<gt> #include E<lt>complex.hE<gt>
ru: /* проверка что exp(i * pi) == -1 */ #include E<lt>math.hE<gt> /* для atan */ #include E<lt>stdio.hE<gt> #include E<lt>complex.hE<gt>

source: cp1251 - CP\ 1251 character set encoded in octal, decimal, and hexadecimal
ru: cp1251 - набор символов CP\ 1251 в восьмеричном, десятичном и шестнадцатеричном виде

source: The Windows Code Pages include several 8-bit extensions to the ASCII character set (also known as ISO 646-IRV). CP\ 1251 encodes the characters used in Cyrillic scripts.
ru: В страницы кодов Windows включены некоторые 8-битные расширения набора символов ASCII (также известного как ISO 646-IRV). В CP\ 1251 кодируются символы, используемые в кириллических письменностях.

source: CP\ 1251 characters
ru: Символы CP\ 1251

source: The following table displays the characters in CP\ 1251 that are printable and unlisted in the B<ascii>(7) manual page.
ru: В следующей таблице показаны символы из набора CP\ 1251, являющиеся печатными и отсутствующие в справочной странице B<ascii>(7).

source: Oct
ru: Вос

source: Dec
ru: Дес

source: Hex
ru: Шес

source: Char
ru: Симв

source: Description
ru: Описание

source: CYRILLIC CAPITAL LETTER DJE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «ДЕРВЬ»

source: CYRILLIC CAPITAL LETTER GJE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «ГЕ»

source: SINGLE LOW-9 QUOTATION MARK
ru: ОДИНОЧНАЯ LOW-9/НИЖНЯЯ КАВЫЧКА

source: CYRILLIC SMALL LETTER GJE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ГЕ»

source: DOUBLE LOW-9 QUOTATION MARK
ru: ДВОЙНАЯ LOW-9/НИЖНЯЯ КАВЫЧКА

source: HORIZONTAL ELLIPSIS
ru: ГОРИЗОНТАЛЬНЫЙ ЭЛЛИПС

source: DAGGER
ru: ТИПОГРАФСКИЙ КРЕСТИК

source: DOUBLE DAGGER
ru: ДВОЙНОЙ КРЕСТИК

source: EURO SIGN
ru: ЗНАК ЕВРО

source: PER MILLE SIGN
ru: ЗНАК ПРОМИЛЛЕ

source: CYRILLIC CAPITAL LETTER LJE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «ЛЬ»

source: SINGLE LEFT-POINTING ANGLE QUOTATION MARK
ru: ОДИНОЧНАЯ ОТКРЫВАЮЩАЯ УГЛОВАЯ КАВЫЧКА

source: CYRILLIC CAPITAL LETTER NJE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «НЬ»

source: CYRILLIC CAPITAL LETTER KJE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «КЭ»

source: CYRILLIC CAPITAL LETTER TSHE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «ГЕРВЬ»

source: CYRILLIC CAPITAL LETTER DZHE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «ДЖЕ»

source: CYRILLIC SMALL LETTER DJE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ДЬЖЕ»

source: LEFT SINGLE QUOTATION MARK
ru: ОТКРЫВАЮЩАЯ ОДИНАРНАЯ КАВЫЧКА

source: RIGHT SINGLE QUOTATION MARK
ru: ЗАКРЫВАЮЩАЯ ОДИНАРНАЯ КАВЫЧКА

source: LEFT DOUBLE QUOTATION MARK
ru: ОТКРЫВАЮЩАЯ ДВОЙНАЯ КАВЫЧКА

source: RIGHT DOUBLE QUOTATION MARK
ru: ЗАКРЫВАЮЩАЯ ДВОЙНАЯ КАВЫЧКА

source: BULLET
ru: МЕТКА В ЦЕНТРЕ

source: EN DASH
ru: СРЕДНЕЕ ТИРЕ

source: EM DASH
ru: ДЛИННОЕ ТИРЕ

source: UNDEFINED
ru: НЕ ОПРЕДЕЛЕНО

source: TRADE MARK SIGN
ru: ЗНАК ТОРГОВОЙ МАРКИ

source: CYRILLIC SMALL LETTER LJE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ЛЬ»

source: SINGLE RIGHT-POINTING ANGLE QUOTATION MARK
ru: ОДИНОЧНАЯ ЗАКРЫВАЮЩАЯ УГЛОВАЯ КАВЫЧКА

source: CYRILLIC SMALL LETTER NJE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «НЬ»

source: CYRILLIC SMALL LETTER KJE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «КЭ»

source: CYRILLIC SMALL LETTER TSHE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ГЕРВЬ»

source: CYRILLIC SMALL LETTER DZHE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ДЖЕ»

source: NO-BREAK SPACE
ru: НЕРАЗРЫВНЫЙ ПРОБЕЛ

source: CYRILLIC CAPITAL LETTER SHORT U
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА КРАТКАЯ «У»

source: CYRILLIC SMALL LETTER SHORT U
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА КРАТКАЯ «У»

source: CYRILLIC CAPITAL LETTER JE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «ЙЕ»

source: CURRENCY SIGN
ru: СИМВОЛ ВАЛЮТЫ

source: CYRILLIC CAPITAL LETTER GHE WITH UPTURN
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Г» С ПОДЪЁМОМ

source: BROKEN BAR
ru: ПРЕРЫВИСТАЯ ВЕРТИКАЛЬНАЯ ЧЕРТА

source: SECTION SIGN
ru: СИМВОЛ ПАРАГРАФА

source: CYRILLIC CAPITAL LETTER IO
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ё»

source: COPYRIGHT SIGN
ru: ЗНАК ОХРАНЫ АВТОРСКОГО ПРАВА

source: CYRILLIC CAPITAL LETTER UKRAINIAN IE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ УКРАИНСКАЯ БУКВА ЯКОРНОЕ «Е»

source: LEFT-POINTING DOUBLE ANGLE QUOTATION MARK
ru: ОТКРЫВАЮЩАЯ ЛЕВАЯ КАВЫЧКА «ЁЛОЧКА»

source: NOT SIGN
ru: ЗНАК ОТРИЦАНИЯ

source: SOFT HYPHEN
ru: МЯГКИЙ ПЕРЕНОС

source: REGISTERED SIGN
ru: ЗАРЕГИСТРИРОВАННЫЙ ТОВАРНЫЙ ЗНАК

source: CYRILLIC CAPITAL LETTER YI
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА ЙИ

source: DEGREE SIGN
ru: ЗНАК ГРАДУСА

source: PLUS-MINUS SIGN
ru: ЗНАК ПЛЮС-МИНУС

source: CYRILLIC CAPITAL LETTER
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА

source: BYELORUSSIAN-UKRAINIAN I
ru: БЕЛОРУССКО-УКРАИНСКАЯ «И»

source: CYRILLIC SMALL LETTER BYELORUSSIAN-UKRAINIAN I
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА БЕЛОРУССКО-УКРАИНСКАЯ «И»

source: CYRILLIC SMALL LETTER GHE WITH UPTURN
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ГЕ» С ПОДЪЁМОМ

source: MICRO SIGN
ru: ЗНАК МИКРО

source: PILCROW SIGN
ru: ЗНАК АБЗАЦА

source: MIDDLE DOT
ru: ТОЧКА В ЦЕНТРЕ

source: CYRILLIC SMALL LETTER IO
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ё»

source: NUMERO SIGN
ru: ЗНАК «НОМЕР»

source: CYRILLIC SMALL LETTER UKRAINIAN IE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА УКРАИНСКАЯ «є»

source: RIGHT-POINTING DOUBLE ANGLE QUOTATION MARK
ru: ЗАКРЫВАЮЩАЯ КАВЫЧКА «ЁЛОЧКА»

source: CYRILLIC SMALL LETTER JE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ЙЕ»

source: CYRILLIC CAPITAL LETTER DZE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «ДЗЕ»

source: CYRILLIC SMALL LETTER DZE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ДЗЕ»

source: CYRILLIC SMALL LETTER YI
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ЙИ»

source: CYRILLIC CAPITAL LETTER A
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «А»

source: CYRILLIC CAPITAL LETTER BE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Б»

source: CYRILLIC CAPITAL LETTER VE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «В»

source: CYRILLIC CAPITAL LETTER GHE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Г»

source: CYRILLIC CAPITAL LETTER DE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Д»

source: CYRILLIC CAPITAL LETTER IE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Е»

source: CYRILLIC CAPITAL LETTER ZHE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ж»

source: CYRILLIC CAPITAL LETTER ZE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «З»

source: CYRILLIC CAPITAL LETTER I
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «И»

source: CYRILLIC CAPITAL LETTER SHORT I
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Й»

source: CYRILLIC CAPITAL LETTER KA
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «К»

source: CYRILLIC CAPITAL LETTER EL
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Л»

source: CYRILLIC CAPITAL LETTER EM
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «М»

source: CYRILLIC CAPITAL LETTER EN
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Н»

source: CYRILLIC CAPITAL LETTER O
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «О»

source: CYRILLIC CAPITAL LETTER PE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «П»

source: CYRILLIC CAPITAL LETTER ER
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Р»

source: CYRILLIC CAPITAL LETTER ES
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «С»

source: CYRILLIC CAPITAL LETTER TE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА Т

source: CYRILLIC CAPITAL LETTER U
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «У»

source: CYRILLIC CAPITAL LETTER EF
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ф»

source: CYRILLIC CAPITAL LETTER HA
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Х»

source: CYRILLIC CAPITAL LETTER TSE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ц»

source: CYRILLIC CAPITAL LETTER CHE
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ч»

source: CYRILLIC CAPITAL LETTER SHA
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ш»

source: CYRILLIC CAPITAL LETTER SHCHA
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Щ»

source: CYRILLIC CAPITAL LETTER HARD SIGN
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА ТВЁРДЫЙ ЗНАК

source: CYRILLIC CAPITAL LETTER YERU
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ы»

source: CYRILLIC CAPITAL LETTER SOFT SIGN
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА МЯГКИЙ ЗНАК

source: CYRILLIC CAPITAL LETTER E
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Э»

source: CYRILLIC CAPITAL LETTER YU
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Ю»

source: CYRILLIC CAPITAL LETTER YA
ru: КИРИЛЛИЧЕСКАЯ ЗАГЛАВНАЯ БУКВА «Я»

source: CYRILLIC SMALL LETTER A
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «а»

source: CYRILLIC SMALL LETTER BE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «б»

source: CYRILLIC SMALL LETTER VE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «в»

source: CYRILLIC SMALL LETTER GHE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «г»

source: CYRILLIC SMALL LETTER DE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «д»

source: CYRILLIC SMALL LETTER IE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «е»

source: CYRILLIC SMALL LETTER ZHE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ж»

source: CYRILLIC SMALL LETTER ZE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «з»

source: CYRILLIC SMALL LETTER I
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА и

source: CYRILLIC SMALL LETTER SHORT I
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «й»

source: CYRILLIC SMALL LETTER KA
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «к»

source: CYRILLIC SMALL LETTER EL
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «л»

source: CYRILLIC SMALL LETTER EM
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «м»

source: CYRILLIC SMALL LETTER EN
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «н»

source: CYRILLIC SMALL LETTER O
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «о»

source: CYRILLIC SMALL LETTER PE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «п»

source: CYRILLIC SMALL LETTER ER
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «р»

source: CYRILLIC SMALL LETTER ES
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «с»

source: CYRILLIC SMALL LETTER TE
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «т»

source: CYRILLIC SMALL LETTER U
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «у»

source: CYRILLIC SMALL LETTER EF
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «ф»

source: CYRILLIC SMALL LETTER HA
ru: КИРИЛЛИЧЕСКАЯ СТРОЧНАЯ БУКВА «х»
