Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Standards discussed include such as ASCII, GB 2312, ISO 8859, JIS, KOI8-R, KS, and Unicode.
ru: Обсуждаемые стандарты: ASCII, GB 2312, ISO 8859, JIS, KOI8-R, KS и Юникод.

source: The primary emphasis is on character sets that were actually used by locale character sets, not the myriad others that could be found in data from other systems.
ru: В основном, описываются наборы символов, реально используемые в локалях, и опускается всё огромное количество наборов, существующих в других системах.

source: ASCII (American Standard Code For Information Interchange) is the original 7-bit character set, originally designed for American English. Also known as US-ASCII. It is currently described by the ISO 646:1991 IRV (International Reference Version) standard.
ru: ASCII (American Standard Code For Information Interchange; американский стандартный код для обмена информацией) — первоначальный 7-битный набор символов, разработанный для американского варианта английского языка. Также известен как US-ASCII. В настоящее время описан в стандарте ISO 646:1991 IRV (International Reference Version).

source: Various ASCII variants replacing the dollar sign with other currency symbols and replacing punctuation with non-English alphabetic characters to cover German, French, Spanish, and others in 7 bits emerged. All are deprecated; glibc does not support locales whose character sets are not true supersets of ASCII.
ru: Существуют различные варианты (из 7 бит) ASCII, в которых американский символ доллара и знаки пунктуации заменяются на знаки валют различных стран (Германия, Франция, Испания и другие). Все эти наборы устарели; в glibc не поддерживаются локали, которые в действительности не содержат набор ASCII.

source: As Unicode, when using UTF-8, is ASCII-compatible, plain ASCII text still renders properly on modern UTF-8 using systems.
ru: Юникод, при использовании UTF-8, является совместимым с ASCII; простой (plain) текст ASCII по-прежнему отображается корректно в современных системах, использующих UTF-8.

source: ISO 8859 is a series of 15 8-bit character sets, all of which have ASCII in their low (7-bit) half, invisible control characters in positions 128 to 159, and 96 fixed-width graphics in positions 160\(en255.
ru: ISO 8859 — это серия из 15-и 8-битных наборов символов, каждый из которых имеет в своей нижней (7-битной) половине коды ASCII, невидимые управляющие символы в позициях от 128 до 159 и 96 графических символов фиксированной ширины в позициях 160\(en255.

source: Of these, the most important is ISO 8859-1 ("Latin Alphabet No .1" / Latin-1). It was widely adopted and supported by different systems, and is gradually being replaced with Unicode. The ISO 8859-1 characters are also the first 256 characters of Unicode.
ru: Из них самой важной является последовательность ISO 8859-1 («Latin Alphabet No .1» / Latin-1). Она широко распространена, поддерживается различными системами и постепенно заменяется Юникодом. Символы ISO 8859-1 также являются первыми 256 символами Юникода.

source: Console support for the other 8859 character sets is available under Linux through user-mode utilities (such as B<setfont>(8)) that modify keyboard bindings and the EGA graphics table and employ the "user mapping" font table in the console driver.
ru: Поддержка в консоли других наборов символов 8859 осуществляется в Linux с помощью пользовательских утилит (таких, как B<setfont>(8)), меняющих привязки клавиатуры, таблицу графики EGA и передающих драйверу консоли таблицу соответствий символов шрифтам.

source: Here are brief descriptions of each set:
ru: Ниже приводится краткое описание каждого набора:

source: Latin-1 covers many West European languages such as Albanian, Basque, Danish, English, Faroese, Galician, Icelandic, Irish, Italian, Norwegian, Portuguese, Spanish, and Swedish. The lack of the ligatures Dutch Ĳ/ĳ, French œ, and old-style „German“ quotation marks was considered tolerable.
ru: Latin-1 охватывается большинство западноевропейских языков, таких, как: албанский, баскский, датский, английский, фарезский, галисийский, исландский, ирландский, итальянский, норвежский, португальский, испанский и шведский. Отсутствие лигатуры Ĳ/ĳ голландского языка, œ французского языка и старых „немецких“ кавычек считается приемлемым.

source: Latin-2 supports many Latin-written Central and East European languages such as Bosnian, Croatian, Czech, German, Hungarian, Polish, Slovak, and Slovene. Replacing Romanian ș/ț with ş/ţ was considered tolerable.
ru: Latin-2 охватывает множество славянских и центрально и восточно-европейских языков: боснийский, хорватский, чешский, немецкий, венгерский, польский, словацкий и словенский. Замена румынского ș/ț на ş/ţ считается приемлемым.

source: Latin-3 was designed to cover of Esperanto, Maltese, and Turkish, but 8859-9 later superseded it for Turkish.
ru: Latin-3 охватывает эсперанто, мальтийский и турецкий языки (но турецкий сейчас охватывается 8859-9).

source: Latin-4 introduced letters for North European languages such as Estonian, Latvian, and Lithuanian, but was superseded by 8859-10 and 8859-13.
ru: Latin-4 охватывает северо-европейские языки: эстонский, латвийский и литовский языки. Но сейчас они охватываются 8859-10 и 8859-13.

source: Cyrillic letters supporting Bulgarian, Byelorussian, Macedonian, Russian, Serbian, and (almost completely) Ukrainian. It was never widely used, see the discussion of KOI8-R/KOI8-U below.
ru: Кириллические символы болгарского, белорусского, македонского, русского, сербского и (почти полностью) украинского языков. Никогда широко не использовался, смотрите ниже описание KOI8-R/KOI8-U.

source: Was created for Arabic. The 8859-6 glyph table is a fixed font of separate letter forms, but a proper display engine should combine these using the proper initial, medial, and final forms.
ru: Был создан для арабского языка. Таблица начертаний (глифов) 8859-6 — это шрифт отдельных форм букв постоянной ширины; корректная программа отображения должна объединить их, используя корректные начальные, промежуточные и конечные формы.

source: Was created for Modern Greek in 1987, updated in 2003.
ru: Был создан для современного греческого языка в 1987 году, обновлён в 2003 году.

source: Supports Modern Hebrew without niqud (punctuation signs). Niqud and full-fledged Biblical Hebrew were outside the scope of this character set.
ru: Поддерживает современный иврит без niqud (знаки пунктуации). Niqud и полный библейский иврит не входят в этот набор.

source: This is a variant of Latin-1 that replaces Icelandic letters with Turkish ones.
ru: Это вариант Latin-1, в котором исландские буквы заменены турецкими.

source: Latin-6 added the Inuit (Greenlandic) and Sami (Lappish) letters that were missing in Latin-4 to cover the entire Nordic area.
ru: Latin-6 добавляет последние инуитские (гренландские) буквы и буквы сами (Sami Lappish), отсутствующие в Latin-4, для того, чтобы объединить шрифты всех нордических языков.

source: Supports the Thai alphabet and is nearly identical to the TIS-620 standard.
ru: Поддерживает тайский алфавит и очень похож на стандарт TIS-620.

source: This set does not exist.
ru: Этот набор не существует.

source: Supports the Baltic Rim languages; in particular, it includes Latvian characters not found in Latin-4.
ru: Поддерживает балтийские языки, в частности, латвийские символы не вошедшие в Latin-4.

source: This is the Celtic character set, covering Old Irish, Manx, Gaelic, Welsh, Cornish, and Breton.
ru: Это кельтский набор символов для старого ирландского, мэнского, гаэлльского, уэльского, корнуэльского и бретонского языков.

source: Latin-9 is similar to the widely used Latin-1 but replaces some less common symbols with the Euro sign and French and Finnish letters that were missing in Latin-1.
ru: Latin-9 похож на широко используемый Latin-1, но в нём заменены некоторые мало используемые символы на знак евро, а также французские и финские лигатуры, отсутствующие в Latin-1.

source: This set covers many Southeast European languages, and most importantly supports Romanian more completely than Latin-2.
ru: Этот набор включает в себя многие южно-европейские языки, и самое главное, румынский язык поддерживается более полно чем в Latin-2.

source: KOI8-R is a non-ISO character set popular in Russia before Unicode. The lower half is ASCII; the upper is a Cyrillic character set somewhat better designed than ISO 8859-5. KOI8-U, based on KOI8-R, has better support for Ukrainian. Neither of these sets are ISO-2022 compatible, unlike the ISO 8859 series.
ru: KOI8-R — набор символов не ISO, являлся популярным в России до Юникода. Нижняя часть таблицы описывает ASCII, верхняя — набор символов кириллицы, более совершенный по сравнению с ISO 8859-5. KOI8-U, основанный на KOI8-R, имеет более полную поддержку украинского языка. Ни один из этих наборов не совместим с ISO-2022 (в отличии от ISO 8859).

source: Console support for KOI8-R is available under Linux through user-mode utilities that modify keyboard bindings and the EGA graphics table, and employ the "user mapping" font table in the console driver.
ru: Поддержка символов KOI8-R в консоли осуществляется Linux с помощью пользовательских утилит, меняющих привязки клавиатуры, таблицу графики EGA и передающих драйверу консоли таблицу соответствий символов шрифтам.

source: GB 2312 is a mainland Chinese national standard character set used to express simplified Chinese. Just like JIS X 0208, characters are mapped into a 94x94 two-byte matrix used to construct EUC-CN. EUC-CN is the most important encoding for Linux and includes ASCII and GB 2312. Note that EUC-CN is often called as GB, GB 2312, or CN-GB.
ru: GB 2312 это национальный китайский стандартный набор символов для упрощенного китайского. Как и в JIS X 0208, символы берутся из массива 94x94 и состоят из двух байт. Набор символов используется для кодировки EUC-CN. EUC-CN является наиболее важной кодировкой для Linux и включает в себя ASCII и GB 2312. Заметим, что EUC-CN часто называют GB, GB 2312 или CN-GB.

source: Big5 was a popular character set in Taiwan to express traditional Chinese. (Big5 is both a character set and an encoding.) It is a superset of ASCII. Non-ASCII characters are expressed in two bytes. Bytes 0xa1\(en0xfe are used as leading bytes for two-byte characters. Big5 and its extension were widely used in Taiwan and Hong Kong. It is not ISO 2022 compliant.
ru: Big5 — ранее популярный набор в Тайване для отображения традиционного китайского языка (Big5 является и кодировкой и набором символов). Он включает в себя ASCII. Символы, не входящие в ASCII, представлены двумя байтами. Первый байт (символ представлен двумя байтами) берётся из диапазона xa1\(en0xfe. Big5 и его расширение широко используются в Тайване и Гонконге. Он не совместим с ISO 2022.

source: JIS X 0208 is a Japanese national standard character set. Though there are some more Japanese national standard character sets (like JIS X 0201, JIS X 0212, and JIS X 0213), this is the most important one. Characters are mapped into a 94x94 two-byte matrix, whose each byte is in the range 0x21\(en0x7e. Note that JIS X 0208 is a character set, not an encoding. This means that JIS X 0208 itself is not used for expressing text data. JIS X 0208 is used as a component to construct encodings such as EUC-JP, Shift_JIS, and ISO-2022-JP. EUC-JP is the most important encoding for Linux and includes ASCII and JIS X 0208. In EUC-JP, JIS X 0208 characters are expressed in two bytes, each of which is the JIS X 0208 code plus 0x80.
ru: JIS X 208 является стандартным набором для японского языка. Существуют несколько других японских стандартов, например, JIS X 0201, JIS X 0212 и JIS X 0213, но первый — самый распространенный. Символы берутся из массива 94x94 и представлены двумя байтами, каждый из которых находится в интервале 0x21\(en0x7e. Заметьте, что JIS X 0208 является набором символов, а не кодировкой. Это означает, что JIS X 0208 не может представлять текстовую информацию самостоятельно, а является лишь компонентом для кодировок, таких как EUC-JP, Shift_JIS и ISO-2022-JP. EUC-JP — наиболее важная кодировка для Linux и включает в себя ASCII и JIS X 0208. В EUC-JP для символов JIS X 0208 отводится по 2 байта, значение каждого из которых равно коду JIS X 0208 плюс 0x80.

source: KS X 1001 is a Korean national standard character set. Just as JIS X 0208, characters are mapped into a 94x94 two-byte matrix. KS X 1001 is used like JIS X 0208, as a component to construct encodings such as EUC-KR, Johab, and ISO-2022-KR. EUC-KR is the most important encoding for Linux and includes ASCII and KS X 1001. KS C 5601 is an older name for KS X 1001.
ru: KS X 1001 это корейский национальный стандарт для наборов символов. Как и в JIS X 0208, символы берутся из матрицы 94x94 и состоят из двух байт. KS X 1001, так же как и JIS X 0208, является компонентом для кодировок EUC-KR, Johab и ISO-2022-KR. EUC-KR является наиболее важной кодировкой для Linux и включает в себя ASCII и KS X 1001. KS C 5601 это старое название KS X 1001.

source: ISO 2022 and ISO 4873
ru: ISO 2022 и ISO 4873

source: The ISO 2022 and 4873 standards describe a font-control model based on VT100 practice. This model is (partially) supported by the Linux kernel and by B<xterm>(1). Several ISO 2022-based character encodings have been defined, especially for Japanese.
ru: Стандарты ISO 2022 и 4873 описывают модель управления шрифтами, основанную на практике работы с VT100. Эта модель (частично) поддерживается ядром Linux и B<xterm>(1). Были определены некоторые наборы символов на основе ISO 2022, особенно популярного в Японии.

source: There are 4 graphic character sets, called G0, G1, G2, and G3, and one of them is the current character set for codes with high bit zero (initially G0), and one of them is the current character set for codes with high bit one (initially G1). Each graphic character set has 94 or 96 characters, and is essentially a 7-bit character set. It uses codes either 040\(en0177 (041\(en0176) or 0240\(en0377 (0241\(en0376). G0 always has size 94 and uses codes 041\(en0176.
ru: Имеется 4 набора графических символов, называемых G0, G1, G2 и G3. Один из них является текущим набором символов для кодов со старшим битом, равным нулю (изначально G0), другой — текущим набором для кодов со старшим битом, равным единице (изначально G1). Каждый набор графических символов имеет 94 или 96 символов и, по сути, является 7-битным набором символов. Используются либо коды 040\(en0177 (041\(en0176), либо 0240\(en0377 (0241\(en0376). Размер G0 всегда равен 94-м символам и содержит коды 041\(en0176.

source: Switching between character sets is done using the shift functions B<^N> (SO or LS1), B<^O> (SI or LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC ~ (LS1R), ESC } (LS2R), ESC | (LS3R). The function LSI<n> makes character set GI<n> the current one for codes with high bit zero. The function LSI<n>R makes character set GI<n> the current one for codes with high bit one. The function SSI<n> makes character set GI<n> (I<n>=2 or 3) the current one for the next character only (regardless of the value of its high order bit).
ru: Переключение с одного набора символов на другой производится с помощью функций сдвига B<^N> (SO или LS1), B<^O> (SI или LS0), ESC n (LS2), ESC o (LS3), ESC N (SS2), ESC O (SS3), ESC ~ (LS1R), ESC } (LS2R), ESC | (LS3R). Функция LSI<n> делает набор символов GI<n> текущим для кодов со старшим битом, равным нулю. Функция LSI<n>R делает набор символов GI<n> текущим для кодов со старшим битом, равным единице. Функция SSI<n> делает набор символов GI<n> (I<n>=2 или 3) текущим только для следующего символа (независимо от значения старшего бита).

source: A 94-character set is designated as GI<n> character set by an escape sequence ESC ( xx (for G0), ESC ) xx (for G1), ESC * xx (for G2), ESC + xx (for G3), where xx is a symbol or a pair of symbols found in the ISO 2375 International Register of Coded Character Sets. For example, ESC ( @ selects the ISO 646 character set as G0, ESC ( A selects the UK standard character set (with pound instead of number sign), ESC ( B selects ASCII (with dollar instead of currency sign), ESC ( M selects a character set for African languages, ESC ( ! A selects the Cuban character set, and so on.
ru: 94-символьный набор становится набором символов GI<n> c помощью последовательности ESC ( xx (для G0), ESC ) xx (для G1), ESC * xx (для G2), ESC + xx (для G3), где xx является символом или парой символов, которая содержится в ISO 2375 International Register of Coded Character Sets (международном реестре кодированных наборов символов). Например, ESC ( @ выбирает в качестве G0 набор символов ISO 646, ESC ( A выбирает стандартный набор символов UK (со знаком фунта вместо знака номера), ESC ( B выбирает ASCII (со знаком доллара вместо знака валюты), ESC ( M выбирает набор символов для африканских языков, ESC ( ! A выбирает кубинский набор символов и т.д. и т.п.

source: A 96-character set is designated as GI<n> character set by an escape sequence ESC - xx (for G1), ESC . xx (for G2) or ESC / xx (for G3). For example, ESC - G selects the Hebrew alphabet as G1.
ru: 96-символьный набор назначается набором символов GI<n> с помощью последовательности ESC - xx (для G1), ESC . xx (для G2) или ESC / xx (для G3). Например, ESC - G выбирает иврит в качестве G1.

source: A multibyte character set is designated as GI<n> character set by an escape sequence ESC $ xx or ESC $ ( xx (for G0), ESC $ ) xx (for G1), ESC $ * xx (for G2), ESC $ + xx (for G3). For example, ESC $ ( C selects the Korean character set for G0. The Japanese character set selected by ESC $ B has a more recent version selected by ESC & @ ESC $ B.
ru: Мультибайтный набор символов назначается набором символов GI<n> управляющей последовательностью ESC $ xx или ESC $ ( xx (для G0), ESC $ ) xx (для G1), ESC $ * xx (для G2), ESC $ + xx (для G3). Например, ESC $ ( C выбирает корейский набор символов для G0. Набор японских символов выбирается при помощи ESC $ B, а его более новая версия — при помощи ESC & @ ESC $ B.

source: ISO 4873 stipulates a narrower use of character sets, where G0 is fixed (always ASCII), so that G1, G2 and G3 can be invoked only for codes with the high order bit set. In particular, B<^N> and B<^O> are not used anymore, ESC ( xx can be used only with xx=B, and ESC ) xx, ESC * xx, ESC + xx are equivalent to ESC - xx, ESC . xx, ESC / xx, respectively.
ru: ISO 4873 оговаривает более направленное использование наборов символов, при котором G0 постоянен (всегда ASCII), так что G1, G2 и G3 могут быть заданы только для кодов с установленным старшим битом. При этом B<^N> и B<^O> больше не используются, ESC ( xx может быть использована только с xx=B, а ESC ) xx, ESC * xx и ESC + xx эквивалентны ESC - xx, ESC . xx и ESC / xx, соответственно.

source: TIS-620 is a Thai national standard character set and a superset of ASCII. In the same fashion as the ISO 8859 series, Thai characters are mapped into 0xa1\(en0xfe.
ru: TIS -62 — это национальный стандартный набор тайских символов, включающий ASCII. Как и в стандартах ISO 8859, тайские символы находятся в интервале 0xa1\(en0xfe.

source: Unicode
ru: Юникод

source: Unicode (ISO 10646) is a standard which aims to unambiguously represent every character in every human language. Unicode's structure permits 20.1 bits to encode every character. Since most computers don't include 20.1-bit integers, Unicode is usually encoded as 32-bit integers internally and either a series of 16-bit integers (UTF-16) (needing two 16-bit integers only when encoding certain rare characters) or a series of 8-bit bytes (UTF-8).
ru: Юникод (ISO 10646) — стандарт, которым можно представить любой символ из всех известных человеку языков. В структуре Юникода на кодирование каждого символа выделяется 20.1 бит. Так как большинство компьютеров не поддерживают целых чисел размерностью 20.1 бит, то Юникод, обычно, кодируется в 32-битных целых, а также или серией 16-ти битных целых (UTF-16, 2 16-битных целых требуется только при кодировании редких символов), или серией 8-битных байт (UTF-8).

source: Linux represents Unicode using the 8-bit Unicode Transformation Format (UTF-8). UTF-8 is a variable length encoding of Unicode. It uses 1 byte to code 7 bits, 2 bytes for 11 bits, 3 bytes for 16 bits, 4 bytes for 21 bits, 5 bytes for 26 bits, 6 bytes for 31 bits.
ru: Для представления Юникода в Linux используется 8-битный формат преобразования Юникода (UTF-8 - 8-bit Unicode Transformation Format). UTF-8 — это формат непостоянной длины для кодирования Юникода. В нём используется 1 байт для кодирования 7-и битов, 2 байта для 11-и битов, 3 байта для 16-и битов, 4 байта для 21-ого бита, 5 байтов для 26-и битов, 6 байтов для 31-ого бита.

source: Let 0,1,x stand for a zero, one, or arbitrary bit. A byte 0xxxxxxx stands for the Unicode 00000000 0xxxxxxx which codes the same symbol as the ASCII 0xxxxxxx. Thus, ASCII goes unchanged into UTF-8, and people using only ASCII do not notice any change: not in code, and not in file size.
ru: Пусть 0, 1, x соответствует нулю, единице и случайному биту. Байт 0xxxxxxx соответствует Юникоду 00000000 0xxxxxxx, что, в свою очередь, соответствует символу в ASCII 0xxxxxxxx. То есть, коды ASCII совпадают с кодами UTF-8 и людям, использующим только ASCII, ничего делать не нужно: ни в коде, ни в файлах.

source: A byte 110xxxxx is the start of a 2-byte code, and 110xxxxx 10yyyyyy is assembled into 00000xxx xxyyyyyy. A byte 1110xxxx is the start of a 3-byte code, and 1110xxxx 10yyyyyy 10zzzzzz is assembled into xxxxyyyy yyzzzzzz. (When UTF-8 is used to code the 31-bit ISO 10646 then this progression continues up to 6-byte codes.)
ru: Байт 110xxxxx является началом 2-байтного кода, и 110xxxxx 10yyyyyy преобразуется в 00000xxx xxyyyyyy. Байт 1110xxxx — начало 3-байтного кода, и 1110xxxx 10yyyyyy 10zzzzzz преобразуется в xxxxyyyy yyzzzzzz (если UTF-8 используется для кодирования 31-битного ISO 10646, то это прогрессия продолжается до 6-байтных кодов).

source: For most texts in ISO 8859 character sets, this means that the characters outside of ASCII are now coded with two bytes. This tends to expand ordinary text files by only one or two percent. For Russian or Greek texts, this expands ordinary text files by 100%, since text in those languages is mostly outside of ASCII. For Japanese users this means that the 16-bit codes now in common use will take three bytes. While there are algorithmic conversions from some character sets (especially ISO 8859-1) to Unicode, general conversion requires carrying around conversion tables, which can be quite large for 16-bit codes.
ru: Для большинства текстов, кодированных наборами ISO 8859, это означает, что символы, не входящие в ASCII, теперь кодируются двумя байтами. Это приводит к тому, что обычный текстовый файл становится больше на 1-2 процента. Обычные текстовые файлы на греческом или русском языке увеличиваются на 100%, так как почти все символы в этих языках находятся за пределами ASCII. Для пользователей японского языка 16-ти битные символы теперь, в основном, представляются 3-мя байтами. Хотя для некоторых наборов символов (особенно ISO-8859-1) и есть алгоритмы преобразования в Юникод, в большинстве случаев для преобразований требуются таблицы соответствий, которые могут быть большими для 16-битных кодов.
