Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: B<CMSG_DATA>() returns a pointer to the data portion of a I<cmsghdr>.
ru: Макрос B<CMSG_DATA>() возвращает указатель на часть с данными в I<cmsghdr>.

source: B<CMSG_LEN>() returns the value to store in the I<cmsg_len> member of the I<cmsghdr> structure, taking into account any necessary alignment. It takes the data length as an argument. This is a constant expression.
ru: Макрос B<CMSG_LEN> возвращает значение, хранящееся в поле I<cmsg_len> структуры I<cmsghdr> с учётом необходимого выравнивания. Он принимает значение объёма данных в качестве аргумента. Это постоянное выражение.

source: To create ancillary data, first initialize the I<msg_controllen> member of the I<msghdr> with the length of the control message buffer. Use B<CMSG_FIRSTHDR>() on the I<msghdr> to get the first control message and B<CMSG_NXTHDR>() to get all subsequent ones. In each control message, initialize I<cmsg_len> (with B<CMSG_LEN>()), the other I<cmsghdr> header fields, and the data portion using B<CMSG_DATA>(). Finally, the I<msg_controllen> field of the I<msghdr> should be set to the sum of the B<CMSG_SPACE>() of the length of all control messages in the buffer. For more information on the I<msghdr>, see B<recvmsg>(2).
ru: Чтобы создать вспомогательные данные, сначала инициализируйте элемент I<msg_controllen> структуры I<msghdr>, указав длину буфера управляющего сообщения. Запустите B<CMSG_FIRSTHDR>() со структурой I<msghdr> для получения первого управляющего сообщения и B<CMSG_NEXTHDR>() для получения последующих. Для каждого управляющего сообщения инициализируйте I<cmsg_len> (с помощью B<CMSG_LEN>()) и другие поля заголовка I<cmsghdr>, а также часть для данных (с помощью B<CMSG_DATA>()). В результате значение поля I<msg_controllen> структуры I<msghdr> будет равно сумме B<CMSG_SPACE>() для длин всех управляющих сообщений в буфере. Дополнительная информация о I<msghdr> находится в B<recvmsg>(2).

source: This ancillary data model conforms to the POSIX.1g draft, 4.4BSD-Lite, the IPv6 advanced API described in RFC\ 2292 and SUSv2. B<CMSG_ALIGN>() is a Linux extension.
ru: Эта модель вспомогательных данных соответствует черновому варианту POSIX.1g, 4.4BSD-Lite, расширению IPv6 API, описанному в RFC\ 2292, и SUSv2. B<CMSG_ALIGN>() — это расширение Linux.

source: For portability, ancillary data should be accessed using only the macros described here. B<CMSG_ALIGN>() is a Linux extension and should not be used in portable programs.
ru: В целях переносимости вспомогательные данные могут быть доступны только с помощью макросов, описанных здесь. B<CMSG_ALIGN>() — это расширение Linux, поэтому оно не должно быть использовано в переносимых программах.

source: In Linux, B<CMSG_LEN>(), B<CMSG_DATA>(), and B<CMSG_ALIGN>() are constant expressions (assuming their argument is constant), meaning that these values can be used to declare the size of global variables. This may not be portable, however.
ru: В Linux B<CMSG_LEN>(), B<CMSG_DATA>() и B<CMSG_ALIGN>() — это постоянные выражения (вне зависимости от переданных аргументов), то есть эти значения можно использовать для объявления размера глобальных переменных. Но это также сделает программу непереносимой на другие платформы.

source: This code looks for the B<IP_TTL> option in a received ancillary buffer:
ru: Данный код ищет параметр B<IP_TTL> в буфере с полученными вспомогательными данными:

source: /* Receive auxiliary data in msgh */
ru: /* приём вспомогательных данных в msgh */

source: if (cmsg == NULL) { /* Error: IP_TTL not enabled or small buffer or I/O error */ }
ru: if (cmsg == NULL) { /* Ошибка: не включён IP_TTL, мал буфер или ошибка ввода-вывода */ }

source: The code below passes an array of file descriptors over a UNIX domain socket using B<SCM_RIGHTS>:
ru: Данный код передаёт массив файловых дескрипторов через доменный сокет UNIX, используя B<SCM_RIGHTS>:

source: struct msghdr msg = { 0 }; struct cmsghdr *cmsg; int myfds[NUM_FD]; /* Contains the file descriptors to pass */ char iobuf[1]; struct iovec io = { .iov_base = iobuf, .iov_len = sizeof(iobuf) }; union { /* Ancillary data buffer, wrapped in a union in order to ensure it is suitably aligned */ char buf[CMSG_SPACE(sizeof(myfds))]; struct cmsghdr align; } u;
ru: struct msghdr msg = { 0 }; struct cmsghdr *cmsg; int myfds[NUM_FD]; /* содержит дескрипторы файлов для передачи */ char iobuf[1]; struct iovec io = { .iov_base = iobuf, .iov_len = sizeof(iobuf) }; union { /* буфер вспомогательных данных, обёрнутый в union, чтобы точно получить нужное выравнивание */ char buf[CMSG_SPACE(sizeof(myfds))]; struct cmsghdr align; } u;

source: cosh, coshf, coshl - hyperbolic cosine function
ru: cosh, coshf, coshl - функция вычисления гиперболического косинуса

source: These functions return the hyperbolic cosine of I<x>, which is defined mathematically as:
ru: Эти функции возвращают гиперболический косинус от I<x>, как это математически определено:

source: On success, these functions return the hyperbolic cosine of I<x>.
ru: В случае успеха данные функции возвращают гиперболический косинус от I<x>.

source: If I<x> is +0 or -0, 1 is returned.
ru: Если I<x> равен +0 или -0, возвращается -1.

source: If I<x> is positive infinity or negative infinity, positive infinity is returned.
ru: Если I<x> равен плюс бесконечности или минус бесконечности, возвращается плюс бесконечность.

source: If the result overflows, a range error occurs, and the functions return +B<HUGE_VAL>, +B<HUGE_VALF>, or +B<HUGE_VALL>, respectively.
ru: Если в результате превышена разрядность, то возникает ошибка диапазона и функции возвращают +B<HUGE_VAL>, +B<HUGE_VALF> или +B<HUGE_VALL>, соответственно.

source: Range error: result overflow
ru: Ошибка диапазона: результат превысил разрядность

source: I<errno> is set to B<ERANGE>. An overflow floating-point exception (B<FE_OVERFLOW>) is raised.
ru: Значение I<errno> устанавливается в B<ERANGE>. Возникает исключение переполнения плавающей точки (B<FE_OVERFLOW>).

source: In glibc version 2.3.4 and earlier, an overflow floating-point (B<FE_OVERFLOW>) exception is not raised when an overflow occurs.
ru: В glibc 2.3.4 и более ранних версиях исключение переполнения плавающей точки (B<FE_OVERFLOW>) при переполнении не возникает.

source: CPU_SET, CPU_CLR, CPU_ISSET, CPU_ZERO, CPU_COUNT, CPU_AND, CPU_OR, CPU_XOR, CPU_EQUAL, CPU_ALLOC, CPU_ALLOC_SIZE, CPU_FREE, CPU_SET_S, CPU_CLR_S, CPU_ISSET_S, CPU_ZERO_S, CPU_COUNT_S, CPU_AND_S, CPU_OR_S, CPU_XOR_S, CPU_EQUAL_S - macros for manipulating CPU sets
ru: CPU_SET, CPU_CLR, CPU_ISSET, CPU_ZERO, CPU_COUNT, CPU_AND, CPU_OR, CPU_XOR, CPU_EQUAL, CPU_ALLOC, CPU_ALLOC_SIZE, CPU_FREE, CPU_SET_S, CPU_CLR_S, CPU_ISSET_S, CPU_ZERO_S, CPU_COUNT_S, CPU_AND_S, CPU_OR_S, CPU_XOR_S, CPU_EQUAL_S - макросы для работы с наборами ЦП

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>sched.hE<gt>>
ru: B<#define _GNU_SOURCE> /* Смотрите feature_test_macros(7) */ B<#include E<lt>sched.hE<gt>>

source: The I<cpu_set_t> data structure represents a set of CPUs. CPU sets are used by B<sched_setaffinity>(2) and similar interfaces.
ru: Набор ЦП описывается структурой данных I<cpu_set_t>. Набор ЦП используется в B<sched_setaffinity>(2) и подобных интерфейсах.

source: The I<cpu_set_t> data type is implemented as a bit mask. However, the data structure should be treated as opaque: all manipulation of CPU sets should be done via the macros described in this page.
ru: Тип данных I<cpu_set_t> реализован в виде битовой маски. Однако структуру данных следует считать «чёрным ящиком»: все действия с наборами ЦП следует выполнять с помощью макросов, описанных на этой странице.

source: The following macros are provided to operate on the CPU set I<set>:
ru: Для работы с набором ЦП I<set> предоставляются следующие макросы:

source: Clears I<set>, so that it contains no CPUs.
ru: Очищает I<set>, после этого он не содержит ЦП.

source: Add CPU I<cpu> to I<set>.
ru: Добавляет ЦП I<cpu> в I<set>.

source: Remove CPU I<cpu> from I<set>.
ru: Удаляет ЦП I<cpu> из I<set>.

source: Test to see if CPU I<cpu> is a member of I<set>.
ru: Проверяет, является ли ЦП I<cpu> членом I<set>.

source: Return the number of CPUs in I<set>.
ru: Возвращает количество ЦП в I<set>.

source: Where a I<cpu> argument is specified, it should not produce side effects, since the above macros may evaluate the argument more than once.
ru: Макросы, имеющие аргумент I<cpu>, не вызывают побочных эффектов, все перечисленные выше макросы могут использовать аргумент более одного раза.

source: The first CPU on the system corresponds to a I<cpu> value of 0, the next CPU corresponds to a I<cpu> value of 1, and so on. No assumptions should be made about particular CPUs being available, or the set of CPUs being contiguous, since CPUs can be taken offline dynamically or be otherwise absent. The constant B<CPU_SETSIZE> (currently 1024) specifies a value one greater than the maximum CPU number that can be stored in I<cpu_set_t>.
ru: Значение первого ЦП системы в I<cpu> обозначается как 0, значение следующего ЦП в I<cpu> равно 1 и т. д. Нельзя предполагать о доступности каких-либо ЦП, или что набор ЦП непрерывен, так как ЦП могут динамически отключаться или вообще отсутствовать. Константой B<CPU_SETSIZE> (в настоящее время 1024) задаётся значение на 1 большее, чем максимальный номер ЦП, который можно хранить в I<cpu_set_t>.

source: The following macros perform logical operations on CPU sets:
ru: Следующие макросы выполняют логические операции над наборами ЦП:

source: Store the intersection of the sets I<srcset1> and I<srcset2> in I<destset> (which may be one of the source sets).
ru: Сохраняет пересечение наборов I<srcset1> и I<srcset2> в I<destset> (который может быть одним из наборов-аргументов).

source: Store the union of the sets I<srcset1> and I<srcset2> in I<destset> (which may be one of the source sets).
ru: Сохраняет объединение наборов I<srcset1> и I<srcset2> в I<destset> (который может быть одним из наборов-аргументов).

source: Store the XOR of the sets I<srcset1> and I<srcset2> in I<destset> (which may be one of the source sets). The XOR means the set of CPUs that are in either I<srcset1> or I<srcset2>, but not both.
ru: Сохраняет результат XOR наборов I<srcset1> и I<srcset2> в I<destset> (который может быть одним из наборов-аргументов). Операция XOR возвращает набор из ЦП, которые есть в одном из I<srcset1> или I<srcset2>, но не в обоих одновременно.

source: Test whether two CPU set contain exactly the same CPUs.
ru: Проверяет, что два набора ЦП содержат одинаковые ЦП.

source: Dynamically sized CPU sets
ru: Динамически изменяемые наборы ЦП

source: Because some applications may require the ability to dynamically size CPU sets (e.g., to allocate sets larger than that defined by the standard I<cpu_set_t> data type), glibc nowadays provides a set of macros to support this.
ru: Так как некоторым приложениям может потребоваться наборы ЦП динамически изменяемых размеров (например, для выделения наборов больше, чем определено стандартным типом данных I<cpu_set_t>), glibc предоставляет набор макросов для этого.

source: The following macros are used to allocate and deallocate CPU sets:
ru: Следующие макросы используются для выделения и удаления наборов ЦП:

source: Allocate a CPU set large enough to hold CPUs in the range 0 to I<num_cpus-1>.
ru: Выделяет набор ЦП, достаточный для хранения ЦП в диапазоне от 0 до I<num_cpus-1>.

source: Return the size in bytes of the CPU set that would be needed to hold CPUs in the range 0 to I<num_cpus-1>. This macro provides the value that can be used for the I<setsize> argument in the B<CPU_*_S>() macros described below.
ru: Возвращает размер набора ЦП в байтах, который необходим для хранения ЦП в диапазоне от 0 до I<num_cpus-1>. Данный макрос предоставляет значение, которое можно использовать в аргументе I<setsize> в макросах B<CPU_*_S>(), описанных далее.

source: Free a CPU set previously allocated by B<CPU_ALLOC>().
ru: Освобождает набор ЦП, выделенный ранее с помощью B<CPU_ALLOC>().

source: The macros whose names end with "_S" are the analogs of the similarly named macros without the suffix. These macros perform the same tasks as their analogs, but operate on the dynamically allocated CPU set(s) whose size is I<setsize> bytes.
ru: Макросы, чьи имена заканчиваются на «_S», аналогичны макросам с тем же именем без суффикса. Эти макросы выполняют те же задачи что и их аналоги, но они работают с динамически выделяемыми наборами ЦП, размер которых равен I<setsize> байт.

source: B<CPU_ISSET>() and B<CPU_ISSET_S>() return nonzero if I<cpu> is in I<set>; otherwise, it returns 0.
ru: Макросы B<CPU_ISSET>() и B<CPU_ISSET_S>() возвращают ненулевое значение, если I<cpu> есть в I<set>; в противном случае возвращается 0.

source: B<CPU_COUNT>() and B<CPU_COUNT_S>() return the number of CPUs in I<set>.
ru: Макросы B<CPU_COUNT>() и B<CPU_COUNT_S>() возвращают количество ЦП в I<set>.

source: B<CPU_EQUAL>() and B<CPU_EQUAL_S>() return nonzero if the two CPU sets are equal; otherwise they return 0.
ru: Макросы B<CPU_EQUAL>() и B<CPU_EQUAL_S>() возвращают ненулевое значение, если два набора ЦП одинаковы; в противном случае возвращается 0.

source: B<CPU_ALLOC>() returns a pointer on success, or NULL on failure. (Errors are as for B<malloc>(3).)
ru: При успешном выполнении макрос B<CPU_ALLOC>() возвращает указатель, при ошибке возвращается NULL (ошибки те же, что и у B<malloc>(3)).

source: B<CPU_ALLOC_SIZE>() returns the number of bytes required to store a CPU set of the specified cardinality.
ru: Макрос B<CPU_ALLOC_SIZE>() возвращает количество байт, требуемое для хранения набора ЦП указанных элементов.

source: The other functions do not return a value.
ru: Остальные функции не возвращают никаких значений.

source: The B<CPU_ZERO>(), B<CPU_SET>(), B<CPU_CLR>(), and B<CPU_ISSET>() macros were added in glibc 2.3.3.
ru: Макросы B<CPU_ZERO>(), B<CPU_SET>(), B<CPU_CLR>() и B<CPU_ISSET>() добавлены в glibc версии 2.3.3.

source: B<CPU_COUNT>() first appeared in glibc 2.6.
ru: Макрос B<CPU_COUNT>() впервые появилась в glibc версии 2.6.

source: B<CPU_AND>(), B<CPU_OR>(), B<CPU_XOR>(), B<CPU_EQUAL>(), B<CPU_ALLOC>(), B<CPU_ALLOC_SIZE>(), B<CPU_FREE>(), B<CPU_ZERO_S>(), B<CPU_SET_S>(), B<CPU_CLR_S>(), B<CPU_ISSET_S>(), B<CPU_AND_S>(), B<CPU_OR_S>(), B<CPU_XOR_S>(), and B<CPU_EQUAL_S>() first appeared in glibc 2.7.
ru: Макросы B<CPU_AND>(), B<CPU_OR>(), B<CPU_XOR>(), B<CPU_EQUAL>(), B<CPU_ALLOC>(), B<CPU_ALLOC_SIZE>(), B<CPU_FREE>(), B<CPU_ZERO_S>(), B<CPU_SET_S>(), B<CPU_CLR_S>(), B<CPU_ISSET_S>(), B<CPU_AND_S>(), B<CPU_OR_S>(), B<CPU_XOR_S>() и B<CPU_EQUAL_S>() впервые появились в glibc версии 2.7.

source: These interfaces are Linux-specific.
ru: Данные интерфейсы есть только в Linux.

source: To duplicate a CPU set, use B<memcpy>(3).
ru: Для создания копии набора ЦП используйте B<memcpy>(3).

source: Since CPU sets are bit masks allocated in units of long words, the actual number of CPUs in a dynamically allocated CPU set will be rounded up to the next multiple of I<sizeof(unsigned long)>. An application should consider the contents of these extra bits to be undefined.
ru: Так как наборы ЦП это битовые маски, выделяемые в единицах длинных слов, реальное количество ЦП в динамически выделенном наборе ЦП будет округлено до следующего кратного I<sizeof(unsigned long)>. Приложение должно считать содержимое этих дополнительных бит неопределённым.

source: Notwithstanding the similarity in the names, note that the constant B<CPU_SETSIZE> indicates the number of CPUs in the I<cpu_set_t> data type (thus, it is effectively a count of the bits in the bit mask), while the I<setsize> argument of the B<CPU_*_S>() macros is a size in bytes.
ru: Несмотря на похожесть имён, заметим, что константа B<CPU_SETSIZE> определяет количество ЦП в типе данных I<cpu_set_t> (то есть, эффективное количество битов в битовой маске), в то время как аргумент I<setsize> макросов B<CPU_*_S>() — это размер в байтах.

source: The data types for arguments and return values shown in the SYNOPSIS are hints what about is expected in each case. However, since these interfaces are implemented as macros, the compiler won't necessarily catch all type errors if you violate the suggestions.
ru: Типы данных параметров и возвращаемых значений, показанных в ОБЗОРЕ — подсказки, что ожидается в каждом случае. Однако так как эти интерфейсы реализованы как макросы, компилятор не обязательно поймает все ошибки приведения типов, если вы нарушите предположения.

source: On 32-bit platforms with glibc 2.8 and earlier, B<CPU_ALLOC>() allocates twice as much space as is required, and B<CPU_ALLOC_SIZE>() returns a value twice as large as it should. This bug should not affect the semantics of a program, but does result in wasted memory and less efficient operation of the macros that operate on dynamically allocated CPU sets. These bugs are fixed in glibc 2.9.
ru: На 32-разрядных платформах в glibc 2.8 и ранее B<CPU_ALLOC> () выделяет вдвое больше пространства, как требуется, и B<CPU_ALLOC_SIZE>() возвращает значение вдвое большее, чем должно. Эта ошибка не должна влиять на семантику программы, но приводит к трате впустую памяти и менее эффективной работе макросов для динамически выделяемых наборов ЦП. Эти ошибки исправлены в glibc версии 2.9.

source: The following program demonstrates the use of some of the macros used for dynamically allocated CPU sets.
ru: Следующая программа показывает использование некоторых макросов, работающих с динамически выделяемыми наборами ЦП.

source: if (argc E<lt> 2) { fprintf(stderr, "Usage: %s E<lt>num-cpusE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc E<lt> 2) { fprintf(stderr, "Использование: %s E<lt>количество-ЦПE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("CPU_COUNT() of set: %d\en", CPU_COUNT_S(size, cpusetp));
ru: printf("CPU_COUNT() набора: %d\en", CPU_COUNT_S(size, cpusetp));

source: cbrt, cbrtf, cbrtl - cube root function
ru: cbrt, cbrtf, cbrtl - функция вычисления кубического корня

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || _XOPEN_SOURCE\ E<gt>=\ 500 || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions return the (real) cube root of I<x>. This function cannot fail; every representable real value has a representable real cube root.
ru: Эти функции возвращают вещественное значение кубического корня от I<x>. Данная функция не может завершиться неудачно — любое вещественное число имеет соответствующее ему значение кубического корня.

source: These functions return the cube root of I<x>.
ru: Данные функции возвращают кубический корень от I<x>.

source: If I<x> is +0, -0, positive infinity, negative infinity, or NaN, I<x> is returned.
ru: Если I<x> равно +0, -0, плюс бесконечности, минус бесконечности или NaN, возвращается значение I<x>.

source: ceil, ceilf, ceill - ceiling function: smallest integral value not less than argument
ru: ceil, ceilf, ceill - функции округления до наименьшего целого, не меньшего, чем аргумент

source: These functions return the smallest integral value that is not less than I<x>.
ru: Данные функции возвращают наименьшее целое значение, но не меньше чем I<x>.

source: For example, I<ceil(0.5)> is 1.0, and I<ceil(-0.5)> is 0.0.
ru: Например, результатом I<ceil(0.5)> будет 1.0, а I<ceil(-0.5)> равно -0.0.

source: These functions return the ceiling of I<x>.
ru: Данные функции возвращают округлённое значение I<x>.

source: If I<x> is integral, +0, -0, NaN, or infinite, I<x> itself is returned.
ru: Если I<x> целое, +0, -0, NaN или стремится к бесконечности, то будет возвращено значение I<x>.

source: No errors occur. POSIX.1-2001 documents a range error for overflows, but see NOTES.
ru: Ошибки не возникают. В документах POSIX.1-2001 описывается ошибка диапазона при переполнениях, однако см. ЗАМЕЧАНИЯ.

source: The variant returning I<double> also conforms to SVr4, 4.3BSD, C89.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD, C89.

source: SUSv2 and POSIX.1-2001 contain text about overflow (which might set I<errno> to B<ERANGE>, or raise an B<FE_OVERFLOW> exception). In practice, the result cannot overflow on any current machine, so this error-handling stuff is just nonsense. (More precisely, overflow can happen only when the maximum value of the exponent is smaller than the number of mantissa bits. For the IEEE-754 standard 32-bit and 64-bit floating-point numbers the maximum value of the exponent is 128 (respectively, 1024), and the number of mantissa bits is 24 (respectively, 53).)
ru: В SUSv2 и POSIX.1-2001 есть текст о переполнении (которое может установить I<errno> в B<ERANGE> или вызвать исключение B<FE_OVERFLOW>). На практике, результат не может выйти за диапазон ни на каком компьютере, поэтому обработка этой ошибки не имеет смысла (точнее говоря, переполнение возможно только в том случае, когда максимальное значение экспоненты меньше числа бит мантиссы. В стандарте IEEE-754 для 32- и 64-битных чисел с плавающей точкой максимальное значение экспоненты равно 128 и 1024 соответственно, а число бит мантиссы — 24 и 53 соответственно).

source: The integral value returned by these functions may be too large to store in an integer type (I<int>, I<long>, etc.). To avoid an overflow, which will produce undefined results, an application should perform a range check on the returned value before assigning it to an integer type.
ru: Целая часть, возвращаемая этими функциями, может быть слишком большой для целого типа (I<int>, I<long> и так далее). Чтобы избежать переполнения, которое может привести к неопределенным результатам, приложение должно осуществлять проверку возвращаемого размера значения до того, как присвоить его целому типу.

source: casinh, casinhf, casinhl - complex arc sine hyperbolic
ru: casinh, casinhf, casinhl - вычисление гиперболического арксинуса комплексного числа

source: These functions calculate the complex arc hyperbolic sine of I<z>. If I<y\ =\ casinh(z)>, then I<z\ =\ csinh(y)>. The imaginary part of I<y> is chosen in the interval [-pi/2,pi/2].
ru: Эти функции вычисляют гиперболический синус комплексного числа I<z>. Если I<y\ =\ casinh(z)>, то I<z\ =\ csinh(y)>. Мнимая часть I<y> лежит в интервале [-pi/2,pi/2].

source: csqrt, csqrtf, csqrtl - complex square root
ru: csqrt, csqrtf, csqrtl - вычисление квадратного корня комплексного числа

source: These functions calculate the complex square root of I<z>, with a branch cut along the negative real axis. (That means that I<csqrt(-1+eps*I)> will be close to I while I<csqrt(-1-eps*I)> will be close to -I, I<if eps> is a small positive real number.)
ru: Эти функции вычисляют квадратный корень комплексного числа I<z>, лежащей на положительной половине абсциссы (то есть I<csqrt(-1+eps*I)> будет стремиться к I, а I<csqrt(-1-eps*I)> будет стремиться к -I, если I<eps> является маленьким положительным вещественным числом).

source: ccos, ccosf, ccosl - complex cosine function
ru: ccos, ccosf, ccosl - вычисляет комплексный косинус

source: These functions calculate the complex cosine of I<z>.
ru: Эти функции вычисляют комплексный косинус I<z>.

source: The complex cosine function is defined as:
ru: Функция комплексного косинуса определяется как:
