Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: B<close>() closes a file descriptor, so that it no longer refers to any file and may be reused. Any record locks (see B<fcntl>(2)) held on the file it was associated with, and owned by the process, are removed (regardless of the file descriptor that was used to obtain the lock).
ru: Функция B<close>() закрывает файловый дескриптор, который после этого не ссылается ни на один и файл и может быть использован повторно. Все блокировки (см. B<fcntl>(2)), связанные с соответствующим файлом и принадлежащие процессу, снимаются (независимо от того, какой файловый дескриптор был ли использован для установки блокировки).

source: If I<fd> is the last file descriptor referring to the underlying open file description (see B<open>(2)), the resources associated with the open file description are freed; if the file descriptor was the last reference to a file which has been removed using B<unlink>(2), the file is deleted.
ru: Если I<fd> является последней копией какого-либо файлового дескриптора, ссылающегося на используемое описание открытого файла, (см. B<open>(2)), то ресурсы, связанные с описанием открытого файла, освобождаются; если файловый дескриптор был последней ссылкой на файл, удалённый с помощью B<unlink>(2), то файл окончательно удаляется.

source: B<close>() returns zero on success. On error, -1 is returned, and I<errno> is set appropriately.
ru: При успешном выполнении функции B<close>() возвращается 0. В случае ошибки возвращается -1, а I<errno> устанавливается в соответствующее значение.

source: I<fd> isn't a valid open file descriptor.
ru: Значение I<fd> не является допустимым открытым файловым дескриптором.

source: The B<close>() call was interrupted by a signal; see B<signal>(7).
ru: Вызов B<close>() был прерван по сигналу; см. B<signal>(7).

source: On NFS, these errors are not normally reported against the first write which exceeds the available storage space, but instead against a subsequent B<write>(2), B<fsync>(2), or B<close>().
ru: Для NFS об этих ошибках, обычно, не сообщается при первой записи, которая превысила доступное пространство памяти, а только в последующем B<write>(), B<fsync>(2) или B<close>().

source: See NOTES for a discussion of why B<close>() should not be retried after an error.
ru: Смотрите в ЗАМЕЧАНИЯХ почему B<close>() нельзя вызывать снова после ошибки.

source: A successful close does not guarantee that the data has been successfully saved to disk, as the kernel uses the buffer cache to defer writes. Typically, filesystems do not flush buffers when a file is closed. If you need to be sure that the data is physically stored on the underlying disk, use B<fsync>(2). (It will depend on the disk hardware at this point.)
ru: Выполнение закрытия без ошибок не гарантирует, что данные были успешно записаны на диск, так как в ядре используется буферный кэш для отложенных записей. Как правило, файловые системы не записывают буферы при закрытии файла. Если требуется гарантировать физическую запись на используемый диск, то можно использовать B<fsync>(2) (дальше всё будет зависеть от аппаратной составляющей диска).

source: The close-on-exec file descriptor flag can be used to ensure that a file descriptor is automatically closed upon a successful B<execve>(2); see B<fcntl>(2) for details.
ru: Флаг файлового дескриптора закрытие-при-exec можно использовать для гарантии того, что файловый дескриптор автоматически закроется при успешном выполнении B<execve>(2); подробности смотрите в B<fcntl>(2).

source: It is probably unwise to close file descriptors while they may be in use by system calls in other threads in the same process. Since a file descriptor may be reused, there are some obscure race conditions that may cause unintended side effects.
ru: Вероятно неблагоразумно закрывать дескрипторы файла, в то время как они могут использоваться системными вызовами других нитей того же процесса. Так как файловый дескриптор может использоваться повторно, есть некоторые неясные условия возникновения гонок, которые могут вызвать непреднамеренные побочные эффекты.

source: Dealing with error returns from close()
ru: Обработка ошибки, возвращённой close()

source: A careful programmer will check the return value of B<close>(), since it is quite possible that errors on a previous B<write>(2) operation are reported only on the final B<close>() that releases the open file description. Failing to check the return value when closing a file may lead to I<silent> loss of data. This can especially be observed with NFS and with disk quota.
ru: Аккуратный программист всегда проверяет возвращаемое B<close>() значение, так как очень вероятно, что об ошибках предыдущей операции B<write>(2) будет сообщено только при последнем вызове B<close>(), который освобождает описание открытого файла. Невыполнение проверки возвращаемого значение при закрытии файла может привести к I<неучтённой> потере данных. Это особенно часто встречается с NFS и дисковыми квотами.

source: Note, however, that a failure return should be used only for diagnostic purposes (i.e., a warning to the application that there may still be I/O pending or there may have been failed I/O) or remedial purposes (e.g., writing the file once more or creating a backup).
ru: Однако заметим, что возвращаемая ошибка должна использоваться только для диагностики (т. е., предупредить приложение, что, возможно, есть незаконченные операции ввода-вывода или произошла ошибка ввода-вывода) или исправления (например, повторной записи файла или создания резервной копии).

source: Retrying the B<close>() after a failure return is the wrong thing to do, since this may cause a reused file descriptor from another thread to be closed. This can occur because the Linux kernel I<always> releases the file descriptor early in the close operation, freeing it for reuse; the steps that may return an error, such as flushing data to the filesystem or device, occur only later in the close operation.
ru: Повторный вызов B<close>() после получения ошибки делать не стоит, так как это может привести к закрытию повторно использованного файлового дескриптора другой нити. Это может произойти из-за того, что ядро Linux I<всегда> освобождает файловый дескриптор в самом начале операции закрытия, делая его доступным для повторного использования; шаги, которые могут вернуть ошибку, такие как сброс данных в файловую систему или устройство, происходят только после операции закрытия.

source: Many other implementations similarly always close the file descriptor (except in the case of B<EBADF>, meaning that the file descriptor was invalid) even if they subsequently report an error on return from B<close>(). POSIX.1 is currently silent on this point, but there are plans to mandate this behavior in the next major release of the standard.
ru: Многие другие реализации поступают схожим образом и всегда закрывают файловый дескриптор (за исключением случая B<EBADF>, означающего некорректный файловый дескриптор) даже, если они затем возвратят ошибку B<close>(). В POSIX.1 ничего не сказано на этот счёт, но есть планы узаконить такое поведение в следующем выпуске стандарта.

source: A careful programmer who wants to know about I/O errors may precede B<close>() with a call to B<fsync>(2).
ru: Аккуратный программист, который хочет узнать об ошибках ввода-вывода, перед B<close>() вызовет B<fsync>(2).

source: The B<EINTR> error is a somewhat special case. Regarding the B<EINTR> error, POSIX.1-2013 says:
ru: Ошибка B<EINTR> является особым случаем. Про B<EINTR> в POSIX.1-2013 сказано:

source: If B<close>() is interrupted by a signal that is to be caught, it shall return -1 with I<errno> set to B<EINTR> and the state of I<fildes> is unspecified.
ru: Если B<close>() прерван сигналом, который будет обработан, то вызов должен вернуть -1, а I<errno> присвоить значение B<EINTR>; при этом состояние I<fildes> не определено.

source: This permits the behavior that occurs on Linux and many other implementations, where, as with other errors that may be reported by B<close>(), the file descriptor is guaranteed to be closed. However, it also permits another possibility: that the implementation returns an B<EINTR> error and keeps the file descriptor open. (According to its documentation, HP-UX's B<close>() does this.) The caller must then once more use B<close>() to close the file descriptor, to avoid file descriptor leaks. This divergence in implementation behaviors provides a difficult hurdle for portable applications, since on many implementations, B<close>() must not be called again after an B<EINTR> error, and on at least one, B<close>() must be called again. There are plans to address this conundrum for the next major release of the POSIX.1 standard.
ru: Этим допускается режим работы, действующий в Linux и многих других реализациях, где как и при других ошибках, которые может вернуть B<close>(), файловый дескриптор гарантированно закрывается. Однако, это также допускает и другой режим: реализация возвращает ошибку B<EINTR> и оставляет файловый дескриптор открытым (согласно документации, так делает B<close>() в HP-UX). Вызывающий должен позднее ещё раз вызвать B<close>() для закрытия файлового дескриптора, чтобы не допустить утечек файловых дескрипторов. Такое расхождение в поведении реализаций является сложным препятствием для переносимых приложений, так как во многих реализациях B<close>() не должен вызываться ещё раз после получения ошибки B<EINTR> и, по крайней мере, в одной B<close>() нужно вызвать снова. Есть планы разгадать эту загадку в следующей большой версии стандарта POSIX.1.

source: clone, __clone2 - create a child process
ru: clone, __clone2 - создать процесс-потомок

source: /* Prototype for the glibc wrapper function */
ru: /* Прототип обёрточной функции glibc */

source: /* For the prototype of the raw system call, see NOTES */
ru: /* для прототипа неструктурированного системного вызова, смотрите ЗАМЕЧАНИЯ */

source: B<clone>() creates a new process, in a manner similar to B<fork>(2).
ru: Вызов B<clone>() создаёт новый процесс подобно B<fork>(2).

source: This page describes both the glibc B<clone>() wrapper function and the underlying system call on which it is based. The main text describes the wrapper function; the differences for the raw system call are described toward the end of this page.
ru: Здесь описана обёрточная функция glibc B<clone>() и используемый ею системный вызов. В основном, описывается обёрточная функция;отличия от системного вызова приводятся в конце данной справочной страницы.

source: Unlike B<fork>(2), B<clone>() allows the child process to share parts of its execution context with the calling process, such as the virtual address space, the table of file descriptors, and the table of signal handlers. (Note that on this manual page, "calling process" normally corresponds to "parent process". But see the description of B<CLONE_PARENT> below.)
ru: В отличие от B<fork>(2), B<clone>() позволяет процессу-потомку использовать некоторые части контекста выполнения совместно с вызывающим процессом, например: виртуальное адресное пространство, таблица файловых дескрипторов и таблица обработчиков сигналов. Заметим, что в данной справочной странице «вызывающий процесс» обычно соответствует «родительскому процессу». Но смотрите ниже описание B<CLONE_PARENT>.

source: One use of B<clone>() is to implement threads: multiple flows of control in a program that run concurrently in a shared address space.
ru: Одним из вариантов использования вызова B<clone>() является реализация нитей: несколько потоков управления в программе, выполняющиеся одновременно в общем адресном пространстве.

source: When the child process is created with B<clone>(), it commences execution by calling the function pointed to by the argument I<fn>. (This differs from B<fork>(2), where execution continues in the child from the point of the B<fork>(2) call.) The I<arg> argument is passed as the argument of the function I<fn>.
ru: Когда процесс-потомок создаётся с помощью B<clone>(), он начинает выполнение с вызова функции, на которую указывает I<fn> (это отличается от B<fork>(2), где выполнение продолжается в потомке от точки вызова B<fork>(2)). Аргумент I<arg> передаётся в функцию I<fn>.

source: When the I<fn>(I<arg>) function returns, the child process terminates. The integer returned by I<fn> is the exit status for the child process. The child process may also terminate explicitly by calling B<exit>(2) or after receiving a fatal signal.
ru: Когда происходит возврат из функции I<fn>(I<arg>) процесс-потомок завершается. Целое значение, возвращаемое I<fn>, является состоянием выхода процесса-потомка. Процесс-потомок может также быть завершён явным образом с помощью вызова B<exit>(2) или после получения завершающего сигнала.

source: The I<child_stack> argument specifies the location of the stack used by the child process. Since the child and calling process may share memory, it is not possible for the child process to execute in the same stack as the calling process. The calling process must therefore set up memory space for the child stack and pass a pointer to this space to B<clone>(). Stacks grow downward on all processors that run Linux (except the HP PA processors), so I<child_stack> usually points to the topmost address of the memory space set up for the child stack.
ru: Аргумент I<child_stack> задаёт положение стека, используемого процессом-потомком. Так как процесс-потомок и вызывающий процесс могут использовать общую память, процесс-потомок не может выполняться в том же стеке, что и вызывающий процесс. Поэтому вызывающий процесс должен установить пространство памяти для стека процесса-потомка и передать указатель на это пространство в вызове B<clone>(). Стеки растут вниз для всех процессоров, на которых работает Linux (за исключением процессоров HP PA), так что I<child_stack>, обычно, указывает на наибольший адрес в пространстве памяти, которое устанавливается для стека процесса-потомка.

source: The low byte of I<flags> contains the number of the I<termination signal> sent to the parent when the child dies. If this signal is specified as anything other than B<SIGCHLD>, then the parent process must specify the B<__WALL> or B<__WCLONE> options when waiting for the child with B<wait>(2). If no signal is specified, then the parent process is not signaled when the child terminates.
ru: Младший байт I<flags> содержит номер I<сигнала завершения>, который посылается родителю, когда работа потомка завершается. Если этот сигнал задаётся как нечто отличное от B<SIGCHLD>, то родительский процесс должен задать параметр B<__WALL> или B<__WCLONE> при ожидании завершения работы потомка с помощью вызова B<wait>(2). Если никакой сигнал не задан, то родительский процесс не извещается сигналом, когда потомок завершается.

source: I<flags> may also be bitwise-ORed with zero or more of the following constants, in order to specify what is shared between the calling process and the child process:
ru: Аргумент I<flags> состоит из одной или более данных ниже констант, которые складываются по правилам битового сложения (OR). Флагами задаёт что будет общим между вызывающим процессом и процессом-потомком:

source: B<CLONE_CHILD_CLEARTID> (since Linux 2.5.49)
ru: B<CLONE_CHILD_CLEARTID> (начиная с Linux 2.5.49)

source: Clear (zero) the child thread ID at the location I<ctid> in child memory when the child exits, and do a wakeup on the futex at that address. The address involved may be changed by the B<set_tid_address>(2) system call. This is used by threading libraries.
ru: Очистить (обнулить) идентификатор (ID) нити потомка, расположенный в I<ctid> в памяти потомка, если потомок существует, и активизировать futex по этому адресу. Соответствующий адрес может быть изменён системным вызовом B<set_tid_address>(2). Используется в библиотеках работы с нитями.

source: B<CLONE_CHILD_SETTID> (since Linux 2.5.49)
ru: B<CLONE_CHILD_SETTID> (начиная с Linux 2.5.49)

source: Store the child thread ID at the location I<ctid> in the child's memory. The store operation completes before B<clone>() returns control to user space in the child process. (Note that the store operation may not have completed before B<clone>() returns in the parent process, which will be relevant if the B<CLONE_VM> flag is also employed.)
ru: Сохранить ID нити потомка в указанном I<ctid> месте в памяти потомка. Операция сохранения завершается до возврата управления из B<clone>() в пользовательское пространство процесса потомка (заметим, что операция сохранения может не завершиться до возврата B<clone>() в родительском процессе, что произойдёт даже с указанным флагом B<CLONE_VM>).

source: B<CLONE_FILES> (since Linux 2.0)
ru: B<CLONE_FILES> (начиная с Linux 2.0)

source: If B<CLONE_FILES> is set, the calling process and the child process share the same file descriptor table. Any file descriptor created by the calling process or by the child process is also valid in the other process. Similarly, if one of the processes closes a file descriptor, or changes its associated flags (using the B<fcntl>(2) B<F_SETFD> operation), the other process is also affected. If a process sharing a file descriptor table calls B<execve>(2), its file descriptor table is duplicated (unshared).
ru: Если задан флаг B<CLONE_FILES>, то вызывающий процесс и процесс-потомок используют одну и ту же таблицу файловых дескрипторов. Любые файловые дескрипторы, создаваемые вызывающим процессом или процессом-потомком, также доступны и в другом процессе. Аналогично, если один из процессов закрывает файловый дескриптор или изменяет ассоциированные с ним флаги (с помощью B<fcntl>(2) операцией B<F_SETFD>), то это оказывает влияние и на другой процесс. Если процесс использующий общую таблицу файловых дескрипторов вызывает B<execve>(2), то таблица файловых дескрипторов копируется в отдельную (не общую).

source: If B<CLONE_FILES> is not set, the child process inherits a copy of all file descriptors opened in the calling process at the time of B<clone>(). Subsequent operations that open or close file descriptors, or change file descriptor flags, performed by either the calling process or the child process do not affect the other process. Note, however, that the duplicated file descriptors in the child refer to the same open file descriptions as the corresponding file descriptors in the calling process, and thus share file offsets and file status flags (see B<open>(2)).
ru: Если флаг B<CLONE_FILES> не задан, то процесс-потомок наследует копии всех файловых дескрипторов, открытых в вызывающем процессе на момент вызова B<clone>(). Последующие операции над файловыми дескрипторами по открытию и закрытию файлов или изменению флагов файловых дескрипторов, выполняемые вызывающим процессом или процессом-потомком, не оказывают эффекта на другой процесс. Заметим, что дублируемые файловые дескрипторы в потомке указывают на те же открытые файловые дескрипторы что и файловые дескрипторы вызывающего процесса и, таким образом, файловые смещения и флаги состояния файла используются совместно (смотрите B<open>(2)).

source: B<CLONE_FS> (since Linux 2.0)
ru: B<CLONE_FS> (начиная с Linux 2.0)

source: If B<CLONE_FS> is set, the caller and the child process share the same filesystem information. This includes the root of the filesystem, the current working directory, and the umask. Any call to B<chroot>(2), B<chdir>(2), or B<umask>(2) performed by the calling process or the child process also affects the other process.
ru: Если задан флаг B<CLONE_FS>, то вызывающий процесс и процесс-потомок используют одну и ту же информацию о файловой системе. К ней относится корневой каталог файловой системы, текущий рабочий каталог и значение umask. Любой вызов, B<chroot>(2), B<chdir>(2) или B<umask>(2), выполняемый одним процессом, оказывает влияние и на другой.

source: If B<CLONE_FS> is not set, the child process works on a copy of the filesystem information of the calling process at the time of the B<clone>() call. Calls to B<chroot>(2), B<chdir>(2), or B<umask>(2) performed later by one of the processes do not affect the other process.
ru: Если флаг B<CLONE_FS> не задан, то процесс-потомок работает с копией информации о файловой системе вызывающего процесса, снятой на момент вызова B<clone>(). Вызовы B<chroot>(2), B<chdir>(2) или B<umask>(2), выполняемые позже одним из процессов, не оказывают эффект на другой процесс.

source: B<CLONE_IO> (since Linux 2.6.25)
ru: B<CLONE_IO> (начиная Linux 2.6.25)

source: If B<CLONE_IO> is set, then the new process shares an I/O context with the calling process. If this flag is not set, then (as with B<fork>(2)) the new process has its own I/O context.
ru: Если задан флаг B<CLONE_IO>, то новый процесс использует общий контекст ввода-вывода с вызывающим процессом. Если этот флаг не установлен, то (как и в B<fork>(2)) новый процесс будет иметь свой отдельный контекст ввода-вывода.

source: The I/O context is the I/O scope of the disk scheduler (i.e., what the I/O scheduler uses to model scheduling of a process's I/O). If processes share the same I/O context, they are treated as one by the I/O scheduler. As a consequence, they get to share disk time. For some I/O schedulers, if two processes share an I/O context, they will be allowed to interleave their disk access. If several threads are doing I/O on behalf of the same process (B<aio_read>(3), for instance), they should employ B<CLONE_IO> to get better I/O performance.
ru: Контекст ввода-вывода — это область ввода-вывода в дисковом планировщике (т. е. то, что планировщик ввода-вывода использует при планировании ввода-вывода процесса). Если процессы используют общий контекст ввода-вывода, то они рассматриваются планировщиком ввода-вывода как один. Следовательно, они совместно делят время доступа к диску. У некоторых планировщиков ввода-вывода, если два процесса используют общий контекст ввода-вывода, то им будет разрешено чередовать доступ к диску. Если несколько нитей выполняют ввод-вывод из одного процесса (например, B<aio_read>(3)), то для них нужно указать B<CLONE_IO> для получения большей производительности ввода-вывода.

source: If the kernel is not configured with the B<CONFIG_BLOCK> option, this flag is a no-op.
ru: Если в ядре не указан параметр сборки B<CONFIG_BLOCK>, то этот флаг ни на что не влияет.

source: B<CLONE_NEWCGROUP> (since Linux 4.6)
ru: B<CLONE_NEWCGROUP> (начиная с Linux 4.6)

source: Create the process in a new cgroup namespace. If this flag is not set, then (as with B<fork>(2)) the process is created in the same cgroup namespaces as the calling process. This flag is intended for the implementation of containers.
ru: Процесс создаётся в новом пространстве имён cgroup. Если флаг не установлен, то (как и в B<fork>(2)), процесс создаётся в том же пространстве имён cgroup, что и вызывающий процесс. Этот флаг предназначен для реализации контейнеров.

source: For further information on cgroup namespaces, see B<cgroup_namespaces>(7).
ru: Дополнительную информацию о пространствах имён cgroup смотрите в B<cgroup_namespaces>(7).

source: Only a privileged process (B<CAP_SYS_ADMIN>) can employ B<CLONE_NEWCGROUP>.
ru: Только привилегированный процесс (B<CAP_SYS_ADMIN>) может использовать B<CLONE_NEWCGROUP>.

source: B<CLONE_NEWIPC> (since Linux 2.6.19)
ru: B<CLONE_NEWIPC> (начиная с Linux 2.6.19)

source: If B<CLONE_NEWIPC> is set, then create the process in a new IPC namespace. If this flag is not set, then (as with B<fork>(2)), the process is created in the same IPC namespace as the calling process. This flag is intended for the implementation of containers.
ru: Если задан флаг B<CLONE_NEWIPC>, то процесс создаётся в новом пространстве имён IPC. Если этот флаг не установлен, то (как и в B<fork>(2)) процесс создаётся в том же пространстве имён IPC что и вызывающий процесс. Этот флаг предназначен для реализации контейнеров.
