Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: /* Change hostname in UTS namespace of child */
ru: /* Изменяем имя узла в пространстве имён UTS потомка */

source: /* Retrieve and display hostname */
ru: /* Получаем и показывает имя узла */

source: /* Keep the namespace open for a while, by sleeping. This allows some experimentation--for example, another process might join the namespace. */
ru: /* Перед сном оставим пространство имён открытым. Это позволяет поэкспериментировать — например, другой процесс может подключиться к пространству имён. */

source: return 0; /* Child terminates now */ }
ru: return 0; /* Завершение работы потомка */ }

source: #define STACK_SIZE (1024 * 1024) /* Stack size for cloned child */
ru: #define STACK_SIZE (1024 * 1024) /* Размер стека клонированного потомка */

source: int main(int argc, char *argv[]) { char *stack; /* Start of stack buffer */ char *stackTop; /* End of stack buffer */ pid_t pid; struct utsname uts;
ru: int main(int argc, char *argv[]) { char *stack; /* Начало буфера стека */ char *stackTop; /* Конец буфера стека */ pid_t pid; struct utsname uts;

source: /* Allocate stack for child */
ru: /* Выделение стека для потомка */

source: stack = malloc(STACK_SIZE); if (stack == NULL) errExit("malloc"); stackTop = stack + STACK_SIZE; /* Assume stack grows downward */
ru: stack = malloc(STACK_SIZE); if (stack == NULL) errExit("malloc"); stackTop = stack + STACK_SIZE; /* Считаем, что стек растёт вниз */

source: /* Create child that has its own UTS namespace; child commences execution in childFunc() */
ru: /* Создаём потомка с собственным пространством имён UTS; потомок начинает выполнение с childFunc() */

source: /* Parent falls through to here */
ru: /* Предок попадает сюда */

source: sleep(1); /* Give child time to change its hostname */
ru: sleep(1); /* Даём время потомку изменить своё имя узла */

source: /* Display hostname in parent\(aqs UTS namespace. This will be different from hostname in child\(aqs UTS namespace. */
ru: /* Показываем имя узла в пространстве имён UTS предка. Оно будет отличаться от имени узла в пространстве имён UTS потомка. */

source: if (waitpid(pid, NULL, 0) == -1) /* Wait for child */ errExit("waitpid"); printf("child has terminated\en");
ru: if (waitpid(pid, NULL, 0) == -1) /* Ждём потомка */ errExit("waitpid"); printf("child has terminated\en");

source: cacheflush - flush contents of instruction and/or data cache
ru: cacheflush - выталкивает содержимое кэша инструкций и/или данных

source: B<cacheflush>() flushes the contents of the indicated cache(s) for the user addresses in the range I<addr> to I<(addr+nbytes-1)>. I<cache> may be one of:
ru: B<cacheflush>() выталкивает содержимое указанного кэша(ей) обратно в пользовательское адресное пространство в диапазоне с I<addr> по I<(addr+nbytes-1)>. Параметр I<cache> может принимать одно из значений:

source: Flush the instruction cache.
ru: Выталкивает кэш инструкций.

source: Write back to memory and invalidate the affected valid cache lines.
ru: Записать обратно в память и объявить недействительными задетые достоверные строки кэша.

source: Same as B<(ICACHE|DCACHE)>.
ru: Тоже что и B<(ICACHE|DCACHE)>.

source: B<cacheflush>() returns 0 on success or -1 on error. If errors are detected, I<errno> will indicate the error.
ru: При успешном завершении B<cacheflush>() возвращает 0 или -1 при ошибке. Если обнаружены ошибки, то I<errno> будет содержать номер ошибки.

source: Some or all of the address range I<addr> to I<(addr+nbytes-1)> is not accessible.
ru: Некоторая часть или весь диапазон адресов с I<addr> по I<(addr+nbytes-1)> недоступен.

source: I<cache> is not one of B<ICACHE>, B<DCACHE>, or B<BCACHE> (but see BUGS).
ru: Значение I<cache> не равно B<ICACHE>, B<DCACHE> или B<BCACHE> (но смотрите ДЕФЕКТЫ).

source: Historically, this system call was available on all MIPS UNIX variants including RISC/os, IRIX, Ultrix, NetBSD, OpenBSD, and FreeBSD (and also on some non-UNIX MIPS operating systems), so that the existence of this call in MIPS operating systems is a de-facto standard.
ru: В прошлом, данный системный вызов был доступен во всех вариантах UNIX на MIPS включая RISC/os, IRIX, Ultrix, NetBSD, OpenBSD и FreeBSD (и также в некоторых ОС не-UNIX MIPS), поэтому существование этого вызова в ОС на MIPS является стандартом де-факто.

source: Caveat
ru: Предостережение

source: B<cacheflush>() should not be used in programs intended to be portable. On Linux, this call first appeared on the MIPS architecture, but nowadays, Linux provides a B<cacheflush>() system call on some other architectures, but with different arguments.
ru: Вызов B<cacheflush>() не должен использоваться в переносимых программах. В Linux, этот вызов сперва появился на архитектуре MIPS, но в настоящее время Linux предоставляет системный вызов B<cacheflush>() и на других архитектурах, но с другими аргументами.

source: Linux kernels older than version 2.6.11 ignore the I<addr> and I<nbytes> arguments, making this function fairly expensive. Therefore, the whole cache is always flushed.
ru: Ядра Linux до версии 2.6.11 игнорируют аргументы I<addr> и I<nbytes>, что делает этот вызов относительно дорогим — всегда очищается весь кэш.

source: This function always behaves as if B<BCACHE> has been passed for the I<cache> argument and does not do any error checking on the I<cache> argument.
ru: Данный вызов всегда поступает так, как если бы в аргументе I<cache> передавалось значение B<BCACHE>, и не выполняет проверку ошибочности значения I<cache>.

source: chmod, fchmod, fchmodat - change permissions of a file
ru: chmod, fchmod, fchmodat - изменяет права доступа к файлу

source: B<#include E<lt>fcntl.hE<gt>> /* Definition of AT_* constants */ B<#include E<lt>sys/stat.hE<gt>>
ru: B<#include E<lt>fcntl.hE<gt>> /* определения констант AT_* */ B<#include E<lt>sys/stat.hE<gt>>

source: Since glibc 2.24: _POSIX_C_SOURCE\ E<gt>=\ 199309L
ru: начиная с glibc 2.24: _POSIX_C_SOURCE\ E<gt>=\ 199309L

source: Glibc 2.19 to 2.23 _POSIX_C_SOURCE
ru: в glibc 2.19 по 2.23 _POSIX_C_SOURCE

source: Glibc 2.16 to 2.19: _BSD_SOURCE || _POSIX_C_SOURCE
ru: в glibc 2.16 по 2.19: _BSD_SOURCE || _POSIX_C_SOURCE

source: Glibc 2.12 to 2.16: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500 || _POSIX_C_SOURCE E<gt>= 200809L
ru: в glibc 2.12 по 2.16: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500 || _POSIX_C_SOURCE E<gt>= 200809L

source: Glibc 2.11 and earlier: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500
ru: в glibc 2.11 и старее: _BSD_SOURCE || _XOPEN_SOURCE\ E<gt>=\ 500

source: Since glibc 2.10:
ru: Начиная с glibc 2.10:

source: Before glibc 2.10:
ru: До glibc 2.10:

source: The B<chmod>() and B<fchmod>() system calls change a files mode bits. (The file mode consists of the file permission bits plus the set-user-ID, set-group-ID, and sticky bits.) These system calls differ only in how the file is specified:
ru: Системные вызовы B<chmod>() и B<fchmod>() изменяют биты режима файла (режим файла состоит из бит прав доступа к файлу плюс биты set-user-ID, set-group-ID и бит закрепления) Данные системные вызовы отличаются только способом указания файла:

source: B<chmod>() changes the mode of the file specified whose pathname is given in I<pathname>, which is dereferenced if it is a symbolic link.
ru: Вызов B<chmod>() изменяет режим файла, задаваемого путём из параметра I<pathname>, который разыменовывается, если является символьной ссылкой.

source: B<fchmod>() changes the mode of the file referred to by the open file descriptor I<fd>.
ru: Вызов B<fchown>() изменяет режим файла, задаваемого открытым файловым дескриптором I<fd>.

source: The new file mode is specified in I<mode>, which is a bit mask created by ORing together zero or more of the following:
ru: Новый режим файла указывается в I<mode> и представляет собой битовую маску, создаваемую побитовым сложением нуля или более следующих констант:

source: set-user-ID (set process effective user ID on B<execve>(2))
ru: set-user-ID (установить эффективный идентификатор пользователя процесса при B<execve>(2))

source: set-group-ID (set process effective group ID on B<execve>(2); mandatory locking, as described in B<fcntl>(2); take a new file's group from parent directory, as described in B<chown>(2) and B<mkdir>(2))
ru: set-group-ID (установить эффективный идентификатор группы процесса при B<execve>(2); обязательная блокировка, описывается в B<fcntl>(2); выбрать новую группу файла от родительского каталога, описывается в B<chown>(2) и B<mkdir>(2))

source: sticky bit (restricted deletion flag, as described in B<unlink>(2))
ru: закрепляющий бит (ограничительный флаг удаления, описывается в B<unlink>(2))

source: read by owner
ru: владелец может читать

source: write by owner
ru: владелец может писать

source: execute/search by owner ("search" applies for directories, and means that entries within the directory can be accessed)
ru: владелец может выполнять файл или искать в каталоге ("поиск" применим к каталогам и означает, что к элементам внутри каталога есть доступ)

source: read by group
ru: группа-владелец может читать

source: write by group
ru: группа-владелец может писать

source: execute/search by group
ru: группа-владелец может выполнять файл или искать в каталоге

source: read by others
ru: все остальные могут читать

source: write by others
ru: все остальные могут писать

source: execute/search by others
ru: все остальные могут выполнять файл или искать в каталоге

source: The effective UID of the calling process must match the owner of the file, or the process must be privileged (Linux: it must have the B<CAP_FOWNER> capability).
ru: Эффективный идентификатор пользователя (UID) вызывающего процесса должен совпадать с UID владельца файла или процесс должен быть привилегированным (Linux: у него должен быть мандат B<CAP_FOWNER>).

source: If the calling process is not privileged (Linux: does not have the B<CAP_FSETID> capability), and the group of the file does not match the effective group ID of the process or one of its supplementary group IDs, the B<S_ISGID> bit will be turned off, but this will not cause an error to be returned.
ru: Если вызывающий процесс не является привилегированным (Linux: не имеет мандата B<CAP_FSETID>), а группа-владелец файла не совпадает с эффективным групповым ID процесса или одним из его дополнительных групповых идентификаторов, то бит B<S_ISGID> будет сброшен, но ошибки при этом не возникнет.

source: As a security measure, depending on the filesystem, the set-user-ID and set-group-ID execution bits may be turned off if a file is written. (On Linux, this occurs if the writing process does not have the B<CAP_FSETID> capability.) On some filesystems, only the superuser can set the sticky bit, which may have a special meaning. For the sticky bit, and for set-user-ID and set-group-ID bits on directories, see B<inode>(7).
ru: В зависимости от файловой системы в целях безопасности биты выполнения set-user-ID и set-group-ID могут сбрасываться при записи в файл (в Linux это происходит, если записывающий процесс не имеет мандата B<CAP_FSETID>). В некоторых файловых системах только суперпользователь может устанавливать закрепляющий бит, который может иметь специальное назначение. Значения закрепляющего бита, set-user-ID и set-group-ID для каталогов смотрите в B<inode>(7).

source: On NFS filesystems, restricting the permissions will immediately influence already open files, because the access control is done on the server, but open files are maintained by the client. Widening the permissions may be delayed for other clients if attribute caching is enabled on them.
ru: В файловых системах NFS ограничивающие права сразу начинают действовать даже уже на открытые файлы, так как контроль доступа выполняется сервером, но открытые файлы находятся в ведении клиента. Распространение прав может откладываться для других клиентов, если у них установлен атрибут кэширования.

source: The B<fchmodat>() system call operates in exactly the same way as B<chmod>(), except for the differences described here.
ru: Системный вызов B<fchmodat>() работает также как системный вызов B<chmod>(), за исключением случаев, описанных здесь.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<chmod>() for a relative pathname).
ru: Если в I<pathname> задан относительный путь, то он считается относительно каталога, на который ссылается файловый дескриптор I<dirfd> (а не относительно текущего рабочего каталога вызывающего процесса, как это делается в B<chmod>()).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<chmod>()).
ru: Если в I<pathname> задан относительный путь и I<dirfd> равно специальному значению B<AT_FDCWD>, то I<pathname> рассматривается относительно текущего рабочего каталога вызывающего процесса (как B<chmod>()).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
ru: Если в I<pathname> задан абсолютный путь, то I<dirfd> игнорируется.

source: I<flags> can either be 0, or include the following flag:
ru: Значение I<flags> может быть 0, или включать следующие флаги:

source: If I<pathname> is a symbolic link, do not dereference it: instead operate on the link itself. This flag is not currently implemented.
ru: Если значение I<pathname> является символьной ссылкой, не разыменовывать её, а изменить права на самой ссылке. Этот флаг пока не реализован.

source: See B<openat>(2) for an explanation of the need for B<fchmodat>().
ru: Смотрите в B<openat>(2) объяснение необходимости B<fchmodat>().

source: Depending on the filesystem, errors other than those listed below can be returned.
ru: В зависимости от файловой системы могут также возвращаться другие ошибки, перечисленные далее.

source: The more general errors for B<chmod>() are listed below:
ru: Наиболее распространённые ошибки B<chmod>() перечислены далее:

source: I<pathname> points outside your accessible address space.
ru: Аргумент I<pathname> указывает за пределы доступного адресного пространства.

source: Too many symbolic links were encountered in resolving I<pathname>.
ru: Во время определения I<pathname> встретилось слишком много символьных ссылок.

source: I<pathname> is too long.
ru: Слишком длинное значение аргумента I<pathname>.

source: A component of the path prefix is not a directory.
ru: Компонент в префиксе пути не является каталогом.

source: The effective UID does not match the owner of the file, and the process is not privileged (Linux: it does not have the B<CAP_FOWNER> capability).
ru: Эффективный UID не совпадает с идентификатором владельца файла, а процесс не является привилегированным (Linux: не имеет мандата B<CAP_FOWNER>).

source: The file is marked immutable or append-only. (See B<ioctl_iflags>(2).)
ru: Файл помечен как неизменяемый (immutable) или только для добавления (смотрите B<ioctl_iflags>(2)).

source: The named file resides on a read-only filesystem.
ru: Указанный файл находится на файловой системе, смонтированной только для чтения.

source: The general errors for B<fchmod>() are listed below:
ru: Общий набор ошибок для B<fchmod>() таков:

source: The file descriptor I<fd> is not valid.
ru: Файловый дескриптор I<fd> не действителен.

source: See above.
ru: См. выше.

source: The same errors that occur for B<chmod>() can also occur for B<fchmodat>(). The following additional errors can occur for B<fchmodat>():
ru: В B<fchmodat>() могут возникнуть те же ошибки, что и в B<chmod>(). Также, в B<fchmodat>() могут возникнуть следующие ошибки:

source: I<dirfd> is not a valid file descriptor.
ru: Значение I<dirfd> не является правильным файловым дескриптором.

source: Invalid flag specified in I<flags>.
ru: Указано неверное значение в I<flags>.

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
ru: Значение I<pathname> содержит относительный путь и I<dirfd> содержит файловый дескриптор, указывающий на файл, а не на каталог.

source: I<flags> specified B<AT_SYMLINK_NOFOLLOW>, which is not supported.
ru: В I<flags> указано B<AT_SYMLINK_NOFOLLOW>, но оно не поддерживается.

source: B<fchmodat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
ru: Вызов B<fchmodat>() был добавлен в ядро Linux версии 2.6.16; поддержка в glibc доступна с версии 2.4.

source: The GNU C library B<fchmodat>() wrapper function implements the POSIX-specified interface described in this page. This interface differs from the underlying Linux system call, which does I<not> have a I<flags> argument.
ru: В этой странице описана обёрточная функция B<fchmodat>() библиотеки GNU C, реализующая POSIX-интерфейс. Данный интерфейс отличается от лежащего в основе системного вызова Linux тем, что имеет аргумент I<flags>.

source: Glibc notes
ru: Замечания по glibc

source: On older kernels where B<fchmodat>() is unavailable, the glibc wrapper function falls back to the use of B<chmod>(). When I<pathname> is a relative pathname, glibc constructs a pathname based on the symbolic link in I</proc/self/fd> that corresponds to the I<dirfd> argument.
ru: В старых ядрах, где B<fchmodat>() отсутствует, обёрточная функция glibc использует B<chmod>(). Если I<pathname> является относительным путём, то glibc собирает путь относительно символической ссылки в I</proc/self/fd>, которая соответствует аргументу I<dirfd>.

source: clock_nanosleep - high-resolution sleep with specifiable clock
ru: clock_nanosleep - остановка работы процесса на точно выдержанное время с помощью определённых часов

source: Link with I<-lrt> (only for glibc versions before 2.17).
ru: Компонуется при указании параметра I<-lrt> (только для glibc до версии 2.17).

source: Like B<nanosleep>(2), B<clock_nanosleep>() allows the calling thread to sleep for an interval specified with nanosecond precision. It differs in allowing the caller to select the clock against which the sleep interval is to be measured, and in allowing the sleep interval to be specified as either an absolute or a relative value.
ru: Подобно B<nanosleep>(2), B<clock_nanosleep>() позволяет вызывающей нити приостановить работу на некоторое время с наносекундной точностью. Отличие в том, что вызывающий может выбрать часы, по которым будет отсчитываться интервал, что позволяет задавать интервал абсолютным или относительным значением времени.

source: The time values passed to and returned by this call are specified using I<timespec> structures, defined as follows:
ru: Время, передаваемое и возвращаемое этим вызовом, задаётся в структурах I<timespec>, определённых следующим образом:

source: struct timespec { time_t tv_sec; /* seconds */ long tv_nsec; /* nanoseconds [0 .. 999999999] */ };
ru: struct timespec { time_t tv_sec; /* секунды */ long tv_nsec; /* наносекунды [0 .. 999999999] */ };

source: The I<clock_id> argument specifies the clock against which the sleep interval is to be measured. This argument can have one of the following values:
ru: Аргумент I<clock_id> определяет часы, по которым отсчитывается интервал. Этот аргумент может иметь следующие значения:

source: A settable system-wide real-time clock.
ru: Настраиваемые системные часы реального времени.

source: A nonsettable, monotonically increasing clock that measures time since some unspecified point in the past that does not change after system startup.
ru: Ненастраиваемые, постоянно идущие вперёд часы, которые отчитывают время с некоторой неопределённой точки в прошлом, которая не изменяется с момент запуска системы.

source: A settable per-process clock that measures CPU time consumed by all threads in the process.
ru: Настраиваемые для каждого процесса часы, измеряющие время ЦП, затраченное всеми нитями процесса.

source: See B<clock_getres>(2) for further details on these clocks. In addition, the CPU clock IDs returned by B<clock_getcpuclockid>(3) and B<pthread_getcpuclockid>(3) can also be passed in I<clock_id>.
ru: Подробней об этих часах смотрите в B<clock_getres>(2). Также ID часов ЦП, возвращаемый B<clock_getcpuclockid>(3) и B<pthread_getcpuclockid>(3), также может передаваться в I<clock_id>.

source: If I<flags> is 0, then the value specified in I<request> is interpreted as an interval relative to the current value of the clock specified by I<clock_id>.
ru: Если I<flags> равно 0, то значение, указанное в I<request>, считается относительным интервалом от текущего значения часов, заданных в I<clock_id>.

source: If I<flags> is B<TIMER_ABSTIME>, then I<request> is interpreted as an absolute time as measured by the clock, I<clock_id>. If I<request> is less than or equal to the current value of the clock, then B<clock_nanosleep>() returns immediately without suspending the calling thread.
ru: Если I<flags> равно B<TIMER_ABSTIME>, то значением I<request> считается абсолютное время, отсчитываемое часами, заданными в I<clock_id>. Если I<request> меньше или равно текущему значению часов, то B<clock_nanosleep>() немедленно завершает работу без приостановки работы вызывающий нити.

source: B<clock_nanosleep>() suspends the execution of the calling thread until either at least the time specified by I<request> has elapsed, or a signal is delivered that causes a signal handler to be called or that terminates the process.
ru: B<clock_nanosleep>() приостанавливает выполнение вызывающей нити до тех пор, пока не наступит время, указанное в I<request>, или не будет получен сигнал, вызывающий обработчик сигнала, или процесс не завершится.

source: If the call is interrupted by a signal handler, B<clock_nanosleep>() fails with the error B<EINTR>. In addition, if I<remain> is not NULL, and I<flags> was not B<TIMER_ABSTIME>, it returns the remaining unslept time in I<remain>. This value can then be used to call B<clock_nanosleep>() again and complete a (relative) sleep.
ru: Если вызов прерывается обработчиком сигнала, то B<clock_nanosleep>() завершается с ошибкой B<EINTR>. Также, если I<remain> не равно NULL и I<flags> не равно B<TIMER_ABSTIME>, то он возвращает в I<remain> остаток непроведённого в остановке времени. Это значение можно использовать в вызове B<clock_nanosleep>() снова и завершить (относительно) приостановку.

source: On successfully sleeping for the requested interval, B<clock_nanosleep>() returns 0. If the call is interrupted by a signal handler or encounters an error, then it returns one of the positive error number listed in ERRORS.
ru: После успешной приостановки на запрошенное время, B<clock_nanosleep>() возвращает 0. Если вызове был прерван обработчиком сигнала или произошла ошибка, то возвращается один из положительных номеров ошибок, перечисленных в разделе ОШИБКИ.

source: I<request> or I<remain> specified an invalid address.
ru: В I<request> или I<remain> указан неправильный адрес.

source: The sleep was interrupted by a signal handler; see B<signal>(7).
ru: Сон прерван обработчиком сигнала; смотрите B<signal>(7).

source: The value in the I<tv_nsec> field was not in the range 0 to 999999999 or I<tv_sec> was negative.
ru: Значение поля I<tv_nsec> не находится в интервале от 0 до 999999999 или I<tv_sec> содержит отрицательное число.

source: I<clock_id> was invalid. (B<CLOCK_THREAD_CPUTIME_ID> is not a permitted value for I<clock_id>.)
ru: Неверное значение I<clock_id>. (Значение B<CLOCK_THREAD_CPUTIME_ID> нельзя указать в I<clock_id>.)

source: The B<clock_nanosleep>() system call first appeared in Linux 2.6. Support is available in glibc since version 2.1.
ru: Системный вызов B<clock_nanosleep>() появился в Linux 2.6. Поддержка в glibc появилась в версии 2.1.
