Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: All other cgroups under I<y> that were not already of type I<threaded> (because they were inside already existing threaded subtrees under the new threaded root) are converted to type I<domain invalid>. Any subsequently created cgroups under I<y> will also have the type I<domain invalid>.
ru: Все остальные cgroup в I<y>, которые ещё не относятся к типу I<threaded> преобразуются в тип I<domain invalid> (так как они внутри уже существующих поддеревьев нитей с новом корне нитей). Все в дальнейшем создаваемые cgroup в I<y> также будут иметь тип I<domain invalid>.

source: We write the string I<"threaded"> to each of the I<domain invalid> cgroups under I<y>, in order to convert them to the type I<threaded>. As a consequence of this step, all threads under the threaded root now have the type I<threaded> and the threaded subtree is now fully usable. The requirement to write I<"threaded"> to each of these cgroups is somewhat cumbersome, but allows for possible future extensions to the thread-mode model.
ru: Записываем строку I<"threaded"> в каждую cgroup с I<domain invalid> в I<y>, чтобы преобразовать их в тип I<threaded>. В результате этого шага все нити в корне нитей теперь имеют тип I<threaded> и поддерево нитей теперь полностью работоспособно. Требование записи I<"threaded"> в каждую такую cgroup несколько обременительно, но это позволит расширить модель режима нитей в будущем.

source: The second way of creating a threaded subtree is as follows:
ru: Второй способ создания поддерева нитей:

source: In an existing cgroup, I<z>, that currently has the type I<domain>, we (1) enable one or more threaded controllers and (2) make a process a member of I<z>. (These two steps can be done in either order.) This has the following consequences:
ru: В существующей cgroup, I<z>, которая имеет тип I<domain>: (1) включаем один или несколько контроллеров нитей и (2) делаем процесс членом I<z> (эти два шага можно выполнять в любом порядке). При этом происходит следующее:

source: The type of I<z> becomes I<domain threaded>.
ru: Типом I<z> становится I<domain threaded>.

source: All of the descendant cgroups of I<x> that were not already of type I<threaded> are converted to type I<domain invalid>.
ru: Все дочерние cgroup I<x>, не имеющие типа I<threaded>, преобразуются в тип I<domain invalid>.

source: As before, we make the threaded subtree usable by writing the string I<"threaded"> to each of the I<domain invalid> cgroups under I<y>, in order to convert them to the type I<threaded>.
ru: Как и ранее, делаем работоспособным поддерево нитей записывая строку I<"threaded"> в каждую cgroup с I<domain invalid> в I<y>, чтобы преобразовать их в тип I<threaded>.

source: One of the consequences of the above pathways to creating a threaded subtree is that the threaded root cgroup can be a parent only to I<threaded> (and I<domain invalid>) cgroups. The threaded root cgroup can't be a parent of a I<domain> cgroups, and a I<threaded> cgroup can't have a sibling that is a I<domain> cgroup.
ru: Следствием одного из этих путей создания поддерева нитей является то, что cgroup корня нитей может быть родителем только cgroup с типом I<threaded> (и I<domain invalid>). cgroup корня нитей не может быть родителем cgroup с типом I<domain> и cgroup с типом I<threaded> не может быть на одном уровне с cgroup с типом I<domain>.

source: Using a threaded subtree
ru: Использование поддерева нитей

source: Within a threaded subtree, threaded controllers can be enabled in each subgroup whose type has been changed to I<threaded>; upon doing so, the corresponding controller interface files appear in the children of that cgroup.
ru: В поддереве нитей можно включать контроллеры нитей для каждой подгруппы, чей тип был изменён на I<threaded>; после того, как это сделано, файлы интерфейса соответствующего контроллера появятся в дочерних cgroup.

source: A process can be moved into a threaded subtree by writing its PID to the I<cgroup.procs> file in one of the cgroups inside the tree. This has the effect of making all of the threads in the process members of the corresponding cgroup and makes the process a member of the threaded subtree. The threads of the process can then be spread across the threaded subtree by writing their thread IDs (see B<gettid>(2)) to the I<cgroup.threads> files in different cgroups inside the subtree. The threads of a process must all reside in the same threaded subtree.
ru: Процесс можно перемещать в поддерево нитей посредством записи его PID в файл I<cgroup.procs> одной из cgroup внутри дерева. В результате все нити процесса становятся членами соответствующей cgroup,а процесс — членом поддерева нитей. После этого нити процесса можно размещать по поддереву нитей посредством записи ID нитей (смотрите B<gettid>(2)) в файлы I<cgroup.threads> различных cgroup внутри поддерева. Все нити процесса должны быть расположены в одном поддереве нитей.

source: As with writing to I<cgroup.procs>, some containment rules apply when writing to the I<cgroup.threads> file:
ru: Как и при записи в I<cgroup.procs>, при записи в файл I<cgroup.threads> накладываются некоторые сдерживающие правила:

source: The writer must have write permission on the cgroup.threads file in the destination cgroup.
ru: Писатель должен иметь права на запись в файл cgroup.threads целевой cgroup.

source: The writer must have write permission on the I<cgroup.procs> file in the common ancestor of the source and destination cgroups. (In some cases, the common ancestor may be the source or destination cgroup itself.)
ru: Писатель должен иметь права на запись в файл I<cgroup.procs> в общем предке для cgroups источника и назначения (в некоторых случаях, общим предком может быть сама cgroup источника или назначения).

source: The source and destination cgroups must be in the same threaded subtree. (Outside a threaded subtree, an attempt to move a thread by writing its thread ID to the I<cgroup.threads> file in a different I<domain> cgroup fails with the error B<EOPNOTSUPP>.)
ru: Целевая и cgroup назначения должны быть в одном поддереве нитей (попытка переместить нить вне поддерева нитей посредством записи ID этой нити в файл I<cgroup.threads> другой cgroup с типом I<domain> завершится ошибкой B<EOPNOTSUPP>).

source: The I<cgroup.threads> file is present in each cgroup (including I<domain> cgroups) and can be read in order to discover the set of threads that is present in the cgroup. The set of thread IDs obtained when reading this file is not guaranteed to be ordered or free of duplicates.
ru: Файл I<cgroup.threads> существует в каждой cgroup (включая cgroup c типом I<domain>) и может быть прочитан для нахождения набора нитей, представленных в группе. Для набора ID нитей, получаемых при чтении этого файла, не гарантируется порядок и отсутствие повторов.

source: The I<cgroup.procs> file in the threaded root shows the PIDs of all processes that are members of the threaded subtree. The I<cgroup.procs> files in the other cgroups in the subtree are not readable.
ru: Файл I<cgroup.procs> в корне нитей отражает PID всех процессов, являющихся членами поддерева нитей. Файлы I<cgroup.procs> других cgroup в поддереве недоступны для чтения.

source: Domain controllers can't be enabled in a threaded subtree; no controller-interface files appear inside the cgroups underneath the threaded root. From the point of view of a domain controller, threaded subtrees are invisible: a multithreaded process inside a threaded subtree appears to a domain controller as a process that resides in the threaded root cgroup.
ru: Доменные контроллеры невозможно включить в поддереве нитей; в cgroup ниже корня нитей отсутствуют интерфейсные файлы контроллера. С точки зрения доменного контроллера поддеревья нитей невидимы: многонитевые процессы внутри поддерева нитей видятся доменным контроллером как процесс, расположенный в cgroup корня нитей.

source: Within a threaded subtree, the "no internal processes" rule does not apply: a cgroup can both contain member processes (or thread) and exercise controllers on child cgroups.
ru: В поддереве нитей правило «нет внутренних процессов» не применяется: cgroup может иметь одновременно процессы-члены (или нить) и выполняемые контроллеры в дочерних cgroup.

source: Rules for writing to cgroup.type and creating threaded subtrees
ru: Правила записи в cgroup.type и создание поддеревьев нитей

source: A number of rules apply when writing to the I<cgroup.type> file:
ru: При записи в файл I<cgroup.type> накладывается несколько правил:

source: Only the string I<"threaded"> may be written. In other words, the only explicit transition that is possible is to convert a I<domain> cgroup to type I<threaded>.
ru: Можно записать только строку I<"threaded">. Другими словами, единственный возможный переход это преобразование I<domain> cgroup к типу I<threaded>.

source: The effect of writing I<"threaded"> depends on the current value in I<cgroup.type>, as follows:
ru: Последствия от записи I<"threaded"> зависит от текущего значения в I<cgroup.type>:

source: I<domain> or I<domain threaded>: start the creation of a threaded subtree (whose root is the parent of this cgroup) via the first of the pathways described above;
ru: I<domain> или I<domain threaded>: начинается создание поддерева нитей (корнем будет родитель этой cgroup) посредством первого способа, описанного выше;

source: I<domain\ invalid>: convert this cgroup (which is inside a threaded subtree) to a usable (i.e., I<threaded>) state;
ru: I<domain\ invalid>: эта cgroup (находящаяся внутри поддерева нитей) переводится в работоспособное состояние (т. е., I<threaded>);

source: I<threaded>: no effect (a "no-op").
ru: I<threaded>: ничего не происходит («нет действия»).

source: We can't write to a I<cgroup.type> file if the parent's type is I<domain invalid>. In other words, the cgroups of a threaded subtree must be converted to the I<threaded> state in a top-down manner.
ru: Нельзя писать в файл I<cgroup.type>, если тип родителя I<domain invalid>. Иначе говоря, все cgroup поддерева нитей должны быть преобразованы в состояние I<threaded> по нисходящей.

source: There are also some constraints that must be satisfied in order to create a threaded subtree rooted at the cgroup I<x>:
ru: Также для создания поддерева нитей с корнем cgroup I<x> требуется выполнить несколько условий:

source: There can be no member processes in the descendant cgroups of I<x>. (The cgroup I<x> can itself have member processes.)
ru: Не должно быть процессов-членов в дочерних cgroup I<x> (сама cgroup I<x> может иметь процессы-члены).

source: No domain controllers may be enabled in I<x>'s I<cgroup.subtree_control> file.
ru: Не должно быть включённых доменных контроллеров для I<x> в файле I<cgroup.subtree_control>.

source: If any of the above constraints is violated, then an attempt to write I<"threaded"> to a I<cgroup.type> file fails with the error B<ENOTSUP>.
ru: Если какое-либо из этих ограничений нарушено, то попытка записи I<"threaded"> в файл I<cgroup.type> завершится ошибкой B<ENOTSUP>.

source: The "domain threaded" cgroup type
ru: Тип cgroup «domain threaded»

source: According to the pathways described above, the type of a cgroup can change to I<domain threaded> in either of the following cases:
ru: Согласно способам, описанным выше, тип cgroup можно измениться на I<domain threaded> в следующих случаях:

source: The string I<"threaded"> is written to a child cgroup.
ru: В дочернюю cgroup записывается строка I<"threaded">.

source: A threaded controller is enabled inside the cgroup and a process is made a member of the cgroup.
ru: Внутри cgroup включён контроллер нитей и процесс стал членом cgroup.

source: A I<domain threaded> cgroup, I<x>, can revert to the type I<domain> if the above conditions no longer hold true\(emthat is, if all I<threaded> child cgroups of I<x> are removed and either I<x> no longer has threaded controllers enabled or no longer has member processes.
ru: Cgroup с типом I<domain threaded>, I<x>, может снова стать I<domain>, если перечисленные выше условия не соблюдаются — то есть, если удалены все потомки cgroup I<x> с типом I<threaded>, у I<x> выключены все контроллеры нитей или больше нет процессов-членов.

source: When a I<domain threaded> cgroup I<x> reverts to the type I<domain>:
ru: Когда cgroup I<x> с типом I<domain threaded> возвращается к типу I<domain>:

source: All I<domain invalid> descendants of I<x> that are not in lower-level threaded subtrees revert to the type I<domain>.
ru: Все потомки I<x> с I<domain invalid>, находящиеся не ниже уровня поддеревьев нитей, получают тип I<domain>.

source: The root cgroups in any lower-level threaded subtrees revert to the type I<domain threaded>.
ru: Корневым cgroup, находящимся ниже поддеревьев нитей возвращается тип I<domain threaded>.

source: Exceptions for the root cgroup
ru: Исключения для корневой cgroup

source: The root cgroup of the v2 hierarchy is treated exceptionally: it can be the parent of both I<domain> and I<threaded> cgroups. If the string I<"threaded"> is written to the I<cgroup.type> file of one of the children of the root cgroup, then
ru: Корневая cgroup иерархии v2 рассматривается отдельно: она может быть родителем cgroup сразу обоих типов: I<domain> и I<threaded>. Если строка I<"threaded"> записывается в файл I<cgroup.type> одного из потомков корневой cgroup, то

source: The type of that cgroup becomes I<threaded>.
ru: Типом этой cgroup становится I<threaded>.

source: The type of any descendants of that cgroup that are not part of lower-level threaded subtrees changes to I<domain invalid>.
ru: Тип всех потомков этой cgroup, не являющихся частью уровня ниже поддеревьев нитей, изменяется на I<domain invalid>.

source: Note that in this case, there is no cgroup whose type becomes I<domain threaded>. (Notionally, the root cgroup can be considered as the threaded root for the cgroup whose type was changed to I<threaded>.)
ru: Заметим, что в этом случае нет cgroup, чей тип стал I<domain threaded> (в принципе, корневая cgroup может рассматриваться как корень нитей для cgroup, чей тип был изменён на I<threaded>).

source: The aim of this exceptional treatment for the root cgroup is to allow a threaded cgroup that employs the I<cpu> controller to be placed as high as possible in the hierarchy, so as to minimize the (small) cost of traversing the cgroup hierarchy.
ru: Данное исключение для корневой cgroup позволяет cgroup нитей, запускающей контроллер I<cpu>, быть помещённой выше всех насколько возможно в иерархии, для того, чтобы минимизировать ущерб (маленький) от обхода иерархии cgroup.

source: The cgroups v2 "cpu" controller and realtime threads
ru: Контроллер «cpu» cgroups v2 и нити реального времени

source: As at Linux 4.19, the cgroups v2 I<cpu> controller does not support control of realtime threads (specifically threads scheduled under any of the policies B<SCHED_FIFO>, B<SCHED_RR>, described B<SCHED_DEADLINE>; see B<sched>(7)). Therefore, the I<cpu> controller can be enabled in the root cgroup only if all realtime threads are in the root cgroup. (If there are realtime threads in nonroot cgroups, then a B<write>(2) of the string I<"+cpu"> to the I<cgroup.subtree_control> file fails with the error B<EINVAL>.)
ru: Начиная с Linux 4.19, контроллер cgroups v2 I<cpu> не поддерживает управление нитями реального времени(нити, запланированные к выполнению планировщиками B<SCHED_FIFO>, B<SCHED_RR>, B<SCHED_DEADLINE>; смотрите B<sched>(7)). Поэтому контроллер I<cpu> можно включить в корневую cgroup только, если все нити реального времени находятся в корневой cgroup (если есть нити реального времени вне корневой cgroups, то запись (B<write>(2)) строки I<"+cpu"> в файл I<cgroup.subtree_control> завершится ошибкой B<EINVAL>).

source: On some systems, B<systemd>(1) places certain realtime threads in nonroot cgroups in the v2 hierarchy. On such systems, these threads must first be moved to the root cgroup before the I<cpu> controller can be enabled.
ru: В некоторых системах B<systemd>(1) помещает определённые нити реального времени в некорневую cgroups иерархии v2. В таких системах такие нити должны помещаться раньше в корневую cgroup, до включения контроллера I<cpu>.

source: The following errors can occur for B<mount>(2):
ru: Следующие ошибки могут возникать при B<mount>(2):

source: An attempt to mount a cgroup version 1 filesystem specified neither the I<name=> option (to mount a named hierarchy) nor a controller name (or I<all>).
ru: При монтировании файловой системы cgroup версии 1 не указан параметр I<name=> (для монтирования именованной иерархии) или имя контроллера (или I<all>).

source: A child process created via B<fork>(2) inherits its parent's cgroup memberships. A process's cgroup memberships are preserved across B<execve>(2).
ru: Дочерний процесс, созданный B<fork>(2), наследует членство родителя в cgroup. Членство в cgroup сохраняется при B<execve>(2).

source: /proc files
ru: Файлы в /proc

source: I</proc/cgroups> (since Linux 2.6.24)
ru: I</proc/cgroups> (начиная с Linux 2.6.24)

source: This file contains information about the controllers that are compiled into the kernel. An example of the contents of this file (reformatted for readability) is the following:
ru: В этом файле содержится информация о контроллерах, с которыми было собрано ядро. Пример содержимого файла (переформатирован для читабельности):

source: The fields in this file are, from left to right:
ru: Поля файла, слева направо:

source: The name of the controller.
ru: Имя контроллера.

source: The unique ID of the cgroup hierarchy on which this controller is mounted. If multiple cgroups v1 controllers are bound to the same hierarchy, then each will show the same hierarchy ID in this field. The value in this field will be 0 if:
ru: Уникальный ID иерархии cgroup, на которой смонтирован контроллер. Если к одной иерархии привязано несколько контроллеров cgroups v1, то для каждого в этом поле будет показан одинаковый ID иерархии. Значение поля равно 0, если:

source: the controller is not mounted on a cgroups v1 hierarchy;
ru: контроллер не смонтирован на иерархию cgroups v1;

source: the controller is bound to the cgroups v2 single unified hierarchy; or
ru: контроллер привязан к унифицированной иерархии cgroups v2; или

source: the controller is disabled (see below).
ru: контроллер отключён (смотрите ниже).

source: The number of control groups in this hierarchy using this controller.
ru: Количество контролируемых групп в этой иерархии, использующих этот контроллер.

source: This field contains the value 1 if this controller is enabled, or 0 if it has been disabled (via the I<cgroup_disable> kernel command-line boot parameter).
ru: В этом поле содержится значение 1, если этот контроллер включён, или 0, если он выключен (с помощью параметра I<cgroup_disable> командной строки загрузки ядра).

source: I</proc/[pid]/cgroup> (since Linux 2.6.24)
ru: I</proc/[pid]/cgroup> (начиная с Linux 2.6.24)

source: This file describes control groups to which the process with the corresponding PID belongs. The displayed information differs for cgroups version 1 and version 2 hierarchies.
ru: Этот файл описывает управляемые группы, которым принадлежит процесс с соответствующим PID. Отображаемая информация отличается для иерархий cgroups версии 1 и 2.

source: For each cgroup hierarchy of which the process is a member, there is one entry containing three colon-separated fields:
ru: Для каждой иерархии cgroup, членом которой является процесс, существует одна запись, состоящая из трёх полей через двоеточие:

source: hierarchy-ID:controller-list:cgroup-path
ru: ID иерархии:список контроллеров:путь cgroup

source: For example:
ru: Пример:

source: The colon-separated fields are, from left to right:
ru: Поля, разделяемые двоеточием, слева направо:

source: For cgroups version 1 hierarchies, this field contains a unique hierarchy ID number that can be matched to a hierarchy ID in I</proc/cgroups>. For the cgroups version 2 hierarchy, this field contains the value 0.
ru: Для иерархии cgroups версии 1 это поле содержит уникальный ID номер иерархии, который может совпадать с ID иерархии в I</proc/cgroups>. Для иерархии cgroups версии 2 это поле содержит значение 0.

source: For cgroups version 1 hierarchies, this field contains a comma-separated list of the controllers bound to the hierarchy. For the cgroups version 2 hierarchy, this field is empty.
ru: Для иерархии cgroups версии 1 это поле содержит список контроллеров, привязанных к иерархии, перечисленных через запятую. Для иерархии cgroups версии 2 это поле пусто.

source: This field contains the pathname of the control group in the hierarchy to which the process belongs. This pathname is relative to the mount point of the hierarchy.
ru: Это поле содержит путь управляемой группы в иерархии, которой принадлежит процесс. Путь является относительным точки монтирования иерархии.

source: /sys/kernel/cgroup files
ru: Файлы /sys/kernel/cgroup

source: I</sys/kernel/cgroup/delegate> (since Linux 4.15)
ru: I</sys/kernel/cgroup/delegate> (начиная с Linux 4.15)

source: This file exports a list of the cgroups v2 files (one per line) that are delegatable (i.e., whose ownership should be changed to the user ID of the delegatee). In the future, the set of delegatable files may change or grow, and this file provides a way for the kernel to inform user-space applications of which files must be delegated. As at Linux 4.15, one sees the following when inspecting this file:
ru: Этот файл экспортирует список файлов cgroups v2 (один на строку), которые можно делегировать (т. е., у которых можно изменить владельца на пользовательских ID делегата). В будущем, наборов доступных для делегирования файлов может измениться или вырасти, а этот файл предоставляет способ, которым ядро информирует приложения пользовательского пространства о необходимых для делегирования файлах. В Linux 4.15 в этом файле можно увидеть следующее:

source: I</sys/kernel/cgroup/features> (since Linux 4.15)
ru: I</sys/kernel/cgroup/features> (начиная с Linux 4.15)

source: Over time, the set of cgroups v2 features that are provided by the kernel may change or grow, or some features may not be enabled by default. This file provides a way for user-space applications to discover what features the running kernel supports and has enabled. Features are listed one per line:
ru: Со временем набор возможностей cgroups v2, предоставляемых ядром, может измениться или вырасти, или некоторые возможности по умолчанию могут быть отключены. Этот файл предоставляет способ, которым приложения пользовательского пространства могут узнать о том, какие возможности поддерживает работающее ядро и какие из них включены. Возможности перечисляются по одной на строку:

source: The entries that can appear in this file are:
ru: В этом файле может появляться следующее:

source: I<nsdelegate> (since Linux 4.15)
ru: I<nsdelegate> (начиная с Linux 4.15)

source: The kernel supports the I<nsdelegate> mount option.
ru: Поддержка параметра монтирования I<nsdelegate> ядром.

source: charsets - character set standards and internationalization
ru: charsets - стандарты наборов символов и интернационализация

source: This manual page gives an overview on different character set standards and how they were used on Linux before Unicode became ubiquitous. Some of this information is still helpful for people working with legacy systems and documents.
ru: В этой справочной странице представлен обзор различных стандартов наборов символов и их использование в Linux до повсеместного распространения Юникода. Часть данной информации будет полезна людям, работающим в старых системах или со старыми документами.
