Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: The socket is nonblocking and the connection cannot be completed immediately. (UNIX domain sockets failed with B<EAGAIN> instead.) It is possible to B<select>(2) or B<poll>(2) for completion by selecting the socket for writing. After B<select>(2) indicates writability, use B<getsockopt>(2) to read the B<SO_ERROR> option at level B<SOL_SOCKET> to determine whether B<connect>() completed successfully (B<SO_ERROR> is zero) or unsuccessfully (B<SO_ERROR> is one of the usual error codes listed here, explaining the reason for the failure).
ru: Сокет является неблокирующим, а соединение не может быть установлено немедленно (доменные сокеты UNIX вместо этого возвращают ошибку B<EAGAIN>). Можно использовать B<select>(2) или B<poll>(2), чтобы закончить соединение, установив ожидание возможности записи в сокет. После того, как B<select>(2) сообщит о такой возможности, используйте B<getsockopt>(2), чтобы прочитать флаг B<SO_ERROR> на уровне B<SOL_SOCKET>, чтобы определить, успешно ли завершился B<connect>() (в этом случае B<SO_ERROR> равен нулю) или неудачно (тогда B<SO_ERROR> равен одному из обычных кодов ошибок, перечисленных здесь, и объясняет причину неудачи).

source: The system call was interrupted by a signal that was caught; see B<signal>(7).
ru: Системный вызов был прерван пойманным сигналом; см. B<signal>(7).

source: The socket is already connected.
ru: Соединение на сокете уже произошло.

source: Network is unreachable.
ru: Сеть недоступна.

source: The file descriptor I<sockfd> does not refer to a socket.
ru: Файловый дескриптор I<sockfd> указывает не на каталог.

source: The socket type does not support the requested communications protocol. This error can occur, for example, on an attempt to connect a UNIX domain datagram socket to a stream socket.
ru: Тип сокета не поддерживается запрошенным протоколом связи. Это ошибка может возникать при попытке подключить доменный датаграммный сокет UNIX к потоковому сокету.

source: Timeout while attempting connection. The server may be too busy to accept new connections. Note that for IP sockets the timeout may be very long when syncookies are enabled on the server.
ru: Произошел тайм-аут во время ожидания соединения. Сервер, возможно, очень занят и не может принимать новые соединения. Заметьте, что для IP-сокетов тайм-аут может быть очень длинным, если на сервере разрешено использование syncookies.

source: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD, (connectB<()> first appeared in 4.2BSD).
ru: POSIX.1-2001, POSIX.1-2008, SVr4, 4.4BSD, (B<connect()> впервые появился 4.2BSD).

source: POSIX.1 does not require the inclusion of I<E<lt>sys/types.hE<gt>>, and this header file is not required on Linux. However, some historical (BSD) implementations required this header file, and portable applications are probably wise to include it.
ru: В POSIX.1 не требуется включение I<E<lt>sys/types.hE<gt>>, и этот заголовочный файл не требуется в Linux. Однако, для некоторых старых реализаций (BSD) требует данный файл, и в переносимых приложениях для предосторожности, вероятно, лучше его указать.

source: For background on the I<socklen_t> type, see B<accept>(2).
ru: Описание типа I<socklen_t> смотрите в B<accept>(2).

source: If B<connect>() fails, consider the state of the socket as unspecified. Portable applications should close the socket and create a new one for reconnecting.
ru: Если вызов B<connect>() завершается с ошибкой, то состояние сокета считается неопределённым. Переносимые приложения должны закрывать сокет и для переподключения создавать новый.

source: An example of the use of B<connect>() is shown in B<getaddrinfo>(3).
ru: Пример использования B<connect>() показан в B<getaddrinfo>(3).

source: capget, capset - set/get capabilities of thread(s)
ru: capget, capset - установка/получение мандатов нити(ей)

source: These two system calls are the raw kernel interface for getting and setting thread capabilities. Not only are these system calls specific to Linux, but the kernel API is likely to change and use of these system calls (in particular the format of the I<cap_user_*_t> types) is subject to extension with each kernel revision, but old programs will keep working.
ru: Данные системные вызовы представляют собой низкоуровневый интерфейс ядра для получения и установки мандатов нити. Кроме того, что эти системные вызовы есть только в Linux, из-за них, вероятно, изменится программный интерфейс ядра; с каждой новой версией ядра эти вызовы используются всё чаще (в частности, типы I<cap_user_*_t>), но старые программы работают как и прежде.

source: The portable interfaces are B<cap_set_proc>(3) and B<cap_get_proc>(3); if possible, you should use those interfaces in applications.
ru: Переносимыми интерфейсами являются B<cap_set_proc>(3) и B<cap_get_proc>(3); если возможно, в приложениях используйте именно их.

source: Current details
ru: Подробная информация

source: Now that you have been warned, some current kernel details. The structures are defined as follows.
ru: На данный момент в ядре определены следующие структуры:

source: /* V2 added in Linux 2.6.25; deprecated */ #define _LINUX_CAPABILITY_VERSION_2 0x20071026 #define _LINUX_CAPABILITY_U32S_2 2
ru: /* V2 добавлена в Linux 2.6.25; устарело */ #define _LINUX_CAPABILITY_VERSION_2 0x20071026 #define _LINUX_CAPABILITY_U32S_2 2

source: /* V3 added in Linux 2.6.26 */ #define _LINUX_CAPABILITY_VERSION_3 0x20080522 #define _LINUX_CAPABILITY_U32S_3 2
ru: /* V3 добавлена в Linux 2.6.26 */ #define _LINUX_CAPABILITY_VERSION_3 0x20080522 #define _LINUX_CAPABILITY_U32S_3 2

source: The I<effective>, I<permitted>, and I<inheritable> fields are bit masks of the capabilities defined in B<capabilities>(7). Note that the B<CAP_*> values are bit indexes and need to be bit-shifted before ORing into the bit fields. To define the structures for passing to the system call, you have to use the I<struct __user_cap_header_struct> and I<struct __user_cap_data_struct> names because the typedefs are only pointers.
ru: Поля I<effective>, I<permitted> и I<inheritable> — это битовые маски мандатов, определённых в B<capabilities>(7). Заметим, что значения B<CAP_*> являются индексами битов и требуется сдвиг битов перед выполнением операции ИЛИ над битовыми полями. Чтобы определить структуры для передачи в системный вызов, используйте имена I<struct __user_cap_header_struct> и I<struct __user_cap_data_struct>, так как посредством typedef описаны только указатели.

source: Kernels prior to 2.6.25 prefer 32-bit capabilities with version B<_LINUX_CAPABILITY_VERSION_1>. Linux 2.6.25 added 64-bit capability sets, with version B<_LINUX_CAPABILITY_VERSION_2>. There was, however, an API glitch, and Linux 2.6.26 added B<_LINUX_CAPABILITY_VERSION_3> to fix the problem.
ru: Ядра до версии 2.6.25 предъявляют 32-битные мандаты с версией B<_LINUX_CAPABILITY_VERSION_1>. В Linux 2.6.25+ добавлены 64-битные наборы мандатов с версией B<_LINUX_CAPABILITY_VERSION_2>. Однако имеется незначительная проблема в программном интерфейсе и в Linux 2.6.26 добавлена B<_LINUX_CAPABILITY_VERSION_3> для её исправления.

source: Note that 64-bit capabilities use I<datap>[0] and I<datap>[1], whereas 32-bit capabilities use only I<datap>[0].
ru: Заметим, что в 64-битных мандатах используются I<datap>[0] и I<datap>[1], в то время как в 32-битных только I<datap>[0].

source: On kernels that support file capabilities (VFS capabilities support), these system calls behave slightly differently. This support was added as an option in Linux 2.6.24, and became fixed (nonoptional) in Linux 2.6.33.
ru: В ядрах, которые поддерживают файловые мандаты (поддержка мандатов VFS) эти системные вызовы ведут себя немного по-другому. Данная поддержка добавлена как необязательная в Linux 2.6.24 и стала постоянной (не отключаемой) в Linux 2.6.33.

source: For B<capget>() calls, one can probe the capabilities of any process by specifying its process ID with the I<hdrp-E<gt>pid> field value.
ru: С помощью вызова B<capget>() можно выполнить проверку мандатов любого процесса, указав его ID в поле I<hdrp-E<gt>pid>.

source: For details on the data, see B<capabilities>(7).
ru: Подробную информацию о данных смотрите в B<capabilities>(7).

source: With VFS capabilities support
ru: Ядро с поддержкой мандатов VFS

source: VFS capabilities employ a file extended attribute (see B<xattr>(7)) to allow capabilities to be attached to executables. This privilege model obsoletes kernel support for one process asynchronously setting the capabilities of another. That is, on kernels that have VFS capabilities support, when calling B<capset>(), the only permitted values for I<hdrp-E<gt>pid> are 0 or, equivalently, the value returned by B<gettid>(2).
ru: Для мандатов VFS используется расширенный атрибут файла (смотрите B<xattr>(7)), позволяющий присоединять мандаты к исполняемым файлам. Данная модель привилегий делает устаревшей ядерную поддержку асинхронного назначения мандатов одного процесса другому. То есть в ядрах с мандатами VFS при вызове B<capset>() разрешены только значения I<hdrp-E<gt>pid> равные 0 или B<gettid>(2), что приводит к тому же результату.

source: Without VFS capabilities support
ru: Ядро без поддержки мандатов VFS

source: On older kernels that do not provide VFS capabilities support B<capset>() can, if the caller has the B<CAP_SETPCAP> capability, be used to change not only the caller's own capabilities, but also the capabilities of other threads. The call operates on the capabilities of the thread specified by the I<pid> field of I<hdrp> when that is nonzero, or on the capabilities of the calling thread if I<pid> is 0. If I<pid> refers to a single-threaded process, then I<pid> can be specified as a traditional process ID; operating on a thread of a multithreaded process requires a thread ID of the type returned by B<gettid>(2). For B<capset>(), I<pid> can also be: -1, meaning perform the change on all threads except the caller and B<init>(1); or a value less than -1, in which case the change is applied to all members of the process group whose ID is -I<pid>.
ru: В старых ядрах без поддержки мандатов VFS вызов B<capset>(), если вызывающий имеет мандат B<CAP_SETPCAP>, можно использовать для изменения не только собственными мандатами вызывающего, то и мандатами других нитей. Вызов работает с мандатами нити, указанной в в поле I<pid> из I<hdrp>, если оно не равно нулю, или мандатами вызывающей нити, когда I<pid> равно 0. Если I<pid> указывает на процесс с одной нитью, то значением I<pid> может быть обычным идентификатором процесса; работа с нитью в многонитиевом процессе требует ID нити такого же типа, что и возвращается B<gettid>(2). У B<capset>() I<pid> также может быть: -1 — выполнить изменение у всех нитей, за исключением вызывающей и B<init>(1); меньше -1 — выполнить изменение всех членов группы процесса, чей ID равен -I<pid>.

source: The calls fail with the error B<EINVAL>, and set the I<version> field of I<hdrp> to the kernel preferred value of B<_LINUX_CAPABILITY_VERSION_?> when an unsupported I<version> value is specified. In this way, one can probe what the current preferred capability revision is.
ru: Вызовы завершаются с ошибкой B<EINVAL> и изменяют поле I<version> в I<hdrp> на предпочитаемое ядром значение B<_LINUX_CAPABILITY_VERSION_?>, если указано неподдерживаемое значение I<version>. Таким способом можно проверить какая версия мандатов является предпочтительной.

source: Bad memory address. I<hdrp> must not be NULL. I<datap> may be NULL only when the user is trying to determine the preferred capability version format supported by the kernel.
ru: Неправильный адрес памяти. Значение I<hdrp> не должно быть равно NULL. Значение I<datap> может быть NULL только, когда пользователь пытается определить предпочтительную версию формата мандатов, поддерживаемую ядром.

source: One of the arguments was invalid.
ru: Один из аргументов неправилен.

source: An attempt was made to add a capability to the Permitted set, or to set a capability in the Effective or Inheritable sets that is not in the Permitted set.
ru: Была сделана попытка добавить мандат к списку разрешённых, эффективных или унаследованных мандатов, но это не разрешено согласно списку разрешённых.

source: The caller attempted to use B<capset>() to modify the capabilities of a thread other than itself, but lacked sufficient privilege. For kernels supporting VFS capabilities, this is never permitted. For kernels lacking VFS support, the B<CAP_SETPCAP> capability is required. (A bug in kernels before 2.6.11 meant that this error could also occur if a thread without this capability tried to change its own capabilities by specifying the I<pid> field as a nonzero value (i.e., the value returned by B<getpid>(2)) instead of 0.)
ru: Вызывающий процесс пытается использовать B<capset>() для изменения мандатов не своей нити, но ему не хватает на это прав. Для ядер, поддерживающих мандаты VFS, это всегда запрещено. Для ядер без поддержки VFS требуется мандат B<CAP_SETPCAP>. (Неправильная работа ядер до версии 2.6.11 приводила к тому, что эта ошибка также возникала, если нить без данного мандата пыталась изменить свои собственные мандаты, указывая в поле I<pid> ненулевое значение (т.е. значение, возвращаемое B<getpid>(2)), а не 0).

source: No such thread.
ru: Такой нити нет.

source: These system calls are Linux-specific.
ru: Данные системные вызовы есть только в Linux.

source: The portable interface to the capability querying and setting functions is provided by the I<libcap> library and is available here:
ru: Переносимый интерфейс для запроса и установки мандатов предоставляется библиотекой I<libcap>, которая доступна по адресу:

source: clock_getres, clock_gettime, clock_settime - clock and time functions
ru: clock_getres, clock_gettime, clock_settime - функции часов и времени

source: The function B<clock_getres>() finds the resolution (precision) of the specified clock I<clk_id>, and, if I<res> is non-NULL, stores it in the I<struct timespec> pointed to by I<res>. The resolution of clocks depends on the implementation and cannot be configured by a particular process. If the time value pointed to by the argument I<tp> of B<clock_settime>() is not a multiple of I<res>, then it is truncated to a multiple of I<res>.
ru: Функция B<clock_getres>() определяет разрешающую способность (точность) заданных в I<clk_id> часов, и, если I<res> не равно NULL, сохраняет её в I<struct timespec>, указанную в I<res>. Точность часов зависит от реализации и не может быть настроена определённым процессом. Если значение времени, указанное в аргументе I<tp> функции B<clock_settime>(), не кратно I<res>, то оно усекается до кратного I<res>.

source: The functions B<clock_gettime>() and B<clock_settime>() retrieve and set the time of the specified clock I<clk_id>.
ru: Функции B<clock_gettime>() и B<clock_settime>() получают и устанавливают время указанных часов I<clk_id>.

source: The I<res> and I<tp> arguments are I<timespec> structures, as specified in I<E<lt>time.hE<gt>>:
ru: Аргументы I<res> и I<tp> представляют структуру I<timespec>, определённую в I<E<lt>time.hE<gt>>:

source: struct timespec { time_t tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
ru: struct timespec { time_t tv_sec; /* секунды */ long tv_nsec; /* наносекунды */ };

source: The I<clk_id> argument is the identifier of the particular clock on which to act. A clock may be system-wide and hence visible for all processes, or per-process if it measures time only within a single process.
ru: Аргумент I<clk_id> представляет идентификатор определённых часов, над которыми производится действие. Часы могут использоваться системой в целом и поэтому видимы всем процессам или конкретного процессу, если они отсчитывают время только в пределах одного процесса.

source: All implementations support the system-wide real-time clock, which is identified by B<CLOCK_REALTIME>. Its time represents seconds and nanoseconds since the Epoch. When its time is changed, timers for a relative interval are unaffected, but timers for an absolute point in time are affected.
ru: Все реализации поддерживают системные часы реального времени, которые имеют идентификатор B<CLOCK_REALTIME>. Их время представляется в секундах и наносекундах с начала Эпохи. Когда их время изменяется, на таймеры с относительными интервалами это никак не влияет, но таймеры с абсолютной точкой во времени учитывают это.

source: More clocks may be implemented. The interpretation of the corresponding time values and the effect on timers is unspecified.
ru: Может быть реализовано много часов. Представление соответствующих значений времени и влияние на таймеры не определено.

source: Sufficiently recent versions of glibc and the Linux kernel support the following clocks:
ru: В последних версиях glibc и ядра Linux поддерживаются следующие часы:

source: System-wide clock that measures real (i.e., wall-clock) time. Setting this clock requires appropriate privileges. This clock is affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the clock), and by the incremental adjustments performed by B<adjtime>(3) and NTP.
ru: Часы системы, отсчитывающие реальное (т. е., бытовое) время. Для настройки этих часов требуются соответствующие права. Данные часы подвержены скачкам системного времени (например, если системный администратор вручную изменяет время) и постепенной подгонке, выполняемой B<adjtime>(3) и NTP.

source: B<CLOCK_REALTIME_COARSE> (since Linux 2.6.32; Linux-specific)
ru: B<CLOCK_REALTIME_COARSE> (начиная с Linux 2.6.32; есть только в Linux)

source: A faster but less precise version of B<CLOCK_REALTIME>. Use when you need very fast, but not fine-grained timestamps. Requires per-architecture support, and probably also architecture support for this flag in the B<vdso>(7).
ru: Более быстрая, но менее точная версия B<CLOCK_REALTIME>. Используйте, если нужны не очень точные метки времени, но очень быстро. Требуется поддержка в архитектуре и, вероятно, поддержка архитектурой этого флага в B<vdso>(7).

source: Clock that cannot be set and represents monotonic time since\(emas described by POSIX\(em"some unspecified point in the past". On Linux, that point corresponds to the number of seconds that the system has been running since it was booted.
ru: Часы, которые не могут быть настроены и показывают монотонный ход времени, отсчитываемый, согласно POSIX, «с некой неопределённой начальной точки в прошлом». В Linux этой точкой является количество секунд, прошедших с момента начала загрузки системы.

source: The B<CLOCK_MONOTONIC> clock is not affected by discontinuous jumps in the system time (e.g., if the system administrator manually changes the clock), but is affected by the incremental adjustments performed by B<adjtime>(3) and NTP. This clock does not count time that the system is suspended.
ru: Часы B<CLOCK_MONOTONIC> не подвержены скачкам системного времени (например, системный администратор вручную изменил время), но на них влияет постепенная подгонка, выполняемая B<adjtime>(3) и NTP. Данные часы не считают время при приостановке системы.

source: B<CLOCK_MONOTONIC_COARSE> (since Linux 2.6.32; Linux-specific)
ru: B<CLOCK_MONOTONIC_COARSE> (начиная с Linux 2.6.32; есть только в Linux)

source: A faster but less precise version of B<CLOCK_MONOTONIC>. Use when you need very fast, but not fine-grained timestamps. Requires per-architecture support, and probably also architecture support for this flag in the B<vdso>(7).
ru: Более быстрая, но менее точная версия B<CLOCK_MONOTONIC>. Используйте, если нужны не очень точные метки времени, но очень быстро. Требуется поддержка в архитектуре и, вероятно, поддержка архитектурой этого флага в B<vdso>(7).

source: B<CLOCK_MONOTONIC_RAW> (since Linux 2.6.28; Linux-specific)
ru: B<CLOCK_MONOTONIC_RAW> (начиная с Linux 2.6.28; есть только в Linux)

source: Similar to B<CLOCK_MONOTONIC>, but provides access to a raw hardware-based time that is not subject to NTP adjustments or the incremental adjustments performed by B<adjtime>(3). This clock does not count time that the system is suspended.
ru: Похожи на B<CLOCK_MONOTONIC>, но предоставляют прямой доступ к аппаратным часам, которые не подводятся NTP или постепенной подгонкой, выполняемой B<adjtime>(3). Эти часы останавливаются когда система входит в состояние приостановки.

source: B<CLOCK_BOOTTIME> (since Linux 2.6.39; Linux-specific)
ru: B<CLOCK_BOOTTIME> (начиная с Linux 2.6.39; есть только в Linux)

source: Identical to B<CLOCK_MONOTONIC>, except it also includes any time that the system is suspended. This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of B<CLOCK_REALTIME>, which may have discontinuities if the time is changed using B<settimeofday>(2) or similar.
ru: Идентичны B<CLOCK_MONOTONIC>, но также содержат любое время, на которое система была приостановлена (suspended). Это позволяет приложениям получить учитывающие приостановку монотонные часы без обращения к сложностям B<CLOCK_REALTIME>, которые могут быть неоднородны, если время изменили с помощью B<settimeofday>(2) или ему подобных.

source: B<CLOCK_PROCESS_CPUTIME_ID> (since Linux 2.6.12)
ru: B<CLOCK_PROCESS_CPUTIME_ID> (начиная с Linux 2.6.12)

source: Per-process CPU-time clock (measures CPU time consumed by all threads in the process).
ru: Настраиваемые для каждого процесса часы ЦП (измеряют время ЦП, затраченное всеми нитями процесса).

source: B<CLOCK_THREAD_CPUTIME_ID> (since Linux 2.6.12)
ru: B<CLOCK_THREAD_CPUTIME_ID> (начиная с Linux 2.6.12)

source: Thread-specific CPU-time clock.
ru: Часы, работающие на ЦП, для каждой нити.

source: B<clock_gettime>(), B<clock_settime>(), and B<clock_getres>() return 0 for success, or -1 for failure (in which case I<errno> is set appropriately).
ru: При успешном выполнении функции B<clock_gettime>(), B<clock_settime>() и B<clock_getres>() возвращают 0, или -1 в случае ошибки (I<errno> устанавливается в соответствующее значение).

source: I<tp> points outside the accessible address space.
ru: I<tp> указывает за пределы доступного адресного пространства.

source: The I<clk_id> specified is not supported on this system.
ru: Заданное в I<clk_id> значение не поддерживается на этой системе.

source: (B<clock_settime>()): I<tp.tv_sec> is negative or I<tp.tv_nsec> is outside the range [0..999,999,999].
ru: (B<clock_settime>()): I<tp.tv_sec> отрицательно или I<tp.tv_nsec> вне диапазона [0..999,999,999].

source: B<EINVAL> (since Linux 4.3)
ru: B<EINVAL> (начиная с Linux 4.3)

source: A call to B<clock_settime>() with a I<clk_id> of B<CLOCK_REALTIME> attempted to set the time to a value less than the current value of the B<CLOCK_MONOTONIC> clock.
ru: Вызов B<clock_settime>() со значением I<clk_id> равным B<CLOCK_REALTIME> для установки времени в значение меньше текущего значения часов B<CLOCK_MONOTONIC>.

source: B<clock_settime>() does not have permission to set the clock indicated.
ru: Для установки указанных часов с помощью B<clock_settime>() недостаточно прав.

source: These system calls first appeared in Linux 2.6.
ru: Данные системные вызовы впервые появились в Linux 2.6.

source: ATTRIBUTES
ru: АТРИБУТЫ

source: For an explanation of the terms used in this section, see B<attributes>(7).
ru: Описание терминов данного раздела смотрите в B<attributes>(7).

source: Interface
ru: Интерфейс

source: Attribute
ru: Атрибут

source: Value
ru: Значение

source: Thread safety
ru: Безвредность в нитях

source: AVAILABILITY
ru: ДОСТУПНОСТЬ
