Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: To perform delegation, the delegater makes certain directories and files writable by the delegatee, typically by changing the ownership of the objects to be the user ID of the delegatee. Assuming that we want to delegate the hierarchy rooted at (say) I</dlgt_grp> and that there are not yet any child cgroups under that cgroup, the ownership of the following is changed to the user ID of the delegatee:
ru: Для делегирования, делегирующий создает определённые каталоги и файлы, доступные на запись делегату, обычно, назначая владельцем объектов идентификатором пользователя-делегата. Предполагая, что нужно делегировать иерархию с корнем (например) I</dlgt_grp> и что пока нет каких-либо дочерних cgroups в cgroup, меняем владельца на идентификатор пользователя-делегата у следующего:

source: Changing the ownership of the root of the subtree means that any new cgroups created under the subtree (and the files they contain) will also be owned by the delegatee.
ru: Смена владельца корня поддерева означает, что любые новые cgroups, созданные в поддереве (и файлы, которые они содержат), также будут принадлежать делегату.

source: Changing the ownership of this file means that the delegatee can move processes into the root of the delegated subtree.
ru: Смена владельца этого файла означает, что делегат может перемещать процессы в корень делегированного ему поддерева.

source: I</dlgt_grp/cgroup.subtree_control> (cgroups v2 only)
ru: I</dlgt_grp/cgroup.subtree_control> (только cgroups v2)

source: Changing the ownership of this file means that the delegatee can enable controllers (that are present in I</dlgt_grp/cgroup.controllers>) in order to further redistribute resources at lower levels in the subtree. (As an alternative to changing the ownership of this file, the delegater might instead add selected controllers to this file.)
ru: Смена владельца этого файла означает, что делегат сможет включать контроллеры (которые имеются в I</dlgt_grp/cgroup.controllers>), чтобы в дальнейшем распределять ресурсы на более низких уровнях поддерева (вместо изменения прав владения данным файлом делегирующий может добавить нужные контроллеры в этот файл).

source: I</dlgt_grp/cgroup.threads> (cgroups v2 only)
ru: I</dlgt_grp/cgroup.threads> (только cgroups v2)

source: Changing the ownership of this file is necessary if a threaded subtree is being delegated (see the description of "thread mode", below). This permits the delegatee to write thread IDs to the file. (The ownership of this file can also be changed when delegating a domain subtree, but currently this serves no purpose, since, as described below, it is not possible to move a thread between domain cgroups by writing its thread ID to the I<cgroup.threads> file.)
ru: Смена владельца этого файла требуется для делегирования поддерева с нитями (смотрите описание «режима нитей» далее). Это позволяет делегату записывать в файл ID нитей (также может быть изменён владелец файла для делегирования поддерева домена, но пока это ни к чему не приводит, так как, судя по описанному далее, невозможно перемещать нить между cgroup домена просто записывая ID нити в файл I<cgroup.threads>).

source: In cgroups v1, the corresponding file that should instead be delegated is the I<tasks> file.
ru: В cgroups v1 соответствующим файлом вместо делегируемого должен быть файл I<tasks>.

source: The delegater should I<not> change the ownership of any of the controller interfaces files (e.g., I<pids.max>, I<memory.high>) in I<dlgt_grp>. Those files are used from the next level above the delegated subtree in order to distribute resources into the subtree, and the delegatee should not have permission to change the resources that are distributed into the delegated subtree.
ru: Делегирующий I<не> должен изменять владельцев файлов интерфейса контроллера (например, I<pids.max>, I<memory.high>) в I<dlgt_grp>. Эти файлы используются со следующего уровня над делегируемым поддеревом, чтобы распределить ресурсы в поддерево, и делегат не должен иметь права изменять ресурсы, распределённые в делегируемое поддерево.

source: See also the discussion of the I</sys/kernel/cgroup/delegate> file in NOTES for information about further delegatable files in cgroups v2.
ru: Информацию о других делегируемых файлах cgroups v2 смотрите описание файла I</sys/kernel/cgroup/delegate> в ЗАМЕЧАНИЯХ.

source: After the aforementioned steps have been performed, the delegatee can create child cgroups within the delegated subtree (the cgroup subdirectories and the files they contain will be owned by the delegatee) and move processes between cgroups in the subtree. If some controllers are present in I<dlgt_grp/cgroup.subtree_control>, or the ownership of that file was passed to the delegatee, the delegatee can also control the further redistribution of the corresponding resources into the delegated subtree.
ru: После выполнения вышеуказанных шагов делегат может создавать подгруппы cgroups в рамках делегированного поддерева (подкаталоги cgroup и файлы в них будут принадлежать делегату) и перемещать процессы между группами cgroup в поддереве. Если в I<dlgt_grp/cgroup.subtree_control> есть контроллеры, или право владения этим файлом перешло к делегату, то делегат также может управлять дальнейшим распределением соответствующих ресурсов в делегированном ему поддереве.

source: Cgroups v2 delegation: nsdelegate and cgroup namespaces
ru: Делегирование cgroups v2: nsdelegate и пространство имён cgroup

source: Starting with Linux 4.13, there is a second way to perform cgroup delegation in the cgroups v2 hierarchy. This is done by mounting or remounting the cgroup v2 filesystem with the I<nsdelegate> mount option. For example, if the cgroup v2 filesystem has already been mounted, we can remount it with the I<nsdelegate> option as follows:
ru: Начиная с Linux 4.13 появился второй способ делегирования cgroup в иерархии cgroups v2. Этого можно достичь монтированием или перемонтированием файловой системы cgroup v2 с параметром монтирования I<nsdelegate>. Например, если файловая система cgroup v2 уже смонтирована, то её можно перемонтировать с параметром I<nsdelegate> следующим образом:

source: The effect of this mount option is to cause cgroup namespaces to automatically become delegation boundaries. More specifically, the following restrictions apply for processes inside the cgroup namespace:
ru: Данный параметр монтирования заставляет пространства имён cgroup автоматически устанавливать границы делегирования. При этом на процессы внутри пространства имён cgroup накладываются следующие ограничения:

source: Writes to controller interface files in the root directory of the namespace will fail with the error B<EPERM>. Processes inside the cgroup namespace can still write to delegatable files in the root directory of the cgroup namespace such as I<cgroup.procs> and I<cgroup.subtree_control>, and can create subhierarchy underneath the root directory.
ru: Запись в файлы интерфейса к контроллерам в корневом каталоге пространства имён завершаются ошибкой B<EPERM>. Процессы внутри пространства имён cgroup по-прежнему могут писать в делегированные файлы корневого каталога пространства имён cgroup (такие как I<cgroup.procs> и I<cgroup.subtree_control>) и могут создавать новые иерархии в корневом каталоге.

source: Attempts to migrate processes across the namespace boundary are denied (with the error B<ENOENT>). Processes inside the cgroup namespace can still (subject to the containment rules described below) move processes between cgroups I<within> the subhierarchy under the namespace root.
ru: Попытки переноса процессов за границу пространства имён пресекаются (с ошибкой B<ENOENT>). Процессы внутри пространства имён cgroup по-прежнему могут (цель сдерживающих правил описана ниже) перемещать процессы между cgroup I<внутри> иерархий корневого каталога.

source: The ability to define cgroup namespaces as delegation boundaries makes cgroup namespaces more useful. To understand why, suppose that we already have one cgroup hierarchy that has been delegated to a nonprivileged user, I<cecilia>, using the older delegation technique described above. Suppose further that I<cecilia> wanted to further delegate a subhierarchy under the existing delegated hierarchy. (For example, the delegated hierarchy might be associated with an unprivileged container run by I<cecilia>.) Even if a cgroup namespace was employed, because both hierarchies are owned by the unprivileged user I<cecilia>, the following illegitimate actions could be performed:
ru: Возможность определения пространств имён cgroup для границ делегирования делает пространства имён cgroup ещё более полезными. Чтобы понять почему, предположим, что у нас уже есть одна иерархия cgroup, которая была делегирована непривилегированному пользователю, I<cecilia>, посредством старого способа делегирования, описанного выше. Также предположим, что I<cecilia> тоже хочет делегировать одну иерархий из имеющихся в делегированной иерархии (например, делегированная иерархия может быть связана с непривилегированным контейнером, запущенным I<cecilia>). Даже, если пространство имён cgroup namespace было передано, так как обе иерархии принадлежат непривилегированному пользователю I<cecilia>, могут быть выполнены следующие неправомерные действия:

source: A process in the inferior hierarchy could change the resource controller settings in the root directory of that hierarchy. (These resource controller settings are intended to allow control to be exercised from the I<parent> cgroup; a process inside the child cgroup should not be allowed to modify them.)
ru: Процесс в нижележащей иерархии может изменять настройки контроллера ресурсов в корневом каталоге этой иерархии (предполагается, что данными настройками контроллера ресурсов управляют из I<родительской> cgroup; процесс внутри дочерней cgroup не должен быть способен изменять их).

source: A process inside the inferior hierarchy could move processes into and out of the inferior hierarchy if the cgroups in the superior hierarchy were somehow visible.
ru: Процесс в нижележащей иерархии может перемещать процессы в и из нижележащей иерархии, если cgroup вышестоящей иерархии видима откуда-то ещё.

source: Employing the I<nsdelegate> mount option prevents both of these possibilities.
ru: Использование параметра монтирования I<nsdelegate> предотвращает обе эти возможности.

source: The I<nsdelegate> mount option only has an effect when performed in the initial mount namespace; in other mount namespaces, the option is silently ignored.
ru: Параметр монтирования I<nsdelegate> действует только, когда применяется к начальному пространству имён монтирования; для других пространств имён монтирования он игнорируется.

source: I<Note>: On some systems, B<systemd>(1) automatically mounts the cgroup v2 filesystem. In order to experiment with the I<nsdelegate> operation, it may be useful to boot the kernel with the following command-line options:
ru: I<Замечание>: в некоторых системах B<systemd>(1) автоматически монтирует файловую систему cgroup v2. Чтобы попробовать работу с I<nsdelegate> , может быть полезно загрузить ядро с следующими параметрами командной строки:

source: These options cause the kernel to boot with the cgroups v1 controllers disabled (meaning that the controllers are available in the v2 hierarchy), and tells B<systemd>(1) not to mount and use the cgroup v2 hierarchy, so that the v2 hierarchy can be manually mounted with the desired options after boot-up.
ru: Эти параметры заставляют ядро загружаться с выключенными контроллерами cgroups v1 (т. е., контроллеры доступны из иерархии v2) и указывают B<systemd>(1) не монтировать и использовать иерархию cgroup v2, таким образом позволяя вручную смонтировать иерархию v2 с желаемыми параметрами после загрузки.

source: Cgroup delegation containment rules
ru: Сдерживающие правила делегирования cgroup

source: Some delegation I<containment rules> ensure that the delegatee can move processes between cgroups within the delegated subtree, but can't move processes from outside the delegated subtree into the subtree or vice versa. A nonprivileged process (i.e., the delegatee) can write the PID of a "target" process into a I<cgroup.procs> file only if all of the following are true:
ru: Некоторые I<сдерживающие правила> делегирования обеспечивает то, что делегат может перемещать процессы в рамках делегированного поддерева, но не сможет перемещать процессы извне делегированного поддерева в поддерево и наоборот. Непривилегированный процесс (т. е., делегат) может записать PID «целевого» процесса в файл I<cgroup.procs> только, если всё следующее верно:

source: The writer has write permission on the I<cgroup.procs> file in the destination cgroup.
ru: Писатель имеет права на запись в файл I<cgroup.procs> в группе назначения cgroup.

source: The writer has write permission on the I<cgroup.procs> file in the nearest common ancestor of the source and destination cgroups. Note that in some cases, the nearest common ancestor may be the source or destination cgroup itself. This requirement is not enforced for cgroups v1 hierarchies, with the consequence that containment in v1 is less strict than in v2. (For example, in cgroups v1 the user that owns two distinct delegated subhierarchies can move a process between the hierarchies.)
ru: Писатель имеет права на запись в файл I<cgroup.procs> в ближайшем общем предке для cgroups источника и назначения. Заметим, что в некоторых случаях, ближайшим общим предком может быть сама cgroup источника или назначения. Это требование не выполняется в иерархиях cgroups v1, в следствие чего сдерживание в v1 менее ограничительно, чем v2 (например, в cgroups v1 пользователь, которому принадлежат две разных делегированных подиерархий, может перемещать процесс между этими иерархиями).

source: If the cgroup v2 filesystem was mounted with the I<nsdelegate> option, the writer must be able to see the source and destination cgroups from its cgroup namespace.
ru: Если файловая система cgroup v2 смонтирована с параметром I<nsdelegate>, то писатель способен видеть cgroup источника и приёмника из своего пространства имён cgroup.

source: In cgroups v1: the effective UID of the writer (i.e., the delegatee) matches the real user ID or the saved set-user-ID of the target process. Before Linux 4.11, this requirement also applied in cgroups v2 (This was a historical requirement inherited from cgroups v1 that was later deemed unnecessary, since the other rules suffice for containment in cgroups v2.)
ru: В cgroups v1: эффективный UID писателя (т. е., делегата) совпадает с реальным пользовательским ID или сохранённым set-user-ID процесса назначения. До Linux 4.11 это требование также применялось к cgroups v2 (это исторически сложившиеся требование, унаследовано от cgroups v1, которое позднее сочли ненужным, так как достаточно других сдерживающих правил cgroups v2).

source: I<Note>: one consequence of these delegation containment rules is that the unprivileged delegatee can't place the first process into the delegated subtree; instead, the delegater must place the first process (a process owned by the delegatee) into the delegated subtree.
ru: I<Замечание>: одним из следствий этих сдерживающих правил является то, что непривилегированный делегат не может поместить первый процесс в делегированное поддерево; вместо этого делегирующему необходимо поместить первый процесс (процесс, принадлежащей делегату) в делегированное поддерево.

source: CGROUPS VERSION 2 THREAD MODE
ru: РЕЖИМ НИТЕЙ CGROUPS ВЕРСИИ 2

source: Among the restrictions imposed by cgroups v2 that were not present in cgroups v1 are the following:
ru: Ограничения, налагаемые cgroups v2, но отсутствующие в cgroups v1:

source: I<No thread-granularity control>: all of the threads of a process must be in the same cgroup.
ru: I<Нет понитевого управления>: все нити процесса должны быть в одной cgroup.

source: I<No internal processes>: a cgroup can't both have member processes and exercise controllers on child cgroups.
ru: I<Нет внутренних процессов>: cgroup не может иметь одновременно процессов-членов и выполняемых контроллеров в дочерних cgroup.

source: Both of these restrictions were added because the lack of these restrictions had caused problems in cgroups v1. In particular, the cgroups v1 ability to allow thread-level granularity for cgroup membership made no sense for some controllers. (A notable example was the I<memory> controller: since threads share an address space, it made no sense to split threads across different I<memory> cgroups.)
ru: Эти ограничения добавлены из-за того, что их отсутствие вызывало проблемы в cgroups v1. В частности, возможность понитевого контроля членства в cgroups v1 приводило к бессмысленности некоторых контроллеров (особенно это касалось контроллера I<memory>: так как нити используют одно адресное пространство, нет смысла разделять нити по разным I<memory> cgroup).

source: Notwithstanding the initial design decision in cgroups v2, there were use cases for certain controllers, notably the I<cpu> controller, for which thread-level granularity of control was meaningful and useful. To accommodate such use cases, Linux 4.14 added I<thread mode> for cgroups v2.
ru: В первоначальном решении проекта cgroups v2 не учитывалось, что для некоторых контроллеров, таких как I<cpu>, было бы важным и полезным задействовать понитевое управление. Чтобы приспособиться под такие случаи, в Linux 4.14 для cgroups v2 добавлен I<режим нитей>.

source: Thread mode allows the following:
ru: Режим нитей позволяет следующее:

source: The creation of I<threaded subtrees> in which the threads of a process may be spread across cgroups inside the tree. (A threaded subtree may contain multiple multithreaded processes.)
ru: Создание I<поддеревьев нитей>, в которых нити процесса могут размещаться по нескольким cgroup внутри дерева (поддерево нитей может содержать несколько многонитевых процессов).

source: The concept of I<threaded controllers>, which can distribute resources across the cgroups in a threaded subtree.
ru: Концепцию I<контроллеров нитей>, которые могут распределять ресурсы между cgroup в поддереве нитей.

source: A relaxation of the "no internal processes rule", so that, within a threaded subtree, a cgroup can both contain member threads and exercise resource control over child cgroups.
ru: Ослабление «правила отсутствия внутренних процессов», то есть внутри поддерева нитей cgroup может одновременно содержать нити и контроль ресурсов над дочерними cgroup.

source: With the addition of thread mode, each nonroot cgroup now contains a new file, I<cgroup.type>, that exposes, and in some circumstances can be used to change, the "type" of a cgroup. This file contains one of the following type values:
ru: Также, в режиме нитей каждая не корневая cgroup теперь содержит новый файл, I<cgroup.type>, который отражает и, в некоторых случаях, может использоваться для изменения «типа» cgroup. Этот файл содержит одно из следующих значений типа:

source: This is a normal v2 cgroup that provides process-granularity control. If a process is a member of this cgroup, then all threads of the process are (by definition) in the same cgroup. This is the default cgroup type, and provides the same behavior that was provided for cgroups in the initial cgroups v2 implementation.
ru: Обычная cgroup v2, предоставляющая попроцессное управление. Если процесс является членом этой cgroup, то все нити процесса (по определению) находятся в одной cgroup. Это тип cgroup по умолчанию, предоставляет такое же поведение, обеспечиваемое для cgroup начальной реализацией cgroups v2.

source: This cgroup is a member of a threaded subtree. Threads can be added to this cgroup, and controllers can be enabled for the cgroup.
ru: Данная cgroup является членом поддерева нитей. В эту cgroup нити могут добавляться, а контроллеры cgroup включаться.

source: This is a domain cgroup that serves as the root of a threaded subtree. This cgroup type is also known as "threaded root".
ru: Доменная cgroup, которая служит корнем поддерева нитей. Этот тип cgroup также называется «корнем нитей».

source: This is a cgroup inside a threaded subtree that is in an "invalid" state. Processes can't be added to the cgroup, and controllers can't be enabled for the cgroup. The only thing that can be done with this cgroup (other than deleting it) is to convert it to a I<threaded> cgroup by writing the string I<"threaded"> to the I<cgroup.type> file.
ru: Эта cgroup находится внутри поддерева нитей в «некорректном» состоянии. В cgroup невозможно добавлять процессы, а контроллеры cgroup включать. Единственным действием с этой cgroup (помимо удаления) является преобразование в группу с типом I<threaded> посредством записи строки I<"threaded"> в файл I<cgroup.type>.

source: The rationale for the existence of this "interim" type during the creation of a threaded subtree (rather than the kernel simply immediately converting all cgroups under the threaded root to the type I<threaded>) is to allow for possible future extensions to the thread mode model
ru: Обоснованием сущестования этого «переходного» типа при создании поддерева нитей (вместо того, чтобы ядро сразу преобразовывало все cgroup в корне нитей в тип I<threaded>) является задел для возможных будущих расширений модели режима нитей.

source: Threaded versus domain controllers
ru: Сравнение контроллеров домена и нитей

source: With the addition of threads mode, cgroups v2 now distinguishes two types of resource controllers:
ru: С добавлением режима нитей теперь в cgroups v2 различают два типа контроллеров ресурсов:

source: I<Threaded> controllers: these controllers support thread-granularity for resource control and can be enabled inside threaded subtrees, with the result that the corresponding controller-interface files appear inside the cgroups in the threaded subtree. As at Linux 4.19, the following controllers are threaded: I<cpu>, I<perf_event>, and I<pids>.
ru: Контроллеры I<нитей>: эти контроллеры поддерживают понитевое управление ресурсами и могут включаться в поддеревья нитей; в результате появляются соответствующие файлы интерфейса контроллера внутри cgroup в поддереве нитей. В Linux 4.19 имеются следующие контроллеры нитей: I<cpu>, I<perf_event> и I<pids>.

source: I<Domain> controllers: these controllers support only process granularity for resource control. From the perspective of a domain controller, all threads of a process are always in the same cgroup. Domain controllers can't be enabled inside a threaded subtree.
ru: Контроллеры I<домена>: эти контроллеры поддерживают только попроцессное управление ресурсами. С точки зрения контроллера домена все нити процесса всегда находятся в одной группе. Контроллеры домена нельзя включить внутри поддерева нитей.

source: Creating a threaded subtree
ru: Создание поддерева нитей

source: There are two pathways that lead to the creation of a threaded subtree. The first pathway proceeds as follows:
ru: Существует два способа создания поддерева нитей. Первый:

source: We write the string I<"threaded"> to the I<cgroup.type> file of a cgroup I<y/z> that currently has the type I<domain>. This has the following effects:
ru: Записываем строку I<"threaded"> в файл I<cgroup.type> из cgroup I<y/z>, которая в этот момент имеет тип I<domain>. При этом происходит следующее:

source: The type of the cgroup I<y/z> becomes I<threaded>.
ru: Типом cgroup I<y/z> становится I<threaded>.

source: The type of the parent cgroup, I<y>, becomes I<domain threaded>. The parent cgroup is the root of a threaded subtree (also known as the "threaded root").
ru: Типом родительской cgroup, I<y>, становится I<domain threaded>. Родительская cgroup является корнем поддерева нитей (также называемая «корнем нитей»).
