Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: When collecting core dumps via a pipe to a user-space program, it can be useful for the collecting program to gather data about the crashing process from that process's I</proc/[pid]> directory. In order to do this safely, the kernel must wait for the program collecting the core dump to exit, so as not to remove the crashing process's I</proc/[pid]> files prematurely. This in turn creates the possibility that a misbehaving collecting program can block the reaping of a crashed process by simply never exiting.
ru: При отправке дампов памяти через канал в программу пользовательского пространства может быть полезным для собирающей программы получать данные о падающем процессе из каталога процесса I</proc/[pid]>. Для безопасного выполнения ядро должно дождаться завершения собирающей программы, и не удалять файлы падающего процесса I</proc/[pid]>. Это, в свою очередь, создаёт возможность того, что неправильно работающая собирающая программа может заблокировать очистку упавшего процесса просто никогда не завершаясь.

source: Since Linux 2.6.32, the I</proc/sys/kernel/core_pipe_limit> can be used to defend against this possibility. The value in this file defines how many concurrent crashing processes may be piped to user-space programs in parallel. If this value is exceeded, then those crashing processes above this value are noted in the kernel log and their core dumps are skipped.
ru: Начиная с Linux 2.6.32, для защиты от этого можно использовать файл I</proc/sys/kernel/core_pipe_limit>. Значением файла задаётся количество одновременно падающих процессов, которые можно передавать через канал программе из пространства пользователя параллельно. Если это значение превышено, то для выходящих за это ограничение падающих процессов ядро пишет сообщение в лог, а дампы памяти не передаёт.

source: A value of 0 in this file is special. It indicates that unlimited processes may be captured in parallel, but that no waiting will take place (i.e., the collecting program is not guaranteed access to I</proc/E<lt>crashing-PIDE<gt>>). The default value for this file is 0.
ru: Значение файла 0 является специальным. Оно означает, что параллельно можно пересылать бесконечное количество процессов, но ожидание при это не происходит (т. е., собирающей программе не гарантируется доступ к I</proc/E<lt>crashing-PIDE<gt>>). Значение по умолчанию для файла равно 0.

source: Controlling which mappings are written to the core dump
ru: Управление отображениями, записываемыми в дамп памяти

source: Since kernel 2.6.23, the Linux-specific I</proc/[pid]/coredump_filter> file can be used to control which memory segments are written to the core dump file in the event that a core dump is performed for the process with the corresponding process ID.
ru: Начиная с версии 2.6.23, в Linux появился файл I</proc/[pid]/coredump_filter>, который определяет какие сегменты памяти записываются в файл дампа памяти при отклике на событие создания дампа памяти процесса с соответствующим ID процесса.

source: The value in the file is a bit mask of memory mapping types (see B<mmap>(2)). If a bit is set in the mask, then memory mappings of the corresponding type are dumped; otherwise they are not dumped. The bits in this file have the following meanings:
ru: Значение в файле является битовой маской типов отображений памяти (см. B<mmap>(2)). Если бит в маске установлен, то выполняется дамп отображения памяти соответствующего типа; иначе дамп не выполняется. Биты в этом файле имеют следующее значение:

source: bit 0
ru: бит 0

source: Dump anonymous private mappings.
ru: Выполнять дамп анонимных частных отображений.

source: bit 1
ru: бит 1

source: Dump anonymous shared mappings.
ru: Выполнять дамп анонимных общих отображений.

source: bit 2
ru: бит 2

source: Dump file-backed private mappings.
ru: Выполнять дамп частных отображений из виртуальной памяти (file-backed).

source: bit 3
ru: бит 3

source: Dump file-backed shared mappings.
ru: Выполнять дамп общих отображений из виртуальной памяти (file-backed).

source: bit 4 (since Linux 2.6.24)
ru: бит 4 (начиная с Linux 2.6.24)

source: Dump ELF headers.
ru: Выполнять дамп заголовков ELF.

source: bit 5 (since Linux 2.6.28)
ru: бит 5 (начиная с Linux 2.6.28)

source: Dump private huge pages.
ru: Выполнять дамп частных огромных страниц.

source: bit 6 (since Linux 2.6.28)
ru: бит 6 (начиная с Linux 2.6.28)

source: Dump shared huge pages.
ru: Выполнять дамп общих огромных страниц.

source: bit 7 (since Linux 4.4)
ru: бит 7 (начиная с Linux 4.4)

source: Dump private DAX pages.
ru: Выполнять дамп частных страниц DAX.

source: bit 8 (since Linux 4.4)
ru: бит 8 (начиная с Linux 4.4)

source: Dump shared DAX pages.
ru: Выполнять дамп общих страниц DAX.

source: By default, the following bits are set: 0, 1, 4 (if the B<CONFIG_CORE_DUMP_DEFAULT_ELF_HEADERS> kernel configuration option is enabled), and 5. This default can be modified at boot time using the I<coredump_filter> boot option.
ru: По умолчанию, установлены следующие биты: 0, 1, 4 (если включён параметр настройки ядра B<CONFIG_CORE_DUMP_DEFAULT_ELF_HEADERS>) и 5. Данное значение может быть изменено при запуске системы через параметр загрузки I<coredump_filter>.

source: The value of this file is displayed in hexadecimal. (The default value is thus displayed as 33.)
ru: Значения этого файла отображается в шестнадцатеричной системе счисления (то есть значение по умолчанию выглядит как 33).

source: Memory-mapped I/O pages such as frame buffer are never dumped, and virtual DSO (B<vdso>(7)) pages are always dumped, regardless of the I<coredump_filter> value.
ru: Для страниц ввода-вывода, отображённых в память, таких как фрейм-буфер, дамп никогда не выполняется, а виртуальные страницы DSO (B<vdso>(7)) попадают в дамп всегда, независимо от значения I<coredump_filter>.

source: A child process created via B<fork>(2) inherits its parent's I<coredump_filter> value; the I<coredump_filter> value is preserved across an B<execve>(2).
ru: Дочерний процесс, созданный B<fork>(2), наследует значение I<coredump_filter> родителя; значение I<coredump_filter> сохраняется и при B<execve>(2).

source: It can be useful to set I<coredump_filter> in the parent shell before running a program, for example:
ru: Полезно указывать значение I<coredump_filter> в родительской оболочке до запуска программы, например:

source: $B< echo 0x7 E<gt> /proc/self/coredump_filter> $B< ./some_program>
ru: $B< echo 0x7 E<gt> /proc/self/coredump_filter> $B< ./какая-то_программа>

source: This file is provided only if the kernel was built with the B<CONFIG_ELF_CORE> configuration option.
ru: Этот файл есть в системе только, если ядро было собрано с параметром настройки B<CONFIG_ELF_CORE>.

source: Core dumps and systemd
ru: Файлы дампа и systemd

source: On systems using the B<systemd>(1) I<init> framework, core dumps may be placed in a location determined by B<systemd>(1). To do this, B<systemd>(1) employs the I<core_pattern> feature that allows piping core dumps to a program. One can verify this by checking whether core dumps are being piped to the B<systemd-coredump>(8) program:
ru: В системах с B<systemd>(1) в качестве I<init> файлы дампа могут помещаться в каталог, определяемый B<systemd>(1). Для этого B<systemd>(1) использует свойство I<core_pattern>, которое позволяет передавать дампы программе по каналу. Это происходит, если файлы дампа передаются по каналу в программу B<systemd-coredump>(8):

source: In this case, core dumps will be placed in the location configured for B<systemd-coredump>(8), typically as B<lz4>(1) compressed files in the directory I</var/lib/systemd/coredump/>. One can list the core dumps that have been recorded by B<systemd-coredump>(8) using B<coredumpctl>(1):
ru: В этом случае файлы дампа будут помещаться согласно настройкам B<systemd-coredump>(8), обычно в виде сжатых B<lz4>(1) файлов в каталог I</var/lib/systemd/coredump/>. Список файлов дампа, записанных B<systemd-coredump>(8), можно получить с помощью B<coredumpctl>(1):

source: The information shown for each core dump includes the date and time of the dump, the PID, UID, and GID of the dumping process, the signal number that caused the core dump, and the pathname of the executable that was being run by the dumped process. Various options to B<coredumpctl>(1) allow a specified coredump file to be pulled from the B<systemd>(1) location into a specified file. For example, to extract the core dump for PID 2955 shown above to a file named I<core> in the current directory, one could use:
ru: Информация, показываемая для каждого дампа включает дату и время дампа, PID, UID и GID процесса дампа, номер сигнала, вызвавшего дамп, и путь к исполняемому файлу, который был запущен процессом дампа. Различные параметры B<coredumpctl>(1) позволяют выбрать файл coredump, который нужно записать из расположения B<systemd>(1), в заданный файл. Например, чтобы извлечь дамп для PID 2955, показанного выше, в файл с именем I<core> в текущий каталог, сделайте следующее:

source: For more extensive details, see the B<coredumpctl>(1) manual page.
ru: Подробную информацию смотрите в справочной странице B<coredumpctl>(1).

source: To disable the B<systemd>(1) mechanism that archives core dumps, restoring to something more like traditional Linux behavior, one can set an override for the B<systemd>(1) mechanism, using something like:
ru: Для отключения в B<systemd>(1) механизма архивирования дампом и восстановления чего-то более обычного поведению Linux, измените работу B<systemd>(1) следующим образом:

source: The B<gdb>(1) I<gcore> command can be used to obtain a core dump of a running process.
ru: Команду B<gdb>(1) I<gcore> можно использовать для получения дампа памяти работающего процесса.

source: In Linux versions up to and including 2.6.27, if a multithreaded process (or, more precisely, a process that shares its memory with another process by being created with the B<CLONE_VM> flag of B<clone>(2)) dumps core, then the process ID is always appended to the core filename, unless the process ID was already included elsewhere in the filename via a I<%p> specification in I</proc/sys/kernel/core_pattern>. (This is primarily useful when employing the obsolete LinuxThreads implementation, where each thread of a process has a different PID.)
ru: В версии Linux до 26.27 включительно, если для многонитевого процесса (или, точнее, процесса, который делит свою памяти с другим процессом, созданным с флагом B<CLONE_VM> через B<clone>(2)) выполняется дамп памяти, то ID процесса всегда добавляется к имени файла дампа, если ID процесса уже не включён в это имя с помощью I<%p> в I</proc/sys/kernel/core_pattern> (это, главным образом, полезно когда применяется устаревшая реализация LinuxThreads, где каждая нить процесса имеет свой PID).

source: The program below can be used to demonstrate the use of the pipe syntax in the I</proc/sys/kernel/core_pattern> file. The following shell session demonstrates the use of this program (compiled to create an executable named I<core_pattern_pipe_test>):
ru: Эта программа может использоваться для демонстрации синтаксиса канала в файле I</proc/sys/kernel/core_pattern>. Следующий сеанс оболочки демонстрирует использование данной программы (при компиляции был создан исполняемый файл с именем I<core_pattern_pipe_test>):

source: /* Change our current working directory to that of the crashing process */
ru: /* Изменяем наш текущий рабочий каталог на тот, что у упавшего процесса */

source: /* Write output to file "core.info" in that directory */
ru: /* Записываем вывод в файл "core.info" в этом каталоге */

source: /* Display command-line arguments given to core_pattern pipe program */
ru: /* Показываем аргументы командной строки, переданные программе core_pattern */

source: /* Count bytes in standard input (the core dump) */
ru: /* Подсчитываем байты стандартного ввода (дампа памяти) */

source: charmap - character set description file
ru: charmap - файл описания набора символов

source: A character set description (charmap) defines all available characters and their encodings in a character set. B<localedef>(1) can use charmaps to create locale variants for different character sets.
ru: Описание набора символов (charmap) определяет набор из всех доступных символов, а также их кодировки. Эти описания можно использовать в B<localedef>(1) для создания вариантов локали с различными наборами символов.

source: Syntax
ru: СИНТАКСИС

source: The charmap file starts with a header that may consist of the following keywords:
ru: Файл с набором символов начинается с заголовка, который может содержать следующие ключевые слова:

source: is followed by the name of the character map.
ru: за которым следует имя набора символов.

source: is followed by a character that will be used as the comment character for the rest of the file. It defaults to the number sign (#).
ru: за которым указывается символ, использующийся в оставшихся строках файла как символ комментария. По умолчанию это символ решётки (#).

source: is followed by a character that should be used as the escape character for the rest of the file to mark characters that should be interpreted in a special way. It defaults to the backslash (\e).
ru: за которым указывается символ, использующийся в оставшихся строках файла как символ экранирования для пометки символов, которые должны обрабатываться особым образом. По умолчанию это символ обратной косой черты (\e).

source: is followed by the maximum number of bytes for a character. The default value is 1.
ru: за которым следует максимальное количество байтов на символ. По умолчанию это число равно 1.

source: is followed by the minimum number of bytes for a character. This value must be less than or equal than E<lt>I<mb_cur_max>E<gt>. If not specified, it defaults to E<lt>I<mb_cur_max>E<gt>.
ru: за которым следует минимальное количество байтов на символ. Данное значение должно быть меньше или равно E<lt>I<mb_cur_max>E<gt>. Если оно не задано, то по умолчанию принимается значение E<lt>I<mb_cur_max>E<gt>.

source: The character set definition section starts with the keyword I<CHARMAP> in the first column.
ru: Раздел определения набора символов начинается с ключевого слова I<CHARMAP> в первом столбце.

source: The following lines may have one of the two following forms to define the character set:
ru: Последующие строки могут иметь один из двух форматов, предназначенных для задания набора символов:

source: E<lt>I<character>E<gt>\ I<byte-sequence\ comment>
ru: E<lt>I<символ>E<gt>\ I<последовательность-байт\ комментарий>

source: This form defines exactly one character and its byte sequence, I<comment> being optional.
ru: В таком виде задаётся только один символ и его последовательность байт, I<комментарий> необязателен.

source: E<lt>I<character>E<gt>..E<lt>I<character>E<gt>\ I<byte-sequence\ comment>
ru: E<lt>I<символ>E<gt>..E<lt>I<символ>E<gt>\ I<последовательность-байт\ комментарий>

source: This form defines a character range and its byte sequence, I<comment> being optional.
ru: В таком виде задаётся диапазон символов и его последовательность байт, I<комментарий> необязателен.

source: The character set definition section ends with the string I<END CHARMAP>.
ru: Раздел определения набора символов заканчивается строкой I<END CHARMAP>.

source: The character set definition section may optionally be followed by a section to define widths of characters.
ru: За разделом определения набора символов может следовать раздел ширины символов.

source: The I<WIDTH_DEFAULT> keyword can be used to define the default width for all characters not explicitly listed. The default character width is 1.
ru: Для определения ширины по умолчанию для всех символов, где она не указана можно использовать ключевое слово I<WIDTH_DEFAULT>. Ширина символа по умолчанию равна 1.

source: The width section for individual characters starts with the keyword I<WIDTH> in the first column.
ru: Раздел ширины отдельных символов начинается с ключевого слова I<WIDTH> в первом столбце.

source: The following lines may have one of the two following forms to define the widths of the characters:
ru: Последующие строки могут иметь один из двух форматов, предназначенных для задания ширин символов:

source: E<lt>I<character>E<gt>\ I<width>
ru: E<lt>I<символ>E<gt>\ I<ширина>

source: This form defines the width of exactly one character.
ru: В таком виде задаётся ширина только одного символа.

source: E<lt>I<character>E<gt>...E<lt>I<character>E<gt>\ I<width>
ru: E<lt>I<символ>E<gt>…E<lt>I<символ>E<gt>\ I<ширина>

source: This form defines the width for all the characters in the range.
ru: В таком виде задаётся ширина всех символов в диапазоне.

source: The width definition section ends with the string I<END WIDTH>.
ru: Раздел определения ширины заканчивается строкой I<END WIDTH>.

source: Usual default character map path.
ru: Обычный путь по умолчанию для файлов карт символов.

source: The Euro sign is defined as follows in the I<UTF-8> charmap:
ru: Знак евро определяется в наборе символов I<UTF-8> следующим образом:

source: crypt, crypt_r - password and data encryption
ru: crypt, crypt_r - шифрует пароль и данные

source: B<#define _XOPEN_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>unistd.hE<gt>>
ru: B<#define _XOPEN_SOURCE> /* См. feature_test_macros(7) */ B<#include E<lt>unistd.hE<gt>>

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */ B<#include E<lt>crypt.hE<gt>>
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */ B<#include E<lt>crypt.hE<gt>>

source: Link with I<-lcrypt>.
ru: Компонуется при указании параметра I<-lcrypt>.

source: B<crypt>() is the password encryption function. It is based on the Data Encryption Standard algorithm with variations intended (among other things) to discourage use of hardware implementations of a key search.
ru: B<crypt>() — функция шифрования пароля. Она основана на алгоритме стандарта шифрования данных (Data Encryption Standard) с различными расширениями, нацеленными (помимо прочего) на усложнение задачи поиска ключа при помощи специального оборудования.

source: I<key> is a user's typed password.
ru: I<key> — задаваемый пользователем пароль.

source: I<salt> is a two-character string chosen from the set [B<a-zA-Z0-9./>]. This string is used to perturb the algorithm in one of 4096 different ways.
ru: I<salt> (соль) — двухсимвольная строка, выбираемая из набора [B<a-zA-Z0-9./>]. Эта строка используется для направления алгоритма по одному из 4096-и путей.

source: By taking the lowest 7 bits of each of the first eight characters of the I<key>, a 56-bit key is obtained. This 56-bit key is used to encrypt repeatedly a constant string (usually a string consisting of all zeros). The returned value points to the encrypted password, a series of 13 printable ASCII characters (the first two characters represent the salt itself). The return value points to static data whose content is overwritten by each call.
ru: Если взять младшие 7 битов каждого из первых 8 символов I<key>, то получается 56-битный ключ. Этот ключ используется для многократного шифрования константной строки (обычно строки, состоящей из символов «0»). Возвращаемое значение — указатель на зашифрованный пароль, серия из 13-и печатных ASCII-символов (первые два символа содержат I<salt>). Возвращаемое значение указывает на статические данные, которые перезаписываются при каждом вызове.

source: Warning: the key space consists of
ru: Предупреждение: количество ключей равно

source: equal 7.2e16 possible values. Exhaustive searches of this key space are possible using massively parallel computers. Software, such as B<crack>(1), is available which will search the portion of this key space that is generally used by humans for passwords. Hence, password selection should, at minimum, avoid common words and names. The use of a B<passwd>(1) program that checks for crackable passwords during the selection process is recommended.
ru: т. е. существует 7.2e16 возможных вариантов. Полный перебор этого множестве возможен с помощью большого количества параллельных компьютеров. Программное обеспечение, такое, как B<crack>(1), способно отыскать часть ключей из этого множества, обычно используемых людьми для создания пароля. Поэтому в качестве пароля не стоит, как минимум, использовать простые слова и имена. Рекомендуется использовать программу B<passwd>(1), которая проверяет сложность пароля уже на стадии ввода.

source: The DES algorithm itself has a few quirks which make the use of the B<crypt>() interface a very poor choice for anything other than password authentication. If you are planning on using the B<crypt>() interface for a cryptography project, don't do it: get a good book on encryption and one of the widely available DES libraries.
ru: Алгоритм DES имеет некоторые особенности, которые не позволяют использовать интерфейс B<crypt>() для чего-то кроме аутентификации пользователя по паролю. Если вы планируете использовать интерфейс B<crypt>() в проекте шифрования, то лучше не делайте этого. Вместо этого возьмите хорошую книгу по шифрованию или одну из общедоступных библиотек DES.

source: B<crypt_r>() is a reentrant version of B<crypt>(). The structure pointed to by I<data> is used to store result data and bookkeeping information. Other than allocating it, the only thing that the caller should do with this structure is to set I<data-E<gt>initialized> to zero before the first call to B<crypt_r>().
ru: Функция B<crypt_r>() является реентерабельной версией B<crypt>(). Для учёта и хранения результата в ней используется структура, на которую указывает I<data>. Перед первым вызовом B<crypt_r>() требуется выделить место под структуру и присвоить I<data-E<gt>initialized> значение 0.

source: On success, a pointer to the encrypted password is returned. On error, NULL is returned.
ru: При успешном выполнении возвращает указатель на шифрованный пароль. При ошибке возвращается NULL.

source: I<salt> has the wrong format.
ru: Значение I<salt> имеет неверный формат.

source: The B<crypt>() function was not implemented, probably because of U.S.A. export restrictions.
ru: Функция B<crypt>() не реализована, возможно, из-за запретов США на экспорт алгоритмов шифрования.

source: I</proc/sys/crypto/fips_enabled> has a nonzero value, and an attempt was made to use a weak encryption type, such as DES.
ru: Значение I</proc/sys/crypto/fips_enabled> не равно нулю, но делается попытка использовать нестойкий тип шифрования, такой как DES.

source: B<crypt>(): POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. B<crypt_r>() is a GNU extension.
ru: B<crypt>(): POSIX.1-2001, POSIX.1-2008, SVr4, 4.3BSD. Функция B<crypt_r>() является расширением GNU.

source: Availability in glibc
ru: Доступность в glibc
