Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: In cgroups v1, a distinction is drawn between I<processes> and I<tasks>. In this view, a process can consist of multiple tasks (more commonly called threads, from a user-space perspective, and called such in the remainder of this man page). In cgroups v1, it is possible to independently manipulate the cgroup memberships of the threads in a process.
ru: В cgroups v1 I<процессы> и I<задачи> различаются. Процесс может состоять из нескольких задач (чаще всего называемых нитями, если смотреть из пользовательского пространства, и так они будут называться далее в этой справочной странице). В cgroups v1 возможно независимо управлять членством cgroup для нитей процесса.

source: The cgroups v1 ability to split threads across different cgroups caused problems in some cases. For example, it made no sense for the I<memory> controller, since all of the threads of a process share a single address space. Because of these problems, the ability to independently manipulate the cgroup memberships of the threads in a process was removed in the initial cgroups v2 implementation, and subsequently restored in a more limited form (see the discussion of "thread mode" below).
ru: В некоторых случаях способность cgroups v1 разделять нити по разным cgroups вызывает проблемы. Например, это не имеет смысла для контроллера I<memory>, так как все нити процесса находятся в одном адресном пространстве. Из-за таких проблем способность независимого управления членством cgroup для нитей процесса была удалена в первой реализации cgroups v2, но позже восстановлена в более ограниченном виде (смотрите описание «режим нитей» ниже).

source: Mounting v1 controllers
ru: Монтирование контроллеров v1

source: The use of cgroups requires a kernel built with the B<CONFIG_CGROUP> option. In addition, each of the v1 controllers has an associated configuration option that must be set in order to employ that controller.
ru: Для использования cgroups требуется собрать ядро с параметром B<CONFIG_CGROUP>. Также с каждым контроллером v1 связан параметр настройки, который должен быть задан, если нужно работать с этим контроллером.

source: In order to use a v1 controller, it must be mounted against a cgroup filesystem. The usual place for such mounts is under a B<tmpfs>(5) filesystem mounted at I</sys/fs/cgroup>. Thus, one might mount the I<cpu> controller as follows:
ru: Чтобы использовать контроллер a v1, его нужно смонтировать в файловую систему cgroup. Обычно для этого используют файловую систему B<tmpfs>(5), смонтированную в I</sys/fs/cgroup>. Таким образом, можно смонтировать контроллер I<cpu> следующим образом:

source: It is possible to comount multiple controllers against the same hierarchy. For example, here the I<cpu> and I<cpuacct> controllers are comounted against a single hierarchy:
ru: Можно смонтировать несколько контроллеров вместе в одной иерархии. Например, так контроллеры I<cpu> и I<cpuacct> одновременно монтируются в одной иерархии:

source: Comounting controllers has the effect that a process is in the same cgroup for all of the comounted controllers. Separately mounting controllers allows a process to be in cgroup I</foo1> for one controller while being in I</foo2/foo3> for another.
ru: Для одновременно смонтированных контроллеров процесс находится в одной cgroup всех одновременно смонтированных контроллеров. Отдельно смонтированные контроллеры позволяют процессу находиться в cgroup I</foo1> одного контроллера и в I</foo2/foo3> другого.

source: It is possible to comount all v1 controllers against the same hierarchy:
ru: Можно смонтировать все контроллеры v1 вместе в одной иерархии:

source: (One can achieve the same result by omitting I<-o all>, since it is the default if no controllers are explicitly specified.)
ru: (Параметр I<-o all> можно опустить, так как по умолчанию монтируются все контроллеры, если ни один не указан явно)

source: It is not possible to mount the same controller against multiple cgroup hierarchies. For example, it is not possible to mount both the I<cpu> and I<cpuacct> controllers against one hierarchy, and to mount the I<cpu> controller alone against another hierarchy. It is possible to create multiple mount points with exactly the same set of comounted controllers. However, in this case all that results is multiple mount points providing a view of the same hierarchy.
ru: Невозможно смонтировать один и тот же контроллер в несколько иерархий cgroup. Например, невозможно смонтировать контроллеры I<cpu> и I<cpuacct> в одну иерархию и смонтировать только контроллер I<cpu> в другую. Возможно создать несколько точек монтирования с полностью одинаковым набором одновременно смонтированных контроллеров. Однако в этом случае получается только несколько точек монтирования, представляющих одну иерархию.

source: Note that on many systems, the v1 controllers are automatically mounted under I</sys/fs/cgroup>; in particular, B<systemd>(1) automatically creates such mount points.
ru: Заметим, что на многих системах контроллеры v1 автоматически монтируется в I</sys/fs/cgroup>; в частности, такие точки монтирования автоматически создаёт B<systemd>(1).

source: Unmounting v1 controllers
ru: Размонтирование контроллеров v1

source: A mounted cgroup filesystem can be unmounted using the B<umount>(8) command, as in the following example:
ru: Смонтированная файловая система cgroup может быть размонтирована с помощью команды B<umount>(8) как показано в этом примере:

source: I<But note well>: a cgroup filesystem is unmounted only if it is not busy, that is, it has no child cgroups. If this is not the case, then the only effect of the B<umount>(8) is to make the mount invisible. Thus, to ensure that the mount point is really removed, one must first remove all child cgroups, which in turn can be done only after all member processes have been moved from those cgroups to the root cgroup.
ru: I<Но заметим>: файловая система cgroup размонтируется только, если она не занята, то есть не имеет дочерних cgroup. Если это не этот случай, то действием B<umount>(8) будет только сокрытие монтирования. То есть, чтобы действительно удалить точку монтирования, сначала нужно удалить все дочерние cgroup, что, в свою очередь, можно выполнить только после перемещения всех процессов-членов из этих cgroup в корневую cgroup.

source: Cgroups version 1 controllers
ru: Контроллеры cgroups версии 1

source: Each of the cgroups version 1 controllers is governed by a kernel configuration option (listed below). Additionally, the availability of the cgroups feature is governed by the B<CONFIG_CGROUPS> kernel configuration option.
ru: Все контроллеры cgroups версии 1 управляются параметрами настройки ядра (список далее). Также, включение свойства cgroups управляется параметром настройки ядра B<CONFIG_CGROUPS>.

source: I<cpu> (since Linux 2.6.24; B<CONFIG_CGROUP_SCHED>)
ru: I<cpu> (начиная с Linux 2.6.24; B<CONFIG_CGROUP_SCHED>)

source: Cgroups can be guaranteed a minimum number of "CPU shares" when a system is busy. This does not limit a cgroup's CPU usage if the CPUs are not busy. For further information, see I<Documentation/scheduler/sched-design-CFS.txt>.
ru: Cgroups может гарантироваться минимальное количество «общих ЦП» в занятой системе. Это значение не ограничивает использование ЦП cgroup, если ЦП не заняты. Дополнительную информацию смотрите в I<Documentation/scheduler/sched-design-CFS.txt>.

source: In Linux 3.2, this controller was extended to provide CPU "bandwidth" control. If the kernel is configured with B<CONFIG_CFS_BANDWIDTH>, then within each scheduling period (defined via a file in the cgroup directory), it is possible to define an upper limit on the CPU time allocated to the processes in a cgroup. This upper limit applies even if there is no other competition for the CPU. Further information can be found in the kernel source file I<Documentation/scheduler/sched-bwc.txt>.
ru: В Linux 3.2 в этот контроллер было добавлено управление «полосы пропускания» ЦП. Если ядро собрано с параметром B<CONFIG_CFS_BANDWIDTH>, то внутри каждого диапазона планирования (определяемого через файл в каталоге cgroup) процессам в cgroup возможно задать верхнее ограничение выделяемого времени ЦП. Данное ограничение учитывается даже, если ЦП не занят. Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/scheduler/sched-bwc.txt>.

source: I<cpuacct> (since Linux 2.6.24; B<CONFIG_CGROUP_CPUACCT>)
ru: I<cpuacct> (начиная с Linux 2.6.24; B<CONFIG_CGROUP_CPUACCT>)

source: This provides accounting for CPU usage by groups of processes.
ru: Включает учёт использования ЦП группами процессов.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/cpuacct.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/cpuacct.txt>.

source: I<cpuset> (since Linux 2.6.24; B<CONFIG_CPUSETS>)
ru: I<cpuset> (начиная с Linux 2.6.24; B<CONFIG_CPUSETS>)

source: This cgroup can be used to bind the processes in a cgroup to a specified set of CPUs and NUMA nodes.
ru: Эту cgroup можно использовать для привязки процессов в cgroup к указанному набору ЦП и узлов NUMA.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/cpusets.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/cpusets.txt>.

source: I<memory> (since Linux 2.6.25; B<CONFIG_MEMCG>)
ru: I<memory> (начиная с Linux 2.6.25; B<CONFIG_MEMCG>)

source: The memory controller supports reporting and limiting of process memory, kernel memory, and swap used by cgroups.
ru: Контроллер памяти поддерживает учёт и ограничение памяти процесса, памяти ядра и подкачки, используемой cgroups.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/memory.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/memory.txt>.

source: I<devices> (since Linux 2.6.26; B<CONFIG_CGROUP_DEVICE>)
ru: I<devices> (начиная с Linux 2.6.26; B<CONFIG_CGROUP_DEVICE>)

source: This supports controlling which processes may create (mknod) devices as well as open them for reading or writing. The policies may be specified as whitelists and blacklists. Hierarchy is enforced, so new rules must not violate existing rules for the target or ancestor cgroups.
ru: Позволяет контролировать какие процессы могут создавать (mknod) устройства, а также открывать их на чтение или запись. Правила можно задавать в виде чёрных и белых списков. Учитывает иерархия, поэтому новые правила не должны нарушать существующие у cgroups назначения или предков.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/devices.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/devices.txt>.

source: I<freezer> (since Linux 2.6.28; B<CONFIG_CGROUP_FREEZER>)
ru: I<freezer> (начиная с Linux 2.6.28; B<CONFIG_CGROUP_FREEZER>)

source: The I<freezer> cgroup can suspend and restore (resume) all processes in a cgroup. Freezing a cgroup I</A> also causes its children, for example, processes in I</A/B>, to be frozen.
ru: I<freezer> cgroup может приостанавливать и возобновлять работу всех процессов в cgroup. Заморозка cgroup I</A> также влияет на её потомков, например, процессы в I</A/B> тоже приостанавливаются.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/freezer-subsystem.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/freezer-subsystem.txt>.

source: I<net_cls> (since Linux 2.6.29; B<CONFIG_CGROUP_NET_CLASSID>)
ru: I<net_cls> (начиная с Linux 2.6.29; B<CONFIG_CGROUP_NET_CLASSID>)

source: This places a classid, specified for the cgroup, on network packets created by a cgroup. These classids can then be used in firewall rules, as well as used to shape traffic using B<tc>(8). This applies only to packets leaving the cgroup, not to traffic arriving at the cgroup.
ru: Помещает classid, задаваемые для cgroup, в сетевые пакеты, создаваемые cgroup. Эти classid затем можно использовать в правилах межсетевого экрана, а также для ограничения трафика с помощью B<tc>(8). Применяется только к пакетам, выходящим из cgroup, и не применяется к входящему трафику cgroup.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/net_cls.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/net_cls.txt>.

source: I<blkio> (since Linux 2.6.33; B<CONFIG_BLK_CGROUP>)
ru: I<blkio> (начиная с Linux 2.6.33; B<CONFIG_BLK_CGROUP>)

source: The I<blkio> cgroup controls and limits access to specified block devices by applying IO control in the form of throttling and upper limits against leaf nodes and intermediate nodes in the storage hierarchy.
ru: I<blkio> cgroup контролирует и ограничивает доступ к заданным блочным устройствам, применяет управление вводом-выводом посредством пропусков (throttling) и ограничения сверху листовых узлов и и промежуточных узлов в иерархии хранилища.

source: Two policies are available. The first is a proportional-weight time-based division of disk implemented with CFQ. This is in effect for leaf nodes using CFQ. The second is a throttling policy which specifies upper I/O rate limits on a device.
ru: Доступно две стратегии. Первая: пропорционально взвешенное повременное разделение диска, реализованная посредством CFQ. Влияет на листовые узлы с помощью CFQ. Вторая: стратегия пропусков, которая задаётся верхним ограничением скорости обмена с устройством.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/blkio-controller.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/blkio-controller.txt>.

source: I<perf_event> (since Linux 2.6.39; B<CONFIG_CGROUP_PERF>)
ru: I<perf_event> (начиная с Linux 2.6.39; B<CONFIG_CGROUP_PERF>)

source: This controller allows I<perf> monitoring of the set of processes grouped in a cgroup.
ru: Этот контроллер позволяет выполнять слежение I<perf> за набором процессов, сгруппированных в cgroup.

source: Further information can be found in the kernel source file I<tools/perf/Documentation/perf-record.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<tools/perf/Documentation/perf-record.txt>.

source: I<net_prio> (since Linux 3.3; B<CONFIG_CGROUP_NET_PRIO>)
ru: I<net_prio> (начиная с Linux 3.3; B<CONFIG_CGROUP_NET_PRIO>)

source: This allows priorities to be specified, per network interface, for cgroups.
ru: Позволяет для cgroups задавать свой приоритет на каждый интерфейс.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/net_prio.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/net_prio.txt>.

source: I<hugetlb> (since Linux 3.5; B<CONFIG_CGROUP_HUGETLB>)
ru: I<hugetlb> (начиная с Linux 3.5; B<CONFIG_CGROUP_HUGETLB>)

source: This supports limiting the use of huge pages by cgroups.
ru: Поддерживает ограничение cgroups на использование огромных страниц.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/hugetlb.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/hugetlb.txt>.

source: I<pids> (since Linux 4.3; B<CONFIG_CGROUP_PIDS>)
ru: I<pids> (начиная с Linux 4.3; B<CONFIG_CGROUP_PIDS>)

source: This controller permits limiting the number of process that may be created in a cgroup (and its descendants).
ru: Этот контроллер позволяет ограничивать количество процессов, которые могут быть созданы в cgroup (и её потомках).

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/pids.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/pids.txt>.

source: I<rdma> (since Linux 4.11; B<CONFIG_CGROUP_RDMA>)
ru: I<rdma> (начиная с Linux 4.11; B<CONFIG_CGROUP_RDMA>)

source: The RDMA controller permits limiting the use of RDMA/IB-specific resources per cgroup.
ru: Контроллер RDMA позволяет ограничивать использование ресурсов RDMA/IB определённой cgroup.

source: Further information can be found in the kernel source file I<Documentation/cgroup-v1/rdma.txt>.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v1/rdma.txt>.

source: Creating cgroups and moving processes
ru: Создание cgroups и перемещение процессов

source: A cgroup filesystem initially contains a single root cgroup, '/', which all processes belong to. A new cgroup is created by creating a directory in the cgroup filesystem:
ru: Первоначально, в файловой системе cgroup содержится только корневая cgroup, «/», которой принадлежат все процессы. Новая cgroup создаётся посредством создания каталога в файловой системе cgroup:

source: This creates a new empty cgroup.
ru: Данная команда создаёт новую пустую cgroup.

source: A process may be moved to this cgroup by writing its PID into the cgroup's I<cgroup.procs> file:
ru: Помещение процесса в эту cgroup выполняется с помощью записи его PID в файл cgroup I<cgroup.procs>:

source: Only one PID at a time should be written to this file.
ru: В этот файл единовременно должен записываться только один PID.

source: Writing the value 0 to a I<cgroup.procs> file causes the writing process to be moved to the corresponding cgroup.
ru: Запись в файл I<cgroup.procs> значения 0 приводит к помещению в соответствующую cgroup записывающего процесса.

source: When writing a PID into the I<cgroup.procs>, all threads in the process are moved into the new cgroup at once.
ru: При записи PID в I<cgroup.procs> в новую cgroup одновременно перемещаются все нити процесса.

source: Within a hierarchy, a process can be a member of exactly one cgroup. Writing a process's PID to a I<cgroup.procs> file automatically removes it from the cgroup of which it was previously a member.
ru: Внутри иерархии процесс может быть членом только одной cgroup. Запись PID процесса в файл I<cgroup.procs> автоматически удаляет его из cgroup, в которой он числился до этого.

source: The I<cgroup.procs> file can be read to obtain a list of the processes that are members of a cgroup. The returned list of PIDs is not guaranteed to be in order. Nor is it guaranteed to be free of duplicates. (For example, a PID may be recycled while reading from the list.)
ru: Для получения списка процессов, числящихся в cgroup, можно прочитать файл I<cgroup.procs>. Возвращаемый список PID не обязательно упорядочен. Также PID могут повторяться (например, во время чтения списка PID может использоваться повторно).

source: In cgroups v1, an individual thread can be moved to another cgroup by writing its thread ID (i.e., the kernel thread ID returned by B<clone>(2) and B<gettid>(2)) to the I<tasks> file in a cgroup directory. This file can be read to discover the set of threads that are members of the cgroup.
ru: В cgroups v1 отдельные нити могут перемещаться в другую cgroup посредством записи ID нити (т. е., ядерный ID нити, возвращаемый B<clone>(2) и B<gettid>(2)) в файл I<tasks> из каталога cgroup. Этот файл можно прочитать, чтобы получить набор нитей, принадлежащих cgroup.

source: Removing cgroups
ru: Удаление cgroups

source: To remove a cgroup, it must first have no child cgroups and contain no (nonzombie) processes. So long as that is the case, one can simply remove the corresponding directory pathname. Note that files in a cgroup directory cannot and need not be removed.
ru: Удаляемая cgroup не должна содержать дочерних cgroups и процессов (не зомби). Если это соблюдается, то можно просто удалить соответствующий каталог. Заметим, что файлы в каталоге cgroup невозможно и ненужно удалять.

source: Cgroups v1 release notification
ru: Выпуск уведомлений cgroups v1

source: Two files can be used to determine whether the kernel provides notifications when a cgroup becomes empty. A cgroup is considered to be empty when it contains no child cgroups and no member processes.
ru: Для определения того, как ядро выполняет уведомления об опустевших cgroup, можно использовать два файла. Cgroup считается пустой, если не содержит дочерних cgroup и процессов.

source: A special file in the root directory of each cgroup hierarchy, I<release_agent>, can be used to register the pathname of a program that may be invoked when a cgroup in the hierarchy becomes empty. The pathname of the newly empty cgroup (relative to the cgroup mount point) is provided as the sole command-line argument when the I<release_agent> program is invoked. The I<release_agent> program might remove the cgroup directory, or perhaps repopulate it with a process.
ru: Специальный файл в корневом каталоге каждой иерархии cgroup, I<release_agent>, можно использовать для регистрации программы, которая будет вызываться всякий раз, когда cgroup в иерархии становится пустой. При вызове программы I<release_agent> в единственной аргументе командной строки передаётся путь (относительно точки монтирования cgroup) только что опустевшей cgroup. Программа I<release_agent> может удалить удалить каталог cgroup или, возможно, повторно добавить в него процесс.

source: The default value of the I<release_agent> file is empty, meaning that no release agent is invoked.
ru: По умолчанию файл I<release_agent> пуст, то есть агент освобождения не вызывается.

source: The content of the I<release_agent> file can also be specified via a mount option when the cgroup filesystem is mounted:
ru: Содержимое файла I<release_agent> также можно задать в параметре монтирования при монтировании файловой системы cgroup:

source: mount -o release_agent=pathname ...
ru: mount -o release_agent=файл …

source: Whether or not the I<release_agent> program is invoked when a particular cgroup becomes empty is determined by the value in the I<notify_on_release> file in the corresponding cgroup directory. If this file contains the value 0, then the I<release_agent> program is not invoked. If it contains the value 1, the I<release_agent> program is invoked. The default value for this file in the root cgroup is 0. At the time when a new cgroup is created, the value in this file is inherited from the corresponding file in the parent cgroup.
ru: Будет ли программа I<release_agent> вызываться для определённой ставшей пустой cgroup, задаётся значением файла I<notify_on_release> в каталоге, соответствующем cgroup. Если этот файл содержит значение 0, то программа I<release_agent> не вызывается. Если он содержит 1, то программа I<release_agent> вызывается. По умолчанию в этом файле содержится 0 для корневой cgroup. В момент, когда создаётся новая cgroup, значение в этом файле наследуется из соответствующего файла родительской cgroup.

source: Cgroup v1 named hierarchies
ru: Именованные иерархии cgroup v1

source: In cgroups v1, it is possible to mount a cgroup hierarchy that has no attached controllers:
ru: В cgroups v1 возможно монтирование иерархии cgroup, у которой нет присоединённых контроллеров:

source: mount -t cgroup -o none,name=somename none /some/mount/point
ru: mount -t cgroup -o none,name=какое-то_имя none /some/mount/point
