Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: The user-defined mapping table can be set using B<mapscrn>(8). The result of the mapping is that if a symbol c is printed, the symbol s = map[c] is sent to the video memory. The bitmap that corresponds to s is found in the character ROM, and can be changed using B<setfont>(8).
ru: Определенная пользователем таблица перекодировки может быть установлена с помощью B<mapscrn>(8). Результатом перекодировки будет то, что при указании символа c в видеопамять будет отправлен символ s = перекодировка[c] . Побитовое изображение, соответствующее s, ищется в ПЗУ символов и может меняться при помощи B<setfont>(8).

source: Mouse tracking
ru: Отслеживание мыши

source: The mouse tracking facility is intended to return B<xterm>(1)-compatible mouse status reports. Because the console driver has no way to know the device or type of the mouse, these reports are returned in the console input stream only when the virtual terminal driver receives a mouse update ioctl. These ioctls must be generated by a mouse-aware user-mode application such as the B<gpm>(8) daemon.
ru: Для отслеживания работы мыши в системе предполагается выдача B<xterm>(1)-совместимых сигналов о состоянии мыши. Так как драйвер консоли не распознает такого устройства, как мышь (или похожего типа), то эти сигналы отправляются во входной поток консоли, только когда драйвер виртуального терминала получает сигнал ioctl об обновлении состояния мыши. Эти сигналы ioctl должны генерироваться пользовательскими приложениями, поддерживающими работу с мышью такими, как служба B<gpm>(8).

source: The mouse tracking escape sequences generated by B<xterm>(1) encode numeric parameters in a single character as I<value>+040. For example, \(aq!\(aq is 1. The screen coordinate system is 1-based.
ru: Параметром для всех созданных B<xterm>(1) экранирующих последовательностей (сигналов от мыши) будет один символ, код которого равен I<значение>+040. Например, \(aq!\(aq соответствует единице. Отчёт системы координат экрана начинается с 1.

source: The X10 compatibility mode sends an escape sequence on button press encoding the location and the mouse button pressed. It is enabled by sending ESC [ ? 9 h and disabled with ESC [ ? 9 l. On button press, B<xterm>(1) sends ESC [ M I<bxy> (6 characters). Here I<b> is button-1, and I<x> and I<y> are the x and y coordinates of the mouse when the button was pressed. This is the same code the kernel also produces.
ru: В режиме совместимости с X10 при нажатии на кнопки посылаются экранирующие последовательности, в которых кодируется и расположение мыши, и информация о нажатой кнопке. Режим включается при выдаче ESC [ ? 9 h и выключается при выдаче ESC [ ? 9 l. При нажатии на кнопку B<xterm>(1) посылает ESC [ M I<bxy> (6 символов), где b \(em это кнопка 1, а x и y равны координатам x и y при нажатии на кнопку. Это такие же коды, какие генерирует и выдаёт ядро.

source: Normal tracking mode (not implemented in Linux 2.0.24) sends an escape sequence on both button press and release. Modifier information is also sent. It is enabled by sending ESC [ ? 1000 h and disabled with ESC [ ? 1000 l. On button press or release, B<xterm>(1) sends ESC [ M I<bxy>. The low two bits of I<b> encode button information: 0=MB1 pressed, 1=MB2 pressed, 2=MB3 pressed, 3=release. The upper bits encode what modifiers were down when the button was pressed and are added together: 4=Shift, 8=Meta, 16=Control. Again I<x> and I<y> are the x and y coordinates of the mouse event. The upper left corner is (1,1).
ru: В обычном режиме отслеживания мыши (который не был реализован в Linux 2.0.24) экранирующие последовательности посылаются и при нажатии и при отпускании кнопки мыши. Также посылается информация о модификаторе. Режим включается при выдаче ESC [ ? 1000 h и выключается при выдаче ESC [ 1000 l. При нажатии или отпускании кнопки B<xterm>(1) выдает ESC [ M I<bxy>. Два младших бита I<b> содержат информацию о кнопках: 0=MB1 нажата, 1=MB2 нажата, 2=MB3 нажата, 3=отпущена. Старшие биты содержат информацию о том, какие модификаторы были нажаты, когда была нажата кнопка. Эта информация складывается при нажатии: 4=Shift, 8=Meta, 16=Control. Ещё раз: I<x> и I<y> являются координатами x и y мыши при обработке события. Координаты верхнего левого угла рассматриваются как (1,1).

source: Comparisons with other terminals
ru: Сравнение с другими терминалами

source: Many different terminal types are described, like the Linux console, as being "VT100-compatible". Here we discuss differences between the Linux console and the two most important others, the DEC VT102 and B<xterm>(1).
ru: Множество других типов терминалов описаны, подобно консоли Linux, как VT100-совместимые. Далее мы обсудим различия между консолью Linux и двумя другими важнейшими типами \(em DEC VT102 и B<xterm>(1).

source: B<Control-character handling>
ru: B<Обработка управляющих символов>

source: The VT102 also recognized the following control characters:
ru: Тип VT102 также распознает следующие управляющие символы:

source: NUL (0x00) was ignored;
ru: NUL (0x00) игнорируется;

source: ENQ (0x05) triggered an answerback message;
ru: ENQ (0x05) запускает обратное ответное сообщение;

source: DC1 (0x11, B<^Q>, XON) resumed transmission;
ru: DC1 (0x11, B<^Q>, XON) возобновляет передачу;

source: DC3 (0x13, B<^S>, XOFF) caused VT100 to ignore (and stop transmitting) all codes except XOFF and XON.
ru: DC3 (0x13, B<^S>, XOFF) заставляет VT100 игнорировать (и останавливать передачу) всех кодов за исключением XOFF и XON.

source: VT100-like DC1/DC3 processing may be enabled by the terminal driver.
ru: VT100-подобную обработку DC1/DC3 можно включить в драйвере терминала.

source: The B<xterm>(1) program (in VT100 mode) recognizes the control characters BEL, BS, HT, LF, VT, FF, CR, SO, SI, ESC.
ru: Программа B<xterm>(1) (в режиме VT100) распознает управляющие символы BEL, BS, HT, LF, VT, FF, CR, SO, SI, ESC.

source: B<Escape sequences>
ru: B<Экранирующие последовательности>

source: VT100 console sequences not implemented on the Linux console:
ru: Последовательности консоли VT100, не реализованные в консоли Linux:

source: Single shift 2. (Select G2 character set for the next
ru: Сдвиг на 2 (выбрать набор символов G2 только для следующего

source: character only.)
ru: символа)

source: Single shift 3. (Select G3 character set for the next
ru: Сдвиг на 3 (выбрать набор символов G3 только для следующего

source: Device control string (ended by ESC \e)
ru: Строка управления устройством (заканчивается ESC \e)

source: Start of string.
ru: Начало строки

source: Privacy message (ended by ESC \e)
ru: Частное сообщение (заканчивается ESC \e)

source: String terminator
ru: Символ завершения строки

source: Designate G2 character set
ru: Определить набор символов G2

source: Designate G3 character set
ru: Определить набор символов G3

source: The program B<xterm>(1) (in VT100 mode) recognizes ESC c, ESC # 8, ESC E<gt>, ESC =, ESC D, ESC E, ESC H, ESC M, ESC N, ESC O, ESC P ... ESC \e, ESC Z (it answers ESC [ ? 1 ; 2 c, "I am a VT100 with advanced video option") and ESC ^ ... ESC \e with the same meanings as indicated above. It accepts ESC (, ESC ), ESC *, ESC + followed by 0, A, B for the DEC special character and line drawing set, UK, and US-ASCII, respectively.
ru: Программа B<xterm>(1) (в режиме VT100) распознает ESC c, ESC # 8, ESC E<gt>, ESC =, ESC D, ESC E, ESC H, ESC M, ESC N, ESC O, ESC P ... ESC \e, ESC Z (отвечает ESC [ ? 1 ; 2 c, "Я VT100 с улучшенными видеопараметрами") и ESC ^ ... ESC \e с теми же значениями, какие указаны выше. Принимаются ESC (, ESC ), ESC *, ESC + за которыми 0, A, B для специального символа DEC и режима рисования линий, UK и US-ASCII, соответственно.

source: The user can configure B<xterm>(1) to respond to VT220-specific control sequences, and it will identify itself as a VT52, VT100, and up depending on the way it is configured and initialized.
ru: Пользователь может настроить B<xterm>(1) так, чтобы он отвечал на специальные управляющие последовательности VT220, и в этом случае он будет идентифицировать себя как VT52, VT100 и далее, в зависимости от способа настройки и инициализации.

source: It accepts ESC ] (OSC) for the setting of certain resources. In addition to the ECMA-48 string terminator (ST), B<xterm>(1) accepts a BEL to terminate an OSC string. These are a few of the OSC control sequences recognized by B<xterm>(1):
ru: Для настройки определённых ресурсов он принимает ESC ] (OSC). Помимо символа завершения строки (ST) из ECMA-48, B<xterm>(1) для завершения OSC-строки также принимает BEL. Есть несколько управляющих последовательностей OSC, распознаваемых B<xterm>(1):

source: Set icon name and window title to I<txt>.
ru: Установить имя значка и заголовок окна равным I<txt>

source: Set icon name to I<txt>.
ru: Установить имя значка равным I<txt>

source: Set window title to I<txt>.
ru: Установить заголовок окна равным I<txt>

source: Set ANSI color I<num> to I<txt>.
ru: Установить цвет ANSI I<num> равным I<txt>

source: Set dynamic text color to I<txt>.
ru: Установить цвет динамического текста равным I<txt>

source: Change log file to I<name> (normally disabled
ru: Изменить файл журнала на I<name> (обычно отключено

source: by a compile-time option)
ru: в параметрах компиляции)

source: Set font to I<fn>.
ru: Установить шрифт равным I<fn>.

source: It recognizes the following with slightly modified meaning (saving more state, behaving closer to VT100/VT220):
ru: Распознаются следующие параметры с несколько измененным значением (больше сохраняется состояние, поведение ближе к VT100/VT220):

source: Save cursor
ru: Сохранить курсор

source: Restore cursor
ru: Восстановить курсор

source: It also recognizes
ru: Также распознаются

source: Cursor to lower left corner of screen (if enabled by
ru: Курсор в нижний левый угол экрана (если разрешено

source: B<xterm>(1)'s B<hpLowerleftBugCompat> resource)
ru: ресурсом B<hpLowerleftBugCompat> в B<xterm>(1))

source: Memory lock (per HP terminals).
ru: Блокировать память (терминалы HP)

source: Locks memory above the cursor.
ru: Блокировать память выше курсора

source: Memory unlock (per HP terminals).
ru: Разблокировать память (терминалы HP)

source: Invoke the G2 character set.
ru: Вызов набора символов G2

source: Invoke the G3 character set.
ru: Вызов набора символов G3

source: Invoke the G3 character set as GR.
ru: Вызов набора символов G3 в качестве GR

source: Invoke the G2 character set as GR.
ru: Вызов набора символов G2 в качестве GR

source: Invoke the G1 character set as GR.
ru: Вызов набора символов G1 в качестве GR

source: It also recognizes ESC % and provides a more complete UTF-8 implementation than Linux console.
ru: Также распознается ESC % и предоставляется более полная реализация UTF-8 чем в консоли Linux.

source: B<CSI Sequences>
ru: B<Последовательности CSI>

source: Old versions of B<xterm>(1), for example, from X11R5, interpret the blink SGR as a bold SGR. Later versions which implemented ANSI colors, for example, XFree86 3.1.2A in 1995, improved this by allowing the blink attribute to be displayed as a color. Modern versions of xterm implement blink SGR as blinking text and still allow colored text as an alternate rendering of SGRs. Stock X11R6 versions did not recognize the color-setting SGRs until the X11R6.8 release, which incorporated XFree86 xterm. All ECMA-48 CSI sequences recognized by Linux are also recognized by I<xterm>, however B<xterm>(1) implements several ECMA-48 and DEC control sequences not recognized by Linux.
ru: Старые версии B<xterm>(1), например из X11R5, воспринимают мерцание SGR как жирность SGR. В более новых версиях, в которых реализованы цвета ANSI, например в XFree86 3.1.2A 1995 года, атрибут мерцания отображается цветом. В современных версиях xterm мерцание SGR реализовано в виде мерцающего текста, который можно также сделать цветным в качестве альтернативы отображения SGR. Исходные версии X11R6 не распознают настройки цвета SGR вплоть до версии X11R6.8, в которую был включён XFree86 xterm. Все последовательности CSI ECMA-48 CSI, понимаемые Linux, также понимает I<xterm>, однако в B<xterm>(1) реализовано несколько управляющих последовательностей ECMA-48 и DEC, которые не понимаются Linux.

source: The B<xterm>(1) program recognizes all of the DEC Private Mode sequences listed above, but none of the Linux private-mode sequences. For discussion of B<xterm>(1)'s own private-mode sequences, refer to the I<Xterm Control Sequences> document by Edward Moy, Stephen Gildea, and Thomas E.\& Dickey available with the X distribution. That document, though terse, is much longer than this manual page. For a chronological overview,
ru: Программа B<xterm>(1) распознаёт все последовательности спец-режимов DEC, описанных выше, но ни одной последовательности спец-режимов Linux. О собственных спец-режимах B<xterm>(1) можно прочитать в документе I<Управляющие последовательности Xterm>, написанном Edward Moy, Stephen Gildea и Thomas E.\& Dickey и доступном в дистрибутиве X. Этот документ хотя и сокращённый, но всё равно намного больше данной справочной страницы. Хронологический обзор в

source: details changes to xterm.
ru: описывает изменения в xterm.

source: The I<vttest> program
ru: Программа I<vttest>

source: demonstrates many of these control sequences. The B<xterm>(1) source distribution also contains sample scripts which exercise other features.
ru: демонстрирует многие из этих управляющих последовательностей. В исходном дистрибутиве B<xterm>(1) также содержатся примеры сценариев, которые учат работать с другими свойствами.

source: ESC 8 (DECRC) is not able to restore the character set changed with ESC %.
ru: Последовательность ESC 8 (DECRC) не может восстановить набор символов, изменённый с помощью ESC %.

source: BUGS
ru: ДЕФЕКТЫ

source: In 2.0.23, CSI is broken, and NUL is not ignored inside escape sequences.
ru: В версии 2.0.23 набор CSI является неправильным и недейственным, NUL не игнорируется внутри экранирующих последовательностей.

source: Some older kernel versions (after 2.0) interpret 8-bit control sequences. These "C1 controls" use codes between 128 and 159 to replace ESC [, ESC ] and similar two-byte control sequence initiators. There are fragments of that in modern kernels (either overlooked or broken by changes to support UTF-8), but the implementation is incomplete and should be regarded as unreliable.
ru: Некоторые старые версии ядер (после 2.0) анализируют 8-битные управляющие последовательности. В них ("управляющие коды C1") используются коды от 128 до 159 для замены ESC [, ESC ] и подобных начальных двухбайтовых управляющих последовательностей. Они частично существуют в современных ядрах (или не распознаются или не работают из-за поддержки UTF-8), и реализованы не полностью, и должны расцениваться как ненадежные.

source: Linux "private mode" sequences do not follow the rules in ECMA-48 for private mode control sequences. In particular, those ending with ] do not use a standard terminating character. The OSC (set palette) sequence is a greater problem, since B<xterm>(1) may interpret this as a control sequence which requires a string terminator (ST). Unlike the B<setterm>(1) sequences which will be ignored (since they are invalid control sequences), the palette sequence will make B<xterm>(1) appear to hang (though pressing the return-key will fix that). To accommodate applications which have been hardcoded to use Linux control sequences, set the B<xterm>(1) resource B<brokenLinuxOSC> to true.
ru: Последовательности "спец-режима" Linux не учитывают правила ECMA-48 для управляющих последовательностей спец-режима. В частности, они заканчиваются ] и не используют стандартный символ завершения. Последовательность OSC (установить палитру) \(em большая проблема, так как B<xterm>(1) рассматривает её как управляющую последовательность, которой требуется окончание строки (ST). В отличие от последовательностей B<setterm>(1), которые будут проигнорированы (так как они не являются правильными управляющими последовательностями), последовательность палитры приведёт к подвисанию B<xterm>(1) (хотя нажав клавишу return это исправится). Чтобы приспособить приложения, в которых жёстко заданы управляющие последовательности Linux, установите ресурс B<xterm>(1) B<brokenLinuxOSC> равным true.

source: An older version of this document implied that Linux recognizes the ECMA-48 control sequence for invisible text. It is ignored.
ru: В старой версии данного документа предполагалось, что Linux распознаёт управляющую последовательность ECMA-48 для невидимости текста. Она игнорируется.

source: cpuset - confine processes to processor and memory node subsets
ru: cpuset - наборы для ограничения процессов по процессору и памяти

source: The cpuset filesystem is a pseudo-filesystem interface to the kernel cpuset mechanism, which is used to control the processor placement and memory placement of processes. It is commonly mounted at I</dev/cpuset>.
ru: Файловая система процессорного набора (cpuset) — это псевдо-файловый интерфейс для механизма ядра процессорного набора, который используется для управления распределением процессов по процессорам и памяти. Обычно, он монтируется в I</dev/cpuset>.

source: On systems with kernels compiled with built in support for cpusets, all processes are attached to a cpuset, and cpusets are always present. If a system supports cpusets, then it will have the entry B<nodev cpuset> in the file I</proc/filesystems>. By mounting the cpuset filesystem (see the B<EXAMPLE> section below), the administrator can configure the cpusets on a system to control the processor and memory placement of processes on that system. By default, if the cpuset configuration on a system is not modified or if the cpuset filesystem is not even mounted, then the cpuset mechanism, though present, has no effect on the system's behavior.
ru: В системах, у которых ядра скомпилированы с поддержкой процессорного набора, все процессы прикрепляются к процессорному набору, и процессорные наборы всегда существуют. Если система поддерживает процессорные наборы, то в файле I</proc/filesystems> будет запись B<nodev cpuset>. Смонтировав файловую систему процессорного набора (смотрите раздел B<ПРИМЕР> далее), администратор может настроить процессорный набор в системе для управления размещением процессов по процессорам и памяти. По умолчанию, если настройки процессорного набора в системе не изменялись, и если файловая система процессорного набора даже не смонтирована, то механизм процессорного набора, хотя и имеется, но никак не влияет на работу системы.

source: A cpuset defines a list of CPUs and memory nodes.
ru: В процессорном наборе задаёт список ЦП и узлов памяти.

source: The CPUs of a system include all the logical processing units on which a process can execute, including, if present, multiple processor cores within a package and Hyper-Threads within a processor core. Memory nodes include all distinct banks of main memory; small and SMP systems typically have just one memory node that contains all the system's main memory, while NUMA (non-uniform memory access) systems have multiple memory nodes.
ru: К ЦП системы относятся все единицы обработки логики, на которых может выполняться процесс, включая, если есть, несколько ядер процессора в одном чипе и Hyper-Threads внутри ядра процессора. К узлам памяти относятся все отдельные банки основной памяти; в маленьких и SMP-системах, обычно, есть только один узел памяти, который содержит всю основную память системы, в то время как системы с NUMA (non-uniform memory access) имеют несколько узлов памяти.

source: Cpusets are represented as directories in a hierarchical pseudo-filesystem, where the top directory in the hierarchy (I</dev/cpuset>) represents the entire system (all online CPUs and memory nodes) and any cpuset that is the child (descendant) of another parent cpuset contains a subset of that parent's CPUs and memory nodes. The directories and files representing cpusets have normal filesystem permissions.
ru: Процессорные наборы представляются в иерархической псевдо-файловой системе в виде каталогов, где верхний каталог иерархии (I</dev/cpuset>) представляет систему полностью (все работающие ЦП и узлы памяти) и любой процессорный набор — это потомок другого родительского процессорного набора, содержащий поднабор родительских ЦП и узлов памяти. Каталоги и файлы представляют процессорные наборы с обычными правами доступа в файловой системе.

source: Every process in the system belongs to exactly one cpuset. A process is confined to run only on the CPUs in the cpuset it belongs to, and to allocate memory only on the memory nodes in that cpuset. When a process B<fork>(2)s, the child process is placed in the same cpuset as its parent. With sufficient privilege, a process may be moved from one cpuset to another and the allowed CPUs and memory nodes of an existing cpuset may be changed.
ru: Каждый процесс в системе принадлежит только одному процессорному набору. Процесс ограничен в работе только на ЦП из процессорного набора, которому он принадлежит и для него выделяется память только из узлов памяти этого процессорного набора. Когда процесс запускает B<fork>(2), дочерний процесс помещается в тот же процессорный набор что и родитель. Имея достаточно прав, процесс может переместиться из одного процессорного набора в другой и допустимые ЦП и узлы памяти существующего процессорного набора могут быть изменены.

source: When the system begins booting, a single cpuset is defined that includes all CPUs and memory nodes on the system, and all processes are in that cpuset. During the boot process, or later during normal system operation, other cpusets may be created, as subdirectories of this top cpuset, under the control of the system administrator, and processes may be placed in these other cpusets.
ru: Когда система начинает загружаться, определён один процессорный набор, который содержит все ЦП и узлы памяти системы, и все процессы находятся в этом процессорном наборе. При загрузке или позднее, при выполнении обычных действий, администратор может создать другие процессорные наборы как подкаталоги этого верхнего процессорного набора, и процессы могут помещаться в эти новые процессорные наборы.
