Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Cpusets are integrated with the B<sched_setaffinity>(2) scheduling affinity mechanism and the B<mbind>(2) and B<set_mempolicy>(2) memory-placement mechanisms in the kernel. Neither of these mechanisms let a process make use of a CPU or memory node that is not allowed by that process's cpuset. If changes to a process's cpuset placement conflict with these other mechanisms, then cpuset placement is enforced even if it means overriding these other mechanisms. The kernel accomplishes this overriding by silently restricting the CPUs and memory nodes requested by these other mechanisms to those allowed by the invoking process's cpuset. This can result in these other calls returning an error, if for example, such a call ends up requesting an empty set of CPUs or memory nodes, after that request is restricted to the invoking process's cpuset.
ru: Процессорные наборы объединены с механизмом увязывания в планировании (scheduling affinity) B<sched_setaffinity>(2) и механизмами размещения памяти B<mbind>(2) и B<set_mempolicy>(2) в ядре. Ни один из этих механизмов не позволяет процессу использовать ЦП или узел памяти не разрешённый в процессорном наборе процесса. Если изменение размещения процессорного набора процесса конфликтует с этими механизмами, то учитывается размещение процессорного набора, даже если это означает замену значений других механизмов. Ядро замещает запрашиваемые ЦП и узлы памяти без уведомления других механизмов на разрешённые из процессорного набора вызвавшего процесса. Это может привести к ошибке при других вызовах, если, например, такой вызов заканчивается запросом пустого набора ЦП или узлов памяти, после чего запрос ограничивается процессорным набором вызывавшего процесса.

source: Typically, a cpuset is used to manage the CPU and memory-node confinement for a set of cooperating processes such as a batch scheduler job, and these other mechanisms are used to manage the placement of individual processes or memory regions within that set or job.
ru: Обычно, процессорный набор используется для управления размещением ЦП и узлов памяти для набора взаимодействующих процессов, а также планировщика фоновых заданий, а другие механизмы используются для управления размещением отдельных процессов или областей памяти внутри этого набора или задания.

source: Each directory below I</dev/cpuset> represents a cpuset and contains a fixed set of pseudo-files describing the state of that cpuset.
ru: Каждый каталог в I</dev/cpuset> представляет процессорный набор и содержит одинаковый набор псевдо-файлов, описывающий состояние этого процессорного набора.

source: New cpusets are created using the B<mkdir>(2) system call or the B<mkdir>(1) command. The properties of a cpuset, such as its flags, allowed CPUs and memory nodes, and attached processes, are queried and modified by reading or writing to the appropriate file in that cpuset's directory, as listed below.
ru: Новые процессорные наборы создаются с помощью системного вызова B<mkdir>(2) или команды B<mkdir>(1). Свойства процессорного набора, такие как: флаги, разрешённые ЦП и узлы памяти, прикреплённые процессы, возвращаются и изменяются посредством чтения или записи соответствующего файла в каталоге этого процессорного набора как описано далее.

source: The pseudo-files in each cpuset directory are automatically created when the cpuset is created, as a result of the B<mkdir>(2) invocation. It is not possible to directly add or remove these pseudo-files.
ru: Псевдо-файлы каждого каталога процессорного набора автоматически создаются при создании процессорного набора, то есть в результате вызова B<mkdir>(2). Нельзя напрямую добавлять или удалять эти псевдо-файлы.

source: A cpuset directory that contains no child cpuset directories, and has no attached processes, can be removed using B<rmdir>(2) or B<rmdir>(1). It is not necessary, or possible, to remove the pseudo-files inside the directory before removing it.
ru: Каталог процессорного набора, в котором нет каталогов дочерних процессорных наборов, и нет прикреплённых процессов, может быть удалён с помощью B<rmdir>(2) или B<rmdir>(1). Необязательно и невозможно удалять псевдо-файлы внутри каталога перед удалением.

source: The pseudo-files in each cpuset directory are small text files that may be read and written using traditional shell utilities such as B<cat>(1), and B<echo>(1), or from a program by using file I/O library functions or system calls, such as B<open>(2), B<read>(2), B<write>(2), and B<close>(2).
ru: Псевдо-файлы в каждом каталоге процессорного набора представляют собой маленькие текстовые файлы, которые можно читать и писать с помощью обычных утилит оболочки, таких как B<cat>(1) и B<echo>(1), или из программы с помощью файловых библиотечных функций ввода-вывода или системных вызовов, таких как B<open>(2), B<read>(2), B<write>(2) и B<close>(2).

source: The pseudo-files in a cpuset directory represent internal kernel state and do not have any persistent image on disk. Each of these per-cpuset files is listed and described below.
ru: Псевдо-файлы в каталоге процессорного набора описывают внутреннее состояние ядра и не хранятся на диске. Все файлы описаны ниже.

source: List of the process IDs (PIDs) of the processes in that cpuset. The list is formatted as a series of ASCII decimal numbers, each followed by a newline. A process may be added to a cpuset (automatically removing it from the cpuset that previously contained it) by writing its PID to that cpuset's I<tasks> file (with or without a trailing newline).
ru: Список ID (PID) процессов в этом процессорном наборе Список представляет собой серию десятичных цифр ASCII, разделённых символом новой строки. Процесс может быть добавлен в процессорный набор (автоматически удаляясь из предыдущего процессорного набора, в котором он находился) посредством записи его PID в файл I<tasks> этого процессорного набора (с или без завершающего символа новой строки).

source: B<Warning:> only one PID may be written to the I<tasks> file at a time. If a string is written that contains more than one PID, only the first one will be used.
ru: B<Предупреждение:> за один раз в файл I<tasks> может быть записан только один PID. Если записывается строка с несколькими PID, то будет использован только первый.

source: Flag (0 or 1). If set (1), that cpuset will receive special handling after it is released, that is, after all processes cease using it (i.e., terminate or are moved to a different cpuset) and all child cpuset directories have been removed. See the B<Notify On Release> section, below.
ru: Флаг (0 или 1). Если установлен (1), то для процессорного набора будут выполняться дополнительные действия после его освобождения, то есть после того, как все процессы перестанут его использовать (завершатся или перейдут в другой процессорный набор), и все каталоги дочерних процессорных наборов будут удалены. Смотрите раздел B<Уведомление об освобождении> далее.

source: List of the physical numbers of the CPUs on which processes in that cpuset are allowed to execute. See B<List Format> below for a description of the format of I<cpus>.
ru: Список номеров физических ЦП, на которых процессам разрешено выполняться в этом процессорном наборе. О формате I<cpus> смотрите описание в B<Формат списка> далее.

source: The CPUs allowed to a cpuset may be changed by writing a new list to its I<cpus> file.
ru: Разрешённые ЦП в процессорном наборе можно изменить записав новый список в его файл I<cpus>.

source: Flag (0 or 1). If set (1), the cpuset has exclusive use of its CPUs (no sibling or cousin cpuset may overlap CPUs). By default, this is off (0). Newly created cpusets also initially default this to off (0).
ru: Флаг (0 или 1). Если установлен (1), то процессорный набор монопольно использует свои ЦП (одноуровневые (sibling) или родственные (cousin) процессорные наборы не могут иметь одинаковые ЦП). По умолчанию сброшен (0). У создаваемых процессорных наборов этот флаг также по умолчанию сброшен (0).

source: Two cpusets are I<sibling> cpusets if they share the same parent cpuset in the I</dev/cpuset> hierarchy. Two cpusets are I<cousin> cpusets if neither is the ancestor of the other. Regardless of the I<cpu_exclusive> setting, if one cpuset is the ancestor of another, and if both of these cpusets have nonempty I<cpus>, then their I<cpus> must overlap, because the I<cpus> of any cpuset are always a subset of the I<cpus> of its parent cpuset.
ru: Два процессорных набора являются I<одноуровневыми>, если они имеют общий родительский процессорный набор в иерархии I</dev/cpuset>. Два процессорных набора являются I<родственными>, если не один не является предком другого. Независимо от значения I<cpu_exclusive>, если один процессорный набор — предок другого, и если оба этих процессорных набора имеют непустые I<cpus>, то их I<cpus> должны перекрываться, так как I<cpus> любого процессорного набора всегда являются поднабором I<cpus> своего родительского процессорного набора.

source: List of memory nodes on which processes in this cpuset are allowed to allocate memory. See B<List Format> below for a description of the format of I<mems>.
ru: Список узлов памяти, на которых процессам разрешено выделять память в этом процессорном наборе. О формате I<mems> смотрите описание в B<Формат списка> далее.

source: Flag (0 or 1). If set (1), the cpuset has exclusive use of its memory nodes (no sibling or cousin may overlap). Also if set (1), the cpuset is a B<Hardwall> cpuset (see below). By default, this is off (0). Newly created cpusets also initially default this to off (0).
ru: Флаг (0 или 1) Если установлен (1), то процессорный набор монопольно использует свои узлы памяти (одноуровневые или родственные процессорные наборы не могут иметь одинаковые узлы). Также, если флаг установлен (1), то процессорный набор — B<Hardwall> (смотрите далее). По умолчанию флаг сброшен (0). У создаваемых процессорных наборов флаг также по умолчанию сброшен (0).

source: Regardless of the I<mem_exclusive> setting, if one cpuset is the ancestor of another, then their memory nodes must overlap, because the memory nodes of any cpuset are always a subset of the memory nodes of that cpuset's parent cpuset.
ru: Независимо от значения I<mem_exclusive>, если один процессорный набор — предок другого, то их узлы памяти перекрываются, так как узлы памяти любого процессорного набора всегда входят в поднабор узлов памяти своего родительского процессорного набора.

source: I<cpuset.mem_hardwall> (since Linux 2.6.26)
ru: I<cpuset.mem_hardwall> (начиная с Linux 2.6.26)

source: Flag (0 or 1). If set (1), the cpuset is a B<Hardwall> cpuset (see below). Unlike B<mem_exclusive>, there is no constraint on whether cpusets marked B<mem_hardwall> may have overlapping memory nodes with sibling or cousin cpusets. By default, this is off (0). Newly created cpusets also initially default this to off (0).
ru: Флаг (0 или 1) Если установлен (1), то процессорный набор — B<Hardwall> (смотрите далее). В отличии от B<mem_exclusive>, процессорные наборы с установленным B<mem_hardwall> (одноуровневые или родственные) не имеют ограничения по перекрытию по узлам памяти. По умолчанию флаг сброшен (0). У создаваемых процессорных наборов флаг также по умолчанию сброшен (0).

source: I<cpuset.memory_migrate> (since Linux 2.6.16)
ru: I<cpuset.memory_migrate> (начиная с Linux 2.6.16)

source: Flag (0 or 1). If set (1), then memory migration is enabled. By default, this is off (0). See the B<Memory Migration> section, below.
ru: Флаг (0 или 1). Если установлен (1), то разрешён перенос (migration) памяти. По умолчанию сброшен (0). Смотрите раздел B<Перенос памяти> далее.

source: I<cpuset.memory_pressure> (since Linux 2.6.16)
ru: I<cpuset.memory_pressure> (начиная с Linux 2.6.16)

source: A measure of how much memory pressure the processes in this cpuset are causing. See the B<Memory Pressure> section, below. Unless I<memory_pressure_enabled> is enabled, always has value zero (0). This file is read-only. See the B<WARNINGS> section, below.
ru: Величина нагрузки памяти, которую вызывают процессы в этом процессорном наборе. Смотрите раздел B<Нагрузка памяти> далее. Если флаг I<memory_pressure_enabled> не установлен, то значение всегда равно нулю (0). Этот файл доступен только для чтения. Смотрите раздел B<ПРЕДУПРЕЖДЕНИЯ> далее.

source: I<cpuset.memory_pressure_enabled> (since Linux 2.6.16)
ru: I<cpuset.memory_pressure_enabled> (начиная с Linux 2.6.16)

source: Flag (0 or 1). This file is present only in the root cpuset, normally I</dev/cpuset>. If set (1), the I<memory_pressure> calculations are enabled for all cpusets in the system. By default, this is off (0). See the B<Memory Pressure> section, below.
ru: Флаг (0 или 1). Данный файл есть только в корневом процессорном наборе, обычно I</dev/cpuset>. Если установлен (1), то включается вычисление I<memory_pressure> для всех процессорных наборов в системе. По умолчанию выключен (0). Смотрите раздел B<Нагрузка памяти> далее.

source: I<cpuset.memory_spread_page> (since Linux 2.6.17)
ru: I<cpuset.memory_spread_page> (начиная с Linux 2.6.17)

source: Flag (0 or 1). If set (1), pages in the kernel page cache (filesystem buffers) are uniformly spread across the cpuset. By default, this is off (0) in the top cpuset, and inherited from the parent cpuset in newly created cpusets. See the B<Memory Spread> section, below.
ru: Флаг (0 или 1). Если установлен (1), то страницы в страничном кэше ядра (буферы файловой системы) будут равномерно распределены по всему процессорному набору. По умолчанию сброшен (0) в корневом процессорном наборе, и наследуется от родительского процессорного набора для новых процессорных наборов. Смотрите раздел B<Распространение в памяти> далее.

source: I<cpuset.memory_spread_slab> (since Linux 2.6.17)
ru: I<cpuset.memory_spread_slab> (начиная с Linux 2.6.17)

source: Flag (0 or 1). If set (1), the kernel slab caches for file I/O (directory and inode structures) are uniformly spread across the cpuset. By defaultBy default, is off (0) in the top cpuset, and inherited from the parent cpuset in newly created cpusets. See the B<Memory Spread> section, below.
ru: Флаг (0 или 1). Если установлен (1), то кэши slab ядра для файлового ввода-вывода (структуры каталогов и inode) будут равномерно распределены по всему процессорному набору. По умолчанию сброшен (0) в корневом процессорном наборе, и наследуется от родительского процессорного набора для новых процессорных наборов. Смотрите раздел B<Распространение в памяти> далее.

source: I<cpuset.sched_load_balance> (since Linux 2.6.24)
ru: I<cpuset.sched_load_balance> (начиная с Linux 2.6.24)

source: Flag (0 or 1). If set (1, the default) the kernel will automatically load balance processes in that cpuset over the allowed CPUs in that cpuset. If cleared (0) the kernel will avoid load balancing processes in this cpuset, I<unless> some other cpuset with overlapping CPUs has its I<sched_load_balance> flag set. See B<Scheduler Load Balancing>, below, for further details.
ru: Флаг (0 или 1). Если установлен (1), то ядро будет автоматически балансировать нагрузку процессов процессорного набора по всем разрешённым в процессорном наборе ЦП. Если сброшен (0), то ядро не будет выполнять балансировку в этом процессорном наборе, I<если нет> какого-то другого процессорного набора с перекрывающимися ЦП и установленным флагом I<sched_load_balance>. Подробней смотрите B<Балансировка нагрузки планировщиком> далее.

source: I<cpuset.sched_relax_domain_level> (since Linux 2.6.26)
ru: I<cpuset.sched_relax_domain_level> (начиная с Linux 2.6.26)

source: Integer, between -1 and a small positive value. The I<sched_relax_domain_level> controls the width of the range of CPUs over which the kernel scheduler performs immediate rebalancing of runnable tasks across CPUs. If I<sched_load_balance> is disabled, then the setting of I<sched_relax_domain_level> does not matter, as no such load balancing is done. If I<sched_load_balance> is enabled, then the higher the value of the I<sched_relax_domain_level>, the wider the range of CPUs over which immediate load balancing is attempted. See B<Scheduler Relax Domain Level>, below, for further details.
ru: Целое число от -1 до небольшого положительного значения (small positive value). Величина I<sched_relax_domain_level> управляет шириной диапазона ЦП в котором планировщик ядра непосредственно выполняет балансировку работающих задач на ЦП. Если I<sched_load_balance> выключен, то значение I<sched_relax_domain_level> не учитывается, так как балансировка не выполняется. Если I<sched_load_balance> включён, то чем больше величина I<sched_relax_domain_level>, тем шире диапазон ЦП, на которых пытается выполняться балансировка. Подробней смотрите в B<Степень ослабления домена планировщиком> далее.

source: In addition to the above pseudo-files in each directory below I</dev/cpuset>, each process has a pseudo-file, I</proc/E<lt>pidE<gt>/cpuset>, that displays the path of the process's cpuset directory relative to the root of the cpuset filesystem.
ru: Кроме показанных выше псевдо-файлов, в каждом каталоге в I</dev/cpuset> для каждого процесса есть псевдо-файл I</proc/E<lt>pidE<gt>/cpuset>, в котором содержится путь к каталогу процессорного набора процесса относительно корня файловой системы процессорного набора.

source: Also the I</proc/E<lt>pidE<gt>/status> file for each process has four added lines, displaying the process's I<Cpus_allowed> (on which CPUs it may be scheduled) and I<Mems_allowed> (on which memory nodes it may obtain memory), in the two formats B<Mask Format> and B<List Format> (see below) as shown in the following example:
ru: Также в файл I</proc/E<lt>pidE<gt>/status> для каждого процесса добавлены четыре строки, отражающие I<Cpus_allowed> (на каких ЦП может планироваться выполнение) и I<Mems_allowed> (на каких узлах памяти может получать память) процесса в двух форматах: B<в виде маски> и B<в виде списка> (смотрите далее). Пример:

source: The "allowed" fields were added in Linux 2.6.24; the "allowed_list" fields were added in Linux 2.6.26.
ru: Поля «allowed» были добавлены в Linux 2.6.24; поля «allowed_list» были добавлены в Linux 2.6.26.

source: EXTENDED CAPABILITIES
ru: ДОПОЛНИТЕЛЬНЫЕ ВОЗМОЖНОСТИ

source: In addition to controlling which I<cpus> and I<mems> a process is allowed to use, cpusets provide the following extended capabilities.
ru: Кроме контроля I<cpus> и I<mems> для процесса, процессорные наборы предоставляют следующие дополнительные возможности.

source: Exclusive cpusets
ru: Монополизирующие процессорные наборы

source: If a cpuset is marked I<cpu_exclusive> or I<mem_exclusive>, no other cpuset, other than a direct ancestor or descendant, may share any of the same CPUs or memory nodes.
ru: Если процессорный набор помечен как I<cpu_exclusive> или I<mem_exclusive>, то ни один другой процессорный набор, отличный от прямого предка или потомка, не может совместно использовать те же ЦП или узлы памяти.

source: A cpuset that is I<mem_exclusive> restricts kernel allocations for buffer cache pages and other internal kernel data pages commonly shared by the kernel across multiple users. All cpusets, whether I<mem_exclusive> or not, restrict allocations of memory for user space. This enables configuring a system so that several independent jobs can share common kernel data, while isolating each job's user allocation in its own cpuset. To do this, construct a large I<mem_exclusive> cpuset to hold all the jobs, and construct child, non-I<mem_exclusive> cpusets for each individual job. Only a small amount of kernel memory, such as requests from interrupt handlers, is allowed to be placed on memory nodes outside even a I<mem_exclusive> cpuset.
ru: Процессорный набор с установленным I<mem_exclusive> ограничивает ядро при выделении страниц буферного кэша и других внутренних структур данных ядра, обычно совместно используемые ядром среди нескольких пользователей. Все процессорные наборы, с I<mem_exclusive> или без, ограничивают выделение памяти для пользовательского адресного пространства. Это позволяет настроить систему так, что несколько независимых заданий могут совместно использовать общие данные ядра, изолируя каждое пользовательское выделение задания в его процессорном наборе. Для этого создаётся большой процессорный набор I<mem_exclusive> для хранения всех заданий и его потомок без I<mem_exclusive>, отдельный для каждого задания. Только маленькое количество памяти ядра, например для запросов от обработчиков прерываний, разрешено размещать вне узлов памяти даже в процессорном наборе с I<mem_exclusive>.

source: A cpuset that has I<mem_exclusive> or I<mem_hardwall> set is a I<hardwall> cpuset. A I<hardwall> cpuset restricts kernel allocations for page, buffer, and other data commonly shared by the kernel across multiple users. All cpusets, whether I<hardwall> or not, restrict allocations of memory for user space.
ru: Процессорный набор, у которого установлен флаг I<mem_exclusive> или I<mem_hardwall> считается I<hardwall>. Процессорный набор I<hardwall> ограничивает выделение памяти ядром под страницы, буфер и другие данные, часто используемые ядром для нескольких пользователей. Все процессорные наборы, I<hardwall> или нет, ограничивают выделение памяти для пространства пользователя.

source: This enables configuring a system so that several independent jobs can share common kernel data, such as filesystem pages, while isolating each job's user allocation in its own cpuset. To do this, construct a large I<hardwall> cpuset to hold all the jobs, and construct child cpusets for each individual job which are not I<hardwall> cpusets.
ru: Это позволяет настроить систему так, что несколько независимых заданий могут совместно использовать общие данные ядра, например для страниц файловой системы, изолируя каждое пользовательское выделение задания в его процессорном наборе. Для этого создаётся большой процессорный набор I<hardwall> для хранения всех заданий и его потомок не I<hardwall>, отдельный для каждого задания.

source: Only a small amount of kernel memory, such as requests from interrupt handlers, is allowed to be taken outside even a I<hardwall> cpuset.
ru: Только маленькое количество памяти ядра, например для запросов от обработчиков прерываний, разрешено размещать вне узлов памяти даже в процессорном наборе I<hardwall>.

source: Notify on release
ru: Уведомление об освобождении

source: If the I<notify_on_release> flag is enabled (1) in a cpuset, then whenever the last process in the cpuset leaves (exits or attaches to some other cpuset) and the last child cpuset of that cpuset is removed, the kernel will run the command I</sbin/cpuset_release_agent>, supplying the pathname (relative to the mount point of the cpuset filesystem) of the abandoned cpuset. This enables automatic removal of abandoned cpusets.
ru: Если в процессорном наборе установлен флаг I<notify_on_release> (1), то когда последний процесс в процессорном наборе выходит (завершается или прикрепляется к другому процессорному набору) и последний потомок этого процессорного набора удаляется, то ядро выполняет команду I</sbin/cpuset_release_agent>, передавая ей путь (относительно точки монтирования файловой системы процессорного набора) ликвидируемого процессорного набора. Это включает автоматическое удаление ликвидируемых процессорных наборов.

source: The default value of I<notify_on_release> in the root cpuset at system boot is disabled (0). The default value of other cpusets at creation is the current value of their parent's I<notify_on_release> setting.
ru: Значение по умолчанию I<notify_on_release> в корневом процессорном наборе при запуске системы сброшено (0). Значение по умолчанию в других процессорных наборах при создании равно текущему значению I<notify_on_release> их предка.
