Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: If you have determined that it really is necessary to create a new capability for your feature, don't make or name it as a "single-use" capability. Thus, for example, the addition of the highly specific B<CAP_SYS_PACCT> was probably a mistake. Instead, try to identify and name your new capability as a broader silo into which other related future use cases might fit.
ru: Если действительно необходимо создать новый мандат для новой возможности, не делайте или называйте его как «только для этой возможности». То есть, например, добавление очень специализированного B<CAP_SYS_PACCT> было бы, вероятно, ошибкой. Вместо этого попытайтесь идентифицировать и назвать новый мандат более вместительным понятием, в которое могут войти и другие будущие возможности.

source: Thread capability sets
ru: Наборы мандатов нити

source: Each thread has the following capability sets containing zero or more of the above capabilities:
ru: Каждая нить имеет следующие наборы мандатов, содержащие ноль или более перечисленных выше мандатов:

source: This is a limiting superset for the effective capabilities that the thread may assume. It is also a limiting superset for the capabilities that may be added to the inheritable set by a thread that does not have the B<CAP_SETPCAP> capability in its effective set.
ru: Ограничивающий набор эффективных мандатов, которыми наделяется нить. Этот набор также ограничивает список мандатов, которые могут быть добавлены в наследуемый набор для нити, которая не имеет мандата B<CAP_SETPCAP> в своём эффективном наборе.

source: If a thread drops a capability from its permitted set, it can never reacquire that capability (unless it B<execve>(2)s either a set-user-ID-root program, or a program whose associated file capabilities grant that capability).
ru: Если нить сбрасывает мандат в своём разрешительном наборе, то она не сможет получить его назад (если только не выполняется B<execve>(2) для программы с set-user-ID-root или программа, чьи соответствующие мандаты файла предоставляют этот мандат).

source: This is a set of capabilities preserved across an B<execve>(2). Inheritable capabilities remain inheritable when executing any program, and inheritable capabilities are added to the permitted set when executing a program that has the corresponding bits set in the file inheritable set.
ru: Этот набор мандатов сохраняется при вызове B<execve>(2). Наследуемые мандаты остаются наследуемыми при выполнении любой программы, и наследуемые мандаты добавляются в разрешительный набор, если выполняющаяся программа имеет соответствующие установленные биты в файловом наследуемом наборе.

source: Because inheritable capabilities are not generally preserved across B<execve>(2) when running as a non-root user, applications that wish to run helper programs with elevated capabilities should consider using ambient capabilities, described below.
ru: Так как наследуемые мандаты, обычно, не сохраняются после B<execve>(2), если выполнение происходит не от суперпользователя, то для приложений, которым нужно выполнять вспомогательные программы с повышенными мандатами, нужно использовать наружные мандаты (ambient capabilities), описанные ниже.

source: This is the set of capabilities used by the kernel to perform permission checks for the thread.
ru: Данный набор мандатов используется ядром при выполнении проверок прав нити.

source: I<Bounding> (per-thread since Linux 2.6.25)
ru: I<Bounding> (в каждой нити начиная с Linux 2.6.25)

source: The capability bounding set is a mechanism that can be used to limit the capabilities that are gained during B<execve>(2).
ru: Ограничивающий набор мандатов — это механизм, который можно использовать для ограничения мандатов, которые могут быть получены при B<execve>(2).

source: Since Linux 2.6.25, this is a per-thread capability set. In older kernels, the capability bounding set was a system wide attribute shared by all threads on the system.
ru: Начиная с Linux 2.6.25 данный набор мандатов есть у каждой нити. В старых ядрах ограничивающий набор мандатов был системным свойством, единым для всех нитей в системе.

source: For more details on the capability bounding set, see below.
ru: Дополнительную информацию об ограничивающем наборе мандатов смотрите далее.

source: I<Ambient> (since Linux 4.3)
ru: I<Ambient> (начиная с Linux 4.3)

source: This is a set of capabilities that are preserved across an B<execve>(2) of a program that is not privileged. The ambient capability set obeys the invariant that no capability can ever be ambient if it is not both permitted and inheritable.
ru: Данный набор мандатов сохраняется после B<execve>(2) для непривилегированных программ. Для набора наружных мандатов (ambient capability set) соблюдается правило, что ни один мандат не сможет быть наружным, если он одновременно разрешающий и наследуемый.

source: The ambient capability set can be directly modified using B<prctl>(2). Ambient capabilities are automatically lowered if either of the corresponding permitted or inheritable capabilities is lowered.
ru: Набор наружных мандатов можно непосредственно изменять с помощью B<prctl>(2). Наружные мандаты автоматически понижаются, если понижаются соответствующие разрешительные или наследуемые мандаты.

source: Executing a program that changes UID or GID due to the set-user-ID or set-group-ID bits or executing a program that has any file capabilities set will clear the ambient set. Ambient capabilities are added to the permitted set and assigned to the effective set when B<execve>(2) is called. If ambient capabilities cause a process's permitted and effective capabilities to increase during an B<execve>(2), this does not trigger the secure-execution mode described in B<ld.so>(8).
ru: При запуске программы, у которой изменяются UID или GID из-за set-user-ID или set-group-ID, или у которой установлен любой набор файловых мандатов, наружный набор будет очищен. Наружные мандаты добавляются в разрешающий набори назначаются в эффективный набор при вызове B<execve>(2). Если из-за наружных мандатов увеличиваются разрешающий и эффективный наборы при B<execve>(2), то это не вызывает режима безопасного выполнения, описанного в B<ld.so>(8).

source: A child created via B<fork>(2) inherits copies of its parent's capability sets. See below for a discussion of the treatment of capabilities during B<execve>(2).
ru: Потомок, созданный B<fork>(2), наследует копии наборов мандатов своего родителя. Далее смотрите описание отношения к мандатами при B<execve>(2).

source: Using B<capset>(2), a thread may manipulate its own capability sets (see below).
ru: С помощью B<capset>(2) нить может изменять свои наборы мандатов (смотрите далее).

source: Since Linux 3.2, the file I</proc/sys/kernel/cap_last_cap> exposes the numerical value of the highest capability supported by the running kernel; this can be used to determine the highest bit that may be set in a capability set.
ru: Начиная с Linux 3.2, файл I</proc/sys/kernel/cap_last_cap> содержит числовое значение самого большого мандата, поддерживаемого работающим ядром; это может быть использовано для определения наибольшего бита, который может быть установлен в наборе мандатов.

source: File capabilities
ru: Файловые мандаты

source: Since kernel 2.6.24, the kernel supports associating capability sets with an executable file using B<setcap>(8). The file capability sets are stored in an extended attribute (see B<setxattr>(2) and B<xattr>(7)) named I<security.capability>. Writing to this extended attribute requires the B<CAP_SETFCAP> capability. The file capability sets, in conjunction with the capability sets of the thread, determine the capabilities of a thread after an B<execve>(2).
ru: Начиная с ядра версии 2.6.24, с помощью B<setcap>(8) поддерживается связь наборов мандатов с исполняемым файлом. Наборы мандатов файла хранятся в расширенном атрибуте (смотрите B<setxattr>(2) и B<xattr>(7)) с именем I<security.capability>. Для записи в этот расширенный атрибут требуется мандат B<CAP_SETFCAP>. Наборы файловых мандатов вместе с наборами мандатов нити определяют наборы мандатов нити после выполнения B<execve>(2).

source: The three file capability sets are:
ru: Три файловых набора мандатов:

source: I<Permitted> (formerly known as I<forced>):
ru: I<Permitted> (ранее называвшийся I<forced>):

source: These capabilities are automatically permitted to the thread, regardless of the thread's inheritable capabilities.
ru: Эти мандаты автоматически разрешаются нити независимо от унаследованных мандатов нити.

source: I<Inheritable> (formerly known as I<allowed>):
ru: I<Inheritable> (ранее называвшийся I<allowed>):

source: This set is ANDed with the thread's inheritable set to determine which inheritable capabilities are enabled in the permitted set of the thread after the B<execve>(2).
ru: Этот набор объединяется (AND) с унаследованным набором нити для определения, какие унаследованные мандаты будут включены в разрешительный набор нити после B<execve>(2).

source: This is not a set, but rather just a single bit. If this bit is set, then during an B<execve>(2) all of the new permitted capabilities for the thread are also raised in the effective set. If this bit is not set, then after an B<execve>(2), none of the new permitted capabilities is in the new effective set.
ru: В действительности, это не набор, а одиночный бит. Если бит включён, то при вызове B<execve>(2) все новые разрешённые мандаты нити будут также добавлены в эффективный набор. Если бит выключен, то после B<execve>(2) ни один из новых разрешённых мандатов не будет добавлен в новый эффективный набор.

source: Enabling the file effective capability bit implies that any file permitted or inheritable capability that causes a thread to acquire the corresponding permitted capability during an B<execve>(2) (see the transformation rules described below) will also acquire that capability in its effective set. Therefore, when assigning capabilities to a file (B<setcap>(8), B<cap_set_file>(3), B<cap_set_fd>(3)), if we specify the effective flag as being enabled for any capability, then the effective flag must also be specified as enabled for all other capabilities for which the corresponding permitted or inheritable flags is enabled.
ru: Включение эффективного файлового мандатного бита подразумевает, что любой файловый разрешительный или наследуемый мандат, который позволяет нити получить соответствующий разрешительный мандат при B<execve>(2) (смотрите правила преобразования, описанные далее), также получит этот мандат в эффективном наборе. Поэтому, когда назначаются мандаты файлу (B<setcap>(8), B<cap_set_file>(3), B<cap_set_fd>(3)), если мы укажем эффективный флаг как включённый для любого мандата, то эффективный флаг должен также быть указан включённым для всех остальных мандатов, для которых включён соответствующий разрешительный или наследуемый флаги.

source: File capability extended attribute versioning
ru: Версии расширенного атрибута файловых мандатов

source: To allow extensibility, the kernel supports a scheme to encode a version number inside the I<security.capability> extended attribute that is used to implement file capabilities. These version numbers are internal to the implementation, and not directly visible to user-space applications. To date, the following versions are supported:
ru: С целью расширяемости ядро поддерживает схему кодирования номера версии внутри расширенного атрибута I<security.capability>, который используется в реализации файловых мандатов. Эти номера версий введены только для реализации и непосредственно не видны приложениям пользовательского пространства. В настоящее время поддерживаются следующие версии:

source: This was the original file capability implementation, which supported 32-bit masks for file capabilities.
ru: Первоначальная реализация файловых мандатов, поддерживает 32-битные маски файловых мандатов.

source: B<VFS_CAP_REVISION_2> (since Linux 2.6.25)
ru: B<VFS_CAP_REVISION_2> (начиная с Linux 2.6.25)

source: This version allows for file capability masks that are 64 bits in size, and was necessary as the number of supported capabilities grew beyond 32. The kernel transparently continues to support the execution of files that have 32-bit version 1 capability masks, but when adding capabilities to files that did not previously have capabilities, or modifying the capabilities of existing files, it automatically uses the version 2 scheme (or possibly the version 3 scheme, as described below).
ru: В данной версии поддерживаются 64-битные маски файловых мандатов, и и новый номер версии стал необходим для поддержки мандатов более 32. Ядро продолжает прозрачно поддерживать выполнение файлов с 32-битными масками мандатов 1-й версии, но при добавлении мандатов к файлам, у которых их ещё не было, или при изменение мандатов существующих файлов, оно автоматически использует схему 2-й версии (или, возможно, схему 3-ей версии как описано далее).

source: B<VFS_CAP_REVISION_3> (since Linux 4.14)
ru: B<VFS_CAP_REVISION_3> (начиная с Linux 4.14)

source: Version 3 file capabilities are provided to support namespaced file capabilities (described below).
ru: Версия 3 файловые мандатов предоставляет поддержку файловых мандатов пространства имён (описано далее).

source: As with version 2 file capabilities, version 3 capability masks are 64 bits in size. But in addition, the root user ID of namespace is encoded in the I<security.capability> extended attribute. (A namespace's root user ID is the value that user ID 0 inside that namespace maps to in the initial user namespace.)
ru: Как и в версии 2, версия 3 имеет 64-битную маску файловых мандатов. Но в дополнении, в расширенном атрибуте I<security.capability> кодируется ID суперпользователя пространства имён (ID суперпользователя пространства имён — это значение, на которое отображается пользовательский ID 0 этого пространства имён в изначальном пользовательском пространстве имён).

source: Version 3 file capabilities are designed to coexist with version 2 capabilities; that is, on a modern Linux system, there may be some files with version 2 capabilities while others have version 3 capabilities.
ru: Файловые мандаты версии 3 могут сосуществовать с мандатами версии 2; то есть в современной системе Linux одни файлы могут быть с мандатами версии 2, а другие с версией 3.

source: Before Linux 4.14, the only kind of file capability extended attribute that could be attached to a file was a B<VFS_CAP_REVISION_2> attribute. Since Linux 4.14, the version of the I<security.capability> extended attribute that is attached to a file depends on the circumstances in which the attribute was created.
ru: До Linux 4.14 типом мандата расширенного атрибута, который мог быть присоединён к файлу, был только атрибут B<VFS_CAP_REVISION_2>. Начиная с Linux 4.14 версия расширенного атрибута I<security.capability>, присоединённого к файлу, зависит от обстоятельств, при которых был создан атрибут.

source: Starting with Linux 4.14, a I<security.capability> extended attribute is automatically created as (or converted to) a version 3 (B<VFS_CAP_REVISION_3>) attribute if both of the following are true:
ru: Начиная с Linux 4.14, расширенный атрибут I<security.capability> автоматически создаётся (или преобразуется) как атрибут версии 3 (B<VFS_CAP_REVISION_3>), если оба условия истинны:

source: The thread writing the attribute resides in a noninitial user namespace. (More precisely: the thread resides in a user namespace other than the one from which the underlying filesystem was mounted.)
ru: Нить, записывающая атрибут, расположена не в изначальном пользовательском пространстве имён (более точно: нить располагается в пользовательском пространстве имён отличном от того, из которого смонтирована нижележащая файловая система).

source: The thread has the B<CAP_SETFCAP> capability over the file inode, meaning that (a) the thread has the B<CAP_SETFCAP> capability in its own user namespace; and (b) the UID and GID of the file inode have mappings in the writer's user namespace.
ru: Нить имеет мандат B<CAP_SETFCAP> поверх файловой иноды, то есть (a) нит имеет мандат B<CAP_SETFCAP> в своём собственном пользовательском пространстве имён; и (b) UID и GID файловой иноды отображаются в пользовательское пространство имён записывающего.

source: When a B<VFS_CAP_REVISION_3> I<security.capability> extended attribute is created, the root user ID of the creating thread's user namespace is saved in the extended attribute.
ru: При создании расширенного атрибута I<security.capability> с типом B<VFS_CAP_REVISION_3> ID суперпользователя пользовательского пространства имён создающей нити сохраняется в расширенном атрибуте.

source: By contrast, creating or modifying a I<security.capability> extended attribute from a privileged (B<CAP_SETFCAP>) thread that resides in the namespace where the underlying filesystem was mounted (this normally means the initial user namespace) automatically results in the creation of a version 2 (B<VFS_CAP_REVISION_2>) attribute.
ru: Но при создании или изменении расширенного атрибута I<security.capability> из привилегированной (B<CAP_SETFCAP>) нити, находящейся в пространстве имён, в котором смонтирована нижележащая файловая система (обычно, это изначальное пользовательское пространство имён), автоматически вызывает создание атрибута с версией 2 (B<VFS_CAP_REVISION_2>).

source: Note that the creation of a version 3 I<security.capability> extended attribute is automatic. That is to say, when a user-space application writes (B<setxattr>(2)) a I<security.capability> attribute in the version 2 format, the kernel will automatically create a version 3 attribute if the attribute is created in the circumstances described above. Correspondingly, when a version 3 I<security.capability> attribute is retrieved (B<getxattr>(2)) by a process that resides inside a user namespace that was created by the root user ID (or a descendant of that user namespace), the returned attribute is (automatically) simplified to appear as a version 2 attribute (i.e., the returned value is the size of a version 2 attribute and does not include the root user ID). These automatic translations mean that no changes are required to user-space tools (e.g., B<setcap>(1) and B<getcap>(1)) in order for those tools to be used to create and retrieve version 3 I<security.capability> attributes.
ru: Заметим, что создании расширенного атрибута I<security.capability> версии 3 происходит автоматически. То есть когда приложение пользовательского пространства записывает (B<setxattr>(2)) атрибут I<security.capability> в формате версии 2 ядра автоматически создаёт версию атрибут версии 3, если атрибут создаётся в условиях, описанных выше. И, соответственно, кода атрибут I<security.capability> версии 3 возвращается (B<getxattr>(2)) процессу, расположенному в пользовательском пространстве имён, которое было создано с ID суперпользователя (или потомком этого пользовательского пространства имён), атрибут (автоматически) упрощается до версии 2 (т. е., возвращаемое значение имеет размер атрибута версии 2 и не включает ID суперпользователя). Эти автоматические преобразования позволяют не переписывать требуемые инструменты пользовательского пространства (например, B<setcap>(1) и B<getcap>(1)) для создания и получения атрибута I<security.capability> версии 3.

source: Note that a file can have either a version 2 or a version 3 I<security.capability> extended attribute associated with it, but not both: creation or modification of the I<security.capability> extended attribute will automatically modify the version according to the circumstances in which the extended attribute is created or modified.
ru: Заметим, что файл может иметь расширенный атрибут I<security.capability> версии 2 или версии 3, но не оба одновременно: создание или изменение расширенного атрибута I<security.capability> автоматически приведёт к изменению версии согласно условиям, в которых он изменяется.

source: Transformation of capabilities during execve()
ru: Преобразование мандатов при execve()

source: During an B<execve>(2), the kernel calculates the new capabilities of the process using the following algorithm:
ru: При B<execve>(2) ядро вычисляет новые мандаты процесса по следующему алгоритму:

source: P'(ambient) = (file is privileged) ? 0 : P(ambient)
ru: P'(ambient) = (привилегированный файл) ? 0 : P(ambient)

source: P'(inheritable) = P(inheritable) [i.e., unchanged]
ru: P'(inheritable) = P(inheritable) [т. е., не изменяется]

source: P'(bounding) = P(bounding) [i.e., unchanged]
ru: P'(bounding) = P(bounding) [т. е., не изменяется]

source: where:
ru: где:

source: denotes the value of a thread capability set before the B<execve>(2)
ru: значение набора мандатов нити до B<execve>(2)

source: denotes the value of a thread capability set after the B<execve>(2)
ru: значение набора мандатов нити после B<execve>(2)

source: denotes a file capability set
ru: файловый набор мандатов

source: Note the following details relating to the above capability transformation rules:
ru: Опишем подробней правила преобразования описанного выше мандата:

source: The ambient capability set is present only since Linux 4.3. When determining the transformation of the ambient set during B<execve>(2), a privileged file is one that has capabilities or has the set-user-ID or set-group-ID bit set.
ru: Набор мандатов ambient появился начиная с Linux 4.3. При определении преобразования набора ambient в B<execve>(2) привилегированный файл — это файл, имеющий один из этих мандатов, или у него установлен бит set-user-ID или set-group-ID.

source: Prior to Linux 2.6.25, the bounding set was a system-wide attribute shared by all threads. That system-wide value was employed to calculate the new permitted set during B<execve>(2) in the same manner as shown above for I<P(bounding)>.
ru: До Linux 2.6.25 ограничивающий набор мандатов был общесистемным атрибутом, общим для всех нитей. Его значение использовалось для вычисления нового разрешительного набора в B<execve>(2) таким же образом как для I<P(bounding)>, показанном выше.

source: I<Note>: during the capability transitions described above, file capabilities may be ignored (treated as empty) for the same reasons that the set-user-ID and set-group-ID bits are ignored; see B<execve>(2). File capabilities are similarly ignored if the kernel was booted with the I<no_file_caps> option.
ru: I<Замечание>: во время изменений мандатов, описанных выше, файловые мандаты могут игнорироваться (считаться пустыми) по тем же причинам что и игнорируются биты set-user-ID и set-group-ID; смотрите B<execve>(2). Файловые мандаты также игнорируются, если ядро было загружено с параметром I<no_file_caps>.

source: I<Note>: according to the rules above, if a process with nonzero user IDs performs an B<execve>(2) then any capabilities that are present in its permitted and effective sets will be cleared. For the treatment of capabilities when a process with a user ID of zero performs an B<execve>(2), see below under I<Capabilities and execution of programs by root>.
ru: I<Замечание>: в соответствии с правилами выше, если процесс ненулевым идентификатором пользователя выполняет B<execve>(2), то все его мандаты в разрешительном и действующим наборах будут очищены. Учёт мандатов в случае, когда процесс имеет нулевой идентификатор пользователя и выполняет B<execve>(2), описан далее в разделе I<Мандаты и выполнение программы с правами root>.

source: Safety checking for capability-dumb binaries
ru: Проверка на безопасность двоичных файлов, не отзывчивых к мандатам
