Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Multiple instances of such hierarchies can be mounted; each hierarchy must have a unique name. The only purpose of such hierarchies is to track processes. (See the discussion of release notification below.) An example of this is the I<name=systemd> cgroup hierarchy that is used by B<systemd>(1) to track services and user sessions.
ru: Можно смонтировать несколько экземпляров таких иерархий; каждая иерархия должна иметь уникальное имя. Единственной целью таких иерархий является слежение за процессами (смотрите описание о выдаче уведомлений ниже). В пример можно привести иерархию cgroup I<name=systemd>, которая используется B<systemd>(1) для слежения за службами и пользовательскими сеансами.

source: Since Linux 5.0, the I<cgroup_no_v1> kernel boot option (described below) can be used to disable cgroup v1 named hierarchies, by specifying I<cgroup_no_v1=named>.
ru: Начиная с Linux 5.0, параметром ядра I<cgroup_no_v1> (описан ниже) можно выключить иерархию cgroup v1 с определённым именем: I<cgroup_no_v1=named>.

source: CGROUPS VERSION 2
ru: CGROUPS ВЕРСИИ 2

source: In cgroups v2, all mounted controllers reside in a single unified hierarchy. While (different) controllers may be simultaneously mounted under the v1 and v2 hierarchies, it is not possible to mount the same controller simultaneously under both the v1 and the v2 hierarchies.
ru: В cgroup v2 все смонтированные контроллеры располагаются в единой унифицированной иерархии. Хотя (различные) контроллеры могут одновременно монтироваться в иерархиях v1 и v2, невозможно одновременное монтирование одного контроллера в обеих иерархиях v1 и v2.

source: The new behaviors in cgroups v2 are summarized here, and in some cases elaborated in the following subsections.
ru: Далее приведено краткое описание новых правил поведения cgroups v2, и в некоторых случаях, расширено в последующих подразделах.

source: Cgroups v2 provides a unified hierarchy against which all controllers are mounted.
ru: Cgroups v2 предоставляет унифицированную иерархию всех смонтированных контроллеров.

source: "Internal" processes are not permitted. With the exception of the root cgroup, processes may reside only in leaf nodes (cgroups that do not themselves contain child cgroups). The details are somewhat more subtle than this, and are described below.
ru: «Внутренние» процессы запрещены. За исключением корневой группы cgroup, процессы могут располагаться только в крайних узлах (группа cgroup, которая не содержит дочерних групп cgroup). Подробности несколько более тонкие, чем эти и описаны ниже.

source: Active cgroups must be specified via the files I<cgroup.controllers> and I<cgroup.subtree_control>.
ru: Требуется указывать активные cgroup-ы через файлы I<cgroup.controllers> и I<cgroup.subtree_control>.

source: The I<tasks> file has been removed. In addition, the I<cgroup.clone_children> file that is employed by the I<cpuset> controller has been removed.
ru: Удалён файл I<tasks>. Также удалён файл I<cgroup.clone_children>, использовавшийся контроллером I<cpuset>.

source: An improved mechanism for notification of empty cgroups is provided by the I<cgroup.events> file.
ru: Улучшенный механизм уведомлений о пустых cgroup доступен через файл I<cgroup.events>.

source: For more changes, see the I<Documentation/cgroup-v2.txt> file in the kernel source.
ru: Дополнительную информацию смотрите в файле исходного кода ядра I<Documentation/cgroup-v2.txt>.

source: Some of the new behaviors listed above saw subsequent modification with the addition in Linux 4.14 of "thread mode" (described below).
ru: Некоторые новые упомянутые выше функциональные возможности появились с добавлением в Linux 4.14 «режима нитей» (смотрите далее).

source: Cgroups v2 unified hierarchy
ru: Унифицированная иерархия cgroups v2

source: In cgroups v1, the ability to mount different controllers against different hierarchies was intended to allow great flexibility for application design. In practice, though, the flexibility turned out to be less useful than expected, and in many cases added complexity. Therefore, in cgroups v2, all available controllers are mounted against a single hierarchy. The available controllers are automatically mounted, meaning that it is not necessary (or possible) to specify the controllers when mounting the cgroup v2 filesystem using a command such as the following:
ru: В cgroups v1, способность монтировать различные контроллеры в разные иерархии предназначалась для повышения гибкости при разработки приложения. Однако на практике выяснилось, что гибкость не так полезна как ожидалось, и во многих случаях добавляет сложности. Поэтому в cgroups v2, все доступные контроллеры монтируются в одну иерархию. Доступные контроллеры монтируются автоматически, то есть не нужно (но можно) указывать контроллеры при монтировании файловой системы cgroup v2 с помощью команды вида:

source: A cgroup v2 controller is available only if it is not currently in use via a mount against a cgroup v1 hierarchy. Or, to put things another way, it is not possible to employ the same controller against both a v1 hierarchy and the unified v2 hierarchy. This means that it may be necessary first to unmount a v1 controller (as described above) before that controller is available in v2. Since B<systemd>(1) makes heavy use of some v1 controllers by default, it can in some cases be simpler to boot the system with selected v1 controllers disabled. To do this, specify the I<cgroup_no_v1=list> option on the kernel boot command line; I<list> is a comma-separated list of the names of the controllers to disable, or the word I<all> to disable all v1 controllers. (This situation is correctly handled by B<systemd>(1), which falls back to operating without the specified controllers.)
ru: Контроллер cgroup v2 доступен только, если он уже не смонтирован в иерархии cgroup v1. Или, иначе говоря, невозможно использовать тот же контроллер одновременно в иерархии v1 и унифицированной иерархии v2. Это означает, что сначала может потребоваться размонтировать контроллер v1 (как описано выше), чтобы он стал доступен в v2. Так как B<systemd>(1) по умолчанию интенсивно использует некоторые контроллеры v1, в некоторых случаях проще загрузить систему с отключёнными контроллерами v1. Для этого укажите параметр I<cgroup_no_v1=список> в командной строке загрузки ядра; в I<списке> через запятую перечисляются имена отключаемых контроллеров или указывается слово I<all> для выключения всех контроллеров v1 (этот вариант корректно отрабатывается B<systemd>(1) и она начинает работать без указанных контроллеров).

source: Note that on many modern systems, B<systemd>(1) automatically mounts the I<cgroup2> filesystem at I</sys/fs/cgroup/unified> during the boot process.
ru: Заметим, что во многих современных системах B<systemd>(1) автоматически монтирует файловую систему I<cgroup2> в каталог I</sys/fs/cgroup/unified> при запуске системы.

source: Cgroups v2 controllers
ru: Контроллеры cgroups v2

source: The following controllers, documented in the kernel source file I<Documentation/cgroup-v2.txt>, are supported in cgroups version 2:
ru: Следующие контроллеры, описанные в файле исходного кода ядра I<Documentation/cgroup-v2.txt>, поддерживаются в cgroups версии 2:

source: I<io> (since Linux 4.5)
ru: I<io> (начиная с Linux 4.5)

source: This is the successor of the version 1 I<blkio> controller.
ru: Приемник контроллера I<blkio> версии 1.

source: I<memory> (since Linux 4.5)
ru: I<memory> (начиная с Linux 4.5)

source: This is the successor of the version 1 I<memory> controller.
ru: Приемник контроллера I<memory> версии 1.

source: I<pids> (since Linux 4.5)
ru: I<pids> (начиная с Linux 4.5)

source: This is the same as the version 1 I<pids> controller.
ru: Совпадает с контроллером I<pids> версии 1.

source: I<perf_event> (since Linux 4.11)
ru: I<perf_event> (начиная с Linux 4.11)

source: This is the same as the version 1 I<perf_event> controller.
ru: Совпадает с контроллером I<perf_event> версии 1.

source: I<rdma> (since Linux 4.11)
ru: I<rdma> (начиная с Linux 4.11)

source: This is the same as the version 1 I<rdma> controller.
ru: Совпадает с контроллером I<rdma> версии 1.

source: I<cpu> (since Linux 4.15)
ru: I<cpu> (начиная с Linux 4.15)

source: This is the successor to the version 1 I<cpu> and I<cpuacct> controllers.
ru: Приемник контроллеров I<cpu> и I<cpuacct> версии 1.

source: Cgroups v2 subtree control
ru: Управление поддеревом cgroups v2

source: Each cgroup in the v2 hierarchy contains the following two files:
ru: Каждая cgroup в иерархии v2 содержит следующие два файла:

source: This read-only file exposes a list of the controllers that are I<available> in this cgroup. The contents of this file match the contents of the I<cgroup.subtree_control> file in the parent cgroup.
ru: Доступный только для чтения файл со списком контроллеров, I<доступных> в этой cgroup. Содержимое этого файла совпадает с содержимым файла I<cgroup.subtree_control> в родительской cgroup.

source: This is a list of controllers that are I<active> (I<enabled>) in the cgroup. The set of controllers in this file is a subset of the set in the I<cgroup.controllers> of this cgroup. The set of active controllers is modified by writing strings to this file containing space-delimited controller names, each preceded by '+' (to enable a controller) or '-' (to disable a controller), as in the following example:
ru: Список контроллеров, I<активных> (I<включённых>) в cgroup. Набор контроллеров в этом файле является поднабором I<cgroup.controllers> этой cgroup. Изменение набора активных контроллеров выполняется записью строк в этот файл с именами контроллеров через пробел; перед именами указывается «+» (включить контроллер) или «-» (выключить контроллер), как в следующем примере:

source: An attempt to enable a controller that is not present in I<cgroup.controllers> leads to an B<ENOENT> error when writing to the I<cgroup.subtree_control> file.
ru: Попытка включить контроллер, который отсутствует в I<cgroup.controllers>, приводит к ошибке B<ENOENT> при записи в файл I<cgroup.subtree_control>.

source: Because the list of controllers in I<cgroup.subtree_control> is a subset of those I<cgroup.controllers>, a controller that has been disabled in one cgroup in the hierarchy can never be re-enabled in the subtree below that cgroup.
ru: Так как список контроллеров в I<cgroup.subtree_control> является поднабором из I<cgroup.controllers>, то контроллер, отключённый в иерархии cgroup, невозможно включить в поддереве ниже этой cgroup.

source: A cgroup's I<cgroup.subtree_control> file determines the set of controllers that are exercised in the I<child> cgroups. When a controller (e.g., I<pids>) is present in the I<cgroup.subtree_control> file of a parent cgroup, then the corresponding controller-interface files (e.g., I<pids.max>) are automatically created in the children of that cgroup and can be used to exert resource control in the child cgroups.
ru: Файл cgroup I<cgroup.subtree_control> определяет набор контроллеров, которые выполняются в I<дочерних> cgroup. Когда контроллер (например I<pids>), есть в файле I<cgroup.subtree_control> родительской cgroup, то соответствующие файлы интерфейса контроллера (например I<pids.max>) автоматически создаются в дочерних cgroup и могут использоваться для влияния на управление ресурсами в дочерних cgroup.

source: Cgroups v2 "no internal processes" rule
ru: Правило cgroups v2 «нет внутренним процессам»

source: Cgroups v2 enforces a so-called "no internal processes" rule. Roughly speaking, this rule means that, with the exception of the root cgroup, processes may reside only in leaf nodes (cgroups that do not themselves contain child cgroups). This avoids the need to decide how to partition resources between processes which are members of cgroup A and processes in child cgroups of A.
ru: Cgroups v2 вводит так называемое правило «нет внутренним процессам». Грубо говоря, это правило означает, что за исключением корневой cgroup, процессы могут располагаться только в краевых узлах (cgroup, которая не содержит дочерних cgroup). Это позволяет не решать как делить ресурсы между процессами, которые являются членами cgroup A и процессами в дочерних cgroup-ах A.

source: For instance, if cgroup I</cg1/cg2> exists, then a process may reside in I</cg1/cg2>, but not in I</cg1>. This is to avoid an ambiguity in cgroups v1 with respect to the delegation of resources between processes in I</cg1> and its child cgroups. The recommended approach in cgroups v2 is to create a subdirectory called I<leaf> for any nonleaf cgroup which should contain processes, but no child cgroups. Thus, processes which previously would have gone into I</cg1> would now go into I</cg1/leaf>. This has the advantage of making explicit the relationship between processes in I</cg1/leaf> and I</cg1>'s other children.
ru: Например, если существует cgroup I</cg1/cg2>, то процесс может располагаться в I</cg1/cg2>, но не в I</cg1>. Это решает проблему с неясностью в cgroups v1 в плане разделения ресурсов между процессами в I</cg1> и её дочерних cgroup-ах. Рекомендуемый подход в cgroups v2 — создать подкаталог I<leaf> для всех конечных cgroup, в котором будут содержаться только процессы и отсутствовать дочерние cgroup-ы. То есть процессы, которые раньше находились в I</cg1> теперь должны помещаться в I</cg1/leaf>. Преимуществом этого является явное указание родства между процессами в I</cg1/leaf> и в других потомках I</cg1>.

source: The "no internal processes" rule is in fact more subtle than stated above. More precisely, the rule is that a (nonroot) cgroup can't both (1) have member processes, and (2) distribute resources into child cgroups\(emthat is, have a nonempty I<cgroup.subtree_control> file. Thus, it I<is> possible for a cgroup to have both member processes and child cgroups, but before controllers can be enabled for that cgroup, the member processes must be moved out of the cgroup (e.g., perhaps into the child cgroups).
ru: На самом деле, правило «нет внутренним процессам» не столь категорично как утверждалось выше. Более точно, правило состоит в том, что (не корневая) cgroup не может одновременно (1) иметь процессы-члены и (2) распределять ресурсы в дочерних cgroup, то есть иметь непустой файл I<cgroup.subtree_control>. Таким образом, cgroup I<может> иметь процессы-члены и дочерние cgroup, но перед тем как в этой группе можно будет включить контроллеры, члены-процессы нужно вывести из cgroup (например, в дочерние cgroup).

source: With the Linux 4.14 addition of "thread mode" (described below), the "no internal processes" rule has been relaxed in some cases.
ru: С добавлением в Linux 4.14 «режима нитей» (смотрите далее) для некоторых случаев применение правила «не внутренних процессов» было ослаблено.

source: Cgroups v2 cgroup.events file
ru: Файл cgroup.events в cgroups v2

source: With cgroups v2, a new mechanism is provided to obtain notification about when a cgroup becomes empty. The cgroups v1 I<release_agent> and I<notify_on_release> files are removed, and replaced by a new, more general-purpose file, I<cgroup.events>. This read-only file contains key-value pairs (delimited by newline characters, with the key and value separated by spaces) that identify events or state for a cgroup. Currently, only one key appears in this file, I<populated>, which has either the value 0, meaning that the cgroup (and its descendants) contain no (nonzombie) processes, or 1, meaning that the cgroup contains member processes.
ru: В cgroups v2 появился новый механизм получения уведомления при появлении пустой cgroup. Файлы cgroups v1 I<release_agent> и I<notify_on_release> удалены и заменены новым, более общим файлом I<cgroup.events>. В этом доступном только для чтения файле содержится пара ключ-значение (пары разделяются символом новой строки, ключ и значение разделяется пробелами), которые определяют события или состояние cgroup. В настоящее время доступен только один ключ, I<populated>, который имеет значение 0, означающее, что эта cgroup (и её потомки) не содержат процессов (не зомби), или 1, означающее, что cgroup содержит процессы.

source: The I<cgroup.events> file can be monitored, in order to receive notification when a cgroup transitions between the populated and unpopulated states (or vice versa). When monitoring this file using B<inotify>(7), transitions generate B<IN_MODIFY> events, and when monitoring the file using B<poll>(2), transitions cause the bits B<POLLPRI> and B<POLLERR> to be returned in the I<revents> field.
ru: За файлом I<cgroup.events> можно установить наблюдение и получить уведомление, когда cgroup изменяет состояние с пустой на непустую и наоборот. При наблюдении за файлом с помощью B<inotify>(7) во время перехода генерируются события B<IN_MODIFY>, а при наблюдении с помощью B<poll>(2) во время перехода в возвращаемом поле I<revents> устанавливаются биты B<POLLPRI> и B<POLLERR>.

source: The cgroups v2 release-notification mechanism provided by the I<populated> field of the I<cgroup.events> file offers at least two advantages over the cgroups v1 I<release_agent> mechanism. First, it allows for cheaper notification, since a single process can monitor multiple I<cgroup.events> files. By contrast, the cgroups v1 mechanism requires the creation of a process for each notification. Second, notification can be delegated to a process that lives inside a container associated with the newly empty cgroup.
ru: Механизм уведомлений cgroups v2, предоставляемый полем I<populated> в файле I<cgroup.events> имеет, по крайней мере, два преимущества над механизмом cgroups v1 I<release_agent>. Во-первых, уведомление менее требовательно, так как один процесс может следить за несколькими файлами I<cgroup.events>. Для сравнения, механизм cgroups v1 требует создания процесса для каждого уведомления. Во-вторых, уведомление может бы поручено процессу, который находится внутри контейнера, связанного с только что созданной пустой cgroup.

source: Cgroups v2 cgroup.stat file
ru: Файл cgroup.stat в cgroups v2

source: Each cgroup in the v2 hierarchy contains a read-only I<cgroup.stat> file (first introduced in Linux 4.14) that consists of lines containing key-value pairs. The following keys currently appear in this file:
ru: Каждая cgroup в иерархии v2 содержит файл I<cgroup.stat>, доступный только для чтения (появился в Linux 4.14), который состоит из строк с парами ключ-значение. В этом файле появляются следующие ключи:

source: This is the total number of visible (i.e., living) descendant cgroups underneath this cgroup.
ru: Общее количество видимых (т. е., живых) cgroups — потомков этой cgroup.

source: This is the total number of dying descendant cgroups underneath this cgroup. A cgroup enters the dying state after being deleted. It remains in that state for an undefined period (which will depend on system load) while resources are freed before the cgroup is destroyed. Note that the presence of some cgroups in the dying state is normal, and is not indicative of any problem.
ru: Общее количество прекративших работу cgroups — потомков этой cgroup. cgroups входит в состояния прекращения жизнедеятельности после удаления. Она остаётся в таком состоянии на неопределённых срок (зависит от системной нагрузки), хотя ресурсы освобождаются до уничтожения cgroup. Заметим, что существование несколькими cgroups в состоянии прекращения жизнедеятельности нормально и не указывает на проблему.

source: A process can't be made a member of a dying cgroup, and a dying cgroup can't be brought back to life.
ru: Процесс не может стать членом прекратившей работу cgroup, и такая cgroup не может опять заработать.

source: Limiting the number of descendant cgroups
ru: Ограничение на количество дочерних cgroups

source: Each cgroup in the v2 hierarchy contains the following files, which can be used to view and set limits on the number of descendant cgroups under that cgroup:
ru: Каждая cgroup в иерархии v2 содержит следующие файлы, которые можно использовать для просмотра и изменения количества дочерних cgroup в cgroup:

source: I<cgroup.max.depth> (since Linux 4.14)
ru: I<cgroup.max.depth> (начиная с Linux 4.14)

source: This file defines a limit on the depth of nesting of descendant cgroups. A value of 0 in this file means that no descendant cgroups can be created. An attempt to create a descendant whose nesting level exceeds the limit fails (I<mkdir>(2) fails with the error B<EAGAIN>).
ru: Этим файлом задаётся ограничение глубины вложенности дочерних cgroup. Значение 0 означает запрет на создание дочерних cgroup. Попытка создать потомка, чья глубина вложенности превышает ограничение, завершается ошибкой (I<mkdir>(2) завершается ошибкой B<EAGAIN>).

source: Writing the string I<"max"> to this file means that no limit is imposed. The default value in this file is I<"max">.
ru: Запись строки I<"max"> в этот файл означает, что ограничение отсутствует. Значением по умолчанию для файла является I<"max">.

source: I<cgroup.max.descendants> (since Linux 4.14)
ru: I<cgroup.max.descendants> (начиная с Linux 4.14)

source: This file defines a limit on the number of live descendant cgroups that this cgroup may have. An attempt to create more descendants than allowed by the limit fails (I<mkdir>(2) fails with the error B<EAGAIN>).
ru: Этим файлом задаётся ограничение на количество действующих дочерних cgroup, которое может иметь cgroup. Попытка создать больше потомков, чем разрешено, приводит к ошибке (I<mkdir>(2) завершается ошибкой B<EAGAIN>).

source: CGROUPS DELEGATION: DELEGATING A HIERARCHY TO A LESS PRIVILEGED USER
ru: ДЕЛЕГИРОВАНИЕ CGROUPS: ДЕЛЕГИРОВАНИЕ ИЕРАРХИИ МЕНЕЕ ПРИВИЛЕГИРОВАННОМУ ПОЛЬЗОВАТЕЛЮ

source: In the context of cgroups, delegation means passing management of some subtree of the cgroup hierarchy to a nonprivileged user. Cgroups v1 provides support for delegation based on file permissions in the cgroup hierarchy but with less strict containment rules than v2 (as noted below). Cgroups v2 supports delegation with containment by explicit design. The focus of the discussion in this section is on delegation in cgroups v2, with some differences for cgroups v1 noted along the way.
ru: В контексте cgroups, делегирование означает передачу управления частью поддерева иерархии cgroup непривилегированному пользователю. Cgroups v1 предоставляют поддержку делегирования на основе файловых прав доступа в иерархии cgroup, но эти правила менее ограничительны по сравнению с v2 (смотрите далее). Поддержка делегирования в cgroups v2 планировалась изначально. В основном, этот раздел описывает делегирование для cgroups v2, попутно указывая различия с cgroups v1.

source: Some terminology is required in order to describe delegation. A I<delegater> is a privileged user (i.e., root) who owns a parent cgroup. A I<delegatee> is a nonprivileged user who will be granted the permissions needed to manage some subhierarchy under that parent cgroup, known as the I<delegated subtree>.
ru: Для описания делегирования необходима некоторая терминология. I<Делегирующий> это привилегированный пользователь (т.е., корневой объект), которому принадлежит родительская группа cgroup. I<Делегат> это непривилегированный пользователь, которому будут предоставлены права, необходимые для управления некоторой субиерархией в родительской группе cgroup, также называемой I<делегированным поддеревом>.
