Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: B<catgets>() reads the message I<message_number>, in set I<set_number>, from the message catalog identified by I<catalog>, where I<catalog> is a catalog descriptor returned from an earlier call to B<catopen>(3). The fourth argument, I<message>, points to a default message string which will be returned by B<catgets>() if the identified message catalog is not currently available. The message-text is contained in an internal buffer area and should be copied by the application if it is to be saved or modified. The return string is always terminated with a null byte (\(aq\e0\(aq).
ru: Функция B<catgets>() читает сообщение номер I<message_number> в наборе номеров I<set_number>, из каталога сообщений, обозначенного как I<catalog>, где I<catalog> — это дескриптор каталога, полученный ранее вызовом функции B<catopen>(3). Четвертый аргумент, B<message>, является указателем на строку с сообщением по умолчанию, которую вернёт B<catgets>() в случае, если указанный каталог сообщений недоступен. Текст сообщений хранится во внутреннем буфере и должен быть скопирован приложением, если оно должно быть изменено или сохранено. Возвращаемая строка всегда заканчивается байтом null (\(aq\e0\(aq).

source: On success, B<catgets>() returns a pointer to an internal buffer area containing the null-terminated message string. On failure, B<catgets>() returns the value I<message>.
ru: При успешном выполнении B<catgets>() возвращает указатель на внутренний буфер, содержащий заканчивающуюся null строку с сообщением. Если сообщение не найдено, то B<catgets>() возвращает значение I<message>.

source: The B<catgets>() function is available only in libc.so.4.4.4c and above. The Jan 1987 X/Open Portability Guide specifies a more subtle error return: I<message> is returned if the message catalog specified by I<catalog> is not available, while an empty string is returned when the message catalog is available but does not contain the specified message. These two possible error returns seem to be discarded in SUSv2 in favor of always returning I<message>.
ru: Функция B<catgets>() доступна только в libc.so.4.4.4c и более поздних версиях. В январе 1987 года в X/Open Portability Guide определены более точные сообщения об ошибках: I<message> возвращается, если каталог I<catalog> недоступен; если возвращена пустая строка, то каталог доступен, но не содержит данных о сообщении. Эти две возможные ситуации, похоже, не учтены в XSUSv2, и в случае ошибки всегда возвращается I<message>.

source: clog, clogf, clogl - natural logarithm of a complex number
ru: clog, clogf, clogl - натуральный логарифм комплексного числа

source: These functions calculate the complex natural logarithm of I<z>, with a branch cut along the negative real axis.
ru: Эти функции вычисляют комплексный натуральный логарифм I<z> с обрезанием ветви вдоль отрицательной действительной оси.

source: The logarithm B<clog>() is the inverse function of the exponential B<cexp>(3). Thus, if I<y\ =\ clog(z)>, then I<z\ =\ cexp(y)>. The imaginary part of I<y> is chosen in the interval [-pi,pi].
ru: Логарифм B<clog>() является обратной функцией для экспоненты B<cexp>(3). Таким образом, если I<y\ =\ clog(z)>, то I<z\ =\ cexp(y)>. Мнимая часть I<y> выбирается из интервала [-pi,pi].

source: ctanh, ctanhf, ctanhl - complex hyperbolic tangent
ru: ctanh, ctanhf, ctanhl - вычисление гиперболического тангенса комплексного числа

source: These functions calculate the complex hyperbolic tangent of I<z>.
ru: Эти функции вычисляют комплексный гиперболический тангенс I<z>.

source: The complex hyperbolic tangent function is defined mathematically as:
ru: Функция гиперболического тангенса комплексного числа математически определена как:

source: clog10, clog10f, clog10l - base-10 logarithm of a complex number
ru: clog10, clog10f, clog10l - вычисление десятичного логарифма комплексного числа

source: B<#define _GNU_SOURCE> /* See feature_test_macros(7) */
ru: B<#define _GNU_SOURCE> /* смотрите feature_test_macros(7) */

source: The call I<clog10(z)> is equivalent to:
ru: Вызов I<clog10(z)> равнозначен следующему:

source: or equally:
ru: или:

source: These functions are GNU extensions. The identifiers are reserved for future use in C99 and C11.
ru: Эти функции являются расширениями GNU. Идентификаторы зарезервированы для будущего использования в C99 и C11.

source: clock - determine processor time
ru: clock - вычисляет процессорное время

source: The B<clock>() function returns an approximation of processor time used by the program.
ru: Функция B<clock>() возвращает приблизительное процессорное время, использованное программой.

source: The value returned is the CPU time used so far as a I<clock_t>; to get the number of seconds used, divide by B<CLOCKS_PER_SEC>. If the processor time used is not available or its value cannot be represented, the function returns the value I<(clock_t)\ -1>.
ru: Возвращаемое значение — это время, затраченное процессором на выполнение программы, представленное типом I<clock_t>. Чтобы узнать количество затраченных на выполнение секунд, разделите возвращенное значение на B<CLOCKS_PER_SEC>. Если затраченное процессором время недоступно или если его значение не может быть определено, то функция возвращает значение I<(clock_t)\ -1>.

source: POSIX.1-2001, POSIX.1-2008, C89, C99. XSI requires that B<CLOCKS_PER_SEC> equals 1000000 independent of the actual resolution.
ru: POSIX.1-2001, POSIX.1-2008, C89, C99. В XSI требуется, чтобы B<CLOCKS_PER_SEC> было равно 1000000 вне зависимости от действительной точности.

source: The C standard allows for arbitrary values at the start of the program; subtract the value returned from a call to B<clock>() at the start of the program to get maximum portability.
ru: Стандарт Си разрешает выдавать произвольные значения времени при старте программы; поэтому вычтите из возвращенного функцией B<clock>() значения её значение при старте и используйте разницу для обеспечения максимальной переносимости.

source: Note that the time can wrap around. On a 32-bit system where B<CLOCKS_PER_SEC> equals 1000000 this function will return the same value approximately every 72 minutes.
ru: Заметим, что время может превысить свое максимальное значение. В 32-битных системах, где B<CLOCKS_PER_SEC> равно 1000000, функция B<clock>() возвращает одно и то же значение примерно каждые 72 минуты.

source: On several other implementations, the value returned by B<clock>() also includes the times of any children whose status has been collected via B<wait>(2) (or another wait-type call). Linux does not include the times of waited-for children in the value returned by B<clock>(). The B<times>(2) function, which explicitly returns (separate) information about the caller and its children, may be preferable.
ru: В некоторых других реализациях значение, возвращаемое B<clock>(), также включает в себя время всех дочерних процессов, чьи состояния были собраны через B<wait>(2) (или другие системные вызовы типа wait). Linux не включает время ожидающих потомков в значение, возвращаемое B<clock>(). Возможно, предпочтительнее использовать функцию B<times>(2), явно возвращающую (отдельно) информацию о вызвавшем функцию и его дочерних процессах.

source: In glibc 2.17 and earlier, B<clock>() was implemented on top of B<times>(2). For improved accuracy, since glibc 2.18, it is implemented on top of B<clock_gettime>(2) (using the B<CLOCK_PROCESS_CPUTIME_ID> clock).
ru: В glibc 2.17 и старее, функция B<clock>() работает на основе B<times>(2). Для повышения точности, начиная с glibc 2.18, она реализуется через B<clock_gettime>(2) (используются часы B<CLOCK_PROCESS_CPUTIME_ID>).

source: clock_getcpuclockid - obtain ID of a process CPU-time clock
ru: clock_getcpuclockid - возвращает ID процессорных часов процесса

source: The B<clock_getcpuclockid>() function obtains the ID of the CPU-time clock of the process whose ID is I<pid>, and returns it in the location pointed to by I<clock_id>. If I<pid> is zero, then the clock ID of the CPU-time clock of the calling process is returned.
ru: Функция B<clock_getcpuclockid>() возвращает ID процессорных часов процесса с заданным I<pid> в виде указателя в I<clock_id>. Если значение I<pid> равно 0, то возвращается ID процессорных часов вызывающего процесса.

source: On success, B<clock_getcpuclockid>() returns 0; on error, it returns one of the positive error numbers listed in ERRORS.
ru: При успешном выполнении B<clock_getcpuclockid>() возвращает 0; при ошибке возвращается одно из положительных значений ошибки, перечисленных в разделе ОШИБКИ.

source: The kernel does not support obtaining the per-process CPU-time clock of another process, and I<pid> does not specify the calling process.
ru: Ядро не поддерживает возврат процессорных часов другого процесса и значение I<pid> не указывает на вызывающий процесс.

source: The caller does not have permission to access the CPU-time clock of the process specified by I<pid>. (Specified in POSIX.1-2001; does not occur on Linux unless the kernel does not support obtaining the per-process CPU-time clock of another process.)
ru: Вызывающий не имеет прав доступа к процессорным часам процесса, указанного в I<pid> (определено в POSIX.1-2001; не возникает в Linux, если ядро не собрано с поддержкой получения процессорных часов процесса, отличного от вызывающего).

source: There is no process with the ID I<pid>.
ru: Процесс с идентификатором I<pid> не найден.

source: The B<clock_getcpuclockid>() function is available in glibc since version 2.2.
ru: Функция B<clock_getcpuclockid>() доступна в glibc начиная с версии 2.2.

source: Calling B<clock_gettime>(2) with the clock ID obtained by a call to B<clock_getcpuclockid>() with a I<pid> of 0, is the same as using the clock ID B<CLOCK_PROCESS_CPUTIME_ID>.
ru: Вызов B<clock_gettime>(2) с ID часов, полученных от вызова B<clock_getcpuclockid>() с I<pid> равным 0, делает то же, что и с ID часов, равным B<CLOCK_PROCESS_CPUTIME_ID>.

source: The example program below obtains the CPU-time clock ID of the process whose ID is given on the command line, and then uses B<clock_gettime>(2) to obtain the time on that clock. An example run is the following:
ru: Представленный ниже пример программы возвращает ID процессорных часов процесса, чей ID указан в командной строке, а затем используется B<clock_gettime>(2) для получения времени этих часов. Пример запуска:

source: $B< ./a.out 1> # Show CPU clock of init process CPU-time clock for PID 1 is 2.213466748 seconds
ru: $B< ./a.out 1> # показать процессорные часы процесса init Процессорные часы для PID 1 показывают 2.213466748 секунд

source: if (argc != 2) { fprintf(stderr, "%s E<lt>process-IDE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 2) { fprintf(stderr, "%s E<lt>ID_процессаE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("CPU-time clock for PID %s is %ld.%09ld seconds\en", argv[1], (long) ts.tv_sec, (long) ts.tv_nsec); exit(EXIT_SUCCESS); }
ru: printf("процессорные часы для PID %s показывают %ld.%09ld секунд\en", argv[1], (long) ts.tv_sec, (long) ts.tv_nsec); exit(EXIT_SUCCESS); }

source: copysign, copysignf, copysignl - copy sign of a number
ru: copysign, copysignf, copysignl - копирует знак числа

source: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* Since glibc 2.19: */ _DEFAULT_SOURCE || /* Glibc versions E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE
ru: _ISOC99_SOURCE || _POSIX_C_SOURCE\ E<gt>=\ 200112L || /* начиная с glibc 2.19: */ _DEFAULT_SOURCE || /* версии glibc E<lt>= 2.19: */ _BSD_SOURCE || _SVID_SOURCE

source: These functions return a value whose absolute value matches that of I<x>, but whose sign bit matches that of I<y>.
ru: Эти функции возвращают величину, чье абсолютное значение равно I<x>, но знак которой соответствует знаку значения I<y>.

source: For example, I<copysign(42.0,\ -1.0)> and I<copysign(-42.0, -1.0)> both return -42.0.
ru: Например, I<copysign(42.0,\ -1.0)> и I<copysign(-42.0, -1.0)> вернут -42.0.

source: On success, these functions return a value whose magnitude is taken from I<x> and whose sign is taken from I<y>.
ru: При успешном выполнении данные функции возвращают значение величиной как у I<x> и знаком как у I<y>.

source: If I<x> is a NaN, a NaN with the sign bit of I<y> is returned.
ru: Если I<x> равно NaN, будет возвращено NaN со знаковым битом как у I<y>.

source: No errors occur.
ru: Ошибки не возникают.

source: C99, POSIX.1-2001, POSIX.1-2008. This function is defined in IEC 559 (and the appendix with recommended functions in IEEE 754/IEEE 854).
ru: C99, POSIX.1-2001, POSIX.1-2008. Эта функция определена в IEC 559 (и в приложении с рекомендуемыми функциями IEEE 754/IEEE 854).

source: On architectures where the floating-point formats are not IEEE 754 compliant, these functions may treat a negative zero as positive.
ru: На архитектурах, у которых форматы чисел с плавающей запятой не совместимы с IEEE 754, эти функции могут считать отрицательный ноль как положительный.

source: ctermid - get controlling terminal name
ru: ctermid - возвращает имя управляющего терминала

source: B<ctermid>() returns a string which is the pathname for the current controlling terminal for this process. If I<s> is NULL, a static buffer is used, otherwise I<s> points to a buffer used to hold the terminal pathname. The symbolic constant B<L_ctermid> is the maximum number of characters in the returned pathname.
ru: Функция B<ctermid>() возвращает строку с полным путём текущего управляющего терминала процесса. Если I<s> равно NULL, то используется статический буфер, в противном случае I<s> указывает на буфер для хранения пути терминала. Символической константой B<L_ctermid> определяется максимальное количество символов в возвращаемом пути.

source: The pointer to the pathname.
ru: Указатель на путь.

source: The returned pathname may not uniquely identify the controlling terminal; it may, for example, be I</dev/tty>.
ru: Возвращаемый путь может быть не уникальным для идентификации управляющего терминала; например, это может быть I</dev/tty>.

source: It is not assured that the program can open the terminal.
ru: Не выполняется проверка, что программа может открыть управляющий терминал.

source: cacos, cacosf, cacosl - complex arc cosine
ru: cacos, cacosf, cacosl - вычисляет комплексный арккосинус

source: These functions calculate the complex arc cosine of I<z>. If I<y\ =\ cacos(z)>, then I<z\ =\ ccos(y)>. The real part of I<y> is chosen in the interval [0,pi].
ru: Эти функции вычисляют арккосинус комплексного числа I<z>. Если I<y\ =\ cacos(z)>, то I<z\ =\ ccos(y)>. Реальная часть I<y> лежит в интервале [0,pi].

source: /* Link with "-lm" */
ru: /* Компонуется при указании параметра «-lm» */

source: if (argc != 3) { fprintf(stderr, "Usage: %s E<lt>realE<gt> E<lt>imagE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
ru: if (argc != 3) { fprintf(stderr, "Использование: %s E<lt>realE<gt> E<lt>imagE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: cexp, cexpf, cexpl - complex exponential function
ru: cexp, cexpf, cexpl - функция комплексной экспоненты

source: These functions calculate e (2.71828..., the base of natural logarithms) raised to the power of I<z>.
ru: Эти функции вычисляют e (2.71828…, основание натурального логарифма), возведённое в степень I<z>.

source: csin, csinf, csinl - complex sine function
ru: csin, csinf, csinl - вычисляет комплексный синус

source: These functions calculate the complex sine of I<z>.
ru: Эти функции вычисляют комплексный синус I<z>.

source: The complex sine function is defined as:
ru: Функция комплексного синуса определяется как:

source: cos, cosf, cosl - cosine function
ru: cos, cosf, cosl - функция вычисления косинуса

source: These functions return the cosine of I<x>, where I<x> is given in radians.
ru: Эти функции возвращают косинус от I<x>, где I<x> указан в радианах.

source: On success, these functions return the cosine of I<x>.
ru: В случае успеха эти функции возвращают косинус от I<x>.

source: If I<x> is a NaN, a NaN is returned.
ru: Если I<x> имеет значение NaN, будет возвращено NaN.

source: If I<x> is positive infinity or negative infinity, a domain error occurs, and a NaN is returned.
ru: Если I<x> стремится к плюс бесконечности или минус бесконечности, то будет сгенерирована ошибка выхода за пределы области, а в качестве результата будет возвращено NaN.

source: See B<math_error>(7) for information on how to determine whether an error has occurred when calling these functions.
ru: Смотрите B<math_error>(7), чтобы определить, какие ошибки могут возникать при вызове этих функций.

source: The following errors can occur:
ru: Могут возникать следующие ошибки:

source: Domain error: I<x> is an infinity
ru: Ошибка области: I<x> стремится к бесконечности

source: I<errno> is set to B<EDOM> (but see BUGS). An invalid floating-point exception (B<FE_INVALID>) is raised.
ru: I<errno> устанавливается в B<EDOM> (но см. ДЕФЕКТЫ). Возникает исключение неправильной плавающей точки (B<FE_INVALID>).

source: The variant returning I<double> also conforms to SVr4, 4.3BSD.
ru: Вариант, возвращающий значение типа I<double>, также соответствует SVr4, 4.3BSD.

source: Before version 2.10, the glibc implementation did not set I<errno> to B<EDOM> when a domain error occurred.
ru: До версии 2.10 в реализации glibc при возникновении ошибки области I<errno> не устанавливалось в значение B<EDOM>.

source: casin, casinf, casinl - complex arc sine
ru: casin, casinf, casinl - вычисляет комплексный арксинус

source: These functions calculate the complex arc sine of I<z>. If I<y\ =\ casin(z)>, then I<z\ =\ csin(y)>. The real part of I<y> is chosen in the interval [-pi/2,pi/2].
ru: Эти функции вычисляют синус комплексного числа I<z>. Если I<y\ =\ casin(z)>, то I<z\ =\ csin(y)>. Реальная часть I<y> лежит в интервале [-pi/2,pi/2].

source: cimag, cimagf, cimagl - get imaginary part of a complex number
ru: cimag, cimagf, cimagl - получение мнимой части комплексного числа

source: These functions return the imaginary part of the complex number I<z>.
ru: Эти функции возвращают мнимую часть комплексного числа I<z>.

source: gcc also supports __imag__. That is a GNU extension.
ru: gcc также поддерживает __imag__ Это расширение GNU.

source: confstr - get configuration dependent string variables
ru: confstr - получает строковые переменные конфигурации

source: B<confstr>() gets the value of configuration-dependent string variables.
ru: B<confstr>() получает значение строковой переменной, зависящей от конфигурации.

source: The I<name> argument is the system variable to be queried. The following variables are supported:
ru: Аргумент I<name> это название системной переменной, значение которой нужно получить. Поддерживаются следующие переменные:

source: B<_CS_GNU_LIBC_VERSION> (GNU C library only; since glibc 2.3.2)
ru: B<_CS_GNU_LIBC_VERSION> (только библиотека GNU C; начиная с glibc 2.3.2)

source: A string which identifies the GNU C library version on this system (e.g., "glibc 2.3.4").
ru: Строка с версией библиотеки GNU C в системе (например, «glibc 2.3.4»).

source: B<_CS_GNU_LIBPTHREAD_VERSION> (GNU C library only; since glibc 2.3.2)
ru: B<_CS_GNU_LIBPTHREAD_VERSION> (только библиотека GNU C; начиная с glibc 2.3.2)

source: A string which identifies the POSIX implementation supplied by this C library (e.g., "NPTL 2.3.4" or "linuxthreads-0.10").
ru: Строка, определяющая реализацию POSIX, которую предоставляет библиотека C (например, «NPTL 2.3.4» или «linuxthreads-0.10»).

source: A value for the B<PATH> variable which indicates where all the POSIX.2 standard utilities can be found.
ru: Значение переменной B<PATH>, в которой указывается где можно найти все утилиты стандарта POSIX.2.

source: If I<buf> is not NULL and I<len> is not zero, B<confstr>() copies the value of the string to I<buf> truncated to I<len - 1> bytes if necessary, with a null byte (\(aq\e0\(aq) as terminator. This can be detected by comparing the return value of B<confstr>() against I<len>.
ru: Если I<buf> не равно NULL и значение I<len> не равно нулю, то B<confstr>() копирует строку в I<buf>, укорачивая её до I<len - 1> байт, если это необходимо; также добавляет байт null (\(aq\e0\(aq) в конец строки. Это может быть обнаружено сравнением возвращённого B<confstr>() значения с I<len>.

source: If I<len> is zero and I<buf> is NULL, B<confstr>() just returns the value as defined below.
ru: Если I<len> равно нулю и I<buf> равно NULL, то B<confstr>() просто возвращает значение, как сказано ниже.

source: If I<name> is a valid configuration variable, B<confstr>() returns the number of bytes (including the terminating null byte) that would be required to hold the entire value of that variable. This value may be greater than I<len>, which means that the value in I<buf> is truncated.
ru: Если значение I<name> — корректная переменная настройки, то B<confstr>() возвращает количество байт (включая завершающий байт null), которое необходимо для хранения всего значения этой переменной. Это значение может быть больше I<len>, что означает, что значение в I<buf> обрезанное.

source: If I<name> is a valid configuration variable, but that variable does not have a value, then B<confstr>() returns 0. If I<name> does not correspond to a valid configuration variable, B<confstr>() returns 0, and I<errno> is set to B<EINVAL>.
ru: Если значение I<name> — корректная переменная настройки, но эта переменная не имеет значения, то B<confstr>() возвращает 0. Если значение I<name> не соответствует ни одной корректной переменной настройки, то B<confstr>() возвращает 0 и I<errno> устанавливается в B<EINVAL>.

source: The value of I<name> is invalid.
ru: Некорректное значение I<name>.

source: The following code fragment determines the path where to find the POSIX.2 system utilities:
ru: Следующий фрагмент кода определяет расположение всех системных утилит POSIX.2:

source: catanh, catanhf, catanhl - complex arc tangents hyperbolic
ru: catanh, catanhf, catanhl - вычисление комплексного гиперболического арктангенса

source: These functions calculate the complex arc hyperbolic tangent of I<z>. If I<y\ =\ catanh(z)>, then I<z\ =\ ctanh(y)>. The imaginary part of I<y> is chosen in the interval [-pi/2,pi/2].
ru: Эти функции вычисляют гиперболический арктангенс комплексного числа I<z>. Если I<y\ =\ catanh(z)>, то I<z\ =\ ctanh(y)>. Мнимая часть I<y> лежит в интервале [-pi/2,pi/2].

source: ccosh, ccoshf, ccoshl - complex hyperbolic cosine
ru: ccosh, ccoshf, ccoshl - вычисление комплексного гиперболического косинуса

source: These functions calculate the complex hyperbolic cosine of I<z>.
ru: Эти функции вычисляют комплексный гиперболический косинус I<z>.

source: The complex hyperbolic cosine function is defined as:
ru: Функция вычисления гиперболического косинуса комплексного числа определена формулой:

source: carg, cargf, cargl - calculate the complex argument
ru: carg, cargf, cargl - вычисляет комплексный аргумент

source: These functions calculate the complex argument (also called phase angle) of I<z>, with a branch cut along the negative real axis.
ru: Эти функции вычисляют комплексный аргумент (так называемый фазовый угол) I<z> с обрезанием ветви вдоль отрицательной действительной оси.

source: A complex number can be described by two real coordinates. One may use rectangular coordinates and gets
ru: Комплексное число может быть описано двумя действительными координатами. Для этого можно использовать прямоугольные координаты и получить

source: where I<x\ =\ creal(z)> and I<y\ =\ cimag(z)>.
ru: где I<x\ =\ creal(z)> и I<y\ =\ cimag(z)>.

source: Or one may use polar coordinates and gets
ru: Также можно использовать полярные координаты и получить
