Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: An IPC namespace provides an isolated view of System\ V IPC objects (see B<sysvipc>(7)) and (since Linux 2.6.30) POSIX message queues (see B<mq_overview>(7)). The common characteristic of these IPC mechanisms is that IPC objects are identified by mechanisms other than filesystem pathnames.
ru: Пространство имён IPC предоставляет изолированную выборку объектов System\ V IPC (смотрите B<sysvipc>(7)) и (начиная с Linux 2.6.30) очередей сообщений POSIX (смотрите B<mq_overview>(7)). Общие характеристики этих механизмов IPC в том, что объекты IPC определяются механизмами, а не путями в файловой системе.

source: Objects created in an IPC namespace are visible to all other processes that are members of that namespace, but are not visible to processes in other IPC namespaces.
ru: Объекты, созданные в пространстве имён IPC, видимы всем другим процессам, которые являются членами этого пространства имён, и невидимы процессам из других пространств имён IPC.

source: When an IPC namespace is destroyed (i.e., when the last process that is a member of the namespace terminates), all IPC objects in the namespace are automatically destroyed.
ru: При уничтожении пространства имён IPC (т.е., когда завершается последний процесс из этого пространства имён), все объекты IPC из пространства имён автоматически уничтожаются.

source: Only a privileged process (B<CAP_SYS_ADMIN>) can employ B<CLONE_NEWIPC>. This flag can't be specified in conjunction with B<CLONE_SYSVSEM>.
ru: Только привилегированный процесс (B<CAP_SYS_ADMIN>) может использовать B<CLONE_NEWIPC>. Этот флаг нельзя указывать вместе с B<CLONE_SYSVSEM>.

source: For further information on IPC namespaces, see B<namespaces>(7).
ru: Дополнительную информацию о пространствах имён IPC смотрите в B<namespaces>(7).

source: B<CLONE_NEWNET> (since Linux 2.6.24)
ru: B<CLONE_NEWNET> (начиная с Linux 2.6.24)

source: (The implementation of this flag was completed only by about kernel version 2.6.29.)
ru: (Реализация этого флага завершена только в Linux 2.6.29.)

source: If B<CLONE_NEWNET> is set, then create the process in a new network namespace. If this flag is not set, then (as with B<fork>(2)) the process is created in the same network namespace as the calling process. This flag is intended for the implementation of containers.
ru: Если задан флаг B<CLONE_NEWNET>, то процесс создаётся в новом сетевом пространстве имён. Если флаг не установлен, то (как и в B<fork>(2)), процесс создаётся в том же сетевом пространстве имён что и вызывающий процесс. Этот флаг предназначен для реализации контейнеров.

source: A network namespace provides an isolated view of the networking stack (network device interfaces, IPv4 and IPv6 protocol stacks, IP routing tables, firewall rules, the I</proc/net> and I</sys/class/net> directory trees, sockets, etc.). A physical network device can live in exactly one network namespace. A virtual network (B<veth>(4)) device pair provides a pipe-like abstraction that can be used to create tunnels between network namespaces, and can be used to create a bridge to a physical network device in another namespace.
ru: Сетевое пространство имён предоставляет изолированное представление сетевого стека (интерфейсы сетевых устройств, стеки протоколов IPv4 и IPv6, таблицы маршрутизации IP, правила межсетевого экрана, дерево каталогов I</proc/net> и I</sys/class/net>, сокеты и т. д.). Физическое сетевое устройство может находиться только в одном сетевом пространстве имён. Пара виртуальных сетевых устройств (B<veth>(4)) предоставляет похожую на канал абстракцию, которую можно использовать для создания туннелей между сетевыми пространствами имён и создания моста к физическому сетевому устройству из другого пространства имён.

source: When a network namespace is freed (i.e., when the last process in the namespace terminates), its physical network devices are moved back to the initial network namespace (not to the parent of the process). For further information on network namespaces, see B<namespaces>(7).
ru: Когда сетевое пространство имён высвобождается (т. е., когда завершается последний процесс в пространстве имён), его физические сетевые устройства перемещаются обратно в первоначальное сетевое пространство имён (не родительского процесса). Дополнительную информацию о сетевых пространствах имён смотрите в B<namespaces>(7).

source: Only a privileged process (B<CAP_SYS_ADMIN>) can employ B<CLONE_NEWNET>.
ru: Только привилегированный процесс (B<CAP_SYS_ADMIN>) может использовать B<CLONE_NEWNET>.

source: B<CLONE_NEWNS> (since Linux 2.4.19)
ru: B<CLONE_NEWNS> (начиная с Linux 2.4.19)

source: If B<CLONE_NEWNS> is set, the cloned child is started in a new mount namespace, initialized with a copy of the namespace of the parent. If B<CLONE_NEWNS> is not set, the child lives in the same mount namespace as the parent.
ru: Если указан флаг B<CLONE_NEWNS>, то клонированный потомок запускается в новом пространстве имён монтирования, инициализированном копией пространства имён родителя. Если B<CLONE_NEWNS> не указан, то потомок остаётся в том же пространстве имён монтирования что и родитель.

source: Only a privileged process (B<CAP_SYS_ADMIN>) can employ B<CLONE_NEWNS>. It is not permitted to specify both B<CLONE_NEWNS> and B<CLONE_FS> in the same B<clone>() call.
ru: Только привилегированный процесс (имеющий мандат B<CAP_SYS_ADMIN>) может использовать B<CLONE_NEWNS>. Не допускается совместное использование флагов B<CLONE_NEWNS> и B<CLONE_FS> в одном вызове B<clone>().

source: For further information on mount namespaces, see B<namespaces>(7) and B<mount_namespaces>(7).
ru: Дополнительную информацию о пространствах имён монтирования смотрите в B<namespaces>(7) и B<mount_namespaces>(7).

source: B<CLONE_NEWPID> (since Linux 2.6.24)
ru: B<CLONE_NEWPID> (начиная с Linux 2.6.24)

source: If B<CLONE_NEWPID> is set, then create the process in a new PID namespace. If this flag is not set, then (as with B<fork>(2)) the process is created in the same PID namespace as the calling process. This flag is intended for the implementation of containers.
ru: Если задан флаг B<CLONE_NEWPID>, то процесс создаётся в новом пространстве имён PID. Если флаг не установлен, то (как и в B<fork>(2)), процесс создаётся в том же пространстве имён PID, что и вызывающий процесс. Этот флаг предназначен для реализации контейнеров.

source: For further information on PID namespaces, see B<namespaces>(7) and B<pid_namespaces>(7).
ru: Дополнительную информацию о пространствах имён PID смотрите в B<namespaces>(7) и B<pid_namespaces>(7).

source: Only a privileged process (B<CAP_SYS_ADMIN>) can employ B<CLONE_NEWPID>. This flag can't be specified in conjunction with B<CLONE_THREAD> or B<CLONE_PARENT>.
ru: Только привилегированный процесс (B<CAP_SYS_ADMIN>) может использовать B<CLONE_NEWPID>. Этот флаг нельзя указывать вместе с B<CLONE_THREAD> или B<CLONE_PARENT>.

source: (This flag first became meaningful for B<clone>() in Linux 2.6.23, the current B<clone>() semantics were merged in Linux 3.5, and the final pieces to make the user namespaces completely usable were merged in Linux 3.8.)
ru: (Впервые этот флаг приобрёл значение для B<clone>() в Linux 2.6.23, текущая семантика B<clone>() появилась в Linux 3.5, а оставшиеся части, делающие пространства имён пользователя полностью работоспособными, включены в Linux 3.8.)

source: If B<CLONE_NEWUSER> is set, then create the process in a new user namespace. If this flag is not set, then (as with B<fork>(2)) the process is created in the same user namespace as the calling process.
ru: Если задан флаг B<CLONE_NEWUSER>, то процесс создаётся в новом пространстве имён пользователя. Если флаг не установлен, то (как и в B<fork>(2)), процесс создаётся в том же пространстве имён пользователя, что и вызывающий процесс.

source: Before Linux 3.8, use of B<CLONE_NEWUSER> required that the caller have three capabilities: B<CAP_SYS_ADMIN>, B<CAP_SETUID>, and B<CAP_SETGID>. Starting with Linux 3.8, no privileges are needed to create a user namespace.
ru: До Linux 3.8, для использования B<CLONE_NEWUSER> у вызывающего требовалось три мандата: B<CAP_SYS_ADMIN>, B<CAP_SETUID> и B<CAP_SETGID>. Начиная с Linux 3.8, для создания пространства имён пользователя никаких привилегий не требуется.

source: This flag can't be specified in conjunction with B<CLONE_THREAD> or B<CLONE_PARENT>. For security reasons, B<CLONE_NEWUSER> cannot be specified in conjunction with B<CLONE_FS>.
ru: Этот флаг нельзя указывать вместе с B<CLONE_THREAD> или B<CLONE_PARENT>. По соображениям безопасности, B<CLONE_NEWUSER> нельзя указывать вместе с B<CLONE_FS>.

source: For further information on user namespaces, see B<namespaces>(7) and B<user_namespaces>(7).
ru: Дополнительную информацию о пространствах имён пользователя смотрите в B<namespaces>(7) и B<user_namespaces>(7).

source: B<CLONE_NEWUTS> (since Linux 2.6.19)
ru: B<CLONE_NEWUTS> (начиная с Linux 2.6.19)

source: If B<CLONE_NEWUTS> is set, then create the process in a new UTS namespace, whose identifiers are initialized by duplicating the identifiers from the UTS namespace of the calling process. If this flag is not set, then (as with B<fork>(2)) the process is created in the same UTS namespace as the calling process. This flag is intended for the implementation of containers.
ru: Если задан флаг B<CLONE_NEWUTS>, то процесс создаётся в новом пространстве имён UTS, чьи идентификаторы инициализируются копией идентификаторов из пространства имён UTS вызывающего процесса. Если флаг не указан, то (как и в B<fork>(2)), процесс создаётся в том же пространстве имён UTS что и вызывающий процесс. Этот флаг предназначен для реализации контейнеров.

source: A UTS namespace is the set of identifiers returned by B<uname>(2); among these, the domain name and the hostname can be modified by B<setdomainname>(2) and B<sethostname>(2), respectively. Changes made to the identifiers in a UTS namespace are visible to all other processes in the same namespace, but are not visible to processes in other UTS namespaces.
ru: Пространство имён UTS — это набор идентификаторов, возвращаемых B<uname>(2); помимо остальных, сюда включены доменное имя и имя узла, которые изменить с помощью B<setdomainname>(2) и B<sethostname>(2), соответственно. Изменившиеся идентификаторы в пространстве имён UTS видимы всем остальным процессам в том же пространстве имён, но не видимы процессам из других пространств имён UTS.

source: Only a privileged process (B<CAP_SYS_ADMIN>) can employ B<CLONE_NEWUTS>.
ru: Только привилегированный процесс (B<CAP_SYS_ADMIN>) может использовать B<CLONE_NEWUTS>.

source: For further information on UTS namespaces, see B<namespaces>(7).
ru: Дополнительную информацию о пространствах имён UTS смотрите в B<namespaces>(7).

source: B<CLONE_PARENT> (since Linux 2.3.12)
ru: B<CLONE_PARENT> (начиная с Linux 2.3.12)

source: If B<CLONE_PARENT> is set, then the parent of the new child (as returned by B<getppid>(2)) will be the same as that of the calling process.
ru: Если задан флаг B<CLONE_PARENT>, то родитель нового потомка (возвращаемый B<getppid>(2)) будет таким же как и у вызывающего процесса.

source: If B<CLONE_PARENT> is not set, then (as with B<fork>(2)) the child's parent is the calling process.
ru: Если флаг B<CLONE_PARENT> не задан, то (как и в B<fork>(2)) родителем будет вызывающий процесс.

source: Note that it is the parent process, as returned by B<getppid>(2), which is signaled when the child terminates, so that if B<CLONE_PARENT> is set, then the parent of the calling process, rather than the calling process itself, will be signaled.
ru: Заметим, что это тот родительский процесс, который возвращается вызовом B<getppid>(2), и которому приходит сигнал когда потомок завершается, так что если указан флаг B<CLONE_PARENT>, то сигнал будет посылаться родителю вызывающего процесса, а не самому вызывающему процессу.

source: B<CLONE_PARENT_SETTID> (since Linux 2.5.49)
ru: B<CLONE_PARENT_SETTID> (начиная с Linux 2.5.49)

source: Store the child thread ID at the location I<ptid> in the parent's memory. (In Linux 2.5.32-2.5.48 there was a flag B<CLONE_SETTID> that did this.) The store operation completes before B<clone>() returns control to user space.
ru: Сохранить ID нити потомка, расположенный в I<ptid> в памяти родителя (в Linux 2.5.32-2.5.48 для этого использовался флаг B<CLONE_SETTID>). Операция сохранения завершается до возврата управления из B<clone>() в пользовательское пространство.

source: B<CLONE_PID> (Linux 2.0 to 2.5.15)
ru: B<CLONE_PID> (в Linux 2.0 по 2.5.15)

source: If B<CLONE_PID> is set, the child process is created with the same process ID as the calling process. This is good for hacking the system, but otherwise of not much use. From Linux 2.3.21 onward, this flag could be specified only by the system boot process (PID 0). The flag disappeared completely from the kernel sources in Linux 2.5.16. Since then, the kernel silently ignores this bit if it is specified in I<flags>.
ru: Если задан флаг B<CLONE_PID>, то процесс-потомок создаётся с таким же идентификатором процесса как у вызывающего процесса. Это хорошо для ковыряния в системе, но не более того. Начиная с 2.3.21 этот флаг может быть указан только у процесса загрузки системы (PID 0). Флаг полностью удалён из исходного кода в Linux 2.5.16. Начиная с этой версии, ядро просто игнорирует этот бит, если он установлен в I<flags>.

source: B<CLONE_PTRACE> (since Linux 2.2)
ru: B<CLONE_PTRACE> (начиная с Linux 2.2)

source: If B<CLONE_PTRACE> is specified, and the calling process is being traced, then trace the child also (see B<ptrace>(2)).
ru: Если задан флаг B<CLONE_PTRACE> и вызывающий процесс находится в режиме трассировки, то процесс-потомок также будет работать в режиме трассировки (см. B<ptrace>(2)).

source: B<CLONE_SETTLS> (since Linux 2.5.32)
ru: B<CLONE_SETTLS> (начиная с Linux 2.5.32)

source: The TLS (Thread Local Storage) descriptor is set to I<newtls>.
ru: Дескриптор TLS (локальная память нитей) помещается в I<newtls>.

source: The interpretation of I<newtls> and the resulting effect is architecture dependent. On x86, I<newtls> is interpreted as a I<struct user_desc\ *> (see B<set_thread_area>(2)). On x86-64 it is the new value to be set for the %fs base register (see the B<ARCH_SET_FS> argument to B<arch_prctl>(2)). On architectures with a dedicated TLS register, it is the new value of that register.
ru: Назначение I<newtls> и его влияние на результат зависит от архитектуры. На x86 I<newtls> рассматривается как I<struct user_desc\ *> (смотрите B<set_thread_area>(2)). На x86_64 это новое значение будет присвоено базовому регистру %fs (смотрите описание B<ARCH_SET_FS> в B<arch_prctl>(2)). На архитектурах с отдельным регистром для TLS это новое значение помещается в этот регистр.

source: B<CLONE_SIGHAND> (since Linux 2.0)
ru: B<CLONE_SIGHAND> (начиная с Linux 2.0)

source: If B<CLONE_SIGHAND> is set, the calling process and the child process share the same table of signal handlers. If the calling process or child process calls B<sigaction>(2) to change the behavior associated with a signal, the behavior is changed in the other process as well. However, the calling process and child processes still have distinct signal masks and sets of pending signals. So, one of them may block or unblock signals using B<sigprocmask>(2) without affecting the other process.
ru: Если задан флаг B<CLONE_SIGHAND>, то вызывающий процесс и процесс-потомок используют одну и ту же таблицу обработчиков сигналов. Если вызывающий процесс или процесс-потомок вызывают B<sigaction>(2) для изменения поведения при получении сигнала, то это поведение изменяется также и в другом процессе. Однако, вызывающий процесс и процесс-потомок имеют различные маски сигналов и списки ожидающих обработки сигналов. Так, один из них может блокировать или деблокировать сигналы, используя B<sigprocmask>(2), и это не будет влиять на другой процесс.

source: If B<CLONE_SIGHAND> is not set, the child process inherits a copy of the signal handlers of the calling process at the time B<clone>() is called. Calls to B<sigaction>(2) performed later by one of the processes have no effect on the other process.
ru: Если флаг B<CLONE_SIGHAND> не указан, то процесс-потомок наследует копию обработчиков событий вызывающего процесса, снятую на момент вызова B<clone>(). Вызовы B<sigaction>(2), выполняемые позже одним из процессов, не оказывают влияния на другой процесс.

source: Since Linux 2.6.0, I<flags> must also include B<CLONE_VM> if B<CLONE_SIGHAND> is specified
ru: Начиная с Linux 2.6.0, аргумент I<flags> должен также включать B<CLONE_VM>, если указан флаг B<CLONE_SIGHAND>

source: B<CLONE_STOPPED> (since Linux 2.6.0)
ru: B<CLONE_STOPPED> (начиная с Linux 2.6.0)

source: If B<CLONE_STOPPED> is set, then the child is initially stopped (as though it was sent a B<SIGSTOP> signal), and must be resumed by sending it a B<SIGCONT> signal.
ru: Если указан флаг B<CLONE_STOPPED>, то после создания потомок перейдёт в состояние останова (как если бы ему послали сигнал B<SIGSTOP>), и начнёт работу по сигналу B<SIGCONT>.

source: This flag was I<deprecated> from Linux 2.6.25 onward, and was I<removed> altogether in Linux 2.6.38. Since then, the kernel silently ignores it without error. Starting with Linux 4.6, the same bit was reused for the B<CLONE_NEWCGROUP> flag.
ru: Этот флаг I<устарел> начиная с Linux 2.6.25 и был I<удалён> в Linux 2.6.38. Начиная с этой версии, ядро просто игнорирует его без ошибки. Начиная с Linux 4.6 используемый под него бит используется для флага B<CLONE_NEWCGROUP>.

source: B<CLONE_SYSVSEM> (since Linux 2.5.10)
ru: B<CLONE_SYSVSEM> (начиная с Linux 2.5.10)

source: If B<CLONE_SYSVSEM> is set, then the child and the calling process share a single list of System V semaphore adjustment (I<semadj>) values (see B<semop>(2)). In this case, the shared list accumulates I<semadj> values across all processes sharing the list, and semaphore adjustments are performed only when the last process that is sharing the list terminates (or ceases sharing the list using B<unshare>(2)). If this flag is not set, then the child has a separate I<semadj> list that is initially empty.
ru: Если указан флаг B<CLONE_SYSVSEM>, то потомок и вызывающий процесс будут иметь общий единый список значений регулировки семафоров System V (I<semadj>) (смотрите B<semop>(2)). В этом случае общий список накапливает значения I<semadj> из общего списка процессов и регулировки семафоров выполняются только когда завершается последний процесс, использующий общий список (или перестаёт пользоваться общим списком с помощью B<unshare>(2)). Если этот флаг не указан, то потомок имеет отдельный список I<semadj>, который первоначально пуст.

source: B<CLONE_THREAD> (since Linux 2.4.0)
ru: B<CLONE_THREAD> (начиная с Linux 2.4.0)

source: If B<CLONE_THREAD> is set, the child is placed in the same thread group as the calling process. To make the remainder of the discussion of B<CLONE_THREAD> more readable, the term "thread" is used to refer to the processes within a thread group.
ru: Если указан флаг B<CLONE_THREAD>, то потомок размещается в той же группе нитей, что и вызывающий процесс. Чтобы сделать остаток обсуждения B<CLONE_THREAD> более понятным, термин «нить» используется для ссылки на процессы внутри группы нитей.

source: Thread groups were a feature added in Linux 2.4 to support the POSIX threads notion of a set of threads that share a single PID. Internally, this shared PID is the so-called thread group identifier (TGID) for the thread group. Since Linux 2.4, calls to B<getpid>(2) return the TGID of the caller.
ru: Группы нитей были добавлены в Linux 2.4 для поддержки нитей POSIX, описываемых как набор нитей, использующих один и тот же PID. Внутренне общий PID — это так называемый идентификатор группы нитей (TGID). Начиная с Linux 2.4, вызов B<getpid>(2) возвращает идентификатор группы нитей вызывающего процесса.

source: The threads within a group can be distinguished by their (system-wide) unique thread IDs (TID). A new thread's TID is available as the function result returned to the caller of B<clone>(), and a thread can obtain its own TID using B<gettid>(2).
ru: Внутри группы нити можно различать по их (глобальному) уникальному идентификатору нити (TID). TID новой нити возвращается вызывающему как результат B<clone>(), а нить может узнать свой TID с помощью вызова B<gettid>(2).

source: When a call is made to B<clone>() without specifying B<CLONE_THREAD>, then the resulting thread is placed in a new thread group whose TGID is the same as the thread's TID. This thread is the I<leader> of the new thread group.
ru: Когда вызов B<clone>() делается без B<CLONE_THREAD>, то получаемая нить помещается в новую группу нитей, чей TGID совпадает с TID нити. Эта нить будет I<лидером> новой группы нитей.

source: A new thread created with B<CLONE_THREAD> has the same parent process as the caller of B<clone>() (i.e., like B<CLONE_PARENT>), so that calls to B<getppid>(2) return the same value for all of the threads in a thread group. When a B<CLONE_THREAD> thread terminates, the thread that created it using B<clone>() is not sent a B<SIGCHLD> (or other termination) signal; nor can the status of such a thread be obtained using B<wait>(2). (The thread is said to be I<detached>.)
ru: Новая нить, созданная с B<CLONE_THREAD>, имеет тот же родительский процесс что и вызвавший B<clone>() (т.е., как B<CLONE_PARENT>), поэтому при вызове B<getppid>(2) возвращается одинаковое значение для всех нитей в группе нитей. Когда нить B<CLONE_THREAD> завершается, нити, создавшей её с помощью B<clone>(), не посылается сигнал B<SIGCHLD> (или другой сигнал завершения); состояние такой нити нельзя получить с помощью B<wait>(2). Про нить говорят, что она I<отсоединена> (detached).

source: After all of the threads in a thread group terminate the parent process of the thread group is sent a B<SIGCHLD> (or other termination) signal.
ru: После завершения работы всех нитей в группе нитей родительскому процессу группы нитей посылается сигнал B<SIGCHLD> (или другой завершающий сигнал).

source: If any of the threads in a thread group performs an B<execve>(2), then all threads other than the thread group leader are terminated, and the new program is executed in the thread group leader.
ru: Если в любой из нитей группы нитей выполняется вызов B<execve>(2), то все нити отличные от лидера группы нитей, завершаются и выполняется новая программы в лидере группы нитей.

source: If one of the threads in a thread group creates a child using B<fork>(2), then any thread in the group can B<wait>(2) for that child.
ru: Если одна из нитей группы нитей создаёт потомка с помощью B<fork>(2), то любая нить группы может вызвать B<wait>(2) для ожидания этого потомка.

source: Since Linux 2.5.35, I<flags> must also include B<CLONE_SIGHAND> if B<CLONE_THREAD> is specified (and note that, since Linux 2.6.0, B<CLONE_SIGHAND> also requires B<CLONE_VM> to be included).
ru: Начиная с Linux 2.5.35, аргумент I<flags> должен также включать B<CLONE_SIGHAND>, если указан флаг B<CLONE_THREAD> (также заметим, что начиная с Linux 2.6.0, для B<CLONE_SIGHAND> также требуется включать B<CLONE_VM>).

source: Signal dispositions and actions are process-wide: if an unhandled signal is delivered to a thread, then it will affect (terminate, stop, continue, be ignored in) all members of the thread group.
ru: Расположение и действия сигналов распространяются на весь процесс: если необработанный сигнал доставляется нити, то это влияет (завершение, остановка, продолжение, игнорирование) на все члены группы нитей.

source: Each thread has its own signal mask, as set by B<sigprocmask>(2).
ru: Каждая нить имеет свою маску сигналов, задаваемую B<sigprocmask>(2).
