Repository: linux-kernel-man-pages-l10n/linux-kernel-man-pages-l10n
Catalog: translations/files_c/*.po
Languages: ru

source: Saved set-user-ID and saved set-group-ID. These IDs are used in set-user-ID and set-group-ID programs to save a copy of the corresponding effective IDs that were set when the program was executed (see B<execve>(2)). A set-user-ID program can assume and drop privileges by switching its effective user ID back and forth between the values in its real user ID and saved set-user-ID. This switching is done via calls to B<seteuid>(2), B<setreuid>(2), or B<setresuid>(2). A set-group-ID program performs the analogous tasks using B<setegid>(2), B<setregid>(2), or B<setresgid>(2). A process can obtain its saved set-user-ID (set-group-ID) using B<getresuid>(2) (B<getresgid>(2)).
ru: Сохранённые set-user-ID и set-group-ID. Эти ID используются в программах с set-user-ID и set-group-ID битами для сохранения копии соответствующих эффективных ID, которые были установлены в момент запуска программы (смотрите B<execve>(2)). Программа с set-user-ID может повышать и понижать права, переключая свой ID эффективного пользователя туда и обратно между значениями её ID реального пользователя и сохранённым set-user-ID. Такое переключение производится с помощью вызовов B<seteuid>(2), B<setreuid>(2) или B<setresuid>(2). Программа с set-group-ID выполняет аналогичные задачи с помощью B<setegid>(2), B<setregid>(2) или B<setresgid>(2). Сохранённый set-user-ID (set-group-ID) процесса можно получить с помощью B<getresuid>(2) (B<getresgid>(2)).

source: Filesystem user ID and filesystem group ID (Linux-specific). These IDs, in conjunction with the supplementary group IDs described below, are used to determine permissions for accessing files; see B<path_resolution>(7) for details. Whenever a process's effective user (group) ID is changed, the kernel also automatically changes the filesystem user (group) ID to the same value. Consequently, the filesystem IDs normally have the same values as the corresponding effective ID, and the semantics for file-permission checks are thus the same on Linux as on other UNIX systems. The filesystem IDs can be made to differ from the effective IDs by calling B<setfsuid>(2) and B<setfsgid>(2).
ru: ID пользователя файловой системы и ID группы файловой системы (есть только в Linux). Эти ID, совместно с ID дополнительных групп (supplementary group), описанных ниже, используются для определения прав доступа к файлам; подробней смотрите B<path_resolution>(7). Каждый раз при изменении ID эффективного пользователя (группы) ядро также автоматически изменяет ID пользователя (группы) файловой системы на то же значение. Следовательно, ID файловой системы, обычно, равны соответствующим эффективным ID, а семантика проверки прав доступа к файлам в Linux такая же как и у других систем UNIX. ID файловой системы можно сделать отличным от эффективных ID с помощью вызова B<setfsuid>(2) и B<setfsgid>(2).

source: Supplementary group IDs. This is a set of additional group IDs that are used for permission checks when accessing files and other shared resources. On Linux kernels before 2.6.4, a process can be a member of up to 32 supplementary groups; since kernel 2.6.4, a process can be a member of up to 65536 supplementary groups. The call I<sysconf(_SC_NGROUPS_MAX)> can be used to determine the number of supplementary groups of which a process may be a member. A process can obtain its set of supplementary group IDs using B<getgroups>(2), and can modify the set using B<setgroups>(2).
ru: ID дополнительных групп (supplementary group). Определяет ID добавочных групп, которые используются при проверке доступа к файлам и другим общим ресурсам. В ядрах Linux до версии 2.6.4 процесс может быть членом 32 дополнительных групп; начиная с версии 2.6.4 процесс может быть членом 65536 дополнительных групп. В помощью вызова I<sysconf(_SC_NGROUPS_MAX)> можно узнать количество дополнительных групп, в которых процесс может быть членом. Процесс может получить список ID дополнительных групп с помощь B<getgroups>(2), и изменить этот список с помощью B<setgroups>(2).

source: A child process created by B<fork>(2) inherits copies of its parent's user and groups IDs. During an B<execve>(2), a process's real user and group ID and supplementary group IDs are preserved; the effective and saved set IDs may be changed, as described in B<execve>(2).
ru: Дочерний процесс, созданный B<fork>(2), наследует копии ID пользователя и группы своего предка. При B<execve>(2) сохраняются ID реального пользователя и группы процесса, а также ID дополнительных групп; эффективный и сохранённый ID могут измениться (описано в B<execve>(2)).

source: Aside from the purposes noted above, a process's user IDs are also employed in a number of other contexts:
ru: Кроме целей, отмеченных выше, идентификаторы пользователя процесса также используются:

source: when determining the permissions for sending signals (see B<kill>(2));
ru: при определении права на отправку сигналов (смотрите B<kill>(2));

source: when determining the permissions for setting process-scheduling parameters (nice value, real time scheduling policy and priority, CPU affinity, I/O priority) using B<setpriority>(2), B<sched_setaffinity>(2), B<sched_setscheduler>(2), B<sched_setparam>(2), B<sched_setattr>(2), and B<ioprio_set>(2);
ru: при определении права на установку параметров планировщика процесса (значение уступчивости, политика и приоритет планирования в реальном времени, увязывание ЦП, приоритет ввода-вывода) с помощью B<setpriority>(2), B<sched_setaffinity>(2), B<sched_setscheduler>(2), B<sched_setparam>(2), B<sched_setattr>(2) и B<ioprio_set>(2);

source: when checking resource limits (see B<getrlimit>(2));
ru: при проверке ограничения по ресурсам (смотрите B<getrlimit>(2));

source: when checking the limit on the number of inotify instances that the process may create (see B<inotify>(7)).
ru: при проверке ограничения на количество экземпляров inotify, которые процесс может создать (смотрите B<inotify>(7)).

source: Process IDs, parent process IDs, process group IDs, and session IDs are specified in POSIX.1. The real, effective, and saved set user and groups IDs, and the supplementary group IDs, are specified in POSIX.1. The filesystem user and group IDs are a Linux extension.
ru: ID процесса, ID родительского процесса, ID группы процессов и ID сеанса определены в POSIX.1. ID реального, эффективного и сохранённого пользователя и группы, а также ID дополнительных групп определены в POSIX.1. ID пользователя и группы файловой системы являются расширением Linux.

source: Various fields in the I</proc/[pid]/status> file show the process credentials described above. See B<proc>(5) for further information.
ru: Различные поля в файле I</proc/[pid]/status> отражают идентификаторы процесса, описанные выше. Подробности смотрите в B<proc>(5).

source: The POSIX threads specification requires that credentials are shared by all of the threads in a process. However, at the kernel level, Linux maintains separate user and group credentials for each thread. The NPTL threading implementation does some work to ensure that any change to user or group credentials (e.g., calls to B<setuid>(2), B<setresuid>(2)) is carried through to all of the POSIX threads in a process. See B<nptl>(7) for further details.
ru: Согласно спецификации на нити POSIX требуется, чтобы идентификаторы были одинаковыми у всех нитей процесса. Однако на уровне ядра в Linux ведутся отдельные идентификаторы пользователя и группы для каждой нити. Реализация нитей NPTL выполняет дополнительные действия, чтобы любое изменение идентификаторов пользователя и группы (например, с помощью B<setuid>(2), B<setresuid>(2)) отражалось на всех нитях POSIX процесса. Дополнительную информацию смотрите в B<nptl>(7).

source: cp1252 - CP\ 1252 character set encoded in octal, decimal, and hexadecimal
ru: cp1252 - набор символов CP\ 1252 в восьмеричном, десятичном и шестнадцатеричном виде

source: The Windows Code Pages include several 8-bit extensions to the ASCII character set (also known as ISO 646-IRV). CP\ 1252 encodes the characters used in many West European languages.
ru: В страницы кодов Windows включены некоторые 8-битные расширения набора символов ASCII (также известного как ISO 646-IRV). В CP\ 1252 кодируются символы, используемые во многих западно-европейских письменностях.

source: CP\ 1252 characters
ru: Символы CP\ 1252

source: The following table displays the characters in CP\ 1252 that are printable and unlisted in the B<ascii>(7) manual page.
ru: В следующей таблице показаны символы из набора CP\ 1252, являющиеся печатными и отсутствующие в справочной странице B<ascii>(7).

source: LATIN SMALL LETTER F WITH HOOK
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «F» С НЁБНЫМ КРЮЧКОМ

source: MODIFIER LETTER CIRCUMFLEX ACCENT
ru: МОДИФИКАТОР БУКВЫ ШЛЯПА, УДАРЕНИЕ

source: LATIN CAPITAL LETTER S WITH CARON
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «S» С ГАЛОЧКОЙ

source: LATIN CAPITAL LIGATURE OE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ ЛИГАТУРА «OE»

source: LATIN CAPITAL LETTER Z WITH CARON
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «Z» С ГАЛОЧКОЙ

source: SMALL TILDE
ru: МАЛАЯ ТИЛЬДА

source: LATIN SMALL LETTER S WITH CARON
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «S» С ГАЛОЧКОЙ

source: LATIN SMALL LIGATURE OE
ru: ЛАТИНСКАЯ СТРОЧНАЯ ЛИГАТУРА «OE»

source: LATIN SMALL LETTER Z WITH CARON
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «Z» С ГАЛОЧКОЙ

source: LATIN CAPITAL LETTER Y WITH DIAERESIS
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «Y» С УМЛЯУТОМ

source: INVERTED EXCLAMATION MARK
ru: ПЕРЕВЁРНУТЫЙ ВОСКЛИЦАТЕЛЬНЫЙ ЗНАК

source: CENT SIGN
ru: ЗНАК ЦЕНТА

source: POUND SIGN
ru: ЗНАК ФУНТА

source: YEN SIGN
ru: ЗНАК ИЕНЫ

source: DIAERESIS
ru: УМЛЯУТ

source: FEMININE ORDINAL INDICATOR
ru: ПОРЯДКОВЫЙ ИНДИКАТОР (ЖЕНСКИЙ РОД)

source: MACRON
ru: МАКРОН

source: SUPERSCRIPT TWO
ru: ЦИФРА ДВА ВВЕРХУ МЕЛКИМ ШРИФТОМ

source: SUPERSCRIPT THREE
ru: ЦИФРА ТРИ ВВЕРХУ МЕЛКИМ ШРИФТОМ

source: ACUTE ACCENT
ru: ОСТРОЕ УДАРЕНИЕ

source: CEDILLA
ru: СЕДИЛЬ

source: SUPERSCRIPT ONE
ru: ЦИФРА ОДИН ВВЕРХУ МЕЛКИМ ШРИФТОМ

source: MASCULINE ORDINAL INDICATOR
ru: ПОРЯДКОВЫЙ ИНДИКАТОР (МУЖСКОЙ РОД)

source: VULGAR FRACTION ONE QUARTER
ru: ДРОБЬ ОДНА ЧЕТВЁРТАЯ

source: VULGAR FRACTION ONE HALF
ru: ДРОБЬ ОДНА ВТОРАЯ

source: VULGAR FRACTION THREE QUARTERS
ru: ДРОБЬ ТРИ ЧЕТВЁРТЫХ

source: INVERTED QUESTION MARK
ru: ПЕРЕВЁРНУТЫЙ ВОПРОСИТЕЛЬНЫЙ ЗНАК

source: LATIN CAPITAL LETTER A WITH GRAVE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «A» С ГРАВИСОМ

source: LATIN CAPITAL LETTER A WITH ACUTE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «A» С АКУТОМ

source: LATIN CAPITAL LETTER A WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «A» СО ШЛЯПОЙ

source: LATIN CAPITAL LETTER A WITH TILDE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «A» С ТИЛЬДОЙ

source: LATIN CAPITAL LETTER A WITH DIAERESIS
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «A» С УМЛЯУТОМ

source: LATIN CAPITAL LETTER A WITH RING ABOVE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «A» С КРУЖОЧКОМ СВЕРХУ

source: LATIN CAPITAL LETTER AE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «AE»

source: LATIN CAPITAL LETTER C WITH CEDILLA
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «C» С СЕДИЛЬЮ

source: LATIN CAPITAL LETTER E WITH GRAVE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «E» С ГРАВИСОМ

source: LATIN CAPITAL LETTER E WITH ACUTE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «E» C АКУТОМ

source: LATIN CAPITAL LETTER E WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «E» СО ШЛЯПОЙ

source: LATIN CAPITAL LETTER E WITH DIAERESIS
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «E» С УМЛЯУТОМ

source: LATIN CAPITAL LETTER I WITH GRAVE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «I» С ГРАВИСОМ

source: LATIN CAPITAL LETTER I WITH ACUTE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «I» С АКУТОМ

source: LATIN CAPITAL LETTER I WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «I» СО ШЛЯПОЙ

source: LATIN CAPITAL LETTER I WITH DIAERESIS
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «I» С УМЛЯУТОМ

source: LATIN CAPITAL LETTER ETH
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «ETH»

source: LATIN CAPITAL LETTER N WITH TILDE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «N» С ТИЛЬДОЙ

source: LATIN CAPITAL LETTER O WITH GRAVE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «O» С ГРАВИСОМ

source: LATIN CAPITAL LETTER O WITH ACUTE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «O» С АКУТОМ

source: LATIN CAPITAL LETTER O WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «O» СО ШЛЯПОЙ

source: LATIN CAPITAL LETTER O WITH TILDE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «O» С ТИЛЬДОЙ

source: LATIN CAPITAL LETTER O WITH DIAERESIS
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «O» С УМЛЯУТОМ

source: MULTIPLICATION SIGN
ru: ЗНАК УМНОЖЕНИЯ

source: LATIN CAPITAL LETTER O WITH STROKE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «O» СО ШТРИХОМ

source: LATIN CAPITAL LETTER U WITH GRAVE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «U» С ГРАВИСОМ

source: LATIN CAPITAL LETTER U WITH ACUTE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «U» С АКУТОМ

source: LATIN CAPITAL LETTER U WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «U» СО ШЛЯПОЙ

source: LATIN CAPITAL LETTER U WITH DIAERESIS
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «U» С УМЛЯУТОМ

source: LATIN CAPITAL LETTER Y WITH ACUTE
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «Y» С АКУТОМ

source: LATIN CAPITAL LETTER THORN
ru: ЛАТИНСКАЯ ЗАГЛАВНАЯ БУКВА «THORN», рус «ТОРН»

source: LATIN SMALL LETTER SHARP S
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА ОСТРАЯ «S»

source: LATIN SMALL LETTER A WITH GRAVE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «A» С ГРАВИСОМ

source: LATIN SMALL LETTER A WITH ACUTE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «A» С АКУТОМ

source: LATIN SMALL LETTER A WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «A» СО ШЛЯПОЙ

source: LATIN SMALL LETTER A WITH TILDE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «A» С ТИЛЬДОЙ

source: LATIN SMALL LETTER A WITH DIAERESIS
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «A» С УМЛЯУТОМ

source: LATIN SMALL LETTER A WITH RING ABOVE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «A» С КРУЖОЧКОМ СВЕРХУ

source: LATIN SMALL LETTER AE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «AE»

source: LATIN SMALL LETTER C WITH CEDILLA
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «C» С СЕДИЛЬЮ

source: LATIN SMALL LETTER E WITH GRAVE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «E» С ГРАВИСОМ

source: LATIN SMALL LETTER E WITH ACUTE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «E» С АКУТОМ

source: LATIN SMALL LETTER E WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «E» СО ШЛЯПОЙ

source: LATIN SMALL LETTER E WITH DIAERESIS
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «E» С УМЛЯУТОМ

source: LATIN SMALL LETTER I WITH GRAVE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «I» С ГРАВИСОМ

source: LATIN SMALL LETTER I WITH ACUTE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «I» С АКУТОМ

source: LATIN SMALL LETTER I WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «I» СО ШЛЯПОЙ

source: LATIN SMALL LETTER I WITH DIAERESIS
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «I» С УМЛЯУТОМ

source: LATIN SMALL LETTER ETH
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «ETH»

source: LATIN SMALL LETTER N WITH TILDE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «N» С ТИЛЬДОЙ

source: LATIN SMALL LETTER O WITH GRAVE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «O» С ГРАВИСОМ

source: LATIN SMALL LETTER O WITH ACUTE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «O» С АКУТОМ

source: LATIN SMALL LETTER O WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «O» СО ШЛЯПОЙ

source: LATIN SMALL LETTER O WITH TILDE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «O» С ТИЛЬДОЙ

source: LATIN SMALL LETTER O WITH DIAERESIS
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «O» С УМЛЯУТОМ

source: DIVISION SIGN
ru: ЗНАК ДЕЛЕНИЯ

source: LATIN SMALL LETTER O WITH STROKE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА O СО ШТРИХОМ

source: LATIN SMALL LETTER U WITH GRAVE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «U» С ГРАВИСОМ

source: LATIN SMALL LETTER U WITH ACUTE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «U» С АКУТОМ

source: LATIN SMALL LETTER U WITH CIRCUMFLEX
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «U» СО ШЛЯПОЙ

source: LATIN SMALL LETTER U WITH DIAERESIS
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «U» С УМЛЯУТОМ

source: LATIN SMALL LETTER Y WITH ACUTE
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «Y» С АКУТОМ

source: LATIN SMALL LETTER THORN
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «THORN», рус. «ТОРН»

source: LATIN SMALL LETTER Y WITH DIAERESIS
ru: ЛАТИНСКАЯ СТРОЧНАЯ БУКВА «Y» С УМЛЯУТОМ

source: CP\ 1252 is also known as Windows-1252.
ru: CP\ 1252 также известна как Windows-1252.

source: capabilities - overview of Linux capabilities
ru: capabilities - обзор мандатов Linux

source: For the purpose of performing permission checks, traditional UNIX implementations distinguish two categories of processes: I<privileged> processes (whose effective user ID is 0, referred to as superuser or root), and I<unprivileged> processes (whose effective UID is nonzero). Privileged processes bypass all kernel permission checks, while unprivileged processes are subject to full permission checking based on the process's credentials (usually: effective UID, effective GID, and supplementary group list).
ru: Для выполнения проверки прав доступа в обычных реализациях UNIX процессы разделяют на две категории: I<привилегированные> (ID эффективного пользователя равен 0, как у суперпользователя или root), и I<не привилегированные> (ID эффективного пользователя не равен нулю). Для привилегированных процессов все проверки прав в ядре не выполняются, а для не привилегированных процессов выполняется полная проверка на основе мандатов процесса (обычно, эффективного UID, эффективного GID и списка дополнительных групп).

source: Starting with kernel 2.2, Linux divides the privileges traditionally associated with superuser into distinct units, known as I<capabilities>, which can be independently enabled and disabled. Capabilities are a per-thread attribute.
ru: В ядре Linux начиная с версии 2.2, все привилегии, обычно связываемые с суперпользователем, разделены на несколько частей, называемых I<мандатами> (capabilities), которые можно разрешать и запрещать независимо друг от друга. Мандаты являются атрибутом нити.

source: Capabilities list
ru: Список мандатов

source: The following list shows the capabilities implemented on Linux, and the operations or behaviors that each capability permits:
ru: В следующим списке показаны мандаты, реализованные в Linux, а также операции или поведение, которые эти мандаты разрешают:

source: B<CAP_AUDIT_CONTROL> (since Linux 2.6.11)
ru: B<CAP_AUDIT_CONTROL> (начиная с Linux 2.6.11)

source: Enable and disable kernel auditing; change auditing filter rules; retrieve auditing status and filtering rules.
ru: Позволяет включать или выключать аудит ядра; изменять фильтрующие правила аудита; получать состояние аудита и фильтрующие правила.

source: B<CAP_AUDIT_READ> (since Linux 3.16)
ru: B<CAP_AUDIT_READ> (начиная с Linux 3.16)

source: Allow reading the audit log via a multicast netlink socket.
ru: Позволяет читать протокол аудита через многоадресный сокет netlink.

source: B<CAP_AUDIT_WRITE> (since Linux 2.6.11)
ru: B<CAP_AUDIT_WRITE> (начиная с Linux 2.6.11)

source: Write records to kernel auditing log.
ru: Позволяет записывать данные в журнал аудита ядра.

source: B<CAP_BLOCK_SUSPEND> (since Linux 3.5)
ru: B<CAP_BLOCK_SUSPEND> (начиная с Linux 3.5)

source: Employ features that can block system suspend (B<epoll>(7) B<EPOLLWAKEUP>, I</proc/sys/wake_lock>).
ru: Позволяет использовать возможности, которые могут приводить к блокированию приостановки системы (B<epoll>(7) B<EPOLLWAKEUP>, I</proc/sys/wake_lock>).

source: Make arbitrary changes to file UIDs and GIDs (see B<chown>(2)).
ru: Позволяет выполнять произвольные изменения файловых UID и GID (смотрите B<chown>(2)).

source: Bypass file read, write, and execute permission checks. (DAC is an abbreviation of "discretionary access control".)
ru: Позволяет пропускать проверки доступа к файлу на чтение, запись и выполнение (DAC (discretionary access control) — избирательный контроль доступа).

source: Bypass file read permission checks and directory read and execute permission checks;
ru: Позволяет пропускать проверки доступа к файлу на чтение и доступа к каталогу на чтение и выполнение;

source: invoke B<open_by_handle_at>(2);
ru: Позволяет вызывать B<open_by_handle_at>(2);

source: use the B<linkat>(2) B<AT_EMPTY_PATH> flag to create a link to a file referred to by a file descriptor.
ru: Позволяет использовать B<linkat>(2) с флагом B<AT_EMPTY_PATH> для создания ссылки на файл, заданным файловым дескриптором.

source: Bypass permission checks on operations that normally require the filesystem UID of the process to match the UID of the file (e.g., B<chmod>(2), B<utime>(2)), excluding those operations covered by B<CAP_DAC_OVERRIDE> and B<CAP_DAC_READ_SEARCH>;
ru: Позволяет пропускать проверки доступа для операций, которые обычно требуют совпадения UID файловой системы процесса и UID файла (например, B<chmod>(2), B<utime>(2)), исключая операции, охватываемые B<CAP_DAC_OVERRIDE> и B<CAP_DAC_READ_SEARCH>;

source: set inode flags (see B<ioctl_iflags>(2)) on arbitrary files;
ru: Позволяет изменять флаги иноды (смотрите B<ioctl_iflags>(2)) у произвольных файлов;

source: set Access Control Lists (ACLs) on arbitrary files;
ru: Позволяет устанавливать списки контроля доступа (ACL) произвольных файлов;

source: ignore directory sticky bit on file deletion;
ru: Позволяет игнорировать закрепляющий бит при удалении файла;

source: modify I<user> extended attributes on sticky directory owned by any user;
ru: Позволяет изменять расширенные I<пользовательские> атрибуты закреплённого каталога, принадлежащего любому пользователю;

source: specify B<O_NOATIME> for arbitrary files in B<open>(2) and B<fcntl>(2).
ru: Позволяет задавать B<O_NOATIME> для произвольных файлов в B<open>(2) и B<fcntl>(2).

source: Don't clear set-user-ID and set-group-ID mode bits when a file is modified;
ru: Позволяет не очищать биты режима set-user-ID и set-group-ID при изменении файла;

source: set the set-group-ID bit for a file whose GID does not match the filesystem or any of the supplementary GIDs of the calling process.
ru: Позволяет устанавливать бит set-group-ID на файл, у которого GID не совпадает с битом файловой системы или любыми дополнительными GID вызывающего процесса.

source: Lock memory (B<mlock>(2), B<mlockall>(2), B<mmap>(2), B<shmctl>(2)).
ru: Позволяет блокировать память (B<mlock>(2), B<mlockall>(2), B<mmap>(2), B<shmctl>(2)).

source: Bypass permission checks for operations on System V IPC objects.
ru: Позволяет не выполнять проверки доступа для операций с объектами System V IPC.

source: Bypass permission checks for sending signals (see B<kill>(2)). This includes use of the B<ioctl>(2) B<KDSIGACCEPT> operation.
ru: Позволяет не выполнять проверки при отправке сигналов (смотрите B<kill>(2)). Сюда относится использование B<ioctl>(2) с операцией B<KDSIGACCEPT>.

source: B<CAP_LEASE> (since Linux 2.4)
ru: B<CAP_LEASE> (начиная с Linux 2.4)

source: Establish leases on arbitrary files (see B<fcntl>(2)).
ru: Позволяет устанавливать аренду на произвольные файлы (смотрите B<fcntl>(2)).

source: Set the B<FS_APPEND_FL> and B<FS_IMMUTABLE_FL> inode flags (see B<ioctl_iflags>(2)).
ru: Позволяет устанавливать флаги иноды B<FS_APPEND_FL> и B<FS_IMMUTABLE_FL> (смотрите B<ioctl_iflags>(2)).

source: B<CAP_MAC_ADMIN> (since Linux 2.6.25)
ru: B<CAP_MAC_ADMIN> (начиная с Linux 2.6.25)

source: Allow MAC configuration or state changes. Implemented for the Smack Linux Security Module (LSM).
ru: Разрешает изменять настройку MAC или состояние. Реализован в Smack Linux Security Module (LSM).

source: B<CAP_MAC_OVERRIDE> (since Linux 2.6.25)
ru: B<CAP_MAC_OVERRIDE> (начиная с Linux 2.6.25)

source: Override Mandatory Access Control (MAC). Implemented for the Smack LSM.
ru: Позволяет замещать мандатный контроль доступа (MAC). Реализован в Smack LSM.

source: B<CAP_MKNOD> (since Linux 2.4)
ru: B<CAP_MKNOD> (начиная с Linux 2.4)

source: Create special files using B<mknod>(2).
ru: Позволяет создавать специальные файлы с помощью B<mknod>(2).

source: Perform various network-related operations:
ru: Позволяет выполнять различные сетевые операции:

source: interface configuration;
ru: настройку интерфейса;

source: administration of IP firewall, masquerading, and accounting;
ru: управление IP МЭ, трансляцией адресов и ведением учёта;

source: modify routing tables;
ru: изменять таблицы маршрутизации;
